{
    "title": "Older men getting offended at younger women wanting financial help",
    "post_id": "a9iu30",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/a9iu30/older_men_getting_offended_at_younger_women/",
    "author": null,
    "body": "Occasionally I have been faced with the awkward situation of being asked if I am/have ever been a sugar baby by a vanilla man 2x my age (or older) that finds me attractive. When I say yes these men will have a snarky comment or degrading reply. But I also don't understand why a 19-25 year old woman with decent self esteem would want to engage in a relationship with a man significantly older than her that does not want to at least take her on a nice date when she can find a much younger guy (that is less financially stable) that has no contribution other than sex. Usually these men have no problem asking for sexual favors. Opinions as to why this is a thing? ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/a9iu30/older_men_getting_offended_at_younger_women/",
    "score": 105,
    "upvote_ratio": 0.9,
    "created_utc": 1545776115.0,
    "num_comments": 77,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I'm a client/SD, and I agree with you.  As a young, attractive woman, the world is your oyster.  Absent other incentives, why would you choose an older, less physically attractive man over a hotter man closer to your age?  \n\nThe men who denigrate you are just trying to game you.  The hope is that you're naive enough that you'll buy their line, and choose to have sex with them for less than they would pay for the services of an escort.  \n\n",
            "author": "cat-gun",
            "id": "ecjsyy7",
            "parent_id": "t3_a9iu30",
            "score": 81,
            "created_utc": 1545779662.0,
            "replies": [
                {
                    "body": "I think you hit the nail on the head! Also the ones that ask for naked pics and get mad when you send them your cashapp$ ID make me giggle. ",
                    "author": null,
                    "id": "ecjuoa5",
                    "parent_id": "t1_ecjsyy7",
                    "score": 45,
                    "created_utc": 1545780898.0,
                    "replies": [
                        {
                            "body": "Might add to SB profile   \n\nDon't bring a McDonald's budget to a 5 Star restaurant and expect success ",
                            "author": "pinotandsugar",
                            "id": "eclrs4b",
                            "parent_id": "t1_ecjuoa5",
                            "score": 10,
                            "created_utc": 1545852383.0,
                            "replies": [
                                {
                                    "body": ">Don't bring a McDonald's budget to a 5 Star restaurant and expect success\n\nI absolutely love this and might be quoting it in the future haha",
                                    "author": "artysugarbabe",
                                    "id": "eogw7s7",
                                    "parent_id": "t1_eclrs4b",
                                    "score": 2,
                                    "created_utc": 1558567123.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It’s all a transaction. The should are wrong to be cheap financially. Just like I’d expect the SB to go along with the sexual things I wanted, and would move on if she didn’t. ",
                            "author": "Texas_Rangers",
                            "id": "eck5cvr",
                            "parent_id": "t1_ecjuoa5",
                            "score": 4,
                            "created_utc": 1545788966.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I am 42, look 10 years younger, all of 6 feet tall, weigh in at 183 lbs, 18 percent body fat. I would also say I am rich, educated, cultured and a global citizen. \n\n90% of my SBs are 27 to 33 years old. Some of them lied about their ages especially those over 30. They claimed they were 27. They have shared the profiles of their ex vanilla lovers and despite these girls being so attractive these vanilla dudes are anything but. Lots of fat boys, short boys, skinny guys with thick glasses, nerdy ones etc. Plus most were older than me and enormously less successful compared to me. Some were outright loser artists and musicians. One guy made all of 35k as a 44 year old and lived in the projects with his mom. Fantastic indeed!\n\nAnother thing these ladies have on the site and outside claimed they like older men vs younger boys. Really!? If they do, why do they want the older man to pay them to date them.\n\nWhen they are with me, I treat them to royalty. 2 days back I took my current Latina SB out to dinner to Eleven Madison in NYC. Tonight having a date at another upscale place in Manhattan. That’s quite routine on top of trips abroad and 5 star living. \n\nDespite all this I still pay them cash. A ppm is always there at the end of the date.\n\nWhy? Just because I can let them go anytime I want. With cash I can date whoever I want and faster. Cash puts a solid boundary on what they can expect and what not. I am not seeking their love or affection just their company although half of my SBs have asked me if I wanted an LTR. NOPE. If I wanted that I would seek it elsewhere. There is no shortage of educated, cultured women who belong to solid backgrounds who can fill that void. Those are LTR material. You don’t seek or find them on seeking. \n\nSo there are reasons why men should pay cash. I don’t make an effort to treat my SBs to a good life, I just live a good life. They join in. I let them go when I get bored or very busy. Thanks to the cash! No hard feelings, thanks to the cash. No stalking or drama post break up, thanks to the cash. Simple. \n\nSBs, you deserve to get paid but think twice when you claim you “like older men” and then belittle them on this forum for them being ugly.",
                    "author": null,
                    "id": "eckyupp",
                    "parent_id": "t1_ecjsyy7",
                    "score": -8,
                    "created_utc": 1545827099.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ecm523o",
                            "parent_id": "t1_eckyupp",
                            "score": 12,
                            "created_utc": 1545862427.0,
                            "replies": [
                                {
                                    "body": "Ms Escort, How does my post let you judge my self esteem? I am simply sharing facts about my experiences. I like paid company and the bowl is good for that. I pay them to go the hell away. If I wanted LTRs, there are other places to seek cultured women from solid backgrounds. The bowl is no place to seek that. What makes you all insecure about a post from a solid confident rich guy?",
                                    "author": null,
                                    "id": "ecm98xg",
                                    "parent_id": "t1_ecm523o",
                                    "score": 0,
                                    "created_utc": 1545865540.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ecmsik2",
                                            "parent_id": "t1_ecm98xg",
                                            "score": 9,
                                            "created_utc": 1545881405.0,
                                            "replies": [
                                                {
                                                    "body": "Ms Escort, This thread was willfully designed to put down the “old” men in the lifestyle. They are being called ugly, disgusting etc. There are so many posts like that here. Frankly it seems it’s intimidating to you to hear from a younger confident guy who says it like it is. Truth can be bitter as you can see.",
                                                    "author": null,
                                                    "id": "ecnityr",
                                                    "parent_id": "t1_ecmsik2",
                                                    "score": -2,
                                                    "created_utc": 1545914368.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because they are delusional about their attractiveness and it hurts their ego that a hot woman would only be with them for money. Why would I want to date a broke 60 year old???????\n\n&#x200B;\n\nMen have no problem asking for sex, women shouldn't feel ashamed to ask for something in return.",
            "author": null,
            "id": "ecjrjdo",
            "parent_id": "t3_a9iu30",
            "score": 86,
            "created_utc": 1545778561.0,
            "replies": [
                {
                    "body": "I've always wondered that. A man will straight up ask if you want to fuck and then get their panties in a bunch when the woman asks for nail money. lol ",
                    "author": null,
                    "id": "ecjuzgy",
                    "parent_id": "t1_ecjrjdo",
                    "score": 46,
                    "created_utc": 1545781112.0,
                    "replies": []
                },
                {
                    "body": "A good example is Scott Adams, the wealthy creator of Dilbert. He is ~~approaching 70~~ 61 and his “girlfriend” is the stunning [Kristina Basham](https://imgur.com/a/aG2Zq23). About ~~45~~ 31 years his younger. \n\nHe claims they just have good chemistry and she’s not with him for money. \n\nThough he does treat her very well. Vacations to Park City, Utah, and Hawaii. \n\nedit: added picture\n\nedit2: 31 years, not 45. I don't fault Scott for dating Kristina. I mean she is absolutely stunning. If I was 60, wealthy and single, I'd try to date her too. ",
                    "author": "Texas_Rangers",
                    "id": "eck55yq",
                    "parent_id": "t1_ecjrjdo",
                    "score": 7,
                    "created_utc": 1545788788.0,
                    "replies": [
                        {
                            "body": "Google says he's actually 60 and she's 30 lol, not quite the geriatric/ youngster coupling you paint. They're also not together anymore, SR's don't tend to last that long I guess...",
                            "author": "blonde-throwaway",
                            "id": "ecm1aid",
                            "parent_id": "t1_eck55yq",
                            "score": 4,
                            "created_utc": 1545859580.0,
                            "replies": [
                                {
                                    "body": "she's 29 years old\n\nSo you're telling me this [supermodel](https://imgur.com/a/VfWITfS) is dating a 60 year old man for pure love? ",
                                    "author": "Texas_Rangers",
                                    "id": "ecm1olu",
                                    "parent_id": "t1_ecm1aid",
                                    "score": 4,
                                    "created_utc": 1545859877.0,
                                    "replies": [
                                        {
                                            "body": "Oh, of course not! But he's not so hideous that there may not be *some* attraction there. A 30 year age gap is not unheard of, 45 is crazy.\n\nBut yes, if he was poor he'd be dating someone his own age and she'd be with another rich guy.",
                                            "author": "blonde-throwaway",
                                            "id": "ecm242f",
                                            "parent_id": "t1_ecm1olu",
                                            "score": 5,
                                            "created_utc": 1545860201.0,
                                            "replies": [
                                                {
                                                    "body": "Trust me, I want to be able to do exactly what Scott is doing at his age, and seeing beautiful women. It's true that women are often attracted to older men. \n\nI don't fault Scott at all for wanting to be with her. And also I was a little incorrect about the ages, so appreciate the correction. ",
                                                    "author": "Texas_Rangers",
                                                    "id": "ecm2f2l",
                                                    "parent_id": "t1_ecm242f",
                                                    "score": 1,
                                                    "created_utc": 1545860421.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
                                                            "author": "blonde-throwaway",
                                                            "id": "ecm4jt6",
                                                            "parent_id": "t1_ecm2f2l",
                                                            "score": 10,
                                                            "created_utc": 1545862045.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Love of ?",
                                            "author": "pinotandsugar",
                                            "id": "ecp0p4e",
                                            "parent_id": "t1_ecm1olu",
                                            "score": 1,
                                            "created_utc": 1545956641.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Sorry to comment twice, but wanted to make sure you saw [this stunning picture of Kristina](https://imgur.com/a/aG2Zq23) too. \n\nI mean she's absolutely stunning, and I don't blame Scott for wanting to date her at all. \n\nI just find a hard time believing she would date him if he were poor. ",
                                    "author": "Texas_Rangers",
                                    "id": "ecm1u44",
                                    "parent_id": "t1_ecm1aid",
                                    "score": -1,
                                    "created_utc": 1545859992.0,
                                    "replies": [
                                        {
                                            "body": "Btw, she's photoshopped *the hell* out of that picture. She's pretty yeah, but you probably wouldn't recognise the girl if she walked past you irl. Check out Instagram vs reality for some insight into pictures like that.",
                                            "author": "blonde-throwaway",
                                            "id": "ecm4dxu",
                                            "parent_id": "t1_ecm1u44",
                                            "score": 6,
                                            "created_utc": 1545861909.0,
                                            "replies": [
                                                {
                                                    "body": "Sure I agree. It did looked a little shipped. But she’s stunning with huge breasts. ",
                                                    "author": "Texas_Rangers",
                                                    "id": "ecmjm83",
                                                    "parent_id": "t1_ecm4dxu",
                                                    "score": 0,
                                                    "created_utc": 1545873467.0,
                                                    "replies": [
                                                        {
                                                            "body": "Anyone can buy those boobs like she did haha.",
                                                            "author": "blonde-throwaway",
                                                            "id": "ecn4ewx",
                                                            "parent_id": "t1_ecmjm83",
                                                            "score": 5,
                                                            "created_utc": 1545893674.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
                                                            "author": "SDRippington",
                                                            "id": "ecmr5n9",
                                                            "parent_id": "t1_ecmjm83",
                                                            "score": 1,
                                                            "created_utc": 1545880294.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                                                                    "author": "Texas_Rangers",
                                                                    "id": "ecmrroq",
                                                                    "parent_id": "t1_ecmr5n9",
                                                                    "score": 2,
                                                                    "created_utc": 1545880796.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "She's his sugarbaby.",
                            "author": null,
                            "id": "eckupqx",
                            "parent_id": "t1_eck55yq",
                            "score": 7,
                            "created_utc": 1545820254.0,
                            "replies": []
                        },
                        {
                            "body": "> she’s not with him for money\n\nHaha-That's a laugh.See if Kristina stayed around id Scotty suddenly lost his fortune.",
                            "author": "GSSD",
                            "id": "ecl36gg",
                            "parent_id": "t1_eck55yq",
                            "score": 4,
                            "created_utc": 1545832542.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a thing because they are jealous!! \n\nJealous of you for getting “paid for sex” (that’s how they see it, at least) \n\nAnd jealous of the SDs for being about to afford you ;)",
            "author": "thesluttypet",
            "id": "ecjvzpw",
            "parent_id": "t3_a9iu30",
            "score": 27,
            "created_utc": 1545781827.0,
            "replies": [
                {
                    "body": "There are male SBs they should try their luck ik the bowl. LOL. You make a good point it could all be jealousy",
                    "author": "plussizefairy",
                    "id": "ecktt44",
                    "parent_id": "t1_ecjvzpw",
                    "score": 1,
                    "created_utc": 1545818846.0,
                    "replies": [
                        {
                            "body": "Hahaha. I just checked this account first time in a while... I like your idea of them trying out the SB side, since they clearly seem jealous of it!!\n\n (I bet at least 95% of their snarky bitching is jealousy)",
                            "author": "thesluttypet",
                            "id": "eg5vjep",
                            "parent_id": "t1_ecktt44",
                            "score": 2,
                            "created_utc": 1549817001.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because: \n\n1) they can't pay for it, therefore jealous\n\n2) are actually douchelords. The amount of time I've seen guys complain \"women who have to make money on their backs aren't even people, you can't even call it a \"job\", anyone can do it, it's so easy\" and *also* \"I wouldn't date a former sugar baby or escort, they're all going to have emotional baggage and be damaged goods\" in the *same breath* are absolutely astounding. Which is it dude? It's \"easy\", or it causes mental damage??? It can't be both at the same time lmao. \n\nDecent self esteem = I know how to get paid for things I would regularly do. But to these idiot salty red pill kings, decent self esteem means being quiet when they say or do something offensive because you can \"take a joke\", not wearing makeup (even though unless you're wearing insta makeup 90% of them can't tell), and never ever complaining about your feelings. So you know, basically a blow up doll. \n\nWhich is what I recommend for them when I speak to them. Their standards are completely reasonable for women....provided she's about 4 feet long and made of plastic. ",
            "author": "2catsandacomputer",
            "id": "eckd020",
            "parent_id": "t3_a9iu30",
            "score": 28,
            "created_utc": 1545795978.0,
            "replies": [
                {
                    "body": "cats are certainly on the prowl this evening \n\nhad to go to the source for this \n\nUrban Dictionary: douchelord\nhttps://www.urbandictionary.com/define.php?term=douchelord\n1.Person/s that demonstrates all the qualities of being a douche so well, they could in fact be a deity among douches. 2.The lord and messiah of all douches.\n\nI particularly appreciated the last   \" 2.The lord and messiah of all douches.\"",
                    "author": "pinotandsugar",
                    "id": "eckooqo",
                    "parent_id": "t1_eckd020",
                    "score": 2,
                    "created_utc": 1545810328.0,
                    "replies": [
                        {
                            "body": "I have never actually heard anyone else use the term, but I am so happy there's a UD for it. Spot on. ",
                            "author": "2catsandacomputer",
                            "id": "eckp5m4",
                            "parent_id": "t1_eckooqo",
                            "score": 5,
                            "created_utc": 1545811064.0,
                            "replies": [
                                {
                                    "body": "I had never heard it used and like to check before opening my mouth. ",
                                    "author": "pinotandsugar",
                                    "id": "eckpbh6",
                                    "parent_id": "t1_eckp5m4",
                                    "score": 1,
                                    "created_utc": 1545811320.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lots of easy things cause mental damage.\n\nI agree that guys hating on prostitutes are douchebags tho",
                    "author": "HowardRobardHughesJr",
                    "id": "eckie43",
                    "parent_id": "t1_eckd020",
                    "score": 1,
                    "created_utc": 1545801573.0,
                    "replies": [
                        {
                            "body": "Such as? They make it sounds like it's pencil sharpening kind of easy. ",
                            "author": "2catsandacomputer",
                            "id": "eckiy7l",
                            "parent_id": "t1_eckie43",
                            "score": 4,
                            "created_utc": 1545802278.0,
                            "replies": [
                                {
                                    "body": "Such as eating bad food and not exercising, etc -- easy but harmful and causes mental damage",
                                    "author": "HowardRobardHughesJr",
                                    "id": "eckrgs6",
                                    "parent_id": "t1_eckiy7l",
                                    "score": 1,
                                    "created_utc": 1545814855.0,
                                    "replies": [
                                        {
                                            "body": "I highly doubt any person would actually say that they wouldn't date someone who was previously overweight but isn't now, or someone who didn't exercise and does now because the latter was easy and those behaviors are *so* mentally damaging that the person is now damaged goods. Come on now.",
                                            "author": "2catsandacomputer",
                                            "id": "eckrl3t",
                                            "parent_id": "t1_eckrgs6",
                                            "score": 10,
                                            "created_utc": 1545815060.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If someone on Seeking / SA asks you if you are or have been a sugar baby, I think you should reply, \"I don't know what you're talking about. I've never heard the term (sugar baby) before. Explain to me what that is.\"",
            "author": "highfructoseSD",
            "id": "eck5foi",
            "parent_id": "t3_a9iu30",
            "score": 11,
            "created_utc": 1545789039.0,
            "replies": [
                {
                    "body": "Naw .........  the simple answer is simply     click..........\n\nMostly a matter of semantics  \n\nI think  \"Have you had a prior arrangement \"  is an acceptable question ONCE you have established some common interest.  \n\nIt's even more important that it be asked of potential SDs ",
                    "author": "pinotandsugar",
                    "id": "eckoupc",
                    "parent_id": "t1_eck5foi",
                    "score": 2,
                    "created_utc": 1545810585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ecjpwf1",
            "parent_id": "t3_a9iu30",
            "score": 56,
            "created_utc": 1545777337.0,
            "replies": [
                {
                    "body": "My favorite is men in their 50s/60s “but I feel like I’m 30”.  LMAO.  And I feel like Beyoncé.  Doesn’t make it true.",
                    "author": "milliondollarkitty",
                    "id": "eckkmwo",
                    "parent_id": "t1_ecjpwf1",
                    "score": 27,
                    "created_utc": 1545804407.0,
                    "replies": []
                },
                {
                    "body": "Good idea with the unmatching! ",
                    "author": null,
                    "id": "ecjv4h2",
                    "parent_id": "t1_ecjpwf1",
                    "score": 18,
                    "created_utc": 1545781209.0,
                    "replies": []
                },
                {
                    "body": "Facts!!!!",
                    "author": "underwhelmedhuman",
                    "id": "ecp5dka",
                    "parent_id": "t1_ecjpwf1",
                    "score": 1,
                    "created_utc": 1545960782.0,
                    "replies": []
                },
                {
                    "body": "I get plenty of younger women on tinder that match with me that aren't looking for something.  Just because you want something from them out of it, there are others that don't.  You shouldn't really fault them for what their desires are.  If it isn't a match then it isn't, just move on.",
                    "author": "ThisIsTheSugarDaddy",
                    "id": "eck248v",
                    "parent_id": "t1_ecjpwf1",
                    "score": -9,
                    "created_utc": 1545786276.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eck3k3b",
                            "parent_id": "t1_eck248v",
                            "score": 15,
                            "created_utc": 1545787351.0,
                            "replies": [
                                {
                                    "body": "I think you have the right to be frustrated on a site like seeking if they play dumb about the Financial aspect. Maybe not on tinder though. Stranger things happen. I personally like the allowance, it sets boundaries for both of us ",
                                    "author": "AussieSD",
                                    "id": "eckls1n",
                                    "parent_id": "t1_eck3k3b",
                                    "score": 4,
                                    "created_utc": 1545806075.0,
                                    "replies": []
                                },
                                {
                                    "body": "In your own words from a previous post of yours, you make no sense.  His response actually disproves your point.  Learn the difference. ",
                                    "author": "houstonsd",
                                    "id": "eck4f4n",
                                    "parent_id": "t1_eck3k3b",
                                    "score": 0,
                                    "created_utc": 1545788115.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eck4tis",
                                            "parent_id": "t1_eck4f4n",
                                            "score": 22,
                                            "created_utc": 1545788471.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eck931c",
                                                    "parent_id": "t1_eck4tis",
                                                    "score": 14,
                                                    "created_utc": 1545792439.0,
                                                    "replies": [
                                                        {
                                                            "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
                                                            "author": "houstonsd",
                                                            "id": "eckilv5",
                                                            "parent_id": "t1_eck931c",
                                                            "score": -3,
                                                            "created_utc": 1545801846.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "How is it delusional if he is dating a younger woman and there is no financial compensation?   The only answer is that he isn’t delusional and therefore completely disproves your point.  \n\nIt sounds like you’re extrapolating a conclusion.  Just because he is a sugar daddy doesn’t mean that all his dates are sugar related.   I don’t know him nor his situation so I can’t verify that.  \n\nBut I can speak for me and my situation and that is that I date vanilla.   My vanilla ages range from early 20’s to mid 50’s.    But, I also sugar and I do so for my own reasons. Vanilla and sugar are not mutually exclusive.   ",
                                                    "author": "houstonsd",
                                                    "id": "eck75bk",
                                                    "parent_id": "t1_eck4tis",
                                                    "score": 0,
                                                    "created_utc": 1545790635.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Tinder is not SA. Why are women looking\nfor paid relationships there? What’s next? Match and eharmony also being a haven for paid dating!",
                                                    "author": null,
                                                    "id": "ecl06f0",
                                                    "parent_id": "t1_eck4tis",
                                                    "score": 1,
                                                    "created_utc": 1545829061.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I don't think I proved (or disproved) any point of yours?? Maybe I'm missing something...  Could you elaborate for me?\n\nI've had more than one relationship with a woman in her early 20's simply because she appreciates who I am and what I am about.  Although I am in my late 30's and not 2x their age.  The most recent was a 23 year old that was starting a similar career track that got me to where I am at today.  She appreciated my insight, feedback, and mentoring.  She also appreciated that  we could go out and do things together and it wasn't uncomfortable for her, since the majority of her friends were not making the same money she makes (\\~$115k/yr when we met, and \\~$155k/yr after my mentoring her).    She was wise beyond her years, and we had a lot of fun spending time together.  You could say she got some value out of our relationship with my experience and mentoring.\n\n&#x200B;\n\nI've also had tinder women (all ages), want something from me, that I was not willing to participate in.\n\n&#x200B;\n\nI think late 20's to mid 30's is my ideal age range.  21 is the minimum (legally able to go out for a drink is a hard requirement of mine), and most early 20's are very immature (not all, and I don't only judge based on number).",
                                    "author": "ThisIsTheSugarDaddy",
                                    "id": "eck4o3o",
                                    "parent_id": "t1_eck3k3b",
                                    "score": -8,
                                    "created_utc": 1545788341.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eck62hz",
                    "parent_id": "t1_ecjpwf1",
                    "score": -14,
                    "created_utc": 1545789623.0,
                    "replies": []
                },
                {
                    "body": "Are you kidding? Men of all ages prefer 18-22 year old women and under 30 if not that. It doesn’t change when the man ages. ",
                    "author": "Texas_Rangers",
                    "id": "eee6h57",
                    "parent_id": "t1_ecjpwf1",
                    "score": -1,
                    "created_utc": 1547851713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cheap ugly men are snarky 🤷🏻‍♀️",
            "author": "QueenBumbleBrii",
            "id": "ecjzuuf",
            "parent_id": "t3_a9iu30",
            "score": 23,
            "created_utc": 1545784559.0,
            "replies": []
        },
        {
            "body": "In other words,  without  $$$, SD gets no kitty, lol ;)  I am okay with that ;) ",
            "author": "Jakcoll",
            "id": "eckdirs",
            "parent_id": "t3_a9iu30",
            "score": 9,
            "created_utc": 1545796453.0,
            "replies": [
                {
                    "body": "Without some form of tangible reward it is not an arrangement......",
                    "author": "pinotandsugar",
                    "id": "eckoxe0",
                    "parent_id": "t1_eckdirs",
                    "score": 7,
                    "created_utc": 1545810699.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean everyone wants more for less so I understand why they'll get offended when you ask for financial help. \n\nAlthough, if it's such an issue for them, than maybe they shouldn't go for the 18-25 range because all they're going to want is something in exchange for their time. That's normal. \n\n",
            "author": null,
            "id": "eckm3sy",
            "parent_id": "t3_a9iu30",
            "score": 7,
            "created_utc": 1545806601.0,
            "replies": []
        },
        {
            "body": "They sexualize us\nWe make money off of it\nThey’re butthurt",
            "author": "Naynayshanay",
            "id": "eckyloo",
            "parent_id": "t3_a9iu30",
            "score": 9,
            "created_utc": 1545826658.0,
            "replies": []
        },
        {
            "body": "there is a lot of hypocrisy out there and this is an example \n\nalso it is hard for old guys to accept that they are no longer so physically attractive \n\nsuggest you respectfully decline to answer any questions about your past life, period",
            "author": "doctorcoolpop",
            "id": "ecjwaqw",
            "parent_id": "t3_a9iu30",
            "score": 14,
            "created_utc": 1545782039.0,
            "replies": []
        },
        {
            "body": "Straw man argument. People say all kinds of stupid shit. Why should we defend what these guys are supposedly saying?  Ask them directly if you really care what they think. ",
            "author": "sd_90210",
            "id": "ecjoo5r",
            "parent_id": "t3_a9iu30",
            "score": 12,
            "created_utc": 1545776396.0,
            "replies": [
                {
                    "body": "Great point. I've just been noticing a lot of slut shaming and manipulation. ",
                    "author": null,
                    "id": "ecjpvwg",
                    "parent_id": "t1_ecjoo5r",
                    "score": 15,
                    "created_utc": 1545777325.0,
                    "replies": [
                        {
                            "body": "Just look for the ones like me who adore \"experienced\" women. \n\nThere's shaming from the other side of things, too. People are always judgy about the unconventional or what they decide they can stir up co-indignation about. It helps them feel validated.\n\nHappens plenty here as well!",
                            "author": null,
                            "id": "ecjqw1d",
                            "parent_id": "t1_ecjpvwg",
                            "score": 4,
                            "created_utc": 1545778072.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They are chicken The whole lots of them\nAlways asking for pics or sex favours but when you ask for compensation they call you sexist terms. \nA woman who knows the worth and puts value on herself/her time is scary to these guys. They might just have to step up to the plate. ",
            "author": "plussizefairy",
            "id": "ecktnuo",
            "parent_id": "t3_a9iu30",
            "score": 10,
            "created_utc": 1545818625.0,
            "replies": []
        },
        {
            "body": "How are these situations happening? I’ve never been asked that before. And if they did ask me that I would tell them it’s none of their business.",
            "author": "MsDReid",
            "id": "ecjpph6",
            "parent_id": "t3_a9iu30",
            "score": 3,
            "created_utc": 1545777187.0,
            "replies": [
                {
                    "body": "It’s on tinder not SA",
                    "author": "AussieSD",
                    "id": "ecklu54",
                    "parent_id": "t1_ecjpph6",
                    "score": 1,
                    "created_utc": 1545806170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m making the assumption that you are meeting these men on Tinder - which is an app used for hook ups. Non-sugar hookups. So, more than likely, these 60-year-old men are trying to figure out IF you are a sugar baby on a site meant for HOOKUPS without sugar. They don’t want to provide an allowance and are looking for a normal gal. \n\nIf you’re on SA - I have no insight - because I’ve never had this happen. ",
            "author": null,
            "id": "ecjv15j",
            "parent_id": "t3_a9iu30",
            "score": 1,
            "created_utc": 1545781145.0,
            "replies": [
                {
                    "body": "Why would a 60 yo want a 19 year old anyways? If they want a normal gal maybe they should stay in their age category. ",
                    "author": null,
                    "id": "ecjyr3i",
                    "parent_id": "t1_ecjv15j",
                    "score": 21,
                    "created_utc": 1545783785.0,
                    "replies": [
                        {
                            "body": "Check out this piece by one of the founders of OKCupid: https://jezebel.com/mens-favorite-ages-are-20-21-22-and-23-a-data-dive-1731660984\n\nThere's [one particular graph](https://i.kinja-img.com/gawker-media/image/upload/1439100617563564204.jpg) you'll cringe at. Essentialy, men of all ages find women who are 20-21 years old most attractive, at least in photos. \n\nA 60-year-old wants a 19-year-old for the same reason a 20-year-old wants a 19-year-old -- or perhaps even more reasons.  \n\n",
                            "author": "ContriteSplendaDaddy",
                            "id": "eckvmjn",
                            "parent_id": "t1_ecjyr3i",
                            "score": 1,
                            "created_utc": 1545821575.0,
                            "replies": [
                                {
                                    "body": "No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years. It's the same reason most women are attracted to tall, lean or muscular men, even when the individual may be a total douche. It's all about the survival of our offspring. \n\nWe may want to deny the animal, but it's still alive in our biology. ",
                                    "author": null,
                                    "id": "ecl35qa",
                                    "parent_id": "t1_eckvmjn",
                                    "score": 2,
                                    "created_utc": 1545832520.0,
                                    "replies": [
                                        {
                                            "body": "> No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years.\n\nYou won't be able to argue this point successfully with anyone offering an opposing view based on merit, as every statement that attempts to contradict this is just someone acting butt-hurt. \n\nBiology ultimately will always be misinterpreted as misogyny. \n\nPut simply, as a man, the better looking you are, the less money you have to pay to overcome anyone else's \"ick\" factor in order to have sex with them.  ",
                                            "author": "SDRippington",
                                            "id": "eclyu03",
                                            "parent_id": "t1_ecl35qa",
                                            "score": 4,
                                            "created_utc": 1545857708.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Luckily for many of us, father-daughter bonding leads some women to be attracted to \"dad bods\" too. Sometimes this bonding is unhealthy, but I'm pretty sure even healthy relationships lead to this too. Women often seek out men like their fathers. ",
                                            "author": "ContriteSplendaDaddy",
                                            "id": "eclztoc",
                                            "parent_id": "t1_ecl35qa",
                                            "score": 0,
                                            "created_utc": 1545858461.0,
                                            "replies": [
                                                {
                                                    "body": "I don't believe there are very many women who, offered the choice between Danny Devito and Chris Evans, all other factors being equal, would choose Mr Devito!\n\nThankfully all other factors are not equal, including the availability of specimens like Mr Evans. ",
                                                    "author": null,
                                                    "id": "ecm1waf",
                                                    "parent_id": "t1_eclztoc",
                                                    "score": 2,
                                                    "created_utc": 1545860038.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You're being rhetorical, right? Simple biology and the desire to \"recapture youth\". \n\nPersonally my personal preference is always 25+ no matter how old I get because frankly, under that age the flakiness and lack of mental and emotional maturity is just way too high - but feel free to ask that same silly question once you hit your late forties to early fifties, okay? \n",
                            "author": "SDRippington",
                            "id": "ecly9pz",
                            "parent_id": "t1_ecjyr3i",
                            "score": 1,
                            "created_utc": 1545857296.0,
                            "replies": [
                                {
                                    "body": "Older people seeking younger people should not be bitter about providing financial compensation. Whether it's a 20 year old and a 60 year old or a 30 year old and 60 year old. What are you mad about? ",
                                    "author": null,
                                    "id": "eclz6oh",
                                    "parent_id": "t1_ecly9pz",
                                    "score": 3,
                                    "created_utc": 1545857975.0,
                                    "replies": [
                                        {
                                            "body": "I'm not mad at anything.\n\nI'm more of a \"gender role\" kind of old fashioned guy anyway. As a man, I pay for dates and courting in the vanilla world - and I help financially whomever I am in a committed relationship with - whether it's vanilla or sugar and regardless of age. I offer what I can and help her to be as enabled for success as possible - whether it's school, work, whatever. \n\nYou asked a very simple question - _\"Why would a 60 yo want a 19 year old anyways?\"_ and I answered it. Basic biology. It doesn't need to really go any further than that. But I will point out two things:\n\n* Tinder is a hookup site. You cannot nor should you make any judgement calls as to whether a person on Tinder (regardless of age) is willing to pay money or not. You're using Tinder at that point just like a drug \"off label\". If you don't like the results, don't complain - just move on.  I can accept people bitching about this on \"Seeking\" or other sugar-based sites. But Tinder? Nope. If people are delusional - let them have their delusion and move on.\n\n* So older people seeing older people should just be \"cool\" about the finance thing, because hey, they're dating in their bracket? What kind of ageist bullshit is that? LMAO!\n\nI'll say this out loud - Personally if a 20 year old woman is with a 22 year old dude that has no direction, drive or would rather kick back with his bro's and smoke a blunt rather than \"be everything he can\" and help the woman financially as a part of being in a relationship? And she puts up with this bullshit?! Then the 20 year old woman is an idiot and she gets what she asked for and gets zero sympathy from me.  \n\nAnd I still find it utterly amusing that so many women on this forum find it incomprehensible that there are, in fact, early twenties women who actually LIKE to be with much older guys irrespective of what financial help they receive. Interestingly enough I find this to happen more often than successful guys paying for platonic relationships - at least based on _personal_ experience. \n\nTotal number of under-28 yo women that choose to be a fuck-buddy for whatever reason and who don't want and refuse \"payment\" beyond the \"date\" itself? Five.\n\nTotal number of \"platonic\" relationships I have paid for? Zero.\n\nAgain, that is just me. I cannot speak for anyone else :-)",
                                            "author": "SDRippington",
                                            "id": "ecm0m2c",
                                            "parent_id": "t1_eclz6oh",
                                            "score": 0,
                                            "created_utc": 1545859065.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Definitely encountered this on SA. lol this is a thing ",
                    "author": null,
                    "id": "ecjyo7i",
                    "parent_id": "t1_ecjv15j",
                    "score": 8,
                    "created_utc": 1545783729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ecjp4q4",
            "parent_id": "t3_a9iu30",
            "score": 1,
            "created_utc": 1545776747.0,
            "replies": [
                {
                    "body": "I'm not a newbie and I have a steady SD now. However, during my searching stages I would definitely run into these kinds of men. There were plenty of salt SDs that ask this on SA. I'm thinking even with vanilla dating, there are maturely aged men who fantasize about being with a 18-21 year old without expecting her to ask for help. Idk dating is weird.  ",
                    "author": null,
                    "id": "ecjpsx8",
                    "parent_id": "t1_ecjp4q4",
                    "score": 12,
                    "created_utc": 1545777260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you have gotten past the second email exchange or first phone conversation without verifying that they are indeed prepared to provide an allowance if you are both interested in a relationship the fault is yours not theirs. \n\nAlso the basic rule that the sugar is received before walking into the bedroom or POF (panties on floor).  \n\nFailing to follow these simple rules is like drinking a bottle of whiskey and trying to drive 100 mph on Sunset Blvd and wondering why there was a bad outcome. \n\nSadly the number of women who start relationships thinking only of what they might get or what they \"deserve\" is what has precipitated men signing up for SA in the hopes of getting deception sex. ",
            "author": "pinotandsugar",
            "id": "ecjs516",
            "parent_id": "t3_a9iu30",
            "score": -3,
            "created_utc": 1545779019.0,
            "replies": [
                {
                    "body": "I feel  bad for SD's that get scammed online :-( it's also not very on the SB side having to sort through the requests for freebies. ",
                    "author": null,
                    "id": "ecjvavn",
                    "parent_id": "t1_ecjs516",
                    "score": 3,
                    "created_utc": 1545781333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t say I have ever been offended but I have been turned off if the girl sounded like a seasoned pro.  That’s not my jam so if they sound a little jaded I just take a pass In whatever is the path of least resistance.  If she thinks I’m offended and being cheap,  that’s easier than going into details that you think she’s cute and would like to sleep with her but if I’m paying then I expect better.  \n\nThere are girls I would like to sleep with that are not necessarily girls I would enter into a sugar relationship with.  If I can get a 8/9/10 with my budget why would I settle for a 6/7 for the same expense. ",
            "author": "LotBuilder",
            "id": "eck0yns",
            "parent_id": "t3_a9iu30",
            "score": -8,
            "created_utc": 1545785374.0,
            "replies": [
                {
                    "body": "Good point, Ill definitely keep that in mind as I sift through messages.",
                    "author": "KinkieKutie",
                    "id": "ecke9r7",
                    "parent_id": "t1_eck0yns",
                    "score": 2,
                    "created_utc": 1545797166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you hit the nail on the head! Also the ones that ask for naked pics and get mad when you send them your cashapp$ ID make me giggle. ",
            "author": null,
            "id": "ecjuoa5",
            "parent_id": "t1_ecjsyy7",
            "score": 45,
            "created_utc": 1545780898.0,
            "replies": [
                {
                    "body": "Might add to SB profile   \n\nDon't bring a McDonald's budget to a 5 Star restaurant and expect success ",
                    "author": "pinotandsugar",
                    "id": "eclrs4b",
                    "parent_id": "t1_ecjuoa5",
                    "score": 10,
                    "created_utc": 1545852383.0,
                    "replies": [
                        {
                            "body": ">Don't bring a McDonald's budget to a 5 Star restaurant and expect success\n\nI absolutely love this and might be quoting it in the future haha",
                            "author": "artysugarbabe",
                            "id": "eogw7s7",
                            "parent_id": "t1_eclrs4b",
                            "score": 2,
                            "created_utc": 1558567123.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It’s all a transaction. The should are wrong to be cheap financially. Just like I’d expect the SB to go along with the sexual things I wanted, and would move on if she didn’t. ",
                    "author": "Texas_Rangers",
                    "id": "eck5cvr",
                    "parent_id": "t1_ecjuoa5",
                    "score": 4,
                    "created_utc": 1545788966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am 42, look 10 years younger, all of 6 feet tall, weigh in at 183 lbs, 18 percent body fat. I would also say I am rich, educated, cultured and a global citizen. \n\n90% of my SBs are 27 to 33 years old. Some of them lied about their ages especially those over 30. They claimed they were 27. They have shared the profiles of their ex vanilla lovers and despite these girls being so attractive these vanilla dudes are anything but. Lots of fat boys, short boys, skinny guys with thick glasses, nerdy ones etc. Plus most were older than me and enormously less successful compared to me. Some were outright loser artists and musicians. One guy made all of 35k as a 44 year old and lived in the projects with his mom. Fantastic indeed!\n\nAnother thing these ladies have on the site and outside claimed they like older men vs younger boys. Really!? If they do, why do they want the older man to pay them to date them.\n\nWhen they are with me, I treat them to royalty. 2 days back I took my current Latina SB out to dinner to Eleven Madison in NYC. Tonight having a date at another upscale place in Manhattan. That’s quite routine on top of trips abroad and 5 star living. \n\nDespite all this I still pay them cash. A ppm is always there at the end of the date.\n\nWhy? Just because I can let them go anytime I want. With cash I can date whoever I want and faster. Cash puts a solid boundary on what they can expect and what not. I am not seeking their love or affection just their company although half of my SBs have asked me if I wanted an LTR. NOPE. If I wanted that I would seek it elsewhere. There is no shortage of educated, cultured women who belong to solid backgrounds who can fill that void. Those are LTR material. You don’t seek or find them on seeking. \n\nSo there are reasons why men should pay cash. I don’t make an effort to treat my SBs to a good life, I just live a good life. They join in. I let them go when I get bored or very busy. Thanks to the cash! No hard feelings, thanks to the cash. No stalking or drama post break up, thanks to the cash. Simple. \n\nSBs, you deserve to get paid but think twice when you claim you “like older men” and then belittle them on this forum for them being ugly.",
            "author": null,
            "id": "eckyupp",
            "parent_id": "t1_ecjsyy7",
            "score": -8,
            "created_utc": 1545827099.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ecm523o",
                    "parent_id": "t1_eckyupp",
                    "score": 12,
                    "created_utc": 1545862427.0,
                    "replies": [
                        {
                            "body": "Ms Escort, How does my post let you judge my self esteem? I am simply sharing facts about my experiences. I like paid company and the bowl is good for that. I pay them to go the hell away. If I wanted LTRs, there are other places to seek cultured women from solid backgrounds. The bowl is no place to seek that. What makes you all insecure about a post from a solid confident rich guy?",
                            "author": null,
                            "id": "ecm98xg",
                            "parent_id": "t1_ecm523o",
                            "score": 0,
                            "created_utc": 1545865540.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ecmsik2",
                                    "parent_id": "t1_ecm98xg",
                                    "score": 9,
                                    "created_utc": 1545881405.0,
                                    "replies": [
                                        {
                                            "body": "Ms Escort, This thread was willfully designed to put down the “old” men in the lifestyle. They are being called ugly, disgusting etc. There are so many posts like that here. Frankly it seems it’s intimidating to you to hear from a younger confident guy who says it like it is. Truth can be bitter as you can see.",
                                            "author": null,
                                            "id": "ecnityr",
                                            "parent_id": "t1_ecmsik2",
                                            "score": -2,
                                            "created_utc": 1545914368.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've always wondered that. A man will straight up ask if you want to fuck and then get their panties in a bunch when the woman asks for nail money. lol ",
            "author": null,
            "id": "ecjuzgy",
            "parent_id": "t1_ecjrjdo",
            "score": 46,
            "created_utc": 1545781112.0,
            "replies": []
        },
        {
            "body": "A good example is Scott Adams, the wealthy creator of Dilbert. He is ~~approaching 70~~ 61 and his “girlfriend” is the stunning [Kristina Basham](https://imgur.com/a/aG2Zq23). About ~~45~~ 31 years his younger. \n\nHe claims they just have good chemistry and she’s not with him for money. \n\nThough he does treat her very well. Vacations to Park City, Utah, and Hawaii. \n\nedit: added picture\n\nedit2: 31 years, not 45. I don't fault Scott for dating Kristina. I mean she is absolutely stunning. If I was 60, wealthy and single, I'd try to date her too. ",
            "author": "Texas_Rangers",
            "id": "eck55yq",
            "parent_id": "t1_ecjrjdo",
            "score": 7,
            "created_utc": 1545788788.0,
            "replies": [
                {
                    "body": "Google says he's actually 60 and she's 30 lol, not quite the geriatric/ youngster coupling you paint. They're also not together anymore, SR's don't tend to last that long I guess...",
                    "author": "blonde-throwaway",
                    "id": "ecm1aid",
                    "parent_id": "t1_eck55yq",
                    "score": 4,
                    "created_utc": 1545859580.0,
                    "replies": [
                        {
                            "body": "she's 29 years old\n\nSo you're telling me this [supermodel](https://imgur.com/a/VfWITfS) is dating a 60 year old man for pure love? ",
                            "author": "Texas_Rangers",
                            "id": "ecm1olu",
                            "parent_id": "t1_ecm1aid",
                            "score": 4,
                            "created_utc": 1545859877.0,
                            "replies": [
                                {
                                    "body": "Oh, of course not! But he's not so hideous that there may not be *some* attraction there. A 30 year age gap is not unheard of, 45 is crazy.\n\nBut yes, if he was poor he'd be dating someone his own age and she'd be with another rich guy.",
                                    "author": "blonde-throwaway",
                                    "id": "ecm242f",
                                    "parent_id": "t1_ecm1olu",
                                    "score": 5,
                                    "created_utc": 1545860201.0,
                                    "replies": [
                                        {
                                            "body": "Trust me, I want to be able to do exactly what Scott is doing at his age, and seeing beautiful women. It's true that women are often attracted to older men. \n\nI don't fault Scott at all for wanting to be with her. And also I was a little incorrect about the ages, so appreciate the correction. ",
                                            "author": "Texas_Rangers",
                                            "id": "ecm2f2l",
                                            "parent_id": "t1_ecm242f",
                                            "score": 1,
                                            "created_utc": 1545860421.0,
                                            "replies": [
                                                {
                                                    "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
                                                    "author": "blonde-throwaway",
                                                    "id": "ecm4jt6",
                                                    "parent_id": "t1_ecm2f2l",
                                                    "score": 10,
                                                    "created_utc": 1545862045.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Love of ?",
                                    "author": "pinotandsugar",
                                    "id": "ecp0p4e",
                                    "parent_id": "t1_ecm1olu",
                                    "score": 1,
                                    "created_utc": 1545956641.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sorry to comment twice, but wanted to make sure you saw [this stunning picture of Kristina](https://imgur.com/a/aG2Zq23) too. \n\nI mean she's absolutely stunning, and I don't blame Scott for wanting to date her at all. \n\nI just find a hard time believing she would date him if he were poor. ",
                            "author": "Texas_Rangers",
                            "id": "ecm1u44",
                            "parent_id": "t1_ecm1aid",
                            "score": -1,
                            "created_utc": 1545859992.0,
                            "replies": [
                                {
                                    "body": "Btw, she's photoshopped *the hell* out of that picture. She's pretty yeah, but you probably wouldn't recognise the girl if she walked past you irl. Check out Instagram vs reality for some insight into pictures like that.",
                                    "author": "blonde-throwaway",
                                    "id": "ecm4dxu",
                                    "parent_id": "t1_ecm1u44",
                                    "score": 6,
                                    "created_utc": 1545861909.0,
                                    "replies": [
                                        {
                                            "body": "Sure I agree. It did looked a little shipped. But she’s stunning with huge breasts. ",
                                            "author": "Texas_Rangers",
                                            "id": "ecmjm83",
                                            "parent_id": "t1_ecm4dxu",
                                            "score": 0,
                                            "created_utc": 1545873467.0,
                                            "replies": [
                                                {
                                                    "body": "Anyone can buy those boobs like she did haha.",
                                                    "author": "blonde-throwaway",
                                                    "id": "ecn4ewx",
                                                    "parent_id": "t1_ecmjm83",
                                                    "score": 5,
                                                    "created_utc": 1545893674.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
                                                    "author": "SDRippington",
                                                    "id": "ecmr5n9",
                                                    "parent_id": "t1_ecmjm83",
                                                    "score": 1,
                                                    "created_utc": 1545880294.0,
                                                    "replies": [
                                                        {
                                                            "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                                                            "author": "Texas_Rangers",
                                                            "id": "ecmrroq",
                                                            "parent_id": "t1_ecmr5n9",
                                                            "score": 2,
                                                            "created_utc": 1545880796.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She's his sugarbaby.",
                    "author": null,
                    "id": "eckupqx",
                    "parent_id": "t1_eck55yq",
                    "score": 7,
                    "created_utc": 1545820254.0,
                    "replies": []
                },
                {
                    "body": "> she’s not with him for money\n\nHaha-That's a laugh.See if Kristina stayed around id Scotty suddenly lost his fortune.",
                    "author": "GSSD",
                    "id": "ecl36gg",
                    "parent_id": "t1_eck55yq",
                    "score": 4,
                    "created_utc": 1545832542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are male SBs they should try their luck ik the bowl. LOL. You make a good point it could all be jealousy",
            "author": "plussizefairy",
            "id": "ecktt44",
            "parent_id": "t1_ecjvzpw",
            "score": 1,
            "created_utc": 1545818846.0,
            "replies": [
                {
                    "body": "Hahaha. I just checked this account first time in a while... I like your idea of them trying out the SB side, since they clearly seem jealous of it!!\n\n (I bet at least 95% of their snarky bitching is jealousy)",
                    "author": "thesluttypet",
                    "id": "eg5vjep",
                    "parent_id": "t1_ecktt44",
                    "score": 2,
                    "created_utc": 1549817001.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "cats are certainly on the prowl this evening \n\nhad to go to the source for this \n\nUrban Dictionary: douchelord\nhttps://www.urbandictionary.com/define.php?term=douchelord\n1.Person/s that demonstrates all the qualities of being a douche so well, they could in fact be a deity among douches. 2.The lord and messiah of all douches.\n\nI particularly appreciated the last   \" 2.The lord and messiah of all douches.\"",
            "author": "pinotandsugar",
            "id": "eckooqo",
            "parent_id": "t1_eckd020",
            "score": 2,
            "created_utc": 1545810328.0,
            "replies": [
                {
                    "body": "I have never actually heard anyone else use the term, but I am so happy there's a UD for it. Spot on. ",
                    "author": "2catsandacomputer",
                    "id": "eckp5m4",
                    "parent_id": "t1_eckooqo",
                    "score": 5,
                    "created_utc": 1545811064.0,
                    "replies": [
                        {
                            "body": "I had never heard it used and like to check before opening my mouth. ",
                            "author": "pinotandsugar",
                            "id": "eckpbh6",
                            "parent_id": "t1_eckp5m4",
                            "score": 1,
                            "created_utc": 1545811320.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lots of easy things cause mental damage.\n\nI agree that guys hating on prostitutes are douchebags tho",
            "author": "HowardRobardHughesJr",
            "id": "eckie43",
            "parent_id": "t1_eckd020",
            "score": 1,
            "created_utc": 1545801573.0,
            "replies": [
                {
                    "body": "Such as? They make it sounds like it's pencil sharpening kind of easy. ",
                    "author": "2catsandacomputer",
                    "id": "eckiy7l",
                    "parent_id": "t1_eckie43",
                    "score": 4,
                    "created_utc": 1545802278.0,
                    "replies": [
                        {
                            "body": "Such as eating bad food and not exercising, etc -- easy but harmful and causes mental damage",
                            "author": "HowardRobardHughesJr",
                            "id": "eckrgs6",
                            "parent_id": "t1_eckiy7l",
                            "score": 1,
                            "created_utc": 1545814855.0,
                            "replies": [
                                {
                                    "body": "I highly doubt any person would actually say that they wouldn't date someone who was previously overweight but isn't now, or someone who didn't exercise and does now because the latter was easy and those behaviors are *so* mentally damaging that the person is now damaged goods. Come on now.",
                                    "author": "2catsandacomputer",
                                    "id": "eckrl3t",
                                    "parent_id": "t1_eckrgs6",
                                    "score": 10,
                                    "created_utc": 1545815060.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naw .........  the simple answer is simply     click..........\n\nMostly a matter of semantics  \n\nI think  \"Have you had a prior arrangement \"  is an acceptable question ONCE you have established some common interest.  \n\nIt's even more important that it be asked of potential SDs ",
            "author": "pinotandsugar",
            "id": "eckoupc",
            "parent_id": "t1_eck5foi",
            "score": 2,
            "created_utc": 1545810585.0,
            "replies": []
        },
        {
            "body": "My favorite is men in their 50s/60s “but I feel like I’m 30”.  LMAO.  And I feel like Beyoncé.  Doesn’t make it true.",
            "author": "milliondollarkitty",
            "id": "eckkmwo",
            "parent_id": "t1_ecjpwf1",
            "score": 27,
            "created_utc": 1545804407.0,
            "replies": []
        },
        {
            "body": "Good idea with the unmatching! ",
            "author": null,
            "id": "ecjv4h2",
            "parent_id": "t1_ecjpwf1",
            "score": 18,
            "created_utc": 1545781209.0,
            "replies": []
        },
        {
            "body": "Facts!!!!",
            "author": "underwhelmedhuman",
            "id": "ecp5dka",
            "parent_id": "t1_ecjpwf1",
            "score": 1,
            "created_utc": 1545960782.0,
            "replies": []
        },
        {
            "body": "I get plenty of younger women on tinder that match with me that aren't looking for something.  Just because you want something from them out of it, there are others that don't.  You shouldn't really fault them for what their desires are.  If it isn't a match then it isn't, just move on.",
            "author": "ThisIsTheSugarDaddy",
            "id": "eck248v",
            "parent_id": "t1_ecjpwf1",
            "score": -9,
            "created_utc": 1545786276.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eck3k3b",
                    "parent_id": "t1_eck248v",
                    "score": 15,
                    "created_utc": 1545787351.0,
                    "replies": [
                        {
                            "body": "I think you have the right to be frustrated on a site like seeking if they play dumb about the Financial aspect. Maybe not on tinder though. Stranger things happen. I personally like the allowance, it sets boundaries for both of us ",
                            "author": "AussieSD",
                            "id": "eckls1n",
                            "parent_id": "t1_eck3k3b",
                            "score": 4,
                            "created_utc": 1545806075.0,
                            "replies": []
                        },
                        {
                            "body": "In your own words from a previous post of yours, you make no sense.  His response actually disproves your point.  Learn the difference. ",
                            "author": "houstonsd",
                            "id": "eck4f4n",
                            "parent_id": "t1_eck3k3b",
                            "score": 0,
                            "created_utc": 1545788115.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eck4tis",
                                    "parent_id": "t1_eck4f4n",
                                    "score": 22,
                                    "created_utc": 1545788471.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eck931c",
                                            "parent_id": "t1_eck4tis",
                                            "score": 14,
                                            "created_utc": 1545792439.0,
                                            "replies": [
                                                {
                                                    "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
                                                    "author": "houstonsd",
                                                    "id": "eckilv5",
                                                    "parent_id": "t1_eck931c",
                                                    "score": -3,
                                                    "created_utc": 1545801846.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "How is it delusional if he is dating a younger woman and there is no financial compensation?   The only answer is that he isn’t delusional and therefore completely disproves your point.  \n\nIt sounds like you’re extrapolating a conclusion.  Just because he is a sugar daddy doesn’t mean that all his dates are sugar related.   I don’t know him nor his situation so I can’t verify that.  \n\nBut I can speak for me and my situation and that is that I date vanilla.   My vanilla ages range from early 20’s to mid 50’s.    But, I also sugar and I do so for my own reasons. Vanilla and sugar are not mutually exclusive.   ",
                                            "author": "houstonsd",
                                            "id": "eck75bk",
                                            "parent_id": "t1_eck4tis",
                                            "score": 0,
                                            "created_utc": 1545790635.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Tinder is not SA. Why are women looking\nfor paid relationships there? What’s next? Match and eharmony also being a haven for paid dating!",
                                            "author": null,
                                            "id": "ecl06f0",
                                            "parent_id": "t1_eck4tis",
                                            "score": 1,
                                            "created_utc": 1545829061.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I don't think I proved (or disproved) any point of yours?? Maybe I'm missing something...  Could you elaborate for me?\n\nI've had more than one relationship with a woman in her early 20's simply because she appreciates who I am and what I am about.  Although I am in my late 30's and not 2x their age.  The most recent was a 23 year old that was starting a similar career track that got me to where I am at today.  She appreciated my insight, feedback, and mentoring.  She also appreciated that  we could go out and do things together and it wasn't uncomfortable for her, since the majority of her friends were not making the same money she makes (\\~$115k/yr when we met, and \\~$155k/yr after my mentoring her).    She was wise beyond her years, and we had a lot of fun spending time together.  You could say she got some value out of our relationship with my experience and mentoring.\n\n&#x200B;\n\nI've also had tinder women (all ages), want something from me, that I was not willing to participate in.\n\n&#x200B;\n\nI think late 20's to mid 30's is my ideal age range.  21 is the minimum (legally able to go out for a drink is a hard requirement of mine), and most early 20's are very immature (not all, and I don't only judge based on number).",
                            "author": "ThisIsTheSugarDaddy",
                            "id": "eck4o3o",
                            "parent_id": "t1_eck3k3b",
                            "score": -8,
                            "created_utc": 1545788341.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eck62hz",
            "parent_id": "t1_ecjpwf1",
            "score": -14,
            "created_utc": 1545789623.0,
            "replies": []
        },
        {
            "body": "Are you kidding? Men of all ages prefer 18-22 year old women and under 30 if not that. It doesn’t change when the man ages. ",
            "author": "Texas_Rangers",
            "id": "eee6h57",
            "parent_id": "t1_ecjpwf1",
            "score": -1,
            "created_utc": 1547851713.0,
            "replies": []
        },
        {
            "body": "Without some form of tangible reward it is not an arrangement......",
            "author": "pinotandsugar",
            "id": "eckoxe0",
            "parent_id": "t1_eckdirs",
            "score": 7,
            "created_utc": 1545810699.0,
            "replies": []
        },
        {
            "body": "Great point. I've just been noticing a lot of slut shaming and manipulation. ",
            "author": null,
            "id": "ecjpvwg",
            "parent_id": "t1_ecjoo5r",
            "score": 15,
            "created_utc": 1545777325.0,
            "replies": [
                {
                    "body": "Just look for the ones like me who adore \"experienced\" women. \n\nThere's shaming from the other side of things, too. People are always judgy about the unconventional or what they decide they can stir up co-indignation about. It helps them feel validated.\n\nHappens plenty here as well!",
                    "author": null,
                    "id": "ecjqw1d",
                    "parent_id": "t1_ecjpvwg",
                    "score": 4,
                    "created_utc": 1545778072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s on tinder not SA",
            "author": "AussieSD",
            "id": "ecklu54",
            "parent_id": "t1_ecjpph6",
            "score": 1,
            "created_utc": 1545806170.0,
            "replies": []
        },
        {
            "body": "Why would a 60 yo want a 19 year old anyways? If they want a normal gal maybe they should stay in their age category. ",
            "author": null,
            "id": "ecjyr3i",
            "parent_id": "t1_ecjv15j",
            "score": 21,
            "created_utc": 1545783785.0,
            "replies": [
                {
                    "body": "Check out this piece by one of the founders of OKCupid: https://jezebel.com/mens-favorite-ages-are-20-21-22-and-23-a-data-dive-1731660984\n\nThere's [one particular graph](https://i.kinja-img.com/gawker-media/image/upload/1439100617563564204.jpg) you'll cringe at. Essentialy, men of all ages find women who are 20-21 years old most attractive, at least in photos. \n\nA 60-year-old wants a 19-year-old for the same reason a 20-year-old wants a 19-year-old -- or perhaps even more reasons.  \n\n",
                    "author": "ContriteSplendaDaddy",
                    "id": "eckvmjn",
                    "parent_id": "t1_ecjyr3i",
                    "score": 1,
                    "created_utc": 1545821575.0,
                    "replies": [
                        {
                            "body": "No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years. It's the same reason most women are attracted to tall, lean or muscular men, even when the individual may be a total douche. It's all about the survival of our offspring. \n\nWe may want to deny the animal, but it's still alive in our biology. ",
                            "author": null,
                            "id": "ecl35qa",
                            "parent_id": "t1_eckvmjn",
                            "score": 2,
                            "created_utc": 1545832520.0,
                            "replies": [
                                {
                                    "body": "> No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years.\n\nYou won't be able to argue this point successfully with anyone offering an opposing view based on merit, as every statement that attempts to contradict this is just someone acting butt-hurt. \n\nBiology ultimately will always be misinterpreted as misogyny. \n\nPut simply, as a man, the better looking you are, the less money you have to pay to overcome anyone else's \"ick\" factor in order to have sex with them.  ",
                                    "author": "SDRippington",
                                    "id": "eclyu03",
                                    "parent_id": "t1_ecl35qa",
                                    "score": 4,
                                    "created_utc": 1545857708.0,
                                    "replies": []
                                },
                                {
                                    "body": "Luckily for many of us, father-daughter bonding leads some women to be attracted to \"dad bods\" too. Sometimes this bonding is unhealthy, but I'm pretty sure even healthy relationships lead to this too. Women often seek out men like their fathers. ",
                                    "author": "ContriteSplendaDaddy",
                                    "id": "eclztoc",
                                    "parent_id": "t1_ecl35qa",
                                    "score": 0,
                                    "created_utc": 1545858461.0,
                                    "replies": [
                                        {
                                            "body": "I don't believe there are very many women who, offered the choice between Danny Devito and Chris Evans, all other factors being equal, would choose Mr Devito!\n\nThankfully all other factors are not equal, including the availability of specimens like Mr Evans. ",
                                            "author": null,
                                            "id": "ecm1waf",
                                            "parent_id": "t1_eclztoc",
                                            "score": 2,
                                            "created_utc": 1545860038.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You're being rhetorical, right? Simple biology and the desire to \"recapture youth\". \n\nPersonally my personal preference is always 25+ no matter how old I get because frankly, under that age the flakiness and lack of mental and emotional maturity is just way too high - but feel free to ask that same silly question once you hit your late forties to early fifties, okay? \n",
                    "author": "SDRippington",
                    "id": "ecly9pz",
                    "parent_id": "t1_ecjyr3i",
                    "score": 1,
                    "created_utc": 1545857296.0,
                    "replies": [
                        {
                            "body": "Older people seeking younger people should not be bitter about providing financial compensation. Whether it's a 20 year old and a 60 year old or a 30 year old and 60 year old. What are you mad about? ",
                            "author": null,
                            "id": "eclz6oh",
                            "parent_id": "t1_ecly9pz",
                            "score": 3,
                            "created_utc": 1545857975.0,
                            "replies": [
                                {
                                    "body": "I'm not mad at anything.\n\nI'm more of a \"gender role\" kind of old fashioned guy anyway. As a man, I pay for dates and courting in the vanilla world - and I help financially whomever I am in a committed relationship with - whether it's vanilla or sugar and regardless of age. I offer what I can and help her to be as enabled for success as possible - whether it's school, work, whatever. \n\nYou asked a very simple question - _\"Why would a 60 yo want a 19 year old anyways?\"_ and I answered it. Basic biology. It doesn't need to really go any further than that. But I will point out two things:\n\n* Tinder is a hookup site. You cannot nor should you make any judgement calls as to whether a person on Tinder (regardless of age) is willing to pay money or not. You're using Tinder at that point just like a drug \"off label\". If you don't like the results, don't complain - just move on.  I can accept people bitching about this on \"Seeking\" or other sugar-based sites. But Tinder? Nope. If people are delusional - let them have their delusion and move on.\n\n* So older people seeing older people should just be \"cool\" about the finance thing, because hey, they're dating in their bracket? What kind of ageist bullshit is that? LMAO!\n\nI'll say this out loud - Personally if a 20 year old woman is with a 22 year old dude that has no direction, drive or would rather kick back with his bro's and smoke a blunt rather than \"be everything he can\" and help the woman financially as a part of being in a relationship? And she puts up with this bullshit?! Then the 20 year old woman is an idiot and she gets what she asked for and gets zero sympathy from me.  \n\nAnd I still find it utterly amusing that so many women on this forum find it incomprehensible that there are, in fact, early twenties women who actually LIKE to be with much older guys irrespective of what financial help they receive. Interestingly enough I find this to happen more often than successful guys paying for platonic relationships - at least based on _personal_ experience. \n\nTotal number of under-28 yo women that choose to be a fuck-buddy for whatever reason and who don't want and refuse \"payment\" beyond the \"date\" itself? Five.\n\nTotal number of \"platonic\" relationships I have paid for? Zero.\n\nAgain, that is just me. I cannot speak for anyone else :-)",
                                    "author": "SDRippington",
                                    "id": "ecm0m2c",
                                    "parent_id": "t1_eclz6oh",
                                    "score": 0,
                                    "created_utc": 1545859065.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely encountered this on SA. lol this is a thing ",
            "author": null,
            "id": "ecjyo7i",
            "parent_id": "t1_ecjv15j",
            "score": 8,
            "created_utc": 1545783729.0,
            "replies": []
        },
        {
            "body": "I'm not a newbie and I have a steady SD now. However, during my searching stages I would definitely run into these kinds of men. There were plenty of salt SDs that ask this on SA. I'm thinking even with vanilla dating, there are maturely aged men who fantasize about being with a 18-21 year old without expecting her to ask for help. Idk dating is weird.  ",
            "author": null,
            "id": "ecjpsx8",
            "parent_id": "t1_ecjp4q4",
            "score": 12,
            "created_utc": 1545777260.0,
            "replies": []
        },
        {
            "body": "I feel  bad for SD's that get scammed online :-( it's also not very on the SB side having to sort through the requests for freebies. ",
            "author": null,
            "id": "ecjvavn",
            "parent_id": "t1_ecjs516",
            "score": 3,
            "created_utc": 1545781333.0,
            "replies": []
        },
        {
            "body": "Good point, Ill definitely keep that in mind as I sift through messages.",
            "author": "KinkieKutie",
            "id": "ecke9r7",
            "parent_id": "t1_eck0yns",
            "score": 2,
            "created_utc": 1545797166.0,
            "replies": []
        },
        {
            "body": "Might add to SB profile   \n\nDon't bring a McDonald's budget to a 5 Star restaurant and expect success ",
            "author": "pinotandsugar",
            "id": "eclrs4b",
            "parent_id": "t1_ecjuoa5",
            "score": 10,
            "created_utc": 1545852383.0,
            "replies": [
                {
                    "body": ">Don't bring a McDonald's budget to a 5 Star restaurant and expect success\n\nI absolutely love this and might be quoting it in the future haha",
                    "author": "artysugarbabe",
                    "id": "eogw7s7",
                    "parent_id": "t1_eclrs4b",
                    "score": 2,
                    "created_utc": 1558567123.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s all a transaction. The should are wrong to be cheap financially. Just like I’d expect the SB to go along with the sexual things I wanted, and would move on if she didn’t. ",
            "author": "Texas_Rangers",
            "id": "eck5cvr",
            "parent_id": "t1_ecjuoa5",
            "score": 4,
            "created_utc": 1545788966.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ecm523o",
            "parent_id": "t1_eckyupp",
            "score": 12,
            "created_utc": 1545862427.0,
            "replies": [
                {
                    "body": "Ms Escort, How does my post let you judge my self esteem? I am simply sharing facts about my experiences. I like paid company and the bowl is good for that. I pay them to go the hell away. If I wanted LTRs, there are other places to seek cultured women from solid backgrounds. The bowl is no place to seek that. What makes you all insecure about a post from a solid confident rich guy?",
                    "author": null,
                    "id": "ecm98xg",
                    "parent_id": "t1_ecm523o",
                    "score": 0,
                    "created_utc": 1545865540.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ecmsik2",
                            "parent_id": "t1_ecm98xg",
                            "score": 9,
                            "created_utc": 1545881405.0,
                            "replies": [
                                {
                                    "body": "Ms Escort, This thread was willfully designed to put down the “old” men in the lifestyle. They are being called ugly, disgusting etc. There are so many posts like that here. Frankly it seems it’s intimidating to you to hear from a younger confident guy who says it like it is. Truth can be bitter as you can see.",
                                    "author": null,
                                    "id": "ecnityr",
                                    "parent_id": "t1_ecmsik2",
                                    "score": -2,
                                    "created_utc": 1545914368.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Google says he's actually 60 and she's 30 lol, not quite the geriatric/ youngster coupling you paint. They're also not together anymore, SR's don't tend to last that long I guess...",
            "author": "blonde-throwaway",
            "id": "ecm1aid",
            "parent_id": "t1_eck55yq",
            "score": 4,
            "created_utc": 1545859580.0,
            "replies": [
                {
                    "body": "she's 29 years old\n\nSo you're telling me this [supermodel](https://imgur.com/a/VfWITfS) is dating a 60 year old man for pure love? ",
                    "author": "Texas_Rangers",
                    "id": "ecm1olu",
                    "parent_id": "t1_ecm1aid",
                    "score": 4,
                    "created_utc": 1545859877.0,
                    "replies": [
                        {
                            "body": "Oh, of course not! But he's not so hideous that there may not be *some* attraction there. A 30 year age gap is not unheard of, 45 is crazy.\n\nBut yes, if he was poor he'd be dating someone his own age and she'd be with another rich guy.",
                            "author": "blonde-throwaway",
                            "id": "ecm242f",
                            "parent_id": "t1_ecm1olu",
                            "score": 5,
                            "created_utc": 1545860201.0,
                            "replies": [
                                {
                                    "body": "Trust me, I want to be able to do exactly what Scott is doing at his age, and seeing beautiful women. It's true that women are often attracted to older men. \n\nI don't fault Scott at all for wanting to be with her. And also I was a little incorrect about the ages, so appreciate the correction. ",
                                    "author": "Texas_Rangers",
                                    "id": "ecm2f2l",
                                    "parent_id": "t1_ecm242f",
                                    "score": 1,
                                    "created_utc": 1545860421.0,
                                    "replies": [
                                        {
                                            "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
                                            "author": "blonde-throwaway",
                                            "id": "ecm4jt6",
                                            "parent_id": "t1_ecm2f2l",
                                            "score": 10,
                                            "created_utc": 1545862045.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Love of ?",
                            "author": "pinotandsugar",
                            "id": "ecp0p4e",
                            "parent_id": "t1_ecm1olu",
                            "score": 1,
                            "created_utc": 1545956641.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sorry to comment twice, but wanted to make sure you saw [this stunning picture of Kristina](https://imgur.com/a/aG2Zq23) too. \n\nI mean she's absolutely stunning, and I don't blame Scott for wanting to date her at all. \n\nI just find a hard time believing she would date him if he were poor. ",
                    "author": "Texas_Rangers",
                    "id": "ecm1u44",
                    "parent_id": "t1_ecm1aid",
                    "score": -1,
                    "created_utc": 1545859992.0,
                    "replies": [
                        {
                            "body": "Btw, she's photoshopped *the hell* out of that picture. She's pretty yeah, but you probably wouldn't recognise the girl if she walked past you irl. Check out Instagram vs reality for some insight into pictures like that.",
                            "author": "blonde-throwaway",
                            "id": "ecm4dxu",
                            "parent_id": "t1_ecm1u44",
                            "score": 6,
                            "created_utc": 1545861909.0,
                            "replies": [
                                {
                                    "body": "Sure I agree. It did looked a little shipped. But she’s stunning with huge breasts. ",
                                    "author": "Texas_Rangers",
                                    "id": "ecmjm83",
                                    "parent_id": "t1_ecm4dxu",
                                    "score": 0,
                                    "created_utc": 1545873467.0,
                                    "replies": [
                                        {
                                            "body": "Anyone can buy those boobs like she did haha.",
                                            "author": "blonde-throwaway",
                                            "id": "ecn4ewx",
                                            "parent_id": "t1_ecmjm83",
                                            "score": 5,
                                            "created_utc": 1545893674.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
                                            "author": "SDRippington",
                                            "id": "ecmr5n9",
                                            "parent_id": "t1_ecmjm83",
                                            "score": 1,
                                            "created_utc": 1545880294.0,
                                            "replies": [
                                                {
                                                    "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                                                    "author": "Texas_Rangers",
                                                    "id": "ecmrroq",
                                                    "parent_id": "t1_ecmr5n9",
                                                    "score": 2,
                                                    "created_utc": 1545880796.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She's his sugarbaby.",
            "author": null,
            "id": "eckupqx",
            "parent_id": "t1_eck55yq",
            "score": 7,
            "created_utc": 1545820254.0,
            "replies": []
        },
        {
            "body": "> she’s not with him for money\n\nHaha-That's a laugh.See if Kristina stayed around id Scotty suddenly lost his fortune.",
            "author": "GSSD",
            "id": "ecl36gg",
            "parent_id": "t1_eck55yq",
            "score": 4,
            "created_utc": 1545832542.0,
            "replies": []
        },
        {
            "body": "Hahaha. I just checked this account first time in a while... I like your idea of them trying out the SB side, since they clearly seem jealous of it!!\n\n (I bet at least 95% of their snarky bitching is jealousy)",
            "author": "thesluttypet",
            "id": "eg5vjep",
            "parent_id": "t1_ecktt44",
            "score": 2,
            "created_utc": 1549817001.0,
            "replies": []
        },
        {
            "body": "I have never actually heard anyone else use the term, but I am so happy there's a UD for it. Spot on. ",
            "author": "2catsandacomputer",
            "id": "eckp5m4",
            "parent_id": "t1_eckooqo",
            "score": 5,
            "created_utc": 1545811064.0,
            "replies": [
                {
                    "body": "I had never heard it used and like to check before opening my mouth. ",
                    "author": "pinotandsugar",
                    "id": "eckpbh6",
                    "parent_id": "t1_eckp5m4",
                    "score": 1,
                    "created_utc": 1545811320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Such as? They make it sounds like it's pencil sharpening kind of easy. ",
            "author": "2catsandacomputer",
            "id": "eckiy7l",
            "parent_id": "t1_eckie43",
            "score": 4,
            "created_utc": 1545802278.0,
            "replies": [
                {
                    "body": "Such as eating bad food and not exercising, etc -- easy but harmful and causes mental damage",
                    "author": "HowardRobardHughesJr",
                    "id": "eckrgs6",
                    "parent_id": "t1_eckiy7l",
                    "score": 1,
                    "created_utc": 1545814855.0,
                    "replies": [
                        {
                            "body": "I highly doubt any person would actually say that they wouldn't date someone who was previously overweight but isn't now, or someone who didn't exercise and does now because the latter was easy and those behaviors are *so* mentally damaging that the person is now damaged goods. Come on now.",
                            "author": "2catsandacomputer",
                            "id": "eckrl3t",
                            "parent_id": "t1_eckrgs6",
                            "score": 10,
                            "created_utc": 1545815060.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eck3k3b",
            "parent_id": "t1_eck248v",
            "score": 15,
            "created_utc": 1545787351.0,
            "replies": [
                {
                    "body": "I think you have the right to be frustrated on a site like seeking if they play dumb about the Financial aspect. Maybe not on tinder though. Stranger things happen. I personally like the allowance, it sets boundaries for both of us ",
                    "author": "AussieSD",
                    "id": "eckls1n",
                    "parent_id": "t1_eck3k3b",
                    "score": 4,
                    "created_utc": 1545806075.0,
                    "replies": []
                },
                {
                    "body": "In your own words from a previous post of yours, you make no sense.  His response actually disproves your point.  Learn the difference. ",
                    "author": "houstonsd",
                    "id": "eck4f4n",
                    "parent_id": "t1_eck3k3b",
                    "score": 0,
                    "created_utc": 1545788115.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eck4tis",
                            "parent_id": "t1_eck4f4n",
                            "score": 22,
                            "created_utc": 1545788471.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eck931c",
                                    "parent_id": "t1_eck4tis",
                                    "score": 14,
                                    "created_utc": 1545792439.0,
                                    "replies": [
                                        {
                                            "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
                                            "author": "houstonsd",
                                            "id": "eckilv5",
                                            "parent_id": "t1_eck931c",
                                            "score": -3,
                                            "created_utc": 1545801846.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "How is it delusional if he is dating a younger woman and there is no financial compensation?   The only answer is that he isn’t delusional and therefore completely disproves your point.  \n\nIt sounds like you’re extrapolating a conclusion.  Just because he is a sugar daddy doesn’t mean that all his dates are sugar related.   I don’t know him nor his situation so I can’t verify that.  \n\nBut I can speak for me and my situation and that is that I date vanilla.   My vanilla ages range from early 20’s to mid 50’s.    But, I also sugar and I do so for my own reasons. Vanilla and sugar are not mutually exclusive.   ",
                                    "author": "houstonsd",
                                    "id": "eck75bk",
                                    "parent_id": "t1_eck4tis",
                                    "score": 0,
                                    "created_utc": 1545790635.0,
                                    "replies": []
                                },
                                {
                                    "body": "Tinder is not SA. Why are women looking\nfor paid relationships there? What’s next? Match and eharmony also being a haven for paid dating!",
                                    "author": null,
                                    "id": "ecl06f0",
                                    "parent_id": "t1_eck4tis",
                                    "score": 1,
                                    "created_utc": 1545829061.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't think I proved (or disproved) any point of yours?? Maybe I'm missing something...  Could you elaborate for me?\n\nI've had more than one relationship with a woman in her early 20's simply because she appreciates who I am and what I am about.  Although I am in my late 30's and not 2x their age.  The most recent was a 23 year old that was starting a similar career track that got me to where I am at today.  She appreciated my insight, feedback, and mentoring.  She also appreciated that  we could go out and do things together and it wasn't uncomfortable for her, since the majority of her friends were not making the same money she makes (\\~$115k/yr when we met, and \\~$155k/yr after my mentoring her).    She was wise beyond her years, and we had a lot of fun spending time together.  You could say she got some value out of our relationship with my experience and mentoring.\n\n&#x200B;\n\nI've also had tinder women (all ages), want something from me, that I was not willing to participate in.\n\n&#x200B;\n\nI think late 20's to mid 30's is my ideal age range.  21 is the minimum (legally able to go out for a drink is a hard requirement of mine), and most early 20's are very immature (not all, and I don't only judge based on number).",
                    "author": "ThisIsTheSugarDaddy",
                    "id": "eck4o3o",
                    "parent_id": "t1_eck3k3b",
                    "score": -8,
                    "created_utc": 1545788341.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just look for the ones like me who adore \"experienced\" women. \n\nThere's shaming from the other side of things, too. People are always judgy about the unconventional or what they decide they can stir up co-indignation about. It helps them feel validated.\n\nHappens plenty here as well!",
            "author": null,
            "id": "ecjqw1d",
            "parent_id": "t1_ecjpvwg",
            "score": 4,
            "created_utc": 1545778072.0,
            "replies": []
        },
        {
            "body": "Check out this piece by one of the founders of OKCupid: https://jezebel.com/mens-favorite-ages-are-20-21-22-and-23-a-data-dive-1731660984\n\nThere's [one particular graph](https://i.kinja-img.com/gawker-media/image/upload/1439100617563564204.jpg) you'll cringe at. Essentialy, men of all ages find women who are 20-21 years old most attractive, at least in photos. \n\nA 60-year-old wants a 19-year-old for the same reason a 20-year-old wants a 19-year-old -- or perhaps even more reasons.  \n\n",
            "author": "ContriteSplendaDaddy",
            "id": "eckvmjn",
            "parent_id": "t1_ecjyr3i",
            "score": 1,
            "created_utc": 1545821575.0,
            "replies": [
                {
                    "body": "No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years. It's the same reason most women are attracted to tall, lean or muscular men, even when the individual may be a total douche. It's all about the survival of our offspring. \n\nWe may want to deny the animal, but it's still alive in our biology. ",
                    "author": null,
                    "id": "ecl35qa",
                    "parent_id": "t1_eckvmjn",
                    "score": 2,
                    "created_utc": 1545832520.0,
                    "replies": [
                        {
                            "body": "> No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years.\n\nYou won't be able to argue this point successfully with anyone offering an opposing view based on merit, as every statement that attempts to contradict this is just someone acting butt-hurt. \n\nBiology ultimately will always be misinterpreted as misogyny. \n\nPut simply, as a man, the better looking you are, the less money you have to pay to overcome anyone else's \"ick\" factor in order to have sex with them.  ",
                            "author": "SDRippington",
                            "id": "eclyu03",
                            "parent_id": "t1_ecl35qa",
                            "score": 4,
                            "created_utc": 1545857708.0,
                            "replies": []
                        },
                        {
                            "body": "Luckily for many of us, father-daughter bonding leads some women to be attracted to \"dad bods\" too. Sometimes this bonding is unhealthy, but I'm pretty sure even healthy relationships lead to this too. Women often seek out men like their fathers. ",
                            "author": "ContriteSplendaDaddy",
                            "id": "eclztoc",
                            "parent_id": "t1_ecl35qa",
                            "score": 0,
                            "created_utc": 1545858461.0,
                            "replies": [
                                {
                                    "body": "I don't believe there are very many women who, offered the choice between Danny Devito and Chris Evans, all other factors being equal, would choose Mr Devito!\n\nThankfully all other factors are not equal, including the availability of specimens like Mr Evans. ",
                                    "author": null,
                                    "id": "ecm1waf",
                                    "parent_id": "t1_eclztoc",
                                    "score": 2,
                                    "created_utc": 1545860038.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're being rhetorical, right? Simple biology and the desire to \"recapture youth\". \n\nPersonally my personal preference is always 25+ no matter how old I get because frankly, under that age the flakiness and lack of mental and emotional maturity is just way too high - but feel free to ask that same silly question once you hit your late forties to early fifties, okay? \n",
            "author": "SDRippington",
            "id": "ecly9pz",
            "parent_id": "t1_ecjyr3i",
            "score": 1,
            "created_utc": 1545857296.0,
            "replies": [
                {
                    "body": "Older people seeking younger people should not be bitter about providing financial compensation. Whether it's a 20 year old and a 60 year old or a 30 year old and 60 year old. What are you mad about? ",
                    "author": null,
                    "id": "eclz6oh",
                    "parent_id": "t1_ecly9pz",
                    "score": 3,
                    "created_utc": 1545857975.0,
                    "replies": [
                        {
                            "body": "I'm not mad at anything.\n\nI'm more of a \"gender role\" kind of old fashioned guy anyway. As a man, I pay for dates and courting in the vanilla world - and I help financially whomever I am in a committed relationship with - whether it's vanilla or sugar and regardless of age. I offer what I can and help her to be as enabled for success as possible - whether it's school, work, whatever. \n\nYou asked a very simple question - _\"Why would a 60 yo want a 19 year old anyways?\"_ and I answered it. Basic biology. It doesn't need to really go any further than that. But I will point out two things:\n\n* Tinder is a hookup site. You cannot nor should you make any judgement calls as to whether a person on Tinder (regardless of age) is willing to pay money or not. You're using Tinder at that point just like a drug \"off label\". If you don't like the results, don't complain - just move on.  I can accept people bitching about this on \"Seeking\" or other sugar-based sites. But Tinder? Nope. If people are delusional - let them have their delusion and move on.\n\n* So older people seeing older people should just be \"cool\" about the finance thing, because hey, they're dating in their bracket? What kind of ageist bullshit is that? LMAO!\n\nI'll say this out loud - Personally if a 20 year old woman is with a 22 year old dude that has no direction, drive or would rather kick back with his bro's and smoke a blunt rather than \"be everything he can\" and help the woman financially as a part of being in a relationship? And she puts up with this bullshit?! Then the 20 year old woman is an idiot and she gets what she asked for and gets zero sympathy from me.  \n\nAnd I still find it utterly amusing that so many women on this forum find it incomprehensible that there are, in fact, early twenties women who actually LIKE to be with much older guys irrespective of what financial help they receive. Interestingly enough I find this to happen more often than successful guys paying for platonic relationships - at least based on _personal_ experience. \n\nTotal number of under-28 yo women that choose to be a fuck-buddy for whatever reason and who don't want and refuse \"payment\" beyond the \"date\" itself? Five.\n\nTotal number of \"platonic\" relationships I have paid for? Zero.\n\nAgain, that is just me. I cannot speak for anyone else :-)",
                            "author": "SDRippington",
                            "id": "ecm0m2c",
                            "parent_id": "t1_eclz6oh",
                            "score": 0,
                            "created_utc": 1545859065.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Don't bring a McDonald's budget to a 5 Star restaurant and expect success\n\nI absolutely love this and might be quoting it in the future haha",
            "author": "artysugarbabe",
            "id": "eogw7s7",
            "parent_id": "t1_eclrs4b",
            "score": 2,
            "created_utc": 1558567123.0,
            "replies": []
        },
        {
            "body": "Ms Escort, How does my post let you judge my self esteem? I am simply sharing facts about my experiences. I like paid company and the bowl is good for that. I pay them to go the hell away. If I wanted LTRs, there are other places to seek cultured women from solid backgrounds. The bowl is no place to seek that. What makes you all insecure about a post from a solid confident rich guy?",
            "author": null,
            "id": "ecm98xg",
            "parent_id": "t1_ecm523o",
            "score": 0,
            "created_utc": 1545865540.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ecmsik2",
                    "parent_id": "t1_ecm98xg",
                    "score": 9,
                    "created_utc": 1545881405.0,
                    "replies": [
                        {
                            "body": "Ms Escort, This thread was willfully designed to put down the “old” men in the lifestyle. They are being called ugly, disgusting etc. There are so many posts like that here. Frankly it seems it’s intimidating to you to hear from a younger confident guy who says it like it is. Truth can be bitter as you can see.",
                            "author": null,
                            "id": "ecnityr",
                            "parent_id": "t1_ecmsik2",
                            "score": -2,
                            "created_utc": 1545914368.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "she's 29 years old\n\nSo you're telling me this [supermodel](https://imgur.com/a/VfWITfS) is dating a 60 year old man for pure love? ",
            "author": "Texas_Rangers",
            "id": "ecm1olu",
            "parent_id": "t1_ecm1aid",
            "score": 4,
            "created_utc": 1545859877.0,
            "replies": [
                {
                    "body": "Oh, of course not! But he's not so hideous that there may not be *some* attraction there. A 30 year age gap is not unheard of, 45 is crazy.\n\nBut yes, if he was poor he'd be dating someone his own age and she'd be with another rich guy.",
                    "author": "blonde-throwaway",
                    "id": "ecm242f",
                    "parent_id": "t1_ecm1olu",
                    "score": 5,
                    "created_utc": 1545860201.0,
                    "replies": [
                        {
                            "body": "Trust me, I want to be able to do exactly what Scott is doing at his age, and seeing beautiful women. It's true that women are often attracted to older men. \n\nI don't fault Scott at all for wanting to be with her. And also I was a little incorrect about the ages, so appreciate the correction. ",
                            "author": "Texas_Rangers",
                            "id": "ecm2f2l",
                            "parent_id": "t1_ecm242f",
                            "score": 1,
                            "created_utc": 1545860421.0,
                            "replies": [
                                {
                                    "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
                                    "author": "blonde-throwaway",
                                    "id": "ecm4jt6",
                                    "parent_id": "t1_ecm2f2l",
                                    "score": 10,
                                    "created_utc": 1545862045.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Love of ?",
                    "author": "pinotandsugar",
                    "id": "ecp0p4e",
                    "parent_id": "t1_ecm1olu",
                    "score": 1,
                    "created_utc": 1545956641.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to comment twice, but wanted to make sure you saw [this stunning picture of Kristina](https://imgur.com/a/aG2Zq23) too. \n\nI mean she's absolutely stunning, and I don't blame Scott for wanting to date her at all. \n\nI just find a hard time believing she would date him if he were poor. ",
            "author": "Texas_Rangers",
            "id": "ecm1u44",
            "parent_id": "t1_ecm1aid",
            "score": -1,
            "created_utc": 1545859992.0,
            "replies": [
                {
                    "body": "Btw, she's photoshopped *the hell* out of that picture. She's pretty yeah, but you probably wouldn't recognise the girl if she walked past you irl. Check out Instagram vs reality for some insight into pictures like that.",
                    "author": "blonde-throwaway",
                    "id": "ecm4dxu",
                    "parent_id": "t1_ecm1u44",
                    "score": 6,
                    "created_utc": 1545861909.0,
                    "replies": [
                        {
                            "body": "Sure I agree. It did looked a little shipped. But she’s stunning with huge breasts. ",
                            "author": "Texas_Rangers",
                            "id": "ecmjm83",
                            "parent_id": "t1_ecm4dxu",
                            "score": 0,
                            "created_utc": 1545873467.0,
                            "replies": [
                                {
                                    "body": "Anyone can buy those boobs like she did haha.",
                                    "author": "blonde-throwaway",
                                    "id": "ecn4ewx",
                                    "parent_id": "t1_ecmjm83",
                                    "score": 5,
                                    "created_utc": 1545893674.0,
                                    "replies": []
                                },
                                {
                                    "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
                                    "author": "SDRippington",
                                    "id": "ecmr5n9",
                                    "parent_id": "t1_ecmjm83",
                                    "score": 1,
                                    "created_utc": 1545880294.0,
                                    "replies": [
                                        {
                                            "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                                            "author": "Texas_Rangers",
                                            "id": "ecmrroq",
                                            "parent_id": "t1_ecmr5n9",
                                            "score": 2,
                                            "created_utc": 1545880796.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had never heard it used and like to check before opening my mouth. ",
            "author": "pinotandsugar",
            "id": "eckpbh6",
            "parent_id": "t1_eckp5m4",
            "score": 1,
            "created_utc": 1545811320.0,
            "replies": []
        },
        {
            "body": "Such as eating bad food and not exercising, etc -- easy but harmful and causes mental damage",
            "author": "HowardRobardHughesJr",
            "id": "eckrgs6",
            "parent_id": "t1_eckiy7l",
            "score": 1,
            "created_utc": 1545814855.0,
            "replies": [
                {
                    "body": "I highly doubt any person would actually say that they wouldn't date someone who was previously overweight but isn't now, or someone who didn't exercise and does now because the latter was easy and those behaviors are *so* mentally damaging that the person is now damaged goods. Come on now.",
                    "author": "2catsandacomputer",
                    "id": "eckrl3t",
                    "parent_id": "t1_eckrgs6",
                    "score": 10,
                    "created_utc": 1545815060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you have the right to be frustrated on a site like seeking if they play dumb about the Financial aspect. Maybe not on tinder though. Stranger things happen. I personally like the allowance, it sets boundaries for both of us ",
            "author": "AussieSD",
            "id": "eckls1n",
            "parent_id": "t1_eck3k3b",
            "score": 4,
            "created_utc": 1545806075.0,
            "replies": []
        },
        {
            "body": "In your own words from a previous post of yours, you make no sense.  His response actually disproves your point.  Learn the difference. ",
            "author": "houstonsd",
            "id": "eck4f4n",
            "parent_id": "t1_eck3k3b",
            "score": 0,
            "created_utc": 1545788115.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eck4tis",
                    "parent_id": "t1_eck4f4n",
                    "score": 22,
                    "created_utc": 1545788471.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eck931c",
                            "parent_id": "t1_eck4tis",
                            "score": 14,
                            "created_utc": 1545792439.0,
                            "replies": [
                                {
                                    "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
                                    "author": "houstonsd",
                                    "id": "eckilv5",
                                    "parent_id": "t1_eck931c",
                                    "score": -3,
                                    "created_utc": 1545801846.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "How is it delusional if he is dating a younger woman and there is no financial compensation?   The only answer is that he isn’t delusional and therefore completely disproves your point.  \n\nIt sounds like you’re extrapolating a conclusion.  Just because he is a sugar daddy doesn’t mean that all his dates are sugar related.   I don’t know him nor his situation so I can’t verify that.  \n\nBut I can speak for me and my situation and that is that I date vanilla.   My vanilla ages range from early 20’s to mid 50’s.    But, I also sugar and I do so for my own reasons. Vanilla and sugar are not mutually exclusive.   ",
                            "author": "houstonsd",
                            "id": "eck75bk",
                            "parent_id": "t1_eck4tis",
                            "score": 0,
                            "created_utc": 1545790635.0,
                            "replies": []
                        },
                        {
                            "body": "Tinder is not SA. Why are women looking\nfor paid relationships there? What’s next? Match and eharmony also being a haven for paid dating!",
                            "author": null,
                            "id": "ecl06f0",
                            "parent_id": "t1_eck4tis",
                            "score": 1,
                            "created_utc": 1545829061.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think I proved (or disproved) any point of yours?? Maybe I'm missing something...  Could you elaborate for me?\n\nI've had more than one relationship with a woman in her early 20's simply because she appreciates who I am and what I am about.  Although I am in my late 30's and not 2x their age.  The most recent was a 23 year old that was starting a similar career track that got me to where I am at today.  She appreciated my insight, feedback, and mentoring.  She also appreciated that  we could go out and do things together and it wasn't uncomfortable for her, since the majority of her friends were not making the same money she makes (\\~$115k/yr when we met, and \\~$155k/yr after my mentoring her).    She was wise beyond her years, and we had a lot of fun spending time together.  You could say she got some value out of our relationship with my experience and mentoring.\n\n&#x200B;\n\nI've also had tinder women (all ages), want something from me, that I was not willing to participate in.\n\n&#x200B;\n\nI think late 20's to mid 30's is my ideal age range.  21 is the minimum (legally able to go out for a drink is a hard requirement of mine), and most early 20's are very immature (not all, and I don't only judge based on number).",
            "author": "ThisIsTheSugarDaddy",
            "id": "eck4o3o",
            "parent_id": "t1_eck3k3b",
            "score": -8,
            "created_utc": 1545788341.0,
            "replies": []
        },
        {
            "body": "No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years. It's the same reason most women are attracted to tall, lean or muscular men, even when the individual may be a total douche. It's all about the survival of our offspring. \n\nWe may want to deny the animal, but it's still alive in our biology. ",
            "author": null,
            "id": "ecl35qa",
            "parent_id": "t1_eckvmjn",
            "score": 2,
            "created_utc": 1545832520.0,
            "replies": [
                {
                    "body": "> No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years.\n\nYou won't be able to argue this point successfully with anyone offering an opposing view based on merit, as every statement that attempts to contradict this is just someone acting butt-hurt. \n\nBiology ultimately will always be misinterpreted as misogyny. \n\nPut simply, as a man, the better looking you are, the less money you have to pay to overcome anyone else's \"ick\" factor in order to have sex with them.  ",
                    "author": "SDRippington",
                    "id": "eclyu03",
                    "parent_id": "t1_ecl35qa",
                    "score": 4,
                    "created_utc": 1545857708.0,
                    "replies": []
                },
                {
                    "body": "Luckily for many of us, father-daughter bonding leads some women to be attracted to \"dad bods\" too. Sometimes this bonding is unhealthy, but I'm pretty sure even healthy relationships lead to this too. Women often seek out men like their fathers. ",
                    "author": "ContriteSplendaDaddy",
                    "id": "eclztoc",
                    "parent_id": "t1_ecl35qa",
                    "score": 0,
                    "created_utc": 1545858461.0,
                    "replies": [
                        {
                            "body": "I don't believe there are very many women who, offered the choice between Danny Devito and Chris Evans, all other factors being equal, would choose Mr Devito!\n\nThankfully all other factors are not equal, including the availability of specimens like Mr Evans. ",
                            "author": null,
                            "id": "ecm1waf",
                            "parent_id": "t1_eclztoc",
                            "score": 2,
                            "created_utc": 1545860038.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Older people seeking younger people should not be bitter about providing financial compensation. Whether it's a 20 year old and a 60 year old or a 30 year old and 60 year old. What are you mad about? ",
            "author": null,
            "id": "eclz6oh",
            "parent_id": "t1_ecly9pz",
            "score": 3,
            "created_utc": 1545857975.0,
            "replies": [
                {
                    "body": "I'm not mad at anything.\n\nI'm more of a \"gender role\" kind of old fashioned guy anyway. As a man, I pay for dates and courting in the vanilla world - and I help financially whomever I am in a committed relationship with - whether it's vanilla or sugar and regardless of age. I offer what I can and help her to be as enabled for success as possible - whether it's school, work, whatever. \n\nYou asked a very simple question - _\"Why would a 60 yo want a 19 year old anyways?\"_ and I answered it. Basic biology. It doesn't need to really go any further than that. But I will point out two things:\n\n* Tinder is a hookup site. You cannot nor should you make any judgement calls as to whether a person on Tinder (regardless of age) is willing to pay money or not. You're using Tinder at that point just like a drug \"off label\". If you don't like the results, don't complain - just move on.  I can accept people bitching about this on \"Seeking\" or other sugar-based sites. But Tinder? Nope. If people are delusional - let them have their delusion and move on.\n\n* So older people seeing older people should just be \"cool\" about the finance thing, because hey, they're dating in their bracket? What kind of ageist bullshit is that? LMAO!\n\nI'll say this out loud - Personally if a 20 year old woman is with a 22 year old dude that has no direction, drive or would rather kick back with his bro's and smoke a blunt rather than \"be everything he can\" and help the woman financially as a part of being in a relationship? And she puts up with this bullshit?! Then the 20 year old woman is an idiot and she gets what she asked for and gets zero sympathy from me.  \n\nAnd I still find it utterly amusing that so many women on this forum find it incomprehensible that there are, in fact, early twenties women who actually LIKE to be with much older guys irrespective of what financial help they receive. Interestingly enough I find this to happen more often than successful guys paying for platonic relationships - at least based on _personal_ experience. \n\nTotal number of under-28 yo women that choose to be a fuck-buddy for whatever reason and who don't want and refuse \"payment\" beyond the \"date\" itself? Five.\n\nTotal number of \"platonic\" relationships I have paid for? Zero.\n\nAgain, that is just me. I cannot speak for anyone else :-)",
                    "author": "SDRippington",
                    "id": "ecm0m2c",
                    "parent_id": "t1_eclz6oh",
                    "score": 0,
                    "created_utc": 1545859065.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ecmsik2",
            "parent_id": "t1_ecm98xg",
            "score": 9,
            "created_utc": 1545881405.0,
            "replies": [
                {
                    "body": "Ms Escort, This thread was willfully designed to put down the “old” men in the lifestyle. They are being called ugly, disgusting etc. There are so many posts like that here. Frankly it seems it’s intimidating to you to hear from a younger confident guy who says it like it is. Truth can be bitter as you can see.",
                    "author": null,
                    "id": "ecnityr",
                    "parent_id": "t1_ecmsik2",
                    "score": -2,
                    "created_utc": 1545914368.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh, of course not! But he's not so hideous that there may not be *some* attraction there. A 30 year age gap is not unheard of, 45 is crazy.\n\nBut yes, if he was poor he'd be dating someone his own age and she'd be with another rich guy.",
            "author": "blonde-throwaway",
            "id": "ecm242f",
            "parent_id": "t1_ecm1olu",
            "score": 5,
            "created_utc": 1545860201.0,
            "replies": [
                {
                    "body": "Trust me, I want to be able to do exactly what Scott is doing at his age, and seeing beautiful women. It's true that women are often attracted to older men. \n\nI don't fault Scott at all for wanting to be with her. And also I was a little incorrect about the ages, so appreciate the correction. ",
                    "author": "Texas_Rangers",
                    "id": "ecm2f2l",
                    "parent_id": "t1_ecm242f",
                    "score": 1,
                    "created_utc": 1545860421.0,
                    "replies": [
                        {
                            "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
                            "author": "blonde-throwaway",
                            "id": "ecm4jt6",
                            "parent_id": "t1_ecm2f2l",
                            "score": 10,
                            "created_utc": 1545862045.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love of ?",
            "author": "pinotandsugar",
            "id": "ecp0p4e",
            "parent_id": "t1_ecm1olu",
            "score": 1,
            "created_utc": 1545956641.0,
            "replies": []
        },
        {
            "body": "Btw, she's photoshopped *the hell* out of that picture. She's pretty yeah, but you probably wouldn't recognise the girl if she walked past you irl. Check out Instagram vs reality for some insight into pictures like that.",
            "author": "blonde-throwaway",
            "id": "ecm4dxu",
            "parent_id": "t1_ecm1u44",
            "score": 6,
            "created_utc": 1545861909.0,
            "replies": [
                {
                    "body": "Sure I agree. It did looked a little shipped. But she’s stunning with huge breasts. ",
                    "author": "Texas_Rangers",
                    "id": "ecmjm83",
                    "parent_id": "t1_ecm4dxu",
                    "score": 0,
                    "created_utc": 1545873467.0,
                    "replies": [
                        {
                            "body": "Anyone can buy those boobs like she did haha.",
                            "author": "blonde-throwaway",
                            "id": "ecn4ewx",
                            "parent_id": "t1_ecmjm83",
                            "score": 5,
                            "created_utc": 1545893674.0,
                            "replies": []
                        },
                        {
                            "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
                            "author": "SDRippington",
                            "id": "ecmr5n9",
                            "parent_id": "t1_ecmjm83",
                            "score": 1,
                            "created_utc": 1545880294.0,
                            "replies": [
                                {
                                    "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                                    "author": "Texas_Rangers",
                                    "id": "ecmrroq",
                                    "parent_id": "t1_ecmr5n9",
                                    "score": 2,
                                    "created_utc": 1545880796.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I highly doubt any person would actually say that they wouldn't date someone who was previously overweight but isn't now, or someone who didn't exercise and does now because the latter was easy and those behaviors are *so* mentally damaging that the person is now damaged goods. Come on now.",
            "author": "2catsandacomputer",
            "id": "eckrl3t",
            "parent_id": "t1_eckrgs6",
            "score": 10,
            "created_utc": 1545815060.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eck4tis",
            "parent_id": "t1_eck4f4n",
            "score": 22,
            "created_utc": 1545788471.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eck931c",
                    "parent_id": "t1_eck4tis",
                    "score": 14,
                    "created_utc": 1545792439.0,
                    "replies": [
                        {
                            "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
                            "author": "houstonsd",
                            "id": "eckilv5",
                            "parent_id": "t1_eck931c",
                            "score": -3,
                            "created_utc": 1545801846.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How is it delusional if he is dating a younger woman and there is no financial compensation?   The only answer is that he isn’t delusional and therefore completely disproves your point.  \n\nIt sounds like you’re extrapolating a conclusion.  Just because he is a sugar daddy doesn’t mean that all his dates are sugar related.   I don’t know him nor his situation so I can’t verify that.  \n\nBut I can speak for me and my situation and that is that I date vanilla.   My vanilla ages range from early 20’s to mid 50’s.    But, I also sugar and I do so for my own reasons. Vanilla and sugar are not mutually exclusive.   ",
                    "author": "houstonsd",
                    "id": "eck75bk",
                    "parent_id": "t1_eck4tis",
                    "score": 0,
                    "created_utc": 1545790635.0,
                    "replies": []
                },
                {
                    "body": "Tinder is not SA. Why are women looking\nfor paid relationships there? What’s next? Match and eharmony also being a haven for paid dating!",
                    "author": null,
                    "id": "ecl06f0",
                    "parent_id": "t1_eck4tis",
                    "score": 1,
                    "created_utc": 1545829061.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> No matter how much we may not like it, it's basic biology built into us over hundreds of thousands of years.\n\nYou won't be able to argue this point successfully with anyone offering an opposing view based on merit, as every statement that attempts to contradict this is just someone acting butt-hurt. \n\nBiology ultimately will always be misinterpreted as misogyny. \n\nPut simply, as a man, the better looking you are, the less money you have to pay to overcome anyone else's \"ick\" factor in order to have sex with them.  ",
            "author": "SDRippington",
            "id": "eclyu03",
            "parent_id": "t1_ecl35qa",
            "score": 4,
            "created_utc": 1545857708.0,
            "replies": []
        },
        {
            "body": "Luckily for many of us, father-daughter bonding leads some women to be attracted to \"dad bods\" too. Sometimes this bonding is unhealthy, but I'm pretty sure even healthy relationships lead to this too. Women often seek out men like their fathers. ",
            "author": "ContriteSplendaDaddy",
            "id": "eclztoc",
            "parent_id": "t1_ecl35qa",
            "score": 0,
            "created_utc": 1545858461.0,
            "replies": [
                {
                    "body": "I don't believe there are very many women who, offered the choice between Danny Devito and Chris Evans, all other factors being equal, would choose Mr Devito!\n\nThankfully all other factors are not equal, including the availability of specimens like Mr Evans. ",
                    "author": null,
                    "id": "ecm1waf",
                    "parent_id": "t1_eclztoc",
                    "score": 2,
                    "created_utc": 1545860038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm not mad at anything.\n\nI'm more of a \"gender role\" kind of old fashioned guy anyway. As a man, I pay for dates and courting in the vanilla world - and I help financially whomever I am in a committed relationship with - whether it's vanilla or sugar and regardless of age. I offer what I can and help her to be as enabled for success as possible - whether it's school, work, whatever. \n\nYou asked a very simple question - _\"Why would a 60 yo want a 19 year old anyways?\"_ and I answered it. Basic biology. It doesn't need to really go any further than that. But I will point out two things:\n\n* Tinder is a hookup site. You cannot nor should you make any judgement calls as to whether a person on Tinder (regardless of age) is willing to pay money or not. You're using Tinder at that point just like a drug \"off label\". If you don't like the results, don't complain - just move on.  I can accept people bitching about this on \"Seeking\" or other sugar-based sites. But Tinder? Nope. If people are delusional - let them have their delusion and move on.\n\n* So older people seeing older people should just be \"cool\" about the finance thing, because hey, they're dating in their bracket? What kind of ageist bullshit is that? LMAO!\n\nI'll say this out loud - Personally if a 20 year old woman is with a 22 year old dude that has no direction, drive or would rather kick back with his bro's and smoke a blunt rather than \"be everything he can\" and help the woman financially as a part of being in a relationship? And she puts up with this bullshit?! Then the 20 year old woman is an idiot and she gets what she asked for and gets zero sympathy from me.  \n\nAnd I still find it utterly amusing that so many women on this forum find it incomprehensible that there are, in fact, early twenties women who actually LIKE to be with much older guys irrespective of what financial help they receive. Interestingly enough I find this to happen more often than successful guys paying for platonic relationships - at least based on _personal_ experience. \n\nTotal number of under-28 yo women that choose to be a fuck-buddy for whatever reason and who don't want and refuse \"payment\" beyond the \"date\" itself? Five.\n\nTotal number of \"platonic\" relationships I have paid for? Zero.\n\nAgain, that is just me. I cannot speak for anyone else :-)",
            "author": "SDRippington",
            "id": "ecm0m2c",
            "parent_id": "t1_eclz6oh",
            "score": 0,
            "created_utc": 1545859065.0,
            "replies": []
        },
        {
            "body": "Ms Escort, This thread was willfully designed to put down the “old” men in the lifestyle. They are being called ugly, disgusting etc. There are so many posts like that here. Frankly it seems it’s intimidating to you to hear from a younger confident guy who says it like it is. Truth can be bitter as you can see.",
            "author": null,
            "id": "ecnityr",
            "parent_id": "t1_ecmsik2",
            "score": -2,
            "created_utc": 1545914368.0,
            "replies": []
        },
        {
            "body": "Trust me, I want to be able to do exactly what Scott is doing at his age, and seeing beautiful women. It's true that women are often attracted to older men. \n\nI don't fault Scott at all for wanting to be with her. And also I was a little incorrect about the ages, so appreciate the correction. ",
            "author": "Texas_Rangers",
            "id": "ecm2f2l",
            "parent_id": "t1_ecm242f",
            "score": 1,
            "created_utc": 1545860421.0,
            "replies": [
                {
                    "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
                    "author": "blonde-throwaway",
                    "id": "ecm4jt6",
                    "parent_id": "t1_ecm2f2l",
                    "score": 10,
                    "created_utc": 1545862045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure I agree. It did looked a little shipped. But she’s stunning with huge breasts. ",
            "author": "Texas_Rangers",
            "id": "ecmjm83",
            "parent_id": "t1_ecm4dxu",
            "score": 0,
            "created_utc": 1545873467.0,
            "replies": [
                {
                    "body": "Anyone can buy those boobs like she did haha.",
                    "author": "blonde-throwaway",
                    "id": "ecn4ewx",
                    "parent_id": "t1_ecmjm83",
                    "score": 5,
                    "created_utc": 1545893674.0,
                    "replies": []
                },
                {
                    "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
                    "author": "SDRippington",
                    "id": "ecmr5n9",
                    "parent_id": "t1_ecmjm83",
                    "score": 1,
                    "created_utc": 1545880294.0,
                    "replies": [
                        {
                            "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                            "author": "Texas_Rangers",
                            "id": "ecmrroq",
                            "parent_id": "t1_ecmr5n9",
                            "score": 2,
                            "created_utc": 1545880796.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eck931c",
            "parent_id": "t1_eck4tis",
            "score": 14,
            "created_utc": 1545792439.0,
            "replies": [
                {
                    "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
                    "author": "houstonsd",
                    "id": "eckilv5",
                    "parent_id": "t1_eck931c",
                    "score": -3,
                    "created_utc": 1545801846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is it delusional if he is dating a younger woman and there is no financial compensation?   The only answer is that he isn’t delusional and therefore completely disproves your point.  \n\nIt sounds like you’re extrapolating a conclusion.  Just because he is a sugar daddy doesn’t mean that all his dates are sugar related.   I don’t know him nor his situation so I can’t verify that.  \n\nBut I can speak for me and my situation and that is that I date vanilla.   My vanilla ages range from early 20’s to mid 50’s.    But, I also sugar and I do so for my own reasons. Vanilla and sugar are not mutually exclusive.   ",
            "author": "houstonsd",
            "id": "eck75bk",
            "parent_id": "t1_eck4tis",
            "score": 0,
            "created_utc": 1545790635.0,
            "replies": []
        },
        {
            "body": "Tinder is not SA. Why are women looking\nfor paid relationships there? What’s next? Match and eharmony also being a haven for paid dating!",
            "author": null,
            "id": "ecl06f0",
            "parent_id": "t1_eck4tis",
            "score": 1,
            "created_utc": 1545829061.0,
            "replies": []
        },
        {
            "body": "I don't believe there are very many women who, offered the choice between Danny Devito and Chris Evans, all other factors being equal, would choose Mr Devito!\n\nThankfully all other factors are not equal, including the availability of specimens like Mr Evans. ",
            "author": null,
            "id": "ecm1waf",
            "parent_id": "t1_eclztoc",
            "score": 2,
            "created_utc": 1545860038.0,
            "replies": []
        },
        {
            "body": "Well, I wouldn't say women are often attracted to older men. I'd say women are often attracted to *successful* men (which often comes with age). If he was a regular teacher, she'd have no interest in him and an average looking man like him would be dating another average 60 yo woman. And if she could find someone who would treat her exactly the same way who was 35, she'd probably go for him. ",
            "author": "blonde-throwaway",
            "id": "ecm4jt6",
            "parent_id": "t1_ecm2f2l",
            "score": 10,
            "created_utc": 1545862045.0,
            "replies": []
        },
        {
            "body": "Anyone can buy those boobs like she did haha.",
            "author": "blonde-throwaway",
            "id": "ecn4ewx",
            "parent_id": "t1_ecmjm83",
            "score": 5,
            "created_utc": 1545893674.0,
            "replies": []
        },
        {
            "body": "Bah. I'd pass on two dozen women like her with huge breasts for just ONE Kate Beckinsale. OMG in a heartbeat.\n\nKristina is well on her way to lower back problems. Hope she has a good Chiropractor :-)\n",
            "author": "SDRippington",
            "id": "ecmr5n9",
            "parent_id": "t1_ecmjm83",
            "score": 1,
            "created_utc": 1545880294.0,
            "replies": [
                {
                    "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
                    "author": "Texas_Rangers",
                    "id": "ecmrroq",
                    "parent_id": "t1_ecmr5n9",
                    "score": 2,
                    "created_utc": 1545880796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If something doesn’t fit your narrative then the next defense is to call bs.  Unfortunately that turns the person into an ignorant participant. ",
            "author": "houstonsd",
            "id": "eckilv5",
            "parent_id": "t1_eck931c",
            "score": -3,
            "created_utc": 1545801846.0,
            "replies": []
        },
        {
            "body": "I prefer smaller breasts too actually. But I can recognize a nice larger  pair!",
            "author": "Texas_Rangers",
            "id": "ecmrroq",
            "parent_id": "t1_ecmr5n9",
            "score": 2,
            "created_utc": 1545880796.0,
            "replies": []
        }
    ]
}