{
    "title": "sasuke really holdin that no nut lifetime",
    "post_id": "k6guk9",
    "post_url": "https://www.reddit.com/r/dankruto/comments/k6guk9/sasuke_really_holdin_that_no_nut_lifetime/",
    "author": "jeteodor",
    "body": "",
    "url": "https://i.redd.it/brvep0s9p4361.jpg",
    "score": 6286,
    "upvote_ratio": 0.98,
    "created_utc": 1607069523.0,
    "num_comments": 104,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I Guess killing Itachi was more important than the survival of his clan lol",
            "author": "NekoPower2169",
            "id": "gel1nfj",
            "parent_id": "t3_k6guk9",
            "score": 447,
            "created_utc": 1607080389.0,
            "replies": [
                {
                    "body": "My man said he was gonna restore his clan but only had one child",
                    "author": "cubbyfanboy",
                    "id": "gelf6mk",
                    "parent_id": "t1_gel1nfj",
                    "score": 326,
                    "created_utc": 1607089731.0,
                    "replies": [
                        {
                            "body": "Why do you think he’s traveling so often? He’s spreading that Sharingan, man, but he ain’t tryin to get caught...",
                            "author": null,
                            "id": "gelr3fa",
                            "parent_id": "t1_gelf6mk",
                            "score": 236,
                            "created_utc": 1607096342.0,
                            "replies": [
                                {
                                    "body": "Sasukum",
                                    "author": "Mike_0xmaul",
                                    "id": "gelz24j",
                                    "parent_id": "t1_gelr3fa",
                                    "score": 64,
                                    "created_utc": 1607100219.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And its a girl, so her surname gonna change depends on the clan she marries with",
                            "author": "Kulutiheges",
                            "id": "gelknrt",
                            "parent_id": "t1_gelf6mk",
                            "score": 81,
                            "created_utc": 1607092957.0,
                            "replies": [
                                {
                                    "body": "Maybe not. She could just keep the uchiha title",
                                    "author": "YUNGBOYBOI",
                                    "id": "gelxwl5",
                                    "parent_id": "t1_gelknrt",
                                    "score": 49,
                                    "created_utc": 1607099669.0,
                                    "replies": [
                                        {
                                            "body": "Not if she marries into a bigger/influential clan, which it’s pretty much an inevitability considering she’s one of two Uchihas. \n\nEven if she married Boruto, the Uzumaki name is automatically more prestigious due to the Hokage being an Uzumaki, so it’d be Sarada Uzumaki anyways.",
                                            "author": "SnoopyGoldberg",
                                            "id": "gemi6n6",
                                            "parent_id": "t1_gelxwl5",
                                            "score": 23,
                                            "created_utc": 1607109280.0,
                                            "replies": [
                                                {
                                                    "body": "Even if she marries someone from a clan, the Uchiha name and renown still puts them over pretty much any other clan then the Hyuuga. Not to mention any of the possible clan restoration laws that might be in place to keep clans from going extinct.",
                                                    "author": "TheGreyDestroyer7",
                                                    "id": "gemlgkh",
                                                    "parent_id": "t1_gemi6n6",
                                                    "score": 16,
                                                    "created_utc": 1607110851.0,
                                                    "replies": [
                                                        {
                                                            "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gemolsw",
                                                            "parent_id": "t1_gemlgkh",
                                                            "score": 11,
                                                            "created_utc": 1607112390.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                                                                    "author": "martinmix52",
                                                                    "id": "gen0ut7",
                                                                    "parent_id": "t1_gemolsw",
                                                                    "score": 15,
                                                                    "created_utc": 1607118569.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "gen1da9",
                                                                            "parent_id": "t1_gen0ut7",
                                                                            "score": 4,
                                                                            "created_utc": 1607118837.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                                                                    "author": "PikaYoshl",
                                                                                    "id": "gepxgfe",
                                                                                    "parent_id": "t1_gen1da9",
                                                                                    "score": 3,
                                                                                    "created_utc": 1607192440.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                                                                            "author": "TyrionGoldenLion",
                                                                                            "id": "gepxmi2",
                                                                                            "parent_id": "t1_gepxgfe",
                                                                                            "score": -1,
                                                                                            "created_utc": 1607192523.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                                                                    "author": "PikaYoshl",
                                                                                                    "id": "gepzuz9",
                                                                                                    "parent_id": "t1_gepxmi2",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1607193522.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                                                                            "author": "TyrionGoldenLion",
                                                                                                            "id": "geq0657",
                                                                                                            "parent_id": "t1_gepzuz9",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1607193662.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                                                                    "author": "PikaYoshl",
                                                                                                                    "id": "geq1x4p",
                                                                                                                    "parent_id": "t1_geq0657",
                                                                                                                    "score": 1,
                                                                                                                    "created_utc": 1607194512.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                                                                    "author": "martinmix52",
                                                                                    "id": "gen1z0k",
                                                                                    "parent_id": "t1_gen1da9",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607119155.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                                                                            "author": "TyrionGoldenLion",
                                                                                            "id": "gen27k0",
                                                                                            "parent_id": "t1_gen1z0k",
                                                                                            "score": 1,
                                                                                            "created_utc": 1607119281.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                                                                    "author": "martinmix52",
                                                                                                    "id": "gen2wms",
                                                                                                    "parent_id": "t1_gen27k0",
                                                                                                    "score": 6,
                                                                                                    "created_utc": 1607119649.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                                                                    "author": "TheGreyDestroyer7",
                                                                    "id": "gemuigx",
                                                                    "parent_id": "t1_gemolsw",
                                                                    "score": 3,
                                                                    "created_utc": 1607115344.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "gemzmef",
                                                                            "parent_id": "t1_gemuigx",
                                                                            "score": 3,
                                                                            "created_utc": 1607117931.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                                                                    "author": "TheGreyDestroyer7",
                                                                                    "id": "gen01iy",
                                                                                    "parent_id": "t1_gemzmef",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607118149.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                                                                    "author": null,
                                                                    "id": "hitlybp",
                                                                    "parent_id": "t1_gemolsw",
                                                                    "score": 1,
                                                                    "created_utc": 1635721887.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "hivb2w9",
                                                                            "parent_id": "t1_hitlybp",
                                                                            "score": 1,
                                                                            "created_utc": 1635763013.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Wait what",
                                                                                    "author": null,
                                                                                    "id": "hiwjdvw",
                                                                                    "parent_id": "t1_hivb2w9",
                                                                                    "score": 1,
                                                                                    "created_utc": 1635786188.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "If Boruto and Sarada get married, then Hiashi's plan finally came to fruition",
                                                    "author": "JealotGaming",
                                                    "id": "geqbudb",
                                                    "parent_id": "t1_gemi6n6",
                                                    "score": 1,
                                                    "created_utc": 1607199495.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "He could just bang random chicks on his travels 🤣",
                                            "author": null,
                                            "id": "genkvfp",
                                            "parent_id": "t1_gelxwl5",
                                            "score": 1,
                                            "created_utc": 1607129781.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Doesn't really matter cuz the Sharingan will still be passed down",
                                    "author": "alli_kat1010",
                                    "id": "gem4zsb",
                                    "parent_id": "t1_gelknrt",
                                    "score": 8,
                                    "created_utc": 1607103043.0,
                                    "replies": [
                                        {
                                            "body": "Maybe not, Boruto is a Hyuga and he doesn't have the Byakugan; Sarada's child might not have the Sharingan and the Dojutsu could disappear.",
                                            "author": "Yamcha17",
                                            "id": "gemtu91",
                                            "parent_id": "t1_gem4zsb",
                                            "score": 3,
                                            "created_utc": 1607115007.0,
                                            "replies": [
                                                {
                                                    "body": "Would be an unlucky person.  Especially with the Boruto would being more and more kushy for the kids, they don't have to fight like their parents did.\n\nSharingan is awakened through toil, so it may just die out naturally.",
                                                    "author": "alli_kat1010",
                                                    "id": "gemzhr8",
                                                    "parent_id": "t1_gemtu91",
                                                    "score": 4,
                                                    "created_utc": 1607117865.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Or Sharingan is the dominant gene, it could just be dormant in her kids DNA, and her grandkid could still end up with the Sharingan even if their parent didn’t.",
                                                    "author": "TheCleanestKing",
                                                    "id": "gjnz22u",
                                                    "parent_id": "t1_gemtu91",
                                                    "score": 2,
                                                    "created_utc": 1610927947.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Then you haven't met Ino Yamanaka.",
                                    "author": "Toyo_Ibiang",
                                    "id": "gemwg1g",
                                    "parent_id": "t1_gelknrt",
                                    "score": 1,
                                    "created_utc": 1607116315.0,
                                    "replies": [
                                        {
                                            "body": "Sia didn't have a clan name",
                                            "author": "ginganinja29",
                                            "id": "gemxtyk",
                                            "parent_id": "t1_gemwg1g",
                                            "score": 2,
                                            "created_utc": 1607117017.0,
                                            "replies": [
                                                {
                                                    "body": "I didn't know *Sia* was a ninja (a kunoichi to be precise)",
                                                    "author": "Toyo_Ibiang",
                                                    "id": "gemym0i",
                                                    "parent_id": "t1_gemxtyk",
                                                    "score": 2,
                                                    "created_utc": 1607117412.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Priorities.",
                    "author": "SurpriseSweet",
                    "id": "gelckro",
                    "parent_id": "t1_gel1nfj",
                    "score": 28,
                    "created_utc": 1607088190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We all know he sent a little bottle of his sperm back to the village for Sakura. He’s no simp",
            "author": "AngonceMcGhee",
            "id": "gelghlq",
            "parent_id": "t3_k6guk9",
            "score": 150,
            "created_utc": 1607090534.0,
            "replies": [
                {
                    "body": "true chad energy right there",
                    "author": "ZenXgaming100",
                    "id": "gelqf9m",
                    "parent_id": "t1_gelghlq",
                    "score": 47,
                    "created_utc": 1607096001.0,
                    "replies": []
                },
                {
                    "body": "What a legend",
                    "author": "Shadow25Soldier",
                    "id": "gelyj3y",
                    "parent_id": "t1_gelghlq",
                    "score": 18,
                    "created_utc": 1607099970.0,
                    "replies": []
                },
                {
                    "body": "This is boruto canon",
                    "author": "xXGoobyXx",
                    "id": "gen98t1",
                    "parent_id": "t1_gelghlq",
                    "score": 11,
                    "created_utc": 1607123084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where is naruto in this image",
            "author": null,
            "id": "gekr3r6",
            "parent_id": "t3_k6guk9",
            "score": 384,
            "created_utc": 1607069985.0,
            "replies": [
                {
                    "body": "Under the laptop, blowing Sasuke.",
                    "author": "TyrionGoldenLion",
                    "id": "gekthec",
                    "parent_id": "t1_gekr3r6",
                    "score": 702,
                    "created_utc": 1607072298.0,
                    "replies": [
                        {
                            "body": "This made me laugh.",
                            "author": "loneabhi",
                            "id": "gekx4k6",
                            "parent_id": "t1_gekthec",
                            "score": 110,
                            "created_utc": 1607076057.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gel2a4k",
                            "parent_id": "t1_gekthec",
                            "score": 50,
                            "created_utc": 1607080868.0,
                            "replies": [
                                {
                                    "body": "Sasuke feels the sensation and pleasure while looking at Itachi's photos on his laptop...",
                                    "author": "TyrionGoldenLion",
                                    "id": "gel2qaa",
                                    "parent_id": "t1_gel2a4k",
                                    "score": 47,
                                    "created_utc": 1607081210.0,
                                    "replies": [
                                        {
                                            "body": "Nah nah looking at photos of Itachi’s dead body",
                                            "author": "AngonceMcGhee",
                                            "id": "gelgfcq",
                                            "parent_id": "t1_gel2qaa",
                                            "score": 13,
                                            "created_utc": 1607090494.0,
                                            "replies": [
                                                {
                                                    "body": "\"A dead body shouldn't feel this warm...\"",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gelgsdq",
                                                    "parent_id": "t1_gelgfcq",
                                                    "score": 18,
                                                    "created_utc": 1607090716.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "more like a feeling of pride and accomplishment that only can come from EA",
                                            "author": null,
                                            "id": "gelyb7u",
                                            "parent_id": "t1_gel2qaa",
                                            "score": 5,
                                            "created_utc": 1607099864.0,
                                            "replies": [
                                                {
                                                    "body": "\"Wow, I have a blond dunce's mouth around my cock, I'm so accomplished. uwu\"\n\nUchiha Sasuke, probably",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gelyo6d",
                                                    "parent_id": "t1_gelyb7u",
                                                    "score": 6,
                                                    "created_utc": 1607100036.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "To be fair I get off on performing glory kills and using the chainsaw in DOOM. \n\nThere's just something so satisfying about the crack heard when I snap an imp's neck, or the soothing hum of the chainsaw's engine, purring like a kitten as my controller vibrates between my hands, that perfect balance of give and resistance as the whirling teeth of the blades saw through demon flesh and muscle and bone, and the way their unholy blood spatters all over the place like liquid red confetti, as if to congratulate me on another job well done. Hell is one big dance party, I'm the DJ, and the soundtrack is a wicked mix of heavy metal, gunshots, and the screams of the damned. *And I love every second of it.*",
                                                    "author": "HollyTheMage",
                                                    "id": "gesr8mt",
                                                    "parent_id": "t1_gelyb7u",
                                                    "score": 0,
                                                    "created_utc": 1607242713.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Correct answer",
                            "author": "JoeyMarvolo",
                            "id": "gellreg",
                            "parent_id": "t1_gekthec",
                            "score": 6,
                            "created_utc": 1607093560.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "ikr 😭",
                    "author": "jeteodor",
                    "id": "gekt26t",
                    "parent_id": "t1_gekr3r6",
                    "score": 17,
                    "created_utc": 1607071880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Killing Itachi —> destroying konoha —> fucking Naruto in the ass",
            "author": "dkelly07",
            "id": "gelex7r",
            "parent_id": "t3_k6guk9",
            "score": 150,
            "created_utc": 1607089568.0,
            "replies": [
                {
                    "body": "a simple plan",
                    "author": null,
                    "id": "gelycxp",
                    "parent_id": "t1_gelex7r",
                    "score": 30,
                    "created_utc": 1607099887.0,
                    "replies": []
                },
                {
                    "body": "Naruto is a bottom??",
                    "author": "ambidextrousambivert",
                    "id": "gem724n",
                    "parent_id": "t1_gelex7r",
                    "score": 9,
                    "created_utc": 1607104013.0,
                    "replies": [
                        {
                            "body": "[Yes](https://twitter.com/bottom_naruto?s=09)",
                            "author": "Schooney123",
                            "id": "gemqkss",
                            "parent_id": "t1_gem724n",
                            "score": 11,
                            "created_utc": 1607113379.0,
                            "replies": [
                                {
                                    "body": "Block me back",
                                    "author": "ambidextrousambivert",
                                    "id": "gemr049",
                                    "parent_id": "t1_gemqkss",
                                    "score": 7,
                                    "created_utc": 1607113591.0,
                                    "replies": []
                                },
                                {
                                    "body": "Sasugay senpai sure is Hot",
                                    "author": "AJGILL03",
                                    "id": "geo685q",
                                    "parent_id": "t1_gemqkss",
                                    "score": 5,
                                    "created_utc": 1607143099.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Everyone knows sasuke don't give a dam about them from ep 1 to 500 the only thing he know that kill Itachi , surpass naruto",
            "author": "Crosshairs2003",
            "id": "gelga72",
            "parent_id": "t3_k6guk9",
            "score": 47,
            "created_utc": 1607090409.0,
            "replies": [
                {
                    "body": "1-134...",
                    "author": "SSJKarot",
                    "id": "gemrmvy",
                    "parent_id": "t1_gelga72",
                    "score": 7,
                    "created_utc": 1607113908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've always wanted to know the backstory to this photo",
            "author": null,
            "id": "gelq2eh",
            "parent_id": "t3_k6guk9",
            "score": 23,
            "created_utc": 1607095818.0,
            "replies": []
        },
        {
            "body": "Sasuke is a true chad",
            "author": "alphawolf446",
            "id": "gel4j02",
            "parent_id": "t3_k6guk9",
            "score": 44,
            "created_utc": 1607082366.0,
            "replies": []
        },
        {
            "body": "That sakura-ino interaction tho",
            "author": "catu91",
            "id": "gelwyhv",
            "parent_id": "t3_k6guk9",
            "score": 17,
            "created_utc": 1607099218.0,
            "replies": []
        },
        {
            "body": "Anyone know where the original pic is from?",
            "author": "savage_49",
            "id": "gell3x6",
            "parent_id": "t3_k6guk9",
            "score": 15,
            "created_utc": 1607093204.0,
            "replies": [
                {
                    "body": "A college party, perhaps?",
                    "author": "AJGILL03",
                    "id": "gelwg18",
                    "parent_id": "t1_gell3x6",
                    "score": 11,
                    "created_utc": 1607098969.0,
                    "replies": [
                        {
                            "body": "Man I went to the wrong college parties then",
                            "author": "Brendan_Fraser",
                            "id": "gena6bx",
                            "parent_id": "t1_gelwg18",
                            "score": 6,
                            "created_utc": 1607123608.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wait when did Ino and Sakura get down like that??!!!",
            "author": "SonicNKnucklesCukold",
            "id": "gelyyhv",
            "parent_id": "t3_k6guk9",
            "score": 14,
            "created_utc": 1607100172.0,
            "replies": [
                {
                    "body": "I mean we all knew they were more than friends",
                    "author": "savagejordan1217",
                    "id": "gemcs6n",
                    "parent_id": "t1_gelyyhv",
                    "score": 10,
                    "created_utc": 1607106716.0,
                    "replies": [
                        {
                            "body": "Just like Naruto and Sasuke",
                            "author": "IAmYoDaddyDuh",
                            "id": "gemp1nx",
                            "parent_id": "t1_gemcs6n",
                            "score": 14,
                            "created_utc": 1607112610.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Brah this even has the original poster's watermark.",
            "author": "_beloved",
            "id": "gelhj4j",
            "parent_id": "t3_k6guk9",
            "score": 10,
            "created_utc": 1607091164.0,
            "replies": []
        },
        {
            "body": "This is epicc😂👌🏼",
            "author": "MickTheDickk",
            "id": "gekshdx",
            "parent_id": "t3_k6guk9",
            "score": 18,
            "created_utc": 1607071322.0,
            "replies": []
        },
        {
            "body": "That what seeking for revenge do to a MF",
            "author": "sayUwUpolitely",
            "id": "gelk3an",
            "parent_id": "t3_k6guk9",
            "score": 5,
            "created_utc": 1607092641.0,
            "replies": []
        },
        {
            "body": "He already F\\*\\*\\*ed sakura",
            "author": "ngess46",
            "id": "geleqlr",
            "parent_id": "t3_k6guk9",
            "score": 9,
            "created_utc": 1607089454.0,
            "replies": [
                {
                    "body": "Yeah like once, he was so ashemed of him self that he left the village for 13 years",
                    "author": "YeetMomentum",
                    "id": "gelfrpi",
                    "parent_id": "t1_geleqlr",
                    "score": 69,
                    "created_utc": 1607090095.0,
                    "replies": [
                        {
                            "body": "I don't think you realize the average amount you gotta bang someone to get them pregnant",
                            "author": "Edvart",
                            "id": "gemt75g",
                            "parent_id": "t1_gelfrpi",
                            "score": -7,
                            "created_utc": 1607114688.0,
                            "replies": [
                                {
                                    "body": "Did... Did u forget this is anime? Ive seen anime in wich the MC just looks at the girl and She gets pregnant, hell in anime a blow job is enough to get someone pregnant. Im also guessing u never Heard of a joke, mark this as your first one (careful not to get pregnant tho).",
                                    "author": "YeetMomentum",
                                    "id": "gen13fp",
                                    "parent_id": "t1_gemt75g",
                                    "score": 6,
                                    "created_utc": 1607118693.0,
                                    "replies": [
                                        {
                                            "body": "Butthurt :)",
                                            "author": "Edvart",
                                            "id": "gen1ly6",
                                            "parent_id": "t1_gen13fp",
                                            "score": -7,
                                            "created_utc": 1607118964.0,
                                            "replies": [
                                                {
                                                    "body": "Damn, u go around telling ppl they are stupid for not knowing (insert common aspect) just so u can feel better abount yourself, and when u dont have an argument back u just call them butthurt, amazing Reddit moment. U should go to Twitter lol(this is ur seccond joke If im not wrong)",
                                                    "author": "YeetMomentum",
                                                    "id": "gen23i4",
                                                    "parent_id": "t1_gen1ly6",
                                                    "score": 3,
                                                    "created_utc": 1607119221.0,
                                                    "replies": [
                                                        {
                                                            "body": "Salt",
                                                            "author": "Edvart",
                                                            "id": "genbu42",
                                                            "parent_id": "t1_gen23i4",
                                                            "score": -2,
                                                            "created_utc": 1607124530.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I dont think that why he left the village.",
                            "author": "ngess46",
                            "id": "gelgvt9",
                            "parent_id": "t1_gelfrpi",
                            "score": -29,
                            "created_utc": 1607090774.0,
                            "replies": [
                                {
                                    "body": "He did",
                                    "author": "ashdasshh",
                                    "id": "gelif17",
                                    "parent_id": "t1_gelgvt9",
                                    "score": 36,
                                    "created_utc": 1607091687.0,
                                    "replies": [
                                        {
                                            "body": "He didnt -_-",
                                            "author": "ngess46",
                                            "id": "geljpww",
                                            "parent_id": "t1_gelif17",
                                            "score": -20,
                                            "created_utc": 1607092429.0,
                                            "replies": [
                                                {
                                                    "body": "Yes he did. Kishimoto himself said so",
                                                    "author": "ashdasshh",
                                                    "id": "geljsek",
                                                    "parent_id": "t1_geljpww",
                                                    "score": 27,
                                                    "created_utc": 1607092468.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are you doing step ninja?",
            "author": "Seallypoops",
            "id": "gellkou",
            "parent_id": "t3_k6guk9",
            "score": 8,
            "created_utc": 1607093460.0,
            "replies": []
        },
        {
            "body": "If either ino or sakura were a man, they 100% would’ve ended up together",
            "author": "lord-shaxxophone",
            "id": "gen2b73",
            "parent_id": "t3_k6guk9",
            "score": 3,
            "created_utc": 1607119334.0,
            "replies": []
        },
        {
            "body": "That’s a meme brought back from the grave",
            "author": "slayer420698",
            "id": "gelntni",
            "parent_id": "t3_k6guk9",
            "score": 5,
            "created_utc": 1607094663.0,
            "replies": []
        },
        {
            "body": "don't let those hoes get in the way of your goals",
            "author": "Sabbi644",
            "id": "gem6v51",
            "parent_id": "t3_k6guk9",
            "score": 2,
            "created_utc": 1607103924.0,
            "replies": []
        },
        {
            "body": "Wait ...is no one gunna question what tf is going on here....y aint he jumping in",
            "author": "cianmontanarini",
            "id": "gen7xlg",
            "parent_id": "t3_k6guk9",
            "score": 2,
            "created_utc": 1607122371.0,
            "replies": []
        },
        {
            "body": "I mean he could always sharingan a girl to do whatever he wants. That reminds me where did those sharingan akatski white people come from? Did Sauske do it with a Zetsu?",
            "author": "Suitable_Letterhead0",
            "id": "geov6kw",
            "parent_id": "t3_k6guk9",
            "score": 2,
            "created_utc": 1607166742.0,
            "replies": []
        },
        {
            "body": "u/repostsleuthbot",
            "author": "Abs0luteZer00",
            "id": "gemgcp1",
            "parent_id": "t3_k6guk9",
            "score": 3,
            "created_utc": 1607108407.0,
            "replies": [
                {
                    "body": "The bot is dumb here is the orignal link [https://www.reddit.com/r/dankruto/comments/innwfb/sauceke/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/dankruto/comments/innwfb/sauceke/?utm_source=share&utm_medium=web2x&context=3)",
                    "author": null,
                    "id": "geolx83",
                    "parent_id": "t1_gemgcp1",
                    "score": 2,
                    "created_utc": 1607156439.0,
                    "replies": []
                },
                {
                    "body": "I didn't find any posts that meet the matching requirements for r/dankruto. \n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n This search triggered my meme filter. This enabled strict matching requirements. The closest match that did not meet the requirements [is this post](https://redd.it/fw84n0)\n\n*Feedback? Hate? Visit r/repostsleuthbot - I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"k6guk9\", \"meme_template\": 64489}) ]* \n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=k6guk9&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=true&targetImageMatch=86&targetImageMemeMatch=96)",
                    "author": "RepostSleuthBot",
                    "id": "gemgew8",
                    "parent_id": "t1_gemgcp1",
                    "score": 2,
                    "created_utc": 1607108436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Repost",
            "author": "sooka-asylum",
            "id": "gel5q0a",
            "parent_id": "t3_k6guk9",
            "score": 2,
            "created_utc": 1607083185.0,
            "replies": []
        },
        {
            "body": "You already know",
            "author": "ShadowH0kage",
            "id": "gel8pnu",
            "parent_id": "t3_k6guk9",
            "score": 3,
            "created_utc": 1607085547.0,
            "replies": []
        },
        {
            "body": "Repost",
            "author": "3727rhfh",
            "id": "gel3ukr",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607081906.0,
            "replies": [
                {
                    "body": "Might be, but I just joined recently and this is hilarious",
                    "author": "Bmartin_",
                    "id": "gelg6nk",
                    "parent_id": "t1_gel3ukr",
                    "score": 9,
                    "created_utc": 1607090349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "r/RepostSleuthBot",
            "author": "FullMoon_Escapade",
            "id": "geldptu",
            "parent_id": "t3_k6guk9",
            "score": 0,
            "created_utc": 1607088826.0,
            "replies": []
        },
        {
            "body": "Sasuke knows semen retention equals massive boost in skills 😂",
            "author": null,
            "id": "gem2a33",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607101754.0,
            "replies": []
        },
        {
            "body": "REPOST\n\nOrignal link-[https://www.reddit.com/r/dankruto/comments/innwfb/sauceke/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/dankruto/comments/innwfb/sauceke/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\nthis was posted 2 months ago in same subreddit by u/BogartBlackhole",
            "author": null,
            "id": "geolyd7",
            "parent_id": "t3_k6guk9",
            "score": 0,
            "created_utc": 1607156472.0,
            "replies": []
        },
        {
            "body": "Where is this scene from?",
            "author": "egor091",
            "id": "gelx3ef",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607099282.0,
            "replies": [
                {
                    "body": "Rule34 I think",
                    "author": "IAmYoDaddyDuh",
                    "id": "gemp334",
                    "parent_id": "t1_gelx3ef",
                    "score": 1,
                    "created_utc": 1607112629.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hot",
            "author": "IAmYoDaddyDuh",
            "id": "gemp540",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607112657.0,
            "replies": []
        },
        {
            "body": "Lmaooo",
            "author": "bhargav_8271",
            "id": "gemurhs",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607115468.0,
            "replies": []
        },
        {
            "body": "Have you ever wondered why I'm away all the time?",
            "author": "Sasuke12187",
            "id": "gemyths",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607117519.0,
            "replies": []
        },
        {
            "body": "LOL, too funny",
            "author": "Diamondgurl_69",
            "id": "gen98ra",
            "parent_id": "t3_k6guk9",
            "score": 1,
            "created_utc": 1607123084.0,
            "replies": []
        },
        {
            "body": "My man said he was gonna restore his clan but only had one child",
            "author": "cubbyfanboy",
            "id": "gelf6mk",
            "parent_id": "t1_gel1nfj",
            "score": 326,
            "created_utc": 1607089731.0,
            "replies": [
                {
                    "body": "Why do you think he’s traveling so often? He’s spreading that Sharingan, man, but he ain’t tryin to get caught...",
                    "author": null,
                    "id": "gelr3fa",
                    "parent_id": "t1_gelf6mk",
                    "score": 236,
                    "created_utc": 1607096342.0,
                    "replies": [
                        {
                            "body": "Sasukum",
                            "author": "Mike_0xmaul",
                            "id": "gelz24j",
                            "parent_id": "t1_gelr3fa",
                            "score": 64,
                            "created_utc": 1607100219.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And its a girl, so her surname gonna change depends on the clan she marries with",
                    "author": "Kulutiheges",
                    "id": "gelknrt",
                    "parent_id": "t1_gelf6mk",
                    "score": 81,
                    "created_utc": 1607092957.0,
                    "replies": [
                        {
                            "body": "Maybe not. She could just keep the uchiha title",
                            "author": "YUNGBOYBOI",
                            "id": "gelxwl5",
                            "parent_id": "t1_gelknrt",
                            "score": 49,
                            "created_utc": 1607099669.0,
                            "replies": [
                                {
                                    "body": "Not if she marries into a bigger/influential clan, which it’s pretty much an inevitability considering she’s one of two Uchihas. \n\nEven if she married Boruto, the Uzumaki name is automatically more prestigious due to the Hokage being an Uzumaki, so it’d be Sarada Uzumaki anyways.",
                                    "author": "SnoopyGoldberg",
                                    "id": "gemi6n6",
                                    "parent_id": "t1_gelxwl5",
                                    "score": 23,
                                    "created_utc": 1607109280.0,
                                    "replies": [
                                        {
                                            "body": "Even if she marries someone from a clan, the Uchiha name and renown still puts them over pretty much any other clan then the Hyuuga. Not to mention any of the possible clan restoration laws that might be in place to keep clans from going extinct.",
                                            "author": "TheGreyDestroyer7",
                                            "id": "gemlgkh",
                                            "parent_id": "t1_gemi6n6",
                                            "score": 16,
                                            "created_utc": 1607110851.0,
                                            "replies": [
                                                {
                                                    "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gemolsw",
                                                    "parent_id": "t1_gemlgkh",
                                                    "score": 11,
                                                    "created_utc": 1607112390.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                                                            "author": "martinmix52",
                                                            "id": "gen0ut7",
                                                            "parent_id": "t1_gemolsw",
                                                            "score": 15,
                                                            "created_utc": 1607118569.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gen1da9",
                                                                    "parent_id": "t1_gen0ut7",
                                                                    "score": 4,
                                                                    "created_utc": 1607118837.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                                                            "author": "PikaYoshl",
                                                                            "id": "gepxgfe",
                                                                            "parent_id": "t1_gen1da9",
                                                                            "score": 3,
                                                                            "created_utc": 1607192440.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                                                                    "author": "TyrionGoldenLion",
                                                                                    "id": "gepxmi2",
                                                                                    "parent_id": "t1_gepxgfe",
                                                                                    "score": -1,
                                                                                    "created_utc": 1607192523.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                                                            "author": "PikaYoshl",
                                                                                            "id": "gepzuz9",
                                                                                            "parent_id": "t1_gepxmi2",
                                                                                            "score": 2,
                                                                                            "created_utc": 1607193522.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                                                                    "author": "TyrionGoldenLion",
                                                                                                    "id": "geq0657",
                                                                                                    "parent_id": "t1_gepzuz9",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1607193662.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                                                            "author": "PikaYoshl",
                                                                                                            "id": "geq1x4p",
                                                                                                            "parent_id": "t1_geq0657",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1607194512.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                                                            "author": "martinmix52",
                                                                            "id": "gen1z0k",
                                                                            "parent_id": "t1_gen1da9",
                                                                            "score": 1,
                                                                            "created_utc": 1607119155.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                                                                    "author": "TyrionGoldenLion",
                                                                                    "id": "gen27k0",
                                                                                    "parent_id": "t1_gen1z0k",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607119281.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                                                            "author": "martinmix52",
                                                                                            "id": "gen2wms",
                                                                                            "parent_id": "t1_gen27k0",
                                                                                            "score": 6,
                                                                                            "created_utc": 1607119649.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                                                            "author": "TheGreyDestroyer7",
                                                            "id": "gemuigx",
                                                            "parent_id": "t1_gemolsw",
                                                            "score": 3,
                                                            "created_utc": 1607115344.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gemzmef",
                                                                    "parent_id": "t1_gemuigx",
                                                                    "score": 3,
                                                                    "created_utc": 1607117931.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                                                            "author": "TheGreyDestroyer7",
                                                                            "id": "gen01iy",
                                                                            "parent_id": "t1_gemzmef",
                                                                            "score": 1,
                                                                            "created_utc": 1607118149.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                                                            "author": null,
                                                            "id": "hitlybp",
                                                            "parent_id": "t1_gemolsw",
                                                            "score": 1,
                                                            "created_utc": 1635721887.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "hivb2w9",
                                                                    "parent_id": "t1_hitlybp",
                                                                    "score": 1,
                                                                    "created_utc": 1635763013.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Wait what",
                                                                            "author": null,
                                                                            "id": "hiwjdvw",
                                                                            "parent_id": "t1_hivb2w9",
                                                                            "score": 1,
                                                                            "created_utc": 1635786188.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "If Boruto and Sarada get married, then Hiashi's plan finally came to fruition",
                                            "author": "JealotGaming",
                                            "id": "geqbudb",
                                            "parent_id": "t1_gemi6n6",
                                            "score": 1,
                                            "created_utc": 1607199495.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "He could just bang random chicks on his travels 🤣",
                                    "author": null,
                                    "id": "genkvfp",
                                    "parent_id": "t1_gelxwl5",
                                    "score": 1,
                                    "created_utc": 1607129781.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Doesn't really matter cuz the Sharingan will still be passed down",
                            "author": "alli_kat1010",
                            "id": "gem4zsb",
                            "parent_id": "t1_gelknrt",
                            "score": 8,
                            "created_utc": 1607103043.0,
                            "replies": [
                                {
                                    "body": "Maybe not, Boruto is a Hyuga and he doesn't have the Byakugan; Sarada's child might not have the Sharingan and the Dojutsu could disappear.",
                                    "author": "Yamcha17",
                                    "id": "gemtu91",
                                    "parent_id": "t1_gem4zsb",
                                    "score": 3,
                                    "created_utc": 1607115007.0,
                                    "replies": [
                                        {
                                            "body": "Would be an unlucky person.  Especially with the Boruto would being more and more kushy for the kids, they don't have to fight like their parents did.\n\nSharingan is awakened through toil, so it may just die out naturally.",
                                            "author": "alli_kat1010",
                                            "id": "gemzhr8",
                                            "parent_id": "t1_gemtu91",
                                            "score": 4,
                                            "created_utc": 1607117865.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Or Sharingan is the dominant gene, it could just be dormant in her kids DNA, and her grandkid could still end up with the Sharingan even if their parent didn’t.",
                                            "author": "TheCleanestKing",
                                            "id": "gjnz22u",
                                            "parent_id": "t1_gemtu91",
                                            "score": 2,
                                            "created_utc": 1610927947.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Then you haven't met Ino Yamanaka.",
                            "author": "Toyo_Ibiang",
                            "id": "gemwg1g",
                            "parent_id": "t1_gelknrt",
                            "score": 1,
                            "created_utc": 1607116315.0,
                            "replies": [
                                {
                                    "body": "Sia didn't have a clan name",
                                    "author": "ginganinja29",
                                    "id": "gemxtyk",
                                    "parent_id": "t1_gemwg1g",
                                    "score": 2,
                                    "created_utc": 1607117017.0,
                                    "replies": [
                                        {
                                            "body": "I didn't know *Sia* was a ninja (a kunoichi to be precise)",
                                            "author": "Toyo_Ibiang",
                                            "id": "gemym0i",
                                            "parent_id": "t1_gemxtyk",
                                            "score": 2,
                                            "created_utc": 1607117412.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Priorities.",
            "author": "SurpriseSweet",
            "id": "gelckro",
            "parent_id": "t1_gel1nfj",
            "score": 28,
            "created_utc": 1607088190.0,
            "replies": []
        },
        {
            "body": "true chad energy right there",
            "author": "ZenXgaming100",
            "id": "gelqf9m",
            "parent_id": "t1_gelghlq",
            "score": 47,
            "created_utc": 1607096001.0,
            "replies": []
        },
        {
            "body": "What a legend",
            "author": "Shadow25Soldier",
            "id": "gelyj3y",
            "parent_id": "t1_gelghlq",
            "score": 18,
            "created_utc": 1607099970.0,
            "replies": []
        },
        {
            "body": "This is boruto canon",
            "author": "xXGoobyXx",
            "id": "gen98t1",
            "parent_id": "t1_gelghlq",
            "score": 11,
            "created_utc": 1607123084.0,
            "replies": []
        },
        {
            "body": "Under the laptop, blowing Sasuke.",
            "author": "TyrionGoldenLion",
            "id": "gekthec",
            "parent_id": "t1_gekr3r6",
            "score": 702,
            "created_utc": 1607072298.0,
            "replies": [
                {
                    "body": "This made me laugh.",
                    "author": "loneabhi",
                    "id": "gekx4k6",
                    "parent_id": "t1_gekthec",
                    "score": 110,
                    "created_utc": 1607076057.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gel2a4k",
                    "parent_id": "t1_gekthec",
                    "score": 50,
                    "created_utc": 1607080868.0,
                    "replies": [
                        {
                            "body": "Sasuke feels the sensation and pleasure while looking at Itachi's photos on his laptop...",
                            "author": "TyrionGoldenLion",
                            "id": "gel2qaa",
                            "parent_id": "t1_gel2a4k",
                            "score": 47,
                            "created_utc": 1607081210.0,
                            "replies": [
                                {
                                    "body": "Nah nah looking at photos of Itachi’s dead body",
                                    "author": "AngonceMcGhee",
                                    "id": "gelgfcq",
                                    "parent_id": "t1_gel2qaa",
                                    "score": 13,
                                    "created_utc": 1607090494.0,
                                    "replies": [
                                        {
                                            "body": "\"A dead body shouldn't feel this warm...\"",
                                            "author": "TyrionGoldenLion",
                                            "id": "gelgsdq",
                                            "parent_id": "t1_gelgfcq",
                                            "score": 18,
                                            "created_utc": 1607090716.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "more like a feeling of pride and accomplishment that only can come from EA",
                                    "author": null,
                                    "id": "gelyb7u",
                                    "parent_id": "t1_gel2qaa",
                                    "score": 5,
                                    "created_utc": 1607099864.0,
                                    "replies": [
                                        {
                                            "body": "\"Wow, I have a blond dunce's mouth around my cock, I'm so accomplished. uwu\"\n\nUchiha Sasuke, probably",
                                            "author": "TyrionGoldenLion",
                                            "id": "gelyo6d",
                                            "parent_id": "t1_gelyb7u",
                                            "score": 6,
                                            "created_utc": 1607100036.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "To be fair I get off on performing glory kills and using the chainsaw in DOOM. \n\nThere's just something so satisfying about the crack heard when I snap an imp's neck, or the soothing hum of the chainsaw's engine, purring like a kitten as my controller vibrates between my hands, that perfect balance of give and resistance as the whirling teeth of the blades saw through demon flesh and muscle and bone, and the way their unholy blood spatters all over the place like liquid red confetti, as if to congratulate me on another job well done. Hell is one big dance party, I'm the DJ, and the soundtrack is a wicked mix of heavy metal, gunshots, and the screams of the damned. *And I love every second of it.*",
                                            "author": "HollyTheMage",
                                            "id": "gesr8mt",
                                            "parent_id": "t1_gelyb7u",
                                            "score": 0,
                                            "created_utc": 1607242713.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Correct answer",
                    "author": "JoeyMarvolo",
                    "id": "gellreg",
                    "parent_id": "t1_gekthec",
                    "score": 6,
                    "created_utc": 1607093560.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ikr 😭",
            "author": "jeteodor",
            "id": "gekt26t",
            "parent_id": "t1_gekr3r6",
            "score": 17,
            "created_utc": 1607071880.0,
            "replies": []
        },
        {
            "body": "a simple plan",
            "author": null,
            "id": "gelycxp",
            "parent_id": "t1_gelex7r",
            "score": 30,
            "created_utc": 1607099887.0,
            "replies": []
        },
        {
            "body": "Naruto is a bottom??",
            "author": "ambidextrousambivert",
            "id": "gem724n",
            "parent_id": "t1_gelex7r",
            "score": 9,
            "created_utc": 1607104013.0,
            "replies": [
                {
                    "body": "[Yes](https://twitter.com/bottom_naruto?s=09)",
                    "author": "Schooney123",
                    "id": "gemqkss",
                    "parent_id": "t1_gem724n",
                    "score": 11,
                    "created_utc": 1607113379.0,
                    "replies": [
                        {
                            "body": "Block me back",
                            "author": "ambidextrousambivert",
                            "id": "gemr049",
                            "parent_id": "t1_gemqkss",
                            "score": 7,
                            "created_utc": 1607113591.0,
                            "replies": []
                        },
                        {
                            "body": "Sasugay senpai sure is Hot",
                            "author": "AJGILL03",
                            "id": "geo685q",
                            "parent_id": "t1_gemqkss",
                            "score": 5,
                            "created_utc": 1607143099.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1-134...",
            "author": "SSJKarot",
            "id": "gemrmvy",
            "parent_id": "t1_gelga72",
            "score": 7,
            "created_utc": 1607113908.0,
            "replies": []
        },
        {
            "body": "A college party, perhaps?",
            "author": "AJGILL03",
            "id": "gelwg18",
            "parent_id": "t1_gell3x6",
            "score": 11,
            "created_utc": 1607098969.0,
            "replies": [
                {
                    "body": "Man I went to the wrong college parties then",
                    "author": "Brendan_Fraser",
                    "id": "gena6bx",
                    "parent_id": "t1_gelwg18",
                    "score": 6,
                    "created_utc": 1607123608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean we all knew they were more than friends",
            "author": "savagejordan1217",
            "id": "gemcs6n",
            "parent_id": "t1_gelyyhv",
            "score": 10,
            "created_utc": 1607106716.0,
            "replies": [
                {
                    "body": "Just like Naruto and Sasuke",
                    "author": "IAmYoDaddyDuh",
                    "id": "gemp1nx",
                    "parent_id": "t1_gemcs6n",
                    "score": 14,
                    "created_utc": 1607112610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah like once, he was so ashemed of him self that he left the village for 13 years",
            "author": "YeetMomentum",
            "id": "gelfrpi",
            "parent_id": "t1_geleqlr",
            "score": 69,
            "created_utc": 1607090095.0,
            "replies": [
                {
                    "body": "I don't think you realize the average amount you gotta bang someone to get them pregnant",
                    "author": "Edvart",
                    "id": "gemt75g",
                    "parent_id": "t1_gelfrpi",
                    "score": -7,
                    "created_utc": 1607114688.0,
                    "replies": [
                        {
                            "body": "Did... Did u forget this is anime? Ive seen anime in wich the MC just looks at the girl and She gets pregnant, hell in anime a blow job is enough to get someone pregnant. Im also guessing u never Heard of a joke, mark this as your first one (careful not to get pregnant tho).",
                            "author": "YeetMomentum",
                            "id": "gen13fp",
                            "parent_id": "t1_gemt75g",
                            "score": 6,
                            "created_utc": 1607118693.0,
                            "replies": [
                                {
                                    "body": "Butthurt :)",
                                    "author": "Edvart",
                                    "id": "gen1ly6",
                                    "parent_id": "t1_gen13fp",
                                    "score": -7,
                                    "created_utc": 1607118964.0,
                                    "replies": [
                                        {
                                            "body": "Damn, u go around telling ppl they are stupid for not knowing (insert common aspect) just so u can feel better abount yourself, and when u dont have an argument back u just call them butthurt, amazing Reddit moment. U should go to Twitter lol(this is ur seccond joke If im not wrong)",
                                            "author": "YeetMomentum",
                                            "id": "gen23i4",
                                            "parent_id": "t1_gen1ly6",
                                            "score": 3,
                                            "created_utc": 1607119221.0,
                                            "replies": [
                                                {
                                                    "body": "Salt",
                                                    "author": "Edvart",
                                                    "id": "genbu42",
                                                    "parent_id": "t1_gen23i4",
                                                    "score": -2,
                                                    "created_utc": 1607124530.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I dont think that why he left the village.",
                    "author": "ngess46",
                    "id": "gelgvt9",
                    "parent_id": "t1_gelfrpi",
                    "score": -29,
                    "created_utc": 1607090774.0,
                    "replies": [
                        {
                            "body": "He did",
                            "author": "ashdasshh",
                            "id": "gelif17",
                            "parent_id": "t1_gelgvt9",
                            "score": 36,
                            "created_utc": 1607091687.0,
                            "replies": [
                                {
                                    "body": "He didnt -_-",
                                    "author": "ngess46",
                                    "id": "geljpww",
                                    "parent_id": "t1_gelif17",
                                    "score": -20,
                                    "created_utc": 1607092429.0,
                                    "replies": [
                                        {
                                            "body": "Yes he did. Kishimoto himself said so",
                                            "author": "ashdasshh",
                                            "id": "geljsek",
                                            "parent_id": "t1_geljpww",
                                            "score": 27,
                                            "created_utc": 1607092468.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The bot is dumb here is the orignal link [https://www.reddit.com/r/dankruto/comments/innwfb/sauceke/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/dankruto/comments/innwfb/sauceke/?utm_source=share&utm_medium=web2x&context=3)",
            "author": null,
            "id": "geolx83",
            "parent_id": "t1_gemgcp1",
            "score": 2,
            "created_utc": 1607156439.0,
            "replies": []
        },
        {
            "body": "I didn't find any posts that meet the matching requirements for r/dankruto. \n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n This search triggered my meme filter. This enabled strict matching requirements. The closest match that did not meet the requirements [is this post](https://redd.it/fw84n0)\n\n*Feedback? Hate? Visit r/repostsleuthbot - I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"k6guk9\", \"meme_template\": 64489}) ]* \n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=k6guk9&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=true&targetImageMatch=86&targetImageMemeMatch=96)",
            "author": "RepostSleuthBot",
            "id": "gemgew8",
            "parent_id": "t1_gemgcp1",
            "score": 2,
            "created_utc": 1607108436.0,
            "replies": []
        },
        {
            "body": "Might be, but I just joined recently and this is hilarious",
            "author": "Bmartin_",
            "id": "gelg6nk",
            "parent_id": "t1_gel3ukr",
            "score": 9,
            "created_utc": 1607090349.0,
            "replies": []
        },
        {
            "body": "Rule34 I think",
            "author": "IAmYoDaddyDuh",
            "id": "gemp334",
            "parent_id": "t1_gelx3ef",
            "score": 1,
            "created_utc": 1607112629.0,
            "replies": []
        },
        {
            "body": "Why do you think he’s traveling so often? He’s spreading that Sharingan, man, but he ain’t tryin to get caught...",
            "author": null,
            "id": "gelr3fa",
            "parent_id": "t1_gelf6mk",
            "score": 236,
            "created_utc": 1607096342.0,
            "replies": [
                {
                    "body": "Sasukum",
                    "author": "Mike_0xmaul",
                    "id": "gelz24j",
                    "parent_id": "t1_gelr3fa",
                    "score": 64,
                    "created_utc": 1607100219.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And its a girl, so her surname gonna change depends on the clan she marries with",
            "author": "Kulutiheges",
            "id": "gelknrt",
            "parent_id": "t1_gelf6mk",
            "score": 81,
            "created_utc": 1607092957.0,
            "replies": [
                {
                    "body": "Maybe not. She could just keep the uchiha title",
                    "author": "YUNGBOYBOI",
                    "id": "gelxwl5",
                    "parent_id": "t1_gelknrt",
                    "score": 49,
                    "created_utc": 1607099669.0,
                    "replies": [
                        {
                            "body": "Not if she marries into a bigger/influential clan, which it’s pretty much an inevitability considering she’s one of two Uchihas. \n\nEven if she married Boruto, the Uzumaki name is automatically more prestigious due to the Hokage being an Uzumaki, so it’d be Sarada Uzumaki anyways.",
                            "author": "SnoopyGoldberg",
                            "id": "gemi6n6",
                            "parent_id": "t1_gelxwl5",
                            "score": 23,
                            "created_utc": 1607109280.0,
                            "replies": [
                                {
                                    "body": "Even if she marries someone from a clan, the Uchiha name and renown still puts them over pretty much any other clan then the Hyuuga. Not to mention any of the possible clan restoration laws that might be in place to keep clans from going extinct.",
                                    "author": "TheGreyDestroyer7",
                                    "id": "gemlgkh",
                                    "parent_id": "t1_gemi6n6",
                                    "score": 16,
                                    "created_utc": 1607110851.0,
                                    "replies": [
                                        {
                                            "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gemolsw",
                                            "parent_id": "t1_gemlgkh",
                                            "score": 11,
                                            "created_utc": 1607112390.0,
                                            "replies": [
                                                {
                                                    "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                                                    "author": "martinmix52",
                                                    "id": "gen0ut7",
                                                    "parent_id": "t1_gemolsw",
                                                    "score": 15,
                                                    "created_utc": 1607118569.0,
                                                    "replies": [
                                                        {
                                                            "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gen1da9",
                                                            "parent_id": "t1_gen0ut7",
                                                            "score": 4,
                                                            "created_utc": 1607118837.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                                                    "author": "PikaYoshl",
                                                                    "id": "gepxgfe",
                                                                    "parent_id": "t1_gen1da9",
                                                                    "score": 3,
                                                                    "created_utc": 1607192440.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "gepxmi2",
                                                                            "parent_id": "t1_gepxgfe",
                                                                            "score": -1,
                                                                            "created_utc": 1607192523.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                                                    "author": "PikaYoshl",
                                                                                    "id": "gepzuz9",
                                                                                    "parent_id": "t1_gepxmi2",
                                                                                    "score": 2,
                                                                                    "created_utc": 1607193522.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                                                            "author": "TyrionGoldenLion",
                                                                                            "id": "geq0657",
                                                                                            "parent_id": "t1_gepzuz9",
                                                                                            "score": 1,
                                                                                            "created_utc": 1607193662.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                                                    "author": "PikaYoshl",
                                                                                                    "id": "geq1x4p",
                                                                                                    "parent_id": "t1_geq0657",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1607194512.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                                                    "author": "martinmix52",
                                                                    "id": "gen1z0k",
                                                                    "parent_id": "t1_gen1da9",
                                                                    "score": 1,
                                                                    "created_utc": 1607119155.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "gen27k0",
                                                                            "parent_id": "t1_gen1z0k",
                                                                            "score": 1,
                                                                            "created_utc": 1607119281.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                                                    "author": "martinmix52",
                                                                                    "id": "gen2wms",
                                                                                    "parent_id": "t1_gen27k0",
                                                                                    "score": 6,
                                                                                    "created_utc": 1607119649.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                                                    "author": "TheGreyDestroyer7",
                                                    "id": "gemuigx",
                                                    "parent_id": "t1_gemolsw",
                                                    "score": 3,
                                                    "created_utc": 1607115344.0,
                                                    "replies": [
                                                        {
                                                            "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gemzmef",
                                                            "parent_id": "t1_gemuigx",
                                                            "score": 3,
                                                            "created_utc": 1607117931.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                                                    "author": "TheGreyDestroyer7",
                                                                    "id": "gen01iy",
                                                                    "parent_id": "t1_gemzmef",
                                                                    "score": 1,
                                                                    "created_utc": 1607118149.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                                                    "author": null,
                                                    "id": "hitlybp",
                                                    "parent_id": "t1_gemolsw",
                                                    "score": 1,
                                                    "created_utc": 1635721887.0,
                                                    "replies": [
                                                        {
                                                            "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "hivb2w9",
                                                            "parent_id": "t1_hitlybp",
                                                            "score": 1,
                                                            "created_utc": 1635763013.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Wait what",
                                                                    "author": null,
                                                                    "id": "hiwjdvw",
                                                                    "parent_id": "t1_hivb2w9",
                                                                    "score": 1,
                                                                    "created_utc": 1635786188.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "If Boruto and Sarada get married, then Hiashi's plan finally came to fruition",
                                    "author": "JealotGaming",
                                    "id": "geqbudb",
                                    "parent_id": "t1_gemi6n6",
                                    "score": 1,
                                    "created_utc": 1607199495.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He could just bang random chicks on his travels 🤣",
                            "author": null,
                            "id": "genkvfp",
                            "parent_id": "t1_gelxwl5",
                            "score": 1,
                            "created_utc": 1607129781.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Doesn't really matter cuz the Sharingan will still be passed down",
                    "author": "alli_kat1010",
                    "id": "gem4zsb",
                    "parent_id": "t1_gelknrt",
                    "score": 8,
                    "created_utc": 1607103043.0,
                    "replies": [
                        {
                            "body": "Maybe not, Boruto is a Hyuga and he doesn't have the Byakugan; Sarada's child might not have the Sharingan and the Dojutsu could disappear.",
                            "author": "Yamcha17",
                            "id": "gemtu91",
                            "parent_id": "t1_gem4zsb",
                            "score": 3,
                            "created_utc": 1607115007.0,
                            "replies": [
                                {
                                    "body": "Would be an unlucky person.  Especially with the Boruto would being more and more kushy for the kids, they don't have to fight like their parents did.\n\nSharingan is awakened through toil, so it may just die out naturally.",
                                    "author": "alli_kat1010",
                                    "id": "gemzhr8",
                                    "parent_id": "t1_gemtu91",
                                    "score": 4,
                                    "created_utc": 1607117865.0,
                                    "replies": []
                                },
                                {
                                    "body": "Or Sharingan is the dominant gene, it could just be dormant in her kids DNA, and her grandkid could still end up with the Sharingan even if their parent didn’t.",
                                    "author": "TheCleanestKing",
                                    "id": "gjnz22u",
                                    "parent_id": "t1_gemtu91",
                                    "score": 2,
                                    "created_utc": 1610927947.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Then you haven't met Ino Yamanaka.",
                    "author": "Toyo_Ibiang",
                    "id": "gemwg1g",
                    "parent_id": "t1_gelknrt",
                    "score": 1,
                    "created_utc": 1607116315.0,
                    "replies": [
                        {
                            "body": "Sia didn't have a clan name",
                            "author": "ginganinja29",
                            "id": "gemxtyk",
                            "parent_id": "t1_gemwg1g",
                            "score": 2,
                            "created_utc": 1607117017.0,
                            "replies": [
                                {
                                    "body": "I didn't know *Sia* was a ninja (a kunoichi to be precise)",
                                    "author": "Toyo_Ibiang",
                                    "id": "gemym0i",
                                    "parent_id": "t1_gemxtyk",
                                    "score": 2,
                                    "created_utc": 1607117412.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This made me laugh.",
            "author": "loneabhi",
            "id": "gekx4k6",
            "parent_id": "t1_gekthec",
            "score": 110,
            "created_utc": 1607076057.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gel2a4k",
            "parent_id": "t1_gekthec",
            "score": 50,
            "created_utc": 1607080868.0,
            "replies": [
                {
                    "body": "Sasuke feels the sensation and pleasure while looking at Itachi's photos on his laptop...",
                    "author": "TyrionGoldenLion",
                    "id": "gel2qaa",
                    "parent_id": "t1_gel2a4k",
                    "score": 47,
                    "created_utc": 1607081210.0,
                    "replies": [
                        {
                            "body": "Nah nah looking at photos of Itachi’s dead body",
                            "author": "AngonceMcGhee",
                            "id": "gelgfcq",
                            "parent_id": "t1_gel2qaa",
                            "score": 13,
                            "created_utc": 1607090494.0,
                            "replies": [
                                {
                                    "body": "\"A dead body shouldn't feel this warm...\"",
                                    "author": "TyrionGoldenLion",
                                    "id": "gelgsdq",
                                    "parent_id": "t1_gelgfcq",
                                    "score": 18,
                                    "created_utc": 1607090716.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "more like a feeling of pride and accomplishment that only can come from EA",
                            "author": null,
                            "id": "gelyb7u",
                            "parent_id": "t1_gel2qaa",
                            "score": 5,
                            "created_utc": 1607099864.0,
                            "replies": [
                                {
                                    "body": "\"Wow, I have a blond dunce's mouth around my cock, I'm so accomplished. uwu\"\n\nUchiha Sasuke, probably",
                                    "author": "TyrionGoldenLion",
                                    "id": "gelyo6d",
                                    "parent_id": "t1_gelyb7u",
                                    "score": 6,
                                    "created_utc": 1607100036.0,
                                    "replies": []
                                },
                                {
                                    "body": "To be fair I get off on performing glory kills and using the chainsaw in DOOM. \n\nThere's just something so satisfying about the crack heard when I snap an imp's neck, or the soothing hum of the chainsaw's engine, purring like a kitten as my controller vibrates between my hands, that perfect balance of give and resistance as the whirling teeth of the blades saw through demon flesh and muscle and bone, and the way their unholy blood spatters all over the place like liquid red confetti, as if to congratulate me on another job well done. Hell is one big dance party, I'm the DJ, and the soundtrack is a wicked mix of heavy metal, gunshots, and the screams of the damned. *And I love every second of it.*",
                                    "author": "HollyTheMage",
                                    "id": "gesr8mt",
                                    "parent_id": "t1_gelyb7u",
                                    "score": 0,
                                    "created_utc": 1607242713.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Correct answer",
            "author": "JoeyMarvolo",
            "id": "gellreg",
            "parent_id": "t1_gekthec",
            "score": 6,
            "created_utc": 1607093560.0,
            "replies": []
        },
        {
            "body": "[Yes](https://twitter.com/bottom_naruto?s=09)",
            "author": "Schooney123",
            "id": "gemqkss",
            "parent_id": "t1_gem724n",
            "score": 11,
            "created_utc": 1607113379.0,
            "replies": [
                {
                    "body": "Block me back",
                    "author": "ambidextrousambivert",
                    "id": "gemr049",
                    "parent_id": "t1_gemqkss",
                    "score": 7,
                    "created_utc": 1607113591.0,
                    "replies": []
                },
                {
                    "body": "Sasugay senpai sure is Hot",
                    "author": "AJGILL03",
                    "id": "geo685q",
                    "parent_id": "t1_gemqkss",
                    "score": 5,
                    "created_utc": 1607143099.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man I went to the wrong college parties then",
            "author": "Brendan_Fraser",
            "id": "gena6bx",
            "parent_id": "t1_gelwg18",
            "score": 6,
            "created_utc": 1607123608.0,
            "replies": []
        },
        {
            "body": "Just like Naruto and Sasuke",
            "author": "IAmYoDaddyDuh",
            "id": "gemp1nx",
            "parent_id": "t1_gemcs6n",
            "score": 14,
            "created_utc": 1607112610.0,
            "replies": []
        },
        {
            "body": "I don't think you realize the average amount you gotta bang someone to get them pregnant",
            "author": "Edvart",
            "id": "gemt75g",
            "parent_id": "t1_gelfrpi",
            "score": -7,
            "created_utc": 1607114688.0,
            "replies": [
                {
                    "body": "Did... Did u forget this is anime? Ive seen anime in wich the MC just looks at the girl and She gets pregnant, hell in anime a blow job is enough to get someone pregnant. Im also guessing u never Heard of a joke, mark this as your first one (careful not to get pregnant tho).",
                    "author": "YeetMomentum",
                    "id": "gen13fp",
                    "parent_id": "t1_gemt75g",
                    "score": 6,
                    "created_utc": 1607118693.0,
                    "replies": [
                        {
                            "body": "Butthurt :)",
                            "author": "Edvart",
                            "id": "gen1ly6",
                            "parent_id": "t1_gen13fp",
                            "score": -7,
                            "created_utc": 1607118964.0,
                            "replies": [
                                {
                                    "body": "Damn, u go around telling ppl they are stupid for not knowing (insert common aspect) just so u can feel better abount yourself, and when u dont have an argument back u just call them butthurt, amazing Reddit moment. U should go to Twitter lol(this is ur seccond joke If im not wrong)",
                                    "author": "YeetMomentum",
                                    "id": "gen23i4",
                                    "parent_id": "t1_gen1ly6",
                                    "score": 3,
                                    "created_utc": 1607119221.0,
                                    "replies": [
                                        {
                                            "body": "Salt",
                                            "author": "Edvart",
                                            "id": "genbu42",
                                            "parent_id": "t1_gen23i4",
                                            "score": -2,
                                            "created_utc": 1607124530.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I dont think that why he left the village.",
            "author": "ngess46",
            "id": "gelgvt9",
            "parent_id": "t1_gelfrpi",
            "score": -29,
            "created_utc": 1607090774.0,
            "replies": [
                {
                    "body": "He did",
                    "author": "ashdasshh",
                    "id": "gelif17",
                    "parent_id": "t1_gelgvt9",
                    "score": 36,
                    "created_utc": 1607091687.0,
                    "replies": [
                        {
                            "body": "He didnt -_-",
                            "author": "ngess46",
                            "id": "geljpww",
                            "parent_id": "t1_gelif17",
                            "score": -20,
                            "created_utc": 1607092429.0,
                            "replies": [
                                {
                                    "body": "Yes he did. Kishimoto himself said so",
                                    "author": "ashdasshh",
                                    "id": "geljsek",
                                    "parent_id": "t1_geljpww",
                                    "score": 27,
                                    "created_utc": 1607092468.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sasukum",
            "author": "Mike_0xmaul",
            "id": "gelz24j",
            "parent_id": "t1_gelr3fa",
            "score": 64,
            "created_utc": 1607100219.0,
            "replies": []
        },
        {
            "body": "Maybe not. She could just keep the uchiha title",
            "author": "YUNGBOYBOI",
            "id": "gelxwl5",
            "parent_id": "t1_gelknrt",
            "score": 49,
            "created_utc": 1607099669.0,
            "replies": [
                {
                    "body": "Not if she marries into a bigger/influential clan, which it’s pretty much an inevitability considering she’s one of two Uchihas. \n\nEven if she married Boruto, the Uzumaki name is automatically more prestigious due to the Hokage being an Uzumaki, so it’d be Sarada Uzumaki anyways.",
                    "author": "SnoopyGoldberg",
                    "id": "gemi6n6",
                    "parent_id": "t1_gelxwl5",
                    "score": 23,
                    "created_utc": 1607109280.0,
                    "replies": [
                        {
                            "body": "Even if she marries someone from a clan, the Uchiha name and renown still puts them over pretty much any other clan then the Hyuuga. Not to mention any of the possible clan restoration laws that might be in place to keep clans from going extinct.",
                            "author": "TheGreyDestroyer7",
                            "id": "gemlgkh",
                            "parent_id": "t1_gemi6n6",
                            "score": 16,
                            "created_utc": 1607110851.0,
                            "replies": [
                                {
                                    "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gemolsw",
                                    "parent_id": "t1_gemlgkh",
                                    "score": 11,
                                    "created_utc": 1607112390.0,
                                    "replies": [
                                        {
                                            "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                                            "author": "martinmix52",
                                            "id": "gen0ut7",
                                            "parent_id": "t1_gemolsw",
                                            "score": 15,
                                            "created_utc": 1607118569.0,
                                            "replies": [
                                                {
                                                    "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gen1da9",
                                                    "parent_id": "t1_gen0ut7",
                                                    "score": 4,
                                                    "created_utc": 1607118837.0,
                                                    "replies": [
                                                        {
                                                            "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                                            "author": "PikaYoshl",
                                                            "id": "gepxgfe",
                                                            "parent_id": "t1_gen1da9",
                                                            "score": 3,
                                                            "created_utc": 1607192440.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gepxmi2",
                                                                    "parent_id": "t1_gepxgfe",
                                                                    "score": -1,
                                                                    "created_utc": 1607192523.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                                            "author": "PikaYoshl",
                                                                            "id": "gepzuz9",
                                                                            "parent_id": "t1_gepxmi2",
                                                                            "score": 2,
                                                                            "created_utc": 1607193522.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                                                    "author": "TyrionGoldenLion",
                                                                                    "id": "geq0657",
                                                                                    "parent_id": "t1_gepzuz9",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607193662.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                                            "author": "PikaYoshl",
                                                                                            "id": "geq1x4p",
                                                                                            "parent_id": "t1_geq0657",
                                                                                            "score": 1,
                                                                                            "created_utc": 1607194512.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                                            "author": "martinmix52",
                                                            "id": "gen1z0k",
                                                            "parent_id": "t1_gen1da9",
                                                            "score": 1,
                                                            "created_utc": 1607119155.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "gen27k0",
                                                                    "parent_id": "t1_gen1z0k",
                                                                    "score": 1,
                                                                    "created_utc": 1607119281.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                                            "author": "martinmix52",
                                                                            "id": "gen2wms",
                                                                            "parent_id": "t1_gen27k0",
                                                                            "score": 6,
                                                                            "created_utc": 1607119649.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                                            "author": "TheGreyDestroyer7",
                                            "id": "gemuigx",
                                            "parent_id": "t1_gemolsw",
                                            "score": 3,
                                            "created_utc": 1607115344.0,
                                            "replies": [
                                                {
                                                    "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gemzmef",
                                                    "parent_id": "t1_gemuigx",
                                                    "score": 3,
                                                    "created_utc": 1607117931.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                                            "author": "TheGreyDestroyer7",
                                                            "id": "gen01iy",
                                                            "parent_id": "t1_gemzmef",
                                                            "score": 1,
                                                            "created_utc": 1607118149.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                                            "author": null,
                                            "id": "hitlybp",
                                            "parent_id": "t1_gemolsw",
                                            "score": 1,
                                            "created_utc": 1635721887.0,
                                            "replies": [
                                                {
                                                    "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "hivb2w9",
                                                    "parent_id": "t1_hitlybp",
                                                    "score": 1,
                                                    "created_utc": 1635763013.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wait what",
                                                            "author": null,
                                                            "id": "hiwjdvw",
                                                            "parent_id": "t1_hivb2w9",
                                                            "score": 1,
                                                            "created_utc": 1635786188.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If Boruto and Sarada get married, then Hiashi's plan finally came to fruition",
                            "author": "JealotGaming",
                            "id": "geqbudb",
                            "parent_id": "t1_gemi6n6",
                            "score": 1,
                            "created_utc": 1607199495.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He could just bang random chicks on his travels 🤣",
                    "author": null,
                    "id": "genkvfp",
                    "parent_id": "t1_gelxwl5",
                    "score": 1,
                    "created_utc": 1607129781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Doesn't really matter cuz the Sharingan will still be passed down",
            "author": "alli_kat1010",
            "id": "gem4zsb",
            "parent_id": "t1_gelknrt",
            "score": 8,
            "created_utc": 1607103043.0,
            "replies": [
                {
                    "body": "Maybe not, Boruto is a Hyuga and he doesn't have the Byakugan; Sarada's child might not have the Sharingan and the Dojutsu could disappear.",
                    "author": "Yamcha17",
                    "id": "gemtu91",
                    "parent_id": "t1_gem4zsb",
                    "score": 3,
                    "created_utc": 1607115007.0,
                    "replies": [
                        {
                            "body": "Would be an unlucky person.  Especially with the Boruto would being more and more kushy for the kids, they don't have to fight like their parents did.\n\nSharingan is awakened through toil, so it may just die out naturally.",
                            "author": "alli_kat1010",
                            "id": "gemzhr8",
                            "parent_id": "t1_gemtu91",
                            "score": 4,
                            "created_utc": 1607117865.0,
                            "replies": []
                        },
                        {
                            "body": "Or Sharingan is the dominant gene, it could just be dormant in her kids DNA, and her grandkid could still end up with the Sharingan even if their parent didn’t.",
                            "author": "TheCleanestKing",
                            "id": "gjnz22u",
                            "parent_id": "t1_gemtu91",
                            "score": 2,
                            "created_utc": 1610927947.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then you haven't met Ino Yamanaka.",
            "author": "Toyo_Ibiang",
            "id": "gemwg1g",
            "parent_id": "t1_gelknrt",
            "score": 1,
            "created_utc": 1607116315.0,
            "replies": [
                {
                    "body": "Sia didn't have a clan name",
                    "author": "ginganinja29",
                    "id": "gemxtyk",
                    "parent_id": "t1_gemwg1g",
                    "score": 2,
                    "created_utc": 1607117017.0,
                    "replies": [
                        {
                            "body": "I didn't know *Sia* was a ninja (a kunoichi to be precise)",
                            "author": "Toyo_Ibiang",
                            "id": "gemym0i",
                            "parent_id": "t1_gemxtyk",
                            "score": 2,
                            "created_utc": 1607117412.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sasuke feels the sensation and pleasure while looking at Itachi's photos on his laptop...",
            "author": "TyrionGoldenLion",
            "id": "gel2qaa",
            "parent_id": "t1_gel2a4k",
            "score": 47,
            "created_utc": 1607081210.0,
            "replies": [
                {
                    "body": "Nah nah looking at photos of Itachi’s dead body",
                    "author": "AngonceMcGhee",
                    "id": "gelgfcq",
                    "parent_id": "t1_gel2qaa",
                    "score": 13,
                    "created_utc": 1607090494.0,
                    "replies": [
                        {
                            "body": "\"A dead body shouldn't feel this warm...\"",
                            "author": "TyrionGoldenLion",
                            "id": "gelgsdq",
                            "parent_id": "t1_gelgfcq",
                            "score": 18,
                            "created_utc": 1607090716.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "more like a feeling of pride and accomplishment that only can come from EA",
                    "author": null,
                    "id": "gelyb7u",
                    "parent_id": "t1_gel2qaa",
                    "score": 5,
                    "created_utc": 1607099864.0,
                    "replies": [
                        {
                            "body": "\"Wow, I have a blond dunce's mouth around my cock, I'm so accomplished. uwu\"\n\nUchiha Sasuke, probably",
                            "author": "TyrionGoldenLion",
                            "id": "gelyo6d",
                            "parent_id": "t1_gelyb7u",
                            "score": 6,
                            "created_utc": 1607100036.0,
                            "replies": []
                        },
                        {
                            "body": "To be fair I get off on performing glory kills and using the chainsaw in DOOM. \n\nThere's just something so satisfying about the crack heard when I snap an imp's neck, or the soothing hum of the chainsaw's engine, purring like a kitten as my controller vibrates between my hands, that perfect balance of give and resistance as the whirling teeth of the blades saw through demon flesh and muscle and bone, and the way their unholy blood spatters all over the place like liquid red confetti, as if to congratulate me on another job well done. Hell is one big dance party, I'm the DJ, and the soundtrack is a wicked mix of heavy metal, gunshots, and the screams of the damned. *And I love every second of it.*",
                            "author": "HollyTheMage",
                            "id": "gesr8mt",
                            "parent_id": "t1_gelyb7u",
                            "score": 0,
                            "created_utc": 1607242713.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Block me back",
            "author": "ambidextrousambivert",
            "id": "gemr049",
            "parent_id": "t1_gemqkss",
            "score": 7,
            "created_utc": 1607113591.0,
            "replies": []
        },
        {
            "body": "Sasugay senpai sure is Hot",
            "author": "AJGILL03",
            "id": "geo685q",
            "parent_id": "t1_gemqkss",
            "score": 5,
            "created_utc": 1607143099.0,
            "replies": []
        },
        {
            "body": "Did... Did u forget this is anime? Ive seen anime in wich the MC just looks at the girl and She gets pregnant, hell in anime a blow job is enough to get someone pregnant. Im also guessing u never Heard of a joke, mark this as your first one (careful not to get pregnant tho).",
            "author": "YeetMomentum",
            "id": "gen13fp",
            "parent_id": "t1_gemt75g",
            "score": 6,
            "created_utc": 1607118693.0,
            "replies": [
                {
                    "body": "Butthurt :)",
                    "author": "Edvart",
                    "id": "gen1ly6",
                    "parent_id": "t1_gen13fp",
                    "score": -7,
                    "created_utc": 1607118964.0,
                    "replies": [
                        {
                            "body": "Damn, u go around telling ppl they are stupid for not knowing (insert common aspect) just so u can feel better abount yourself, and when u dont have an argument back u just call them butthurt, amazing Reddit moment. U should go to Twitter lol(this is ur seccond joke If im not wrong)",
                            "author": "YeetMomentum",
                            "id": "gen23i4",
                            "parent_id": "t1_gen1ly6",
                            "score": 3,
                            "created_utc": 1607119221.0,
                            "replies": [
                                {
                                    "body": "Salt",
                                    "author": "Edvart",
                                    "id": "genbu42",
                                    "parent_id": "t1_gen23i4",
                                    "score": -2,
                                    "created_utc": 1607124530.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He did",
            "author": "ashdasshh",
            "id": "gelif17",
            "parent_id": "t1_gelgvt9",
            "score": 36,
            "created_utc": 1607091687.0,
            "replies": [
                {
                    "body": "He didnt -_-",
                    "author": "ngess46",
                    "id": "geljpww",
                    "parent_id": "t1_gelif17",
                    "score": -20,
                    "created_utc": 1607092429.0,
                    "replies": [
                        {
                            "body": "Yes he did. Kishimoto himself said so",
                            "author": "ashdasshh",
                            "id": "geljsek",
                            "parent_id": "t1_geljpww",
                            "score": 27,
                            "created_utc": 1607092468.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not if she marries into a bigger/influential clan, which it’s pretty much an inevitability considering she’s one of two Uchihas. \n\nEven if she married Boruto, the Uzumaki name is automatically more prestigious due to the Hokage being an Uzumaki, so it’d be Sarada Uzumaki anyways.",
            "author": "SnoopyGoldberg",
            "id": "gemi6n6",
            "parent_id": "t1_gelxwl5",
            "score": 23,
            "created_utc": 1607109280.0,
            "replies": [
                {
                    "body": "Even if she marries someone from a clan, the Uchiha name and renown still puts them over pretty much any other clan then the Hyuuga. Not to mention any of the possible clan restoration laws that might be in place to keep clans from going extinct.",
                    "author": "TheGreyDestroyer7",
                    "id": "gemlgkh",
                    "parent_id": "t1_gemi6n6",
                    "score": 16,
                    "created_utc": 1607110851.0,
                    "replies": [
                        {
                            "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
                            "author": "TyrionGoldenLion",
                            "id": "gemolsw",
                            "parent_id": "t1_gemlgkh",
                            "score": 11,
                            "created_utc": 1607112390.0,
                            "replies": [
                                {
                                    "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                                    "author": "martinmix52",
                                    "id": "gen0ut7",
                                    "parent_id": "t1_gemolsw",
                                    "score": 15,
                                    "created_utc": 1607118569.0,
                                    "replies": [
                                        {
                                            "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gen1da9",
                                            "parent_id": "t1_gen0ut7",
                                            "score": 4,
                                            "created_utc": 1607118837.0,
                                            "replies": [
                                                {
                                                    "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                                    "author": "PikaYoshl",
                                                    "id": "gepxgfe",
                                                    "parent_id": "t1_gen1da9",
                                                    "score": 3,
                                                    "created_utc": 1607192440.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gepxmi2",
                                                            "parent_id": "t1_gepxgfe",
                                                            "score": -1,
                                                            "created_utc": 1607192523.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                                    "author": "PikaYoshl",
                                                                    "id": "gepzuz9",
                                                                    "parent_id": "t1_gepxmi2",
                                                                    "score": 2,
                                                                    "created_utc": 1607193522.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                                            "author": "TyrionGoldenLion",
                                                                            "id": "geq0657",
                                                                            "parent_id": "t1_gepzuz9",
                                                                            "score": 1,
                                                                            "created_utc": 1607193662.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                                    "author": "PikaYoshl",
                                                                                    "id": "geq1x4p",
                                                                                    "parent_id": "t1_geq0657",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607194512.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                                    "author": "martinmix52",
                                                    "id": "gen1z0k",
                                                    "parent_id": "t1_gen1da9",
                                                    "score": 1,
                                                    "created_utc": 1607119155.0,
                                                    "replies": [
                                                        {
                                                            "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "gen27k0",
                                                            "parent_id": "t1_gen1z0k",
                                                            "score": 1,
                                                            "created_utc": 1607119281.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                                    "author": "martinmix52",
                                                                    "id": "gen2wms",
                                                                    "parent_id": "t1_gen27k0",
                                                                    "score": 6,
                                                                    "created_utc": 1607119649.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                                    "author": "TheGreyDestroyer7",
                                    "id": "gemuigx",
                                    "parent_id": "t1_gemolsw",
                                    "score": 3,
                                    "created_utc": 1607115344.0,
                                    "replies": [
                                        {
                                            "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gemzmef",
                                            "parent_id": "t1_gemuigx",
                                            "score": 3,
                                            "created_utc": 1607117931.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                                    "author": "TheGreyDestroyer7",
                                                    "id": "gen01iy",
                                                    "parent_id": "t1_gemzmef",
                                                    "score": 1,
                                                    "created_utc": 1607118149.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                                    "author": null,
                                    "id": "hitlybp",
                                    "parent_id": "t1_gemolsw",
                                    "score": 1,
                                    "created_utc": 1635721887.0,
                                    "replies": [
                                        {
                                            "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                                            "author": "TyrionGoldenLion",
                                            "id": "hivb2w9",
                                            "parent_id": "t1_hitlybp",
                                            "score": 1,
                                            "created_utc": 1635763013.0,
                                            "replies": [
                                                {
                                                    "body": "Wait what",
                                                    "author": null,
                                                    "id": "hiwjdvw",
                                                    "parent_id": "t1_hivb2w9",
                                                    "score": 1,
                                                    "created_utc": 1635786188.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If Boruto and Sarada get married, then Hiashi's plan finally came to fruition",
                    "author": "JealotGaming",
                    "id": "geqbudb",
                    "parent_id": "t1_gemi6n6",
                    "score": 1,
                    "created_utc": 1607199495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He could just bang random chicks on his travels 🤣",
            "author": null,
            "id": "genkvfp",
            "parent_id": "t1_gelxwl5",
            "score": 1,
            "created_utc": 1607129781.0,
            "replies": []
        },
        {
            "body": "Maybe not, Boruto is a Hyuga and he doesn't have the Byakugan; Sarada's child might not have the Sharingan and the Dojutsu could disappear.",
            "author": "Yamcha17",
            "id": "gemtu91",
            "parent_id": "t1_gem4zsb",
            "score": 3,
            "created_utc": 1607115007.0,
            "replies": [
                {
                    "body": "Would be an unlucky person.  Especially with the Boruto would being more and more kushy for the kids, they don't have to fight like their parents did.\n\nSharingan is awakened through toil, so it may just die out naturally.",
                    "author": "alli_kat1010",
                    "id": "gemzhr8",
                    "parent_id": "t1_gemtu91",
                    "score": 4,
                    "created_utc": 1607117865.0,
                    "replies": []
                },
                {
                    "body": "Or Sharingan is the dominant gene, it could just be dormant in her kids DNA, and her grandkid could still end up with the Sharingan even if their parent didn’t.",
                    "author": "TheCleanestKing",
                    "id": "gjnz22u",
                    "parent_id": "t1_gemtu91",
                    "score": 2,
                    "created_utc": 1610927947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sia didn't have a clan name",
            "author": "ginganinja29",
            "id": "gemxtyk",
            "parent_id": "t1_gemwg1g",
            "score": 2,
            "created_utc": 1607117017.0,
            "replies": [
                {
                    "body": "I didn't know *Sia* was a ninja (a kunoichi to be precise)",
                    "author": "Toyo_Ibiang",
                    "id": "gemym0i",
                    "parent_id": "t1_gemxtyk",
                    "score": 2,
                    "created_utc": 1607117412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah nah looking at photos of Itachi’s dead body",
            "author": "AngonceMcGhee",
            "id": "gelgfcq",
            "parent_id": "t1_gel2qaa",
            "score": 13,
            "created_utc": 1607090494.0,
            "replies": [
                {
                    "body": "\"A dead body shouldn't feel this warm...\"",
                    "author": "TyrionGoldenLion",
                    "id": "gelgsdq",
                    "parent_id": "t1_gelgfcq",
                    "score": 18,
                    "created_utc": 1607090716.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "more like a feeling of pride and accomplishment that only can come from EA",
            "author": null,
            "id": "gelyb7u",
            "parent_id": "t1_gel2qaa",
            "score": 5,
            "created_utc": 1607099864.0,
            "replies": [
                {
                    "body": "\"Wow, I have a blond dunce's mouth around my cock, I'm so accomplished. uwu\"\n\nUchiha Sasuke, probably",
                    "author": "TyrionGoldenLion",
                    "id": "gelyo6d",
                    "parent_id": "t1_gelyb7u",
                    "score": 6,
                    "created_utc": 1607100036.0,
                    "replies": []
                },
                {
                    "body": "To be fair I get off on performing glory kills and using the chainsaw in DOOM. \n\nThere's just something so satisfying about the crack heard when I snap an imp's neck, or the soothing hum of the chainsaw's engine, purring like a kitten as my controller vibrates between my hands, that perfect balance of give and resistance as the whirling teeth of the blades saw through demon flesh and muscle and bone, and the way their unholy blood spatters all over the place like liquid red confetti, as if to congratulate me on another job well done. Hell is one big dance party, I'm the DJ, and the soundtrack is a wicked mix of heavy metal, gunshots, and the screams of the damned. *And I love every second of it.*",
                    "author": "HollyTheMage",
                    "id": "gesr8mt",
                    "parent_id": "t1_gelyb7u",
                    "score": 0,
                    "created_utc": 1607242713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Butthurt :)",
            "author": "Edvart",
            "id": "gen1ly6",
            "parent_id": "t1_gen13fp",
            "score": -7,
            "created_utc": 1607118964.0,
            "replies": [
                {
                    "body": "Damn, u go around telling ppl they are stupid for not knowing (insert common aspect) just so u can feel better abount yourself, and when u dont have an argument back u just call them butthurt, amazing Reddit moment. U should go to Twitter lol(this is ur seccond joke If im not wrong)",
                    "author": "YeetMomentum",
                    "id": "gen23i4",
                    "parent_id": "t1_gen1ly6",
                    "score": 3,
                    "created_utc": 1607119221.0,
                    "replies": [
                        {
                            "body": "Salt",
                            "author": "Edvart",
                            "id": "genbu42",
                            "parent_id": "t1_gen23i4",
                            "score": -2,
                            "created_utc": 1607124530.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He didnt -_-",
            "author": "ngess46",
            "id": "geljpww",
            "parent_id": "t1_gelif17",
            "score": -20,
            "created_utc": 1607092429.0,
            "replies": [
                {
                    "body": "Yes he did. Kishimoto himself said so",
                    "author": "ashdasshh",
                    "id": "geljsek",
                    "parent_id": "t1_geljpww",
                    "score": 27,
                    "created_utc": 1607092468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even if she marries someone from a clan, the Uchiha name and renown still puts them over pretty much any other clan then the Hyuuga. Not to mention any of the possible clan restoration laws that might be in place to keep clans from going extinct.",
            "author": "TheGreyDestroyer7",
            "id": "gemlgkh",
            "parent_id": "t1_gemi6n6",
            "score": 16,
            "created_utc": 1607110851.0,
            "replies": [
                {
                    "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
                    "author": "TyrionGoldenLion",
                    "id": "gemolsw",
                    "parent_id": "t1_gemlgkh",
                    "score": 11,
                    "created_utc": 1607112390.0,
                    "replies": [
                        {
                            "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                            "author": "martinmix52",
                            "id": "gen0ut7",
                            "parent_id": "t1_gemolsw",
                            "score": 15,
                            "created_utc": 1607118569.0,
                            "replies": [
                                {
                                    "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gen1da9",
                                    "parent_id": "t1_gen0ut7",
                                    "score": 4,
                                    "created_utc": 1607118837.0,
                                    "replies": [
                                        {
                                            "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                            "author": "PikaYoshl",
                                            "id": "gepxgfe",
                                            "parent_id": "t1_gen1da9",
                                            "score": 3,
                                            "created_utc": 1607192440.0,
                                            "replies": [
                                                {
                                                    "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gepxmi2",
                                                    "parent_id": "t1_gepxgfe",
                                                    "score": -1,
                                                    "created_utc": 1607192523.0,
                                                    "replies": [
                                                        {
                                                            "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                            "author": "PikaYoshl",
                                                            "id": "gepzuz9",
                                                            "parent_id": "t1_gepxmi2",
                                                            "score": 2,
                                                            "created_utc": 1607193522.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                                    "author": "TyrionGoldenLion",
                                                                    "id": "geq0657",
                                                                    "parent_id": "t1_gepzuz9",
                                                                    "score": 1,
                                                                    "created_utc": 1607193662.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                            "author": "PikaYoshl",
                                                                            "id": "geq1x4p",
                                                                            "parent_id": "t1_geq0657",
                                                                            "score": 1,
                                                                            "created_utc": 1607194512.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                            "author": "martinmix52",
                                            "id": "gen1z0k",
                                            "parent_id": "t1_gen1da9",
                                            "score": 1,
                                            "created_utc": 1607119155.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "gen27k0",
                                                    "parent_id": "t1_gen1z0k",
                                                    "score": 1,
                                                    "created_utc": 1607119281.0,
                                                    "replies": [
                                                        {
                                                            "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                            "author": "martinmix52",
                                                            "id": "gen2wms",
                                                            "parent_id": "t1_gen27k0",
                                                            "score": 6,
                                                            "created_utc": 1607119649.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                            "author": "TheGreyDestroyer7",
                            "id": "gemuigx",
                            "parent_id": "t1_gemolsw",
                            "score": 3,
                            "created_utc": 1607115344.0,
                            "replies": [
                                {
                                    "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gemzmef",
                                    "parent_id": "t1_gemuigx",
                                    "score": 3,
                                    "created_utc": 1607117931.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                            "author": "TheGreyDestroyer7",
                                            "id": "gen01iy",
                                            "parent_id": "t1_gemzmef",
                                            "score": 1,
                                            "created_utc": 1607118149.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                            "author": null,
                            "id": "hitlybp",
                            "parent_id": "t1_gemolsw",
                            "score": 1,
                            "created_utc": 1635721887.0,
                            "replies": [
                                {
                                    "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                                    "author": "TyrionGoldenLion",
                                    "id": "hivb2w9",
                                    "parent_id": "t1_hitlybp",
                                    "score": 1,
                                    "created_utc": 1635763013.0,
                                    "replies": [
                                        {
                                            "body": "Wait what",
                                            "author": null,
                                            "id": "hiwjdvw",
                                            "parent_id": "t1_hivb2w9",
                                            "score": 1,
                                            "created_utc": 1635786188.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If Boruto and Sarada get married, then Hiashi's plan finally came to fruition",
            "author": "JealotGaming",
            "id": "geqbudb",
            "parent_id": "t1_gemi6n6",
            "score": 1,
            "created_utc": 1607199495.0,
            "replies": []
        },
        {
            "body": "Would be an unlucky person.  Especially with the Boruto would being more and more kushy for the kids, they don't have to fight like their parents did.\n\nSharingan is awakened through toil, so it may just die out naturally.",
            "author": "alli_kat1010",
            "id": "gemzhr8",
            "parent_id": "t1_gemtu91",
            "score": 4,
            "created_utc": 1607117865.0,
            "replies": []
        },
        {
            "body": "Or Sharingan is the dominant gene, it could just be dormant in her kids DNA, and her grandkid could still end up with the Sharingan even if their parent didn’t.",
            "author": "TheCleanestKing",
            "id": "gjnz22u",
            "parent_id": "t1_gemtu91",
            "score": 2,
            "created_utc": 1610927947.0,
            "replies": []
        },
        {
            "body": "I didn't know *Sia* was a ninja (a kunoichi to be precise)",
            "author": "Toyo_Ibiang",
            "id": "gemym0i",
            "parent_id": "t1_gemxtyk",
            "score": 2,
            "created_utc": 1607117412.0,
            "replies": []
        },
        {
            "body": "\"A dead body shouldn't feel this warm...\"",
            "author": "TyrionGoldenLion",
            "id": "gelgsdq",
            "parent_id": "t1_gelgfcq",
            "score": 18,
            "created_utc": 1607090716.0,
            "replies": []
        },
        {
            "body": "\"Wow, I have a blond dunce's mouth around my cock, I'm so accomplished. uwu\"\n\nUchiha Sasuke, probably",
            "author": "TyrionGoldenLion",
            "id": "gelyo6d",
            "parent_id": "t1_gelyb7u",
            "score": 6,
            "created_utc": 1607100036.0,
            "replies": []
        },
        {
            "body": "To be fair I get off on performing glory kills and using the chainsaw in DOOM. \n\nThere's just something so satisfying about the crack heard when I snap an imp's neck, or the soothing hum of the chainsaw's engine, purring like a kitten as my controller vibrates between my hands, that perfect balance of give and resistance as the whirling teeth of the blades saw through demon flesh and muscle and bone, and the way their unholy blood spatters all over the place like liquid red confetti, as if to congratulate me on another job well done. Hell is one big dance party, I'm the DJ, and the soundtrack is a wicked mix of heavy metal, gunshots, and the screams of the damned. *And I love every second of it.*",
            "author": "HollyTheMage",
            "id": "gesr8mt",
            "parent_id": "t1_gelyb7u",
            "score": 0,
            "created_utc": 1607242713.0,
            "replies": []
        },
        {
            "body": "Damn, u go around telling ppl they are stupid for not knowing (insert common aspect) just so u can feel better abount yourself, and when u dont have an argument back u just call them butthurt, amazing Reddit moment. U should go to Twitter lol(this is ur seccond joke If im not wrong)",
            "author": "YeetMomentum",
            "id": "gen23i4",
            "parent_id": "t1_gen1ly6",
            "score": 3,
            "created_utc": 1607119221.0,
            "replies": [
                {
                    "body": "Salt",
                    "author": "Edvart",
                    "id": "genbu42",
                    "parent_id": "t1_gen23i4",
                    "score": -2,
                    "created_utc": 1607124530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes he did. Kishimoto himself said so",
            "author": "ashdasshh",
            "id": "geljsek",
            "parent_id": "t1_geljpww",
            "score": 27,
            "created_utc": 1607092468.0,
            "replies": []
        },
        {
            "body": "Uchiha is probably an embarrassing and shameful name in their world after all the evil their clan committed so Sarada might be happy to give it up.",
            "author": "TyrionGoldenLion",
            "id": "gemolsw",
            "parent_id": "t1_gemlgkh",
            "score": 11,
            "created_utc": 1607112390.0,
            "replies": [
                {
                    "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
                    "author": "martinmix52",
                    "id": "gen0ut7",
                    "parent_id": "t1_gemolsw",
                    "score": 15,
                    "created_utc": 1607118569.0,
                    "replies": [
                        {
                            "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                            "author": "TyrionGoldenLion",
                            "id": "gen1da9",
                            "parent_id": "t1_gen0ut7",
                            "score": 4,
                            "created_utc": 1607118837.0,
                            "replies": [
                                {
                                    "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                                    "author": "PikaYoshl",
                                    "id": "gepxgfe",
                                    "parent_id": "t1_gen1da9",
                                    "score": 3,
                                    "created_utc": 1607192440.0,
                                    "replies": [
                                        {
                                            "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gepxmi2",
                                            "parent_id": "t1_gepxgfe",
                                            "score": -1,
                                            "created_utc": 1607192523.0,
                                            "replies": [
                                                {
                                                    "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                                    "author": "PikaYoshl",
                                                    "id": "gepzuz9",
                                                    "parent_id": "t1_gepxmi2",
                                                    "score": 2,
                                                    "created_utc": 1607193522.0,
                                                    "replies": [
                                                        {
                                                            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "geq0657",
                                                            "parent_id": "t1_gepzuz9",
                                                            "score": 1,
                                                            "created_utc": 1607193662.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                                    "author": "PikaYoshl",
                                                                    "id": "geq1x4p",
                                                                    "parent_id": "t1_geq0657",
                                                                    "score": 1,
                                                                    "created_utc": 1607194512.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                                    "author": "martinmix52",
                                    "id": "gen1z0k",
                                    "parent_id": "t1_gen1da9",
                                    "score": 1,
                                    "created_utc": 1607119155.0,
                                    "replies": [
                                        {
                                            "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gen27k0",
                                            "parent_id": "t1_gen1z0k",
                                            "score": 1,
                                            "created_utc": 1607119281.0,
                                            "replies": [
                                                {
                                                    "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                                    "author": "martinmix52",
                                                    "id": "gen2wms",
                                                    "parent_id": "t1_gen27k0",
                                                    "score": 6,
                                                    "created_utc": 1607119649.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
                    "author": "TheGreyDestroyer7",
                    "id": "gemuigx",
                    "parent_id": "t1_gemolsw",
                    "score": 3,
                    "created_utc": 1607115344.0,
                    "replies": [
                        {
                            "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                            "author": "TyrionGoldenLion",
                            "id": "gemzmef",
                            "parent_id": "t1_gemuigx",
                            "score": 3,
                            "created_utc": 1607117931.0,
                            "replies": [
                                {
                                    "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                                    "author": "TheGreyDestroyer7",
                                    "id": "gen01iy",
                                    "parent_id": "t1_gemzmef",
                                    "score": 1,
                                    "created_utc": 1607118149.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
                    "author": null,
                    "id": "hitlybp",
                    "parent_id": "t1_gemolsw",
                    "score": 1,
                    "created_utc": 1635721887.0,
                    "replies": [
                        {
                            "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                            "author": "TyrionGoldenLion",
                            "id": "hivb2w9",
                            "parent_id": "t1_hitlybp",
                            "score": 1,
                            "created_utc": 1635763013.0,
                            "replies": [
                                {
                                    "body": "Wait what",
                                    "author": null,
                                    "id": "hiwjdvw",
                                    "parent_id": "t1_hivb2w9",
                                    "score": 1,
                                    "created_utc": 1635786188.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Salt",
            "author": "Edvart",
            "id": "genbu42",
            "parent_id": "t1_gen23i4",
            "score": -2,
            "created_utc": 1607124530.0,
            "replies": []
        },
        {
            "body": "No, it isn't. The demise of the Uchiha was shown in the series to be excused as a result of \"grave misfortune\".\n\nDeclassifying their history would of course change circumstances, but they are at least not treated with shame in the status quo.",
            "author": "martinmix52",
            "id": "gen0ut7",
            "parent_id": "t1_gemolsw",
            "score": 15,
            "created_utc": 1607118569.0,
            "replies": [
                {
                    "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
                    "author": "TyrionGoldenLion",
                    "id": "gen1da9",
                    "parent_id": "t1_gen0ut7",
                    "score": 4,
                    "created_utc": 1607118837.0,
                    "replies": [
                        {
                            "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                            "author": "PikaYoshl",
                            "id": "gepxgfe",
                            "parent_id": "t1_gen1da9",
                            "score": 3,
                            "created_utc": 1607192440.0,
                            "replies": [
                                {
                                    "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gepxmi2",
                                    "parent_id": "t1_gepxgfe",
                                    "score": -1,
                                    "created_utc": 1607192523.0,
                                    "replies": [
                                        {
                                            "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                            "author": "PikaYoshl",
                                            "id": "gepzuz9",
                                            "parent_id": "t1_gepxmi2",
                                            "score": 2,
                                            "created_utc": 1607193522.0,
                                            "replies": [
                                                {
                                                    "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "geq0657",
                                                    "parent_id": "t1_gepzuz9",
                                                    "score": 1,
                                                    "created_utc": 1607193662.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                            "author": "PikaYoshl",
                                                            "id": "geq1x4p",
                                                            "parent_id": "t1_geq0657",
                                                            "score": 1,
                                                            "created_utc": 1607194512.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                            "author": "martinmix52",
                            "id": "gen1z0k",
                            "parent_id": "t1_gen1da9",
                            "score": 1,
                            "created_utc": 1607119155.0,
                            "replies": [
                                {
                                    "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gen27k0",
                                    "parent_id": "t1_gen1z0k",
                                    "score": 1,
                                    "created_utc": 1607119281.0,
                                    "replies": [
                                        {
                                            "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                            "author": "martinmix52",
                                            "id": "gen2wms",
                                            "parent_id": "t1_gen27k0",
                                            "score": 6,
                                            "created_utc": 1607119649.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Simply from a political standpoint, Konoha would be better off having the Uchiha name still around, simply because other nations that have fought Konoha in previous wars have remembered that name as one to be afraid of. Even if some of the more recent members have done some bad things, their strength cannot be contested.",
            "author": "TheGreyDestroyer7",
            "id": "gemuigx",
            "parent_id": "t1_gemolsw",
            "score": 3,
            "created_utc": 1607115344.0,
            "replies": [
                {
                    "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
                    "author": "TyrionGoldenLion",
                    "id": "gemzmef",
                    "parent_id": "t1_gemuigx",
                    "score": 3,
                    "created_utc": 1607117931.0,
                    "replies": [
                        {
                            "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                            "author": "TheGreyDestroyer7",
                            "id": "gen01iy",
                            "parent_id": "t1_gemzmef",
                            "score": 1,
                            "created_utc": 1607118149.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Every other clan have a dark history too though, not just Uchiha. Back in those days it was every ninja for themselves",
            "author": null,
            "id": "hitlybp",
            "parent_id": "t1_gemolsw",
            "score": 1,
            "created_utc": 1635721887.0,
            "replies": [
                {
                    "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
                    "author": "TyrionGoldenLion",
                    "id": "hivb2w9",
                    "parent_id": "t1_hitlybp",
                    "score": 1,
                    "created_utc": 1635763013.0,
                    "replies": [
                        {
                            "body": "Wait what",
                            "author": null,
                            "id": "hiwjdvw",
                            "parent_id": "t1_hivb2w9",
                            "score": 1,
                            "created_utc": 1635786188.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some Uchiha corrupted the entire Mist,.mindraped their leader and caused some of the bloodiest genocides and barbaric rules in ninja history.\n\nTwo Uchiha were responsible for the 4th World Wars.\n\nThey are responsible for so many deaths and bloodshed and conflicts.\n\nAs far as the people know, an Uchiha went mad and killed most other Uchiha.\n\n\nAnd by now, people know they are ridiculously overpowered and unpredictable.\n\nIt's gonna take a long time for people to forget just how shitty this cursed clan have been.",
            "author": "TyrionGoldenLion",
            "id": "gen1da9",
            "parent_id": "t1_gen0ut7",
            "score": 4,
            "created_utc": 1607118837.0,
            "replies": [
                {
                    "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
                    "author": "PikaYoshl",
                    "id": "gepxgfe",
                    "parent_id": "t1_gen1da9",
                    "score": 3,
                    "created_utc": 1607192440.0,
                    "replies": [
                        {
                            "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                            "author": "TyrionGoldenLion",
                            "id": "gepxmi2",
                            "parent_id": "t1_gepxgfe",
                            "score": -1,
                            "created_utc": 1607192523.0,
                            "replies": [
                                {
                                    "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                                    "author": "PikaYoshl",
                                    "id": "gepzuz9",
                                    "parent_id": "t1_gepxmi2",
                                    "score": 2,
                                    "created_utc": 1607193522.0,
                                    "replies": [
                                        {
                                            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                            "author": "TyrionGoldenLion",
                                            "id": "geq0657",
                                            "parent_id": "t1_gepzuz9",
                                            "score": 1,
                                            "created_utc": 1607193662.0,
                                            "replies": [
                                                {
                                                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                                    "author": "PikaYoshl",
                                                    "id": "geq1x4p",
                                                    "parent_id": "t1_geq0657",
                                                    "score": 1,
                                                    "created_utc": 1607194512.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
                    "author": "martinmix52",
                    "id": "gen1z0k",
                    "parent_id": "t1_gen1da9",
                    "score": 1,
                    "created_utc": 1607119155.0,
                    "replies": [
                        {
                            "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                            "author": "TyrionGoldenLion",
                            "id": "gen27k0",
                            "parent_id": "t1_gen1z0k",
                            "score": 1,
                            "created_utc": 1607119281.0,
                            "replies": [
                                {
                                    "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                                    "author": "martinmix52",
                                    "id": "gen2wms",
                                    "parent_id": "t1_gen27k0",
                                    "score": 6,
                                    "created_utc": 1607119649.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Except that's the opposite of Naruto's main and best held theme: fear and other such negative emotions are no good. The ninja nations were united through friendship and love. A forgave Sasuke not out of fear but understanding with Naruto and positivity.",
            "author": "TyrionGoldenLion",
            "id": "gemzmef",
            "parent_id": "t1_gemuigx",
            "score": 3,
            "created_utc": 1607117931.0,
            "replies": [
                {
                    "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
                    "author": "TheGreyDestroyer7",
                    "id": "gen01iy",
                    "parent_id": "t1_gemzmef",
                    "score": 1,
                    "created_utc": 1607118149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But it was only Uchiha who caused world wars in the name of an evil aloe vera. Face it, no other ninja clan was as bad as the Uchiha.",
            "author": "TyrionGoldenLion",
            "id": "hivb2w9",
            "parent_id": "t1_hitlybp",
            "score": 1,
            "created_utc": 1635763013.0,
            "replies": [
                {
                    "body": "Wait what",
                    "author": null,
                    "id": "hiwjdvw",
                    "parent_id": "t1_hivb2w9",
                    "score": 1,
                    "created_utc": 1635786188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Madara and Obito had both distanced themselves from the Uchiha clan I do think anyone in the Ninja world really blames the Uchiha themselves esp. when most of them got massacred",
            "author": "PikaYoshl",
            "id": "gepxgfe",
            "parent_id": "t1_gen1da9",
            "score": 3,
            "created_utc": 1607192440.0,
            "replies": [
                {
                    "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
                    "author": "TyrionGoldenLion",
                    "id": "gepxmi2",
                    "parent_id": "t1_gepxgfe",
                    "score": -1,
                    "created_utc": 1607192523.0,
                    "replies": [
                        {
                            "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                            "author": "PikaYoshl",
                            "id": "gepzuz9",
                            "parent_id": "t1_gepxmi2",
                            "score": 2,
                            "created_utc": 1607193522.0,
                            "replies": [
                                {
                                    "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                                    "author": "TyrionGoldenLion",
                                    "id": "geq0657",
                                    "parent_id": "t1_gepzuz9",
                                    "score": 1,
                                    "created_utc": 1607193662.0,
                                    "replies": [
                                        {
                                            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                            "author": "PikaYoshl",
                                            "id": "geq1x4p",
                                            "parent_id": "t1_geq0657",
                                            "score": 1,
                                            "created_utc": 1607194512.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> As far as the people know, an Uchiha went mad and killed most other Uchiha.\n\nAh, yes. Misfortune at its finest lol.\n\nOn the bright side though, people can hopefully spin Sasuke's story to be one that redeems the (few living) Uchiha. Also, considering the rampant usage of genjutsu (which isn't exclusive to Uchiha), it should be easier than IRL to excuse horrible crimes (and even IRL governments have successfully practiced revisionism).",
            "author": "martinmix52",
            "id": "gen1z0k",
            "parent_id": "t1_gen1da9",
            "score": 1,
            "created_utc": 1607119155.0,
            "replies": [
                {
                    "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
                    "author": "TyrionGoldenLion",
                    "id": "gen27k0",
                    "parent_id": "t1_gen1z0k",
                    "score": 1,
                    "created_utc": 1607119281.0,
                    "replies": [
                        {
                            "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                            "author": "martinmix52",
                            "id": "gen2wms",
                            "parent_id": "t1_gen27k0",
                            "score": 6,
                            "created_utc": 1607119649.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I get you, I’m just saying I don’t feel like the Uchiha clan is going to be completely wiped out.",
            "author": "TheGreyDestroyer7",
            "id": "gen01iy",
            "parent_id": "t1_gemzmef",
            "score": 1,
            "created_utc": 1607118149.0,
            "replies": []
        },
        {
            "body": "Wait what",
            "author": null,
            "id": "hiwjdvw",
            "parent_id": "t1_hivb2w9",
            "score": 1,
            "created_utc": 1635786188.0,
            "replies": []
        },
        {
            "body": "Sure but most know their potential and how they easily get living weapons of mass destruction. With their emotions.\n\nUchiha are a ticking bomb.",
            "author": "TyrionGoldenLion",
            "id": "gepxmi2",
            "parent_id": "t1_gepxgfe",
            "score": -1,
            "created_utc": 1607192523.0,
            "replies": [
                {
                    "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
                    "author": "PikaYoshl",
                    "id": "gepzuz9",
                    "parent_id": "t1_gepxmi2",
                    "score": 2,
                    "created_utc": 1607193522.0,
                    "replies": [
                        {
                            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                            "author": "TyrionGoldenLion",
                            "id": "geq0657",
                            "parent_id": "t1_gepzuz9",
                            "score": 1,
                            "created_utc": 1607193662.0,
                            "replies": [
                                {
                                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                                    "author": "PikaYoshl",
                                    "id": "geq1x4p",
                                    "parent_id": "t1_geq0657",
                                    "score": 1,
                                    "created_utc": 1607194512.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, unless Sarada singlehandedly saves the world before everyone's eyes, I can't see the Uchiha's name getting a realistic redemption.\n\nOf course Kishimoto may not care about realistic and totally ignore the consequences of Uchiha's actions.",
            "author": "TyrionGoldenLion",
            "id": "gen27k0",
            "parent_id": "t1_gen1z0k",
            "score": 1,
            "created_utc": 1607119281.0,
            "replies": [
                {
                    "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
                    "author": "martinmix52",
                    "id": "gen2wms",
                    "parent_id": "t1_gen27k0",
                    "score": 6,
                    "created_utc": 1607119649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Listening to Tobirama a little too much? Lol Orochimaru said that it was the leaf that caused most of the Uchiha to end up suffering and become either terrorists or something else",
            "author": "PikaYoshl",
            "id": "gepzuz9",
            "parent_id": "t1_gepxmi2",
            "score": 2,
            "created_utc": 1607193522.0,
            "replies": [
                {
                    "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
                    "author": "TyrionGoldenLion",
                    "id": "geq0657",
                    "parent_id": "t1_gepzuz9",
                    "score": 1,
                    "created_utc": 1607193662.0,
                    "replies": [
                        {
                            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                            "author": "PikaYoshl",
                            "id": "geq1x4p",
                            "parent_id": "t1_geq0657",
                            "score": 1,
                            "created_utc": 1607194512.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I dunno man, Uchihas got ninja president in their pocket lol\n\nBut yeah, they better make Sarada's road to hokage a convincing and **hard** one ; sadly, the series has to be way darker and deeper than it is now for this to be pulled off with aplomb",
            "author": "martinmix52",
            "id": "gen2wms",
            "parent_id": "t1_gen27k0",
            "score": 6,
            "created_utc": 1607119649.0,
            "replies": []
        },
        {
            "body": "Too busy making up excuses for the Uchiha? Lol Orochimaru said no such a thing.\n\nLeaf didn't force the Uchiha to serve Zetsu. Leaf didn't make a terrorist out of Madara and Obito. Leaf didn't make the Uchiha kill their loved ones for power. Leaf didn't give the Uchiha Curse of Hatred.",
            "author": "TyrionGoldenLion",
            "id": "geq0657",
            "parent_id": "t1_gepzuz9",
            "score": 1,
            "created_utc": 1607193662.0,
            "replies": [
                {
                    "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
                    "author": "PikaYoshl",
                    "id": "geq1x4p",
                    "parent_id": "t1_geq0657",
                    "score": 1,
                    "created_utc": 1607194512.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes he did lol go watch him revive the hokage it was there where they explained a lot of things about the Uchiha and what Orochimaru said",
            "author": "PikaYoshl",
            "id": "geq1x4p",
            "parent_id": "t1_geq0657",
            "score": 1,
            "created_utc": 1607194512.0,
            "replies": []
        }
    ]
}