{
    "title": "Unexpected byproduct of sugaring - nostalgia and appreciation for what I have",
    "post_id": "hihfgg",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hihfgg/unexpected_byproduct_of_sugaring_nostalgia_and/",
    "author": "MrBuzzard",
    "body": "Feeling kind of philosophical.   Not sure if this post has much of a point, but I felt like sharing.  Just in one of those moods.  \n\nI come from a lower middle class background, and my Dad needed to watch every penny.  Kind of went overboard, but that was a byproduct of living through the Great Depression.  Had to borrow money to afford engineering school and it took ten years to repay those loans.  So when I started out on my own, I had to be very careful with money.  Car was a beater, and lived in a modest apartment with second hand furniture.  \n\nAlong the way, I decided to start a tech company after getting an MBA, and managed to sell it a few years later for a modest of money.   But enough to build a respectable house and have some savings.   Started a second one, and sold it too.  This time for a lot more money.  Started another one, which has not had an exit yet.  When it does, it will likely dwarf the other two exits.  Also made some investments that have done very well.  So life has changed a lot over the years.\n\nI have a young SB who is just starting out.  She has brought me into her life in a way that I know a lot about her.  When she rents a new place, buys something new, or has a financial setback.  I watch her get excited when she thrifts an amazing new outfit for peanuts.  Or other simple things like finally getting a nice coffee table for her new place.  Which she want to share with me by sending pictures.  These “little” things are a big deal to her, including “minor” things that enhance her room.  My God, I have forgotten what it was like to just have a room to live in.  \n\nThis has caused me to realize that I have kind of lost perspective on the difference between how life was and how it is now.  I never even think twice about anything I want.  I can just do it with no material impact to my lifestyle.  When stuff comes easy, the excitement kind of disappears.  Things are taken for granted.  Watching SB at her stage of life has caused me to look at myself and realize how fortunate I am.  And likely kind of callous to others whose life has not worked out so well.  I am thinking through what I am going to do about these feelings.  I am almost certain, I would not be thinking this way, if I had not started sugaring.  \n\nThe second part is the nostalgia.  Before all the “been there, done that” had set in.  Watching her has brought back a ton of memories about when I was going through the kinds of things she is experiencing now.  Like getting my first place, or having a serous “oh shit” moment when the car breaks down and you don’t want the financial hit of paying someone to fix it, so you fix it yourself. Those days had faded deep into memory, but they have been kind of brought back to life, as a result of knowing her so well.  \n\nI guess this is one of the by-products of a serious age gap.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hihfgg/unexpected_byproduct_of_sugaring_nostalgia_and/",
    "score": 187,
    "upvote_ratio": 0.97,
    "created_utc": 1593496559.0,
    "num_comments": 37,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You’ve put into a wonderful short story something I’ve felt but never said as well as you.  Thank you for this. \n\nDo you feel a certain energy from the relationship?  Like, the joys, the highs, the lows she feels are so far above/below the baseline you’d experience without her that it gives you energy when you’d otherwise just be going through the day like normal at that baseline?\n\nI feel like you’d express this better than me but it’s something more than one SB has said they see in me and how I react to their life experiences - I’m elated by the highs, maybe more than they are; and drop everything to help someone I trust through the lows.",
            "author": "ORD-inary",
            "id": "fwg8pb9",
            "parent_id": "t3_hihfgg",
            "score": 31,
            "created_utc": 1593498565.0,
            "replies": [
                {
                    "body": "Yes, the energy is real.  As you pass through life and navigate so many challenges, everything can be kind of mundane and old hat.  You just fall into this steady state of existing if you are not careful.\n\nShe does not have that steady state - she oscillates high and low, just like all young people, even though I think she is more extreme than most.  We have travelled together and on about the third trip, the relationship just went to another level, in that I think she finally thought of herself as an equal in the experiences we were creating together.   It no longer felt like I was a benefactor in any way.  We were just two people.   This took her highs to new places, and she drove an energy into me that I had almost forgotten how to experience.   Watching her be so excited about everything is and was intoxicating.  Way above my baseline as you put it.\n\nShe is also extremely sensitive, and prone to being hurt by people being jerks.  Especially if those are people she is close to.  I have been with her during these down times too.  A few times I have helped her overcome some of these situations.  Made me feel awesome when that happened. Pulled her through some lows as you put it.  \n\nSo you are bang on with the question about energy.  She has yanked me out of my steady state.  Not something she set out to do.  It just happened.",
                    "author": "MrBuzzard",
                    "id": "fwgangg",
                    "parent_id": "t1_fwg8pb9",
                    "score": 25,
                    "created_utc": 1593500333.0,
                    "replies": [
                        {
                            "body": ">You’ve put into a wonderful short story something I’ve felt but never said as well as you.  Thank you for this.\n\nJust wanted to give this comment from ORD-inary a +1 from me. Thanks for taking the time to write this.",
                            "author": "SDF_Acc",
                            "id": "fwktlu8",
                            "parent_id": "t1_fwgangg",
                            "score": 3,
                            "created_utc": 1593607548.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I do so agree with this.",
                    "author": "TY2022",
                    "id": "fwgakiz",
                    "parent_id": "t1_fwg8pb9",
                    "score": 4,
                    "created_utc": 1593500260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The first time I took my SB to a wine tasting event at a Michelin restaurant, I was enjoying the excited looks on her face more than the wine. She had never been to one ever.\n\nThe first time I took my SB to a private shopping session at Harrods, she couldn't believe that such things existed. She was jumping for joy. She didn't realise that you can get people to try on cloths for you while you sit on the sofa drinking champagne....\n\nThat time when I just opened my banking app and transferred a large amount of money to her for her rent deposits, she just couldn't believe that I trusted her so much to do that. Even her own parents didn't have that kind of money to give her. She was touched with joy and that look of appreciation on her face I will never forget. \n\nAnd when she broke down on the motor way going to a music event, I just called AA and used my membership to her out of trouble. She couldn't believe that I could actually help her from the other side of the world (I was away on business in China). To her, I was like the omnipresent omnipotent God!\n\nYeah I miss those days.",
            "author": "eurosd",
            "id": "fwgbf43",
            "parent_id": "t3_hihfgg",
            "score": 36,
            "created_utc": 1593501040.0,
            "replies": [
                {
                    "body": "You sound like the perfect man. Little jealous of your SB NGL!",
                    "author": "kristalle21",
                    "id": "fwhtlk0",
                    "parent_id": "t1_fwgbf43",
                    "score": 5,
                    "created_utc": 1593537898.0,
                    "replies": [
                        {
                            "body": "Yeah we had our moments.\n\nBut she's now back in her home country due to this virus. And she's not coming back as it was her last year at university.\n\nI am forever grateful to her for showing me that there's still life after 50.\n\nIf not because of the bowl, I would have never loved again so late in my life.",
                            "author": "eurosd",
                            "id": "fwimbqd",
                            "parent_id": "t1_fwhtlk0",
                            "score": 15,
                            "created_utc": 1593551356.0,
                            "replies": [
                                {
                                    "body": "It sounds like a beautiful relationship 💜 xxx",
                                    "author": "kristalle21",
                                    "id": "fwk4h5a",
                                    "parent_id": "t1_fwimbqd",
                                    "score": 1,
                                    "created_utc": 1593584303.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Omg whats Harolds?? That sounds amazing",
                    "author": "cornycatlady",
                    "id": "fwhc143",
                    "parent_id": "t1_fwgbf43",
                    "score": 2,
                    "created_utc": 1593529458.0,
                    "replies": [
                        {
                            "body": "I think he means Harrad’s in London.  Amazing place.",
                            "author": "MrBuzzard",
                            "id": "fwhctgc",
                            "parent_id": "t1_fwhc143",
                            "score": 6,
                            "created_utc": 1593529854.0,
                            "replies": [
                                {
                                    "body": "I have to go next time I’m in London 🤤🤤",
                                    "author": "cornycatlady",
                                    "id": "fwhcvk5",
                                    "parent_id": "t1_fwhctgc",
                                    "score": 1,
                                    "created_utc": 1593529883.0,
                                    "replies": [
                                        {
                                            "body": "https://www.harrods.com/en-gb/\n\nTake your bf with you.",
                                            "author": "eurosd",
                                            "id": "fwhpxzy",
                                            "parent_id": "t1_fwhcvk5",
                                            "score": 5,
                                            "created_utc": 1593536162.0,
                                            "replies": [
                                                {
                                                    "body": "Jaw-dropping-damnnnnnn!!!! 😮😳 This is the Style For my broad shoulders!",
                                                    "author": "BeautyGr8ce",
                                                    "id": "fzsl9l8",
                                                    "parent_id": "t1_fwhpxzy",
                                                    "score": 1,
                                                    "created_utc": 1596145875.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I love to shop for cloth at harolds 😏",
                    "author": "Driftwould92",
                    "id": "fwh0p22",
                    "parent_id": "t1_fwgbf43",
                    "score": 0,
                    "created_utc": 1593523317.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I came from a similar background. My mother passed when I was a few months old and my father remarried. He eventually remarried and over time he became abusive and my stepmom was an alcoholic. Most of my teenage years I was bouncing around friends’ homes and at times essentially homeless, but thankfully not on the streets, as I was blessed to have friends with stable parents at home. My father was MIA after age 14 or so, which was for the best. I haven’t spoken to him in over 20 years. \n\nLong story short, I grew up with no structure or stability and no father figure to guide me through becoming a man. Therefore I started everything in life a lot later including discovering who I was and what I was capable of achieving. Life was hard but it molded me into a self sufficient, always choose action mindset, and perhaps most importantly, built up my tolerance to endure pain. That ability to handle pain and shrug off life’s punches helped me to will myself to success in my mid thirties (in my forties now). \n\nAll that to say I have never forgotten where I came from and take what I have for granted. The key is always to do what you did with this post. Pause and take a step back to reflect and regain your perspective. That pain and suffering in childhood and the hard road to make something out of yourself from nothing is the foundation that keeps you grounded to reality. When life starts losing its joy or you find yourself shrugging off the life that you willed into existence as if it wasn’t a big deal, that’s a signal that you’ve lost perspective and need to re-ground yourself back to reality. \n\nIt doesn’t matter how you keep your life perspective as long as you have a method to constantly pull you back in and stay grounded. It looks like dating a young SB that’s finding her way in life is yours. I can’t think of anything better than that 😂🥂",
            "author": "2eyes1mowth",
            "id": "fwgnrab",
            "parent_id": "t3_hihfgg",
            "score": 9,
            "created_utc": 1593513218.0,
            "replies": [
                {
                    "body": "Wow.  My Dad was a hard-ass where nothing was ever good enough, but I never had to deal with anything like this.  Congratulations on overcoming such a rough start in life.",
                    "author": "MrBuzzard",
                    "id": "fwgrfxo",
                    "parent_id": "t1_fwgnrab",
                    "score": 4,
                    "created_utc": 1593516609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly you put almost every other sugar daddy to shame with this post! This is how it should be! I love the way you notice and appreciate the little things! If she knew the little things you said about her that you find endearing, she’d probably appreciate that more than the money itself! Go you, SD ❤️",
            "author": "katanious",
            "id": "fwgeiab",
            "parent_id": "t3_hihfgg",
            "score": 8,
            "created_utc": 1593503954.0,
            "replies": []
        },
        {
            "body": "Watching my SD have everything he wants at his fingertips have given me a wake up call too. I also grew up like you did, I was very scared of spending money, constantly worrying about what debt my mom could get us into whenever she bought us nice things.\n\n\nSince then I always wanted a lot of money. It used to represents freedom and safety. But watching my sugar daddies over the years, one richer than the other, I dunno. One of them has a drinking problem and is going through a major identity crisis, which is turning into anxiety etc. The other one seems to be clinging into every bit of youth he has left, and can't relate to anything I say unless it has something to do with money or expensive hobbies. \n\n\nMoney is problems, whether you have little or a lot. Life is pain anyway, so why bother to fight for more than you you need? I just want to afford to put the heater on without worrying about the electrical bill, and maybe the occasional luxury vacation. But that's about it",
            "author": null,
            "id": "fwh0c1k",
            "parent_id": "t3_hihfgg",
            "score": 9,
            "created_utc": 1593523096.0,
            "replies": [
                {
                    "body": "Different perspective to consider.  I would not necessarily equate the issues those guys are having to money.  The guy who can’t relate, would likely be that way, whether he had money or not.\n\nSecondly, I would highly recommend you look well into the future, and see how much money you are going to need to comfortably live come retirement or god forbid, to deal with a nasty shock like millions are feeling right now.  Many people do not properly plan so that they can have a comfortable future.  \n\nFinally, on the “why bother fighting” front, you can avoid that trade if you pursue something that excites you AND can be financially rewarding at the same time.   In my case, money was never the driving factor in putting myself through the craziness and stress of starting companies.  It was just something I had to do, to feel fulfilled.  So ya, there was a big fight, but I wanted it.  \n\nThe financial gain was secondary.  But let me tell you, there is a bunch of comfort knowing that an event like Covid cannot destroy your lifestyle.  I have a wife with health problems.  We make it better by being able to afford support for her.   Support that is going to get more and more expensive.  Curveballs like that can ruin lives if you cannot afford to effectively deal with them, when they surprise you.\n\nJust another point of view I think.",
                    "author": "MrBuzzard",
                    "id": "fwh49s8",
                    "parent_id": "t1_fwh0c1k",
                    "score": 7,
                    "created_utc": 1593525395.0,
                    "replies": [
                        {
                            "body": "Thanks for your perspective! It's all about what goals you have in life.\n\n\nI'm trying to pursue happiness a little differently, and I don't think the traditional route is for me. I don't want an emotional baseline, I want my life to be dynamic.",
                            "author": null,
                            "id": "fwh4jzp",
                            "parent_id": "t1_fwh49s8",
                            "score": 5,
                            "created_utc": 1593525554.0,
                            "replies": [
                                {
                                    "body": "Then go for it!!  I had to pursue my route over all kinds of objections from people who thought I was reckless and taking stupid risks.  If I had listened to everyone who wanted me to go traditional, I would have been frustrated and unhappy my entire working life.  Don’t settle.",
                                    "author": "MrBuzzard",
                                    "id": "fwh5cyz",
                                    "parent_id": "t1_fwh4jzp",
                                    "score": 8,
                                    "created_utc": 1593526003.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Life and money is not pain  when you  have  family who is with you everytime.(  though I  think 10 times before buying  anything. But it  helps me to understand   which things you should priorities  in life.  )\nMaterialistic things will never give you  true happiness",
                    "author": null,
                    "id": "fwk0y9f",
                    "parent_id": "t1_fwh0c1k",
                    "score": 1,
                    "created_utc": 1593581427.0,
                    "replies": [
                        {
                            "body": "It's good that you found something that makes you happy, but that recipe might not work for everyone",
                            "author": null,
                            "id": "fwkmuxo",
                            "parent_id": "t1_fwk0y9f",
                            "score": 1,
                            "created_utc": 1593602279.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You said this so well. I have become old and cynical. I love the look of excitement in my SB when she accomplishes what to me is a mundane task.",
            "author": "AFSMSgt",
            "id": "fwgo5h5",
            "parent_id": "t3_hihfgg",
            "score": 4,
            "created_utc": 1593513595.0,
            "replies": []
        },
        {
            "body": "I am a self made guy just like you but I have actually have a different perspective about SBs. I remember being quite the adult by the time I was 22. \nPaid my way through college and grad school, worked multiple jobs, took full course loads. Went to work on Wall Street and bought my first apartment in Manhattan at age 26 Etc. Since then life has rewarded me well for the hard work and many sacrifices made. \nBut the SB population even at 30 are about FOMO and YOLO. I know I don’t speak for all but for many. I see the generation stuck in almost a perpetual college fest instead of growing up and taking charge of their lives.",
            "author": null,
            "id": "fwhk6yn",
            "parent_id": "t3_hihfgg",
            "score": 4,
            "created_utc": 1593533431.0,
            "replies": [
                {
                    "body": "I feel dumb for asking, but what is FOMO and YOLO?",
                    "author": null,
                    "id": "fwjbvzc",
                    "parent_id": "t1_fwhk6yn",
                    "score": 1,
                    "created_utc": 1593565020.0,
                    "replies": [
                        {
                            "body": "Fear of Missing Out and You Only Live Once.",
                            "author": "Motif82",
                            "id": "fwjdlem",
                            "parent_id": "t1_fwjbvzc",
                            "score": 3,
                            "created_utc": 1593566044.0,
                            "replies": [
                                {
                                    "body": "Thanks! Now I feel hip and cool.",
                                    "author": null,
                                    "id": "fwjo7nh",
                                    "parent_id": "t1_fwjdlem",
                                    "score": 3,
                                    "created_utc": 1593572567.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've come late from a link, but this is SUCH a good post.  It makes me reflect on things as well.  Travel used to feel exciting; now all cities seem the same.  Flying business class was a treat; now, it's just 'flying'. Thank you so much for sharing your story. It makes me think about mine.",
            "author": "xxnightrain",
            "id": "fzpbi37",
            "parent_id": "t3_hihfgg",
            "score": 2,
            "created_utc": 1596088526.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fzqx3b5",
            "parent_id": "t3_hihfgg",
            "score": 2,
            "created_utc": 1596129044.0,
            "replies": [
                {
                    "body": "This is kind of a response to the three new posts.  Very appreciated BTW.  I see lots of posts saying it is impossible or difficult to have anything in common with someone so much younger.  If I had not lived this experience, I would call BS on anyone claiming to have a close relationship with a young woman where the age gap is huge.  But no longer, given what has happened to me in this arrangement.  It is life changing.  \n\nWe are in different cities, but either talk live or text every day.  Today had been especially cute.  She is all excited about a band she is currently obsessed with.  Sent me a song and wanted to know if I had heard of them.  The freakin Mama’s and Papa’s from the 60’s!  I am visiting her in a couple of weeks, and we are going to get aerial footage with this new drone I just bought.  Of all things, she is excited about us editing a movie together with “our” footage.  Her enthusiasm for almost everything is intoxicating.  \n\nOf course, all of this interlaced with how much she is looking forward to cuddling and hugging.  Us older guys sometimes strike gold I guess.",
                    "author": "MrBuzzard",
                    "id": "fzt2pp9",
                    "parent_id": "t1_fzqx3b5",
                    "score": 1,
                    "created_utc": 1596154046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwh9e2b",
            "parent_id": "t3_hihfgg",
            "score": 2,
            "created_utc": 1593528120.0,
            "replies": [
                {
                    "body": "If I am being played, sign me up for some more.",
                    "author": "MrBuzzard",
                    "id": "fwhb9xd",
                    "parent_id": "t1_fwh9e2b",
                    "score": 3,
                    "created_utc": 1593529076.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so true!  Great post!",
            "author": "HJ71",
            "id": "fwgd5of",
            "parent_id": "t3_hihfgg",
            "score": 1,
            "created_utc": 1593502651.0,
            "replies": []
        },
        {
            "body": "This post was such a breath of fresh air. It’s wonderful when anyone can gain such a deeper appreciation for the things we sometimes take for granted. \nHappy for you!",
            "author": "SunnyWinter85",
            "id": "fwh1mp6",
            "parent_id": "t3_hihfgg",
            "score": 1,
            "created_utc": 1593523883.0,
            "replies": []
        },
        {
            "body": "Great post, and I can certainly relate. I keenly remember my college days and early 20s, when something like new tires for the car would need to be put on a credit card because I couldn't afford it. Being able to help a bright, beautiful, promising SB with something like that without a second thought, knowing what a weight that lifts of of them, is certainly one of the great joys of a sugar relationship.",
            "author": "roscoe7585",
            "id": "fwhoqma",
            "parent_id": "t3_hihfgg",
            "score": 1,
            "created_utc": 1593535590.0,
            "replies": []
        },
        {
            "body": "I have never forgotten where I came from of course going to 3rd world countries to volunteer keeps you grounded.",
            "author": "bookworm010101",
            "id": "fwhxxfs",
            "parent_id": "t3_hihfgg",
            "score": 1,
            "created_utc": 1593539919.0,
            "replies": []
        },
        {
            "body": "This was a good read, Mr. B.",
            "author": "PioneerExperience",
            "id": "fwl381t",
            "parent_id": "t3_hihfgg",
            "score": 1,
            "created_utc": 1593613306.0,
            "replies": []
        },
        {
            "body": "> I guess this is one of the by-products of a serious age gap. \n\nThis goes beyond sugaring. I was riding out the Great Recession in college, and fell into a relationship with a 19 y/o, when I was 39. She was from a religious cult and frankly used me to mainstream herself. She knew exactly what she was doing.  We had an almost 5 year run, and broke up with love when she went to grad school. 10/10, would do again. \n\nYou are way more financially successful than I am. That stuff I don't relate to. But everything else you said, the little things and the big things, oh yeah, absolutely. \n\nHonestly, she changed my life. The first time we went wilderness backpacking, it was a shit show. The last time we went, we were dialed in. Honestly, helping her get on better paths helped me get on better paths. \n\nI haven't been able to bring myself to getting into the Bowl because I'd have to be decidedly salty to do it. The problem is that this damned plague has made \"warm approach\" (using eye contact and smiles as cues) virtually impossible right now. I keep telling myself that as long as I'm up front (i.e. putting \"this place is Tinder to me\" in my profile) I'd likely to be screened out by serious SB's and pick up the bored ones (I'm conventionally attractive, living alone in my apartment, legit single.)\n\nI am so absolutely hooked on the youthful energy and enthusiasm, though. I am just not interested in women my age. To be fair, the feelings fairly mutual. I'm useless to them.",
            "author": null,
            "id": "fzrfqol",
            "parent_id": "t3_hihfgg",
            "score": 1,
            "created_utc": 1596135677.0,
            "replies": []
        },
        {
            "body": "Yes, the energy is real.  As you pass through life and navigate so many challenges, everything can be kind of mundane and old hat.  You just fall into this steady state of existing if you are not careful.\n\nShe does not have that steady state - she oscillates high and low, just like all young people, even though I think she is more extreme than most.  We have travelled together and on about the third trip, the relationship just went to another level, in that I think she finally thought of herself as an equal in the experiences we were creating together.   It no longer felt like I was a benefactor in any way.  We were just two people.   This took her highs to new places, and she drove an energy into me that I had almost forgotten how to experience.   Watching her be so excited about everything is and was intoxicating.  Way above my baseline as you put it.\n\nShe is also extremely sensitive, and prone to being hurt by people being jerks.  Especially if those are people she is close to.  I have been with her during these down times too.  A few times I have helped her overcome some of these situations.  Made me feel awesome when that happened. Pulled her through some lows as you put it.  \n\nSo you are bang on with the question about energy.  She has yanked me out of my steady state.  Not something she set out to do.  It just happened.",
            "author": "MrBuzzard",
            "id": "fwgangg",
            "parent_id": "t1_fwg8pb9",
            "score": 25,
            "created_utc": 1593500333.0,
            "replies": [
                {
                    "body": ">You’ve put into a wonderful short story something I’ve felt but never said as well as you.  Thank you for this.\n\nJust wanted to give this comment from ORD-inary a +1 from me. Thanks for taking the time to write this.",
                    "author": "SDF_Acc",
                    "id": "fwktlu8",
                    "parent_id": "t1_fwgangg",
                    "score": 3,
                    "created_utc": 1593607548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do so agree with this.",
            "author": "TY2022",
            "id": "fwgakiz",
            "parent_id": "t1_fwg8pb9",
            "score": 4,
            "created_utc": 1593500260.0,
            "replies": []
        },
        {
            "body": "You sound like the perfect man. Little jealous of your SB NGL!",
            "author": "kristalle21",
            "id": "fwhtlk0",
            "parent_id": "t1_fwgbf43",
            "score": 5,
            "created_utc": 1593537898.0,
            "replies": [
                {
                    "body": "Yeah we had our moments.\n\nBut she's now back in her home country due to this virus. And she's not coming back as it was her last year at university.\n\nI am forever grateful to her for showing me that there's still life after 50.\n\nIf not because of the bowl, I would have never loved again so late in my life.",
                    "author": "eurosd",
                    "id": "fwimbqd",
                    "parent_id": "t1_fwhtlk0",
                    "score": 15,
                    "created_utc": 1593551356.0,
                    "replies": [
                        {
                            "body": "It sounds like a beautiful relationship 💜 xxx",
                            "author": "kristalle21",
                            "id": "fwk4h5a",
                            "parent_id": "t1_fwimbqd",
                            "score": 1,
                            "created_utc": 1593584303.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg whats Harolds?? That sounds amazing",
            "author": "cornycatlady",
            "id": "fwhc143",
            "parent_id": "t1_fwgbf43",
            "score": 2,
            "created_utc": 1593529458.0,
            "replies": [
                {
                    "body": "I think he means Harrad’s in London.  Amazing place.",
                    "author": "MrBuzzard",
                    "id": "fwhctgc",
                    "parent_id": "t1_fwhc143",
                    "score": 6,
                    "created_utc": 1593529854.0,
                    "replies": [
                        {
                            "body": "I have to go next time I’m in London 🤤🤤",
                            "author": "cornycatlady",
                            "id": "fwhcvk5",
                            "parent_id": "t1_fwhctgc",
                            "score": 1,
                            "created_utc": 1593529883.0,
                            "replies": [
                                {
                                    "body": "https://www.harrods.com/en-gb/\n\nTake your bf with you.",
                                    "author": "eurosd",
                                    "id": "fwhpxzy",
                                    "parent_id": "t1_fwhcvk5",
                                    "score": 5,
                                    "created_utc": 1593536162.0,
                                    "replies": [
                                        {
                                            "body": "Jaw-dropping-damnnnnnn!!!! 😮😳 This is the Style For my broad shoulders!",
                                            "author": "BeautyGr8ce",
                                            "id": "fzsl9l8",
                                            "parent_id": "t1_fwhpxzy",
                                            "score": 1,
                                            "created_utc": 1596145875.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love to shop for cloth at harolds 😏",
            "author": "Driftwould92",
            "id": "fwh0p22",
            "parent_id": "t1_fwgbf43",
            "score": 0,
            "created_utc": 1593523317.0,
            "replies": []
        },
        {
            "body": "Wow.  My Dad was a hard-ass where nothing was ever good enough, but I never had to deal with anything like this.  Congratulations on overcoming such a rough start in life.",
            "author": "MrBuzzard",
            "id": "fwgrfxo",
            "parent_id": "t1_fwgnrab",
            "score": 4,
            "created_utc": 1593516609.0,
            "replies": []
        },
        {
            "body": "Different perspective to consider.  I would not necessarily equate the issues those guys are having to money.  The guy who can’t relate, would likely be that way, whether he had money or not.\n\nSecondly, I would highly recommend you look well into the future, and see how much money you are going to need to comfortably live come retirement or god forbid, to deal with a nasty shock like millions are feeling right now.  Many people do not properly plan so that they can have a comfortable future.  \n\nFinally, on the “why bother fighting” front, you can avoid that trade if you pursue something that excites you AND can be financially rewarding at the same time.   In my case, money was never the driving factor in putting myself through the craziness and stress of starting companies.  It was just something I had to do, to feel fulfilled.  So ya, there was a big fight, but I wanted it.  \n\nThe financial gain was secondary.  But let me tell you, there is a bunch of comfort knowing that an event like Covid cannot destroy your lifestyle.  I have a wife with health problems.  We make it better by being able to afford support for her.   Support that is going to get more and more expensive.  Curveballs like that can ruin lives if you cannot afford to effectively deal with them, when they surprise you.\n\nJust another point of view I think.",
            "author": "MrBuzzard",
            "id": "fwh49s8",
            "parent_id": "t1_fwh0c1k",
            "score": 7,
            "created_utc": 1593525395.0,
            "replies": [
                {
                    "body": "Thanks for your perspective! It's all about what goals you have in life.\n\n\nI'm trying to pursue happiness a little differently, and I don't think the traditional route is for me. I don't want an emotional baseline, I want my life to be dynamic.",
                    "author": null,
                    "id": "fwh4jzp",
                    "parent_id": "t1_fwh49s8",
                    "score": 5,
                    "created_utc": 1593525554.0,
                    "replies": [
                        {
                            "body": "Then go for it!!  I had to pursue my route over all kinds of objections from people who thought I was reckless and taking stupid risks.  If I had listened to everyone who wanted me to go traditional, I would have been frustrated and unhappy my entire working life.  Don’t settle.",
                            "author": "MrBuzzard",
                            "id": "fwh5cyz",
                            "parent_id": "t1_fwh4jzp",
                            "score": 8,
                            "created_utc": 1593526003.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Life and money is not pain  when you  have  family who is with you everytime.(  though I  think 10 times before buying  anything. But it  helps me to understand   which things you should priorities  in life.  )\nMaterialistic things will never give you  true happiness",
            "author": null,
            "id": "fwk0y9f",
            "parent_id": "t1_fwh0c1k",
            "score": 1,
            "created_utc": 1593581427.0,
            "replies": [
                {
                    "body": "It's good that you found something that makes you happy, but that recipe might not work for everyone",
                    "author": null,
                    "id": "fwkmuxo",
                    "parent_id": "t1_fwk0y9f",
                    "score": 1,
                    "created_utc": 1593602279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel dumb for asking, but what is FOMO and YOLO?",
            "author": null,
            "id": "fwjbvzc",
            "parent_id": "t1_fwhk6yn",
            "score": 1,
            "created_utc": 1593565020.0,
            "replies": [
                {
                    "body": "Fear of Missing Out and You Only Live Once.",
                    "author": "Motif82",
                    "id": "fwjdlem",
                    "parent_id": "t1_fwjbvzc",
                    "score": 3,
                    "created_utc": 1593566044.0,
                    "replies": [
                        {
                            "body": "Thanks! Now I feel hip and cool.",
                            "author": null,
                            "id": "fwjo7nh",
                            "parent_id": "t1_fwjdlem",
                            "score": 3,
                            "created_utc": 1593572567.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is kind of a response to the three new posts.  Very appreciated BTW.  I see lots of posts saying it is impossible or difficult to have anything in common with someone so much younger.  If I had not lived this experience, I would call BS on anyone claiming to have a close relationship with a young woman where the age gap is huge.  But no longer, given what has happened to me in this arrangement.  It is life changing.  \n\nWe are in different cities, but either talk live or text every day.  Today had been especially cute.  She is all excited about a band she is currently obsessed with.  Sent me a song and wanted to know if I had heard of them.  The freakin Mama’s and Papa’s from the 60’s!  I am visiting her in a couple of weeks, and we are going to get aerial footage with this new drone I just bought.  Of all things, she is excited about us editing a movie together with “our” footage.  Her enthusiasm for almost everything is intoxicating.  \n\nOf course, all of this interlaced with how much she is looking forward to cuddling and hugging.  Us older guys sometimes strike gold I guess.",
            "author": "MrBuzzard",
            "id": "fzt2pp9",
            "parent_id": "t1_fzqx3b5",
            "score": 1,
            "created_utc": 1596154046.0,
            "replies": []
        },
        {
            "body": "If I am being played, sign me up for some more.",
            "author": "MrBuzzard",
            "id": "fwhb9xd",
            "parent_id": "t1_fwh9e2b",
            "score": 3,
            "created_utc": 1593529076.0,
            "replies": []
        },
        {
            "body": ">You’ve put into a wonderful short story something I’ve felt but never said as well as you.  Thank you for this.\n\nJust wanted to give this comment from ORD-inary a +1 from me. Thanks for taking the time to write this.",
            "author": "SDF_Acc",
            "id": "fwktlu8",
            "parent_id": "t1_fwgangg",
            "score": 3,
            "created_utc": 1593607548.0,
            "replies": []
        },
        {
            "body": "Yeah we had our moments.\n\nBut she's now back in her home country due to this virus. And she's not coming back as it was her last year at university.\n\nI am forever grateful to her for showing me that there's still life after 50.\n\nIf not because of the bowl, I would have never loved again so late in my life.",
            "author": "eurosd",
            "id": "fwimbqd",
            "parent_id": "t1_fwhtlk0",
            "score": 15,
            "created_utc": 1593551356.0,
            "replies": [
                {
                    "body": "It sounds like a beautiful relationship 💜 xxx",
                    "author": "kristalle21",
                    "id": "fwk4h5a",
                    "parent_id": "t1_fwimbqd",
                    "score": 1,
                    "created_utc": 1593584303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think he means Harrad’s in London.  Amazing place.",
            "author": "MrBuzzard",
            "id": "fwhctgc",
            "parent_id": "t1_fwhc143",
            "score": 6,
            "created_utc": 1593529854.0,
            "replies": [
                {
                    "body": "I have to go next time I’m in London 🤤🤤",
                    "author": "cornycatlady",
                    "id": "fwhcvk5",
                    "parent_id": "t1_fwhctgc",
                    "score": 1,
                    "created_utc": 1593529883.0,
                    "replies": [
                        {
                            "body": "https://www.harrods.com/en-gb/\n\nTake your bf with you.",
                            "author": "eurosd",
                            "id": "fwhpxzy",
                            "parent_id": "t1_fwhcvk5",
                            "score": 5,
                            "created_utc": 1593536162.0,
                            "replies": [
                                {
                                    "body": "Jaw-dropping-damnnnnnn!!!! 😮😳 This is the Style For my broad shoulders!",
                                    "author": "BeautyGr8ce",
                                    "id": "fzsl9l8",
                                    "parent_id": "t1_fwhpxzy",
                                    "score": 1,
                                    "created_utc": 1596145875.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for your perspective! It's all about what goals you have in life.\n\n\nI'm trying to pursue happiness a little differently, and I don't think the traditional route is for me. I don't want an emotional baseline, I want my life to be dynamic.",
            "author": null,
            "id": "fwh4jzp",
            "parent_id": "t1_fwh49s8",
            "score": 5,
            "created_utc": 1593525554.0,
            "replies": [
                {
                    "body": "Then go for it!!  I had to pursue my route over all kinds of objections from people who thought I was reckless and taking stupid risks.  If I had listened to everyone who wanted me to go traditional, I would have been frustrated and unhappy my entire working life.  Don’t settle.",
                    "author": "MrBuzzard",
                    "id": "fwh5cyz",
                    "parent_id": "t1_fwh4jzp",
                    "score": 8,
                    "created_utc": 1593526003.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's good that you found something that makes you happy, but that recipe might not work for everyone",
            "author": null,
            "id": "fwkmuxo",
            "parent_id": "t1_fwk0y9f",
            "score": 1,
            "created_utc": 1593602279.0,
            "replies": []
        },
        {
            "body": "Fear of Missing Out and You Only Live Once.",
            "author": "Motif82",
            "id": "fwjdlem",
            "parent_id": "t1_fwjbvzc",
            "score": 3,
            "created_utc": 1593566044.0,
            "replies": [
                {
                    "body": "Thanks! Now I feel hip and cool.",
                    "author": null,
                    "id": "fwjo7nh",
                    "parent_id": "t1_fwjdlem",
                    "score": 3,
                    "created_utc": 1593572567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It sounds like a beautiful relationship 💜 xxx",
            "author": "kristalle21",
            "id": "fwk4h5a",
            "parent_id": "t1_fwimbqd",
            "score": 1,
            "created_utc": 1593584303.0,
            "replies": []
        },
        {
            "body": "I have to go next time I’m in London 🤤🤤",
            "author": "cornycatlady",
            "id": "fwhcvk5",
            "parent_id": "t1_fwhctgc",
            "score": 1,
            "created_utc": 1593529883.0,
            "replies": [
                {
                    "body": "https://www.harrods.com/en-gb/\n\nTake your bf with you.",
                    "author": "eurosd",
                    "id": "fwhpxzy",
                    "parent_id": "t1_fwhcvk5",
                    "score": 5,
                    "created_utc": 1593536162.0,
                    "replies": [
                        {
                            "body": "Jaw-dropping-damnnnnnn!!!! 😮😳 This is the Style For my broad shoulders!",
                            "author": "BeautyGr8ce",
                            "id": "fzsl9l8",
                            "parent_id": "t1_fwhpxzy",
                            "score": 1,
                            "created_utc": 1596145875.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then go for it!!  I had to pursue my route over all kinds of objections from people who thought I was reckless and taking stupid risks.  If I had listened to everyone who wanted me to go traditional, I would have been frustrated and unhappy my entire working life.  Don’t settle.",
            "author": "MrBuzzard",
            "id": "fwh5cyz",
            "parent_id": "t1_fwh4jzp",
            "score": 8,
            "created_utc": 1593526003.0,
            "replies": []
        },
        {
            "body": "Thanks! Now I feel hip and cool.",
            "author": null,
            "id": "fwjo7nh",
            "parent_id": "t1_fwjdlem",
            "score": 3,
            "created_utc": 1593572567.0,
            "replies": []
        },
        {
            "body": "https://www.harrods.com/en-gb/\n\nTake your bf with you.",
            "author": "eurosd",
            "id": "fwhpxzy",
            "parent_id": "t1_fwhcvk5",
            "score": 5,
            "created_utc": 1593536162.0,
            "replies": [
                {
                    "body": "Jaw-dropping-damnnnnnn!!!! 😮😳 This is the Style For my broad shoulders!",
                    "author": "BeautyGr8ce",
                    "id": "fzsl9l8",
                    "parent_id": "t1_fwhpxzy",
                    "score": 1,
                    "created_utc": 1596145875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Jaw-dropping-damnnnnnn!!!! 😮😳 This is the Style For my broad shoulders!",
            "author": "BeautyGr8ce",
            "id": "fzsl9l8",
            "parent_id": "t1_fwhpxzy",
            "score": 1,
            "created_utc": 1596145875.0,
            "replies": []
        }
    ]
}