{
    "title": "It’s a small world",
    "post_id": "kbxe1f",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kbxe1f/its_a_small_world/",
    "author": "alias_obvs",
    "body": "Another update: sure, I’ll show you the pictures EXCEPT that would be TOTALLY unprofessional. So pls stop dming about that. It’s not like it’s very hard to find pictures of pretty girls on the internet, or so I’ve heard. Thank you. \n\nUpdated, see end. \n\nAside from my actual profession in the finance industry I also have a photography studio and do a little bit of commercial work, mostly with photography clients I’ve worked with for decades. Recently I’ve decided to renew my portfolio and I’ve done a few portfolio sessions with aspiring models. I should note here that I’ve never made a pass at a model, even when I was much younger and did lots of model and fashion shoots. \n\nAnyway. A couple weeks ago I photograph a girl who wants to get into modelling. Tonight I’m a bit bored and browse SA - I’m really not there a lot - and scrolling down I go “hey that’s a much better picture than usual... hmm, I recognise that picture... oh... oh...”\n\nFunny thing is, she’s coming in for another session tomorrow...\n\nUpdate: session’s just wrapped, no funny business. We did do some semi risqué pics (though nothing that couldn’t be shown on Netflix)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kbxe1f/its_a_small_world/",
    "score": 104,
    "upvote_ratio": 0.95,
    "created_utc": 1607808508.0,
    "num_comments": 54,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I’m super interested to know if/how you plan on approaching her about this! It could be magic, or super awkward.\n\nEdit: it could be way worse than super awkward for several reasons I added in a comment below. Oops!",
            "author": "FoxyFreckles1989",
            "id": "gflj7uu",
            "parent_id": "t3_kbxe1f",
            "score": 35,
            "created_utc": 1607812399.0,
            "replies": [
                {
                    "body": "So if this was someone I recognised in a work setting I’d never say anything. In this case I’m not sure I should bring it up. Perhaps ask her if she’s gotten any use out of the pictures?",
                    "author": "alias_obvs",
                    "id": "gflo7g7",
                    "parent_id": "t1_gflj7uu",
                    "score": 17,
                    "created_utc": 1607813955.0,
                    "replies": [
                        {
                            "body": "Honestly, and this doesn’t happen often, I don’t have advice to offer to you. On one hand, I feel there is potential here. On the other, if I were her and you’d seen me on SA after shooting me I’m not sure I’d want to know. Especially if I planned to continue to use you as my photog. I’d feel self conscious in front of your camera after it came out and that would steal the experience of having a photog I was comfortable with, which is really a bigger deal than many might think! You’re really the only one that can decide since you know her mannerisms, personality etc. and might be able to gauge whether or not it would freak her out. The only thing I’m decidedly against is ever messaging her on the site. Bringing it up in person after you’ve already completed tomorrow’s shoot could possibly end well!",
                            "author": "FoxyFreckles1989",
                            "id": "gflpewv",
                            "parent_id": "t1_gflo7g7",
                            "score": 16,
                            "created_utc": 1607814310.0,
                            "replies": [
                                {
                                    "body": "There’s a trust you need to have in photography for sure. Also I let my hair down, metaphorically, in the studio and don’t really present in a “SD” way there, if you know what I mean",
                                    "author": "alias_obvs",
                                    "id": "gflqnt2",
                                    "parent_id": "t1_gflpewv",
                                    "score": 8,
                                    "created_utc": 1607814655.0,
                                    "replies": [
                                        {
                                            "body": "Absolutely. It could ruin the relationship there, and isn’t guaranteed to start another relationship, either. You might just need to file this away in the, “that was cool to see,” category and let it go. But, if you do approach her, be cool and kind and then come tell me how it went! Lol.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gflqz0o",
                                            "parent_id": "t1_gflqnt2",
                                            "score": 8,
                                            "created_utc": 1607814740.0,
                                            "replies": [
                                                {
                                                    "body": "I agree with everything in the thread but just wanted to add a thought...could you spin it (after the session so it's not awkward) that you saw her profile and it would be great to have a friend that you can discuss sugar openly with and maybe she'd like to grab a drink sometime. And then maybe things progress more organically or maybe you just have a friend? So it kinda puts the ball in her court to decide if you are someone she wants to try to impress and flirt with or if she isn't interested without the direct pressure on her.",
                                                    "author": "tamenwild",
                                                    "id": "gfm12mb",
                                                    "parent_id": "t1_gflqz0o",
                                                    "score": 10,
                                                    "created_utc": 1607817684.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gfm7kk9",
                                                            "parent_id": "t1_gfm12mb",
                                                            "score": 7,
                                                            "created_utc": 1607819597.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                                                                    "author": "pinotandsugar",
                                                                    "id": "gfnqmce",
                                                                    "parent_id": "t1_gfm7kk9",
                                                                    "score": 3,
                                                                    "created_utc": 1607843625.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "gfnr79c",
                                                                            "parent_id": "t1_gfnqmce",
                                                                            "score": 2,
                                                                            "created_utc": 1607843898.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                                                                    "author": "alias_obvs",
                                                                                    "id": "gfnw9gx",
                                                                                    "parent_id": "t1_gfnr79c",
                                                                                    "score": 2,
                                                                                    "created_utc": 1607846335.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                                                                            "author": "FoxyFreckles1989",
                                                                                            "id": "gfo1r1l",
                                                                                            "parent_id": "t1_gfnw9gx",
                                                                                            "score": 1,
                                                                                            "created_utc": 1607849064.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "As usual F^2   is spot on",
                                                                                    "author": "pinotandsugar",
                                                                                    "id": "gfrznu7",
                                                                                    "parent_id": "t1_gfnr79c",
                                                                                    "score": 2,
                                                                                    "created_utc": 1607917407.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Thank you. I really just want to help!",
                                                                                            "author": "FoxyFreckles1989",
                                                                                            "id": "gfs1ff3",
                                                                                            "parent_id": "t1_gfrznu7",
                                                                                            "score": 1,
                                                                                            "created_utc": 1607918444.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                                                                    "author": "Classy_Curves",
                                                                    "id": "gfnqmgr",
                                                                    "parent_id": "t1_gfm7kk9",
                                                                    "score": 2,
                                                                    "created_utc": 1607843627.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I find that very attractive. \n\nTo be clear I was referring to the \"letting your hair down\" and not presenting as a SD. I like humble and approachable.\n\nHumility is very attractive to me. Good approach.",
                                            "author": "Classy_Curves",
                                            "id": "gfnqedi",
                                            "parent_id": "t1_gflqnt2",
                                            "score": 3,
                                            "created_utc": 1607843529.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I wouldn't bring it up.",
                            "author": "Classy_Curves",
                            "id": "gfnqa8l",
                            "parent_id": "t1_gflo7g7",
                            "score": 4,
                            "created_utc": 1607843479.0,
                            "replies": [
                                {
                                    "body": "Yeah, in my comment above I finally listed several reasons I believe it to be a bad idea, ultimately. I hadn’t given it enough thought, before, and then they all just hit me. It could go *really* wrong.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gfns1xn",
                                    "parent_id": "t1_gfnqa8l",
                                    "score": 2,
                                    "created_utc": 1607844289.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I vote magic!",
                    "author": "Ghanaiantoffee",
                    "id": "gflo1gh",
                    "parent_id": "t1_gflj7uu",
                    "score": 12,
                    "created_utc": 1607813909.0,
                    "replies": [
                        {
                            "body": "I *want* the magic but am not sure I vote for trying to get it. Lmao!",
                            "author": "FoxyFreckles1989",
                            "id": "gflpoby",
                            "parent_id": "t1_gflo1gh",
                            "score": 10,
                            "created_utc": 1607814378.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because of my businesses (real estate, cannabis, own a bar) it’s not uncommon for me to see girls I SA that I have interacted with in real life.   Usually I ignore it but If I am really into her I’ll shoot my shot.  Here is my message. \n\n“Hey,  I see we are both on here and I couldn’t help but shoot my shot as I find you very charming and attractive.  If you are not interested then just block me and we can both pretend we didn’t see each other and this message never happened 😂.  If you are open to it,  I would be honored.”\n\n\nAs far as photogs... there is a huge overlap between SA and Model Mayhem.  My friend is a well known local photog and he is friends with every babe in the Bay Area.  He’s flamboyantly gay and he can really make women comfortable.  He has done several boudoir shoots for my sugar babies over the years.  It’s my favorite Christmas gift to capture them in my mind forever.  Watching a big gay dude demonstrate  the poses he wants is hilarious.",
            "author": "LotBuilder",
            "id": "gfmfekf",
            "parent_id": "t3_kbxe1f",
            "score": 9,
            "created_utc": 1607822549.0,
            "replies": [
                {
                    "body": "Your situation is quite different, because none of the businesses you run involve a woman being vulnerable and opening herself up in front of your camera. It’s a very intimate thing. Above, I mentioned that if he does bring this up and it makes her feel awkward, it could result in a number of things causing quite the landslide. She might mention it to her friends in the area, (“this dude was supposed to be my photographer, saw me on SA and proposed a SR/date and it made me feel super uncomfortable—how unprofessional is that?”) effectively losing him photog clients, possibly compromising his anonymity and potentially even ruining his chances in the bowl, locally. This is obviously just one of many ways it could go, but for me, the possibility alone would make it unworthy of pursuing, were I in his shoes. I also feel like I’d be super put off if I were her, and he did bring it up.",
                    "author": "FoxyFreckles1989",
                    "id": "gfnst4o",
                    "parent_id": "t1_gfmfekf",
                    "score": 3,
                    "created_utc": 1607844639.0,
                    "replies": [
                        {
                            "body": "It’s my understanding (from the girls I know) that 9/10 male photographers are a little creepy and hit on them in person so sending a message through a platform where both sides are openly seeking a sugar relationship isn’t really a breech of industry standards.  Saying such a message will trigger a “landslide” that would harm his side business and blackball him in an area is being quite dramatic.",
                            "author": "LotBuilder",
                            "id": "gfpmh2e",
                            "parent_id": "t1_gfnst4o",
                            "score": 1,
                            "created_utc": 1607877199.0,
                            "replies": [
                                {
                                    "body": "I am not being dramatic. I am being realistic in telling him to be cautious. Yes, lots of male photographers *are* creepy and he seems not to be, takes his business seriously, and remains professional at all times. That is exactly why he should absolutely not message her on the site. I was presenting worse case possibilities. What I think is most likely is she’ll be put off by it, feel awkward and stop having him shoot her. Which he doesn’t want. He’s already said he doesn’t plan on approaching her.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gfpug33",
                                    "parent_id": "t1_gfpmh2e",
                                    "score": 1,
                                    "created_utc": 1607880503.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "An average straight dude is also a bit of a sight demonstrating poses. I have some very funny behind the scenes pics taken of me by assistants that might make for a good calendar",
                    "author": "alias_obvs",
                    "id": "gfo51x6",
                    "parent_id": "t1_gfmfekf",
                    "score": 1,
                    "created_utc": 1607850941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This might be a slightly different perspective, but I’ve recently really become interested in boudoir photography. I had a very close friend who would take pics of me & I’d take some amateur pics of her as well for her fiancé who I’m also friends with. One day she approached me & more or less offered to buy my pics for her fiancé. He apparently had a crush on me in high school & had some fantasy to fulfill knowing that I’d never actually touch him they decided asking for my pics would be better. I firmly, but kindly declined & haven’t felt comfortable with her taking my pics since then. \n\nSo basically if she’s not throwing you flirty vibes then I’d leave it alone. It could be quite awkward if she’s not interested.",
            "author": "5ft1ofSugarBabyfun",
            "id": "gfmi8ek",
            "parent_id": "t3_kbxe1f",
            "score": 9,
            "created_utc": 1607823669.0,
            "replies": [
                {
                    "body": "Well. Points for asking you about the pics when she probably had them anyway I guess.",
                    "author": "alias_obvs",
                    "id": "gfo4sul",
                    "parent_id": "t1_gfmi8ek",
                    "score": 1,
                    "created_utc": 1607850813.0,
                    "replies": [
                        {
                            "body": "She didn’t. They were taken with my camera. They were just amateur pics taken for fun. She’s not a professional just someone that I felt comfort with at the time. I’ll throw in that I also was not as comfortable with my body back then as I am now (the reason I used a close friend instead of a professional at the time). I say recently, but it was really close to 2 yrs ago.",
                            "author": "5ft1ofSugarBabyfun",
                            "id": "gfp3h3f",
                            "parent_id": "t1_gfo4sul",
                            "score": 2,
                            "created_utc": 1607868538.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe... she saw you first",
            "author": "Spacerangerbabe",
            "id": "gflo2c2",
            "parent_id": "t3_kbxe1f",
            "score": 6,
            "created_utc": 1607813916.0,
            "replies": []
        },
        {
            "body": "I’ve been a model for half of my life and while I am not ashamed of sugaring, I would be taken aback if a professional asked me to potentially enter into an SR, UNLESS there was clear chemistry. I’ve vanilla dated photographers before and the chemistry was pretty instantaneous, especially since you are so vulnerable in front of the camera. \n\nIf I were you, since she sounds really green to modelling too, I’d shoot her again tomorrow and see what kind of rapport you have then, casually flirt with her. If she’s receptive then I would go ahead.",
            "author": "kirathekira",
            "id": "gfmpin3",
            "parent_id": "t3_kbxe1f",
            "score": 4,
            "created_utc": 1607826593.0,
            "replies": [
                {
                    "body": "Yeah, approaching her regarding hanging out or dating is one thing but adding on the extra layer of sugaring could be a big turn off and scare her away.",
                    "author": "Classy_Curves",
                    "id": "gfnqz5r",
                    "parent_id": "t1_gfmpin3",
                    "score": 3,
                    "created_utc": 1607843791.0,
                    "replies": [
                        {
                            "body": "I think in this case the age difference is such that I’d not consider an approach for hanging out or dating appropriate at all. Never mind that I’d never do that in the studio context anyway. \n\nWell, maybe if some age-appropriate woman started talking about philosophy and art, coupled with her love for dogs, hiking, and booze...",
                            "author": "alias_obvs",
                            "id": "gfnx6tr",
                            "parent_id": "t1_gfnqz5r",
                            "score": 4,
                            "created_utc": 1607846780.0,
                            "replies": [
                                {
                                    "body": "Love guys that are attracted to women their own age. <3 \n\nNot sure if that's the \"age-appropriate\" you mean but I like where you're going with that. It's refreshing.",
                                    "author": "Classy_Curves",
                                    "id": "gfnxs5m",
                                    "parent_id": "t1_gfnx6tr",
                                    "score": 3,
                                    "created_utc": 1607847068.0,
                                    "replies": [
                                        {
                                            "body": "Exactly what I meant, Classy",
                                            "author": "alias_obvs",
                                            "id": "gfnyd75",
                                            "parent_id": "t1_gfnxs5m",
                                            "score": 3,
                                            "created_utc": 1607847347.0,
                                            "replies": [
                                                {
                                                    "body": "Cool.",
                                                    "author": "Classy_Curves",
                                                    "id": "gfnz2xf",
                                                    "parent_id": "t1_gfnyd75",
                                                    "score": 1,
                                                    "created_utc": 1607847684.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">Love guys that are attracted to women their own age. <3\n\n🤯🤯🤯",
                                            "author": null,
                                            "id": "gfogbca",
                                            "parent_id": "t1_gfnxs5m",
                                            "score": 0,
                                            "created_utc": 1607857151.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "100% this.",
                            "author": "FoxyFreckles1989",
                            "id": "gfns7zu",
                            "parent_id": "t1_gfnqz5r",
                            "score": 2,
                            "created_utc": 1607844370.0,
                            "replies": [
                                {
                                    "body": "I'd be scared away.",
                                    "author": "Classy_Curves",
                                    "id": "gfnsqg8",
                                    "parent_id": "t1_gfns7zu",
                                    "score": 2,
                                    "created_utc": 1607844605.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thanks for the perspective, I’ll just work with her the same way I do with anyone. \n\nI might bring up my other work and life situation, if it comes up in conversation, and see what happens.",
                    "author": "alias_obvs",
                    "id": "gfnwjt1",
                    "parent_id": "t1_gfmpin3",
                    "score": 1,
                    "created_utc": 1607846475.0,
                    "replies": [
                        {
                            "body": "I think it's risky to bring up the sugaring life.",
                            "author": "Classy_Curves",
                            "id": "gfnz0yp",
                            "parent_id": "t1_gfnwjt1",
                            "score": 2,
                            "created_utc": 1607847657.0,
                            "replies": [
                                {
                                    "body": "Haha no, I wouldn’t do that. \n\nThe conversation in the first session was, as usually happens, focused on the experience of the model and the mechanics of getting useable images. For subsequent sessions, where the aim is to get specific, good, images, there is more of a getting to know one another element usually. This is where it might come up that I primarily work in finance and am divorced with late teenage kids. She already knows I have an unnecessarily cute dog :)\n\nBut as I said, this is something I’d talk about with anyone I’m shooting in order to build a rapport.",
                                    "author": "alias_obvs",
                                    "id": "gfo3y06",
                                    "parent_id": "t1_gfnz0yp",
                                    "score": 1,
                                    "created_utc": 1607850333.0,
                                    "replies": [
                                        {
                                            "body": "Sounds great! \n\nBest wishes!",
                                            "author": "Classy_Curves",
                                            "id": "gfo5h8b",
                                            "parent_id": "t1_gfo3y06",
                                            "score": 1,
                                            "created_utc": 1607851165.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some guys have all the luck!  How are you gonna open that discussion?",
            "author": "stlmo2019",
            "id": "gflgcxb",
            "parent_id": "t3_kbxe1f",
            "score": 3,
            "created_utc": 1607811392.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gfnkd37",
            "parent_id": "t3_kbxe1f",
            "score": 3,
            "created_utc": 1607840497.0,
            "replies": [
                {
                    "body": "Totally agree, see my other comments on the subject of model-photographer interaction",
                    "author": "alias_obvs",
                    "id": "gfnxbk7",
                    "parent_id": "t1_gfnkd37",
                    "score": 1,
                    "created_utc": 1607846844.0,
                    "replies": []
                },
                {
                    "body": "Completely agree to not let the two overlap. Keep it clean.",
                    "author": "Classy_Curves",
                    "id": "gfnr6da",
                    "parent_id": "t1_gfnkd37",
                    "score": 1,
                    "created_utc": 1607843887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perfect meet cute. Do you like her?",
            "author": null,
            "id": "gflg2av",
            "parent_id": "t3_kbxe1f",
            "score": 2,
            "created_utc": 1607811289.0,
            "replies": [
                {
                    "body": "On time, nice cheek bones, great shoulders, decent posture for a non-model, clear skin, took direction well. What’s not to like?",
                    "author": "alias_obvs",
                    "id": "gfls0ak",
                    "parent_id": "t1_gflg2av",
                    "score": 11,
                    "created_utc": 1607815032.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn bro keep us updated! You’re in a great spot😤😤💀",
            "author": "Limitlesspappy",
            "id": "gflzgbo",
            "parent_id": "t3_kbxe1f",
            "score": 1,
            "created_utc": 1607817218.0,
            "replies": []
        },
        {
            "body": "Something similar happened to me. I matched with a sd on tinder, divorcee with kids and in need of some company , and we had been chatting for months. He didn’t explain his profession to me but assured me he was in the health care field. Anyways, i had an upcoming dentist appointment and went in as usual, and kid you not the dentist to greet me was my damn sd. We couldn’t help but laugh , the embarrassment i felt as he looked at my teeth.. gosh ! Anyways are relationship has been great so far !",
            "author": "samwonderland",
            "id": "gfntoor",
            "parent_id": "t3_kbxe1f",
            "score": 1,
            "created_utc": 1607845050.0,
            "replies": [
                {
                    "body": "See, if it happens in that order it’s a different thing. Then you already have shared secret. I’ll probably not say anything today.",
                    "author": "alias_obvs",
                    "id": "gfnvev3",
                    "parent_id": "t1_gfntoor",
                    "score": 1,
                    "created_utc": 1607845906.0,
                    "replies": []
                },
                {
                    "body": "Does tinder match up SDs?",
                    "author": "Classy_Curves",
                    "id": "gfnyihl",
                    "parent_id": "t1_gfntoor",
                    "score": 1,
                    "created_utc": 1607847419.0,
                    "replies": [
                        {
                            "body": "no, that has to be discussed via message",
                            "author": "samwonderland",
                            "id": "gfnyltj",
                            "parent_id": "t1_gfnyihl",
                            "score": 1,
                            "created_utc": 1607847464.0,
                            "replies": [
                                {
                                    "body": "Okay.",
                                    "author": "Classy_Curves",
                                    "id": "gfnz9l0",
                                    "parent_id": "t1_gfnyltj",
                                    "score": 1,
                                    "created_utc": 1607847776.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Earlier this year my gym got a new fitness instructor who moved here from out of town. Right after one class she says she's new here, gives out her Instagram handle saying that she's \"hoping to make some new friends here!\" I add her, she friends me back, and not 24 hours later I see her on seeking. So we're social media and fitness friends now, but I can't help but wonder what would have happened if I was on seeking the day before and connected with her on that platform instead.",
            "author": "I_once_kissed_a_goat",
            "id": "gfs3j7u",
            "parent_id": "t3_kbxe1f",
            "score": 1,
            "created_utc": 1607919696.0,
            "replies": []
        },
        {
            "body": "So if this was someone I recognised in a work setting I’d never say anything. In this case I’m not sure I should bring it up. Perhaps ask her if she’s gotten any use out of the pictures?",
            "author": "alias_obvs",
            "id": "gflo7g7",
            "parent_id": "t1_gflj7uu",
            "score": 17,
            "created_utc": 1607813955.0,
            "replies": [
                {
                    "body": "Honestly, and this doesn’t happen often, I don’t have advice to offer to you. On one hand, I feel there is potential here. On the other, if I were her and you’d seen me on SA after shooting me I’m not sure I’d want to know. Especially if I planned to continue to use you as my photog. I’d feel self conscious in front of your camera after it came out and that would steal the experience of having a photog I was comfortable with, which is really a bigger deal than many might think! You’re really the only one that can decide since you know her mannerisms, personality etc. and might be able to gauge whether or not it would freak her out. The only thing I’m decidedly against is ever messaging her on the site. Bringing it up in person after you’ve already completed tomorrow’s shoot could possibly end well!",
                    "author": "FoxyFreckles1989",
                    "id": "gflpewv",
                    "parent_id": "t1_gflo7g7",
                    "score": 16,
                    "created_utc": 1607814310.0,
                    "replies": [
                        {
                            "body": "There’s a trust you need to have in photography for sure. Also I let my hair down, metaphorically, in the studio and don’t really present in a “SD” way there, if you know what I mean",
                            "author": "alias_obvs",
                            "id": "gflqnt2",
                            "parent_id": "t1_gflpewv",
                            "score": 8,
                            "created_utc": 1607814655.0,
                            "replies": [
                                {
                                    "body": "Absolutely. It could ruin the relationship there, and isn’t guaranteed to start another relationship, either. You might just need to file this away in the, “that was cool to see,” category and let it go. But, if you do approach her, be cool and kind and then come tell me how it went! Lol.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gflqz0o",
                                    "parent_id": "t1_gflqnt2",
                                    "score": 8,
                                    "created_utc": 1607814740.0,
                                    "replies": [
                                        {
                                            "body": "I agree with everything in the thread but just wanted to add a thought...could you spin it (after the session so it's not awkward) that you saw her profile and it would be great to have a friend that you can discuss sugar openly with and maybe she'd like to grab a drink sometime. And then maybe things progress more organically or maybe you just have a friend? So it kinda puts the ball in her court to decide if you are someone she wants to try to impress and flirt with or if she isn't interested without the direct pressure on her.",
                                            "author": "tamenwild",
                                            "id": "gfm12mb",
                                            "parent_id": "t1_gflqz0o",
                                            "score": 10,
                                            "created_utc": 1607817684.0,
                                            "replies": [
                                                {
                                                    "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gfm7kk9",
                                                    "parent_id": "t1_gfm12mb",
                                                    "score": 7,
                                                    "created_utc": 1607819597.0,
                                                    "replies": [
                                                        {
                                                            "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                                                            "author": "pinotandsugar",
                                                            "id": "gfnqmce",
                                                            "parent_id": "t1_gfm7kk9",
                                                            "score": 3,
                                                            "created_utc": 1607843625.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gfnr79c",
                                                                    "parent_id": "t1_gfnqmce",
                                                                    "score": 2,
                                                                    "created_utc": 1607843898.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                                                            "author": "alias_obvs",
                                                                            "id": "gfnw9gx",
                                                                            "parent_id": "t1_gfnr79c",
                                                                            "score": 2,
                                                                            "created_utc": 1607846335.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                                                                    "author": "FoxyFreckles1989",
                                                                                    "id": "gfo1r1l",
                                                                                    "parent_id": "t1_gfnw9gx",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607849064.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "As usual F^2   is spot on",
                                                                            "author": "pinotandsugar",
                                                                            "id": "gfrznu7",
                                                                            "parent_id": "t1_gfnr79c",
                                                                            "score": 2,
                                                                            "created_utc": 1607917407.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Thank you. I really just want to help!",
                                                                                    "author": "FoxyFreckles1989",
                                                                                    "id": "gfs1ff3",
                                                                                    "parent_id": "t1_gfrznu7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1607918444.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                                                            "author": "Classy_Curves",
                                                            "id": "gfnqmgr",
                                                            "parent_id": "t1_gfm7kk9",
                                                            "score": 2,
                                                            "created_utc": 1607843627.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I find that very attractive. \n\nTo be clear I was referring to the \"letting your hair down\" and not presenting as a SD. I like humble and approachable.\n\nHumility is very attractive to me. Good approach.",
                                    "author": "Classy_Curves",
                                    "id": "gfnqedi",
                                    "parent_id": "t1_gflqnt2",
                                    "score": 3,
                                    "created_utc": 1607843529.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wouldn't bring it up.",
                    "author": "Classy_Curves",
                    "id": "gfnqa8l",
                    "parent_id": "t1_gflo7g7",
                    "score": 4,
                    "created_utc": 1607843479.0,
                    "replies": [
                        {
                            "body": "Yeah, in my comment above I finally listed several reasons I believe it to be a bad idea, ultimately. I hadn’t given it enough thought, before, and then they all just hit me. It could go *really* wrong.",
                            "author": "FoxyFreckles1989",
                            "id": "gfns1xn",
                            "parent_id": "t1_gfnqa8l",
                            "score": 2,
                            "created_utc": 1607844289.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I vote magic!",
            "author": "Ghanaiantoffee",
            "id": "gflo1gh",
            "parent_id": "t1_gflj7uu",
            "score": 12,
            "created_utc": 1607813909.0,
            "replies": [
                {
                    "body": "I *want* the magic but am not sure I vote for trying to get it. Lmao!",
                    "author": "FoxyFreckles1989",
                    "id": "gflpoby",
                    "parent_id": "t1_gflo1gh",
                    "score": 10,
                    "created_utc": 1607814378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your situation is quite different, because none of the businesses you run involve a woman being vulnerable and opening herself up in front of your camera. It’s a very intimate thing. Above, I mentioned that if he does bring this up and it makes her feel awkward, it could result in a number of things causing quite the landslide. She might mention it to her friends in the area, (“this dude was supposed to be my photographer, saw me on SA and proposed a SR/date and it made me feel super uncomfortable—how unprofessional is that?”) effectively losing him photog clients, possibly compromising his anonymity and potentially even ruining his chances in the bowl, locally. This is obviously just one of many ways it could go, but for me, the possibility alone would make it unworthy of pursuing, were I in his shoes. I also feel like I’d be super put off if I were her, and he did bring it up.",
            "author": "FoxyFreckles1989",
            "id": "gfnst4o",
            "parent_id": "t1_gfmfekf",
            "score": 3,
            "created_utc": 1607844639.0,
            "replies": [
                {
                    "body": "It’s my understanding (from the girls I know) that 9/10 male photographers are a little creepy and hit on them in person so sending a message through a platform where both sides are openly seeking a sugar relationship isn’t really a breech of industry standards.  Saying such a message will trigger a “landslide” that would harm his side business and blackball him in an area is being quite dramatic.",
                    "author": "LotBuilder",
                    "id": "gfpmh2e",
                    "parent_id": "t1_gfnst4o",
                    "score": 1,
                    "created_utc": 1607877199.0,
                    "replies": [
                        {
                            "body": "I am not being dramatic. I am being realistic in telling him to be cautious. Yes, lots of male photographers *are* creepy and he seems not to be, takes his business seriously, and remains professional at all times. That is exactly why he should absolutely not message her on the site. I was presenting worse case possibilities. What I think is most likely is she’ll be put off by it, feel awkward and stop having him shoot her. Which he doesn’t want. He’s already said he doesn’t plan on approaching her.",
                            "author": "FoxyFreckles1989",
                            "id": "gfpug33",
                            "parent_id": "t1_gfpmh2e",
                            "score": 1,
                            "created_utc": 1607880503.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "An average straight dude is also a bit of a sight demonstrating poses. I have some very funny behind the scenes pics taken of me by assistants that might make for a good calendar",
            "author": "alias_obvs",
            "id": "gfo51x6",
            "parent_id": "t1_gfmfekf",
            "score": 1,
            "created_utc": 1607850941.0,
            "replies": []
        },
        {
            "body": "Well. Points for asking you about the pics when she probably had them anyway I guess.",
            "author": "alias_obvs",
            "id": "gfo4sul",
            "parent_id": "t1_gfmi8ek",
            "score": 1,
            "created_utc": 1607850813.0,
            "replies": [
                {
                    "body": "She didn’t. They were taken with my camera. They were just amateur pics taken for fun. She’s not a professional just someone that I felt comfort with at the time. I’ll throw in that I also was not as comfortable with my body back then as I am now (the reason I used a close friend instead of a professional at the time). I say recently, but it was really close to 2 yrs ago.",
                    "author": "5ft1ofSugarBabyfun",
                    "id": "gfp3h3f",
                    "parent_id": "t1_gfo4sul",
                    "score": 2,
                    "created_utc": 1607868538.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, approaching her regarding hanging out or dating is one thing but adding on the extra layer of sugaring could be a big turn off and scare her away.",
            "author": "Classy_Curves",
            "id": "gfnqz5r",
            "parent_id": "t1_gfmpin3",
            "score": 3,
            "created_utc": 1607843791.0,
            "replies": [
                {
                    "body": "I think in this case the age difference is such that I’d not consider an approach for hanging out or dating appropriate at all. Never mind that I’d never do that in the studio context anyway. \n\nWell, maybe if some age-appropriate woman started talking about philosophy and art, coupled with her love for dogs, hiking, and booze...",
                    "author": "alias_obvs",
                    "id": "gfnx6tr",
                    "parent_id": "t1_gfnqz5r",
                    "score": 4,
                    "created_utc": 1607846780.0,
                    "replies": [
                        {
                            "body": "Love guys that are attracted to women their own age. <3 \n\nNot sure if that's the \"age-appropriate\" you mean but I like where you're going with that. It's refreshing.",
                            "author": "Classy_Curves",
                            "id": "gfnxs5m",
                            "parent_id": "t1_gfnx6tr",
                            "score": 3,
                            "created_utc": 1607847068.0,
                            "replies": [
                                {
                                    "body": "Exactly what I meant, Classy",
                                    "author": "alias_obvs",
                                    "id": "gfnyd75",
                                    "parent_id": "t1_gfnxs5m",
                                    "score": 3,
                                    "created_utc": 1607847347.0,
                                    "replies": [
                                        {
                                            "body": "Cool.",
                                            "author": "Classy_Curves",
                                            "id": "gfnz2xf",
                                            "parent_id": "t1_gfnyd75",
                                            "score": 1,
                                            "created_utc": 1607847684.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">Love guys that are attracted to women their own age. <3\n\n🤯🤯🤯",
                                    "author": null,
                                    "id": "gfogbca",
                                    "parent_id": "t1_gfnxs5m",
                                    "score": 0,
                                    "created_utc": 1607857151.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "100% this.",
                    "author": "FoxyFreckles1989",
                    "id": "gfns7zu",
                    "parent_id": "t1_gfnqz5r",
                    "score": 2,
                    "created_utc": 1607844370.0,
                    "replies": [
                        {
                            "body": "I'd be scared away.",
                            "author": "Classy_Curves",
                            "id": "gfnsqg8",
                            "parent_id": "t1_gfns7zu",
                            "score": 2,
                            "created_utc": 1607844605.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the perspective, I’ll just work with her the same way I do with anyone. \n\nI might bring up my other work and life situation, if it comes up in conversation, and see what happens.",
            "author": "alias_obvs",
            "id": "gfnwjt1",
            "parent_id": "t1_gfmpin3",
            "score": 1,
            "created_utc": 1607846475.0,
            "replies": [
                {
                    "body": "I think it's risky to bring up the sugaring life.",
                    "author": "Classy_Curves",
                    "id": "gfnz0yp",
                    "parent_id": "t1_gfnwjt1",
                    "score": 2,
                    "created_utc": 1607847657.0,
                    "replies": [
                        {
                            "body": "Haha no, I wouldn’t do that. \n\nThe conversation in the first session was, as usually happens, focused on the experience of the model and the mechanics of getting useable images. For subsequent sessions, where the aim is to get specific, good, images, there is more of a getting to know one another element usually. This is where it might come up that I primarily work in finance and am divorced with late teenage kids. She already knows I have an unnecessarily cute dog :)\n\nBut as I said, this is something I’d talk about with anyone I’m shooting in order to build a rapport.",
                            "author": "alias_obvs",
                            "id": "gfo3y06",
                            "parent_id": "t1_gfnz0yp",
                            "score": 1,
                            "created_utc": 1607850333.0,
                            "replies": [
                                {
                                    "body": "Sounds great! \n\nBest wishes!",
                                    "author": "Classy_Curves",
                                    "id": "gfo5h8b",
                                    "parent_id": "t1_gfo3y06",
                                    "score": 1,
                                    "created_utc": 1607851165.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally agree, see my other comments on the subject of model-photographer interaction",
            "author": "alias_obvs",
            "id": "gfnxbk7",
            "parent_id": "t1_gfnkd37",
            "score": 1,
            "created_utc": 1607846844.0,
            "replies": []
        },
        {
            "body": "Completely agree to not let the two overlap. Keep it clean.",
            "author": "Classy_Curves",
            "id": "gfnr6da",
            "parent_id": "t1_gfnkd37",
            "score": 1,
            "created_utc": 1607843887.0,
            "replies": []
        },
        {
            "body": "On time, nice cheek bones, great shoulders, decent posture for a non-model, clear skin, took direction well. What’s not to like?",
            "author": "alias_obvs",
            "id": "gfls0ak",
            "parent_id": "t1_gflg2av",
            "score": 11,
            "created_utc": 1607815032.0,
            "replies": []
        },
        {
            "body": "See, if it happens in that order it’s a different thing. Then you already have shared secret. I’ll probably not say anything today.",
            "author": "alias_obvs",
            "id": "gfnvev3",
            "parent_id": "t1_gfntoor",
            "score": 1,
            "created_utc": 1607845906.0,
            "replies": []
        },
        {
            "body": "Does tinder match up SDs?",
            "author": "Classy_Curves",
            "id": "gfnyihl",
            "parent_id": "t1_gfntoor",
            "score": 1,
            "created_utc": 1607847419.0,
            "replies": [
                {
                    "body": "no, that has to be discussed via message",
                    "author": "samwonderland",
                    "id": "gfnyltj",
                    "parent_id": "t1_gfnyihl",
                    "score": 1,
                    "created_utc": 1607847464.0,
                    "replies": [
                        {
                            "body": "Okay.",
                            "author": "Classy_Curves",
                            "id": "gfnz9l0",
                            "parent_id": "t1_gfnyltj",
                            "score": 1,
                            "created_utc": 1607847776.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, and this doesn’t happen often, I don’t have advice to offer to you. On one hand, I feel there is potential here. On the other, if I were her and you’d seen me on SA after shooting me I’m not sure I’d want to know. Especially if I planned to continue to use you as my photog. I’d feel self conscious in front of your camera after it came out and that would steal the experience of having a photog I was comfortable with, which is really a bigger deal than many might think! You’re really the only one that can decide since you know her mannerisms, personality etc. and might be able to gauge whether or not it would freak her out. The only thing I’m decidedly against is ever messaging her on the site. Bringing it up in person after you’ve already completed tomorrow’s shoot could possibly end well!",
            "author": "FoxyFreckles1989",
            "id": "gflpewv",
            "parent_id": "t1_gflo7g7",
            "score": 16,
            "created_utc": 1607814310.0,
            "replies": [
                {
                    "body": "There’s a trust you need to have in photography for sure. Also I let my hair down, metaphorically, in the studio and don’t really present in a “SD” way there, if you know what I mean",
                    "author": "alias_obvs",
                    "id": "gflqnt2",
                    "parent_id": "t1_gflpewv",
                    "score": 8,
                    "created_utc": 1607814655.0,
                    "replies": [
                        {
                            "body": "Absolutely. It could ruin the relationship there, and isn’t guaranteed to start another relationship, either. You might just need to file this away in the, “that was cool to see,” category and let it go. But, if you do approach her, be cool and kind and then come tell me how it went! Lol.",
                            "author": "FoxyFreckles1989",
                            "id": "gflqz0o",
                            "parent_id": "t1_gflqnt2",
                            "score": 8,
                            "created_utc": 1607814740.0,
                            "replies": [
                                {
                                    "body": "I agree with everything in the thread but just wanted to add a thought...could you spin it (after the session so it's not awkward) that you saw her profile and it would be great to have a friend that you can discuss sugar openly with and maybe she'd like to grab a drink sometime. And then maybe things progress more organically or maybe you just have a friend? So it kinda puts the ball in her court to decide if you are someone she wants to try to impress and flirt with or if she isn't interested without the direct pressure on her.",
                                    "author": "tamenwild",
                                    "id": "gfm12mb",
                                    "parent_id": "t1_gflqz0o",
                                    "score": 10,
                                    "created_utc": 1607817684.0,
                                    "replies": [
                                        {
                                            "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
                                            "author": "FoxyFreckles1989",
                                            "id": "gfm7kk9",
                                            "parent_id": "t1_gfm12mb",
                                            "score": 7,
                                            "created_utc": 1607819597.0,
                                            "replies": [
                                                {
                                                    "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                                                    "author": "pinotandsugar",
                                                    "id": "gfnqmce",
                                                    "parent_id": "t1_gfm7kk9",
                                                    "score": 3,
                                                    "created_utc": 1607843625.0,
                                                    "replies": [
                                                        {
                                                            "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gfnr79c",
                                                            "parent_id": "t1_gfnqmce",
                                                            "score": 2,
                                                            "created_utc": 1607843898.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                                                    "author": "alias_obvs",
                                                                    "id": "gfnw9gx",
                                                                    "parent_id": "t1_gfnr79c",
                                                                    "score": 2,
                                                                    "created_utc": 1607846335.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "gfo1r1l",
                                                                            "parent_id": "t1_gfnw9gx",
                                                                            "score": 1,
                                                                            "created_utc": 1607849064.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "As usual F^2   is spot on",
                                                                    "author": "pinotandsugar",
                                                                    "id": "gfrznu7",
                                                                    "parent_id": "t1_gfnr79c",
                                                                    "score": 2,
                                                                    "created_utc": 1607917407.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thank you. I really just want to help!",
                                                                            "author": "FoxyFreckles1989",
                                                                            "id": "gfs1ff3",
                                                                            "parent_id": "t1_gfrznu7",
                                                                            "score": 1,
                                                                            "created_utc": 1607918444.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                                                    "author": "Classy_Curves",
                                                    "id": "gfnqmgr",
                                                    "parent_id": "t1_gfm7kk9",
                                                    "score": 2,
                                                    "created_utc": 1607843627.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I find that very attractive. \n\nTo be clear I was referring to the \"letting your hair down\" and not presenting as a SD. I like humble and approachable.\n\nHumility is very attractive to me. Good approach.",
                            "author": "Classy_Curves",
                            "id": "gfnqedi",
                            "parent_id": "t1_gflqnt2",
                            "score": 3,
                            "created_utc": 1607843529.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn't bring it up.",
            "author": "Classy_Curves",
            "id": "gfnqa8l",
            "parent_id": "t1_gflo7g7",
            "score": 4,
            "created_utc": 1607843479.0,
            "replies": [
                {
                    "body": "Yeah, in my comment above I finally listed several reasons I believe it to be a bad idea, ultimately. I hadn’t given it enough thought, before, and then they all just hit me. It could go *really* wrong.",
                    "author": "FoxyFreckles1989",
                    "id": "gfns1xn",
                    "parent_id": "t1_gfnqa8l",
                    "score": 2,
                    "created_utc": 1607844289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I *want* the magic but am not sure I vote for trying to get it. Lmao!",
            "author": "FoxyFreckles1989",
            "id": "gflpoby",
            "parent_id": "t1_gflo1gh",
            "score": 10,
            "created_utc": 1607814378.0,
            "replies": []
        },
        {
            "body": "It’s my understanding (from the girls I know) that 9/10 male photographers are a little creepy and hit on them in person so sending a message through a platform where both sides are openly seeking a sugar relationship isn’t really a breech of industry standards.  Saying such a message will trigger a “landslide” that would harm his side business and blackball him in an area is being quite dramatic.",
            "author": "LotBuilder",
            "id": "gfpmh2e",
            "parent_id": "t1_gfnst4o",
            "score": 1,
            "created_utc": 1607877199.0,
            "replies": [
                {
                    "body": "I am not being dramatic. I am being realistic in telling him to be cautious. Yes, lots of male photographers *are* creepy and he seems not to be, takes his business seriously, and remains professional at all times. That is exactly why he should absolutely not message her on the site. I was presenting worse case possibilities. What I think is most likely is she’ll be put off by it, feel awkward and stop having him shoot her. Which he doesn’t want. He’s already said he doesn’t plan on approaching her.",
                    "author": "FoxyFreckles1989",
                    "id": "gfpug33",
                    "parent_id": "t1_gfpmh2e",
                    "score": 1,
                    "created_utc": 1607880503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She didn’t. They were taken with my camera. They were just amateur pics taken for fun. She’s not a professional just someone that I felt comfort with at the time. I’ll throw in that I also was not as comfortable with my body back then as I am now (the reason I used a close friend instead of a professional at the time). I say recently, but it was really close to 2 yrs ago.",
            "author": "5ft1ofSugarBabyfun",
            "id": "gfp3h3f",
            "parent_id": "t1_gfo4sul",
            "score": 2,
            "created_utc": 1607868538.0,
            "replies": []
        },
        {
            "body": "I think in this case the age difference is such that I’d not consider an approach for hanging out or dating appropriate at all. Never mind that I’d never do that in the studio context anyway. \n\nWell, maybe if some age-appropriate woman started talking about philosophy and art, coupled with her love for dogs, hiking, and booze...",
            "author": "alias_obvs",
            "id": "gfnx6tr",
            "parent_id": "t1_gfnqz5r",
            "score": 4,
            "created_utc": 1607846780.0,
            "replies": [
                {
                    "body": "Love guys that are attracted to women their own age. <3 \n\nNot sure if that's the \"age-appropriate\" you mean but I like where you're going with that. It's refreshing.",
                    "author": "Classy_Curves",
                    "id": "gfnxs5m",
                    "parent_id": "t1_gfnx6tr",
                    "score": 3,
                    "created_utc": 1607847068.0,
                    "replies": [
                        {
                            "body": "Exactly what I meant, Classy",
                            "author": "alias_obvs",
                            "id": "gfnyd75",
                            "parent_id": "t1_gfnxs5m",
                            "score": 3,
                            "created_utc": 1607847347.0,
                            "replies": [
                                {
                                    "body": "Cool.",
                                    "author": "Classy_Curves",
                                    "id": "gfnz2xf",
                                    "parent_id": "t1_gfnyd75",
                                    "score": 1,
                                    "created_utc": 1607847684.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">Love guys that are attracted to women their own age. <3\n\n🤯🤯🤯",
                            "author": null,
                            "id": "gfogbca",
                            "parent_id": "t1_gfnxs5m",
                            "score": 0,
                            "created_utc": 1607857151.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% this.",
            "author": "FoxyFreckles1989",
            "id": "gfns7zu",
            "parent_id": "t1_gfnqz5r",
            "score": 2,
            "created_utc": 1607844370.0,
            "replies": [
                {
                    "body": "I'd be scared away.",
                    "author": "Classy_Curves",
                    "id": "gfnsqg8",
                    "parent_id": "t1_gfns7zu",
                    "score": 2,
                    "created_utc": 1607844605.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it's risky to bring up the sugaring life.",
            "author": "Classy_Curves",
            "id": "gfnz0yp",
            "parent_id": "t1_gfnwjt1",
            "score": 2,
            "created_utc": 1607847657.0,
            "replies": [
                {
                    "body": "Haha no, I wouldn’t do that. \n\nThe conversation in the first session was, as usually happens, focused on the experience of the model and the mechanics of getting useable images. For subsequent sessions, where the aim is to get specific, good, images, there is more of a getting to know one another element usually. This is where it might come up that I primarily work in finance and am divorced with late teenage kids. She already knows I have an unnecessarily cute dog :)\n\nBut as I said, this is something I’d talk about with anyone I’m shooting in order to build a rapport.",
                    "author": "alias_obvs",
                    "id": "gfo3y06",
                    "parent_id": "t1_gfnz0yp",
                    "score": 1,
                    "created_utc": 1607850333.0,
                    "replies": [
                        {
                            "body": "Sounds great! \n\nBest wishes!",
                            "author": "Classy_Curves",
                            "id": "gfo5h8b",
                            "parent_id": "t1_gfo3y06",
                            "score": 1,
                            "created_utc": 1607851165.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "no, that has to be discussed via message",
            "author": "samwonderland",
            "id": "gfnyltj",
            "parent_id": "t1_gfnyihl",
            "score": 1,
            "created_utc": 1607847464.0,
            "replies": [
                {
                    "body": "Okay.",
                    "author": "Classy_Curves",
                    "id": "gfnz9l0",
                    "parent_id": "t1_gfnyltj",
                    "score": 1,
                    "created_utc": 1607847776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s a trust you need to have in photography for sure. Also I let my hair down, metaphorically, in the studio and don’t really present in a “SD” way there, if you know what I mean",
            "author": "alias_obvs",
            "id": "gflqnt2",
            "parent_id": "t1_gflpewv",
            "score": 8,
            "created_utc": 1607814655.0,
            "replies": [
                {
                    "body": "Absolutely. It could ruin the relationship there, and isn’t guaranteed to start another relationship, either. You might just need to file this away in the, “that was cool to see,” category and let it go. But, if you do approach her, be cool and kind and then come tell me how it went! Lol.",
                    "author": "FoxyFreckles1989",
                    "id": "gflqz0o",
                    "parent_id": "t1_gflqnt2",
                    "score": 8,
                    "created_utc": 1607814740.0,
                    "replies": [
                        {
                            "body": "I agree with everything in the thread but just wanted to add a thought...could you spin it (after the session so it's not awkward) that you saw her profile and it would be great to have a friend that you can discuss sugar openly with and maybe she'd like to grab a drink sometime. And then maybe things progress more organically or maybe you just have a friend? So it kinda puts the ball in her court to decide if you are someone she wants to try to impress and flirt with or if she isn't interested without the direct pressure on her.",
                            "author": "tamenwild",
                            "id": "gfm12mb",
                            "parent_id": "t1_gflqz0o",
                            "score": 10,
                            "created_utc": 1607817684.0,
                            "replies": [
                                {
                                    "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
                                    "author": "FoxyFreckles1989",
                                    "id": "gfm7kk9",
                                    "parent_id": "t1_gfm12mb",
                                    "score": 7,
                                    "created_utc": 1607819597.0,
                                    "replies": [
                                        {
                                            "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                                            "author": "pinotandsugar",
                                            "id": "gfnqmce",
                                            "parent_id": "t1_gfm7kk9",
                                            "score": 3,
                                            "created_utc": 1607843625.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gfnr79c",
                                                    "parent_id": "t1_gfnqmce",
                                                    "score": 2,
                                                    "created_utc": 1607843898.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                                            "author": "alias_obvs",
                                                            "id": "gfnw9gx",
                                                            "parent_id": "t1_gfnr79c",
                                                            "score": 2,
                                                            "created_utc": 1607846335.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gfo1r1l",
                                                                    "parent_id": "t1_gfnw9gx",
                                                                    "score": 1,
                                                                    "created_utc": 1607849064.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "As usual F^2   is spot on",
                                                            "author": "pinotandsugar",
                                                            "id": "gfrznu7",
                                                            "parent_id": "t1_gfnr79c",
                                                            "score": 2,
                                                            "created_utc": 1607917407.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you. I really just want to help!",
                                                                    "author": "FoxyFreckles1989",
                                                                    "id": "gfs1ff3",
                                                                    "parent_id": "t1_gfrznu7",
                                                                    "score": 1,
                                                                    "created_utc": 1607918444.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                                            "author": "Classy_Curves",
                                            "id": "gfnqmgr",
                                            "parent_id": "t1_gfm7kk9",
                                            "score": 2,
                                            "created_utc": 1607843627.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I find that very attractive. \n\nTo be clear I was referring to the \"letting your hair down\" and not presenting as a SD. I like humble and approachable.\n\nHumility is very attractive to me. Good approach.",
                    "author": "Classy_Curves",
                    "id": "gfnqedi",
                    "parent_id": "t1_gflqnt2",
                    "score": 3,
                    "created_utc": 1607843529.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, in my comment above I finally listed several reasons I believe it to be a bad idea, ultimately. I hadn’t given it enough thought, before, and then they all just hit me. It could go *really* wrong.",
            "author": "FoxyFreckles1989",
            "id": "gfns1xn",
            "parent_id": "t1_gfnqa8l",
            "score": 2,
            "created_utc": 1607844289.0,
            "replies": []
        },
        {
            "body": "I am not being dramatic. I am being realistic in telling him to be cautious. Yes, lots of male photographers *are* creepy and he seems not to be, takes his business seriously, and remains professional at all times. That is exactly why he should absolutely not message her on the site. I was presenting worse case possibilities. What I think is most likely is she’ll be put off by it, feel awkward and stop having him shoot her. Which he doesn’t want. He’s already said he doesn’t plan on approaching her.",
            "author": "FoxyFreckles1989",
            "id": "gfpug33",
            "parent_id": "t1_gfpmh2e",
            "score": 1,
            "created_utc": 1607880503.0,
            "replies": []
        },
        {
            "body": "Love guys that are attracted to women their own age. <3 \n\nNot sure if that's the \"age-appropriate\" you mean but I like where you're going with that. It's refreshing.",
            "author": "Classy_Curves",
            "id": "gfnxs5m",
            "parent_id": "t1_gfnx6tr",
            "score": 3,
            "created_utc": 1607847068.0,
            "replies": [
                {
                    "body": "Exactly what I meant, Classy",
                    "author": "alias_obvs",
                    "id": "gfnyd75",
                    "parent_id": "t1_gfnxs5m",
                    "score": 3,
                    "created_utc": 1607847347.0,
                    "replies": [
                        {
                            "body": "Cool.",
                            "author": "Classy_Curves",
                            "id": "gfnz2xf",
                            "parent_id": "t1_gfnyd75",
                            "score": 1,
                            "created_utc": 1607847684.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Love guys that are attracted to women their own age. <3\n\n🤯🤯🤯",
                    "author": null,
                    "id": "gfogbca",
                    "parent_id": "t1_gfnxs5m",
                    "score": 0,
                    "created_utc": 1607857151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd be scared away.",
            "author": "Classy_Curves",
            "id": "gfnsqg8",
            "parent_id": "t1_gfns7zu",
            "score": 2,
            "created_utc": 1607844605.0,
            "replies": []
        },
        {
            "body": "Haha no, I wouldn’t do that. \n\nThe conversation in the first session was, as usually happens, focused on the experience of the model and the mechanics of getting useable images. For subsequent sessions, where the aim is to get specific, good, images, there is more of a getting to know one another element usually. This is where it might come up that I primarily work in finance and am divorced with late teenage kids. She already knows I have an unnecessarily cute dog :)\n\nBut as I said, this is something I’d talk about with anyone I’m shooting in order to build a rapport.",
            "author": "alias_obvs",
            "id": "gfo3y06",
            "parent_id": "t1_gfnz0yp",
            "score": 1,
            "created_utc": 1607850333.0,
            "replies": [
                {
                    "body": "Sounds great! \n\nBest wishes!",
                    "author": "Classy_Curves",
                    "id": "gfo5h8b",
                    "parent_id": "t1_gfo3y06",
                    "score": 1,
                    "created_utc": 1607851165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay.",
            "author": "Classy_Curves",
            "id": "gfnz9l0",
            "parent_id": "t1_gfnyltj",
            "score": 1,
            "created_utc": 1607847776.0,
            "replies": []
        },
        {
            "body": "Absolutely. It could ruin the relationship there, and isn’t guaranteed to start another relationship, either. You might just need to file this away in the, “that was cool to see,” category and let it go. But, if you do approach her, be cool and kind and then come tell me how it went! Lol.",
            "author": "FoxyFreckles1989",
            "id": "gflqz0o",
            "parent_id": "t1_gflqnt2",
            "score": 8,
            "created_utc": 1607814740.0,
            "replies": [
                {
                    "body": "I agree with everything in the thread but just wanted to add a thought...could you spin it (after the session so it's not awkward) that you saw her profile and it would be great to have a friend that you can discuss sugar openly with and maybe she'd like to grab a drink sometime. And then maybe things progress more organically or maybe you just have a friend? So it kinda puts the ball in her court to decide if you are someone she wants to try to impress and flirt with or if she isn't interested without the direct pressure on her.",
                    "author": "tamenwild",
                    "id": "gfm12mb",
                    "parent_id": "t1_gflqz0o",
                    "score": 10,
                    "created_utc": 1607817684.0,
                    "replies": [
                        {
                            "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
                            "author": "FoxyFreckles1989",
                            "id": "gfm7kk9",
                            "parent_id": "t1_gfm12mb",
                            "score": 7,
                            "created_utc": 1607819597.0,
                            "replies": [
                                {
                                    "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                                    "author": "pinotandsugar",
                                    "id": "gfnqmce",
                                    "parent_id": "t1_gfm7kk9",
                                    "score": 3,
                                    "created_utc": 1607843625.0,
                                    "replies": [
                                        {
                                            "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                                            "author": "FoxyFreckles1989",
                                            "id": "gfnr79c",
                                            "parent_id": "t1_gfnqmce",
                                            "score": 2,
                                            "created_utc": 1607843898.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                                    "author": "alias_obvs",
                                                    "id": "gfnw9gx",
                                                    "parent_id": "t1_gfnr79c",
                                                    "score": 2,
                                                    "created_utc": 1607846335.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gfo1r1l",
                                                            "parent_id": "t1_gfnw9gx",
                                                            "score": 1,
                                                            "created_utc": 1607849064.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "As usual F^2   is spot on",
                                                    "author": "pinotandsugar",
                                                    "id": "gfrznu7",
                                                    "parent_id": "t1_gfnr79c",
                                                    "score": 2,
                                                    "created_utc": 1607917407.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you. I really just want to help!",
                                                            "author": "FoxyFreckles1989",
                                                            "id": "gfs1ff3",
                                                            "parent_id": "t1_gfrznu7",
                                                            "score": 1,
                                                            "created_utc": 1607918444.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                                    "author": "Classy_Curves",
                                    "id": "gfnqmgr",
                                    "parent_id": "t1_gfm7kk9",
                                    "score": 2,
                                    "created_utc": 1607843627.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I find that very attractive. \n\nTo be clear I was referring to the \"letting your hair down\" and not presenting as a SD. I like humble and approachable.\n\nHumility is very attractive to me. Good approach.",
            "author": "Classy_Curves",
            "id": "gfnqedi",
            "parent_id": "t1_gflqnt2",
            "score": 3,
            "created_utc": 1607843529.0,
            "replies": []
        },
        {
            "body": "Exactly what I meant, Classy",
            "author": "alias_obvs",
            "id": "gfnyd75",
            "parent_id": "t1_gfnxs5m",
            "score": 3,
            "created_utc": 1607847347.0,
            "replies": [
                {
                    "body": "Cool.",
                    "author": "Classy_Curves",
                    "id": "gfnz2xf",
                    "parent_id": "t1_gfnyd75",
                    "score": 1,
                    "created_utc": 1607847684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Love guys that are attracted to women their own age. <3\n\n🤯🤯🤯",
            "author": null,
            "id": "gfogbca",
            "parent_id": "t1_gfnxs5m",
            "score": 0,
            "created_utc": 1607857151.0,
            "replies": []
        },
        {
            "body": "Sounds great! \n\nBest wishes!",
            "author": "Classy_Curves",
            "id": "gfo5h8b",
            "parent_id": "t1_gfo3y06",
            "score": 1,
            "created_utc": 1607851165.0,
            "replies": []
        },
        {
            "body": "I agree with everything in the thread but just wanted to add a thought...could you spin it (after the session so it's not awkward) that you saw her profile and it would be great to have a friend that you can discuss sugar openly with and maybe she'd like to grab a drink sometime. And then maybe things progress more organically or maybe you just have a friend? So it kinda puts the ball in her court to decide if you are someone she wants to try to impress and flirt with or if she isn't interested without the direct pressure on her.",
            "author": "tamenwild",
            "id": "gfm12mb",
            "parent_id": "t1_gflqz0o",
            "score": 10,
            "created_utc": 1607817684.0,
            "replies": [
                {
                    "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
                    "author": "FoxyFreckles1989",
                    "id": "gfm7kk9",
                    "parent_id": "t1_gfm12mb",
                    "score": 7,
                    "created_utc": 1607819597.0,
                    "replies": [
                        {
                            "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                            "author": "pinotandsugar",
                            "id": "gfnqmce",
                            "parent_id": "t1_gfm7kk9",
                            "score": 3,
                            "created_utc": 1607843625.0,
                            "replies": [
                                {
                                    "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                                    "author": "FoxyFreckles1989",
                                    "id": "gfnr79c",
                                    "parent_id": "t1_gfnqmce",
                                    "score": 2,
                                    "created_utc": 1607843898.0,
                                    "replies": [
                                        {
                                            "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                            "author": "alias_obvs",
                                            "id": "gfnw9gx",
                                            "parent_id": "t1_gfnr79c",
                                            "score": 2,
                                            "created_utc": 1607846335.0,
                                            "replies": [
                                                {
                                                    "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gfo1r1l",
                                                    "parent_id": "t1_gfnw9gx",
                                                    "score": 1,
                                                    "created_utc": 1607849064.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "As usual F^2   is spot on",
                                            "author": "pinotandsugar",
                                            "id": "gfrznu7",
                                            "parent_id": "t1_gfnr79c",
                                            "score": 2,
                                            "created_utc": 1607917407.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you. I really just want to help!",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gfs1ff3",
                                                    "parent_id": "t1_gfrznu7",
                                                    "score": 1,
                                                    "created_utc": 1607918444.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                            "author": "Classy_Curves",
                            "id": "gfnqmgr",
                            "parent_id": "t1_gfm7kk9",
                            "score": 2,
                            "created_utc": 1607843627.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cool.",
            "author": "Classy_Curves",
            "id": "gfnz2xf",
            "parent_id": "t1_gfnyd75",
            "score": 1,
            "created_utc": 1607847684.0,
            "replies": []
        },
        {
            "body": "This is an idea on the right track, for sure. However, bringing up sugar and presenting it as something he’d like to bond over rather than something he’s interested in *her* for could backfire as well, in my opinion. Tricky situations are tricky! Lol!",
            "author": "FoxyFreckles1989",
            "id": "gfm7kk9",
            "parent_id": "t1_gfm12mb",
            "score": 7,
            "created_utc": 1607819597.0,
            "replies": [
                {
                    "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
                    "author": "pinotandsugar",
                    "id": "gfnqmce",
                    "parent_id": "t1_gfm7kk9",
                    "score": 3,
                    "created_utc": 1607843625.0,
                    "replies": [
                        {
                            "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                            "author": "FoxyFreckles1989",
                            "id": "gfnr79c",
                            "parent_id": "t1_gfnqmce",
                            "score": 2,
                            "created_utc": 1607843898.0,
                            "replies": [
                                {
                                    "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                                    "author": "alias_obvs",
                                    "id": "gfnw9gx",
                                    "parent_id": "t1_gfnr79c",
                                    "score": 2,
                                    "created_utc": 1607846335.0,
                                    "replies": [
                                        {
                                            "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gfo1r1l",
                                            "parent_id": "t1_gfnw9gx",
                                            "score": 1,
                                            "created_utc": 1607849064.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "As usual F^2   is spot on",
                                    "author": "pinotandsugar",
                                    "id": "gfrznu7",
                                    "parent_id": "t1_gfnr79c",
                                    "score": 2,
                                    "created_utc": 1607917407.0,
                                    "replies": [
                                        {
                                            "body": "Thank you. I really just want to help!",
                                            "author": "FoxyFreckles1989",
                                            "id": "gfs1ff3",
                                            "parent_id": "t1_gfrznu7",
                                            "score": 1,
                                            "created_utc": 1607918444.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
                    "author": "Classy_Curves",
                    "id": "gfnqmgr",
                    "parent_id": "t1_gfm7kk9",
                    "score": 2,
                    "created_utc": 1607843627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Tricky situations are tricky!\n\nAs usual  wonderful FoxyF  is spot on...........\n\nI would only add that any approach should come with the initiating disclaimer that you value her as a client ......  If she is an \"artsy\" type this might work out well.   But it does come with some danger.",
            "author": "pinotandsugar",
            "id": "gfnqmce",
            "parent_id": "t1_gfm7kk9",
            "score": 3,
            "created_utc": 1607843625.0,
            "replies": [
                {
                    "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
                    "author": "FoxyFreckles1989",
                    "id": "gfnr79c",
                    "parent_id": "t1_gfnqmce",
                    "score": 2,
                    "created_utc": 1607843898.0,
                    "replies": [
                        {
                            "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                            "author": "alias_obvs",
                            "id": "gfnw9gx",
                            "parent_id": "t1_gfnr79c",
                            "score": 2,
                            "created_utc": 1607846335.0,
                            "replies": [
                                {
                                    "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gfo1r1l",
                                    "parent_id": "t1_gfnw9gx",
                                    "score": 1,
                                    "created_utc": 1607849064.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "As usual F^2   is spot on",
                            "author": "pinotandsugar",
                            "id": "gfrznu7",
                            "parent_id": "t1_gfnr79c",
                            "score": 2,
                            "created_utc": 1607917407.0,
                            "replies": [
                                {
                                    "body": "Thank you. I really just want to help!",
                                    "author": "FoxyFreckles1989",
                                    "id": "gfs1ff3",
                                    "parent_id": "t1_gfrznu7",
                                    "score": 1,
                                    "created_utc": 1607918444.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree it's risky and I wouldn't do it. \n\nI'd keep the two 100% separate.",
            "author": "Classy_Curves",
            "id": "gfnqmgr",
            "parent_id": "t1_gfm7kk9",
            "score": 2,
            "created_utc": 1607843627.0,
            "replies": []
        },
        {
            "body": "Honestly, no matter how genuine this guy is (and he does seem so), if he started off a convo like this with me by assuring me he values me as a client, I’d very possibly feel like it was b.s. and wonder why he brought this up if he valued me in that way. I might also assume he wants things from me I don’t want to give, worry about him outing me if I didn’t give them and more. He hasn’t said *anything* here to make me think he’s a bad person and I can’t guarantee that’s how she’d feel, but it’s 100% a risk. It sounds like that’s not a risk worth taking, since he does enjoy shooting her and takes his work seriously. Imagine her not being okay with this conversation and then telling her other young, attractive friends in the area what happened from her perspective. That could ruin his chances in the local bowl *and* his reputation as a photog that young women feel comfortable around, as well as blow any discretion he’s currently got. OP, I’d consider *all* of what I just said because I hadn’t thought of any of it, earlier! /u/alias_obvs",
            "author": "FoxyFreckles1989",
            "id": "gfnr79c",
            "parent_id": "t1_gfnqmce",
            "score": 2,
            "created_utc": 1607843898.0,
            "replies": [
                {
                    "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
                    "author": "alias_obvs",
                    "id": "gfnw9gx",
                    "parent_id": "t1_gfnr79c",
                    "score": 2,
                    "created_utc": 1607846335.0,
                    "replies": [
                        {
                            "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                            "author": "FoxyFreckles1989",
                            "id": "gfo1r1l",
                            "parent_id": "t1_gfnw9gx",
                            "score": 1,
                            "created_utc": 1607849064.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As usual F^2   is spot on",
                    "author": "pinotandsugar",
                    "id": "gfrznu7",
                    "parent_id": "t1_gfnr79c",
                    "score": 2,
                    "created_utc": 1607917407.0,
                    "replies": [
                        {
                            "body": "Thank you. I really just want to help!",
                            "author": "FoxyFreckles1989",
                            "id": "gfs1ff3",
                            "parent_id": "t1_gfrznu7",
                            "score": 1,
                            "created_utc": 1607918444.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah Foxy, when I wrote the post I’d no intention of bringing it up with her. I just thought it was a coincidence and situation I wanted to tell someone about. \n\nI’ve always been very careful not to flirt with models on set (I came up in a time when this was extremely common and a lot of the photographers I assisted behaved n ways that was really not okay). Off set was another matter of course, bars, parties and such.",
            "author": "alias_obvs",
            "id": "gfnw9gx",
            "parent_id": "t1_gfnr79c",
            "score": 2,
            "created_utc": 1607846335.0,
            "replies": [
                {
                    "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
                    "author": "FoxyFreckles1989",
                    "id": "gfo1r1l",
                    "parent_id": "t1_gfnw9gx",
                    "score": 1,
                    "created_utc": 1607849064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As usual F^2   is spot on",
            "author": "pinotandsugar",
            "id": "gfrznu7",
            "parent_id": "t1_gfnr79c",
            "score": 2,
            "created_utc": 1607917407.0,
            "replies": [
                {
                    "body": "Thank you. I really just want to help!",
                    "author": "FoxyFreckles1989",
                    "id": "gfs1ff3",
                    "parent_id": "t1_gfrznu7",
                    "score": 1,
                    "created_utc": 1607918444.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh, good! Well, I’m glad you’re making the choice to let it go. I’m sorry if I managed to turn this into something it wasn’t! You sound like a great photog to work with.",
            "author": "FoxyFreckles1989",
            "id": "gfo1r1l",
            "parent_id": "t1_gfnw9gx",
            "score": 1,
            "created_utc": 1607849064.0,
            "replies": []
        },
        {
            "body": "Thank you. I really just want to help!",
            "author": "FoxyFreckles1989",
            "id": "gfs1ff3",
            "parent_id": "t1_gfrznu7",
            "score": 1,
            "created_utc": 1607918444.0,
            "replies": []
        }
    ]
}