{
    "title": "Having Value",
    "post_id": "eazkn4",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eazkn4/having_value/",
    "author": null,
    "body": "On this sub we routinely talk about having value. Maybe not so amount focused now that discussions of money are off the table, but in reality we still do. Almost every single discussion we have on this forum is about value. \n\nAs an SB (or an SD) joining this lifestyle we are always urged to think about what we can get from the relationship. How much allowance do you want? How many times a week do we want to meet? What type of woman are we looking for? What type of man? What value do we get from the relationship?\n\nHow about we flip that thinking for a moment? \n\nUpon joining this lifestyle I asked myself what *I had to offer*. What *value* would I bring to a relationship with a man?\n\nEveryone has some value. But it’s up to them to realize what that is. Personally? I’m an older girl, who struggles with staying thin. I’m a mom. I’m routinely working too much and tired all the time. I’m not your normal sugar baby. \n\nSo what value do I add? \n\nWell, I’m passionate. Curious. Loving. I thrive off physical touch, cuddling and bonding experiences. I love to read and write. I also love to talk. Seriously, I’m a talker. I enjoy connections that transcend one night stands. I enjoy the closeness that comes from laying nose to nose with someone while they talk about their day. I like naps. I’m moderately attractive with nice legs and I can bake any cake, cookie, or pie better than most grandmas. Oh, and I love sex. \n\nSo there you have it. *My value.* \n\nBut what does that have to do with anything? \n\nThis lifestyle is hard. It’s hard for men and women alike. We walk into this lifestyle telling ourselves that **X** is what we want, but we don’t stop to ask ourselves *what we offer* and, just as importantly, *to whom*?\n\nBecause, after determining what value I brought to a relationship, I asked myself, who would want it?\n\nDoes an early twenties finance guy, one who parties all night with leggy blondes, want me? \n\nDoes a financially established world traveler want a mom that is tethered to her home town 6 nights a week?\n\nDoes a man looking to hook up on the regular, one with two hours to spare over lunch, want me?\n\nAnd the answer is: *No, of course not.*\n\nJust as important as knowing your value is knowing who you mesh with. Know who is looking for you, too. You cannot fit a round peg into a square hole and you’ll exhaust yourself trying. \n\nWhat does this have to do with anything?\n\nSometimes I look at this lifestyle and wonder where everything went so wrong. We routinely lament on how diluted the pool has become, but then we turn around and jump right back into the water without some introspection. We need some focus. Stop throwing spaghetti at the wall to see what sticks. \n\nI’ve had some really great relationships in this lifestyle. I am sometimes asked how I’ve had such success when others have so much trouble. And the answer is, I know my value. \n\nI build lasting relationships by thinking about what I can give and not what I want. Every man I speak with, or meet, I think about what I have to offer. Does it mesh with them? I don’t try to become something I’m not. I take all my insecurity and work-a-holicness, and love for naps, and I lay it on the table in front of them. I look for, and connect with, men that are looking for what I *give*, and I end up with men offering the same in return. Funny how that works. \n\nI encourage everyone to contemplate their value today. What do **you** offer? And, in this diluted pool, to **whom**? \n\nBuild lasting connections.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eazkn4/having_value/",
    "score": 172,
    "upvote_ratio": 0.95,
    "created_utc": 1576420315.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Great post!\n\nThis gives me a lot of things to think about.",
            "author": "Midwest-SD",
            "id": "fazyv64",
            "parent_id": "t3_eazkn4",
            "score": 25,
            "created_utc": 1576420844.0,
            "replies": [
                {
                    "body": "I'll second that - awesome analysis that begins with an assessment of what you have to offer, who will be interested (and meet your desires)  and what you  are looking for and what you want to avoid or find intolerant. \n\nIt also should be the foundation of your \"marketing\" screening and decision making. \n\nUnless you prefer such things as frustration, anger, disappointment etc  there's little sense in entering a sugar relationship with \"irreconcilable differences\" that will overcome the financial and sensual aspects.",
                    "author": "pinotandsugar",
                    "id": "fb22swi",
                    "parent_id": "t1_fazyv64",
                    "score": 8,
                    "created_utc": 1576444649.0,
                    "replies": []
                },
                {
                    "body": "This is NOT a good post, I would say, for the majority of people here. \n\nI think it’s far more common for SBs to UNDERESTIMATE their value than overestimate it. This is especially true for younger ones. \n\nIf you’re 21 from a middle class backgroubd, it’s probably hard to fathom just how much money people have. \n\nYou think of $400 as a week of working at StarBucks as opposed to a few hours of collecting dividends off of a low risk stock portfolio. \n\nYou think “there’s no way I’m worth $900!”, not realizing just how little money that really is to some of these guys.",
                    "author": "ifisch",
                    "id": "fb1nilx",
                    "parent_id": "t1_fazyv64",
                    "score": 10,
                    "created_utc": 1576438827.0,
                    "replies": [
                        {
                            "body": "It sounds like you really, *really* missed the point of this post...",
                            "author": "sheepskin_rug",
                            "id": "fb2116v",
                            "parent_id": "t1_fb1nilx",
                            "score": 18,
                            "created_utc": 1576443969.0,
                            "replies": [
                                {
                                    "body": "It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n\nHowever, the problem I see on this forum, time and time again, is SB's not realizing the *inherent* value of simply *being* a young attractive girl. They especially don't seem to realize how much SD's are willing to pay for that.\n\nI've seen SB's here worrying about not being competitive in the SB market due to their lack of world experience and lack of sexual experience.\n\nCan you bake? Can you play the piano? Cool. Good for you. Maybe that will have a bit of influence on the margins, but a *lack* of any particular skills really isn't going to move the needle when it comes to most SD's.",
                                    "author": "ifisch",
                                    "id": "fb27tb3",
                                    "parent_id": "t1_fb2116v",
                                    "score": 12,
                                    "created_utc": 1576446626.0,
                                    "replies": [
                                        {
                                            "body": "> It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n> \n> However, the problem I see on this forum, time and time again, is SB's not realizing the inherent value of simply being a young attractive girl.\n\nThat is the point of the post. OP isn't those things, so her individual examples aren't going to be her offering those things.",
                                            "author": "Sugarbeggar",
                                            "id": "fb3qfuw",
                                            "parent_id": "t1_fb27tb3",
                                            "score": 4,
                                            "created_utc": 1576483683.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It depends on the market you're in.  In our city in particular (ATL) there are thousands of college girls looking.  The \"inherent value of simply being a young attractive girl\" is much lower here because beauty and intelligence seem to be common on the various sites.  If someone is truly exceptional in either category, that's different.",
                                            "author": "nerojt",
                                            "id": "fb4p3pp",
                                            "parent_id": "t1_fb27tb3",
                                            "score": 4,
                                            "created_utc": 1576513019.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb08yr8",
            "parent_id": "t3_eazkn4",
            "score": 18,
            "created_utc": 1576423777.0,
            "replies": [
                {
                    "body": "\"I used to try to be someone I wasn't to appeal to the sort of man I thought I wanted to connect with.\"\n\nIdeally you find someone who resonates with the real you and your gifts .",
                    "author": "pinotandsugar",
                    "id": "fb23kyi",
                    "parent_id": "t1_fb08yr8",
                    "score": 8,
                    "created_utc": 1576444958.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fb2idb1",
                            "parent_id": "t1_fb23kyi",
                            "score": 4,
                            "created_utc": 1576451596.0,
                            "replies": [
                                {
                                    "body": "My guess is that there are more SD's looking for attractive brain candy than vacuous Arm Candy.. which SA likes to feature.",
                                    "author": "pinotandsugar",
                                    "id": "fb2tn6m",
                                    "parent_id": "t1_fb2idb1",
                                    "score": 5,
                                    "created_utc": 1576457476.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fb61y65",
                                            "parent_id": "t1_fb2tn6m",
                                            "score": 1,
                                            "created_utc": 1576539366.0,
                                            "replies": [
                                                {
                                                    "body": "When I lived in the LA area there are so many greaseballs with their (what we now call SB)  showing them off and showing that the women would put up with being pawed in public.",
                                                    "author": "pinotandsugar",
                                                    "id": "fb62eyv",
                                                    "parent_id": "t1_fb61y65",
                                                    "score": 2,
                                                    "created_utc": 1576539691.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "i’m fairly new to the SA. I’m in my mid 30s, male, and based in NYC. I joined in mid November, went on a handful of dates and have been very fortunate in finding an amazing connection within a few weeks of joining. I think being yourself works best ( i’m pretty free spirited and goofy myself :-) ) Another thing that I have found is that I “mesh” better with ladies from working class families more than ladies that grew up in wealthy ones. So it’s always tough for me to vibe with ladies from Greenwich and Westchester (generalization.. i know) . I grew up in a blue collar family, went to university in NYC, and have been very very fortunate in my career. I try to be humble and genuine and enjoy a much more meaningful connection when meeting someone for the first time and they approach it the same way. :-) Ultimately for me, I value chemistry and connection just as much, perhaps maybe more than looks. good luck everyone!",
                    "author": "MGsuitor",
                    "id": "fc0aj9k",
                    "parent_id": "t1_fb08yr8",
                    "score": 3,
                    "created_utc": 1577285024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb0czls",
            "parent_id": "t3_eazkn4",
            "score": 12,
            "created_utc": 1576424900.0,
            "replies": [
                {
                    "body": "We make time for what matters. My lover supports me in my work-a-holic lifestyle, while providing me with the means to take a night off to be with him and a weekend off with my children. I’ve got the best of both worlds, really. He supports me in every endeavor. And we make the time, though not nearly as much as we’d like.",
                    "author": null,
                    "id": "fb0e5u9",
                    "parent_id": "t1_fb0czls",
                    "score": 19,
                    "created_utc": 1576425205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very good post.\n\n>knowing who you mesh with\n\nSo critical in ANY type of relationship, and sugar is no exception.",
            "author": "Cledaddy23",
            "id": "fb0fux0",
            "parent_id": "t3_eazkn4",
            "score": 7,
            "created_utc": 1576425634.0,
            "replies": []
        },
        {
            "body": "I agree with you 100 percent. The reason that some people *seem* to have all the luck is that all of us are changing all the time. Hopefully we are evolving, but most certainly some of us are devolving and others are just disintegrating. \n\nFirst of all, to offer anything of value to others, we do need to know who we are. We need to accept what We value in others and in ourselves, and what we are worth not initially in dollars and cents, but in rarity and esteem. \n\nOne of the biggest fallacies in the SB SD relationships and interactions is that people need to talk about money and sex from beginning to end. That is a sign of a. boring conversation and probably boring partner, and b. lack of any interest in anything but exchanging one simple commodity for another. \n\nTo me there an art in this kind of life just like there is an art in any other. \nTo me a sugarbaby is also and primarily a nurturer, a destresser, an erotic firestarter, a friend, a playmate, and someone who can listen and be trusted to keep her SD's frustrations to herself. Sugarbabies are courtesans, nurses, well kept solicitious ladies, epically creative sluts, and many other things. But what a good sugar baby is NOT ....is greedy, needy, shallow and disrespectful to herself or anyone else. \nA good sugardaddy offers more than money too. He offers the security of a hand to steady your ride, the mind of someone who can give you good advice if you dont burden him, a leader who can be inspiring in your own private world. \n\nThe best relationships are always going to be more than transactional. That is why I think its very good point the OP has about assessing our value. Because value isnt stacks of bills. Value is something that we can make ourselves. A poor woman with a strong sense of self who is not afraid to be honest and funny and loving and and cares for her appearance and the happiness of those around her is going to go farther than someone who thinks that walking into a room with the attitude of a brat will get her ahead in the long run. \nCourtesy, lack of desperation, and an ability to be and accept honesty as well as hopefully some well placed smiles and the ephemeral thing called chemistry is what makes the other things come to us. By putting sense before dollars, one can make a lot more sense out of their lives and more cash than if one acts like this is the same thing as an hourly transaction. It is not. The archetype of a sugarbaby is actually the archetype of a consort, of a courtesan, of a non married non taken free woman with the education and humor to divert amuse and entertain men.",
            "author": "TW1ST3DM1ND1",
            "id": "fb2lgeu",
            "parent_id": "t3_eazkn4",
            "score": 5,
            "created_utc": 1576453202.0,
            "replies": []
        },
        {
            "body": "Interesting post and well written as usual. I have a slightly different approach. I consider myself pretty successful in the bowl too with my current connection being the best so far. Success or failure really depends on each person’s perception of success.\n\nI agree with the sentiments of knowing what you have to offer is an important step. However I feel that entering the bowl with no real expectation might help avoid disappointment for most.\n\nI always have/had an open mind during my search in the past. I really didn’t have a “type” that I was looking for. As a result I have been with various wonderful women over the years with completely different personalities, traits. I have dated girls of various socio economic status, educational background etc. I have learnt something unique and valuable from every one of them and I have felt like I have been able to offer something of value to every person that I have been with.",
            "author": "supportiveceo",
            "id": "fb0tr0k",
            "parent_id": "t3_eazkn4",
            "score": 3,
            "created_utc": 1576429186.0,
            "replies": []
        },
        {
            "body": "Interesting thoughts.  I was recently thinking of something somewhat adjacent, although specific to my favorite person (me).  I feel like I can provide a long list of what I bring to an SR besides allowance.  And different SBs, in different situations, certainly seem to appreciate different aspects.  But I seem to have a sweet spot -- a particular set of attributes that some types of SBs eventually value as much or more than allowance, and when I get this match, it has consistently resulted in my long-term, best arrangements.  I realize this mostly because these types of SBs echo back to me what they like about me, so I've been bringing that a bit more front and center",
            "author": "Azurecole",
            "id": "fb11mhc",
            "parent_id": "t3_eazkn4",
            "score": 3,
            "created_utc": 1576431487.0,
            "replies": [
                {
                    "body": "I am ridiculously interested in hearing what this particular set of attributes is.",
                    "author": null,
                    "id": "fb2n90f",
                    "parent_id": "t1_fb11mhc",
                    "score": 3,
                    "created_utc": 1576454129.0,
                    "replies": [
                        {
                            "body": "I am a dark enigma, Ab!  I feel this adds to my intriguing air of mystery.  *Double finger guns and wink and clicky sound*",
                            "author": "Azurecole",
                            "id": "fb5c1i2",
                            "parent_id": "t1_fb2n90f",
                            "score": 2,
                            "created_utc": 1576524853.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wonderfully thoughtful post. I have done this exercise somewhat subconsciously.  I know what I bring to the table and what I am seeking.  I also know what I am not (young, thin, full head of hair). I believe my pluses way outweigh my minuses. This is why I have had great SR's and have no trouble finding my next. It really stems from knowing what you want, knowing what you have to offer, and knowing your market. With this knowledge, you should have a great experience in \"The Bowl\".\nPS. I love sex too and I am fucking good at it!!",
            "author": "Teejaynj",
            "id": "fb2shv1",
            "parent_id": "t3_eazkn4",
            "score": 3,
            "created_utc": 1576456879.0,
            "replies": []
        },
        {
            "body": "I mentioned it in another thread, but I always thought the following would be great:\n\n-helping replace a wardrobe\n-help learn a new language (lots of Spanish and foreign SB’s these days)\n-help an SD get back into shape (and Im not talking copious sex)\n-introducing new life experiences in general\n-soft skills\n-being able to just sit and listen\n\nI think part of the problem lies when an SB only views her “time” and “body” as valuable, then watches as arrangements end after a few months.",
            "author": "VladTheFootballStar",
            "id": "fb0loa3",
            "parent_id": "t3_eazkn4",
            "score": 5,
            "created_utc": 1576427169.0,
            "replies": [
                {
                    "body": "Yep, we go to the gym together.",
                    "author": "Sweettooth_dragon",
                    "id": "fb52vyo",
                    "parent_id": "t1_fb0loa3",
                    "score": 1,
                    "created_utc": 1576519950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is such a great post. I think it would be good for SDs to also think about this. What can they bring to their SBs in addition to $$. Introspection is such a powerful mental / emotional tool.",
            "author": "SouthernGentSD",
            "id": "fb0klw8",
            "parent_id": "t3_eazkn4",
            "score": 3,
            "created_utc": 1576426898.0,
            "replies": [
                {
                    "body": "Great point. Helping her not just have the money but invest it in her future self. Making sure she understands next step things like taxes, mortgages, and stocks.",
                    "author": "Sweettooth_dragon",
                    "id": "fb52to3",
                    "parent_id": "t1_fb0klw8",
                    "score": 1,
                    "created_utc": 1576519917.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did someone body snatch all the SLFers? Thoughtful. Empathy. Intelligent. This almost sounds like a person I actually want to meet!\n\nGreat post!",
            "author": null,
            "id": "fb0ajif",
            "parent_id": "t3_eazkn4",
            "score": 5,
            "created_utc": 1576424250.0,
            "replies": []
        },
        {
            "body": "This is a good post. Both sides need to consider and describe the value that they are offering. In the past a good percentage of people knew this. These days 99/100 profiles on SA are short lists of what they want. Money for this and money for that and spoil me like I deserve. If I ask about what they are offering I get blocked over and over.",
            "author": "Michael952",
            "id": "fb15put",
            "parent_id": "t3_eazkn4",
            "score": 2,
            "created_utc": 1576432672.0,
            "replies": []
        },
        {
            "body": "That lucky bastard!!! ❤️❤️❤️",
            "author": null,
            "id": "fb1ctmn",
            "parent_id": "t3_eazkn4",
            "score": 2,
            "created_utc": 1576435058.0,
            "replies": []
        },
        {
            "body": "A wonderful post!  I completely agree.   More people (SDs and SBs) should look at what they can bring to a relationship, not just at what they can receive.  \n\nI consider myself very lucky that my SBF and I value our time time together and we both put so much effort into making our relationship work.     Our circumstances may not work for others, but for us it’s going beautifully.  \n\nWhen both parties genuinely enjoy each other, then putting in the effort is effortless.",
            "author": "ksmith33672",
            "id": "fb1tphb",
            "parent_id": "t3_eazkn4",
            "score": 2,
            "created_utc": 1576441034.0,
            "replies": []
        },
        {
            "body": "Well said!! I totally agree. I went on m&g’s off and on for two years before realizing this and when I realized what I brought to the table and what I didn’t, everything fell into place. Knowing my assets caused me to know what kind of SD I could be beneficial for and in turn boosted my confidence. I met my current SD not long after this epiphany.",
            "author": "soullessfreckles",
            "id": "fb2fxfx",
            "parent_id": "t3_eazkn4",
            "score": 2,
            "created_utc": 1576450325.0,
            "replies": [
                {
                    "body": "Deserves 100 points.\n\nSomewhat parallel from a distant topic....  Selling homes.  The wise broker looks for a match between the home that is to be sold and the potential customers to whom that home might appeal.  \n\nThey would also talk with the seller about small changes that would affect the appeal of the home.  Or the staging of the home. \n\nIt's not about an SB or SD trying to appear to be something they are not but rather identifying the good and then pursuing the likely person who would value that.",
                    "author": "pinotandsugar",
                    "id": "fb2t74n",
                    "parent_id": "t1_fb2fxfx",
                    "score": 1,
                    "created_utc": 1576457240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post.  I probably take this to the extreme, but I believe EVERY relationship has some form of value exchange. If you aren't getting anything from a relationship, then you move on.  This is true for friendships, marriages, business partnerships.  And the inverse is true, if the other person isn't getting anything from the relationship, they will leave.    \nGreat relationships, sugar or otherwise, are only possible when we are open and honest with the other person about what we want and need and they are equally honest about their wants and needs.\n\nMy SGF is alway looking for ways to do more for me, in effect be more valuable to me. And I look for ways to be more valuable for her.",
            "author": "Wandering_SD",
            "id": "fb33gl5",
            "parent_id": "t3_eazkn4",
            "score": 2,
            "created_utc": 1576463393.0,
            "replies": []
        },
        {
            "body": "This is a great point!  \n\nFigure out what value you have to offer, what value you are looking for in return and customize your search around what you offer and what you want.  The goal is find your best match, not the most matches!",
            "author": "willfromvb",
            "id": "fb07iio",
            "parent_id": "t3_eazkn4",
            "score": 2,
            "created_utc": 1576423342.0,
            "replies": []
        },
        {
            "body": "Thanks for a great post! Much to on here ...",
            "author": null,
            "id": "fb0scil",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576428826.0,
            "replies": []
        },
        {
            "body": "I love the way you think!",
            "author": "thesobber",
            "id": "fb1j1vo",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576437507.0,
            "replies": []
        },
        {
            "body": "I love your post. Finding a person that matches what you like and need is the ultimate arrangement, and it is absolutely double heaven if you are exactly what they are looking for. What you have is rare. The value someone brings to a relationship is important. More important is that what you bring is what they need at that moment in time. For two people that love sex to find each other, and also fill the mental and emotional needs is extraordinary. I am very happy for you.",
            "author": "SDforreal",
            "id": "fb1mrtk",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576438562.0,
            "replies": []
        },
        {
            "body": "This is great advice for vanilla too.",
            "author": "HwdSD",
            "id": "fb1ylzx",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576443036.0,
            "replies": []
        },
        {
            "body": "You bring wisdom of living and truth. Sound perfect!",
            "author": "bigmarc1962",
            "id": "fb25j03",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576445722.0,
            "replies": []
        },
        {
            "body": "Other than intimacy, I'd say respect and friendship are important :)",
            "author": "BratinaHat",
            "id": "fb2dc2b",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576448987.0,
            "replies": []
        },
        {
            "body": "The sugar relationship is the ultimate capitalist era social form. It will replace relationships based on olde time delusions such family and god. At its heart will be the male economic elite and the creme de la creme of femalehood. From that core it will ebb out to the margins and overlap with sex working at those margins. With this variety. Value will depend on the lovers.",
            "author": null,
            "id": "fb2sy7d",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576457107.0,
            "replies": [
                {
                    "body": "My sympathies to the writer",
                    "author": "pinotandsugar",
                    "id": "fb2u0jp",
                    "parent_id": "t1_fb2sy7d",
                    "score": 2,
                    "created_utc": 1576457672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am the same! I'm trying to think about what I bring to the table, too. I've been confident I'm a good fit for the right person but maybe I could work on communicating better in order to find that fit 🤔",
            "author": "sometimesviolet",
            "id": "fb3cbn9",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576469340.0,
            "replies": []
        },
        {
            "body": "Absolutely agree.\n\nWe could all do with a little more looking in the reality mirror, tough as it may be",
            "author": "Gemini-Fox",
            "id": "fb522my",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576519519.0,
            "replies": []
        },
        {
            "body": "Yes momma! My self value is not something I found until this year and I am a 34 year old mother. It was a GAME CHANGER on so many facets of life. Keep rockin lady!",
            "author": "CaptainRubyValentine",
            "id": "fcaedbb",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1577567799.0,
            "replies": []
        },
        {
            "body": "This resonated with me. Thanks for sharing!!",
            "author": null,
            "id": "fda598c",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1578241849.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb025lk",
            "parent_id": "t3_eazkn4",
            "score": 1,
            "created_utc": 1576421896.0,
            "replies": [
                {
                    "body": "I guess it didn't work out.",
                    "author": "Seven_league_boots",
                    "id": "fb0cm5i",
                    "parent_id": "t1_fb025lk",
                    "score": 2,
                    "created_utc": 1576424783.0,
                    "replies": [
                        {
                            "body": "Lol. We’re still happily together. SA still happily deleted. Just some mental stimulation for SLF on Sunday.",
                            "author": null,
                            "id": "fb0cvm4",
                            "parent_id": "t1_fb0cm5i",
                            "score": 8,
                            "created_utc": 1576424858.0,
                            "replies": [
                                {
                                    "body": "Good.",
                                    "author": "Seven_league_boots",
                                    "id": "fb1b2cr",
                                    "parent_id": "t1_fb0cvm4",
                                    "score": 1,
                                    "created_utc": 1576434341.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can I have a TL;DR",
            "author": null,
            "id": "fb0z5gf",
            "parent_id": "t3_eazkn4",
            "score": -6,
            "created_utc": 1576430701.0,
            "replies": []
        },
        {
            "body": "I'll second that - awesome analysis that begins with an assessment of what you have to offer, who will be interested (and meet your desires)  and what you  are looking for and what you want to avoid or find intolerant. \n\nIt also should be the foundation of your \"marketing\" screening and decision making. \n\nUnless you prefer such things as frustration, anger, disappointment etc  there's little sense in entering a sugar relationship with \"irreconcilable differences\" that will overcome the financial and sensual aspects.",
            "author": "pinotandsugar",
            "id": "fb22swi",
            "parent_id": "t1_fazyv64",
            "score": 8,
            "created_utc": 1576444649.0,
            "replies": []
        },
        {
            "body": "This is NOT a good post, I would say, for the majority of people here. \n\nI think it’s far more common for SBs to UNDERESTIMATE their value than overestimate it. This is especially true for younger ones. \n\nIf you’re 21 from a middle class backgroubd, it’s probably hard to fathom just how much money people have. \n\nYou think of $400 as a week of working at StarBucks as opposed to a few hours of collecting dividends off of a low risk stock portfolio. \n\nYou think “there’s no way I’m worth $900!”, not realizing just how little money that really is to some of these guys.",
            "author": "ifisch",
            "id": "fb1nilx",
            "parent_id": "t1_fazyv64",
            "score": 10,
            "created_utc": 1576438827.0,
            "replies": [
                {
                    "body": "It sounds like you really, *really* missed the point of this post...",
                    "author": "sheepskin_rug",
                    "id": "fb2116v",
                    "parent_id": "t1_fb1nilx",
                    "score": 18,
                    "created_utc": 1576443969.0,
                    "replies": [
                        {
                            "body": "It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n\nHowever, the problem I see on this forum, time and time again, is SB's not realizing the *inherent* value of simply *being* a young attractive girl. They especially don't seem to realize how much SD's are willing to pay for that.\n\nI've seen SB's here worrying about not being competitive in the SB market due to their lack of world experience and lack of sexual experience.\n\nCan you bake? Can you play the piano? Cool. Good for you. Maybe that will have a bit of influence on the margins, but a *lack* of any particular skills really isn't going to move the needle when it comes to most SD's.",
                            "author": "ifisch",
                            "id": "fb27tb3",
                            "parent_id": "t1_fb2116v",
                            "score": 12,
                            "created_utc": 1576446626.0,
                            "replies": [
                                {
                                    "body": "> It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n> \n> However, the problem I see on this forum, time and time again, is SB's not realizing the inherent value of simply being a young attractive girl.\n\nThat is the point of the post. OP isn't those things, so her individual examples aren't going to be her offering those things.",
                                    "author": "Sugarbeggar",
                                    "id": "fb3qfuw",
                                    "parent_id": "t1_fb27tb3",
                                    "score": 4,
                                    "created_utc": 1576483683.0,
                                    "replies": []
                                },
                                {
                                    "body": "It depends on the market you're in.  In our city in particular (ATL) there are thousands of college girls looking.  The \"inherent value of simply being a young attractive girl\" is much lower here because beauty and intelligence seem to be common on the various sites.  If someone is truly exceptional in either category, that's different.",
                                    "author": "nerojt",
                                    "id": "fb4p3pp",
                                    "parent_id": "t1_fb27tb3",
                                    "score": 4,
                                    "created_utc": 1576513019.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"I used to try to be someone I wasn't to appeal to the sort of man I thought I wanted to connect with.\"\n\nIdeally you find someone who resonates with the real you and your gifts .",
            "author": "pinotandsugar",
            "id": "fb23kyi",
            "parent_id": "t1_fb08yr8",
            "score": 8,
            "created_utc": 1576444958.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fb2idb1",
                    "parent_id": "t1_fb23kyi",
                    "score": 4,
                    "created_utc": 1576451596.0,
                    "replies": [
                        {
                            "body": "My guess is that there are more SD's looking for attractive brain candy than vacuous Arm Candy.. which SA likes to feature.",
                            "author": "pinotandsugar",
                            "id": "fb2tn6m",
                            "parent_id": "t1_fb2idb1",
                            "score": 5,
                            "created_utc": 1576457476.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fb61y65",
                                    "parent_id": "t1_fb2tn6m",
                                    "score": 1,
                                    "created_utc": 1576539366.0,
                                    "replies": [
                                        {
                                            "body": "When I lived in the LA area there are so many greaseballs with their (what we now call SB)  showing them off and showing that the women would put up with being pawed in public.",
                                            "author": "pinotandsugar",
                                            "id": "fb62eyv",
                                            "parent_id": "t1_fb61y65",
                                            "score": 2,
                                            "created_utc": 1576539691.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i’m fairly new to the SA. I’m in my mid 30s, male, and based in NYC. I joined in mid November, went on a handful of dates and have been very fortunate in finding an amazing connection within a few weeks of joining. I think being yourself works best ( i’m pretty free spirited and goofy myself :-) ) Another thing that I have found is that I “mesh” better with ladies from working class families more than ladies that grew up in wealthy ones. So it’s always tough for me to vibe with ladies from Greenwich and Westchester (generalization.. i know) . I grew up in a blue collar family, went to university in NYC, and have been very very fortunate in my career. I try to be humble and genuine and enjoy a much more meaningful connection when meeting someone for the first time and they approach it the same way. :-) Ultimately for me, I value chemistry and connection just as much, perhaps maybe more than looks. good luck everyone!",
            "author": "MGsuitor",
            "id": "fc0aj9k",
            "parent_id": "t1_fb08yr8",
            "score": 3,
            "created_utc": 1577285024.0,
            "replies": []
        },
        {
            "body": "We make time for what matters. My lover supports me in my work-a-holic lifestyle, while providing me with the means to take a night off to be with him and a weekend off with my children. I’ve got the best of both worlds, really. He supports me in every endeavor. And we make the time, though not nearly as much as we’d like.",
            "author": null,
            "id": "fb0e5u9",
            "parent_id": "t1_fb0czls",
            "score": 19,
            "created_utc": 1576425205.0,
            "replies": []
        },
        {
            "body": "I am ridiculously interested in hearing what this particular set of attributes is.",
            "author": null,
            "id": "fb2n90f",
            "parent_id": "t1_fb11mhc",
            "score": 3,
            "created_utc": 1576454129.0,
            "replies": [
                {
                    "body": "I am a dark enigma, Ab!  I feel this adds to my intriguing air of mystery.  *Double finger guns and wink and clicky sound*",
                    "author": "Azurecole",
                    "id": "fb5c1i2",
                    "parent_id": "t1_fb2n90f",
                    "score": 2,
                    "created_utc": 1576524853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, we go to the gym together.",
            "author": "Sweettooth_dragon",
            "id": "fb52vyo",
            "parent_id": "t1_fb0loa3",
            "score": 1,
            "created_utc": 1576519950.0,
            "replies": []
        },
        {
            "body": "Great point. Helping her not just have the money but invest it in her future self. Making sure she understands next step things like taxes, mortgages, and stocks.",
            "author": "Sweettooth_dragon",
            "id": "fb52to3",
            "parent_id": "t1_fb0klw8",
            "score": 1,
            "created_utc": 1576519917.0,
            "replies": []
        },
        {
            "body": "Deserves 100 points.\n\nSomewhat parallel from a distant topic....  Selling homes.  The wise broker looks for a match between the home that is to be sold and the potential customers to whom that home might appeal.  \n\nThey would also talk with the seller about small changes that would affect the appeal of the home.  Or the staging of the home. \n\nIt's not about an SB or SD trying to appear to be something they are not but rather identifying the good and then pursuing the likely person who would value that.",
            "author": "pinotandsugar",
            "id": "fb2t74n",
            "parent_id": "t1_fb2fxfx",
            "score": 1,
            "created_utc": 1576457240.0,
            "replies": []
        },
        {
            "body": "My sympathies to the writer",
            "author": "pinotandsugar",
            "id": "fb2u0jp",
            "parent_id": "t1_fb2sy7d",
            "score": 2,
            "created_utc": 1576457672.0,
            "replies": []
        },
        {
            "body": "I guess it didn't work out.",
            "author": "Seven_league_boots",
            "id": "fb0cm5i",
            "parent_id": "t1_fb025lk",
            "score": 2,
            "created_utc": 1576424783.0,
            "replies": [
                {
                    "body": "Lol. We’re still happily together. SA still happily deleted. Just some mental stimulation for SLF on Sunday.",
                    "author": null,
                    "id": "fb0cvm4",
                    "parent_id": "t1_fb0cm5i",
                    "score": 8,
                    "created_utc": 1576424858.0,
                    "replies": [
                        {
                            "body": "Good.",
                            "author": "Seven_league_boots",
                            "id": "fb1b2cr",
                            "parent_id": "t1_fb0cvm4",
                            "score": 1,
                            "created_utc": 1576434341.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It sounds like you really, *really* missed the point of this post...",
            "author": "sheepskin_rug",
            "id": "fb2116v",
            "parent_id": "t1_fb1nilx",
            "score": 18,
            "created_utc": 1576443969.0,
            "replies": [
                {
                    "body": "It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n\nHowever, the problem I see on this forum, time and time again, is SB's not realizing the *inherent* value of simply *being* a young attractive girl. They especially don't seem to realize how much SD's are willing to pay for that.\n\nI've seen SB's here worrying about not being competitive in the SB market due to their lack of world experience and lack of sexual experience.\n\nCan you bake? Can you play the piano? Cool. Good for you. Maybe that will have a bit of influence on the margins, but a *lack* of any particular skills really isn't going to move the needle when it comes to most SD's.",
                    "author": "ifisch",
                    "id": "fb27tb3",
                    "parent_id": "t1_fb2116v",
                    "score": 12,
                    "created_utc": 1576446626.0,
                    "replies": [
                        {
                            "body": "> It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n> \n> However, the problem I see on this forum, time and time again, is SB's not realizing the inherent value of simply being a young attractive girl.\n\nThat is the point of the post. OP isn't those things, so her individual examples aren't going to be her offering those things.",
                            "author": "Sugarbeggar",
                            "id": "fb3qfuw",
                            "parent_id": "t1_fb27tb3",
                            "score": 4,
                            "created_utc": 1576483683.0,
                            "replies": []
                        },
                        {
                            "body": "It depends on the market you're in.  In our city in particular (ATL) there are thousands of college girls looking.  The \"inherent value of simply being a young attractive girl\" is much lower here because beauty and intelligence seem to be common on the various sites.  If someone is truly exceptional in either category, that's different.",
                            "author": "nerojt",
                            "id": "fb4p3pp",
                            "parent_id": "t1_fb27tb3",
                            "score": 4,
                            "created_utc": 1576513019.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb2idb1",
            "parent_id": "t1_fb23kyi",
            "score": 4,
            "created_utc": 1576451596.0,
            "replies": [
                {
                    "body": "My guess is that there are more SD's looking for attractive brain candy than vacuous Arm Candy.. which SA likes to feature.",
                    "author": "pinotandsugar",
                    "id": "fb2tn6m",
                    "parent_id": "t1_fb2idb1",
                    "score": 5,
                    "created_utc": 1576457476.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fb61y65",
                            "parent_id": "t1_fb2tn6m",
                            "score": 1,
                            "created_utc": 1576539366.0,
                            "replies": [
                                {
                                    "body": "When I lived in the LA area there are so many greaseballs with their (what we now call SB)  showing them off and showing that the women would put up with being pawed in public.",
                                    "author": "pinotandsugar",
                                    "id": "fb62eyv",
                                    "parent_id": "t1_fb61y65",
                                    "score": 2,
                                    "created_utc": 1576539691.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am a dark enigma, Ab!  I feel this adds to my intriguing air of mystery.  *Double finger guns and wink and clicky sound*",
            "author": "Azurecole",
            "id": "fb5c1i2",
            "parent_id": "t1_fb2n90f",
            "score": 2,
            "created_utc": 1576524853.0,
            "replies": []
        },
        {
            "body": "Lol. We’re still happily together. SA still happily deleted. Just some mental stimulation for SLF on Sunday.",
            "author": null,
            "id": "fb0cvm4",
            "parent_id": "t1_fb0cm5i",
            "score": 8,
            "created_utc": 1576424858.0,
            "replies": [
                {
                    "body": "Good.",
                    "author": "Seven_league_boots",
                    "id": "fb1b2cr",
                    "parent_id": "t1_fb0cvm4",
                    "score": 1,
                    "created_utc": 1576434341.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n\nHowever, the problem I see on this forum, time and time again, is SB's not realizing the *inherent* value of simply *being* a young attractive girl. They especially don't seem to realize how much SD's are willing to pay for that.\n\nI've seen SB's here worrying about not being competitive in the SB market due to their lack of world experience and lack of sexual experience.\n\nCan you bake? Can you play the piano? Cool. Good for you. Maybe that will have a bit of influence on the margins, but a *lack* of any particular skills really isn't going to move the needle when it comes to most SD's.",
            "author": "ifisch",
            "id": "fb27tb3",
            "parent_id": "t1_fb2116v",
            "score": 12,
            "created_utc": 1576446626.0,
            "replies": [
                {
                    "body": "> It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n> \n> However, the problem I see on this forum, time and time again, is SB's not realizing the inherent value of simply being a young attractive girl.\n\nThat is the point of the post. OP isn't those things, so her individual examples aren't going to be her offering those things.",
                    "author": "Sugarbeggar",
                    "id": "fb3qfuw",
                    "parent_id": "t1_fb27tb3",
                    "score": 4,
                    "created_utc": 1576483683.0,
                    "replies": []
                },
                {
                    "body": "It depends on the market you're in.  In our city in particular (ATL) there are thousands of college girls looking.  The \"inherent value of simply being a young attractive girl\" is much lower here because beauty and intelligence seem to be common on the various sites.  If someone is truly exceptional in either category, that's different.",
                    "author": "nerojt",
                    "id": "fb4p3pp",
                    "parent_id": "t1_fb27tb3",
                    "score": 4,
                    "created_utc": 1576513019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My guess is that there are more SD's looking for attractive brain candy than vacuous Arm Candy.. which SA likes to feature.",
            "author": "pinotandsugar",
            "id": "fb2tn6m",
            "parent_id": "t1_fb2idb1",
            "score": 5,
            "created_utc": 1576457476.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fb61y65",
                    "parent_id": "t1_fb2tn6m",
                    "score": 1,
                    "created_utc": 1576539366.0,
                    "replies": [
                        {
                            "body": "When I lived in the LA area there are so many greaseballs with their (what we now call SB)  showing them off and showing that the women would put up with being pawed in public.",
                            "author": "pinotandsugar",
                            "id": "fb62eyv",
                            "parent_id": "t1_fb61y65",
                            "score": 2,
                            "created_utc": 1576539691.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good.",
            "author": "Seven_league_boots",
            "id": "fb1b2cr",
            "parent_id": "t1_fb0cvm4",
            "score": 1,
            "created_utc": 1576434341.0,
            "replies": []
        },
        {
            "body": "> It looks to me like the point of the post is to ask not what your SD can do for you, but to ask what you can do for your SD.\n> \n> However, the problem I see on this forum, time and time again, is SB's not realizing the inherent value of simply being a young attractive girl.\n\nThat is the point of the post. OP isn't those things, so her individual examples aren't going to be her offering those things.",
            "author": "Sugarbeggar",
            "id": "fb3qfuw",
            "parent_id": "t1_fb27tb3",
            "score": 4,
            "created_utc": 1576483683.0,
            "replies": []
        },
        {
            "body": "It depends on the market you're in.  In our city in particular (ATL) there are thousands of college girls looking.  The \"inherent value of simply being a young attractive girl\" is much lower here because beauty and intelligence seem to be common on the various sites.  If someone is truly exceptional in either category, that's different.",
            "author": "nerojt",
            "id": "fb4p3pp",
            "parent_id": "t1_fb27tb3",
            "score": 4,
            "created_utc": 1576513019.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb61y65",
            "parent_id": "t1_fb2tn6m",
            "score": 1,
            "created_utc": 1576539366.0,
            "replies": [
                {
                    "body": "When I lived in the LA area there are so many greaseballs with their (what we now call SB)  showing them off and showing that the women would put up with being pawed in public.",
                    "author": "pinotandsugar",
                    "id": "fb62eyv",
                    "parent_id": "t1_fb61y65",
                    "score": 2,
                    "created_utc": 1576539691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I lived in the LA area there are so many greaseballs with their (what we now call SB)  showing them off and showing that the women would put up with being pawed in public.",
            "author": "pinotandsugar",
            "id": "fb62eyv",
            "parent_id": "t1_fb61y65",
            "score": 2,
            "created_utc": 1576539691.0,
            "replies": []
        }
    ]
}