{
    "title": "Watch out for red flag “come to my place” types",
    "post_id": "j0b79z",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j0b79z/watch_out_for_red_flag_come_to_my_place_types/",
    "author": "wildride201",
    "body": "*RED FLAG - MEN UNDER 30* \nOkay so this is just me on a rant. \n\nWent on a date with a 25 year old seeking guy. \nGot along amazingly, chat was flowing and drinks where pouring. Then 2 hours passed and he’s going on and on about going back to his house and chilling. \n\nAt first I was hesitant cause I know that’s a no no. But he was taking about just chillin, so I was like okay let’s suss him out. \nSo I told him “I’m not sure what your intentions are, but I have to just warn you that I’m on my time of the month”...\nHis personality, his vibe and everything dropped. \nHe was like “oh okay we should leave it”\n\nHe was basically just trying to use me for you know what. \nWe had no allowance planned, but he was promising that he knows what the site is about and “not to worry, I’ve got you”. Maybe next time. \n\nI texted him after to suss him out again. \nI aaid “hope to make plans next week when everything’s normal” and did he reply? \nAbsolutely not!  \n\nSuch an eye opener cause that could’ve gone so bad. \nLadies, don’t feel pressured to go to his place. Take that as a huge red flag!! \nAlso, establish that you would like to plan an allowance BEFORE meeting. This is where I’m going wrong and  wasting my own time.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j0b79z/watch_out_for_red_flag_come_to_my_place_types/",
    "score": 172,
    "upvote_ratio": 0.94,
    "created_utc": 1601145224.0,
    "num_comments": 77,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You should never even talk to anyone that young on seeking, let alone go on a date with them.",
            "author": "us3rname9",
            "id": "g6pgrmm",
            "parent_id": "t3_j0b79z",
            "score": 95,
            "created_utc": 1601145451.0,
            "replies": [
                {
                    "body": "I hear you!! Fully can’t stand taking to people under 35 and this reminded me why.",
                    "author": "wildride201",
                    "id": "g6pgu7r",
                    "parent_id": "t1_g6pgrmm",
                    "score": 25,
                    "created_utc": 1601145493.0,
                    "replies": [
                        {
                            "body": "> people under 35\n\nLet me fix this for you, if you want to talk to a real SD try 45",
                            "author": null,
                            "id": "g6pq21j",
                            "parent_id": "t1_g6pgu7r",
                            "score": 36,
                            "created_utc": 1601149017.0,
                            "replies": [
                                {
                                    "body": "Real SDs start at 105",
                                    "author": null,
                                    "id": "g6pw8ed",
                                    "parent_id": "t1_g6pq21j",
                                    "score": 84,
                                    "created_utc": 1601151061.0,
                                    "replies": [
                                        {
                                            "body": "Lmaooooo",
                                            "author": "AlinaAllure",
                                            "id": "g6q6qc1",
                                            "parent_id": "t1_g6pw8ed",
                                            "score": 6,
                                            "created_utc": 1601154516.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Lol",
                                            "author": "UnearthlyDinosaur",
                                            "id": "g6qi2jc",
                                            "parent_id": "t1_g6pw8ed",
                                            "score": 4,
                                            "created_utc": 1601158511.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It depends on what youre looking for TBH. Some girls are more concerned with being genuinely physically attracted to a guy and gag at the idea of being with someone twice their age and would rather get a smaller allowance if it means they dont have to mentally check out when theyre getting intimate.",
                                    "author": "ChadoWookie",
                                    "id": "g6rxvvz",
                                    "parent_id": "t1_g6pq21j",
                                    "score": 6,
                                    "created_utc": 1601177281.0,
                                    "replies": []
                                },
                                {
                                    "body": "You dont have to be older to have money and respect lmao",
                                    "author": "Lipstickluna97",
                                    "id": "g6pum07",
                                    "parent_id": "t1_g6pq21j",
                                    "score": 17,
                                    "created_utc": 1601150562.0,
                                    "replies": [
                                        {
                                            "body": "Exactly. I found mine.",
                                            "author": "ElementShow",
                                            "id": "g6s3zdy",
                                            "parent_id": "t1_g6pum07",
                                            "score": 4,
                                            "created_utc": 1601179379.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g6q31ko",
                                    "parent_id": "t1_g6pq21j",
                                    "score": 14,
                                    "created_utc": 1601153272.0,
                                    "replies": [
                                        {
                                            "body": "I suspect the girls would rather deal with the occasional viagra delay than a younger guy not paying them.",
                                            "author": "LotBuilder",
                                            "id": "g6s2xbf",
                                            "parent_id": "t1_g6q31ko",
                                            "score": 11,
                                            "created_utc": 1601178983.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah no biggie, the delays just leave more time to hear about old SD’s wife or kids and how similar they are to the SB. \n\nThese are generalizations. Plenty of older SDs don’t have the issues I pointed out just like plenty of younger guys do pay. People here are making whatever point benefits their age group with zero facts either way",
                                                    "author": null,
                                                    "id": "g6w5q5n",
                                                    "parent_id": "t1_g6s2xbf",
                                                    "score": 1,
                                                    "created_utc": 1601244058.0,
                                                    "replies": [
                                                        {
                                                            "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
                                                            "author": "LotBuilder",
                                                            "id": "g6w80v1",
                                                            "parent_id": "t1_g6w5q5n",
                                                            "score": 3,
                                                            "created_utc": 1601245287.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                                                                    "author": null,
                                                                    "id": "g6waawe",
                                                                    "parent_id": "t1_g6w80v1",
                                                                    "score": 1,
                                                                    "created_utc": 1601246482.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">Says a 45 year old. Gotta think the best age is whatever “I” am\n\nThat's typically how it works, lol. Most guys on here are middle age, like me, and will tell you to go for middle aged guys. \n\nAs long as you protect yourself from getting taken advantage of, I don't see why it would be bad to sugar date a younger guy.",
                                            "author": "denardos",
                                            "id": "g6rl08u",
                                            "parent_id": "t1_g6q31ko",
                                            "score": 6,
                                            "created_utc": 1601173044.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I disagree.  I started in the bowl at 32 but that was only because I was married and needed to be discreet.  Sugar dating was way less messy than having a vanilla relationship with a woman who was willing to be a side chick with no compensation and boundaries.   I turn a younger friend on to SA because he was in the same situation.",
                                    "author": "LotBuilder",
                                    "id": "g6s2q6c",
                                    "parent_id": "t1_g6pq21j",
                                    "score": 2,
                                    "created_utc": 1601178909.0,
                                    "replies": []
                                },
                                {
                                    "body": "Ah, that's my problem. I won't be 45 for 6 months. Can't wait...",
                                    "author": "wasabiflavoredpeas",
                                    "id": "g6zn6yd",
                                    "parent_id": "t1_g6pq21j",
                                    "score": 1,
                                    "created_utc": 1601323735.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What’s wrong with talking to young men. There are many young successful people nowadays.\n\nAs long as they have money and can afford to pay the SB an allowance I don’t really see the problem.",
                    "author": "a1bells",
                    "id": "g6u7h0b",
                    "parent_id": "t1_g6pgrmm",
                    "score": 0,
                    "created_utc": 1601208844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Google “salt daddies” this is their play book.",
            "author": "SDgirlburner",
            "id": "g6q0s7g",
            "parent_id": "t3_j0b79z",
            "score": 19,
            "created_utc": 1601152562.0,
            "replies": []
        },
        {
            "body": "I would start out every date with “hi, I’m\nOn my period” just to weed em out right away 😂",
            "author": "quitbeingahater",
            "id": "g6qbgma",
            "parent_id": "t3_j0b79z",
            "score": 15,
            "created_utc": 1601156186.0,
            "replies": [
                {
                    "body": "Lol... This really is the best advice... Or... Only schedule M & G's when you're on your period.. But.  I definitely would enjoy watching their face drop and their fantasies of hooking up get squashed... Mildly sadistic.. But, those cheap shitheads deserve it.😁🙄",
                    "author": "NattyLiteSaber",
                    "id": "g6qo45v",
                    "parent_id": "t1_g6qbgma",
                    "score": 12,
                    "created_utc": 1601160705.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6r9g0b",
                    "parent_id": "t1_g6qbgma",
                    "score": 4,
                    "created_utc": 1601168762.0,
                    "replies": [
                        {
                            "body": "Mature ones won’t!",
                            "author": "quitbeingahater",
                            "id": "g6u0qse",
                            "parent_id": "t1_g6r9g0b",
                            "score": 3,
                            "created_utc": 1601206335.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would change the title to: “Watch out for red flag: 25 year old attractive dudes on SA”.\n\nEverything else went right according to his plan except the end. Enough said!",
            "author": "supportiveceo",
            "id": "g6phfme",
            "parent_id": "t3_j0b79z",
            "score": 15,
            "created_utc": 1601145825.0,
            "replies": [
                {
                    "body": "I shall!",
                    "author": "wildride201",
                    "id": "g6phh6r",
                    "parent_id": "t1_g6phfme",
                    "score": 5,
                    "created_utc": 1601145849.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately, many SBs who most need slf's advice, find slf after they've been taken advantage of.  The platonic M&G is one of the best tools we have -- it lets us just concentrate on chemistry & connection without the pressure of sex hanging over our heads, it automatically dismisses many (but not all) PUAs, predators, pump & dumpers, even LEOs etc.",
            "author": "Azurecole",
            "id": "g6pgtp2",
            "parent_id": "t3_j0b79z",
            "score": 25,
            "created_utc": 1601145485.0,
            "replies": [
                {
                    "body": "LEOs?",
                    "author": "whateverrrrgrl",
                    "id": "g6swn2k",
                    "parent_id": "t1_g6pgtp2",
                    "score": 2,
                    "created_utc": 1601189738.0,
                    "replies": [
                        {
                            "body": "Law Enforcement Officer",
                            "author": null,
                            "id": "g6tvwfh",
                            "parent_id": "t1_g6swn2k",
                            "score": 3,
                            "created_utc": 1601204182.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would go a step further and go on and let them know you would like to meet for a casual (non-sexual) m&g... I think that ONE date that they KNOW they are not getting sex ahead of time will quickly weed out the \"hook up Fake Daddies/ Johns\"... Just tell them that.. And see how they react... If they understand and are respectful of that.. You may schedule a M&G.. If they stop responding all together.. Go on and block them.. They are not serious SDs... \n\nPersonally, I find the best question to ask is \"Have you had SRs in the past? If so, how were those relationships?\" That short question is going to tell you a lot... \n\nIf he has had \"lots of SR but never any lasting long term\" (you ain't special... You are NOT the one to be his first long term girl..)\n\nIf he has some elaborate story that sounds exactly like he read your \"what are you seeking?\" Section.. Then he is a noob and probably has very little experience as an SD. (Try it out, at your own discretion.)\n\nIf he has a legit response, complete with descriptions of how those relationships went.. He probably is legit as well..\n\nBe wary of the \"Yes.. I have.. BUT my last SB got CRAZY and used me like an ATM...\" She probably got CRAZY bc his cheap ass didn't cough up the cash...",
            "author": "NattyLiteSaber",
            "id": "g6qprff",
            "parent_id": "t3_j0b79z",
            "score": 12,
            "created_utc": 1601161355.0,
            "replies": []
        },
        {
            "body": "Even easier, just stay away from any man that invites you to \"chill at his place\".",
            "author": "Lov3rm4n",
            "id": "g6qr991",
            "parent_id": "t3_j0b79z",
            "score": 5,
            "created_utc": 1601161955.0,
            "replies": []
        },
        {
            "body": "Haha, I would’ve said I’m up for some period sex. I personally don’t like discussing money before a M&G and don’t plan for intimacy after it though I am open to it if things go really well.\n\nBut yeah, 25yo, drinks and trying to get you back to his place. Sounds like a vanilla game plan. \n\nI think a true SD might ask once and won’t push it if you say no. We’re not going to beg for it.",
            "author": "BishopSD",
            "id": "g6phpqy",
            "parent_id": "t3_j0b79z",
            "score": 16,
            "created_utc": 1601145987.0,
            "replies": [
                {
                    "body": "Ha he did say that. But I was like nah I wouldn’t like that. He was pulling the guilt trip card & trying to make me feel like I should go back to his... we’re the same age & im not a vulnerable fool! Haha \n\nBut yeah when it comes to the allowance, I was trying the discussion out of him during the date but he just wasn’t responding to it properly - another red flag to me",
                    "author": "wildride201",
                    "id": "g6pi3f7",
                    "parent_id": "t1_g6phpqy",
                    "score": 7,
                    "created_utc": 1601146197.0,
                    "replies": [
                        {
                            "body": ">we’re the same age\n\nwhy sugar date someone your same age..?\n\nwouldn't you think a 28 year old guy might have some serious issues if he needed to give an allowance to someone his own age..?",
                            "author": null,
                            "id": "g6twuau",
                            "parent_id": "t1_g6pi3f7",
                            "score": 2,
                            "created_utc": 1601204584.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“We”? 😂😂😂",
                    "author": "usernamechecksout4u",
                    "id": "g6r9s3p",
                    "parent_id": "t1_g6phpqy",
                    "score": 3,
                    "created_utc": 1601168880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any time meeting or getting to know a new person, *never* go to a second location unplanned.",
            "author": "unclewolfy",
            "id": "g6qs2af",
            "parent_id": "t3_j0b79z",
            "score": 5,
            "created_utc": 1601162273.0,
            "replies": []
        },
        {
            "body": "There have been 3 stories this week about SBs messing around with “SDs” under 30 after the m&g then acting surprised when allowance and arrangement doesn’t happen\n\nYou ladies do realize there are entire websites and YouTube channels specifically for coaching guys to hook up with sugar babies for free right ? \n\nNot trying to throw shade but it makes the water murky for the rest of us when young women treat all men like we are scum after these experiences",
            "author": "KnocDown",
            "id": "g6s26w9",
            "parent_id": "t3_j0b79z",
            "score": 11,
            "created_utc": 1601178709.0,
            "replies": [
                {
                    "body": "Well to be honest, this has also happened with a 40 year old that I went on a date with too. I think personally it’s the whole, not being clear enough about wanting an allowance before attending the m&g. That needs to be established before meeting in my eyes from now on. \n& Ive also been on a date with a diamond member 28 year old who’s had a proper arrangement before and who was respectful at the end of the date. \n\nAt the end of the day this post is about not being stupid enough to go back to his place",
                    "author": "wildride201",
                    "id": "g6srrop",
                    "parent_id": "t1_g6s26w9",
                    "score": 5,
                    "created_utc": 1601187935.0,
                    "replies": [
                        {
                            "body": "Good for you for protecting yourself, I’m just pointing out there seems to be a lot of 20 something pick up artists using SA for hookups instead of arrangements",
                            "author": "KnocDown",
                            "id": "g6swy32",
                            "parent_id": "t1_g6srrop",
                            "score": 2,
                            "created_utc": 1601189851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn't completely dismiss men under 30. When I was 26 I invited a SB over and we got along fine, got intimate and gave her an allowance as promised.",
            "author": "Rich_Wishbone",
            "id": "g6pilue",
            "parent_id": "t3_j0b79z",
            "score": 8,
            "created_utc": 1601146434.0,
            "replies": [
                {
                    "body": "Your a good’n! I’ve been on M&G with 3 different under 30’s and they all have had time time waisting qualities. Just don’t know how to pick em 🤷🏽‍♀️😂",
                    "author": "wildride201",
                    "id": "g6plm7j",
                    "parent_id": "t1_g6pilue",
                    "score": 8,
                    "created_utc": 1601147469.0,
                    "replies": [
                        {
                            "body": "There is a difference in maturity as guys age from their 20's to their 30's. Same with SBs. Generally, I find that the younger ones think it's easy money",
                            "author": "Rich_Wishbone",
                            "id": "g6po81k",
                            "parent_id": "t1_g6plm7j",
                            "score": 6,
                            "created_utc": 1601148358.0,
                            "replies": []
                        },
                        {
                            "body": "3 guys under 30 ?? And you been on the site only for a month ---   \n\nBe honest ; do you have a problem with real age gaps ???  Up to 10 year age gap is almost ok even in vanilla these days \n\nIf the answer is yes then all I can say is be extra patient and be flexible about the allowance ( for obvious reasons) and ENJOY IT",
                            "author": "shamloo77",
                            "id": "g6q4og8",
                            "parent_id": "t1_g6plm7j",
                            "score": 4,
                            "created_utc": 1601153826.0,
                            "replies": [
                                {
                                    "body": "How’d you know I’ve been on the site for a month? \n& I’ve been on dates with a 40, 47 & 60 year old. I have no problem with that type of age gap. I have a problem with choosing men who arent after the same thing as I am.",
                                    "author": "wildride201",
                                    "id": "g6q5t8x",
                                    "parent_id": "t1_g6q4og8",
                                    "score": 0,
                                    "created_utc": 1601154197.0,
                                    "replies": [
                                        {
                                            "body": "How you know ?  Post history",
                                            "author": "shamloo77",
                                            "id": "g6q69i1",
                                            "parent_id": "t1_g6q5t8x",
                                            "score": 5,
                                            "created_utc": 1601154356.0,
                                            "replies": [
                                                {
                                                    "body": "Ohhh yes I see. It’s been 2 months tho actually",
                                                    "author": "wildride201",
                                                    "id": "g6q6bt7",
                                                    "parent_id": "t1_g6q69i1",
                                                    "score": -2,
                                                    "created_utc": 1601154379.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let me say this again for you girls in the back... Sugar Daddies don’t look and act like the guys you normally date.  They are not under 35 unless they are married and need to be discreet.  The first few dates will not feel like a regular date.  He will be kind but he will not try to woo you or impress you.  He is paying an allowance to avoid all that.   His questions should be about you rather than boasting to a younger girl,  real SD’s don’t do that.  Unless the situation is a complete outlier (long distance and have been talking awhile and he has spent money on you) then NEVER get intimate on the first meeting.  Set the tone for a real,  long term arrangement.  Girls that operate with class and have healthy boundaries up front will do much better in the long run.   They will turn off the predators and attract the top tier SD’s.",
            "author": "LotBuilder",
            "id": "g6s277h",
            "parent_id": "t3_j0b79z",
            "score": 5,
            "created_utc": 1601178712.0,
            "replies": [
                {
                    "body": ">the first few dates will not feel like a regular date.  He will be kind but he will not try to woo you or impress you.\n\nSorry but I disagree with this. All my 1st dates have been very similar to regular dates. Im not married, and prefer to sugar date women that want a traditional sugar relationship, so they appreciate the organic approach Not all of us are looking for NSA arrangements.",
                    "author": null,
                    "id": "g6tx5c6",
                    "parent_id": "t1_g6s277h",
                    "score": 2,
                    "created_utc": 1601204716.0,
                    "replies": [
                        {
                            "body": "They feel like regular dates to you... I was talking to the ladies.  They won’t feel like regular dates to them.",
                            "author": "LotBuilder",
                            "id": "g6v0nq1",
                            "parent_id": "t1_g6tx5c6",
                            "score": 1,
                            "created_utc": 1601224132.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6qnv5s",
            "parent_id": "t3_j0b79z",
            "score": 5,
            "created_utc": 1601160605.0,
            "replies": [
                {
                    "body": "Yes you will find that type of women on Seeking, and you dont have to be 26 to find a spoiled GF off SA that doesnt want an allowance. I found one 2 1/2 years ago off SA. I was in my late 40's at the time, and she was 28. She actually did come back to my place after the meet & greet, but this was at her suggestion.\n\nTypically I look for more of a sugar girlfriend type relationship which is a hybrid of vanilla and sugar, where you offer financial help, but it's not like PPM tied to intimate dates, its more like vanilla dating w/ financial help. I just figure this is par for the course seeing Im almost 50, and date women 21-25.",
                    "author": null,
                    "id": "g6tykt9",
                    "parent_id": "t1_g6qnv5s",
                    "score": 1,
                    "created_utc": 1601205360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6qe48l",
            "parent_id": "t3_j0b79z",
            "score": 2,
            "created_utc": 1601157095.0,
            "replies": [
                {
                    "body": "When you say end up vanilla do you mean you didn't get allowance for intimacy in the end?",
                    "author": "ilt1",
                    "id": "g6r9jn0",
                    "parent_id": "t1_g6qe48l",
                    "score": 1,
                    "created_utc": 1601168798.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6untez",
                            "parent_id": "t1_g6r9jn0",
                            "score": 1,
                            "created_utc": 1601217005.0,
                            "replies": [
                                {
                                    "body": "How does it work? He doesn't bring up money and don't leave any envelope for you and  you don't say anything?",
                                    "author": "ilt1",
                                    "id": "g6upvj2",
                                    "parent_id": "t1_g6untez",
                                    "score": 1,
                                    "created_utc": 1601218224.0,
                                    "replies": [
                                        {
                                            "body": "Not judging really curious",
                                            "author": "ilt1",
                                            "id": "g6uqdax",
                                            "parent_id": "t1_g6upvj2",
                                            "score": 1,
                                            "created_utc": 1601218509.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If SB’s would actually take the advice we provide on this sub, this wouldn’t happen as often.\n\nWhat’s up with all of the SB’s who think they are actually going to get a decent allowance from a 25 year old guy?",
            "author": "UnearthlyDinosaur",
            "id": "g6qhyyp",
            "parent_id": "t3_j0b79z",
            "score": 3,
            "created_utc": 1601158477.0,
            "replies": [
                {
                    "body": "Tbf this was a last minute m&g. He was my 3rd one this weekend who I decided to squeeze in just this morning so it’s not like I was fully wanting him to be a SD",
                    "author": "wildride201",
                    "id": "g6qiqzc",
                    "parent_id": "t1_g6qhyyp",
                    "score": 0,
                    "created_utc": 1601158749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Anyone under 35 on SA is just looking to hook up. if that's what you want - the Tinder experience on a Seeking.com, then fine, but if you're actually looking for sugar you have to go 35+ without exception.",
            "author": "mrjimmyjsz",
            "id": "g6piqv6",
            "parent_id": "t3_j0b79z",
            "score": 5,
            "created_utc": 1601146494.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6q486m",
                    "parent_id": "t1_g6piqv6",
                    "score": 12,
                    "created_utc": 1601153668.0,
                    "replies": [
                        {
                            "body": "Sure but the point here is that maybe 99.9% of men under 35 want to just hookup for find a FWB. Finding a real sugar daddy under 35 is like finding the Loch Ness monster.\n\nOver 35, however, features a healthy portion of real sugar daddies. Sure you will also find broke 35+ guys who just want to have sex but it's not the vast majority like it is for the under-35 set.",
                            "author": "mrjimmyjsz",
                            "id": "g6qeojp",
                            "parent_id": "t1_g6q486m",
                            "score": 3,
                            "created_utc": 1601157292.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g6r0va9",
                                    "parent_id": "t1_g6qeojp",
                                    "score": -1,
                                    "created_utc": 1601165679.0,
                                    "replies": [
                                        {
                                            "body": "Yes,  you are what they call an \"outlier\"!",
                                            "author": "mrjimmyjsz",
                                            "id": "g6r6n0r",
                                            "parent_id": "t1_g6r0va9",
                                            "score": 3,
                                            "created_utc": 1601167757.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g6ra4tz",
                                                    "parent_id": "t1_g6r6n0r",
                                                    "score": -1,
                                                    "created_utc": 1601169006.0,
                                                    "replies": [
                                                        {
                                                            "body": "No need to get defensive about it.",
                                                            "author": "pauly_jay",
                                                            "id": "g6rgjc4",
                                                            "parent_id": "t1_g6ra4tz",
                                                            "score": 2,
                                                            "created_utc": 1601171401.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I second this...based upon my experience. They will even ask you for a blow job in the car on a MG and consider that an “arrangement”. 🤦🏽‍♀️",
                    "author": null,
                    "id": "g6qscyt",
                    "parent_id": "t1_g6piqv6",
                    "score": 1,
                    "created_utc": 1601162393.0,
                    "replies": [
                        {
                            "body": ">They will even ask you for a blow job in the car on a MG\n\nwhat if you don't have to ask & it just happens 🙈😜",
                            "author": null,
                            "id": "g6ty0ii",
                            "parent_id": "t1_g6qscyt",
                            "score": 0,
                            "created_utc": 1601205084.0,
                            "replies": [
                                {
                                    "body": "Wrong scenario.",
                                    "author": null,
                                    "id": "g6u5cbu",
                                    "parent_id": "t1_g6ty0ii",
                                    "score": 2,
                                    "created_utc": 1601208088.0,
                                    "replies": [
                                        {
                                            "body": "I know. I was just teasing. But it did happen to me once upon a time, and completely caught me off guard because it was so organic in nature.",
                                            "author": null,
                                            "id": "g6uap91",
                                            "parent_id": "t1_g6u5cbu",
                                            "score": 1,
                                            "created_utc": 1601210021.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your only mistake was thinking a guy in his 20s is an sd.",
            "author": "dade_murphy1",
            "id": "g6qxexp",
            "parent_id": "t3_j0b79z",
            "score": 2,
            "created_utc": 1601164425.0,
            "replies": [
                {
                    "body": ">Your only mistake was thinking a guy in his 20s is an sd.\n\nEspecially when OP said she's the exact same age as him. Why would she think someone her age would give her an allowance...?",
                    "author": null,
                    "id": "g6ty4d2",
                    "parent_id": "t1_g6qxexp",
                    "score": 2,
                    "created_utc": 1601205128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does \"suss this out\" even mean?",
            "author": "Grimouire",
            "id": "g6quemk",
            "parent_id": "t3_j0b79z",
            "score": 1,
            "created_utc": 1601163216.0,
            "replies": [
                {
                    "body": "It’s British. Means to find out/investigate etc",
                    "author": "wildride201",
                    "id": "g6quzvi",
                    "parent_id": "t1_g6quemk",
                    "score": 2,
                    "created_utc": 1601163448.0,
                    "replies": [
                        {
                            "body": "Thanks.",
                            "author": "Grimouire",
                            "id": "g6r1sfi",
                            "parent_id": "t1_g6quzvi",
                            "score": 1,
                            "created_utc": 1601166026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And the come to my hotel types as well",
            "author": "templewander",
            "id": "g6t7y1g",
            "parent_id": "t3_j0b79z",
            "score": 1,
            "created_utc": 1601193932.0,
            "replies": []
        },
        {
            "body": "Oh boy...good thread gone bad. \n\n*le sigh*",
            "author": null,
            "id": "g6ucy9y",
            "parent_id": "t3_j0b79z",
            "score": 1,
            "created_utc": 1601210841.0,
            "replies": []
        },
        {
            "body": "I saw that coming",
            "author": "apryll11",
            "id": "g6uwwi2",
            "parent_id": "t3_j0b79z",
            "score": 1,
            "created_utc": 1601222120.0,
            "replies": []
        },
        {
            "body": "I always suggest coming to my place. Sorts out those who are really interested.",
            "author": "aventuremoi",
            "id": "g6v535a",
            "parent_id": "t3_j0b79z",
            "score": 1,
            "created_utc": 1601226462.0,
            "replies": []
        },
        {
            "body": "Lol this sub\nImagine complaining for your only use",
            "author": "UsuallyAvoidReddit",
            "id": "g6sr7g5",
            "parent_id": "t3_j0b79z",
            "score": 0,
            "created_utc": 1601187711.0,
            "replies": [
                {
                    "body": "What are you on about? Oh I see you just post negative comments on everyone’s stuff. Yawn, goodbye.",
                    "author": "wildride201",
                    "id": "g6srcw8",
                    "parent_id": "t1_g6sr7g5",
                    "score": 1,
                    "created_utc": 1601187772.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your feelings are hurt because the guy hasn't validated you by responding your text. That's the beginning and end of your message. Move on.",
            "author": "mudpiesnow",
            "id": "g6ttphu",
            "parent_id": "t3_j0b79z",
            "score": 0,
            "created_utc": 1601203245.0,
            "replies": [
                {
                    "body": "My feelings aren’t hurt at all actually. I was actually more fussed about his change in attitude when he realised he wasn’t getting me back to his. It’s laughable really. \nJheeze I was just ranting how are people getting so worked up at this 😂😂😂 you weirdos man",
                    "author": "wildride201",
                    "id": "g6tu07s",
                    "parent_id": "t1_g6ttphu",
                    "score": 2,
                    "created_utc": 1601203376.0,
                    "replies": [
                        {
                            "body": "Please don’t call us weirdos—-you’re here with us trying to figure all this stuff out so what does that make you?\n\nWelcome to the weirdo club!! 😄 Grab a drink, watch the videos, and go meet a friend.",
                            "author": null,
                            "id": "g6udi8w",
                            "parent_id": "t1_g6tu07s",
                            "score": 1,
                            "created_utc": 1601211027.0,
                            "replies": []
                        },
                        {
                            "body": "The fact that you felt the need to message me indicates your feelings are now hurt not only by that guy - but now by me. You need to grow a thicker skin or you won't make it in this game. All humans need validation - we do. But you gotta value yourself enough not to get upset when a guy doesn't respond. Also - what did you think you were going to his house for? A game of checkers? Of course your period matters. You told him you were on it as what - some test to see if he liked you enough to play checkers and eat popcorn? It's a date woman - you're not there to make platonic friends.",
                            "author": "mudpiesnow",
                            "id": "g6tufmh",
                            "parent_id": "t1_g6tu07s",
                            "score": -2,
                            "created_utc": 1601203560.0,
                            "replies": [
                                {
                                    "body": "No hunny, the fact that I messaged you was cause I like responding to drama cause I’m bored on this Sunday morning :) & I ACTUALLY AM ON MY PERIOD. So I’m even more irritable. You truly know nothing about me & your making stuff up to make yourself sound even better. Bore off :)",
                                    "author": "wildride201",
                                    "id": "g6tut56",
                                    "parent_id": "t1_g6tufmh",
                                    "score": 1,
                                    "created_utc": 1601203723.0,
                                    "replies": []
                                },
                                {
                                    "body": "😄😄 Why did you say the first part? That was inside baseball.",
                                    "author": null,
                                    "id": "g6ud4hn",
                                    "parent_id": "t1_g6tufmh",
                                    "score": 1,
                                    "created_utc": 1601210903.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hear you!! Fully can’t stand taking to people under 35 and this reminded me why.",
            "author": "wildride201",
            "id": "g6pgu7r",
            "parent_id": "t1_g6pgrmm",
            "score": 25,
            "created_utc": 1601145493.0,
            "replies": [
                {
                    "body": "> people under 35\n\nLet me fix this for you, if you want to talk to a real SD try 45",
                    "author": null,
                    "id": "g6pq21j",
                    "parent_id": "t1_g6pgu7r",
                    "score": 36,
                    "created_utc": 1601149017.0,
                    "replies": [
                        {
                            "body": "Real SDs start at 105",
                            "author": null,
                            "id": "g6pw8ed",
                            "parent_id": "t1_g6pq21j",
                            "score": 84,
                            "created_utc": 1601151061.0,
                            "replies": [
                                {
                                    "body": "Lmaooooo",
                                    "author": "AlinaAllure",
                                    "id": "g6q6qc1",
                                    "parent_id": "t1_g6pw8ed",
                                    "score": 6,
                                    "created_utc": 1601154516.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lol",
                                    "author": "UnearthlyDinosaur",
                                    "id": "g6qi2jc",
                                    "parent_id": "t1_g6pw8ed",
                                    "score": 4,
                                    "created_utc": 1601158511.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It depends on what youre looking for TBH. Some girls are more concerned with being genuinely physically attracted to a guy and gag at the idea of being with someone twice their age and would rather get a smaller allowance if it means they dont have to mentally check out when theyre getting intimate.",
                            "author": "ChadoWookie",
                            "id": "g6rxvvz",
                            "parent_id": "t1_g6pq21j",
                            "score": 6,
                            "created_utc": 1601177281.0,
                            "replies": []
                        },
                        {
                            "body": "You dont have to be older to have money and respect lmao",
                            "author": "Lipstickluna97",
                            "id": "g6pum07",
                            "parent_id": "t1_g6pq21j",
                            "score": 17,
                            "created_utc": 1601150562.0,
                            "replies": [
                                {
                                    "body": "Exactly. I found mine.",
                                    "author": "ElementShow",
                                    "id": "g6s3zdy",
                                    "parent_id": "t1_g6pum07",
                                    "score": 4,
                                    "created_utc": 1601179379.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6q31ko",
                            "parent_id": "t1_g6pq21j",
                            "score": 14,
                            "created_utc": 1601153272.0,
                            "replies": [
                                {
                                    "body": "I suspect the girls would rather deal with the occasional viagra delay than a younger guy not paying them.",
                                    "author": "LotBuilder",
                                    "id": "g6s2xbf",
                                    "parent_id": "t1_g6q31ko",
                                    "score": 11,
                                    "created_utc": 1601178983.0,
                                    "replies": [
                                        {
                                            "body": "Yeah no biggie, the delays just leave more time to hear about old SD’s wife or kids and how similar they are to the SB. \n\nThese are generalizations. Plenty of older SDs don’t have the issues I pointed out just like plenty of younger guys do pay. People here are making whatever point benefits their age group with zero facts either way",
                                            "author": null,
                                            "id": "g6w5q5n",
                                            "parent_id": "t1_g6s2xbf",
                                            "score": 1,
                                            "created_utc": 1601244058.0,
                                            "replies": [
                                                {
                                                    "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
                                                    "author": "LotBuilder",
                                                    "id": "g6w80v1",
                                                    "parent_id": "t1_g6w5q5n",
                                                    "score": 3,
                                                    "created_utc": 1601245287.0,
                                                    "replies": [
                                                        {
                                                            "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                                                            "author": null,
                                                            "id": "g6waawe",
                                                            "parent_id": "t1_g6w80v1",
                                                            "score": 1,
                                                            "created_utc": 1601246482.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">Says a 45 year old. Gotta think the best age is whatever “I” am\n\nThat's typically how it works, lol. Most guys on here are middle age, like me, and will tell you to go for middle aged guys. \n\nAs long as you protect yourself from getting taken advantage of, I don't see why it would be bad to sugar date a younger guy.",
                                    "author": "denardos",
                                    "id": "g6rl08u",
                                    "parent_id": "t1_g6q31ko",
                                    "score": 6,
                                    "created_utc": 1601173044.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I disagree.  I started in the bowl at 32 but that was only because I was married and needed to be discreet.  Sugar dating was way less messy than having a vanilla relationship with a woman who was willing to be a side chick with no compensation and boundaries.   I turn a younger friend on to SA because he was in the same situation.",
                            "author": "LotBuilder",
                            "id": "g6s2q6c",
                            "parent_id": "t1_g6pq21j",
                            "score": 2,
                            "created_utc": 1601178909.0,
                            "replies": []
                        },
                        {
                            "body": "Ah, that's my problem. I won't be 45 for 6 months. Can't wait...",
                            "author": "wasabiflavoredpeas",
                            "id": "g6zn6yd",
                            "parent_id": "t1_g6pq21j",
                            "score": 1,
                            "created_utc": 1601323735.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What’s wrong with talking to young men. There are many young successful people nowadays.\n\nAs long as they have money and can afford to pay the SB an allowance I don’t really see the problem.",
            "author": "a1bells",
            "id": "g6u7h0b",
            "parent_id": "t1_g6pgrmm",
            "score": 0,
            "created_utc": 1601208844.0,
            "replies": []
        },
        {
            "body": "Lol... This really is the best advice... Or... Only schedule M & G's when you're on your period.. But.  I definitely would enjoy watching their face drop and their fantasies of hooking up get squashed... Mildly sadistic.. But, those cheap shitheads deserve it.😁🙄",
            "author": "NattyLiteSaber",
            "id": "g6qo45v",
            "parent_id": "t1_g6qbgma",
            "score": 12,
            "created_utc": 1601160705.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6r9g0b",
            "parent_id": "t1_g6qbgma",
            "score": 4,
            "created_utc": 1601168762.0,
            "replies": [
                {
                    "body": "Mature ones won’t!",
                    "author": "quitbeingahater",
                    "id": "g6u0qse",
                    "parent_id": "t1_g6r9g0b",
                    "score": 3,
                    "created_utc": 1601206335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I shall!",
            "author": "wildride201",
            "id": "g6phh6r",
            "parent_id": "t1_g6phfme",
            "score": 5,
            "created_utc": 1601145849.0,
            "replies": []
        },
        {
            "body": "LEOs?",
            "author": "whateverrrrgrl",
            "id": "g6swn2k",
            "parent_id": "t1_g6pgtp2",
            "score": 2,
            "created_utc": 1601189738.0,
            "replies": [
                {
                    "body": "Law Enforcement Officer",
                    "author": null,
                    "id": "g6tvwfh",
                    "parent_id": "t1_g6swn2k",
                    "score": 3,
                    "created_utc": 1601204182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ha he did say that. But I was like nah I wouldn’t like that. He was pulling the guilt trip card & trying to make me feel like I should go back to his... we’re the same age & im not a vulnerable fool! Haha \n\nBut yeah when it comes to the allowance, I was trying the discussion out of him during the date but he just wasn’t responding to it properly - another red flag to me",
            "author": "wildride201",
            "id": "g6pi3f7",
            "parent_id": "t1_g6phpqy",
            "score": 7,
            "created_utc": 1601146197.0,
            "replies": [
                {
                    "body": ">we’re the same age\n\nwhy sugar date someone your same age..?\n\nwouldn't you think a 28 year old guy might have some serious issues if he needed to give an allowance to someone his own age..?",
                    "author": null,
                    "id": "g6twuau",
                    "parent_id": "t1_g6pi3f7",
                    "score": 2,
                    "created_utc": 1601204584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“We”? 😂😂😂",
            "author": "usernamechecksout4u",
            "id": "g6r9s3p",
            "parent_id": "t1_g6phpqy",
            "score": 3,
            "created_utc": 1601168880.0,
            "replies": []
        },
        {
            "body": "Well to be honest, this has also happened with a 40 year old that I went on a date with too. I think personally it’s the whole, not being clear enough about wanting an allowance before attending the m&g. That needs to be established before meeting in my eyes from now on. \n& Ive also been on a date with a diamond member 28 year old who’s had a proper arrangement before and who was respectful at the end of the date. \n\nAt the end of the day this post is about not being stupid enough to go back to his place",
            "author": "wildride201",
            "id": "g6srrop",
            "parent_id": "t1_g6s26w9",
            "score": 5,
            "created_utc": 1601187935.0,
            "replies": [
                {
                    "body": "Good for you for protecting yourself, I’m just pointing out there seems to be a lot of 20 something pick up artists using SA for hookups instead of arrangements",
                    "author": "KnocDown",
                    "id": "g6swy32",
                    "parent_id": "t1_g6srrop",
                    "score": 2,
                    "created_utc": 1601189851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your a good’n! I’ve been on M&G with 3 different under 30’s and they all have had time time waisting qualities. Just don’t know how to pick em 🤷🏽‍♀️😂",
            "author": "wildride201",
            "id": "g6plm7j",
            "parent_id": "t1_g6pilue",
            "score": 8,
            "created_utc": 1601147469.0,
            "replies": [
                {
                    "body": "There is a difference in maturity as guys age from their 20's to their 30's. Same with SBs. Generally, I find that the younger ones think it's easy money",
                    "author": "Rich_Wishbone",
                    "id": "g6po81k",
                    "parent_id": "t1_g6plm7j",
                    "score": 6,
                    "created_utc": 1601148358.0,
                    "replies": []
                },
                {
                    "body": "3 guys under 30 ?? And you been on the site only for a month ---   \n\nBe honest ; do you have a problem with real age gaps ???  Up to 10 year age gap is almost ok even in vanilla these days \n\nIf the answer is yes then all I can say is be extra patient and be flexible about the allowance ( for obvious reasons) and ENJOY IT",
                    "author": "shamloo77",
                    "id": "g6q4og8",
                    "parent_id": "t1_g6plm7j",
                    "score": 4,
                    "created_utc": 1601153826.0,
                    "replies": [
                        {
                            "body": "How’d you know I’ve been on the site for a month? \n& I’ve been on dates with a 40, 47 & 60 year old. I have no problem with that type of age gap. I have a problem with choosing men who arent after the same thing as I am.",
                            "author": "wildride201",
                            "id": "g6q5t8x",
                            "parent_id": "t1_g6q4og8",
                            "score": 0,
                            "created_utc": 1601154197.0,
                            "replies": [
                                {
                                    "body": "How you know ?  Post history",
                                    "author": "shamloo77",
                                    "id": "g6q69i1",
                                    "parent_id": "t1_g6q5t8x",
                                    "score": 5,
                                    "created_utc": 1601154356.0,
                                    "replies": [
                                        {
                                            "body": "Ohhh yes I see. It’s been 2 months tho actually",
                                            "author": "wildride201",
                                            "id": "g6q6bt7",
                                            "parent_id": "t1_g6q69i1",
                                            "score": -2,
                                            "created_utc": 1601154379.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">the first few dates will not feel like a regular date.  He will be kind but he will not try to woo you or impress you.\n\nSorry but I disagree with this. All my 1st dates have been very similar to regular dates. Im not married, and prefer to sugar date women that want a traditional sugar relationship, so they appreciate the organic approach Not all of us are looking for NSA arrangements.",
            "author": null,
            "id": "g6tx5c6",
            "parent_id": "t1_g6s277h",
            "score": 2,
            "created_utc": 1601204716.0,
            "replies": [
                {
                    "body": "They feel like regular dates to you... I was talking to the ladies.  They won’t feel like regular dates to them.",
                    "author": "LotBuilder",
                    "id": "g6v0nq1",
                    "parent_id": "t1_g6tx5c6",
                    "score": 1,
                    "created_utc": 1601224132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes you will find that type of women on Seeking, and you dont have to be 26 to find a spoiled GF off SA that doesnt want an allowance. I found one 2 1/2 years ago off SA. I was in my late 40's at the time, and she was 28. She actually did come back to my place after the meet & greet, but this was at her suggestion.\n\nTypically I look for more of a sugar girlfriend type relationship which is a hybrid of vanilla and sugar, where you offer financial help, but it's not like PPM tied to intimate dates, its more like vanilla dating w/ financial help. I just figure this is par for the course seeing Im almost 50, and date women 21-25.",
            "author": null,
            "id": "g6tykt9",
            "parent_id": "t1_g6qnv5s",
            "score": 1,
            "created_utc": 1601205360.0,
            "replies": []
        },
        {
            "body": "When you say end up vanilla do you mean you didn't get allowance for intimacy in the end?",
            "author": "ilt1",
            "id": "g6r9jn0",
            "parent_id": "t1_g6qe48l",
            "score": 1,
            "created_utc": 1601168798.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6untez",
                    "parent_id": "t1_g6r9jn0",
                    "score": 1,
                    "created_utc": 1601217005.0,
                    "replies": [
                        {
                            "body": "How does it work? He doesn't bring up money and don't leave any envelope for you and  you don't say anything?",
                            "author": "ilt1",
                            "id": "g6upvj2",
                            "parent_id": "t1_g6untez",
                            "score": 1,
                            "created_utc": 1601218224.0,
                            "replies": [
                                {
                                    "body": "Not judging really curious",
                                    "author": "ilt1",
                                    "id": "g6uqdax",
                                    "parent_id": "t1_g6upvj2",
                                    "score": 1,
                                    "created_utc": 1601218509.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tbf this was a last minute m&g. He was my 3rd one this weekend who I decided to squeeze in just this morning so it’s not like I was fully wanting him to be a SD",
            "author": "wildride201",
            "id": "g6qiqzc",
            "parent_id": "t1_g6qhyyp",
            "score": 0,
            "created_utc": 1601158749.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6q486m",
            "parent_id": "t1_g6piqv6",
            "score": 12,
            "created_utc": 1601153668.0,
            "replies": [
                {
                    "body": "Sure but the point here is that maybe 99.9% of men under 35 want to just hookup for find a FWB. Finding a real sugar daddy under 35 is like finding the Loch Ness monster.\n\nOver 35, however, features a healthy portion of real sugar daddies. Sure you will also find broke 35+ guys who just want to have sex but it's not the vast majority like it is for the under-35 set.",
                    "author": "mrjimmyjsz",
                    "id": "g6qeojp",
                    "parent_id": "t1_g6q486m",
                    "score": 3,
                    "created_utc": 1601157292.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6r0va9",
                            "parent_id": "t1_g6qeojp",
                            "score": -1,
                            "created_utc": 1601165679.0,
                            "replies": [
                                {
                                    "body": "Yes,  you are what they call an \"outlier\"!",
                                    "author": "mrjimmyjsz",
                                    "id": "g6r6n0r",
                                    "parent_id": "t1_g6r0va9",
                                    "score": 3,
                                    "created_utc": 1601167757.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g6ra4tz",
                                            "parent_id": "t1_g6r6n0r",
                                            "score": -1,
                                            "created_utc": 1601169006.0,
                                            "replies": [
                                                {
                                                    "body": "No need to get defensive about it.",
                                                    "author": "pauly_jay",
                                                    "id": "g6rgjc4",
                                                    "parent_id": "t1_g6ra4tz",
                                                    "score": 2,
                                                    "created_utc": 1601171401.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I second this...based upon my experience. They will even ask you for a blow job in the car on a MG and consider that an “arrangement”. 🤦🏽‍♀️",
            "author": null,
            "id": "g6qscyt",
            "parent_id": "t1_g6piqv6",
            "score": 1,
            "created_utc": 1601162393.0,
            "replies": [
                {
                    "body": ">They will even ask you for a blow job in the car on a MG\n\nwhat if you don't have to ask & it just happens 🙈😜",
                    "author": null,
                    "id": "g6ty0ii",
                    "parent_id": "t1_g6qscyt",
                    "score": 0,
                    "created_utc": 1601205084.0,
                    "replies": [
                        {
                            "body": "Wrong scenario.",
                            "author": null,
                            "id": "g6u5cbu",
                            "parent_id": "t1_g6ty0ii",
                            "score": 2,
                            "created_utc": 1601208088.0,
                            "replies": [
                                {
                                    "body": "I know. I was just teasing. But it did happen to me once upon a time, and completely caught me off guard because it was so organic in nature.",
                                    "author": null,
                                    "id": "g6uap91",
                                    "parent_id": "t1_g6u5cbu",
                                    "score": 1,
                                    "created_utc": 1601210021.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Your only mistake was thinking a guy in his 20s is an sd.\n\nEspecially when OP said she's the exact same age as him. Why would she think someone her age would give her an allowance...?",
            "author": null,
            "id": "g6ty4d2",
            "parent_id": "t1_g6qxexp",
            "score": 2,
            "created_utc": 1601205128.0,
            "replies": []
        },
        {
            "body": "It’s British. Means to find out/investigate etc",
            "author": "wildride201",
            "id": "g6quzvi",
            "parent_id": "t1_g6quemk",
            "score": 2,
            "created_utc": 1601163448.0,
            "replies": [
                {
                    "body": "Thanks.",
                    "author": "Grimouire",
                    "id": "g6r1sfi",
                    "parent_id": "t1_g6quzvi",
                    "score": 1,
                    "created_utc": 1601166026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What are you on about? Oh I see you just post negative comments on everyone’s stuff. Yawn, goodbye.",
            "author": "wildride201",
            "id": "g6srcw8",
            "parent_id": "t1_g6sr7g5",
            "score": 1,
            "created_utc": 1601187772.0,
            "replies": []
        },
        {
            "body": "My feelings aren’t hurt at all actually. I was actually more fussed about his change in attitude when he realised he wasn’t getting me back to his. It’s laughable really. \nJheeze I was just ranting how are people getting so worked up at this 😂😂😂 you weirdos man",
            "author": "wildride201",
            "id": "g6tu07s",
            "parent_id": "t1_g6ttphu",
            "score": 2,
            "created_utc": 1601203376.0,
            "replies": [
                {
                    "body": "Please don’t call us weirdos—-you’re here with us trying to figure all this stuff out so what does that make you?\n\nWelcome to the weirdo club!! 😄 Grab a drink, watch the videos, and go meet a friend.",
                    "author": null,
                    "id": "g6udi8w",
                    "parent_id": "t1_g6tu07s",
                    "score": 1,
                    "created_utc": 1601211027.0,
                    "replies": []
                },
                {
                    "body": "The fact that you felt the need to message me indicates your feelings are now hurt not only by that guy - but now by me. You need to grow a thicker skin or you won't make it in this game. All humans need validation - we do. But you gotta value yourself enough not to get upset when a guy doesn't respond. Also - what did you think you were going to his house for? A game of checkers? Of course your period matters. You told him you were on it as what - some test to see if he liked you enough to play checkers and eat popcorn? It's a date woman - you're not there to make platonic friends.",
                    "author": "mudpiesnow",
                    "id": "g6tufmh",
                    "parent_id": "t1_g6tu07s",
                    "score": -2,
                    "created_utc": 1601203560.0,
                    "replies": [
                        {
                            "body": "No hunny, the fact that I messaged you was cause I like responding to drama cause I’m bored on this Sunday morning :) & I ACTUALLY AM ON MY PERIOD. So I’m even more irritable. You truly know nothing about me & your making stuff up to make yourself sound even better. Bore off :)",
                            "author": "wildride201",
                            "id": "g6tut56",
                            "parent_id": "t1_g6tufmh",
                            "score": 1,
                            "created_utc": 1601203723.0,
                            "replies": []
                        },
                        {
                            "body": "😄😄 Why did you say the first part? That was inside baseball.",
                            "author": null,
                            "id": "g6ud4hn",
                            "parent_id": "t1_g6tufmh",
                            "score": 1,
                            "created_utc": 1601210903.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> people under 35\n\nLet me fix this for you, if you want to talk to a real SD try 45",
            "author": null,
            "id": "g6pq21j",
            "parent_id": "t1_g6pgu7r",
            "score": 36,
            "created_utc": 1601149017.0,
            "replies": [
                {
                    "body": "Real SDs start at 105",
                    "author": null,
                    "id": "g6pw8ed",
                    "parent_id": "t1_g6pq21j",
                    "score": 84,
                    "created_utc": 1601151061.0,
                    "replies": [
                        {
                            "body": "Lmaooooo",
                            "author": "AlinaAllure",
                            "id": "g6q6qc1",
                            "parent_id": "t1_g6pw8ed",
                            "score": 6,
                            "created_utc": 1601154516.0,
                            "replies": []
                        },
                        {
                            "body": "Lol",
                            "author": "UnearthlyDinosaur",
                            "id": "g6qi2jc",
                            "parent_id": "t1_g6pw8ed",
                            "score": 4,
                            "created_utc": 1601158511.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It depends on what youre looking for TBH. Some girls are more concerned with being genuinely physically attracted to a guy and gag at the idea of being with someone twice their age and would rather get a smaller allowance if it means they dont have to mentally check out when theyre getting intimate.",
                    "author": "ChadoWookie",
                    "id": "g6rxvvz",
                    "parent_id": "t1_g6pq21j",
                    "score": 6,
                    "created_utc": 1601177281.0,
                    "replies": []
                },
                {
                    "body": "You dont have to be older to have money and respect lmao",
                    "author": "Lipstickluna97",
                    "id": "g6pum07",
                    "parent_id": "t1_g6pq21j",
                    "score": 17,
                    "created_utc": 1601150562.0,
                    "replies": [
                        {
                            "body": "Exactly. I found mine.",
                            "author": "ElementShow",
                            "id": "g6s3zdy",
                            "parent_id": "t1_g6pum07",
                            "score": 4,
                            "created_utc": 1601179379.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6q31ko",
                    "parent_id": "t1_g6pq21j",
                    "score": 14,
                    "created_utc": 1601153272.0,
                    "replies": [
                        {
                            "body": "I suspect the girls would rather deal with the occasional viagra delay than a younger guy not paying them.",
                            "author": "LotBuilder",
                            "id": "g6s2xbf",
                            "parent_id": "t1_g6q31ko",
                            "score": 11,
                            "created_utc": 1601178983.0,
                            "replies": [
                                {
                                    "body": "Yeah no biggie, the delays just leave more time to hear about old SD’s wife or kids and how similar they are to the SB. \n\nThese are generalizations. Plenty of older SDs don’t have the issues I pointed out just like plenty of younger guys do pay. People here are making whatever point benefits their age group with zero facts either way",
                                    "author": null,
                                    "id": "g6w5q5n",
                                    "parent_id": "t1_g6s2xbf",
                                    "score": 1,
                                    "created_utc": 1601244058.0,
                                    "replies": [
                                        {
                                            "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
                                            "author": "LotBuilder",
                                            "id": "g6w80v1",
                                            "parent_id": "t1_g6w5q5n",
                                            "score": 3,
                                            "created_utc": 1601245287.0,
                                            "replies": [
                                                {
                                                    "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                                                    "author": null,
                                                    "id": "g6waawe",
                                                    "parent_id": "t1_g6w80v1",
                                                    "score": 1,
                                                    "created_utc": 1601246482.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">Says a 45 year old. Gotta think the best age is whatever “I” am\n\nThat's typically how it works, lol. Most guys on here are middle age, like me, and will tell you to go for middle aged guys. \n\nAs long as you protect yourself from getting taken advantage of, I don't see why it would be bad to sugar date a younger guy.",
                            "author": "denardos",
                            "id": "g6rl08u",
                            "parent_id": "t1_g6q31ko",
                            "score": 6,
                            "created_utc": 1601173044.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I disagree.  I started in the bowl at 32 but that was only because I was married and needed to be discreet.  Sugar dating was way less messy than having a vanilla relationship with a woman who was willing to be a side chick with no compensation and boundaries.   I turn a younger friend on to SA because he was in the same situation.",
                    "author": "LotBuilder",
                    "id": "g6s2q6c",
                    "parent_id": "t1_g6pq21j",
                    "score": 2,
                    "created_utc": 1601178909.0,
                    "replies": []
                },
                {
                    "body": "Ah, that's my problem. I won't be 45 for 6 months. Can't wait...",
                    "author": "wasabiflavoredpeas",
                    "id": "g6zn6yd",
                    "parent_id": "t1_g6pq21j",
                    "score": 1,
                    "created_utc": 1601323735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mature ones won’t!",
            "author": "quitbeingahater",
            "id": "g6u0qse",
            "parent_id": "t1_g6r9g0b",
            "score": 3,
            "created_utc": 1601206335.0,
            "replies": []
        },
        {
            "body": "Law Enforcement Officer",
            "author": null,
            "id": "g6tvwfh",
            "parent_id": "t1_g6swn2k",
            "score": 3,
            "created_utc": 1601204182.0,
            "replies": []
        },
        {
            "body": ">we’re the same age\n\nwhy sugar date someone your same age..?\n\nwouldn't you think a 28 year old guy might have some serious issues if he needed to give an allowance to someone his own age..?",
            "author": null,
            "id": "g6twuau",
            "parent_id": "t1_g6pi3f7",
            "score": 2,
            "created_utc": 1601204584.0,
            "replies": []
        },
        {
            "body": "Good for you for protecting yourself, I’m just pointing out there seems to be a lot of 20 something pick up artists using SA for hookups instead of arrangements",
            "author": "KnocDown",
            "id": "g6swy32",
            "parent_id": "t1_g6srrop",
            "score": 2,
            "created_utc": 1601189851.0,
            "replies": []
        },
        {
            "body": "There is a difference in maturity as guys age from their 20's to their 30's. Same with SBs. Generally, I find that the younger ones think it's easy money",
            "author": "Rich_Wishbone",
            "id": "g6po81k",
            "parent_id": "t1_g6plm7j",
            "score": 6,
            "created_utc": 1601148358.0,
            "replies": []
        },
        {
            "body": "3 guys under 30 ?? And you been on the site only for a month ---   \n\nBe honest ; do you have a problem with real age gaps ???  Up to 10 year age gap is almost ok even in vanilla these days \n\nIf the answer is yes then all I can say is be extra patient and be flexible about the allowance ( for obvious reasons) and ENJOY IT",
            "author": "shamloo77",
            "id": "g6q4og8",
            "parent_id": "t1_g6plm7j",
            "score": 4,
            "created_utc": 1601153826.0,
            "replies": [
                {
                    "body": "How’d you know I’ve been on the site for a month? \n& I’ve been on dates with a 40, 47 & 60 year old. I have no problem with that type of age gap. I have a problem with choosing men who arent after the same thing as I am.",
                    "author": "wildride201",
                    "id": "g6q5t8x",
                    "parent_id": "t1_g6q4og8",
                    "score": 0,
                    "created_utc": 1601154197.0,
                    "replies": [
                        {
                            "body": "How you know ?  Post history",
                            "author": "shamloo77",
                            "id": "g6q69i1",
                            "parent_id": "t1_g6q5t8x",
                            "score": 5,
                            "created_utc": 1601154356.0,
                            "replies": [
                                {
                                    "body": "Ohhh yes I see. It’s been 2 months tho actually",
                                    "author": "wildride201",
                                    "id": "g6q6bt7",
                                    "parent_id": "t1_g6q69i1",
                                    "score": -2,
                                    "created_utc": 1601154379.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They feel like regular dates to you... I was talking to the ladies.  They won’t feel like regular dates to them.",
            "author": "LotBuilder",
            "id": "g6v0nq1",
            "parent_id": "t1_g6tx5c6",
            "score": 1,
            "created_utc": 1601224132.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6untez",
            "parent_id": "t1_g6r9jn0",
            "score": 1,
            "created_utc": 1601217005.0,
            "replies": [
                {
                    "body": "How does it work? He doesn't bring up money and don't leave any envelope for you and  you don't say anything?",
                    "author": "ilt1",
                    "id": "g6upvj2",
                    "parent_id": "t1_g6untez",
                    "score": 1,
                    "created_utc": 1601218224.0,
                    "replies": [
                        {
                            "body": "Not judging really curious",
                            "author": "ilt1",
                            "id": "g6uqdax",
                            "parent_id": "t1_g6upvj2",
                            "score": 1,
                            "created_utc": 1601218509.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sure but the point here is that maybe 99.9% of men under 35 want to just hookup for find a FWB. Finding a real sugar daddy under 35 is like finding the Loch Ness monster.\n\nOver 35, however, features a healthy portion of real sugar daddies. Sure you will also find broke 35+ guys who just want to have sex but it's not the vast majority like it is for the under-35 set.",
            "author": "mrjimmyjsz",
            "id": "g6qeojp",
            "parent_id": "t1_g6q486m",
            "score": 3,
            "created_utc": 1601157292.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6r0va9",
                    "parent_id": "t1_g6qeojp",
                    "score": -1,
                    "created_utc": 1601165679.0,
                    "replies": [
                        {
                            "body": "Yes,  you are what they call an \"outlier\"!",
                            "author": "mrjimmyjsz",
                            "id": "g6r6n0r",
                            "parent_id": "t1_g6r0va9",
                            "score": 3,
                            "created_utc": 1601167757.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g6ra4tz",
                                    "parent_id": "t1_g6r6n0r",
                                    "score": -1,
                                    "created_utc": 1601169006.0,
                                    "replies": [
                                        {
                                            "body": "No need to get defensive about it.",
                                            "author": "pauly_jay",
                                            "id": "g6rgjc4",
                                            "parent_id": "t1_g6ra4tz",
                                            "score": 2,
                                            "created_utc": 1601171401.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">They will even ask you for a blow job in the car on a MG\n\nwhat if you don't have to ask & it just happens 🙈😜",
            "author": null,
            "id": "g6ty0ii",
            "parent_id": "t1_g6qscyt",
            "score": 0,
            "created_utc": 1601205084.0,
            "replies": [
                {
                    "body": "Wrong scenario.",
                    "author": null,
                    "id": "g6u5cbu",
                    "parent_id": "t1_g6ty0ii",
                    "score": 2,
                    "created_utc": 1601208088.0,
                    "replies": [
                        {
                            "body": "I know. I was just teasing. But it did happen to me once upon a time, and completely caught me off guard because it was so organic in nature.",
                            "author": null,
                            "id": "g6uap91",
                            "parent_id": "t1_g6u5cbu",
                            "score": 1,
                            "created_utc": 1601210021.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks.",
            "author": "Grimouire",
            "id": "g6r1sfi",
            "parent_id": "t1_g6quzvi",
            "score": 1,
            "created_utc": 1601166026.0,
            "replies": []
        },
        {
            "body": "Please don’t call us weirdos—-you’re here with us trying to figure all this stuff out so what does that make you?\n\nWelcome to the weirdo club!! 😄 Grab a drink, watch the videos, and go meet a friend.",
            "author": null,
            "id": "g6udi8w",
            "parent_id": "t1_g6tu07s",
            "score": 1,
            "created_utc": 1601211027.0,
            "replies": []
        },
        {
            "body": "The fact that you felt the need to message me indicates your feelings are now hurt not only by that guy - but now by me. You need to grow a thicker skin or you won't make it in this game. All humans need validation - we do. But you gotta value yourself enough not to get upset when a guy doesn't respond. Also - what did you think you were going to his house for? A game of checkers? Of course your period matters. You told him you were on it as what - some test to see if he liked you enough to play checkers and eat popcorn? It's a date woman - you're not there to make platonic friends.",
            "author": "mudpiesnow",
            "id": "g6tufmh",
            "parent_id": "t1_g6tu07s",
            "score": -2,
            "created_utc": 1601203560.0,
            "replies": [
                {
                    "body": "No hunny, the fact that I messaged you was cause I like responding to drama cause I’m bored on this Sunday morning :) & I ACTUALLY AM ON MY PERIOD. So I’m even more irritable. You truly know nothing about me & your making stuff up to make yourself sound even better. Bore off :)",
                    "author": "wildride201",
                    "id": "g6tut56",
                    "parent_id": "t1_g6tufmh",
                    "score": 1,
                    "created_utc": 1601203723.0,
                    "replies": []
                },
                {
                    "body": "😄😄 Why did you say the first part? That was inside baseball.",
                    "author": null,
                    "id": "g6ud4hn",
                    "parent_id": "t1_g6tufmh",
                    "score": 1,
                    "created_utc": 1601210903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Real SDs start at 105",
            "author": null,
            "id": "g6pw8ed",
            "parent_id": "t1_g6pq21j",
            "score": 84,
            "created_utc": 1601151061.0,
            "replies": [
                {
                    "body": "Lmaooooo",
                    "author": "AlinaAllure",
                    "id": "g6q6qc1",
                    "parent_id": "t1_g6pw8ed",
                    "score": 6,
                    "created_utc": 1601154516.0,
                    "replies": []
                },
                {
                    "body": "Lol",
                    "author": "UnearthlyDinosaur",
                    "id": "g6qi2jc",
                    "parent_id": "t1_g6pw8ed",
                    "score": 4,
                    "created_utc": 1601158511.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It depends on what youre looking for TBH. Some girls are more concerned with being genuinely physically attracted to a guy and gag at the idea of being with someone twice their age and would rather get a smaller allowance if it means they dont have to mentally check out when theyre getting intimate.",
            "author": "ChadoWookie",
            "id": "g6rxvvz",
            "parent_id": "t1_g6pq21j",
            "score": 6,
            "created_utc": 1601177281.0,
            "replies": []
        },
        {
            "body": "You dont have to be older to have money and respect lmao",
            "author": "Lipstickluna97",
            "id": "g6pum07",
            "parent_id": "t1_g6pq21j",
            "score": 17,
            "created_utc": 1601150562.0,
            "replies": [
                {
                    "body": "Exactly. I found mine.",
                    "author": "ElementShow",
                    "id": "g6s3zdy",
                    "parent_id": "t1_g6pum07",
                    "score": 4,
                    "created_utc": 1601179379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6q31ko",
            "parent_id": "t1_g6pq21j",
            "score": 14,
            "created_utc": 1601153272.0,
            "replies": [
                {
                    "body": "I suspect the girls would rather deal with the occasional viagra delay than a younger guy not paying them.",
                    "author": "LotBuilder",
                    "id": "g6s2xbf",
                    "parent_id": "t1_g6q31ko",
                    "score": 11,
                    "created_utc": 1601178983.0,
                    "replies": [
                        {
                            "body": "Yeah no biggie, the delays just leave more time to hear about old SD’s wife or kids and how similar they are to the SB. \n\nThese are generalizations. Plenty of older SDs don’t have the issues I pointed out just like plenty of younger guys do pay. People here are making whatever point benefits their age group with zero facts either way",
                            "author": null,
                            "id": "g6w5q5n",
                            "parent_id": "t1_g6s2xbf",
                            "score": 1,
                            "created_utc": 1601244058.0,
                            "replies": [
                                {
                                    "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
                                    "author": "LotBuilder",
                                    "id": "g6w80v1",
                                    "parent_id": "t1_g6w5q5n",
                                    "score": 3,
                                    "created_utc": 1601245287.0,
                                    "replies": [
                                        {
                                            "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                                            "author": null,
                                            "id": "g6waawe",
                                            "parent_id": "t1_g6w80v1",
                                            "score": 1,
                                            "created_utc": 1601246482.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Says a 45 year old. Gotta think the best age is whatever “I” am\n\nThat's typically how it works, lol. Most guys on here are middle age, like me, and will tell you to go for middle aged guys. \n\nAs long as you protect yourself from getting taken advantage of, I don't see why it would be bad to sugar date a younger guy.",
                    "author": "denardos",
                    "id": "g6rl08u",
                    "parent_id": "t1_g6q31ko",
                    "score": 6,
                    "created_utc": 1601173044.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I disagree.  I started in the bowl at 32 but that was only because I was married and needed to be discreet.  Sugar dating was way less messy than having a vanilla relationship with a woman who was willing to be a side chick with no compensation and boundaries.   I turn a younger friend on to SA because he was in the same situation.",
            "author": "LotBuilder",
            "id": "g6s2q6c",
            "parent_id": "t1_g6pq21j",
            "score": 2,
            "created_utc": 1601178909.0,
            "replies": []
        },
        {
            "body": "Ah, that's my problem. I won't be 45 for 6 months. Can't wait...",
            "author": "wasabiflavoredpeas",
            "id": "g6zn6yd",
            "parent_id": "t1_g6pq21j",
            "score": 1,
            "created_utc": 1601323735.0,
            "replies": []
        },
        {
            "body": "How’d you know I’ve been on the site for a month? \n& I’ve been on dates with a 40, 47 & 60 year old. I have no problem with that type of age gap. I have a problem with choosing men who arent after the same thing as I am.",
            "author": "wildride201",
            "id": "g6q5t8x",
            "parent_id": "t1_g6q4og8",
            "score": 0,
            "created_utc": 1601154197.0,
            "replies": [
                {
                    "body": "How you know ?  Post history",
                    "author": "shamloo77",
                    "id": "g6q69i1",
                    "parent_id": "t1_g6q5t8x",
                    "score": 5,
                    "created_utc": 1601154356.0,
                    "replies": [
                        {
                            "body": "Ohhh yes I see. It’s been 2 months tho actually",
                            "author": "wildride201",
                            "id": "g6q6bt7",
                            "parent_id": "t1_g6q69i1",
                            "score": -2,
                            "created_utc": 1601154379.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How does it work? He doesn't bring up money and don't leave any envelope for you and  you don't say anything?",
            "author": "ilt1",
            "id": "g6upvj2",
            "parent_id": "t1_g6untez",
            "score": 1,
            "created_utc": 1601218224.0,
            "replies": [
                {
                    "body": "Not judging really curious",
                    "author": "ilt1",
                    "id": "g6uqdax",
                    "parent_id": "t1_g6upvj2",
                    "score": 1,
                    "created_utc": 1601218509.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6r0va9",
            "parent_id": "t1_g6qeojp",
            "score": -1,
            "created_utc": 1601165679.0,
            "replies": [
                {
                    "body": "Yes,  you are what they call an \"outlier\"!",
                    "author": "mrjimmyjsz",
                    "id": "g6r6n0r",
                    "parent_id": "t1_g6r0va9",
                    "score": 3,
                    "created_utc": 1601167757.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6ra4tz",
                            "parent_id": "t1_g6r6n0r",
                            "score": -1,
                            "created_utc": 1601169006.0,
                            "replies": [
                                {
                                    "body": "No need to get defensive about it.",
                                    "author": "pauly_jay",
                                    "id": "g6rgjc4",
                                    "parent_id": "t1_g6ra4tz",
                                    "score": 2,
                                    "created_utc": 1601171401.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wrong scenario.",
            "author": null,
            "id": "g6u5cbu",
            "parent_id": "t1_g6ty0ii",
            "score": 2,
            "created_utc": 1601208088.0,
            "replies": [
                {
                    "body": "I know. I was just teasing. But it did happen to me once upon a time, and completely caught me off guard because it was so organic in nature.",
                    "author": null,
                    "id": "g6uap91",
                    "parent_id": "t1_g6u5cbu",
                    "score": 1,
                    "created_utc": 1601210021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No hunny, the fact that I messaged you was cause I like responding to drama cause I’m bored on this Sunday morning :) & I ACTUALLY AM ON MY PERIOD. So I’m even more irritable. You truly know nothing about me & your making stuff up to make yourself sound even better. Bore off :)",
            "author": "wildride201",
            "id": "g6tut56",
            "parent_id": "t1_g6tufmh",
            "score": 1,
            "created_utc": 1601203723.0,
            "replies": []
        },
        {
            "body": "😄😄 Why did you say the first part? That was inside baseball.",
            "author": null,
            "id": "g6ud4hn",
            "parent_id": "t1_g6tufmh",
            "score": 1,
            "created_utc": 1601210903.0,
            "replies": []
        },
        {
            "body": "Lmaooooo",
            "author": "AlinaAllure",
            "id": "g6q6qc1",
            "parent_id": "t1_g6pw8ed",
            "score": 6,
            "created_utc": 1601154516.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": "UnearthlyDinosaur",
            "id": "g6qi2jc",
            "parent_id": "t1_g6pw8ed",
            "score": 4,
            "created_utc": 1601158511.0,
            "replies": []
        },
        {
            "body": "Exactly. I found mine.",
            "author": "ElementShow",
            "id": "g6s3zdy",
            "parent_id": "t1_g6pum07",
            "score": 4,
            "created_utc": 1601179379.0,
            "replies": []
        },
        {
            "body": "I suspect the girls would rather deal with the occasional viagra delay than a younger guy not paying them.",
            "author": "LotBuilder",
            "id": "g6s2xbf",
            "parent_id": "t1_g6q31ko",
            "score": 11,
            "created_utc": 1601178983.0,
            "replies": [
                {
                    "body": "Yeah no biggie, the delays just leave more time to hear about old SD’s wife or kids and how similar they are to the SB. \n\nThese are generalizations. Plenty of older SDs don’t have the issues I pointed out just like plenty of younger guys do pay. People here are making whatever point benefits their age group with zero facts either way",
                    "author": null,
                    "id": "g6w5q5n",
                    "parent_id": "t1_g6s2xbf",
                    "score": 1,
                    "created_utc": 1601244058.0,
                    "replies": [
                        {
                            "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
                            "author": "LotBuilder",
                            "id": "g6w80v1",
                            "parent_id": "t1_g6w5q5n",
                            "score": 3,
                            "created_utc": 1601245287.0,
                            "replies": [
                                {
                                    "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                                    "author": null,
                                    "id": "g6waawe",
                                    "parent_id": "t1_g6w80v1",
                                    "score": 1,
                                    "created_utc": 1601246482.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Says a 45 year old. Gotta think the best age is whatever “I” am\n\nThat's typically how it works, lol. Most guys on here are middle age, like me, and will tell you to go for middle aged guys. \n\nAs long as you protect yourself from getting taken advantage of, I don't see why it would be bad to sugar date a younger guy.",
            "author": "denardos",
            "id": "g6rl08u",
            "parent_id": "t1_g6q31ko",
            "score": 6,
            "created_utc": 1601173044.0,
            "replies": []
        },
        {
            "body": "How you know ?  Post history",
            "author": "shamloo77",
            "id": "g6q69i1",
            "parent_id": "t1_g6q5t8x",
            "score": 5,
            "created_utc": 1601154356.0,
            "replies": [
                {
                    "body": "Ohhh yes I see. It’s been 2 months tho actually",
                    "author": "wildride201",
                    "id": "g6q6bt7",
                    "parent_id": "t1_g6q69i1",
                    "score": -2,
                    "created_utc": 1601154379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not judging really curious",
            "author": "ilt1",
            "id": "g6uqdax",
            "parent_id": "t1_g6upvj2",
            "score": 1,
            "created_utc": 1601218509.0,
            "replies": []
        },
        {
            "body": "Yes,  you are what they call an \"outlier\"!",
            "author": "mrjimmyjsz",
            "id": "g6r6n0r",
            "parent_id": "t1_g6r0va9",
            "score": 3,
            "created_utc": 1601167757.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6ra4tz",
                    "parent_id": "t1_g6r6n0r",
                    "score": -1,
                    "created_utc": 1601169006.0,
                    "replies": [
                        {
                            "body": "No need to get defensive about it.",
                            "author": "pauly_jay",
                            "id": "g6rgjc4",
                            "parent_id": "t1_g6ra4tz",
                            "score": 2,
                            "created_utc": 1601171401.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know. I was just teasing. But it did happen to me once upon a time, and completely caught me off guard because it was so organic in nature.",
            "author": null,
            "id": "g6uap91",
            "parent_id": "t1_g6u5cbu",
            "score": 1,
            "created_utc": 1601210021.0,
            "replies": []
        },
        {
            "body": "Yeah no biggie, the delays just leave more time to hear about old SD’s wife or kids and how similar they are to the SB. \n\nThese are generalizations. Plenty of older SDs don’t have the issues I pointed out just like plenty of younger guys do pay. People here are making whatever point benefits their age group with zero facts either way",
            "author": null,
            "id": "g6w5q5n",
            "parent_id": "t1_g6s2xbf",
            "score": 1,
            "created_utc": 1601244058.0,
            "replies": [
                {
                    "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
                    "author": "LotBuilder",
                    "id": "g6w80v1",
                    "parent_id": "t1_g6w5q5n",
                    "score": 3,
                    "created_utc": 1601245287.0,
                    "replies": [
                        {
                            "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                            "author": null,
                            "id": "g6waawe",
                            "parent_id": "t1_g6w80v1",
                            "score": 1,
                            "created_utc": 1601246482.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ohhh yes I see. It’s been 2 months tho actually",
            "author": "wildride201",
            "id": "g6q6bt7",
            "parent_id": "t1_g6q69i1",
            "score": -2,
            "created_utc": 1601154379.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6ra4tz",
            "parent_id": "t1_g6r6n0r",
            "score": -1,
            "created_utc": 1601169006.0,
            "replies": [
                {
                    "body": "No need to get defensive about it.",
                    "author": "pauly_jay",
                    "id": "g6rgjc4",
                    "parent_id": "t1_g6ra4tz",
                    "score": 2,
                    "created_utc": 1601171401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would says it’s factual that a younger (<35), attractive SD that pays a consistent allowance in a long term arrangement (9+ months) is a bit of an outlier.   I was told that constantly when I entered the bowl in 2008 at the age of 30.   I was married and it was the best avenue to get what I wanted with the lowest amount of risk.\n\nI also know there have been some PUA forums that were coaching guys to use SA to get laid without paying allowance.",
            "author": "LotBuilder",
            "id": "g6w80v1",
            "parent_id": "t1_g6w5q5n",
            "score": 3,
            "created_utc": 1601245287.0,
            "replies": [
                {
                    "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
                    "author": null,
                    "id": "g6waawe",
                    "parent_id": "t1_g6w80v1",
                    "score": 1,
                    "created_utc": 1601246482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No need to get defensive about it.",
            "author": "pauly_jay",
            "id": "g6rgjc4",
            "parent_id": "t1_g6ra4tz",
            "score": 2,
            "created_utc": 1601171401.0,
            "replies": []
        },
        {
            "body": "I tend to agree with your 9+ month generalization, but we really don’t have facts about this other than rumors. WillIng to guess we hear far more about the fails than the successes when it comes to these things \n\nEven so, I don’t think being in an arrangement for 6 months with someone under thirty five is the equivalent of being “scammed” as this thread started out about. I think a lot of people would call that a perfectly acceptable amount of time for a sugar relationship. If you are looking for 2 years with a SD, yes I’ll agree, go older.",
            "author": null,
            "id": "g6waawe",
            "parent_id": "t1_g6w80v1",
            "score": 1,
            "created_utc": 1601246482.0,
            "replies": []
        }
    ]
}