{
    "title": "NYC POT who refuses to take the subway",
    "post_id": "9vkyhi",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9vkyhi/nyc_pot_who_refuses_to_take_the_subway/",
    "author": null,
    "body": "So just had a M&G with a girl from Brooklyn. She was cute and we have a lot in common. After we agreed to a meeting place in Midtown I mentioned it should be convenient to get to since it’s near a main subway hub. \n\nShe then says something to the effect “Wait, what?! You’re not going to send a car to pick me up?!”  I guess I was a little surprised since the subway would be twice as fast as driving from BK to Manhattan. Whatever, I offered to cover her Uber costs. Then she says “you don’t drive around in Manhattan? Is that preference or because you don’t have it like that?”  That comment annoyed me. I told her I Uber, subway, or walk depending on what’s faster and more convenient. Only a dummy would take a ride across town during certain times of the day. \n\nAs you can imagine the M&G sucked. After giving her an envelope to more than cover her Uber costs, she opened it to see how much! Then tells me this would cover the transportation but not for her time. I would have walked out right then but was really enjoying my fish entree!\n\nShe then starts this diatribe about how she deserves to be spoiled and says in this spaced out way “I’m Shaya”., like that changes anything. Yea I know who you are. So what?! \n\nOne of the weirdest M&G I’ve had. Just wanted to share. \n\n",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9vkyhi/nyc_pot_who_refuses_to_take_the_subway/",
    "score": 102,
    "upvote_ratio": 0.96,
    "created_utc": 1541774467.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9d0nch",
            "parent_id": "t3_9vkyhi",
            "score": 72,
            "created_utc": 1541775675.0,
            "replies": [
                {
                    "body": "Sounds like an instadomme. They think being bratty is cute. It ain't cute. ",
                    "author": "paradoxicalpersona",
                    "id": "e9e257w",
                    "parent_id": "t1_e9d0nch",
                    "score": 10,
                    "created_utc": 1541805905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn, that’s honestly weird to me. I live in Brooklyn and take the subway or bus everywhere. Most of the time for me it’s absolutely the quickest way from A to B over sitting in a car in Manhattan gridlock. Sometimes my SD likes getting me a car home when it’s really late, which is always appreciated, but every M&G I’ve taken public transport to, usually just requesting somewhere that’s convenient to whatever line I need to take back.\n\nEven though the MTA can be annoying with all the delays (I’ll see Andrew Cuomo in _hell_) I like that people from all socioeconomic strata take it, everyday. It’s not just a “poor person” thing? That comment would’ve irked me too, were I an SD.",
            "author": null,
            "id": "e9d2q9l",
            "parent_id": "t3_9vkyhi",
            "score": 23,
            "created_utc": 1541777479.0,
            "replies": []
        },
        {
            "body": "You guys are right. She isn’t a native NY’er. She moved here earlier this year. A “real” NY’er knows how to be efficient getting around the city. \n\nAnd yes I agree that when we’re dressed for a nice night out, an Uber is a given! \n\nI do feel a bit sad for her. With her attitude, she’s going to have a hard time adjusting. NYC doesn’t care when you state your name “I’m <name>” like you’re a celebrity. \n\nThere’s a difference between self-respect, confidence, knowing your worth versus being an entitled spoiled brat. ",
            "author": null,
            "id": "e9d3fal",
            "parent_id": "t3_9vkyhi",
            "score": 43,
            "created_utc": 1541778059.0,
            "replies": [
                {
                    "body": "Not defending her actions whatsoever, but keep in mind that there may be reasons for transportation preferences that have nothing to do with efficiency or time in transit. \n\nMaybe luxury is one of the reasons she's SB-ing, maybe it's one of her mandatories which is her prerogative, maybe she thinks if you don't have car service you don't truly have money. \n\nJust saying that those are more likely motives than just simply not understanding how to best get around NYC, so even if you respond rationally, that possibly may not translate.",
                    "author": "vshzzd",
                    "id": "e9dtpm0",
                    "parent_id": "t1_e9d3fal",
                    "score": 12,
                    "created_utc": 1541798707.0,
                    "replies": []
                },
                {
                    "body": "I think you can assume most 20-25 college-educated women on SA are not native NYCers.\n\nThe common scenario where an SB lives in BK, works in lower Manhattan and the SD lives in Upper Manhattan does pose some logistical issues.",
                    "author": "LesterBurnham212",
                    "id": "e9di6ve",
                    "parent_id": "t1_e9d3fal",
                    "score": 3,
                    "created_utc": 1541789769.0,
                    "replies": []
                },
                {
                    "body": "Where is she from? Was she super attractive? Also what does POT mean?",
                    "author": null,
                    "id": "e9d8rws",
                    "parent_id": "t1_e9d3fal",
                    "score": -7,
                    "created_utc": 1541782356.0,
                    "replies": [
                        {
                            "body": ">  Also what does POT mean?\n\nIf you have a look on the right hand side of this website you'll see a handy little box which gives a whole load of commonly used acronyms and terms.\n\n>**Commonly Used Acronyms / Terms**\n>\n>SA: SeekingArrangement\n>\n>SD: sugar daddy\n>\n>SB: sugar babe\n>\n>POT: Potential sugar partner\n>\n>SR: Sugar Relationship\n>\n>The Bowl: Sugar lifestyle / dating scene\n>\n>Arrangement: Negotiated relationship\n>\n>NSA: no strings attached\n>\n>FWB: friends with benefits",
                            "author": null,
                            "id": "e9dgxvq",
                            "parent_id": "t1_e9d8rws",
                            "score": 4,
                            "created_utc": 1541788769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A big purpose of a M&G is to assess chemistry,  spot red flags, and dodge bullets you didn't see coming in profiles/text communications. To that end, well done job in dodging this bullet. As a former New Yorker, it sounds like she doesn't have a great grip on reality. I'd rather swim in the Gowanus Canal than suffer through sitting in a car in traffic when the Subway will get you anywhere 20x faster (and with much less carbon footprint).",
            "author": "Cledaddy23",
            "id": "e9d8pcv",
            "parent_id": "t3_9vkyhi",
            "score": 17,
            "created_utc": 1541782298.0,
            "replies": []
        },
        {
            "body": "She sounds really awful!!!! Taking the subway is the norm, even for the wealthy unless they are just showing off. I'd prefer a rich man who took the subway instead of wasting money on cars because he thinks he's too precious to do something much faster/more efficient.",
            "author": null,
            "id": "e9d2rox",
            "parent_id": "t3_9vkyhi",
            "score": 15,
            "created_utc": 1541777513.0,
            "replies": [
                {
                    "body": "But she's SHAYA",
                    "author": null,
                    "id": "e9d482j",
                    "parent_id": "t1_e9d2rox",
                    "score": 27,
                    "created_utc": 1541778718.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e9e1arg",
                    "parent_id": "t1_e9d2rox",
                    "score": 2,
                    "created_utc": 1541805095.0,
                    "replies": [
                        {
                            "body": "I employ sales people in NYC, and don’t really care about the cost, but I find that reps who take cabs everywhere (or assume I will want to take a cab everywhere when I’m with them) sell less. I think part of it is time efficiency, but part of it is hustle and personality. \n\nI haven’t made it a hiring/firing issue but I may in the future. ",
                            "author": "allmyblackclothes",
                            "id": "e9egbf0",
                            "parent_id": "t1_e9e1arg",
                            "score": 2,
                            "created_utc": 1541820531.0,
                            "replies": []
                        },
                        {
                            "body": "Oh yeah. I have no problem with people who love luxury, but only taking cars in NYC is ridiculous. ",
                            "author": null,
                            "id": "e9eijm7",
                            "parent_id": "t1_e9e1arg",
                            "score": 2,
                            "created_utc": 1541823046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean... she clearly thought she was Heaven sent. Many people are like that. I've met \"SDs\" who think just because they pay they are allowed to treat people (SBs and waiters/waitresses) like crap. \nGood thing she did that on the M&G and not right before getting to business. Maybe she was expecting a limo or something 😂😂",
            "author": "MissCottonCandyBunny",
            "id": "e9dq6gk",
            "parent_id": "t3_9vkyhi",
            "score": 11,
            "created_utc": 1541795926.0,
            "replies": [
                {
                    "body": "Earthbound vehicles are for plebs. I insist on traveling by jetpack. I've gotten good enough at it that I can do fellatio at the same time. I'm hoping to become a sports mascot soon.",
                    "author": null,
                    "id": "e9ffznd",
                    "parent_id": "t1_e9dq6gk",
                    "score": 5,
                    "created_utc": 1541870234.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How old was this girl",
            "author": "dade_murphy1",
            "id": "e9dh00c",
            "parent_id": "t3_9vkyhi",
            "score": 9,
            "created_utc": 1541788817.0,
            "replies": [
                {
                    "body": "19",
                    "author": null,
                    "id": "e9dilh8",
                    "parent_id": "t1_e9dh00c",
                    "score": 0,
                    "created_utc": 1541790087.0,
                    "replies": [
                        {
                            "body": "Dont meetup with anybody in their teens. ",
                            "author": "dade_murphy1",
                            "id": "e9diobe",
                            "parent_id": "t1_e9dilh8",
                            "score": 25,
                            "created_utc": 1541790147.0,
                            "replies": [
                                {
                                    "body": ">Dont meetup with anybody in their teens.\n\nyup!",
                                    "author": "TooOldForSD",
                                    "id": "e9edzf2",
                                    "parent_id": "t1_e9diobe",
                                    "score": 7,
                                    "created_utc": 1541818075.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If she’s going to make the effort to see you and dress up, the very least you could do is make sure she gets there comfortably. A good S.D. knows that while the subway could be faster, it’s dirty, not nearly as comfortable, and doesn’t speak well on how much effort the S.D. is willing to put in if he prioritizes a $30 Uber charge over making sure you get there without your feet hurting from heels and from the annoyance of rush hour. I understand her disdain of the subway, I mean she could just date vanilla if she wanted to be balked at for requesting a simple ride. I know that while the subway may be quicker at times, it comes with an opportunity cost. More stress, far less comfort, constant delays, etc. Don’t be cheap with your courtesy towards your SB if you don’t want her to be cheap with you. The way she asked was tactless and rude and her attitude after fucked herself over and that’s her own issue and immaturity, but her main point was def correct.",
            "author": "RussianAsshole",
            "id": "e9ei9js",
            "parent_id": "t3_9vkyhi",
            "score": 11,
            "created_utc": 1541822702.0,
            "replies": [
                {
                    "body": "Sorry but you’re presuming things about me that aren’t true.\n\nWhere did I say I was put out or too cheap to pay for her ride? I was just surprised that someone would prefer that option. \n\nIf her personality was otherwise pleasant and rational, I wouldn’t have given a 2nd thought to the ride preference. I was just annoyed at her comment that implies if you have money, you always take a car service, which is ridiculous. And her other comments at the M&G followed the same vein. \n\nI guess we can debate the “real” NY’er business, but the fact that you’re still grossed out by the dirtiness of NYC subways already answers that question.  ",
                    "author": null,
                    "id": "e9en06a",
                    "parent_id": "t1_e9ei9js",
                    "score": 2,
                    "created_utc": 1541828865.0,
                    "replies": [
                        {
                            "body": "I don’t think you’re really surprised that in a city with a few million people and a gross subway system, that a young, beautiful girl would prefer a private car ride to see you in an arrangement where she wants a higher standard of dating and doesn’t date vanilla for a reason. Ahhhh, but otherwise, yeah her attitude was piss poor and she should’ve just asked for an Uber politely instead of being an ass about it. The way she asked was awful but I don’t think her asking for it in and of itself is that surprisingly. \n\n\nHey if you wanna get into a pissing contest with yourself over how dangerous the subway is for young women like myself and other SB’s and how disgusting it is despite myself living here and getting desensitized to it, go right ahead. If you think it makes you cool that you’re okay with how dirty and unkempt the subway is while it reeks of piss and some crazy homeless people...yikes ",
                            "author": "RussianAsshole",
                            "id": "e9envcm",
                            "parent_id": "t1_e9en06a",
                            "score": 5,
                            "created_utc": 1541830220.0,
                            "replies": [
                                {
                                    "body": "I guess we’ll just agree to disagree. I don’t see how age or physical appearance are related to riding the subway. \n\nNor do I feel that a higher socio-economic status in life, all of a sudden makes the subway undesirable. \n\nI’m able to de-couple those aspects. If you can’t, that’s fine too. We just see things differently. 😀",
                                    "author": null,
                                    "id": "e9exvh4",
                                    "parent_id": "t1_e9envcm",
                                    "score": 2,
                                    "created_utc": 1541849832.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lol “beautiful young girl”. That doesn’t make her special. She is just like everyone else. Doesn’t matter how she looks or dresses herself. The subway is not dangerous for anyone. If you girls think you are so much better than others maybe you should pay for a Uber yourself 😂😂😂\n\nSPOILT",
                                    "author": "BarbieDontWantYouHoe",
                                    "id": "eb0th4f",
                                    "parent_id": "t1_e9envcm",
                                    "score": 1,
                                    "created_utc": 1543868534.0,
                                    "replies": [
                                        {
                                            "body": "Clearly it does make her special because that’s what gives her societal privileges that average or ugly women do not have access to. What a load of bullshit, SDs pick their next victim with their eyes first and foremost, clearly her looks matter or else the men on SA would not give her the time of day. Shit goes down on the subway all the time with sketchy people and you’re not gonna tell me my experiences are false because of your weird complex against women’s experiences. Somehow I’m not surprised at the nonsense men spew in this sub anymore. As if you could afford to spoil anyone with your broke ass mentality. Of course you’re suggesting they pay for it, brokie. Anything to not have to hold up your end of the deal.",
                                            "author": "RussianAsshole",
                                            "id": "eb15omt",
                                            "parent_id": "t1_eb0th4f",
                                            "score": 1,
                                            "created_utc": 1543877190.0,
                                            "replies": [
                                                {
                                                    "body": "No it doesn’t lol. Only to horny men who don’t really matter in the grand scheme of things. Not to intelligent men or other women. Especially other women lol. Stop putting pretty girls on a pedestal. That’s why so many men are going MGTOW. Women are not worth spoiling like that by default 😂",
                                                    "author": "BarbieDontWantYouHoe",
                                                    "id": "eb1830j",
                                                    "parent_id": "t1_eb15omt",
                                                    "score": 1,
                                                    "created_utc": 1543879178.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I like to think of the M&G as a mutually beneficial introduction.  Both sides are investing their time and effort.   I always offer to meet someplace convenient for the SB.  I can take a subway to south Manhattan or Brooklyn if the ride is long for her.\n\nWhat I don't put up with is a SB that insists I send them an Uber for the M&G.  I had a SB who said she lived in Long Island City.  Refused to take the subway ride into midtown to meet me.  Said I will only come if you send me an Uber because the subway ride is too much trouble.  Really ?  Long Island City to mid town subway is what ?  1 or 2  stops and 5 or 10 minutes ?\n\nThe issue is the not the cost of the Uber.  It is how people ask and the diva entitlement attitude that is a turnoff.\n\nI like to spoil my women, but if the POT is displaying diva attitude before the M&G she does not need a SD to spoil her, she is already spoiled and more spoiling will make her rotten.\n\n&#x200B;",
                    "author": "edgesd",
                    "id": "e9ek7kn",
                    "parent_id": "t1_e9ei9js",
                    "score": 1,
                    "created_utc": 1541825085.0,
                    "replies": [
                        {
                            "body": "> What I don't put up with is a SB that insists I send them an Uber for the M&G. \n\nThis right here betrays everything else you’ve said. I don’t know if by “insisting” you mean has a shitty attitude about, in which case that’s very reasonable, but if not.....if her comfort and making sure she’s in a less stressful headspace when she sees you isn’t important to you in addition to all of the money that she spent on her hair, nails, etc to go on that date that you’re certainly not reimbursing her for, she needs to find better. Yes, it’s only a stop or two, but sending an Uber would make her trip go far more smoothly, less chance of delays, etc. if you have to make a big deal out of her wanting to feel more comfortable and like she’s not just wasting her time on someone who feels the need to debate why she should take the subway instead of just being a courteous provider like a good S.D. should be......you’re in the wrong place. SBs want a better lifestyle than they would get with vanilla. What’s even the point then?",
                            "author": "RussianAsshole",
                            "id": "e9eno2b",
                            "parent_id": "t1_e9ek7kn",
                            "score": 3,
                            "created_utc": 1541829888.0,
                            "replies": [
                                {
                                    "body": "Insisting is when they are not willing to compromise.  You are in NYC.  You know Long Island City subway across the river to Manhattan doesn't get much smoother or convenient than that.\n\nI am talking about the M&G, not a date.  Almost all SB are appreciative when I suggest meeting someplace in the middle or close to them.  Many offer to meet close to me.  The divas are the ones who want everything to be about them and only care about themselves.   I spoil SB's that appreciate being spoiled, vs the diva SB that demands and insists to be spoiled when we have not even met yet.\n\nLet's keep this respectful.  We have a difference in opinion.  I am definitely not in the wrong place.  I assume you are successful sugaring.  So am I.   NYC has thousands of attractive SB's.  ",
                                    "author": "edgesd",
                                    "id": "e9eoikx",
                                    "parent_id": "t1_e9eno2b",
                                    "score": 1,
                                    "created_utc": 1541831277.0,
                                    "replies": [
                                        {
                                            "body": "The vibe I'm getting is more findom than SB. ",
                                            "author": null,
                                            "id": "e9ew1jy",
                                            "parent_id": "t1_e9eoikx",
                                            "score": -1,
                                            "created_utc": 1541846046.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I live in NYC and get these kinds of requests all the time from pot SBs located more than an hour a way.  They're asking for a $100+ uber each way.  I always next them after the request.",
            "author": "mike_o212",
            "id": "e9dkvhl",
            "parent_id": "t3_9vkyhi",
            "score": 5,
            "created_utc": 1541791837.0,
            "replies": []
        },
        {
            "body": "I understand her mentality about not taking public transport as a choice of preference. I’d rather fucking stab myself than take the subway in NYC in the summer wearing a suit again — which is why I have my own car in the city. The way she went about it though was pretentious but I don’t think it’s necessarily wrong for her to think or expect an SD to send a car for her or pick her up. I always do but that’s bc I wouldn’t want them to go through hell with the city’s garbage transport before our date. ",
            "author": null,
            "id": "e9e5vc3",
            "parent_id": "t3_9vkyhi",
            "score": 5,
            "created_utc": 1541809622.0,
            "replies": [
                {
                    "body": "That’s true. Subways in the summer suck! \n\nI don’t think it’s wrong which is why I covered the Uber, even if that wouldn’t be my first choice. \n\nBut when it comes to human interaction and chemistry, especially in the context of a potential arrangement, how someone “goes about things” can be very revealing. \n\n",
                    "author": null,
                    "id": "e9e6jlb",
                    "parent_id": "t1_e9e5vc3",
                    "score": 3,
                    "created_utc": 1541810314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess she is young and new to NYC ?  Many of the SB that are still in college are like this.  They do not have any life experience answering to a boss or trying to support themselves.  They live in their little cocoon oblivious to the fact there are thousands of attractive SB in the city.\n\nYes, a real SD will spoil his SB, but a real SB will spoil the SD as well.  It goes both ways in healthy relationships.",
            "author": "edgesd",
            "id": "e9d18ls",
            "parent_id": "t3_9vkyhi",
            "score": 19,
            "created_utc": 1541776200.0,
            "replies": []
        },
        {
            "body": "There are a ton of weirdos in NYC. You just met one.",
            "author": null,
            "id": "e9d0etr",
            "parent_id": "t3_9vkyhi",
            "score": 14,
            "created_utc": 1541775462.0,
            "replies": []
        },
        {
            "body": "Driving in NYC is insane - The bridge tolls can be more than the price of an Uber ride.  She probably took the subway home.  ",
            "author": "HappyBear1952",
            "id": "e9d70q2",
            "parent_id": "t3_9vkyhi",
            "score": 5,
            "created_utc": 1541780953.0,
            "replies": []
        },
        {
            "body": "Omg she's a brat. I'm from Cali and I know that it's easier to take public transportation than drive. \n\nPeople like her make it hard for actual SBs. Even newbies know that we don't get paid for m&gs unless it's to cover transportation. \n\nYou better off with out her.",
            "author": "cookingstephen",
            "id": "e9dqhzb",
            "parent_id": "t3_9vkyhi",
            "score": 5,
            "created_utc": 1541796174.0,
            "replies": []
        },
        {
            "body": "omg \"I'm Shaya.\" Dead.",
            "author": "Petits_Fours",
            "id": "e9do0ec",
            "parent_id": "t3_9vkyhi",
            "score": 5,
            "created_utc": 1541794226.0,
            "replies": [
                {
                    "body": "Right?? \"Seeya, Shaya!\"",
                    "author": "Cledaddy23",
                    "id": "e9dyubf",
                    "parent_id": "t1_e9do0ec",
                    "score": 2,
                    "created_utc": 1541802903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's Manhattan... the subway is definitely much better for so many routes. This chick needs a reality check. Jeeeze... Sorry you had that experience, but at least the fish was good? :D ",
            "author": "lafemmeisobel",
            "id": "e9dv3b5",
            "parent_id": "t3_9vkyhi",
            "score": 3,
            "created_utc": 1541799808.0,
            "replies": []
        },
        {
            "body": "new yawk",
            "author": "doctorcoolpop",
            "id": "e9eco1m",
            "parent_id": "t3_9vkyhi",
            "score": 3,
            "created_utc": 1541816747.0,
            "replies": []
        },
        {
            "body": "to be fair, i can’t say i don’t empathize with her at all. i still take it sometimes, but there are plenty of times when i try to avoid the subway now. (sometimes when i do take it, it’s super crowded, and then i’m just miserable... surrounded by other miserable people. so yeah.) i liked the subway a lot more 5 to 10 years ago :(.\n\nbut... i partly chose my living location to avoid the subway as much as possible lol (location-wise, it was a trifecta of food, avoiding the subway, and convenience to the gym)\n\nand i know some people who stick to uber/lyft going to or from work haha",
            "author": "sugarfatty",
            "id": "e9dm0c7",
            "parent_id": "t3_9vkyhi",
            "score": 5,
            "created_utc": 1541792696.0,
            "replies": [
                {
                    "body": "Yeah, I don’t get how some of the people here think that reflects badly on her. He knew what this arrangement was. If you’re that cheap, please don’t waste any more of her time.",
                    "author": "RussianAsshole",
                    "id": "e9eigo4",
                    "parent_id": "t1_e9dm0c7",
                    "score": 2,
                    "created_utc": 1541822946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If I were in your shoes.....\n\n&#x200B;\n\nHer: \"But I'm Shaya\"\n\nMe:  \"oh, ok Shaya........Goodbye Ya\"",
            "author": "edgesd",
            "id": "e9dcpzx",
            "parent_id": "t3_9vkyhi",
            "score": 7,
            "created_utc": 1541785436.0,
            "replies": [
                {
                    "body": "\"I shaya, I didn't like ya\"",
                    "author": null,
                    "id": "e9dlzj5",
                    "parent_id": "t1_e9dcpzx",
                    "score": 0,
                    "created_utc": 1541792680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s wild behavior. Sorry you had that experience. ",
            "author": null,
            "id": "e9elbv6",
            "parent_id": "t3_9vkyhi",
            "score": 2,
            "created_utc": 1541826515.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9d21pm",
            "parent_id": "t3_9vkyhi",
            "score": 2,
            "created_utc": 1541776897.0,
            "replies": [
                {
                    "body": "Why do you have an SB from Queens? Is she Asian?\n\nSeems like NNJ is one of the better areas for college girls in the Tri-State area.",
                    "author": "LesterBurnham212",
                    "id": "e9dichf",
                    "parent_id": "t1_e9d21pm",
                    "score": -6,
                    "created_utc": 1541789894.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e9djfxf",
                            "parent_id": "t1_e9dichf",
                            "score": -1,
                            "created_utc": 1541790755.0,
                            "replies": [
                                {
                                    "body": "I would look harder in NNJ. Queens to NJ is going to get old really fast.",
                                    "author": "LesterBurnham212",
                                    "id": "e9dn6yc",
                                    "parent_id": "t1_e9djfxf",
                                    "score": -3,
                                    "created_utc": 1541793594.0,
                                    "replies": [
                                        {
                                            "body": "Or he could just get her an Uber so he doesn’t have to drive and it would be a non issue, but it’s easier to complain than go through a simple solution ",
                                            "author": "RussianAsshole",
                                            "id": "e9eikb9",
                                            "parent_id": "t1_e9dn6yc",
                                            "score": 2,
                                            "created_utc": 1541823069.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm a SB in NNJ.",
                                    "author": "Kaykay2500",
                                    "id": "e9dtrft",
                                    "parent_id": "t1_e9djfxf",
                                    "score": -1,
                                    "created_utc": 1541798748.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just walk out and you deserve much better SB then this, all SD does, best of luck! ",
            "author": null,
            "id": "e9d3x5f",
            "parent_id": "t3_9vkyhi",
            "score": 3,
            "created_utc": 1541778464.0,
            "replies": []
        },
        {
            "body": "I can afford to have a full-time private driver take me everywhere in NYC (I live in BK). I still take the subway 75%+ of the time, because it's so much faster. Even with the fucking delays these days.\n\nBut ask me again after the L Train shuts down next April... I might just move to my house in Marin permanently until the work is done, ha.",
            "author": "curiousgenerous",
            "id": "e9djq1w",
            "parent_id": "t3_9vkyhi",
            "score": 0,
            "created_utc": 1541790963.0,
            "replies": []
        },
        {
            "body": "Shoulda just focused on the fish and ditched Shaya. Yeah, I live in a not-NYC city where public transportation is quite frequently the easiest/quickest option (often by far), and it boggles my mind that so many ladies turn their noses up at it. Hmmmm...15 minute/$3 subway ride that gets you right to the restaurant? Or 45 minutes sitting in traffic in an Uber for $45? Choices, choices...",
            "author": "OlderSD",
            "id": "e9k0aom",
            "parent_id": "t3_9vkyhi",
            "score": 1,
            "created_utc": 1542034734.0,
            "replies": []
        },
        {
            "body": "Why did you even meet her?!\n\nShould dropped her as soon as she demanded you to send a car to pick her up. Crazy high maintenance",
            "author": "Mangasbzo7",
            "id": "edytb7i",
            "parent_id": "t3_9vkyhi",
            "score": 1,
            "created_utc": 1547376743.0,
            "replies": []
        },
        {
            "body": "Honestly I have NO CLUE where girls get that type of entitlement! Shit I've been a mother since 16 .. broke as fuck been times I wondered what am I gonna do for this week's lunchs at school I'm stressed and fucking tired I have zero sense of entitlement but I think people in my Sitch could use being spoiled for a minute and appreciate the fuck out if it , and we've got woman out there demanding they be spoiled for simply being on earth? Gto ",
            "author": "Ry_lee77",
            "id": "e9eazdt",
            "parent_id": "t3_9vkyhi",
            "score": 1,
            "created_utc": 1541814974.0,
            "replies": []
        },
        {
            "body": "Simple take away is don't eat at a M&G.  Meet for a quick drink and leave yourself an out.",
            "author": "ThisIsTheSugarDaddy",
            "id": "e9df8k2",
            "parent_id": "t3_9vkyhi",
            "score": 0,
            "created_utc": 1541787425.0,
            "replies": [
                {
                    "body": "True. I was starving and needed to eat lunch anyway. ",
                    "author": null,
                    "id": "e9dge99",
                    "parent_id": "t1_e9df8k2",
                    "score": 2,
                    "created_utc": 1541788340.0,
                    "replies": []
                },
                {
                    "body": "To me: just don't eat at any first date, either sugar or vanilla. I've subconsciously  been following that advice before hearing it from a relationship coach years ago and it has worked like magic to weed out the jerks. ",
                    "author": "MissCottonCandyBunny",
                    "id": "e9dqfwo",
                    "parent_id": "t1_e9df8k2",
                    "score": 1,
                    "created_utc": 1541796127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9dfdaa",
            "parent_id": "t3_9vkyhi",
            "score": -1,
            "created_utc": 1541787527.0,
            "replies": [
                {
                    "body": "I think you’re right. I just try to be extra accommodating in the beginning since she might be nervous or anxious. ",
                    "author": null,
                    "id": "e9dgikn",
                    "parent_id": "t1_e9dfdaa",
                    "score": 0,
                    "created_utc": 1541788435.0,
                    "replies": []
                },
                {
                    "body": "I loved BART when I lived there.  Pleasanton to Downtown is such an easy ride.  It was always great to take the BART downtown on a date, eat at a nice place, have some wine, enjoy SF, and then take the BART home.  Relaxing, cozy, snuggly hour ride back as time to sober up for the short jaunt home and more activities.\n\nMy first ever experience with mass transit was MARTA in Atlanta.  My first day there I drove downtown from my hotel and it took me over an hour and cost $25 to park.  I took the MARTA the next day and it took 12 minutes and cost $2.  Easy choice. DC METRO is banner, too.",
                    "author": null,
                    "id": "e9dja7z",
                    "parent_id": "t1_e9dfdaa",
                    "score": 0,
                    "created_utc": 1541790632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SBs under estimate how important it is for them to have at least some basic common sense versus project themselves to be utterly clueless and make inappropriate comments like this one did. Anyways, she is an extremely well qualified candidate to get nexted. \n\nI see a few issues here. First everyone rides the subway in mega cities like NY or London or Paris. Second, I can’t understand the sense of entitlement on her part. Just mind boggling.",
            "author": null,
            "id": "e9dvz8d",
            "parent_id": "t3_9vkyhi",
            "score": 0,
            "created_utc": 1541800517.0,
            "replies": []
        },
        {
            "body": "To be fair,she is a princess and you must spoil and pamper your princess. A subway trip is too pedestrian.",
            "author": "vdzz000",
            "id": "e9dy7ey",
            "parent_id": "t3_9vkyhi",
            "score": 0,
            "created_utc": 1541802375.0,
            "replies": []
        },
        {
            "body": "Its not an uncommon experience unfortunately. I have a chauffeur (though I find it practical to sometimes use public transport) and I've had at least 1 POT feel that they were entitled to be picked up/dropped for the M&G. ",
            "author": "Dean_46",
            "id": "e9ehgn5",
            "parent_id": "t3_9vkyhi",
            "score": -1,
            "created_utc": 1541821781.0,
            "replies": []
        },
        {
            "body": "Sounds like an instadomme. They think being bratty is cute. It ain't cute. ",
            "author": "paradoxicalpersona",
            "id": "e9e257w",
            "parent_id": "t1_e9d0nch",
            "score": 10,
            "created_utc": 1541805905.0,
            "replies": []
        },
        {
            "body": "Not defending her actions whatsoever, but keep in mind that there may be reasons for transportation preferences that have nothing to do with efficiency or time in transit. \n\nMaybe luxury is one of the reasons she's SB-ing, maybe it's one of her mandatories which is her prerogative, maybe she thinks if you don't have car service you don't truly have money. \n\nJust saying that those are more likely motives than just simply not understanding how to best get around NYC, so even if you respond rationally, that possibly may not translate.",
            "author": "vshzzd",
            "id": "e9dtpm0",
            "parent_id": "t1_e9d3fal",
            "score": 12,
            "created_utc": 1541798707.0,
            "replies": []
        },
        {
            "body": "I think you can assume most 20-25 college-educated women on SA are not native NYCers.\n\nThe common scenario where an SB lives in BK, works in lower Manhattan and the SD lives in Upper Manhattan does pose some logistical issues.",
            "author": "LesterBurnham212",
            "id": "e9di6ve",
            "parent_id": "t1_e9d3fal",
            "score": 3,
            "created_utc": 1541789769.0,
            "replies": []
        },
        {
            "body": "Where is she from? Was she super attractive? Also what does POT mean?",
            "author": null,
            "id": "e9d8rws",
            "parent_id": "t1_e9d3fal",
            "score": -7,
            "created_utc": 1541782356.0,
            "replies": [
                {
                    "body": ">  Also what does POT mean?\n\nIf you have a look on the right hand side of this website you'll see a handy little box which gives a whole load of commonly used acronyms and terms.\n\n>**Commonly Used Acronyms / Terms**\n>\n>SA: SeekingArrangement\n>\n>SD: sugar daddy\n>\n>SB: sugar babe\n>\n>POT: Potential sugar partner\n>\n>SR: Sugar Relationship\n>\n>The Bowl: Sugar lifestyle / dating scene\n>\n>Arrangement: Negotiated relationship\n>\n>NSA: no strings attached\n>\n>FWB: friends with benefits",
                    "author": null,
                    "id": "e9dgxvq",
                    "parent_id": "t1_e9d8rws",
                    "score": 4,
                    "created_utc": 1541788769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But she's SHAYA",
            "author": null,
            "id": "e9d482j",
            "parent_id": "t1_e9d2rox",
            "score": 27,
            "created_utc": 1541778718.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9e1arg",
            "parent_id": "t1_e9d2rox",
            "score": 2,
            "created_utc": 1541805095.0,
            "replies": [
                {
                    "body": "I employ sales people in NYC, and don’t really care about the cost, but I find that reps who take cabs everywhere (or assume I will want to take a cab everywhere when I’m with them) sell less. I think part of it is time efficiency, but part of it is hustle and personality. \n\nI haven’t made it a hiring/firing issue but I may in the future. ",
                    "author": "allmyblackclothes",
                    "id": "e9egbf0",
                    "parent_id": "t1_e9e1arg",
                    "score": 2,
                    "created_utc": 1541820531.0,
                    "replies": []
                },
                {
                    "body": "Oh yeah. I have no problem with people who love luxury, but only taking cars in NYC is ridiculous. ",
                    "author": null,
                    "id": "e9eijm7",
                    "parent_id": "t1_e9e1arg",
                    "score": 2,
                    "created_utc": 1541823046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Earthbound vehicles are for plebs. I insist on traveling by jetpack. I've gotten good enough at it that I can do fellatio at the same time. I'm hoping to become a sports mascot soon.",
            "author": null,
            "id": "e9ffznd",
            "parent_id": "t1_e9dq6gk",
            "score": 5,
            "created_utc": 1541870234.0,
            "replies": []
        },
        {
            "body": "19",
            "author": null,
            "id": "e9dilh8",
            "parent_id": "t1_e9dh00c",
            "score": 0,
            "created_utc": 1541790087.0,
            "replies": [
                {
                    "body": "Dont meetup with anybody in their teens. ",
                    "author": "dade_murphy1",
                    "id": "e9diobe",
                    "parent_id": "t1_e9dilh8",
                    "score": 25,
                    "created_utc": 1541790147.0,
                    "replies": [
                        {
                            "body": ">Dont meetup with anybody in their teens.\n\nyup!",
                            "author": "TooOldForSD",
                            "id": "e9edzf2",
                            "parent_id": "t1_e9diobe",
                            "score": 7,
                            "created_utc": 1541818075.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry but you’re presuming things about me that aren’t true.\n\nWhere did I say I was put out or too cheap to pay for her ride? I was just surprised that someone would prefer that option. \n\nIf her personality was otherwise pleasant and rational, I wouldn’t have given a 2nd thought to the ride preference. I was just annoyed at her comment that implies if you have money, you always take a car service, which is ridiculous. And her other comments at the M&G followed the same vein. \n\nI guess we can debate the “real” NY’er business, but the fact that you’re still grossed out by the dirtiness of NYC subways already answers that question.  ",
            "author": null,
            "id": "e9en06a",
            "parent_id": "t1_e9ei9js",
            "score": 2,
            "created_utc": 1541828865.0,
            "replies": [
                {
                    "body": "I don’t think you’re really surprised that in a city with a few million people and a gross subway system, that a young, beautiful girl would prefer a private car ride to see you in an arrangement where she wants a higher standard of dating and doesn’t date vanilla for a reason. Ahhhh, but otherwise, yeah her attitude was piss poor and she should’ve just asked for an Uber politely instead of being an ass about it. The way she asked was awful but I don’t think her asking for it in and of itself is that surprisingly. \n\n\nHey if you wanna get into a pissing contest with yourself over how dangerous the subway is for young women like myself and other SB’s and how disgusting it is despite myself living here and getting desensitized to it, go right ahead. If you think it makes you cool that you’re okay with how dirty and unkempt the subway is while it reeks of piss and some crazy homeless people...yikes ",
                    "author": "RussianAsshole",
                    "id": "e9envcm",
                    "parent_id": "t1_e9en06a",
                    "score": 5,
                    "created_utc": 1541830220.0,
                    "replies": [
                        {
                            "body": "I guess we’ll just agree to disagree. I don’t see how age or physical appearance are related to riding the subway. \n\nNor do I feel that a higher socio-economic status in life, all of a sudden makes the subway undesirable. \n\nI’m able to de-couple those aspects. If you can’t, that’s fine too. We just see things differently. 😀",
                            "author": null,
                            "id": "e9exvh4",
                            "parent_id": "t1_e9envcm",
                            "score": 2,
                            "created_utc": 1541849832.0,
                            "replies": []
                        },
                        {
                            "body": "Lol “beautiful young girl”. That doesn’t make her special. She is just like everyone else. Doesn’t matter how she looks or dresses herself. The subway is not dangerous for anyone. If you girls think you are so much better than others maybe you should pay for a Uber yourself 😂😂😂\n\nSPOILT",
                            "author": "BarbieDontWantYouHoe",
                            "id": "eb0th4f",
                            "parent_id": "t1_e9envcm",
                            "score": 1,
                            "created_utc": 1543868534.0,
                            "replies": [
                                {
                                    "body": "Clearly it does make her special because that’s what gives her societal privileges that average or ugly women do not have access to. What a load of bullshit, SDs pick their next victim with their eyes first and foremost, clearly her looks matter or else the men on SA would not give her the time of day. Shit goes down on the subway all the time with sketchy people and you’re not gonna tell me my experiences are false because of your weird complex against women’s experiences. Somehow I’m not surprised at the nonsense men spew in this sub anymore. As if you could afford to spoil anyone with your broke ass mentality. Of course you’re suggesting they pay for it, brokie. Anything to not have to hold up your end of the deal.",
                                    "author": "RussianAsshole",
                                    "id": "eb15omt",
                                    "parent_id": "t1_eb0th4f",
                                    "score": 1,
                                    "created_utc": 1543877190.0,
                                    "replies": [
                                        {
                                            "body": "No it doesn’t lol. Only to horny men who don’t really matter in the grand scheme of things. Not to intelligent men or other women. Especially other women lol. Stop putting pretty girls on a pedestal. That’s why so many men are going MGTOW. Women are not worth spoiling like that by default 😂",
                                            "author": "BarbieDontWantYouHoe",
                                            "id": "eb1830j",
                                            "parent_id": "t1_eb15omt",
                                            "score": 1,
                                            "created_utc": 1543879178.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like to think of the M&G as a mutually beneficial introduction.  Both sides are investing their time and effort.   I always offer to meet someplace convenient for the SB.  I can take a subway to south Manhattan or Brooklyn if the ride is long for her.\n\nWhat I don't put up with is a SB that insists I send them an Uber for the M&G.  I had a SB who said she lived in Long Island City.  Refused to take the subway ride into midtown to meet me.  Said I will only come if you send me an Uber because the subway ride is too much trouble.  Really ?  Long Island City to mid town subway is what ?  1 or 2  stops and 5 or 10 minutes ?\n\nThe issue is the not the cost of the Uber.  It is how people ask and the diva entitlement attitude that is a turnoff.\n\nI like to spoil my women, but if the POT is displaying diva attitude before the M&G she does not need a SD to spoil her, she is already spoiled and more spoiling will make her rotten.\n\n&#x200B;",
            "author": "edgesd",
            "id": "e9ek7kn",
            "parent_id": "t1_e9ei9js",
            "score": 1,
            "created_utc": 1541825085.0,
            "replies": [
                {
                    "body": "> What I don't put up with is a SB that insists I send them an Uber for the M&G. \n\nThis right here betrays everything else you’ve said. I don’t know if by “insisting” you mean has a shitty attitude about, in which case that’s very reasonable, but if not.....if her comfort and making sure she’s in a less stressful headspace when she sees you isn’t important to you in addition to all of the money that she spent on her hair, nails, etc to go on that date that you’re certainly not reimbursing her for, she needs to find better. Yes, it’s only a stop or two, but sending an Uber would make her trip go far more smoothly, less chance of delays, etc. if you have to make a big deal out of her wanting to feel more comfortable and like she’s not just wasting her time on someone who feels the need to debate why she should take the subway instead of just being a courteous provider like a good S.D. should be......you’re in the wrong place. SBs want a better lifestyle than they would get with vanilla. What’s even the point then?",
                    "author": "RussianAsshole",
                    "id": "e9eno2b",
                    "parent_id": "t1_e9ek7kn",
                    "score": 3,
                    "created_utc": 1541829888.0,
                    "replies": [
                        {
                            "body": "Insisting is when they are not willing to compromise.  You are in NYC.  You know Long Island City subway across the river to Manhattan doesn't get much smoother or convenient than that.\n\nI am talking about the M&G, not a date.  Almost all SB are appreciative when I suggest meeting someplace in the middle or close to them.  Many offer to meet close to me.  The divas are the ones who want everything to be about them and only care about themselves.   I spoil SB's that appreciate being spoiled, vs the diva SB that demands and insists to be spoiled when we have not even met yet.\n\nLet's keep this respectful.  We have a difference in opinion.  I am definitely not in the wrong place.  I assume you are successful sugaring.  So am I.   NYC has thousands of attractive SB's.  ",
                            "author": "edgesd",
                            "id": "e9eoikx",
                            "parent_id": "t1_e9eno2b",
                            "score": 1,
                            "created_utc": 1541831277.0,
                            "replies": [
                                {
                                    "body": "The vibe I'm getting is more findom than SB. ",
                                    "author": null,
                                    "id": "e9ew1jy",
                                    "parent_id": "t1_e9eoikx",
                                    "score": -1,
                                    "created_utc": 1541846046.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s true. Subways in the summer suck! \n\nI don’t think it’s wrong which is why I covered the Uber, even if that wouldn’t be my first choice. \n\nBut when it comes to human interaction and chemistry, especially in the context of a potential arrangement, how someone “goes about things” can be very revealing. \n\n",
            "author": null,
            "id": "e9e6jlb",
            "parent_id": "t1_e9e5vc3",
            "score": 3,
            "created_utc": 1541810314.0,
            "replies": []
        },
        {
            "body": "Right?? \"Seeya, Shaya!\"",
            "author": "Cledaddy23",
            "id": "e9dyubf",
            "parent_id": "t1_e9do0ec",
            "score": 2,
            "created_utc": 1541802903.0,
            "replies": []
        },
        {
            "body": "Yeah, I don’t get how some of the people here think that reflects badly on her. He knew what this arrangement was. If you’re that cheap, please don’t waste any more of her time.",
            "author": "RussianAsshole",
            "id": "e9eigo4",
            "parent_id": "t1_e9dm0c7",
            "score": 2,
            "created_utc": 1541822946.0,
            "replies": []
        },
        {
            "body": "\"I shaya, I didn't like ya\"",
            "author": null,
            "id": "e9dlzj5",
            "parent_id": "t1_e9dcpzx",
            "score": 0,
            "created_utc": 1541792680.0,
            "replies": []
        },
        {
            "body": "Why do you have an SB from Queens? Is she Asian?\n\nSeems like NNJ is one of the better areas for college girls in the Tri-State area.",
            "author": "LesterBurnham212",
            "id": "e9dichf",
            "parent_id": "t1_e9d21pm",
            "score": -6,
            "created_utc": 1541789894.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e9djfxf",
                    "parent_id": "t1_e9dichf",
                    "score": -1,
                    "created_utc": 1541790755.0,
                    "replies": [
                        {
                            "body": "I would look harder in NNJ. Queens to NJ is going to get old really fast.",
                            "author": "LesterBurnham212",
                            "id": "e9dn6yc",
                            "parent_id": "t1_e9djfxf",
                            "score": -3,
                            "created_utc": 1541793594.0,
                            "replies": [
                                {
                                    "body": "Or he could just get her an Uber so he doesn’t have to drive and it would be a non issue, but it’s easier to complain than go through a simple solution ",
                                    "author": "RussianAsshole",
                                    "id": "e9eikb9",
                                    "parent_id": "t1_e9dn6yc",
                                    "score": 2,
                                    "created_utc": 1541823069.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I'm a SB in NNJ.",
                            "author": "Kaykay2500",
                            "id": "e9dtrft",
                            "parent_id": "t1_e9djfxf",
                            "score": -1,
                            "created_utc": 1541798748.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True. I was starving and needed to eat lunch anyway. ",
            "author": null,
            "id": "e9dge99",
            "parent_id": "t1_e9df8k2",
            "score": 2,
            "created_utc": 1541788340.0,
            "replies": []
        },
        {
            "body": "To me: just don't eat at any first date, either sugar or vanilla. I've subconsciously  been following that advice before hearing it from a relationship coach years ago and it has worked like magic to weed out the jerks. ",
            "author": "MissCottonCandyBunny",
            "id": "e9dqfwo",
            "parent_id": "t1_e9df8k2",
            "score": 1,
            "created_utc": 1541796127.0,
            "replies": []
        },
        {
            "body": "I think you’re right. I just try to be extra accommodating in the beginning since she might be nervous or anxious. ",
            "author": null,
            "id": "e9dgikn",
            "parent_id": "t1_e9dfdaa",
            "score": 0,
            "created_utc": 1541788435.0,
            "replies": []
        },
        {
            "body": "I loved BART when I lived there.  Pleasanton to Downtown is such an easy ride.  It was always great to take the BART downtown on a date, eat at a nice place, have some wine, enjoy SF, and then take the BART home.  Relaxing, cozy, snuggly hour ride back as time to sober up for the short jaunt home and more activities.\n\nMy first ever experience with mass transit was MARTA in Atlanta.  My first day there I drove downtown from my hotel and it took me over an hour and cost $25 to park.  I took the MARTA the next day and it took 12 minutes and cost $2.  Easy choice. DC METRO is banner, too.",
            "author": null,
            "id": "e9dja7z",
            "parent_id": "t1_e9dfdaa",
            "score": 0,
            "created_utc": 1541790632.0,
            "replies": []
        },
        {
            "body": ">  Also what does POT mean?\n\nIf you have a look on the right hand side of this website you'll see a handy little box which gives a whole load of commonly used acronyms and terms.\n\n>**Commonly Used Acronyms / Terms**\n>\n>SA: SeekingArrangement\n>\n>SD: sugar daddy\n>\n>SB: sugar babe\n>\n>POT: Potential sugar partner\n>\n>SR: Sugar Relationship\n>\n>The Bowl: Sugar lifestyle / dating scene\n>\n>Arrangement: Negotiated relationship\n>\n>NSA: no strings attached\n>\n>FWB: friends with benefits",
            "author": null,
            "id": "e9dgxvq",
            "parent_id": "t1_e9d8rws",
            "score": 4,
            "created_utc": 1541788769.0,
            "replies": []
        },
        {
            "body": "I employ sales people in NYC, and don’t really care about the cost, but I find that reps who take cabs everywhere (or assume I will want to take a cab everywhere when I’m with them) sell less. I think part of it is time efficiency, but part of it is hustle and personality. \n\nI haven’t made it a hiring/firing issue but I may in the future. ",
            "author": "allmyblackclothes",
            "id": "e9egbf0",
            "parent_id": "t1_e9e1arg",
            "score": 2,
            "created_utc": 1541820531.0,
            "replies": []
        },
        {
            "body": "Oh yeah. I have no problem with people who love luxury, but only taking cars in NYC is ridiculous. ",
            "author": null,
            "id": "e9eijm7",
            "parent_id": "t1_e9e1arg",
            "score": 2,
            "created_utc": 1541823046.0,
            "replies": []
        },
        {
            "body": "Dont meetup with anybody in their teens. ",
            "author": "dade_murphy1",
            "id": "e9diobe",
            "parent_id": "t1_e9dilh8",
            "score": 25,
            "created_utc": 1541790147.0,
            "replies": [
                {
                    "body": ">Dont meetup with anybody in their teens.\n\nyup!",
                    "author": "TooOldForSD",
                    "id": "e9edzf2",
                    "parent_id": "t1_e9diobe",
                    "score": 7,
                    "created_utc": 1541818075.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think you’re really surprised that in a city with a few million people and a gross subway system, that a young, beautiful girl would prefer a private car ride to see you in an arrangement where she wants a higher standard of dating and doesn’t date vanilla for a reason. Ahhhh, but otherwise, yeah her attitude was piss poor and she should’ve just asked for an Uber politely instead of being an ass about it. The way she asked was awful but I don’t think her asking for it in and of itself is that surprisingly. \n\n\nHey if you wanna get into a pissing contest with yourself over how dangerous the subway is for young women like myself and other SB’s and how disgusting it is despite myself living here and getting desensitized to it, go right ahead. If you think it makes you cool that you’re okay with how dirty and unkempt the subway is while it reeks of piss and some crazy homeless people...yikes ",
            "author": "RussianAsshole",
            "id": "e9envcm",
            "parent_id": "t1_e9en06a",
            "score": 5,
            "created_utc": 1541830220.0,
            "replies": [
                {
                    "body": "I guess we’ll just agree to disagree. I don’t see how age or physical appearance are related to riding the subway. \n\nNor do I feel that a higher socio-economic status in life, all of a sudden makes the subway undesirable. \n\nI’m able to de-couple those aspects. If you can’t, that’s fine too. We just see things differently. 😀",
                    "author": null,
                    "id": "e9exvh4",
                    "parent_id": "t1_e9envcm",
                    "score": 2,
                    "created_utc": 1541849832.0,
                    "replies": []
                },
                {
                    "body": "Lol “beautiful young girl”. That doesn’t make her special. She is just like everyone else. Doesn’t matter how she looks or dresses herself. The subway is not dangerous for anyone. If you girls think you are so much better than others maybe you should pay for a Uber yourself 😂😂😂\n\nSPOILT",
                    "author": "BarbieDontWantYouHoe",
                    "id": "eb0th4f",
                    "parent_id": "t1_e9envcm",
                    "score": 1,
                    "created_utc": 1543868534.0,
                    "replies": [
                        {
                            "body": "Clearly it does make her special because that’s what gives her societal privileges that average or ugly women do not have access to. What a load of bullshit, SDs pick their next victim with their eyes first and foremost, clearly her looks matter or else the men on SA would not give her the time of day. Shit goes down on the subway all the time with sketchy people and you’re not gonna tell me my experiences are false because of your weird complex against women’s experiences. Somehow I’m not surprised at the nonsense men spew in this sub anymore. As if you could afford to spoil anyone with your broke ass mentality. Of course you’re suggesting they pay for it, brokie. Anything to not have to hold up your end of the deal.",
                            "author": "RussianAsshole",
                            "id": "eb15omt",
                            "parent_id": "t1_eb0th4f",
                            "score": 1,
                            "created_utc": 1543877190.0,
                            "replies": [
                                {
                                    "body": "No it doesn’t lol. Only to horny men who don’t really matter in the grand scheme of things. Not to intelligent men or other women. Especially other women lol. Stop putting pretty girls on a pedestal. That’s why so many men are going MGTOW. Women are not worth spoiling like that by default 😂",
                                    "author": "BarbieDontWantYouHoe",
                                    "id": "eb1830j",
                                    "parent_id": "t1_eb15omt",
                                    "score": 1,
                                    "created_utc": 1543879178.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> What I don't put up with is a SB that insists I send them an Uber for the M&G. \n\nThis right here betrays everything else you’ve said. I don’t know if by “insisting” you mean has a shitty attitude about, in which case that’s very reasonable, but if not.....if her comfort and making sure she’s in a less stressful headspace when she sees you isn’t important to you in addition to all of the money that she spent on her hair, nails, etc to go on that date that you’re certainly not reimbursing her for, she needs to find better. Yes, it’s only a stop or two, but sending an Uber would make her trip go far more smoothly, less chance of delays, etc. if you have to make a big deal out of her wanting to feel more comfortable and like she’s not just wasting her time on someone who feels the need to debate why she should take the subway instead of just being a courteous provider like a good S.D. should be......you’re in the wrong place. SBs want a better lifestyle than they would get with vanilla. What’s even the point then?",
            "author": "RussianAsshole",
            "id": "e9eno2b",
            "parent_id": "t1_e9ek7kn",
            "score": 3,
            "created_utc": 1541829888.0,
            "replies": [
                {
                    "body": "Insisting is when they are not willing to compromise.  You are in NYC.  You know Long Island City subway across the river to Manhattan doesn't get much smoother or convenient than that.\n\nI am talking about the M&G, not a date.  Almost all SB are appreciative when I suggest meeting someplace in the middle or close to them.  Many offer to meet close to me.  The divas are the ones who want everything to be about them and only care about themselves.   I spoil SB's that appreciate being spoiled, vs the diva SB that demands and insists to be spoiled when we have not even met yet.\n\nLet's keep this respectful.  We have a difference in opinion.  I am definitely not in the wrong place.  I assume you are successful sugaring.  So am I.   NYC has thousands of attractive SB's.  ",
                    "author": "edgesd",
                    "id": "e9eoikx",
                    "parent_id": "t1_e9eno2b",
                    "score": 1,
                    "created_utc": 1541831277.0,
                    "replies": [
                        {
                            "body": "The vibe I'm getting is more findom than SB. ",
                            "author": null,
                            "id": "e9ew1jy",
                            "parent_id": "t1_e9eoikx",
                            "score": -1,
                            "created_utc": 1541846046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9djfxf",
            "parent_id": "t1_e9dichf",
            "score": -1,
            "created_utc": 1541790755.0,
            "replies": [
                {
                    "body": "I would look harder in NNJ. Queens to NJ is going to get old really fast.",
                    "author": "LesterBurnham212",
                    "id": "e9dn6yc",
                    "parent_id": "t1_e9djfxf",
                    "score": -3,
                    "created_utc": 1541793594.0,
                    "replies": [
                        {
                            "body": "Or he could just get her an Uber so he doesn’t have to drive and it would be a non issue, but it’s easier to complain than go through a simple solution ",
                            "author": "RussianAsshole",
                            "id": "e9eikb9",
                            "parent_id": "t1_e9dn6yc",
                            "score": 2,
                            "created_utc": 1541823069.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm a SB in NNJ.",
                    "author": "Kaykay2500",
                    "id": "e9dtrft",
                    "parent_id": "t1_e9djfxf",
                    "score": -1,
                    "created_utc": 1541798748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Dont meetup with anybody in their teens.\n\nyup!",
            "author": "TooOldForSD",
            "id": "e9edzf2",
            "parent_id": "t1_e9diobe",
            "score": 7,
            "created_utc": 1541818075.0,
            "replies": []
        },
        {
            "body": "I guess we’ll just agree to disagree. I don’t see how age or physical appearance are related to riding the subway. \n\nNor do I feel that a higher socio-economic status in life, all of a sudden makes the subway undesirable. \n\nI’m able to de-couple those aspects. If you can’t, that’s fine too. We just see things differently. 😀",
            "author": null,
            "id": "e9exvh4",
            "parent_id": "t1_e9envcm",
            "score": 2,
            "created_utc": 1541849832.0,
            "replies": []
        },
        {
            "body": "Lol “beautiful young girl”. That doesn’t make her special. She is just like everyone else. Doesn’t matter how she looks or dresses herself. The subway is not dangerous for anyone. If you girls think you are so much better than others maybe you should pay for a Uber yourself 😂😂😂\n\nSPOILT",
            "author": "BarbieDontWantYouHoe",
            "id": "eb0th4f",
            "parent_id": "t1_e9envcm",
            "score": 1,
            "created_utc": 1543868534.0,
            "replies": [
                {
                    "body": "Clearly it does make her special because that’s what gives her societal privileges that average or ugly women do not have access to. What a load of bullshit, SDs pick their next victim with their eyes first and foremost, clearly her looks matter or else the men on SA would not give her the time of day. Shit goes down on the subway all the time with sketchy people and you’re not gonna tell me my experiences are false because of your weird complex against women’s experiences. Somehow I’m not surprised at the nonsense men spew in this sub anymore. As if you could afford to spoil anyone with your broke ass mentality. Of course you’re suggesting they pay for it, brokie. Anything to not have to hold up your end of the deal.",
                    "author": "RussianAsshole",
                    "id": "eb15omt",
                    "parent_id": "t1_eb0th4f",
                    "score": 1,
                    "created_utc": 1543877190.0,
                    "replies": [
                        {
                            "body": "No it doesn’t lol. Only to horny men who don’t really matter in the grand scheme of things. Not to intelligent men or other women. Especially other women lol. Stop putting pretty girls on a pedestal. That’s why so many men are going MGTOW. Women are not worth spoiling like that by default 😂",
                            "author": "BarbieDontWantYouHoe",
                            "id": "eb1830j",
                            "parent_id": "t1_eb15omt",
                            "score": 1,
                            "created_utc": 1543879178.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Insisting is when they are not willing to compromise.  You are in NYC.  You know Long Island City subway across the river to Manhattan doesn't get much smoother or convenient than that.\n\nI am talking about the M&G, not a date.  Almost all SB are appreciative when I suggest meeting someplace in the middle or close to them.  Many offer to meet close to me.  The divas are the ones who want everything to be about them and only care about themselves.   I spoil SB's that appreciate being spoiled, vs the diva SB that demands and insists to be spoiled when we have not even met yet.\n\nLet's keep this respectful.  We have a difference in opinion.  I am definitely not in the wrong place.  I assume you are successful sugaring.  So am I.   NYC has thousands of attractive SB's.  ",
            "author": "edgesd",
            "id": "e9eoikx",
            "parent_id": "t1_e9eno2b",
            "score": 1,
            "created_utc": 1541831277.0,
            "replies": [
                {
                    "body": "The vibe I'm getting is more findom than SB. ",
                    "author": null,
                    "id": "e9ew1jy",
                    "parent_id": "t1_e9eoikx",
                    "score": -1,
                    "created_utc": 1541846046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would look harder in NNJ. Queens to NJ is going to get old really fast.",
            "author": "LesterBurnham212",
            "id": "e9dn6yc",
            "parent_id": "t1_e9djfxf",
            "score": -3,
            "created_utc": 1541793594.0,
            "replies": [
                {
                    "body": "Or he could just get her an Uber so he doesn’t have to drive and it would be a non issue, but it’s easier to complain than go through a simple solution ",
                    "author": "RussianAsshole",
                    "id": "e9eikb9",
                    "parent_id": "t1_e9dn6yc",
                    "score": 2,
                    "created_utc": 1541823069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a SB in NNJ.",
            "author": "Kaykay2500",
            "id": "e9dtrft",
            "parent_id": "t1_e9djfxf",
            "score": -1,
            "created_utc": 1541798748.0,
            "replies": []
        },
        {
            "body": "Clearly it does make her special because that’s what gives her societal privileges that average or ugly women do not have access to. What a load of bullshit, SDs pick their next victim with their eyes first and foremost, clearly her looks matter or else the men on SA would not give her the time of day. Shit goes down on the subway all the time with sketchy people and you’re not gonna tell me my experiences are false because of your weird complex against women’s experiences. Somehow I’m not surprised at the nonsense men spew in this sub anymore. As if you could afford to spoil anyone with your broke ass mentality. Of course you’re suggesting they pay for it, brokie. Anything to not have to hold up your end of the deal.",
            "author": "RussianAsshole",
            "id": "eb15omt",
            "parent_id": "t1_eb0th4f",
            "score": 1,
            "created_utc": 1543877190.0,
            "replies": [
                {
                    "body": "No it doesn’t lol. Only to horny men who don’t really matter in the grand scheme of things. Not to intelligent men or other women. Especially other women lol. Stop putting pretty girls on a pedestal. That’s why so many men are going MGTOW. Women are not worth spoiling like that by default 😂",
                    "author": "BarbieDontWantYouHoe",
                    "id": "eb1830j",
                    "parent_id": "t1_eb15omt",
                    "score": 1,
                    "created_utc": 1543879178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The vibe I'm getting is more findom than SB. ",
            "author": null,
            "id": "e9ew1jy",
            "parent_id": "t1_e9eoikx",
            "score": -1,
            "created_utc": 1541846046.0,
            "replies": []
        },
        {
            "body": "Or he could just get her an Uber so he doesn’t have to drive and it would be a non issue, but it’s easier to complain than go through a simple solution ",
            "author": "RussianAsshole",
            "id": "e9eikb9",
            "parent_id": "t1_e9dn6yc",
            "score": 2,
            "created_utc": 1541823069.0,
            "replies": []
        },
        {
            "body": "No it doesn’t lol. Only to horny men who don’t really matter in the grand scheme of things. Not to intelligent men or other women. Especially other women lol. Stop putting pretty girls on a pedestal. That’s why so many men are going MGTOW. Women are not worth spoiling like that by default 😂",
            "author": "BarbieDontWantYouHoe",
            "id": "eb1830j",
            "parent_id": "t1_eb15omt",
            "score": 1,
            "created_utc": 1543879178.0,
            "replies": []
        }
    ]
}