{
    "title": "Some Possible Tips for New SBs",
    "post_id": "92igpx",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some_possible_tips_for_new_sbs/",
    "author": "milliondollarkitty",
    "body": "One of the most important things when it comes to sugaring is making sure that you are remaining safe.  I know from experience that sugaring can have a pretty steep learning curve when you’re new, and so often I see SBs asking questions or telling stories where they’re making enormous, blaring safety mistakes.  I was inspired by something I saw another SB post, so I figured why not put a little something together.\n\n\nSCAMS:\nIt feels like almost every day there is a new poster asking if a certain situation is legitimate or not.  Being able to recognize when something is amiss is critical to your success as an SB.\n-  If it seems too good to be true, it usually is.\n- If you have to ask if it’s a scam, it’s a scam.\n-  Anyone asking to send you a large amount of money prior to meeting you is not real and is most likely a scam.  I’ve had guys send me a couple hundred dollars here and there for whatever reason, but anyone making crazy claims about thousands of dollars is definitely a scammer.  \n- Anyone asking you to do anything with iTunes gift cards or visa vanilla gift cards is a scammer.\n- Anyone asking to send you a check and have you send back the remaining amount is a scammer.\n- Anyone else for you bank account / log in info is a scammer.  Anyone asking for your payment app log in info (PayPal, cashapp, venmo, etc) is a scammer.  That information is *never* needed to send money.\n- Anyone asking to pay you at the end of the week/month is a scammer.  You’ll spend that amount of time with them and never see the allowance that was promised.\n- In the beginning of an arrangement, cash is king.  PayPal, Venmo, and bank transfers can be reversed and you’ll be left with nothing.  Once trust is built you can move to more convenient methods like these.\n\n\n\nThere are a few tips you should take before you get started to keep yourself safe.  Even if you’ve already started sugaring, it’s never too late to switch things up and start doing them in a better, safer way.\n-  Make sure you get a burner number.  I use google voice, but I know there are other options available.  There are people out there with less than perfect intentions, and so much information can be found about you from nothing but a simple search of your phone number.  I can’t stress this point enough, it’s so crucial.\n-  Invent a sugar person persona for yourself.  Make a throwaway email address that you only use for sugaring purposes.  Though it is not 100% necessary, a lot of SBs use a fake name for the first few dates.  Be careful with the information you share when you are first getting to know them (college, hometown, neighborhood, etc).  All those little pieces of information can be pieced together and used to find out more about you.  Obviously once you get to know them and you feel comfortable doing so, you can tell them your real information if you desire.\n- Make sure that any photos you use can not be reverse image searched.  These photos should not be present anywhere else on the internet.  Double check this by reverse searching your own images to be sure nothing comes up.  \n-  While this may come across as hypocritical to some, gather as much information as you can about him and do some searching. If he tells you he’s a professor at X school, you can go to the school’s faculty directory website and confirm that it’s true.  Mr. Number and Spokeo are great tools for vetting.  \n- So many SBs don’t do their due diligence when it comes to vetting their POTs.  This is *so* important.  You have no idea who this man is.  You need to protect yourself and information is your best weapon.  Reverse search all the photos on his profile and any additional ones he sends you.  Does anything come up?  Does it match what he says?  Search his email, name, and phone number.  If you are able to find out their real info, search for them on Facebook and see if their lifestyle reflects what they claim it to be.\n- While gathering as much information as you can is super helpful, a lot of men are married or have a need to be discreet.  Just because he doesn’t tell you much about himself or is using a burner number or a fake name, doesn’t mean that he’s hiding something negative. I will say that most men are way worse at OPSEC than they think they are, and I usually know exactly who they are when I go on the meet and greet.  Bottom line, knowing as much about them as you possibly can is great for peace of mind, but it’s not an absolute necessity.\n\nRED-FLAGS BEFORE MEETING:\n-  Asks for nudes or suggestive photos.  Make sure your profile photos accurately depict what you look like.  Make sure you have a good variety of photos. Headshot, full body, candid, etc.  It is important to have at least one photo where they can really see your figure.  As long as you do this, there is literally zero reason for a POT to feel the need to ask for more photos and anyone who does is most likely a photo collector.  I include a photo of me in a form fitting dress, and a candid bikini shot.  If they’re asking for more photos or nudes and you already have a multitude of full body photos on your profile, end the conversation and move on.  \n-  Diverts the conversation to sex talk.   No one wants constant sex questions.  It’s tacky and crass.  Tell him you are not comfortable discussing your sex life with strangers, but that you are willing to possibly revisit the topic once you get to know one another better.  I give these guys one chance.  If they’re apologetic and we move on, great.  If they’re rude or continue pushing, I tell them we are not a match and move on.  Anyone who keeps guiding the conversation back towards sex is being very clear with what their intentions are.  Sugaring is so much more than just sex and money.  If you’re looking for someone who actually values you as more than a vagina, these guys are not it.\n- Raunchy username.  You know what “KittyPleaser69” is there for.  These men are to be avoided as they are strictly looking for cut and dry pay for play scenarios.\n- Bad grammar.  So you’re supposed to believe he’s successful and wealthy when he can’t even string two sentences together without spelling and grammar errors?  Pass.  \n-  Anyone who does not respect your boundaries.  Whether it be using a burner number, not wanting to give out very personal info, not wanting to host/go bareback.  Anyone who makes you feel bad about wanting to protect yourself is not someone you want to associate with.  Anyone who insists you trust them when they’ve done nothing to earn it is bad news.  Pushing boundaries early will only lead to escalated behavior later on.  \n-  Insists on meeting the same night you first contact them.  Drinks at a hotel bar so he can get you loosened up and then try to take you to a room?  Hard pass.  Insist on lunch/dinner (some people will say coffee but that’s not my thing at all) during more reasonable hours when you’ve had some time to prepare and get to know each other a little more.  This will screen out a lot of the guys who are simply horny and looking for a one off.\n \n\n\nOnce you’ve found a few POTs, the next step is to set up meet and greets to scope each other out, see if there’s any chemistry, and possibly discuss a future arrangement.\n-  Meet and greets should begin and end in a public place.  There should be other people around and it should take place in a low stress environment.  \n-  Always make sure you can get to AND from a first meet.  NEVER LET HIM PICK YOU UP OR DRIVE YOU HOME.  You do not know this man, do not get into his car.  That sounds like an episode of criminal minds just waiting to happen.  Read through this sub a little bit and you’ll hear multiple stories of SBs being groped in cars and put in uncomfortable situations.  This is so easily avoided.  Drive yourself, take an Uber, or take public transport.  No matter how convenient it is, do not let him give you a ride.  It doesn’t matter how nice he seems, *you do not know this man yet.*  If you are traveling a good ways away to meet him, asking for travel costs to be reimbursed is very reasonable.\n-  Make sure someone knows where you’re going and what time you’re expected to be back.  Even if you don’t have friends who know you sugar (although I definitely recommend you find one), you can just make it out to be a regular date.  Whenever I *do* get in his car for the first time, I always give a friend the make/model/license plate number.  Does this seem excessive?  Maybe.  But it could save your life and it’s not going to hurt anyone.  \n-  Do not let yourself get too inebriated.  Some girls don’t drink at all.  I personally like a drink now and then, but I make sure I *never* get drunk. It’s messy and trashy and can impair your judgement and decision making skills.\n-  Meet and greets are usually uncompensated.  I think it is incredibly uncouth to ask to be paid to simply show up.  However as I mentioned above, if you are driving far or are required to spend money on parking/valet or public transport, I do think that it is fair to ask for reimbursement.  The meet and greet is simply to gauge chemistry and see if you guys are interested in possibly moving forward.  Neither of you owe each other anything at this point.  That being said, while I never ask to be compensated, it is not uncommon that an SD chooses to gift at the end of the meet and greet anyways.  It is always extremely appreciated and a very good sign.  \n- Take notice of the way he is dressed.  Is he clean, well groomed?  Does he look put together?  While it is in no way, shape, or form foolproof, a great way to identify a man of means is by his watch or his shoes.\n- Watch how he treats the staff.  Is he kind to the server/valet?  Does he treat them with respect?  Do the staff there know him?  Does he tip well?  These are all important signs.  I also like to be sneaky and get a peek at what type of card they have 😹\n\nMEET AND GREET RED FLAGS.  \n-  Constantly tries to move things to a more remote location.  You need to go into it with the mindset that there will be no intimacy at the meet and greet.  Drill that into your head.  There will be absolutely no sex on the first date.  Keeping the meet and greet platonic drastically reduces the chance of a pump and dump.  Even if you really hit it off, it’s best to go home and think things over and come to an agreement to start the arrangement on another day.  \n-  Limits you on what you can order, complains about the prices of things, or cringes at the bill.  If he can’t afford a meet and greet meal then he’s cheap, or he can’t afford you.  Neither option is good.  You shouldn’t have to worry about prices or penny pinching when you’re out with an SD.  \n-  Catching him in lies/ conflicting stories.  It’s one thing to fudge the truth to protect your discretion, it’s another thing to not be able to keep your lies straight.  \n-  Controlling/forceful behavior. If he’s that pushy on the first date, he’ll be even more worse on the next one or on the one after that because you’re rewarding bad behavior.\n\n\n\nOnce you’ve had a meet and greet and solidified the terms, you will set up a date to begin your arrangement.  \n-  For the love of god, please use a condom.  There are so many men out there trying to have raw sex with SBs.  If they’re trying to go bare when you when they hardly even know you, they’re doing it with other girls too.  Regardless of what he says, you are not that special.  Let that thought sink in.  He doesn’t care about his sexual health, that’s what he’s really saying.  Guys will have a million and one excuses not to wear one.  Send them packing every time.  There are plenty of SDs who are more than happy to have safe sex than to put up with someone who’s going to bitch and moan about it every time.\n- While some may disagree, the overall consensus is that the first intimate meet should take place at a hotel.  It is a neutral location with a lot of witnesses nearby.  It’s sad that’s the way we have to think about things, but it is what it is.  Plus room service and spas are always fun.  I personally love hotels, they make me feel fancy as fuck.  Take note of what type of hotel he books.  It doesn’t necessarily have to be the Ritz, but it shouldn’t be a motel.  It should be on the nicer side and clean.  A few times my SD has to be somewhere so he leaves and I get to keep the room, which is always a blast.  Who doesn’t love huge comfy beds, beautiful bathrooms, and more room service.  \n- You should receive your allowance prior to engaging in any intimacy, especially if it is your first few times being intimate.  This non negotiable.  It doesn’t have to be made into a big deal and it’s only ever transactional if you make it that way.  I’ve had SDs put my allowance in greeting cards, which I think is a super cute idea.  Sometimes they just slipped it on the counter/into my bag and excused themselves to the bathroom so I could count if I wanted to.  If someone gets upset about it, gives you a hard time about giving you your allowance prior to intimacy, or hits you with a million excuses, I suggest you walk out.  If he cares about your comfort level, he should want you to have that peace of mind so you can relax and enjoy your time together.  In my opinion, it’s the SDs job to bring up allowance and give it to you in an inconspicuous manner.  If he doesn’t, do *not* feel weird bringing it up.  “Do you have something for me?”, “Can get my allowance out of the way so we can get to the fun part?” are all ways you can bring it up.  If it’s your first time together, I suggest you make sure it’s all there.  You may feel awkward having to ask for your allowance, but you’ll feel a lot worse walking out empty handed and pumped and dumped.  This sub is rife with pump and dump stories, if you care to take a look.\n\nMORE RED FLAGS \n-  Misses/is late with allowance.  If you are on a PPM system *always get the money prior to intimacy* in the beginning.  There are no I forgots/I’ll pay you after/tomorrow/etc.  It doesn’t matter what the excuse is.  If you are on a monthly allowance and he has yet to send the allowance, he needs to send it to you prior to your next meet otherwise he is breaking the terms of the arrangement.   Never let anyone make you feel bad about asking for your allowance because they sure as hell aren’t shy about expecting intimacy.  Never let him get so comfortable that thinks he can beat around the bush about the financial component.  At the end of the day it is and always will be an arrangement.\n-  Pushes for things you have expressed discomfort with.  Going condomless, anal, whatever it may be.  Never do anything you don’t feel good about and make sure you let him know your feelings in no uncertain terms.  Anyone who is being pushy about certain things in bed does not care about you or your feelings. \n\n\n\nOut of everything I’ve mentioned above, the last thing I want to touch on is probably the most important of all.  Do not ever under any circumstances let the idea of money take precedent over your well being.  If you take nothing else away from this entire thing, let it be this.  Your health and safety is so important.  There will always be more money, there are certain other things you can’t get back.  \n",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some_possible_tips_for_new_sbs/",
    "score": 603,
    "upvote_ratio": 0.99,
    "created_utc": 1532742703.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I found that this is really effective when trying to weed out scammers but may not work for everyone: I go to school for criminal justice and really love criminal and civil law. When I’m chatting with someone early on I like to mention what I’m going to school for and my passion for law. Scammers stop answering right after I send that. I’m assuming most scammers don’t want to risk scamming someone who may or may not have better knowledge or connections than the average SB. ",
            "author": "HazySugar",
            "id": "e37dih2",
            "parent_id": "t3_92igpx",
            "score": 87,
            "created_utc": 1532812445.0,
            "replies": [
                {
                    "body": "I would think you might be a cop trying to entrap a join. Of course, going to school for CJ is legit, but that is the thought it would engender. I'd suggest not mentioning that.",
                    "author": "StiffHappens",
                    "id": "im8o4y1",
                    "parent_id": "t1_e37dih2",
                    "score": 5,
                    "created_utc": 1661770006.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is brilliant, thanks so much.  As a corollary, I feel that my job as a SD is to make sure that she never has to ask an awkward question or bring up a subject that feels awkward.  Before a first M&G, I'll say: There are some safety rules that I follow, here they are.  I don't mean to be rude but I am not going to offer to pick you up because it's a safety rule that we should arrive separately.  I discuss allowance (when it feels comfortable) before she brings it up.  I give her the allowance before we go anywhere private.  I ask if she has any questions and if she feels comfortable.  If I'm being a good SD, I should be attending to all these things so that she never has to make the effort to raise an awkward subject.  Of course talk can go to sexual but I don't harp on it. Later on in our conversation, I might say \"I hope this isn't offensive, but I want to say that I am looking for someone who is sex positive and really enjoys it.\"  That's as far as I would go.  At the moment of the first cash handover, I say \"This is a gift which doesn't obligate you to do anything particular.\"  I just try to think about what would feel comfortable/ uncomfortable for her, and to do and say things that make the uncomfortable pieces go away.",
            "author": null,
            "id": "e9vq54c",
            "parent_id": "t3_92igpx",
            "score": 50,
            "created_utc": 1542462175.0,
            "replies": [
                {
                    "body": "Thank you for this. You just answered all my questions.  I think every sentence in here was a question that I was wondering about.  ",
                    "author": null,
                    "id": "eb0yefo",
                    "parent_id": "t1_e9vq54c",
                    "score": 2,
                    "created_utc": 1543871884.0,
                    "replies": [
                        {
                            "body": "Thanks for the nice words",
                            "author": null,
                            "id": "eb1iiur",
                            "parent_id": "t1_eb0yefo",
                            "score": 1,
                            "created_utc": 1543888309.0,
                            "replies": [
                                {
                                    "body": "It would be absolutely amazing if you could “train” other SDs to be like you! You sound lovely and considerate😍",
                                    "author": null,
                                    "id": "hsqk4jd",
                                    "parent_id": "t1_eb1iiur",
                                    "score": 2,
                                    "created_utc": 1642230021.0,
                                    "replies": [
                                        {
                                            "body": "We should chat ;)",
                                            "author": null,
                                            "id": "hto19v2",
                                            "parent_id": "t1_hsqk4jd",
                                            "score": 4,
                                            "created_utc": 1642807137.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great Post... I think it may be a good idea to have an extra category in the WIKI, a folder named \"research material and/or collateral\".. Something where links to post like this can be stored. A place where we can direct those who have asked for help, but conducted no research, or those who would like to know where to find good material... Just seems like a shame for this post to end up buried into the abyss...\n\nSomething that diceman-74 mentioned to me earlier in the day... Personally, I thought it was and is a great idea! :)",
            "author": null,
            "id": "e35z3fr",
            "parent_id": "t3_92igpx",
            "score": 39,
            "created_utc": 1532743336.0,
            "replies": [
                {
                    "body": "This is one more candidate for a post that should have a link on the right side of the page - so many reasonable questions are answered here.",
                    "author": "WalksLikeADuckSo",
                    "id": "e36lzzz",
                    "parent_id": "t1_e35z3fr",
                    "score": 7,
                    "created_utc": 1532782367.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I pay attention to how well he tips when we get drinks or dinner.  Nothing is foolproof, but another potential indicator.\n\n(Sorry if you mentioned this and I overlooked it)",
            "author": "CentralUSGal",
            "id": "e36tb4i",
            "parent_id": "t3_92igpx",
            "score": 32,
            "created_utc": 1532791359.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e36wbwh",
                    "parent_id": "t1_e36tb4i",
                    "score": 3,
                    "created_utc": 1532794626.0,
                    "replies": [
                        {
                            "body": " That is a good point, I should have been specific.  ",
                            "author": "CentralUSGal",
                            "id": "e36z2o9",
                            "parent_id": "t1_e36wbwh",
                            "score": 2,
                            "created_utc": 1532797435.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At the bare minimum newbies should be reading this stuff and other stuff forum members have made. It irks me to see posts asking questions about easily obtainable information that people have already put out. \n\nI had to learn from mistakes and figure things out. If I had something like this to read I would have read it several times before getting started. This is the bare minimum you should know before entering the bowl. ",
            "author": null,
            "id": "e374g7b",
            "parent_id": "t3_92igpx",
            "score": 22,
            "created_utc": 1532802927.0,
            "replies": []
        },
        {
            "body": "Thank you so much for this! I'm new to the bowl and I have it bookmarked. QQ: if anyone feels like answering - I've spoken to several SDs who revealed they were in previous long-term SR was $150x week... for 3-4 dates/month... I'll be honest, I laughed out loud. Are they lying? Trying to negotiate? I'm not willing to do that or to have such a small allowance, so I'm continuing my search.  I'm wondering how many more of these I'll talk to...",
            "author": "jadedreamer11",
            "id": "e3hii0e",
            "parent_id": "t3_92igpx",
            "score": 24,
            "created_utc": 1533231895.0,
            "replies": []
        },
        {
            "body": "Thanks so much for this post! I strongly recommend all new Sugar Babys read this.  \n\nPerhaps this Reddit Sub should take over where Seeking Arrangement leaves off. ",
            "author": "HappyBear1952",
            "id": "e365x14",
            "parent_id": "t3_92igpx",
            "score": 13,
            "created_utc": 1532751771.0,
            "replies": []
        },
        {
            "body": "I would take \"possible\" out of the title and replace it with \"must read.\"\n\nThis is great stuff every SB or aspiring SB should know. Sadly, I suspect many will never take the time to fully read and digest this post.\n\nWell done.",
            "author": "alessthanoptimalname",
            "id": "e363hg0",
            "parent_id": "t3_92igpx",
            "score": 17,
            "created_utc": 1532748583.0,
            "replies": []
        },
        {
            "body": "I need some advice (also, I’m totally new to this): I am in the mental health field and have my own office. I advertise my business online through a mental health search platform, thus my real name and my office location can be found online. Luckily because of my field I’ve done my utmost to not have my personal information online (Nickname on Facebook, etc.). My question is should I even have on my profile what my profession is or should I make that vague (or even lie) and then only tell SDs if I feel comfortable with them knowing? I’d be very uncomfortable with someone finding where I work and showing up!! \nThanks for any advice you have!\n\nEdit: By “profile” I’m referring to an arrangement website, in case that wasn’t clear. ",
            "author": "SusyJo84",
            "id": "e3dzzv1",
            "parent_id": "t3_92igpx",
            "score": 5,
            "created_utc": 1533088855.0,
            "replies": [
                {
                    "body": "I would definitely make it vague until you get to know them and feel comfortable sharing more info.  You can just say you’re in the medical field to start.",
                    "author": "milliondollarkitty",
                    "id": "e3e538k",
                    "parent_id": "t1_e3dzzv1",
                    "score": 5,
                    "created_utc": 1533094146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well done u/milliondollarkitty! Just one thing to add:\n\nIf you do drive to the M&G, I usually decline any offer to walk me to my car and make sure he doesn’t follow me. All of your personal information (including your address) can be pulled from your license plate.",
            "author": "seekingsweetsugar",
            "id": "e365lxy",
            "parent_id": "t3_92igpx",
            "score": 14,
            "created_utc": 1532751345.0,
            "replies": [
                {
                    "body": "Valet parking solves the physical risk but he does get to see your plates.  ",
                    "author": "pinotandsugar",
                    "id": "e36aexc",
                    "parent_id": "t1_e365lxy",
                    "score": 3,
                    "created_utc": 1532758696.0,
                    "replies": []
                },
                {
                    "body": "> All of your personal information (including your address) can be pulled from your license plate.\n\nLast time this was discussed in this forum this was not proven, one person used a site someone said could do this (they had to pay for it) and it did give a name and address for each of their license plates, but none of the information the site provided was accurate.  There are sites that claim they can do this *in some cases*, but it appears to be mostly a myth.",
                    "author": null,
                    "id": "e36rbou",
                    "parent_id": "t1_e365lxy",
                    "score": 3,
                    "created_utc": 1532789169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just skimmed it but it's fantastic, will read it at my leisure later.  One thing I didn't see mentioned: the \"we have to test sexual compatibility before we start an arrangement\" thing.\n\nI also don't remember if you mentioned that it's a best practice to start out the arrangement as PPM (or weekly?), and if monthly is desired, move to that down the line.  Obviously, that's more to protect the SD than the SB, but an SB who asks for monthly from the jump is going to get next'ed alot\n\nAnd, just to make it a complete, 360-degree tip cheatsheet -- add a small section on profiles?  Standard stuff we talk about here: pics (especially profile pic) are everything, it's not a [Match.com](https://Match.com) profile, focus more on what you'll bring to him, do not be negative, focus more on attracting high-quality SDs than venting at scammers who aren't reading anyway",
            "author": "Azurecole",
            "id": "e35z40u",
            "parent_id": "t3_92igpx",
            "score": 10,
            "created_utc": 1532743357.0,
            "replies": [
                {
                    "body": "I personally think that’s up to the SB.  While I have done PPM in the past, I don’t really like it.  While I do sometimes start with monthly, sometimes we compromise and start with biweekly allowance and it’s never been a problem.  I will say that I vet my POTs extensively and go on several platonic dates before officially beginning the arrangement.  I feel that may have something to do with it.",
                    "author": "milliondollarkitty",
                    "id": "e35zee9",
                    "parent_id": "t1_e35z40u",
                    "score": 10,
                    "created_utc": 1532743689.0,
                    "replies": [
                        {
                            "body": "I think the half month in advance of the first intimacy is a really good way to go in today's environment.  If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either  under resourced or under confident he is making a wise choice.  Several platonic dates plus half month in advance  is probably the best filter",
                            "author": "pinotandsugar",
                            "id": "e36ad1h",
                            "parent_id": "t1_e35zee9",
                            "score": 18,
                            "created_utc": 1532758607.0,
                            "replies": [
                                {
                                    "body": ">If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either under resourced or under confident he is making a wise choice.\n\nOR, he doesn't want to take additional risk that he doesn't have to.\n\nWhy risk it with allowance when the bowl has made PPM standard?\n\nNo matter how much vetting you do, what's the point in risking even $1 if you don't have to?",
                                    "author": null,
                                    "id": "e37e9gw",
                                    "parent_id": "t1_e36ad1h",
                                    "score": 7,
                                    "created_utc": 1532813241.0,
                                    "replies": []
                                },
                                {
                                    "body": "I do PPM for the first intimate date, no exceptions.  Maybe just a reflection of different experiences we've all had in the bowl -- my experience tells me that anything beyond PPM is borderline reckless,, but it sounds like you haven't experienced the same, so maybe that's all a factor of something else.  It's not that I'll be financially crushed if I lose part of a half month allowance ... but everyone hates the feeling of being taken for a sucker.   Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTotally accept that the two of you found a different way that works better for you, not arguing against the way that you've found works ... but wonder now if we asked this, if there isn't a consensus best way here.",
                                    "author": "Azurecole",
                                    "id": "e36sju2",
                                    "parent_id": "t1_e36ad1h",
                                    "score": 7,
                                    "created_utc": 1532790530.0,
                                    "replies": [
                                        {
                                            "body": "One man's \" reckless\" is another man's marketing opportunity and  \"Best\" is in the eye, mission objectives and pocketbook of the beholder.  \n\nIn well over 10 years of sugaring I might have lost 2 advance payments. But what I have been told by several SB's was that the way the arrangement started helped them to  feel both comfortable and respected.  Just as in business some clients want to work with you as a trusted partner and others are constantly looking for ways to get freebies. \n\nBecause of the nature of the work I do, searching for a replacement SB costs money.  In a moment of stupidity some years ago I tracked some of the time that it took to find a replacement SB  when one moved away, it was somewhere between 3-8 months allowance, mostly due to my trying to find and recruit from too many prospects plus loosing some prospects where we had an unconsummated arrangement. \n\nWhile the economics are significant I think the major change is in the dynamics of the first intimacy.   The first generally has a significant impact on the future.  \n\nThere's no right or wrong answer , the important thing is that it is consistent with your mission objectives, strategy and the envelope in which you want to operate.  \n\n\n\n ",
                                            "author": "pinotandsugar",
                                            "id": "e3742h9",
                                            "parent_id": "t1_e36sju2",
                                            "score": 13,
                                            "created_utc": 1532802534.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I give a monthly allowance in advance of intimacy.  I haven’t gotten scammed yet (small experience so far) but if I do I will consider it the best $ I’ve ever spent.  I’d cheerfully pay two monthly allowances to find out that the POT is dishonest before I engage in intimacy.  No price is too high to avoid an intimate relationship with a dishonest person.  Now if she brings up $ on the first email, I’m outta there. I do a lot of conversational screening to figure out if she’s a decent person. But you can always be fooled, and the one guaranteed way to find out if she’s honest is to give her a free chance to steal from me. If she doesn’t, we’re off to the races. If she does, good riddance :-)",
                                            "author": null,
                                            "id": "e38f6xv",
                                            "parent_id": "t1_e36sju2",
                                            "score": 12,
                                            "created_utc": 1532867129.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">but everyone hates the feeling of being taken for a sucker. Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTHIS, there is a huge EMOTIONAL cost of being scammed that most SBs grossly understimate.\n\nThey say \"lol, it's just $500, that's nothing to you\". And while true, it pains me and stresses me out to be taken for a fool, so i take measures to prevent it which many SBs take as being salty.",
                                            "author": null,
                                            "id": "e37k38o",
                                            "parent_id": "t1_e36sju2",
                                            "score": 8,
                                            "created_utc": 1532819300.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t think anyone is underestimating the “emotional” cost of being scammed seeing as when WE are scammed, it’s being use scammed for sex, which is a pretty damn high emotional cost.  ",
                                                    "author": "milliondollarkitty",
                                                    "id": "e37qm54",
                                                    "parent_id": "t1_e37k38o",
                                                    "score": 16,
                                                    "created_utc": 1532826717.0,
                                                    "replies": [
                                                        {
                                                            "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
                                                            "author": null,
                                                            "id": "e37qyzf",
                                                            "parent_id": "t1_e37qm54",
                                                            "score": 0,
                                                            "created_utc": 1532827118.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                                                                    "author": "milliondollarkitty",
                                                                    "id": "e37rciy",
                                                                    "parent_id": "t1_e37qyzf",
                                                                    "score": 7,
                                                                    "created_utc": 1532827546.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                                                                            "author": null,
                                                                            "id": "e37rl41",
                                                                            "parent_id": "t1_e37rciy",
                                                                            "score": 0,
                                                                            "created_utc": 1532827819.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> You should receive your allowance prior to engaging in any intimacy, especially if it is your first few times being intimate. This non negotiable. \n\nThere's a lot of good stuff here. While I understand an appreciate the need to ensure you're not scammed out of intimacy for no money, I also feel like if at that stage you're unsure he will pony up, then you haven't done your vetting like you should have. If you've followed every piece of advice up to that point, I think you can be confident he's not going to then suddenly pull the rug out from under you.\n\nOn the other hand, if you didn't follow everything to the letter, and you instead met him same day at a hotel, then you absolutely should insist on the money upfront.  \n\nBottom line is, if you're unsure, then keep vetting him.\n\n&#x200B;",
            "author": "gingerdaddy56",
            "id": "eaftu88",
            "parent_id": "t3_92igpx",
            "score": 3,
            "created_utc": 1543162686.0,
            "replies": []
        },
        {
            "body": "This is extremely helpful I loved reading this so many great advice and things to look out for. I have made it pass my first M&G and so far it’s been going good. I’ll be keeping these tips in mind!!! 🥰❤️",
            "author": "ssenseii_",
            "id": "ijsknb9",
            "parent_id": "t3_92igpx",
            "score": 3,
            "created_utc": 1660177240.0,
            "replies": [
                {
                    "body": "THIS is GREAT GREAT stuff!  LOVE IT!  Thank you so much for all of the great info",
                    "author": "Klandystine",
                    "id": "inofbs4",
                    "parent_id": "t1_ijsknb9",
                    "score": 1,
                    "created_utc": 1662691867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This should be added to the wiki! ",
            "author": "tannedsb05",
            "id": "e360n6c",
            "parent_id": "t3_92igpx",
            "score": 5,
            "created_utc": 1532745145.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e36f697",
                    "parent_id": "t1_e360n6c",
                    "score": 2,
                    "created_utc": 1532768399.0,
                    "replies": [
                        {
                            "body": "A mess? It's very readable, both with grammar and formatting.\n\nGood job, girl.",
                            "author": "blonde-throwaway",
                            "id": "e36fswn",
                            "parent_id": "t1_e36f697",
                            "score": 10,
                            "created_utc": 1532769876.0,
                            "replies": []
                        },
                        {
                            "body": "I think it looks great ",
                            "author": "tannedsb05",
                            "id": "e36jq87",
                            "parent_id": "t1_e36f697",
                            "score": 1,
                            "created_utc": 1532778564.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "e36klep",
                                    "parent_id": "t1_e36jq87",
                                    "score": 1,
                                    "created_utc": 1532780109.0,
                                    "replies": [
                                        {
                                            "body": "Mobile it looks fine. I rarely log on the computer. ",
                                            "author": "tannedsb05",
                                            "id": "e36n2ky",
                                            "parent_id": "t1_e36klep",
                                            "score": 3,
                                            "created_utc": 1532783917.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Mobile it looks fine. I rarely log on the computer. ",
                                            "author": "tannedsb05",
                                            "id": "e36n34o",
                                            "parent_id": "t1_e36klep",
                                            "score": 1,
                                            "created_utc": 1532783938.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I'm using the iOS app on my iPad Pro.  It's one of the best written and formatted post I've read.  Using the iOS app has it's shortcomings but when reading posts, it's 10x better than the web version on a MacBook.  ",
                                            "author": "MasterAcct2020",
                                            "id": "e36u49t",
                                            "parent_id": "t1_e36klep",
                                            "score": 1,
                                            "created_utc": 1532792265.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for this post! I had a question: if a SD asks what you study in school should I tell him the truth or fabricate that too?",
            "author": null,
            "id": "e37cr5s",
            "parent_id": "t3_92igpx",
            "score": 2,
            "created_utc": 1532811650.0,
            "replies": [
                {
                    "body": "Every lie you tell opens a point of vulnerability..........  \n\nIf your major is Pole Dancing at a local trade school and you tell the pot that you major is trans-sonic aerodynamics  it might come back to haunt you. ",
                    "author": "pinotandsugar",
                    "id": "e37f0em",
                    "parent_id": "t1_e37cr5s",
                    "score": 15,
                    "created_utc": 1532814011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " \"a great way to identify a man of means is by how much he would spend on his watch or his shoes if those were high priorities for him.\"\n\nFTFY",
            "author": "highfructoseSD",
            "id": "e363sl0",
            "parent_id": "t3_92igpx",
            "score": 3,
            "created_utc": 1532748967.0,
            "replies": [
                {
                    "body": "That’s why I prefaced it by it being in no way, shape, or form fool proof :-)",
                    "author": "milliondollarkitty",
                    "id": "e3657cg",
                    "parent_id": "t1_e363sl0",
                    "score": 4,
                    "created_utc": 1532750804.0,
                    "replies": [
                        {
                            "body": "I think this has so many caveats it becomes useless. MANY rich people don't show off, either because of upbringing or they just don't see the point of \"wasting\" money on luxuries.\n\nI myself count as one of those, i do very well for myseld but you wouldn't be able to tell since i wear regular watches/shoes and drive an average car.\n\nMaybe its because i was raised in south america and showing off can quickly get you into a shitload of trouble.",
                            "author": null,
                            "id": "e37kqxp",
                            "parent_id": "t1_e3657cg",
                            "score": 5,
                            "created_utc": 1532820003.0,
                            "replies": [
                                {
                                    "body": "Why does everyone keep holding onto this one tiny part?  It’s merely a suggestion and before I even said it I mentioned that it is not foolproof at all.",
                                    "author": "milliondollarkitty",
                                    "id": "e37nvrj",
                                    "parent_id": "t1_e37kqxp",
                                    "score": 4,
                                    "created_utc": 1532823510.0,
                                    "replies": [
                                        {
                                            "body": ">Why does everyone keep holding onto this one tiny part? \n\nBecause it's bad advice in a post of mostly good stuff.",
                                            "author": null,
                                            "id": "e37p23v",
                                            "parent_id": "t1_e37nvrj",
                                            "score": 4,
                                            "created_utc": 1532824907.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e36g9k0",
                            "parent_id": "t1_e3657cg",
                            "score": 2,
                            "created_utc": 1532770977.0,
                            "replies": [
                                {
                                    "body": "haven't worn a watch since I was 13. carried pocket watches until I started carrying a phone all the time. much more likely to see some electronic gadget on someone's wrist these days, and I've actually been speculating with friends which of the traditional luxury watch makers will be the first to roll out an electronic wrist gadget under their brand name (although, we're actually more interested in whether it will be Apple-centric, Android-centric, or generic)",
                                    "author": "joc13",
                                    "id": "e36mw08",
                                    "parent_id": "t1_e36g9k0",
                                    "score": 4,
                                    "created_utc": 1532783662.0,
                                    "replies": []
                                },
                                {
                                    "body": "> Do men still wear watches?\n\nI get comments on my Apple Watch and the Mickey Mouse face I use from POT SB's sometimes.",
                                    "author": null,
                                    "id": "e36re3o",
                                    "parent_id": "t1_e36g9k0",
                                    "score": 2,
                                    "created_utc": 1532789243.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s what I was thinking, thanks!!",
            "author": "SusyJo84",
            "id": "e3e56a1",
            "parent_id": "t3_92igpx",
            "score": 1,
            "created_utc": 1533094240.0,
            "replies": []
        },
        {
            "body": "I am  new SB but some of this is really hard to find such as Before meeting getting paid ?",
            "author": null,
            "id": "e87rgdl",
            "parent_id": "t3_92igpx",
            "score": 1,
            "created_utc": 1540176890.0,
            "replies": [
                {
                    "body": "What do you mean?  You want an SD to pay you before you ever even meet him?",
                    "author": "milliondollarkitty",
                    "id": "e87xaw8",
                    "parent_id": "t1_e87rgdl",
                    "score": 2,
                    "created_utc": 1540184036.0,
                    "replies": [
                        {
                            "body": "No .. I am saying the ones that have tried to make deals with me would say things ill pay you at the end of the week and then disappeared ....so its hard to find a SD willing to make a  arrangement that they stick to",
                            "author": null,
                            "id": "e8802mt",
                            "parent_id": "t1_e87xaw8",
                            "score": 2,
                            "created_utc": 1540188467.0,
                            "replies": [
                                {
                                    "body": "Yikes. I'm new too, but that's no good. There are plenty of guys on the site. Follow that advice of getting paid before going anywhere in private.",
                                    "author": "foodnotbombsRVA",
                                    "id": "eakxtkx",
                                    "parent_id": "t1_e8802mt",
                                    "score": 5,
                                    "created_utc": 1543338431.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm going to favourite this as ref, thank you so much for posting this!",
            "author": "SatanWithFur",
            "id": "eeo2ynw",
            "parent_id": "t3_92igpx",
            "score": 1,
            "created_utc": 1548129397.0,
            "replies": []
        },
        {
            "body": ">Anyone asking to pay you at the end of the week/month is a scammer. You’ll spend that amount of time with them and never see the allowance that was promised. \n\nCouldn't you say the exact same thing about SBs asking to be paid a month in advance? (allowance)\n\nYou will give her the money only for her to ghost you.",
            "author": null,
            "id": "e37jhxz",
            "parent_id": "t3_92igpx",
            "score": 1,
            "created_utc": 1532818676.0,
            "replies": []
        },
        {
            "body": ".",
            "author": "whoopsieswhatsthis",
            "id": "e376m7m",
            "parent_id": "t3_92igpx",
            "score": -1,
            "created_utc": 1532805212.0,
            "replies": [
                {
                    "body": "I think this is an extremely well written and direct piece of writing that all SB’s would do well to read. I am a guy LOL and an SD with some experience both good and bad and I would like to do the same kind of thing for all the SD’s out there! My sincere compliments to the author of the original post. ",
                    "author": null,
                    "id": "e8ka1z6",
                    "parent_id": "t1_e376m7m",
                    "score": 1,
                    "created_utc": 1540668809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So much information!!! Thank you very much for this!",
            "author": null,
            "id": "iauv8st",
            "parent_id": "t3_92igpx",
            "score": 1,
            "created_utc": 1654131472.0,
            "replies": []
        },
        {
            "body": "I would think you might be a cop trying to entrap a join. Of course, going to school for CJ is legit, but that is the thought it would engender. I'd suggest not mentioning that.",
            "author": "StiffHappens",
            "id": "im8o4y1",
            "parent_id": "t1_e37dih2",
            "score": 5,
            "created_utc": 1661770006.0,
            "replies": []
        },
        {
            "body": "Thank you for this. You just answered all my questions.  I think every sentence in here was a question that I was wondering about.  ",
            "author": null,
            "id": "eb0yefo",
            "parent_id": "t1_e9vq54c",
            "score": 2,
            "created_utc": 1543871884.0,
            "replies": [
                {
                    "body": "Thanks for the nice words",
                    "author": null,
                    "id": "eb1iiur",
                    "parent_id": "t1_eb0yefo",
                    "score": 1,
                    "created_utc": 1543888309.0,
                    "replies": [
                        {
                            "body": "It would be absolutely amazing if you could “train” other SDs to be like you! You sound lovely and considerate😍",
                            "author": null,
                            "id": "hsqk4jd",
                            "parent_id": "t1_eb1iiur",
                            "score": 2,
                            "created_utc": 1642230021.0,
                            "replies": [
                                {
                                    "body": "We should chat ;)",
                                    "author": null,
                                    "id": "hto19v2",
                                    "parent_id": "t1_hsqk4jd",
                                    "score": 4,
                                    "created_utc": 1642807137.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is one more candidate for a post that should have a link on the right side of the page - so many reasonable questions are answered here.",
            "author": "WalksLikeADuckSo",
            "id": "e36lzzz",
            "parent_id": "t1_e35z3fr",
            "score": 7,
            "created_utc": 1532782367.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e36wbwh",
            "parent_id": "t1_e36tb4i",
            "score": 3,
            "created_utc": 1532794626.0,
            "replies": [
                {
                    "body": " That is a good point, I should have been specific.  ",
                    "author": "CentralUSGal",
                    "id": "e36z2o9",
                    "parent_id": "t1_e36wbwh",
                    "score": 2,
                    "created_utc": 1532797435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would definitely make it vague until you get to know them and feel comfortable sharing more info.  You can just say you’re in the medical field to start.",
            "author": "milliondollarkitty",
            "id": "e3e538k",
            "parent_id": "t1_e3dzzv1",
            "score": 5,
            "created_utc": 1533094146.0,
            "replies": []
        },
        {
            "body": "Valet parking solves the physical risk but he does get to see your plates.  ",
            "author": "pinotandsugar",
            "id": "e36aexc",
            "parent_id": "t1_e365lxy",
            "score": 3,
            "created_utc": 1532758696.0,
            "replies": []
        },
        {
            "body": "> All of your personal information (including your address) can be pulled from your license plate.\n\nLast time this was discussed in this forum this was not proven, one person used a site someone said could do this (they had to pay for it) and it did give a name and address for each of their license plates, but none of the information the site provided was accurate.  There are sites that claim they can do this *in some cases*, but it appears to be mostly a myth.",
            "author": null,
            "id": "e36rbou",
            "parent_id": "t1_e365lxy",
            "score": 3,
            "created_utc": 1532789169.0,
            "replies": []
        },
        {
            "body": "I personally think that’s up to the SB.  While I have done PPM in the past, I don’t really like it.  While I do sometimes start with monthly, sometimes we compromise and start with biweekly allowance and it’s never been a problem.  I will say that I vet my POTs extensively and go on several platonic dates before officially beginning the arrangement.  I feel that may have something to do with it.",
            "author": "milliondollarkitty",
            "id": "e35zee9",
            "parent_id": "t1_e35z40u",
            "score": 10,
            "created_utc": 1532743689.0,
            "replies": [
                {
                    "body": "I think the half month in advance of the first intimacy is a really good way to go in today's environment.  If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either  under resourced or under confident he is making a wise choice.  Several platonic dates plus half month in advance  is probably the best filter",
                    "author": "pinotandsugar",
                    "id": "e36ad1h",
                    "parent_id": "t1_e35zee9",
                    "score": 18,
                    "created_utc": 1532758607.0,
                    "replies": [
                        {
                            "body": ">If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either under resourced or under confident he is making a wise choice.\n\nOR, he doesn't want to take additional risk that he doesn't have to.\n\nWhy risk it with allowance when the bowl has made PPM standard?\n\nNo matter how much vetting you do, what's the point in risking even $1 if you don't have to?",
                            "author": null,
                            "id": "e37e9gw",
                            "parent_id": "t1_e36ad1h",
                            "score": 7,
                            "created_utc": 1532813241.0,
                            "replies": []
                        },
                        {
                            "body": "I do PPM for the first intimate date, no exceptions.  Maybe just a reflection of different experiences we've all had in the bowl -- my experience tells me that anything beyond PPM is borderline reckless,, but it sounds like you haven't experienced the same, so maybe that's all a factor of something else.  It's not that I'll be financially crushed if I lose part of a half month allowance ... but everyone hates the feeling of being taken for a sucker.   Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTotally accept that the two of you found a different way that works better for you, not arguing against the way that you've found works ... but wonder now if we asked this, if there isn't a consensus best way here.",
                            "author": "Azurecole",
                            "id": "e36sju2",
                            "parent_id": "t1_e36ad1h",
                            "score": 7,
                            "created_utc": 1532790530.0,
                            "replies": [
                                {
                                    "body": "One man's \" reckless\" is another man's marketing opportunity and  \"Best\" is in the eye, mission objectives and pocketbook of the beholder.  \n\nIn well over 10 years of sugaring I might have lost 2 advance payments. But what I have been told by several SB's was that the way the arrangement started helped them to  feel both comfortable and respected.  Just as in business some clients want to work with you as a trusted partner and others are constantly looking for ways to get freebies. \n\nBecause of the nature of the work I do, searching for a replacement SB costs money.  In a moment of stupidity some years ago I tracked some of the time that it took to find a replacement SB  when one moved away, it was somewhere between 3-8 months allowance, mostly due to my trying to find and recruit from too many prospects plus loosing some prospects where we had an unconsummated arrangement. \n\nWhile the economics are significant I think the major change is in the dynamics of the first intimacy.   The first generally has a significant impact on the future.  \n\nThere's no right or wrong answer , the important thing is that it is consistent with your mission objectives, strategy and the envelope in which you want to operate.  \n\n\n\n ",
                                    "author": "pinotandsugar",
                                    "id": "e3742h9",
                                    "parent_id": "t1_e36sju2",
                                    "score": 13,
                                    "created_utc": 1532802534.0,
                                    "replies": []
                                },
                                {
                                    "body": "I give a monthly allowance in advance of intimacy.  I haven’t gotten scammed yet (small experience so far) but if I do I will consider it the best $ I’ve ever spent.  I’d cheerfully pay two monthly allowances to find out that the POT is dishonest before I engage in intimacy.  No price is too high to avoid an intimate relationship with a dishonest person.  Now if she brings up $ on the first email, I’m outta there. I do a lot of conversational screening to figure out if she’s a decent person. But you can always be fooled, and the one guaranteed way to find out if she’s honest is to give her a free chance to steal from me. If she doesn’t, we’re off to the races. If she does, good riddance :-)",
                                    "author": null,
                                    "id": "e38f6xv",
                                    "parent_id": "t1_e36sju2",
                                    "score": 12,
                                    "created_utc": 1532867129.0,
                                    "replies": []
                                },
                                {
                                    "body": ">but everyone hates the feeling of being taken for a sucker. Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTHIS, there is a huge EMOTIONAL cost of being scammed that most SBs grossly understimate.\n\nThey say \"lol, it's just $500, that's nothing to you\". And while true, it pains me and stresses me out to be taken for a fool, so i take measures to prevent it which many SBs take as being salty.",
                                    "author": null,
                                    "id": "e37k38o",
                                    "parent_id": "t1_e36sju2",
                                    "score": 8,
                                    "created_utc": 1532819300.0,
                                    "replies": [
                                        {
                                            "body": "I don’t think anyone is underestimating the “emotional” cost of being scammed seeing as when WE are scammed, it’s being use scammed for sex, which is a pretty damn high emotional cost.  ",
                                            "author": "milliondollarkitty",
                                            "id": "e37qm54",
                                            "parent_id": "t1_e37k38o",
                                            "score": 16,
                                            "created_utc": 1532826717.0,
                                            "replies": [
                                                {
                                                    "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
                                                    "author": null,
                                                    "id": "e37qyzf",
                                                    "parent_id": "t1_e37qm54",
                                                    "score": 0,
                                                    "created_utc": 1532827118.0,
                                                    "replies": [
                                                        {
                                                            "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                                                            "author": "milliondollarkitty",
                                                            "id": "e37rciy",
                                                            "parent_id": "t1_e37qyzf",
                                                            "score": 7,
                                                            "created_utc": 1532827546.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                                                                    "author": null,
                                                                    "id": "e37rl41",
                                                                    "parent_id": "t1_e37rciy",
                                                                    "score": 0,
                                                                    "created_utc": 1532827819.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "THIS is GREAT GREAT stuff!  LOVE IT!  Thank you so much for all of the great info",
            "author": "Klandystine",
            "id": "inofbs4",
            "parent_id": "t1_ijsknb9",
            "score": 1,
            "created_utc": 1662691867.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e36f697",
            "parent_id": "t1_e360n6c",
            "score": 2,
            "created_utc": 1532768399.0,
            "replies": [
                {
                    "body": "A mess? It's very readable, both with grammar and formatting.\n\nGood job, girl.",
                    "author": "blonde-throwaway",
                    "id": "e36fswn",
                    "parent_id": "t1_e36f697",
                    "score": 10,
                    "created_utc": 1532769876.0,
                    "replies": []
                },
                {
                    "body": "I think it looks great ",
                    "author": "tannedsb05",
                    "id": "e36jq87",
                    "parent_id": "t1_e36f697",
                    "score": 1,
                    "created_utc": 1532778564.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e36klep",
                            "parent_id": "t1_e36jq87",
                            "score": 1,
                            "created_utc": 1532780109.0,
                            "replies": [
                                {
                                    "body": "Mobile it looks fine. I rarely log on the computer. ",
                                    "author": "tannedsb05",
                                    "id": "e36n2ky",
                                    "parent_id": "t1_e36klep",
                                    "score": 3,
                                    "created_utc": 1532783917.0,
                                    "replies": []
                                },
                                {
                                    "body": "Mobile it looks fine. I rarely log on the computer. ",
                                    "author": "tannedsb05",
                                    "id": "e36n34o",
                                    "parent_id": "t1_e36klep",
                                    "score": 1,
                                    "created_utc": 1532783938.0,
                                    "replies": []
                                },
                                {
                                    "body": "I'm using the iOS app on my iPad Pro.  It's one of the best written and formatted post I've read.  Using the iOS app has it's shortcomings but when reading posts, it's 10x better than the web version on a MacBook.  ",
                                    "author": "MasterAcct2020",
                                    "id": "e36u49t",
                                    "parent_id": "t1_e36klep",
                                    "score": 1,
                                    "created_utc": 1532792265.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Every lie you tell opens a point of vulnerability..........  \n\nIf your major is Pole Dancing at a local trade school and you tell the pot that you major is trans-sonic aerodynamics  it might come back to haunt you. ",
            "author": "pinotandsugar",
            "id": "e37f0em",
            "parent_id": "t1_e37cr5s",
            "score": 15,
            "created_utc": 1532814011.0,
            "replies": []
        },
        {
            "body": "That’s why I prefaced it by it being in no way, shape, or form fool proof :-)",
            "author": "milliondollarkitty",
            "id": "e3657cg",
            "parent_id": "t1_e363sl0",
            "score": 4,
            "created_utc": 1532750804.0,
            "replies": [
                {
                    "body": "I think this has so many caveats it becomes useless. MANY rich people don't show off, either because of upbringing or they just don't see the point of \"wasting\" money on luxuries.\n\nI myself count as one of those, i do very well for myseld but you wouldn't be able to tell since i wear regular watches/shoes and drive an average car.\n\nMaybe its because i was raised in south america and showing off can quickly get you into a shitload of trouble.",
                    "author": null,
                    "id": "e37kqxp",
                    "parent_id": "t1_e3657cg",
                    "score": 5,
                    "created_utc": 1532820003.0,
                    "replies": [
                        {
                            "body": "Why does everyone keep holding onto this one tiny part?  It’s merely a suggestion and before I even said it I mentioned that it is not foolproof at all.",
                            "author": "milliondollarkitty",
                            "id": "e37nvrj",
                            "parent_id": "t1_e37kqxp",
                            "score": 4,
                            "created_utc": 1532823510.0,
                            "replies": [
                                {
                                    "body": ">Why does everyone keep holding onto this one tiny part? \n\nBecause it's bad advice in a post of mostly good stuff.",
                                    "author": null,
                                    "id": "e37p23v",
                                    "parent_id": "t1_e37nvrj",
                                    "score": 4,
                                    "created_utc": 1532824907.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e36g9k0",
                    "parent_id": "t1_e3657cg",
                    "score": 2,
                    "created_utc": 1532770977.0,
                    "replies": [
                        {
                            "body": "haven't worn a watch since I was 13. carried pocket watches until I started carrying a phone all the time. much more likely to see some electronic gadget on someone's wrist these days, and I've actually been speculating with friends which of the traditional luxury watch makers will be the first to roll out an electronic wrist gadget under their brand name (although, we're actually more interested in whether it will be Apple-centric, Android-centric, or generic)",
                            "author": "joc13",
                            "id": "e36mw08",
                            "parent_id": "t1_e36g9k0",
                            "score": 4,
                            "created_utc": 1532783662.0,
                            "replies": []
                        },
                        {
                            "body": "> Do men still wear watches?\n\nI get comments on my Apple Watch and the Mickey Mouse face I use from POT SB's sometimes.",
                            "author": null,
                            "id": "e36re3o",
                            "parent_id": "t1_e36g9k0",
                            "score": 2,
                            "created_utc": 1532789243.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What do you mean?  You want an SD to pay you before you ever even meet him?",
            "author": "milliondollarkitty",
            "id": "e87xaw8",
            "parent_id": "t1_e87rgdl",
            "score": 2,
            "created_utc": 1540184036.0,
            "replies": [
                {
                    "body": "No .. I am saying the ones that have tried to make deals with me would say things ill pay you at the end of the week and then disappeared ....so its hard to find a SD willing to make a  arrangement that they stick to",
                    "author": null,
                    "id": "e8802mt",
                    "parent_id": "t1_e87xaw8",
                    "score": 2,
                    "created_utc": 1540188467.0,
                    "replies": [
                        {
                            "body": "Yikes. I'm new too, but that's no good. There are plenty of guys on the site. Follow that advice of getting paid before going anywhere in private.",
                            "author": "foodnotbombsRVA",
                            "id": "eakxtkx",
                            "parent_id": "t1_e8802mt",
                            "score": 5,
                            "created_utc": 1543338431.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is an extremely well written and direct piece of writing that all SB’s would do well to read. I am a guy LOL and an SD with some experience both good and bad and I would like to do the same kind of thing for all the SD’s out there! My sincere compliments to the author of the original post. ",
            "author": null,
            "id": "e8ka1z6",
            "parent_id": "t1_e376m7m",
            "score": 1,
            "created_utc": 1540668809.0,
            "replies": []
        },
        {
            "body": "Thanks for the nice words",
            "author": null,
            "id": "eb1iiur",
            "parent_id": "t1_eb0yefo",
            "score": 1,
            "created_utc": 1543888309.0,
            "replies": [
                {
                    "body": "It would be absolutely amazing if you could “train” other SDs to be like you! You sound lovely and considerate😍",
                    "author": null,
                    "id": "hsqk4jd",
                    "parent_id": "t1_eb1iiur",
                    "score": 2,
                    "created_utc": 1642230021.0,
                    "replies": [
                        {
                            "body": "We should chat ;)",
                            "author": null,
                            "id": "hto19v2",
                            "parent_id": "t1_hsqk4jd",
                            "score": 4,
                            "created_utc": 1642807137.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": " That is a good point, I should have been specific.  ",
            "author": "CentralUSGal",
            "id": "e36z2o9",
            "parent_id": "t1_e36wbwh",
            "score": 2,
            "created_utc": 1532797435.0,
            "replies": []
        },
        {
            "body": "I think the half month in advance of the first intimacy is a really good way to go in today's environment.  If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either  under resourced or under confident he is making a wise choice.  Several platonic dates plus half month in advance  is probably the best filter",
            "author": "pinotandsugar",
            "id": "e36ad1h",
            "parent_id": "t1_e35zee9",
            "score": 18,
            "created_utc": 1532758607.0,
            "replies": [
                {
                    "body": ">If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either under resourced or under confident he is making a wise choice.\n\nOR, he doesn't want to take additional risk that he doesn't have to.\n\nWhy risk it with allowance when the bowl has made PPM standard?\n\nNo matter how much vetting you do, what's the point in risking even $1 if you don't have to?",
                    "author": null,
                    "id": "e37e9gw",
                    "parent_id": "t1_e36ad1h",
                    "score": 7,
                    "created_utc": 1532813241.0,
                    "replies": []
                },
                {
                    "body": "I do PPM for the first intimate date, no exceptions.  Maybe just a reflection of different experiences we've all had in the bowl -- my experience tells me that anything beyond PPM is borderline reckless,, but it sounds like you haven't experienced the same, so maybe that's all a factor of something else.  It's not that I'll be financially crushed if I lose part of a half month allowance ... but everyone hates the feeling of being taken for a sucker.   Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTotally accept that the two of you found a different way that works better for you, not arguing against the way that you've found works ... but wonder now if we asked this, if there isn't a consensus best way here.",
                    "author": "Azurecole",
                    "id": "e36sju2",
                    "parent_id": "t1_e36ad1h",
                    "score": 7,
                    "created_utc": 1532790530.0,
                    "replies": [
                        {
                            "body": "One man's \" reckless\" is another man's marketing opportunity and  \"Best\" is in the eye, mission objectives and pocketbook of the beholder.  \n\nIn well over 10 years of sugaring I might have lost 2 advance payments. But what I have been told by several SB's was that the way the arrangement started helped them to  feel both comfortable and respected.  Just as in business some clients want to work with you as a trusted partner and others are constantly looking for ways to get freebies. \n\nBecause of the nature of the work I do, searching for a replacement SB costs money.  In a moment of stupidity some years ago I tracked some of the time that it took to find a replacement SB  when one moved away, it was somewhere between 3-8 months allowance, mostly due to my trying to find and recruit from too many prospects plus loosing some prospects where we had an unconsummated arrangement. \n\nWhile the economics are significant I think the major change is in the dynamics of the first intimacy.   The first generally has a significant impact on the future.  \n\nThere's no right or wrong answer , the important thing is that it is consistent with your mission objectives, strategy and the envelope in which you want to operate.  \n\n\n\n ",
                            "author": "pinotandsugar",
                            "id": "e3742h9",
                            "parent_id": "t1_e36sju2",
                            "score": 13,
                            "created_utc": 1532802534.0,
                            "replies": []
                        },
                        {
                            "body": "I give a monthly allowance in advance of intimacy.  I haven’t gotten scammed yet (small experience so far) but if I do I will consider it the best $ I’ve ever spent.  I’d cheerfully pay two monthly allowances to find out that the POT is dishonest before I engage in intimacy.  No price is too high to avoid an intimate relationship with a dishonest person.  Now if she brings up $ on the first email, I’m outta there. I do a lot of conversational screening to figure out if she’s a decent person. But you can always be fooled, and the one guaranteed way to find out if she’s honest is to give her a free chance to steal from me. If she doesn’t, we’re off to the races. If she does, good riddance :-)",
                            "author": null,
                            "id": "e38f6xv",
                            "parent_id": "t1_e36sju2",
                            "score": 12,
                            "created_utc": 1532867129.0,
                            "replies": []
                        },
                        {
                            "body": ">but everyone hates the feeling of being taken for a sucker. Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTHIS, there is a huge EMOTIONAL cost of being scammed that most SBs grossly understimate.\n\nThey say \"lol, it's just $500, that's nothing to you\". And while true, it pains me and stresses me out to be taken for a fool, so i take measures to prevent it which many SBs take as being salty.",
                            "author": null,
                            "id": "e37k38o",
                            "parent_id": "t1_e36sju2",
                            "score": 8,
                            "created_utc": 1532819300.0,
                            "replies": [
                                {
                                    "body": "I don’t think anyone is underestimating the “emotional” cost of being scammed seeing as when WE are scammed, it’s being use scammed for sex, which is a pretty damn high emotional cost.  ",
                                    "author": "milliondollarkitty",
                                    "id": "e37qm54",
                                    "parent_id": "t1_e37k38o",
                                    "score": 16,
                                    "created_utc": 1532826717.0,
                                    "replies": [
                                        {
                                            "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
                                            "author": null,
                                            "id": "e37qyzf",
                                            "parent_id": "t1_e37qm54",
                                            "score": 0,
                                            "created_utc": 1532827118.0,
                                            "replies": [
                                                {
                                                    "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                                                    "author": "milliondollarkitty",
                                                    "id": "e37rciy",
                                                    "parent_id": "t1_e37qyzf",
                                                    "score": 7,
                                                    "created_utc": 1532827546.0,
                                                    "replies": [
                                                        {
                                                            "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                                                            "author": null,
                                                            "id": "e37rl41",
                                                            "parent_id": "t1_e37rciy",
                                                            "score": 0,
                                                            "created_utc": 1532827819.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A mess? It's very readable, both with grammar and formatting.\n\nGood job, girl.",
            "author": "blonde-throwaway",
            "id": "e36fswn",
            "parent_id": "t1_e36f697",
            "score": 10,
            "created_utc": 1532769876.0,
            "replies": []
        },
        {
            "body": "I think it looks great ",
            "author": "tannedsb05",
            "id": "e36jq87",
            "parent_id": "t1_e36f697",
            "score": 1,
            "created_utc": 1532778564.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e36klep",
                    "parent_id": "t1_e36jq87",
                    "score": 1,
                    "created_utc": 1532780109.0,
                    "replies": [
                        {
                            "body": "Mobile it looks fine. I rarely log on the computer. ",
                            "author": "tannedsb05",
                            "id": "e36n2ky",
                            "parent_id": "t1_e36klep",
                            "score": 3,
                            "created_utc": 1532783917.0,
                            "replies": []
                        },
                        {
                            "body": "Mobile it looks fine. I rarely log on the computer. ",
                            "author": "tannedsb05",
                            "id": "e36n34o",
                            "parent_id": "t1_e36klep",
                            "score": 1,
                            "created_utc": 1532783938.0,
                            "replies": []
                        },
                        {
                            "body": "I'm using the iOS app on my iPad Pro.  It's one of the best written and formatted post I've read.  Using the iOS app has it's shortcomings but when reading posts, it's 10x better than the web version on a MacBook.  ",
                            "author": "MasterAcct2020",
                            "id": "e36u49t",
                            "parent_id": "t1_e36klep",
                            "score": 1,
                            "created_utc": 1532792265.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this has so many caveats it becomes useless. MANY rich people don't show off, either because of upbringing or they just don't see the point of \"wasting\" money on luxuries.\n\nI myself count as one of those, i do very well for myseld but you wouldn't be able to tell since i wear regular watches/shoes and drive an average car.\n\nMaybe its because i was raised in south america and showing off can quickly get you into a shitload of trouble.",
            "author": null,
            "id": "e37kqxp",
            "parent_id": "t1_e3657cg",
            "score": 5,
            "created_utc": 1532820003.0,
            "replies": [
                {
                    "body": "Why does everyone keep holding onto this one tiny part?  It’s merely a suggestion and before I even said it I mentioned that it is not foolproof at all.",
                    "author": "milliondollarkitty",
                    "id": "e37nvrj",
                    "parent_id": "t1_e37kqxp",
                    "score": 4,
                    "created_utc": 1532823510.0,
                    "replies": [
                        {
                            "body": ">Why does everyone keep holding onto this one tiny part? \n\nBecause it's bad advice in a post of mostly good stuff.",
                            "author": null,
                            "id": "e37p23v",
                            "parent_id": "t1_e37nvrj",
                            "score": 4,
                            "created_utc": 1532824907.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e36g9k0",
            "parent_id": "t1_e3657cg",
            "score": 2,
            "created_utc": 1532770977.0,
            "replies": [
                {
                    "body": "haven't worn a watch since I was 13. carried pocket watches until I started carrying a phone all the time. much more likely to see some electronic gadget on someone's wrist these days, and I've actually been speculating with friends which of the traditional luxury watch makers will be the first to roll out an electronic wrist gadget under their brand name (although, we're actually more interested in whether it will be Apple-centric, Android-centric, or generic)",
                    "author": "joc13",
                    "id": "e36mw08",
                    "parent_id": "t1_e36g9k0",
                    "score": 4,
                    "created_utc": 1532783662.0,
                    "replies": []
                },
                {
                    "body": "> Do men still wear watches?\n\nI get comments on my Apple Watch and the Mickey Mouse face I use from POT SB's sometimes.",
                    "author": null,
                    "id": "e36re3o",
                    "parent_id": "t1_e36g9k0",
                    "score": 2,
                    "created_utc": 1532789243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No .. I am saying the ones that have tried to make deals with me would say things ill pay you at the end of the week and then disappeared ....so its hard to find a SD willing to make a  arrangement that they stick to",
            "author": null,
            "id": "e8802mt",
            "parent_id": "t1_e87xaw8",
            "score": 2,
            "created_utc": 1540188467.0,
            "replies": [
                {
                    "body": "Yikes. I'm new too, but that's no good. There are plenty of guys on the site. Follow that advice of getting paid before going anywhere in private.",
                    "author": "foodnotbombsRVA",
                    "id": "eakxtkx",
                    "parent_id": "t1_e8802mt",
                    "score": 5,
                    "created_utc": 1543338431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It would be absolutely amazing if you could “train” other SDs to be like you! You sound lovely and considerate😍",
            "author": null,
            "id": "hsqk4jd",
            "parent_id": "t1_eb1iiur",
            "score": 2,
            "created_utc": 1642230021.0,
            "replies": [
                {
                    "body": "We should chat ;)",
                    "author": null,
                    "id": "hto19v2",
                    "parent_id": "t1_hsqk4jd",
                    "score": 4,
                    "created_utc": 1642807137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">If the SD is unwilling to \"risk\" 25% of the monthly allowance he's either under resourced or under confident he is making a wise choice.\n\nOR, he doesn't want to take additional risk that he doesn't have to.\n\nWhy risk it with allowance when the bowl has made PPM standard?\n\nNo matter how much vetting you do, what's the point in risking even $1 if you don't have to?",
            "author": null,
            "id": "e37e9gw",
            "parent_id": "t1_e36ad1h",
            "score": 7,
            "created_utc": 1532813241.0,
            "replies": []
        },
        {
            "body": "I do PPM for the first intimate date, no exceptions.  Maybe just a reflection of different experiences we've all had in the bowl -- my experience tells me that anything beyond PPM is borderline reckless,, but it sounds like you haven't experienced the same, so maybe that's all a factor of something else.  It's not that I'll be financially crushed if I lose part of a half month allowance ... but everyone hates the feeling of being taken for a sucker.   Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTotally accept that the two of you found a different way that works better for you, not arguing against the way that you've found works ... but wonder now if we asked this, if there isn't a consensus best way here.",
            "author": "Azurecole",
            "id": "e36sju2",
            "parent_id": "t1_e36ad1h",
            "score": 7,
            "created_utc": 1532790530.0,
            "replies": [
                {
                    "body": "One man's \" reckless\" is another man's marketing opportunity and  \"Best\" is in the eye, mission objectives and pocketbook of the beholder.  \n\nIn well over 10 years of sugaring I might have lost 2 advance payments. But what I have been told by several SB's was that the way the arrangement started helped them to  feel both comfortable and respected.  Just as in business some clients want to work with you as a trusted partner and others are constantly looking for ways to get freebies. \n\nBecause of the nature of the work I do, searching for a replacement SB costs money.  In a moment of stupidity some years ago I tracked some of the time that it took to find a replacement SB  when one moved away, it was somewhere between 3-8 months allowance, mostly due to my trying to find and recruit from too many prospects plus loosing some prospects where we had an unconsummated arrangement. \n\nWhile the economics are significant I think the major change is in the dynamics of the first intimacy.   The first generally has a significant impact on the future.  \n\nThere's no right or wrong answer , the important thing is that it is consistent with your mission objectives, strategy and the envelope in which you want to operate.  \n\n\n\n ",
                    "author": "pinotandsugar",
                    "id": "e3742h9",
                    "parent_id": "t1_e36sju2",
                    "score": 13,
                    "created_utc": 1532802534.0,
                    "replies": []
                },
                {
                    "body": "I give a monthly allowance in advance of intimacy.  I haven’t gotten scammed yet (small experience so far) but if I do I will consider it the best $ I’ve ever spent.  I’d cheerfully pay two monthly allowances to find out that the POT is dishonest before I engage in intimacy.  No price is too high to avoid an intimate relationship with a dishonest person.  Now if she brings up $ on the first email, I’m outta there. I do a lot of conversational screening to figure out if she’s a decent person. But you can always be fooled, and the one guaranteed way to find out if she’s honest is to give her a free chance to steal from me. If she doesn’t, we’re off to the races. If she does, good riddance :-)",
                    "author": null,
                    "id": "e38f6xv",
                    "parent_id": "t1_e36sju2",
                    "score": 12,
                    "created_utc": 1532867129.0,
                    "replies": []
                },
                {
                    "body": ">but everyone hates the feeling of being taken for a sucker. Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTHIS, there is a huge EMOTIONAL cost of being scammed that most SBs grossly understimate.\n\nThey say \"lol, it's just $500, that's nothing to you\". And while true, it pains me and stresses me out to be taken for a fool, so i take measures to prevent it which many SBs take as being salty.",
                    "author": null,
                    "id": "e37k38o",
                    "parent_id": "t1_e36sju2",
                    "score": 8,
                    "created_utc": 1532819300.0,
                    "replies": [
                        {
                            "body": "I don’t think anyone is underestimating the “emotional” cost of being scammed seeing as when WE are scammed, it’s being use scammed for sex, which is a pretty damn high emotional cost.  ",
                            "author": "milliondollarkitty",
                            "id": "e37qm54",
                            "parent_id": "t1_e37k38o",
                            "score": 16,
                            "created_utc": 1532826717.0,
                            "replies": [
                                {
                                    "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
                                    "author": null,
                                    "id": "e37qyzf",
                                    "parent_id": "t1_e37qm54",
                                    "score": 0,
                                    "created_utc": 1532827118.0,
                                    "replies": [
                                        {
                                            "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                                            "author": "milliondollarkitty",
                                            "id": "e37rciy",
                                            "parent_id": "t1_e37qyzf",
                                            "score": 7,
                                            "created_utc": 1532827546.0,
                                            "replies": [
                                                {
                                                    "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                                                    "author": null,
                                                    "id": "e37rl41",
                                                    "parent_id": "t1_e37rciy",
                                                    "score": 0,
                                                    "created_utc": 1532827819.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e36klep",
            "parent_id": "t1_e36jq87",
            "score": 1,
            "created_utc": 1532780109.0,
            "replies": [
                {
                    "body": "Mobile it looks fine. I rarely log on the computer. ",
                    "author": "tannedsb05",
                    "id": "e36n2ky",
                    "parent_id": "t1_e36klep",
                    "score": 3,
                    "created_utc": 1532783917.0,
                    "replies": []
                },
                {
                    "body": "Mobile it looks fine. I rarely log on the computer. ",
                    "author": "tannedsb05",
                    "id": "e36n34o",
                    "parent_id": "t1_e36klep",
                    "score": 1,
                    "created_utc": 1532783938.0,
                    "replies": []
                },
                {
                    "body": "I'm using the iOS app on my iPad Pro.  It's one of the best written and formatted post I've read.  Using the iOS app has it's shortcomings but when reading posts, it's 10x better than the web version on a MacBook.  ",
                    "author": "MasterAcct2020",
                    "id": "e36u49t",
                    "parent_id": "t1_e36klep",
                    "score": 1,
                    "created_utc": 1532792265.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why does everyone keep holding onto this one tiny part?  It’s merely a suggestion and before I even said it I mentioned that it is not foolproof at all.",
            "author": "milliondollarkitty",
            "id": "e37nvrj",
            "parent_id": "t1_e37kqxp",
            "score": 4,
            "created_utc": 1532823510.0,
            "replies": [
                {
                    "body": ">Why does everyone keep holding onto this one tiny part? \n\nBecause it's bad advice in a post of mostly good stuff.",
                    "author": null,
                    "id": "e37p23v",
                    "parent_id": "t1_e37nvrj",
                    "score": 4,
                    "created_utc": 1532824907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "haven't worn a watch since I was 13. carried pocket watches until I started carrying a phone all the time. much more likely to see some electronic gadget on someone's wrist these days, and I've actually been speculating with friends which of the traditional luxury watch makers will be the first to roll out an electronic wrist gadget under their brand name (although, we're actually more interested in whether it will be Apple-centric, Android-centric, or generic)",
            "author": "joc13",
            "id": "e36mw08",
            "parent_id": "t1_e36g9k0",
            "score": 4,
            "created_utc": 1532783662.0,
            "replies": []
        },
        {
            "body": "> Do men still wear watches?\n\nI get comments on my Apple Watch and the Mickey Mouse face I use from POT SB's sometimes.",
            "author": null,
            "id": "e36re3o",
            "parent_id": "t1_e36g9k0",
            "score": 2,
            "created_utc": 1532789243.0,
            "replies": []
        },
        {
            "body": "Yikes. I'm new too, but that's no good. There are plenty of guys on the site. Follow that advice of getting paid before going anywhere in private.",
            "author": "foodnotbombsRVA",
            "id": "eakxtkx",
            "parent_id": "t1_e8802mt",
            "score": 5,
            "created_utc": 1543338431.0,
            "replies": []
        },
        {
            "body": "We should chat ;)",
            "author": null,
            "id": "hto19v2",
            "parent_id": "t1_hsqk4jd",
            "score": 4,
            "created_utc": 1642807137.0,
            "replies": []
        },
        {
            "body": "One man's \" reckless\" is another man's marketing opportunity and  \"Best\" is in the eye, mission objectives and pocketbook of the beholder.  \n\nIn well over 10 years of sugaring I might have lost 2 advance payments. But what I have been told by several SB's was that the way the arrangement started helped them to  feel both comfortable and respected.  Just as in business some clients want to work with you as a trusted partner and others are constantly looking for ways to get freebies. \n\nBecause of the nature of the work I do, searching for a replacement SB costs money.  In a moment of stupidity some years ago I tracked some of the time that it took to find a replacement SB  when one moved away, it was somewhere between 3-8 months allowance, mostly due to my trying to find and recruit from too many prospects plus loosing some prospects where we had an unconsummated arrangement. \n\nWhile the economics are significant I think the major change is in the dynamics of the first intimacy.   The first generally has a significant impact on the future.  \n\nThere's no right or wrong answer , the important thing is that it is consistent with your mission objectives, strategy and the envelope in which you want to operate.  \n\n\n\n ",
            "author": "pinotandsugar",
            "id": "e3742h9",
            "parent_id": "t1_e36sju2",
            "score": 13,
            "created_utc": 1532802534.0,
            "replies": []
        },
        {
            "body": "I give a monthly allowance in advance of intimacy.  I haven’t gotten scammed yet (small experience so far) but if I do I will consider it the best $ I’ve ever spent.  I’d cheerfully pay two monthly allowances to find out that the POT is dishonest before I engage in intimacy.  No price is too high to avoid an intimate relationship with a dishonest person.  Now if she brings up $ on the first email, I’m outta there. I do a lot of conversational screening to figure out if she’s a decent person. But you can always be fooled, and the one guaranteed way to find out if she’s honest is to give her a free chance to steal from me. If she doesn’t, we’re off to the races. If she does, good riddance :-)",
            "author": null,
            "id": "e38f6xv",
            "parent_id": "t1_e36sju2",
            "score": 12,
            "created_utc": 1532867129.0,
            "replies": []
        },
        {
            "body": ">but everyone hates the feeling of being taken for a sucker. Or maybe another way of saying it, I'd rather lose $10, than have someone swindle me for $5.\n\nTHIS, there is a huge EMOTIONAL cost of being scammed that most SBs grossly understimate.\n\nThey say \"lol, it's just $500, that's nothing to you\". And while true, it pains me and stresses me out to be taken for a fool, so i take measures to prevent it which many SBs take as being salty.",
            "author": null,
            "id": "e37k38o",
            "parent_id": "t1_e36sju2",
            "score": 8,
            "created_utc": 1532819300.0,
            "replies": [
                {
                    "body": "I don’t think anyone is underestimating the “emotional” cost of being scammed seeing as when WE are scammed, it’s being use scammed for sex, which is a pretty damn high emotional cost.  ",
                    "author": "milliondollarkitty",
                    "id": "e37qm54",
                    "parent_id": "t1_e37k38o",
                    "score": 16,
                    "created_utc": 1532826717.0,
                    "replies": [
                        {
                            "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
                            "author": null,
                            "id": "e37qyzf",
                            "parent_id": "t1_e37qm54",
                            "score": 0,
                            "created_utc": 1532827118.0,
                            "replies": [
                                {
                                    "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                                    "author": "milliondollarkitty",
                                    "id": "e37rciy",
                                    "parent_id": "t1_e37qyzf",
                                    "score": 7,
                                    "created_utc": 1532827546.0,
                                    "replies": [
                                        {
                                            "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                                            "author": null,
                                            "id": "e37rl41",
                                            "parent_id": "t1_e37rciy",
                                            "score": 0,
                                            "created_utc": 1532827819.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mobile it looks fine. I rarely log on the computer. ",
            "author": "tannedsb05",
            "id": "e36n2ky",
            "parent_id": "t1_e36klep",
            "score": 3,
            "created_utc": 1532783917.0,
            "replies": []
        },
        {
            "body": "Mobile it looks fine. I rarely log on the computer. ",
            "author": "tannedsb05",
            "id": "e36n34o",
            "parent_id": "t1_e36klep",
            "score": 1,
            "created_utc": 1532783938.0,
            "replies": []
        },
        {
            "body": "I'm using the iOS app on my iPad Pro.  It's one of the best written and formatted post I've read.  Using the iOS app has it's shortcomings but when reading posts, it's 10x better than the web version on a MacBook.  ",
            "author": "MasterAcct2020",
            "id": "e36u49t",
            "parent_id": "t1_e36klep",
            "score": 1,
            "created_utc": 1532792265.0,
            "replies": []
        },
        {
            "body": ">Why does everyone keep holding onto this one tiny part? \n\nBecause it's bad advice in a post of mostly good stuff.",
            "author": null,
            "id": "e37p23v",
            "parent_id": "t1_e37nvrj",
            "score": 4,
            "created_utc": 1532824907.0,
            "replies": []
        },
        {
            "body": "I don’t think anyone is underestimating the “emotional” cost of being scammed seeing as when WE are scammed, it’s being use scammed for sex, which is a pretty damn high emotional cost.  ",
            "author": "milliondollarkitty",
            "id": "e37qm54",
            "parent_id": "t1_e37k38o",
            "score": 16,
            "created_utc": 1532826717.0,
            "replies": [
                {
                    "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
                    "author": null,
                    "id": "e37qyzf",
                    "parent_id": "t1_e37qm54",
                    "score": 0,
                    "created_utc": 1532827118.0,
                    "replies": [
                        {
                            "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                            "author": "milliondollarkitty",
                            "id": "e37rciy",
                            "parent_id": "t1_e37qyzf",
                            "score": 7,
                            "created_utc": 1532827546.0,
                            "replies": [
                                {
                                    "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                                    "author": null,
                                    "id": "e37rl41",
                                    "parent_id": "t1_e37rciy",
                                    "score": 0,
                                    "created_utc": 1532827819.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\\> I don’t think anyone is underestimated the “emotional” cost of being scammed  \n\nAs always, it only matters when its the girl being scammed. You can see it in this very sub, with this classic: \"if you can't risk a month's allowance then you can't afford to be an SD\".",
            "author": null,
            "id": "e37qyzf",
            "parent_id": "t1_e37qm54",
            "score": 0,
            "created_utc": 1532827118.0,
            "replies": [
                {
                    "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
                    "author": "milliondollarkitty",
                    "id": "e37rciy",
                    "parent_id": "t1_e37qyzf",
                    "score": 7,
                    "created_utc": 1532827546.0,
                    "replies": [
                        {
                            "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                            "author": null,
                            "id": "e37rl41",
                            "parent_id": "t1_e37rciy",
                            "score": 0,
                            "created_utc": 1532827819.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never said either of those things but it’s cool that putting words in my mouth is the only way you can support your argument.",
            "author": "milliondollarkitty",
            "id": "e37rciy",
            "parent_id": "t1_e37qyzf",
            "score": 7,
            "created_utc": 1532827546.0,
            "replies": [
                {
                    "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
                    "author": null,
                    "id": "e37rl41",
                    "parent_id": "t1_e37rciy",
                    "score": 0,
                    "created_utc": 1532827819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You need some reading comprehension, I said it was a very common feeling in this sub, not that you specifically said it.",
            "author": null,
            "id": "e37rl41",
            "parent_id": "t1_e37rciy",
            "score": 0,
            "created_utc": 1532827819.0,
            "replies": []
        }
    ]
}