{
    "title": "SB’s - sometimes it doesn’t take much to make your SD feel great",
    "post_id": "mcrc5o",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mcrc5o/sbs_sometimes_it_doesnt_take_much_to_make_your_sd/",
    "author": "MrBuzzard",
    "body": "Sitting around at her place a couple of days ago, chatting and drinking some wine.  Jumps up, while saying “I almost forgot”.  Then she brings out this bracelet she made.  We have this thing where we call each other by our initials.  Or she will say something about heading to a new city - “We’re xx and yy - that place will never be the same!”\n\nThe bracelet had our initials in it.  Sounds like she had it fall apart a few times while making it.  She finally got it all done, and one of her letters is put in backwards.  When she saw that she said “f*** it, not starting over”. \n\nAnyway, I found all of this adorable.  Guess I am easy to make happy, right?\n\nShe has been telling me for months now, that she is making something for me, and that it could make me cry when she finally gets it done.  Wondering what she is up to.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mcrc5o/sbs_sometimes_it_doesnt_take_much_to_make_your_sd/",
    "score": 112,
    "upvote_ratio": 0.94,
    "created_utc": 1616651986.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "That is so good. With this arrangement thing really for a lot of us it is a relationship.\nStuff like that is so special.\nSB’s for an average guy like me I actually don’t want expensive stuff  (unless related to my hobbies haha) just a sweet card or something handmade like that or whatever say make some biscuits.\nThat’s what means a lot for me anyway.",
            "author": "sydsyd3",
            "id": "gs58v6i",
            "parent_id": "t3_mcrc5o",
            "score": 23,
            "created_utc": 1616656397.0,
            "replies": []
        },
        {
            "body": "It is about the small stuff to make the difference between a \"job\" and a relationship. SBs, even if you consider sugaring your job, throw us old geezers a bone and it will make a big difference in our lives, but also maybe your pocketbook.",
            "author": "GSSD",
            "id": "gs5wqry",
            "parent_id": "t3_mcrc5o",
            "score": 20,
            "created_utc": 1616676129.0,
            "replies": [
                {
                    "body": "should be carved in stone\n\n> It is about the small stuff to make the difference between a \"job\" and a relationship.",
                    "author": "pinotandsugar",
                    "id": "gs6tbk0",
                    "parent_id": "t1_gs5wqry",
                    "score": 5,
                    "created_utc": 1616690480.0,
                    "replies": []
                },
                {
                    "body": "Amén!",
                    "author": "Fun_Focus8159",
                    "id": "gs6i3qh",
                    "parent_id": "t1_gs5wqry",
                    "score": 2,
                    "created_utc": 1616685962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aw that's cute. Yes, at least for me (and I imagine most guys) it is the small gestures that mean a lot. Just showing that they care and are grateful. A lot of us don't usually get that in our daily lives, so it is nice when we do.",
            "author": "BigBearSD",
            "id": "gs5k55k",
            "parent_id": "t3_mcrc5o",
            "score": 14,
            "created_utc": 1616667106.0,
            "replies": [
                {
                    "body": "Agree on the daily lives comment.  And ironically, I think it applies even more to guys who are in a position to be a generous SD.  Many of us are in leadership positions in our working lives.  So we are the ones needing to motivate, offer praise, and solve all the hard problems.  That is what we do.  Part of the territory is being taken for granted, because we are seen to be so fortunate and/or well off.  We just accept it as normal.\n\nSo when someone enters your life who shows appreciation and is thoughtful towards you, it is seriously impactful, because it so rare.",
                    "author": "MrBuzzard",
                    "id": "gs67o9x",
                    "parent_id": "t1_gs5k55k",
                    "score": 14,
                    "created_utc": 1616681525.0,
                    "replies": [
                        {
                            "body": "So true!",
                            "author": "greywolf446",
                            "id": "gs8j2ie",
                            "parent_id": "t1_gs67o9x",
                            "score": 1,
                            "created_utc": 1616717801.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">She has been telling me for months now, that she is making something for me, and that it could make me cry when she finally gets it done. Wondering what she is up to.\n\nAre you looking for guesses? I'm going to say it's a wooden dildo she plans to peg you with. That would make any man cry and even lube probably won't help.",
            "author": "non_giant_panda",
            "id": "gs55ye4",
            "parent_id": "t3_mcrc5o",
            "score": 37,
            "created_utc": 1616653778.0,
            "replies": [
                {
                    "body": "Damn.  She asked for a wood lathe a little while back, and I got her one😳",
                    "author": "MrBuzzard",
                    "id": "gs5rr9a",
                    "parent_id": "t1_gs55ye4",
                    "score": 14,
                    "created_utc": 1616673104.0,
                    "replies": [
                        {
                            "body": "Get her some linseed oil, it gives it a really nice shine 🤩",
                            "author": null,
                            "id": "gs7s1yy",
                            "parent_id": "t1_gs5rr9a",
                            "score": 3,
                            "created_utc": 1616704813.0,
                            "replies": []
                        },
                        {
                            "body": "omg im literally saving for one rn, its a passion lol",
                            "author": "itchybanmicro",
                            "id": "gs66u7j",
                            "parent_id": "t1_gs5rr9a",
                            "score": 3,
                            "created_utc": 1616681154.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "😂😂😂",
                    "author": "Mangas70",
                    "id": "gs567un",
                    "parent_id": "t1_gs55ye4",
                    "score": 6,
                    "created_utc": 1616654009.0,
                    "replies": []
                },
                {
                    "body": ">wooden dildo she plans to peg you with\n\nthat escalated quickly!",
                    "author": null,
                    "id": "gs66g8i",
                    "parent_id": "t1_gs55ye4",
                    "score": 1,
                    "created_utc": 1616680985.0,
                    "replies": [
                        {
                            "body": "We have had a suspicious number of pegging posts recently 😂",
                            "author": "Azurecole",
                            "id": "gs69bhg",
                            "parent_id": "t1_gs66g8i",
                            "score": 1,
                            "created_utc": 1616682256.0,
                            "replies": [
                                {
                                    "body": "The gentlemen doth protest too much...",
                                    "author": null,
                                    "id": "gs6ri6i",
                                    "parent_id": "t1_gs69bhg",
                                    "score": 5,
                                    "created_utc": 1616689749.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Small gifts curiously pay big returns.  Extra chargers, $50 in quarters in a container store cup for laundry, back up batteries seem to delight my SB (on top of allowance, real gifts etc)",
            "author": "MidwestAmMan",
            "id": "gs5i4rf",
            "parent_id": "t3_mcrc5o",
            "score": 14,
            "created_utc": 1616665193.0,
            "replies": [
                {
                    "body": "Love this! Little things like that almost mean more than a fancy gift because they're thoughtful; the kinds of things that say you are paying attention to her life and what she really can use that makes a big difference in every day situations.",
                    "author": "akblonde907",
                    "id": "gs5idrr",
                    "parent_id": "t1_gs5i4rf",
                    "score": 12,
                    "created_utc": 1616665438.0,
                    "replies": []
                },
                {
                    "body": "Yes. My on again off again most recent ex gf would be grateful and thankful every time I did something nice for her, and there were some examples of her getting sappy ober little things, but one in particular was she likes to every morning get up early and relax with coffee and a slice of a particular kind of coffee cake from a particular grocery store. The ones near her were always out of this brand / exact flavor, so I would frequently go to one or two of those grocery stores near me, find it there, buy it and give it to her when we met up. She was always extremely appreciative and grateful over this small little thing that cost me $7ish. That always tickled me.",
                    "author": "BigBearSD",
                    "id": "gs5kj87",
                    "parent_id": "t1_gs5i4rf",
                    "score": 6,
                    "created_utc": 1616667462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs7kdp4",
            "parent_id": "t3_mcrc5o",
            "score": 4,
            "created_utc": 1616701542.0,
            "replies": [
                {
                    "body": "Ha.  I have a Polaroid too.",
                    "author": "MrBuzzard",
                    "id": "gs7lavf",
                    "parent_id": "t1_gs7kdp4",
                    "score": 2,
                    "created_utc": 1616701925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so damn cute, and genuinely wholesome!!! I love it. The little things truly do make a relationship!\n\nI’m currently hospitalized and my POT SD had flowers, a card and a stuffed animal sent to my room today. We’ve not met in person, yet; our M&G was scheduled for *today*! I felt so bad about the cancellation and he felt so bad knowing why, but this small gesture seriously made my day. \n\nHe sure won himself some super cute brownie points, as far as good signs in a new POT SR go, as well.",
            "author": "FoxyFreckles1989",
            "id": "gs7y9gi",
            "parent_id": "t3_mcrc5o",
            "score": 3,
            "created_utc": 1616707602.0,
            "replies": [
                {
                    "body": "Hope you are ok.",
                    "author": "OldschoolSD",
                    "id": "gs80k9u",
                    "parent_id": "t1_gs7y9gi",
                    "score": 3,
                    "created_utc": 1616708664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This girl sounds like a keeper! Sad part is that very few SB’s would ever do something like this. It’s usually always about them.",
            "author": "Fun_Focus8159",
            "id": "gs5we3c",
            "parent_id": "t3_mcrc5o",
            "score": 8,
            "created_utc": 1616675937.0,
            "replies": []
        },
        {
            "body": "I love this. And I love giving little gifts to my SD. things that make me think of him or I know will get a laugh 😆",
            "author": "bibliophile4787",
            "id": "gs699il",
            "parent_id": "t3_mcrc5o",
            "score": 3,
            "created_utc": 1616682231.0,
            "replies": []
        },
        {
            "body": "AwwwWWwwww. My little water sign heart 😭😭",
            "author": "ColdHeaux",
            "id": "gs6qggz",
            "parent_id": "t3_mcrc5o",
            "score": 3,
            "created_utc": 1616689331.0,
            "replies": []
        },
        {
            "body": "Small efforts reap huge rewards, some SBs are smarter than others.",
            "author": null,
            "id": "gs66kcq",
            "parent_id": "t3_mcrc5o",
            "score": 4,
            "created_utc": 1616681035.0,
            "replies": [
                {
                    "body": "But it isn’t even about the rewards though. It’s about making the other person feel cared about and provided for in the ways you can. Isn’t it?",
                    "author": "blue_eyes18",
                    "id": "gs8hr4f",
                    "parent_id": "t1_gs66kcq",
                    "score": 1,
                    "created_utc": 1616717128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it’s often the small things that truly show how much you really care about someone. Especially handmade stuff. Your SB sounds amazing!!!!!",
            "author": "Layla_Fox2",
            "id": "gs6coi7",
            "parent_id": "t3_mcrc5o",
            "score": 2,
            "created_utc": 1616683714.0,
            "replies": []
        },
        {
            "body": "my guess .. some kind of scrapbook of all the messages you sent her??\n\nthanks for sharing",
            "author": "Buckeyechamp21",
            "id": "gs6hzaa",
            "parent_id": "t3_mcrc5o",
            "score": 2,
            "created_utc": 1616685914.0,
            "replies": []
        },
        {
            "body": "That is so sweet! I feel that it's part of the SB's duties to make the SD happy and not only the SD's responsibility. Glad to hear you got yourself a keeper. Where did you meet her?",
            "author": "maybelchongst3r",
            "id": "gs7dzn7",
            "parent_id": "t3_mcrc5o",
            "score": 2,
            "created_utc": 1616698944.0,
            "replies": [
                {
                    "body": "On SA.  She had limited experience there, which was not positive at all.  Salt daddies, scammers and guys who would not respect boundaries like no PDA.  \n\nSo she wrote a profile that broke every rule in the book.  Super assertive and setting a high bar on who she would consider.  I messaged her never really expecting to meet, but I wondered who could have possibly written that.  \n\nKind of just wished her well and made some comment about that being quite the profile.  She wanted to meet, and I was hesitant because she was just 21 and I thought the age gap would never fly.  She argued with me - forcefully I must say.  \n\nSo we met.  Soon it will be two years from that day.  She was not like the profile at all.  Crazy cute and super nervous.  \n\nWe struggled to arrive at acceptable terms, and I eventually said that we should both move on.  Again she argued, and said she expected me to negotiate.  So we ended up giving things a shot.  \n\nTurns out she was quite inexperienced and the early days were a bit challenging. She is a deep and very complex personality.  But somehow we just meshed over time. \n\nI have to give her credit.  She saw something that told her we could work, when I didn’t.  And here we are, almost 2 years later.  We are planning on world travel adventures when Covid allows. \n\nLong answer to the question, but this was not the typical SA experience.",
                    "author": "MrBuzzard",
                    "id": "gs7kpau",
                    "parent_id": "t1_gs7dzn7",
                    "score": 4,
                    "created_utc": 1616701676.0,
                    "replies": [
                        {
                            "body": "Wow. You're a lucky guy. Seems like quite the girl. SA is not what it was 2 years ago. Quite sad. Had to move on from SA to other websites. I'm happy for you guys!",
                            "author": "maybelchongst3r",
                            "id": "gs7swgm",
                            "parent_id": "t1_gs7kpau",
                            "score": 2,
                            "created_utc": 1616705185.0,
                            "replies": []
                        },
                        {
                            "body": ">Turns out she was quite inexperienced and the early days were a bit challenging. She is a deep and very complex personality.  But somehow we just meshed over time.\n\nsame as my SGF. Very deep and complex personality, but I was intrigued from the 1st day I met her. I even decided to see her again against my better judgment because she didnt even give me a kiss at the end of the meet and greet and things got all awkward for me. Ive never had any success having a SR with someone who didnt at least kiss me the 1st time we met. Usually would go on a 2nd date and there was still no kiss, so at some point just decided I would never give girls like that a 2nd chance to waste my money. But something told me to break my own rules. We've been together over 7 months now & going strong. She also does stuff like what your SB does and makes things for me that are personalized & then makes her own cards too.",
                            "author": null,
                            "id": "gs8c6zk",
                            "parent_id": "t1_gs7kpau",
                            "score": 2,
                            "created_utc": 1616714331.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men are incredibly easy to please; most women have no idea.",
            "author": "MGTOWManofMystery",
            "id": "gs7el2g",
            "parent_id": "t3_mcrc5o",
            "score": 2,
            "created_utc": 1616699184.0,
            "replies": []
        },
        {
            "body": "That is very sweet",
            "author": "Itsjihoonsfault",
            "id": "gsaxgo0",
            "parent_id": "t3_mcrc5o",
            "score": 1,
            "created_utc": 1616773719.0,
            "replies": []
        },
        {
            "body": "should be carved in stone\n\n> It is about the small stuff to make the difference between a \"job\" and a relationship.",
            "author": "pinotandsugar",
            "id": "gs6tbk0",
            "parent_id": "t1_gs5wqry",
            "score": 5,
            "created_utc": 1616690480.0,
            "replies": []
        },
        {
            "body": "Amén!",
            "author": "Fun_Focus8159",
            "id": "gs6i3qh",
            "parent_id": "t1_gs5wqry",
            "score": 2,
            "created_utc": 1616685962.0,
            "replies": []
        },
        {
            "body": "Agree on the daily lives comment.  And ironically, I think it applies even more to guys who are in a position to be a generous SD.  Many of us are in leadership positions in our working lives.  So we are the ones needing to motivate, offer praise, and solve all the hard problems.  That is what we do.  Part of the territory is being taken for granted, because we are seen to be so fortunate and/or well off.  We just accept it as normal.\n\nSo when someone enters your life who shows appreciation and is thoughtful towards you, it is seriously impactful, because it so rare.",
            "author": "MrBuzzard",
            "id": "gs67o9x",
            "parent_id": "t1_gs5k55k",
            "score": 14,
            "created_utc": 1616681525.0,
            "replies": [
                {
                    "body": "So true!",
                    "author": "greywolf446",
                    "id": "gs8j2ie",
                    "parent_id": "t1_gs67o9x",
                    "score": 1,
                    "created_utc": 1616717801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn.  She asked for a wood lathe a little while back, and I got her one😳",
            "author": "MrBuzzard",
            "id": "gs5rr9a",
            "parent_id": "t1_gs55ye4",
            "score": 14,
            "created_utc": 1616673104.0,
            "replies": [
                {
                    "body": "Get her some linseed oil, it gives it a really nice shine 🤩",
                    "author": null,
                    "id": "gs7s1yy",
                    "parent_id": "t1_gs5rr9a",
                    "score": 3,
                    "created_utc": 1616704813.0,
                    "replies": []
                },
                {
                    "body": "omg im literally saving for one rn, its a passion lol",
                    "author": "itchybanmicro",
                    "id": "gs66u7j",
                    "parent_id": "t1_gs5rr9a",
                    "score": 3,
                    "created_utc": 1616681154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂",
            "author": "Mangas70",
            "id": "gs567un",
            "parent_id": "t1_gs55ye4",
            "score": 6,
            "created_utc": 1616654009.0,
            "replies": []
        },
        {
            "body": ">wooden dildo she plans to peg you with\n\nthat escalated quickly!",
            "author": null,
            "id": "gs66g8i",
            "parent_id": "t1_gs55ye4",
            "score": 1,
            "created_utc": 1616680985.0,
            "replies": [
                {
                    "body": "We have had a suspicious number of pegging posts recently 😂",
                    "author": "Azurecole",
                    "id": "gs69bhg",
                    "parent_id": "t1_gs66g8i",
                    "score": 1,
                    "created_utc": 1616682256.0,
                    "replies": [
                        {
                            "body": "The gentlemen doth protest too much...",
                            "author": null,
                            "id": "gs6ri6i",
                            "parent_id": "t1_gs69bhg",
                            "score": 5,
                            "created_utc": 1616689749.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love this! Little things like that almost mean more than a fancy gift because they're thoughtful; the kinds of things that say you are paying attention to her life and what she really can use that makes a big difference in every day situations.",
            "author": "akblonde907",
            "id": "gs5idrr",
            "parent_id": "t1_gs5i4rf",
            "score": 12,
            "created_utc": 1616665438.0,
            "replies": []
        },
        {
            "body": "Yes. My on again off again most recent ex gf would be grateful and thankful every time I did something nice for her, and there were some examples of her getting sappy ober little things, but one in particular was she likes to every morning get up early and relax with coffee and a slice of a particular kind of coffee cake from a particular grocery store. The ones near her were always out of this brand / exact flavor, so I would frequently go to one or two of those grocery stores near me, find it there, buy it and give it to her when we met up. She was always extremely appreciative and grateful over this small little thing that cost me $7ish. That always tickled me.",
            "author": "BigBearSD",
            "id": "gs5kj87",
            "parent_id": "t1_gs5i4rf",
            "score": 6,
            "created_utc": 1616667462.0,
            "replies": []
        },
        {
            "body": "Ha.  I have a Polaroid too.",
            "author": "MrBuzzard",
            "id": "gs7lavf",
            "parent_id": "t1_gs7kdp4",
            "score": 2,
            "created_utc": 1616701925.0,
            "replies": []
        },
        {
            "body": "Hope you are ok.",
            "author": "OldschoolSD",
            "id": "gs80k9u",
            "parent_id": "t1_gs7y9gi",
            "score": 3,
            "created_utc": 1616708664.0,
            "replies": []
        },
        {
            "body": "But it isn’t even about the rewards though. It’s about making the other person feel cared about and provided for in the ways you can. Isn’t it?",
            "author": "blue_eyes18",
            "id": "gs8hr4f",
            "parent_id": "t1_gs66kcq",
            "score": 1,
            "created_utc": 1616717128.0,
            "replies": []
        },
        {
            "body": "On SA.  She had limited experience there, which was not positive at all.  Salt daddies, scammers and guys who would not respect boundaries like no PDA.  \n\nSo she wrote a profile that broke every rule in the book.  Super assertive and setting a high bar on who she would consider.  I messaged her never really expecting to meet, but I wondered who could have possibly written that.  \n\nKind of just wished her well and made some comment about that being quite the profile.  She wanted to meet, and I was hesitant because she was just 21 and I thought the age gap would never fly.  She argued with me - forcefully I must say.  \n\nSo we met.  Soon it will be two years from that day.  She was not like the profile at all.  Crazy cute and super nervous.  \n\nWe struggled to arrive at acceptable terms, and I eventually said that we should both move on.  Again she argued, and said she expected me to negotiate.  So we ended up giving things a shot.  \n\nTurns out she was quite inexperienced and the early days were a bit challenging. She is a deep and very complex personality.  But somehow we just meshed over time. \n\nI have to give her credit.  She saw something that told her we could work, when I didn’t.  And here we are, almost 2 years later.  We are planning on world travel adventures when Covid allows. \n\nLong answer to the question, but this was not the typical SA experience.",
            "author": "MrBuzzard",
            "id": "gs7kpau",
            "parent_id": "t1_gs7dzn7",
            "score": 4,
            "created_utc": 1616701676.0,
            "replies": [
                {
                    "body": "Wow. You're a lucky guy. Seems like quite the girl. SA is not what it was 2 years ago. Quite sad. Had to move on from SA to other websites. I'm happy for you guys!",
                    "author": "maybelchongst3r",
                    "id": "gs7swgm",
                    "parent_id": "t1_gs7kpau",
                    "score": 2,
                    "created_utc": 1616705185.0,
                    "replies": []
                },
                {
                    "body": ">Turns out she was quite inexperienced and the early days were a bit challenging. She is a deep and very complex personality.  But somehow we just meshed over time.\n\nsame as my SGF. Very deep and complex personality, but I was intrigued from the 1st day I met her. I even decided to see her again against my better judgment because she didnt even give me a kiss at the end of the meet and greet and things got all awkward for me. Ive never had any success having a SR with someone who didnt at least kiss me the 1st time we met. Usually would go on a 2nd date and there was still no kiss, so at some point just decided I would never give girls like that a 2nd chance to waste my money. But something told me to break my own rules. We've been together over 7 months now & going strong. She also does stuff like what your SB does and makes things for me that are personalized & then makes her own cards too.",
                    "author": null,
                    "id": "gs8c6zk",
                    "parent_id": "t1_gs7kpau",
                    "score": 2,
                    "created_utc": 1616714331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true!",
            "author": "greywolf446",
            "id": "gs8j2ie",
            "parent_id": "t1_gs67o9x",
            "score": 1,
            "created_utc": 1616717801.0,
            "replies": []
        },
        {
            "body": "Get her some linseed oil, it gives it a really nice shine 🤩",
            "author": null,
            "id": "gs7s1yy",
            "parent_id": "t1_gs5rr9a",
            "score": 3,
            "created_utc": 1616704813.0,
            "replies": []
        },
        {
            "body": "omg im literally saving for one rn, its a passion lol",
            "author": "itchybanmicro",
            "id": "gs66u7j",
            "parent_id": "t1_gs5rr9a",
            "score": 3,
            "created_utc": 1616681154.0,
            "replies": []
        },
        {
            "body": "We have had a suspicious number of pegging posts recently 😂",
            "author": "Azurecole",
            "id": "gs69bhg",
            "parent_id": "t1_gs66g8i",
            "score": 1,
            "created_utc": 1616682256.0,
            "replies": [
                {
                    "body": "The gentlemen doth protest too much...",
                    "author": null,
                    "id": "gs6ri6i",
                    "parent_id": "t1_gs69bhg",
                    "score": 5,
                    "created_utc": 1616689749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. You're a lucky guy. Seems like quite the girl. SA is not what it was 2 years ago. Quite sad. Had to move on from SA to other websites. I'm happy for you guys!",
            "author": "maybelchongst3r",
            "id": "gs7swgm",
            "parent_id": "t1_gs7kpau",
            "score": 2,
            "created_utc": 1616705185.0,
            "replies": []
        },
        {
            "body": ">Turns out she was quite inexperienced and the early days were a bit challenging. She is a deep and very complex personality.  But somehow we just meshed over time.\n\nsame as my SGF. Very deep and complex personality, but I was intrigued from the 1st day I met her. I even decided to see her again against my better judgment because she didnt even give me a kiss at the end of the meet and greet and things got all awkward for me. Ive never had any success having a SR with someone who didnt at least kiss me the 1st time we met. Usually would go on a 2nd date and there was still no kiss, so at some point just decided I would never give girls like that a 2nd chance to waste my money. But something told me to break my own rules. We've been together over 7 months now & going strong. She also does stuff like what your SB does and makes things for me that are personalized & then makes her own cards too.",
            "author": null,
            "id": "gs8c6zk",
            "parent_id": "t1_gs7kpau",
            "score": 2,
            "created_utc": 1616714331.0,
            "replies": []
        },
        {
            "body": "The gentlemen doth protest too much...",
            "author": null,
            "id": "gs6ri6i",
            "parent_id": "t1_gs69bhg",
            "score": 5,
            "created_utc": 1616689749.0,
            "replies": []
        }
    ]
}