{
    "title": "Becoming sugarbaby changed my perception on dating and preferences",
    "post_id": "gtttpo",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gtttpo/becoming_sugarbaby_changed_my_perception_on/",
    "author": "throawaway17117",
    "body": "Before I used to believe in ‘all body types are beautiful’. I did while i wasn’t fully believing it. I’m from East asia so we dont have body positivity movement as here in the states. \n\nAfter joining SA i realized its all BS. ( sorry for direct and rude word) but thats just how i felt. \n\nI was size 4 and i came across numerous profiles which openly states, they prefer someone petite and slender. When i changed my body type to slim, i was flooded with messages and almost every(9 times out of 10) m&g led to arrangement. In reference, i’m 5,3 90lbs with long black hair and pale skin East asian. \nI think it was due to that i was always told i’m pretty but i was chubby for my height, so when i shed the pounds it increased my chances. Weird incident was, there was a guy i met previously and he didn’t remember me becsuse last time, he said i have nice personality but we’re looking for different things. When i lost weight and he didnt recognize me and asked for arrangement. \n\nLot of SD state, they’re looking for someone educated and hold a conversation but lot of times i felt  like it really didnt matter as i have calm demeanor. I only met 1 guy who questioned me about specific book and openly state that he doesnt like latinas as they are full of drama, but he’s still searching for SB. \n\nAnd sadly race does matter. People say the most preferred race is white and asian, while it maybe true, its not. I think if i was white on same attractiveness scale, i’d gotten more attention. Lot of SD who are not actual SD think i’ll be lured into having sex with them just because i’m asian and theres stereotype of asian girls being easy to white guys.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gtttpo/becoming_sugarbaby_changed_my_perception_on/",
    "score": 116,
    "upvote_ratio": 0.93,
    "created_utc": 1590905543.0,
    "num_comments": 79,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "fseciof",
            "parent_id": "t3_gtttpo",
            "score": 60,
            "created_utc": 1590906011.0,
            "replies": [
                {
                    "body": "I agree, even though i’m asian i met alot of SD who believed i should act certain way as i’m asian and was looking for girl to satisfy their perfectly stereotyped asian.",
                    "author": "throawaway17117",
                    "id": "fsedpoq",
                    "parent_id": "t1_fseciof",
                    "score": 13,
                    "created_utc": 1590906961.0,
                    "replies": []
                },
                {
                    "body": "You have a niche product to sell. Get to selling girl.",
                    "author": "ElementShow",
                    "id": "fsff4xh",
                    "parent_id": "t1_fseciof",
                    "score": 6,
                    "created_utc": 1590937984.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fsffewd",
                            "parent_id": "t1_fsff4xh",
                            "score": 1,
                            "created_utc": 1590938140.0,
                            "replies": [
                                {
                                    "body": "I'm a \"type\" as well. Once I decided to play that card to the fullest and own it, I learned what kind of men are looking for me. So I look for those men. Makes my search short and sweet.",
                                    "author": "ElementShow",
                                    "id": "fsffmzr",
                                    "parent_id": "t1_fsffewd",
                                    "score": 2,
                                    "created_utc": 1590938269.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fsfhb4f",
                    "parent_id": "t1_fseciof",
                    "score": 7,
                    "created_utc": 1590939203.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fsfhy23",
                            "parent_id": "t1_fsfhb4f",
                            "score": 7,
                            "created_utc": 1590939555.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seconded. Hardly anyones preference but definitely their fetish. But sometimes that works in my favour. Especially since SRs are slightly different than traditional dating and who men would usually date. There's an opportunity for them to date outside of 'the norm'.",
                    "author": "DramaticStruggle0",
                    "id": "fsedlqq",
                    "parent_id": "t1_fseciof",
                    "score": 8,
                    "created_utc": 1590906873.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fseeecs",
                            "parent_id": "t1_fsedlqq",
                            "score": 8,
                            "created_utc": 1590907519.0,
                            "replies": [
                                {
                                    "body": "Gosh that’s absolutely terrible. Did it not make you feel put down? I feel like in general women have been inferior throughout history but that just sounds like men who want to feel superior by having someone disposable and inferior to be in control of.\n\nI know the power aspect does come into some relationships in a less jaded and judgemental way - but I think I would just be so annoyed after the initial excitement wears off and I can understand how that would get old super quick. You’re worth more than that hun.",
                                    "author": "Silver-Strawberry",
                                    "id": "fsf77d0",
                                    "parent_id": "t1_fseeecs",
                                    "score": 3,
                                    "created_utc": 1590933083.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I am almost in the same boat as you, however I fall a little bit lower on the attractive scale while my body is still fetishized. I rarely am anyone’s “type” but when I am it’s always the “I hear black chicks give the best s*x.” I’ve been on SA for a year now and have only had 2 POT, both who ended up not working out. I’ve tried everything from sending thoughtful messages to lowering my expectations, which have gotten me nowhere. I’m curious to how women of color are supposed to navigate the SL when men search for only skinny, white women?",
                    "author": "babyykds",
                    "id": "fsp50lk",
                    "parent_id": "t1_fseciof",
                    "score": 2,
                    "created_utc": 1591146476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">In reference, i’m 5,3 90lbs with long black hair and pale skin East asian. I think it was due to that i was always told i’m pretty but i was chubby for my height\n\nWhat kind of monster calls someone with a BMI of 15.9 \"chubby\"?\n\n[https://www.nhlbi.nih.gov/health/educational/lose\\_wt/BMI/bmicalc.htm](https://www.nhlbi.nih.gov/health/educational/lose_wt/BMI/bmicalc.htm)",
            "author": "aotus_trivirgatus",
            "id": "fsf0f44",
            "parent_id": "t3_gtttpo",
            "score": 22,
            "created_utc": 1590927987.0,
            "replies": [
                {
                    "body": "Oh that was before i lost my weight. I was 120lbs. But the SDs i met, surprisingly the fit ones werent vocal about my body but the out of shape guys were very vocal about my looks",
                    "author": "throawaway17117",
                    "id": "fsf0icj",
                    "parent_id": "t1_fsf0f44",
                    "score": 18,
                    "created_utc": 1590928063.0,
                    "replies": [
                        {
                            "body": "Even that's only a BMI of 21.3.",
                            "author": "aotus_trivirgatus",
                            "id": "fsf0x4x",
                            "parent_id": "t1_fsf0icj",
                            "score": 13,
                            "created_utc": 1590928401.0,
                            "replies": [
                                {
                                    "body": "I wish they were accepting but since they pay someone to have sex, most guys would prefer to sleep with slim woman. \n\nI’ve had numerous encounters where a guy was coming back to me ( i made new account so they werent aware that it was me ) and what i couldnt understand was why its so hard for them to find a girl when theres thousands of girls in nyc. We were discussing allowance and then i saw him searching for another girl on SA. \nOr quiz me with certain things as if its the test i have to pass or harassing me because i wouldnt agree to his suggested ppm. \n\nDiscreet type of SDs dont care much. \n\nSurprisingly the better looking the SD was, the less judgemental they were.\n\nI was extremely lucky to meet really nice SD, i even met a guy who looked like he was straight out of movie or guy who was in 50s but looked like he was in 30s and respected me well and sex was very intense with bdsm but arragement usually lasted only an hr.",
                                    "author": "throawaway17117",
                                    "id": "fsf1c4n",
                                    "parent_id": "t1_fsf0x4x",
                                    "score": 11,
                                    "created_utc": 1590928740.0,
                                    "replies": []
                                },
                                {
                                    "body": "Ikr I'm bmi 21 and am always called \"lean fit\", no where close to chubby. I think even a BMI up to 24 shouldn't be called chubby, or they're just straightaway rude",
                                    "author": "komeonebabe",
                                    "id": "fsgk064",
                                    "parent_id": "t1_fsf0x4x",
                                    "score": 2,
                                    "created_utc": 1590959344.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ugh, I’m so sorry you were judged and treated that way",
                            "author": "Silver-Strawberry",
                            "id": "fsf7baq",
                            "parent_id": "t1_fsf0icj",
                            "score": 4,
                            "created_utc": 1590933160.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fsg9h5m",
                    "parent_id": "t1_fsf0f44",
                    "score": 3,
                    "created_utc": 1590953869.0,
                    "replies": [
                        {
                            "body": "I'm actually a research biologist.  I understand the limitations of the BMI.  The BMI is a reasonably good guide for humans near the average height range of around 150 years ago, which is when BMI was invented (yeah, it's old).  If you're between 5'0\" and 5'10\", it's a reasonable measure.  Outside of that range, it's not so great.",
                            "author": "aotus_trivirgatus",
                            "id": "fshq4kc",
                            "parent_id": "t1_fsg9h5m",
                            "score": 3,
                            "created_utc": 1590983110.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "One of the biggest things I’ve learned is that what women think is attractive for a woman =/= what men think is attractive for a woman. I’m 22 now but when I was eighteen I was broke and poor and let my hair grow long in my natural colour, which is mouse brown. Every woman close to me would say ‘you really need to cut/dye your hair’ ‘it’s so ugly’ etc. However, any man that was interested in my, SD or otherwise, would always compliment me on my hair and how they loved it long and simple. I still have it down to my lower back and I’ll never cut it even now I have money and can afford regular hair appointments.",
            "author": "mangovanilla",
            "id": "fsf56p1",
            "parent_id": "t3_gtttpo",
            "score": 26,
            "created_utc": 1590931644.0,
            "replies": [
                {
                    "body": "So true. Women have it so backwards. I LOVE simple long hair. You dont need to dye your hair.",
                    "author": "dade_murphy1",
                    "id": "fsg2sk9",
                    "parent_id": "t1_fsf56p1",
                    "score": 5,
                    "created_utc": 1590950397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, these differences are more pronounced in the sugar dating realm. In vanilla dating, where guys are less desired, it's more obvious to guys that all guy body types are not treated equally.",
            "author": "SeattleLaserMeteor",
            "id": "fsedejm",
            "parent_id": "t3_gtttpo",
            "score": 10,
            "created_utc": 1590906715.0,
            "replies": [
                {
                    "body": "Not just body types.  Height is a major one, as is attractiveness overall.  It's well known and documented in multiple studies of the data from dating site interactions that 80% of the women go for the top 10% of the men, while with men it's definitely more of a bell curve.\n\nNothing wrong with that.  Everyone gets to choose who they go for...\n\nThe pattern does lead to frustration on both sides though.",
                    "author": "soicansaywhatiwant",
                    "id": "fsf2dct",
                    "parent_id": "t1_fsedejm",
                    "score": 5,
                    "created_utc": 1590929561.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fsf6u15",
                            "parent_id": "t1_fsf2dct",
                            "score": 2,
                            "created_utc": 1590932789.0,
                            "replies": [
                                {
                                    "body": "Before the Match Group bought up nearly every major dating app there was some good data out there.  Now, due to $ motives, a lot of it is tougher to find since it has been taken down. \n\nHere's one still floating around out there:\n\n[Tinder Experiments II: Guys, unless you are really hot you are probably better off not wasting your time](https://medium.com/@worstonlinedater/tinder-experiments-ii-guys-unless-you-are-really-hot-you-are-probably-better-off-not-wasting-your-2ddf370a6e9a)\n\n\"*Unfortunately, this percentage decreases rapidly as you go down the attractiveness scale. According to this analysis a man of average attractiveness can only expect to be liked by slightly less than 1% of females (0.87%). \"*\n\nThere was another similar one out there for OKCupid a few year ago but the research was done by the OKCupid company before they got bought by Match so it's not as easy to find.  I think women rated 80% of the men on the site as unattractive while the men rated in a classic bell curve.",
                                    "author": "soicansaywhatiwant",
                                    "id": "fsf8foo",
                                    "parent_id": "t1_fsf6u15",
                                    "score": 6,
                                    "created_utc": 1590933921.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fsfi6m2",
                                            "parent_id": "t1_fsf8foo",
                                            "score": 4,
                                            "created_utc": 1590939684.0,
                                            "replies": [
                                                {
                                                    "body": "Fair enough but my experience on OKCupid, Match, and Tinder has been pretty much the same. Women value height a lot and go for the really good looking guys. Seen a few friends tinder gold or matches.  The great-looking tall guy is hammered with swipes.  The tall average guy is not far behind.  Being successful, in shape, politically similar, kink similar doesn't really produce the same interest.  I know that women get avalanched with right swipes/likes/messages depending on the app so I don't blame them for devoting their limited time to the profiles they really like. It's the nature of online dating.\n\nI've been out of that vanilla dating world for over a year.  I dabble in the sugar lifestyle looking for a woman open to the swinging/BDSM lifestyle. Now, that world is so different in my experience. People say it's impossible for single males but, no, it most definitely is not.  So many awesome people. Most, unfortunately for me, are already coupled but better single there than in the in a relationship in the vanilla world and unconnected sexually/intimately.",
                                                    "author": "soicansaywhatiwant",
                                                    "id": "fsjkz3n",
                                                    "parent_id": "t1_fsfi6m2",
                                                    "score": 2,
                                                    "created_utc": 1591031580.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "\\>their tastes and preferences are a lot more individual than men's are.\n\nHahahahahahahahahahah\n\nOh man, I wish I had time to get into this but I am not touching this baloney right now. Needless to say I couldn't agree less. In fact, there is plenty of evidence to suggest that [women prefer men when they know other women approve of their appearance.](https://www.businessinsider.com/women-are-more-attracted-to-men-when-other-women-like-them-2018-1)\n\nAnyway I've experienced dating as a thin guy, fit guy, and fat guy as my body has changed up and down a lot over the years. I assure you that there is a major disparity in the experiences between physically fit men and unfit men. Beyond what you'd expect, I imagine. It's the difference between being inundated with matches and being lucky to get any if you manage to take really good photos.",
                                                    "author": "NoBromo3213",
                                                    "id": "fsmgicv",
                                                    "parent_id": "t1_fsfi6m2",
                                                    "score": 1,
                                                    "created_utc": 1591095104.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, as a size 8/10 (sometimes even a 12) I'm shocked at how successful I've been in the bowl. At first, I really didn't think I'd have much luck given how \"average\" my body is in a sense. I'm 5'4 and curvy (boobs, butt & a little tummy), nowhere near slender & never have been. I live in the NYC/NJ area, I really think it may depend on the area you live in and what the men there are looking for. I'm very exotic looking so I don't know if that helps my case, but I've always gotten a lot of attention from men.",
            "author": "shesanewman",
            "id": "fsfd06d",
            "parent_id": "t3_gtttpo",
            "score": 7,
            "created_utc": 1590936755.0,
            "replies": [
                {
                    "body": "I'm about the same as you size wise, but I'm not exotic.  Maybe my personality it though lol 😆 \n\nBut i know guys love the curves and naturally shaped women.  They like to say they prefer skinny white chick's with enhanced boobs and bleached hair. But in the end the curves normally win over.. just my personal experience.",
                    "author": "Madisonesthe1",
                    "id": "fsfmhoa",
                    "parent_id": "t1_fsfd06d",
                    "score": 2,
                    "created_utc": 1590942019.0,
                    "replies": [
                        {
                            "body": "Awesome to hear from someone In a similar position.",
                            "author": "shesanewman",
                            "id": "fsfphu5",
                            "parent_id": "t1_fsfmhoa",
                            "score": 2,
                            "created_utc": 1590943598.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think this is generally very true for sugaring online since there is such a heavy emphasis on photos during the vetting process. If you land a MG from SA but fail to land an arrangement, then it’s your personality or the way you present yourself (hygiene, sense of fashion, mannerisms, confidence, etc). This is under the assumption your photos are an accurate representation of what you look like. The POT goes in thinking you’re already attractive. They do a MG to confirm your personality is sustainable for an arrangement. \n\nWhen sugaring IRL I think personality will always trump looks (as long as you are conventionally pretty and healthy). \n\nI went to a pool party and I still hadn’t lost my birth control weight, so although I was healthy, I was 10lbs over my normal weight. Even though there were plenty other skinny girls at the Pool party, they were shy and not socializing like i was with the other men.\n\nI had connected with several men and three men expressed interest at some point (whether at the party or after a few weeks of texting ) to start an arrangement.\n\nLast Remarks\n- I think I read somewhere that men will generally opt for the woman who expresses interest but is not as attractive as the other uninterested woman.\n- All bodies are indeed beautiful. However some body types command higher sexual market value.",
            "author": "cornycatlady",
            "id": "fsfhbd1",
            "parent_id": "t3_gtttpo",
            "score": 5,
            "created_utc": 1590939206.0,
            "replies": [
                {
                    "body": "BC weight is a necessary evil.😭 \nCan anything be done about it tho?",
                    "author": "PioneerExperience",
                    "id": "fshs8vz",
                    "parent_id": "t1_fsfhbd1",
                    "score": 2,
                    "created_utc": 1590984481.0,
                    "replies": [
                        {
                            "body": "Ugh took me damn near a year to get it off",
                            "author": "cornycatlady",
                            "id": "fshshzb",
                            "parent_id": "t1_fshs8vz",
                            "score": 2,
                            "created_utc": 1590984645.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "IN MY OPINION, guys in the Western world prefer this specific \"type\" of woman because that's what the Western media has portrayed as beautiful or sexy. I can't remember the exact timeline but I believe in the 1950 or 60s, the fashion industry in an attempt to promote androgynous clothing started using models that could fit that androgynous label easily i.e. ; skinny/thin, tall/slender etc. It's easier to appear androgynous when you don't have that much curves isn't it.\n\nThis spilled over into media (movies, music, celebrities etc) and has since become the \"standard\" of beauty and sexiness, albeit flawed. And since culture is shaped by media (whether we are aware or not) men have come to associate thin/slender women as \"more desirable\". They have been programmed subconsciously to find it more desirable whether they are aware or not.\n\nIf you look at Western movies for instance, the main woman is usually a beautiful, thin/slender/tall white woman. She is portrayed in the best light ; sexy, beautiful, desired, smart etc. However, when any other woman of any other ethnicity appears, she's definitely not portrayed in that light. For example let's use black women since I'm a black woman myself. In that same movie, the black woman will be a sub-character and portrayed as loud, comical, unattractive and sometimes just plain stupid! And that same \"character\" played by black women over and over for decades has created a stereotype amongst \"some\" men of other ethnicites that don't personally/intimately know any black women; that black women are loud, raunchy, aggressive and not too smart!  Which obviously isn't the case!!\n\nAll body types ARE beautiful in reality but that's not what our media has conveyed. So that's not what our culture has come to believe. You are always beautiful, sexy and desirable boo. Don't let anyone make you feel otherwise. Most guys don't even know why they prefer that specific body type, just that they do. Well, media is to blame. If it portrayed ALL body types as sexy and beautiful, we all would too. Look at \"super\" models, advertisement, movies, celebrities, music videos, magazines etc, its thin, tall, androgynous looking white women (sometimes other ethnicites that fit that type too) that are used.\n\nIf someone doesn't appreciate the way you are and only finds you desirable when you fit a certain \"stereotype\", don't waste your time on them. You are who you are, own it. And they either take it or leave it!",
            "author": "AggravatingCity1",
            "id": "fsevjxf",
            "parent_id": "t3_gtttpo",
            "score": 21,
            "created_utc": 1590923544.0,
            "replies": []
        },
        {
            "body": "Yeah I'm so sorry you go through that! The more time I have spent on SA the more I have disliked 95% of the men that use it. It's mostly for shallow men and money grabbing women. Not saying all, just most. I prefer meeting SD's off the site!",
            "author": null,
            "id": "fsf1az3",
            "parent_id": "t3_gtttpo",
            "score": 5,
            "created_utc": 1590928715.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fsfm5rh",
                    "parent_id": "t1_fsf1az3",
                    "score": 2,
                    "created_utc": 1590941843.0,
                    "replies": [
                        {
                            "body": "No, just in person when I am out!",
                            "author": null,
                            "id": "fsfpzs3",
                            "parent_id": "t1_fsfm5rh",
                            "score": 1,
                            "created_utc": 1590943859.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fsfrdjs",
                                    "parent_id": "t1_fsfpzs3",
                                    "score": 3,
                                    "created_utc": 1590944571.0,
                                    "replies": [
                                        {
                                            "body": "Hang out where wealthy men hang out.",
                                            "author": "babylina",
                                            "id": "fsgglsr",
                                            "parent_id": "t1_fsfrdjs",
                                            "score": 2,
                                            "created_utc": 1590957575.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Actually yes! Or better yet, have you tried tinder and changing the setting to an older age? 90% are crap but some are really really fantastic and want to find something real!",
                                            "author": null,
                                            "id": "fsg0fzl",
                                            "parent_id": "t1_fsfrdjs",
                                            "score": 1,
                                            "created_utc": 1590949196.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "there are multiple studies about all of this around the internet.  I think several youtube channels cover the topic of actual race/size/etc preferences across society.  One channel actually filmed the rooms, tracked eye sight lines, questioned with participants and recorded their answers.  It was run by two researchers.  This stuff is not going away.  If it makes you feel any better, we'll all literally be dust someday, including all the male hormones that didn't go for you, so enjoy what YOU have while you have it.  What else can we do in this life? :)",
            "author": null,
            "id": "fsg6gze",
            "parent_id": "t3_gtttpo",
            "score": 3,
            "created_utc": 1590952311.0,
            "replies": []
        },
        {
            "body": "SB:  *There is no way I could ever be with that guy.  I have to be attracted to him and he was not tall enough/thin enough/young enough/pleasing enough on the eyes.*   Read some version of this here many times.  Nearly every response will be in support of the original poster.\n\nSB: *Can you believe a lot of SDs want a certain body type.  That is really frustrating.*  \n\nShouldn't the response be the same?   Doesn't the SD get to choose what he's looking for or are you asking him to look beyond that while reserving the right not to do so yourself.",
            "author": "soicansaywhatiwant",
            "id": "fsf22yq",
            "parent_id": "t3_gtttpo",
            "score": 9,
            "created_utc": 1590929333.0,
            "replies": [
                {
                    "body": "Hypocricy is a power to be reckoned with.  Second only in power to ignorance.  Dont try to fight either as you will lose. :P\n\n**EVERYBODY** will always have preferences.  Even(especially) if we pretend otherwise.  But, we also have the right to complain about other peoples preferences if they annoy us! :)",
                    "author": "duckydee543",
                    "id": "fsf6b97",
                    "parent_id": "t1_fsf22yq",
                    "score": 8,
                    "created_utc": 1590932434.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a guy who has been fat, thin, and everything in between I get where you are coming from. But the bowl is much more particular about women's looks than vanilla dating. Not that looks don't matter when dating, just that this is an extreme version of the scrutiny you would face on Tinder etc. The gender dynamics are totally flipped here - what you are experiencing now is what men are accustomed to on vanilla dating apps.\n\nMost SDs are very picky. And being thin and young is a common preference amongst SDs. Most (vanilla) men I know, on the other hand, have a wide range of women they would be willing to date (at least when it comes to physical appearance).",
            "author": "NoBromo3213",
            "id": "fsmfsxk",
            "parent_id": "t3_gtttpo",
            "score": 2,
            "created_utc": 1591094444.0,
            "replies": []
        },
        {
            "body": "I think you should stop trying to compare who you are or what you look like to what you think these “men” want.",
            "author": "pumpkinspicedcream",
            "id": "fsegwu0",
            "parent_id": "t3_gtttpo",
            "score": 5,
            "created_utc": 1590909604.0,
            "replies": [
                {
                    "body": "I agree but it was hard not to while in the bowl, sadly. Just like SDs, i couldnt have arrangement with any SD. I had a type of guys i could sleep with and these guys had a type i had to adhere to in order to start an arrangement with them.",
                    "author": "throawaway17117",
                    "id": "fseh0sl",
                    "parent_id": "t1_fsegwu0",
                    "score": 3,
                    "created_utc": 1590909696.0,
                    "replies": [
                        {
                            "body": "There’s a huge difference between having a type and changing yourself to fit the types you think you’re expected to be. You are who you are and no amount of weight loss or makeup or book smarts is going to make you more attractive to someone that expects perfection in an imperfect world.",
                            "author": "pumpkinspicedcream",
                            "id": "fsehtf1",
                            "parent_id": "t1_fseh0sl",
                            "score": 6,
                            "created_utc": 1590910385.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mating is mating. Sex is sex. Women also prefer men that are a specific body type -- in fact, more than men usually do when it comes to sex. It's biology. Of course, the \"body positivity\" movement doesn't really include or give a thought to men.",
            "author": "MGTOWManofMystery",
            "id": "fsfutfu",
            "parent_id": "t3_gtttpo",
            "score": 2,
            "created_utc": 1590946342.0,
            "replies": []
        },
        {
            "body": "If this is the first time you realized this, you have lived a very sheltered life or in your own bubble.",
            "author": "nthcoming",
            "id": "fsfdwjf",
            "parent_id": "t3_gtttpo",
            "score": 4,
            "created_utc": 1590937280.0,
            "replies": []
        },
        {
            "body": "Right!! When you get treated so well and worshipped and shown time and time again how VALUABLE someone can make you feel, you get more picky with dating. Even with stripping, which is a form of sugaring in a sense- you get regulars who see you on the reg, who shower you with attention, gift, money, and praise, and you're all, wait why am I hanging with someone that I'm not sure if I enjoy that much, needs constant reassurance himself, and I'm not gaining anything?!",
            "author": "kimchi_Queen",
            "id": "fsg6gti",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1590952308.0,
            "replies": []
        },
        {
            "body": "Everyone has a type. I doubt anyone could truly say they don't have physical preferences. I personally keep most of my search filter options open when I search for someone new on Secret Benefits. As long as they are fit enough to keep up with me and have a nice face and personality I'm game!",
            "author": "ShaneJMD",
            "id": "fsz3c8p",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1591366508.0,
            "replies": []
        },
        {
            "body": "Looking for a new sugar baby. Girls 18+ hmu. Honest and humble preferred! Text me strictly on WhatsApp for my attention and for $7500 first Payment +1(937)392-2140,... Cash app payment",
            "author": "anthony_ben",
            "id": "fvap8nk",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1592533074.0,
            "replies": []
        },
        {
            "body": "Happy father's day,... Looking for a new sugar baby. Girls 18+ hmu. Honest and humble preferred! Text me strictly on WhatsApp for my attention and for $7500 first Payment +1(937)392-2140,... Cash app payment",
            "author": "anthony_ben",
            "id": "fvkn6h4",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1592773326.0,
            "replies": []
        },
        {
            "body": "looking for a loyal sugar baby to spoil silly and pay off all credit card debts hmu if interested ❤️❤️",
            "author": "Daddy2755",
            "id": "fy0l4vr",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1594712441.0,
            "replies": []
        },
        {
            "body": "looking for a loyal sugar baby to spoil silly and pay off all credit card debts hmu if interested ❤️",
            "author": "Daddy2755",
            "id": "fy0lrqa",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1594713065.0,
            "replies": []
        },
        {
            "body": "So, we have a post from an Asian girl basically saying that she commands attention in the bowl in her area and is more sought after than even white girls. (didn't realize that was actually a preference, more like the standard option)\n\nI had been planning to post a rant about my experiences with Asian girls specifically in my area, so let's just toss that in here since this post is already a dumpster fire imo.  For clarity, I just got done with a 9 hour meeting with my SB because she kept watching just a couple more episodes of Gossip Girl, which she has never seen, and then we would have more sex, and repeat.  I've been drinking vodka the whole time, because I only drink with other people so this is a treat.  Oh, and Seattle is burning so I had to walk her a half mile for an Uber to be able to pick her and take her home because police cars were blocking all the roads near my place.\n\n/rant\nSo, when I jumped back in the bowl three months ago I stayed true to who I am and decided to seek out data.  Without exaggeration, I have spoken to close to 200 girls in the past three months, described my ideal arrangement, and asked them what they would look for in a weekly allowance.  I know my market, better than any individual SD or SB.  I know PPM.  I know allowances.\n\n75% of girls fall within a single $XXX amount for either, 10% being almost comically lower (island girls), 10% being much higher, and 5% clearly whale hunters.  And what do you know, but the 10% above the market average were almost exclusively Asian.  Seattle has a large Asian community, and that percentage is expressed even greater in the bowl here.  This isn't Nebraska, they are not unique snowflakes.\n\nAnd yet, they invariably expect a higher price than everyone else.  For no apparent reason.  This extends from Asian girls new to the bowl, whose friends have told them they should expect $XXX platonic date fees and 2-4X average PPM and allowance, to experienced SBs that should know better but still expect at least 1.5-3X the average.  And when negotiation or a compromise is sought, there is nothing hit entitlement and derision for the suggestion.\n\nSorry for this, has been stewing for some time as day by day I experience one negative encounter after another.  Enjoy your evenings.\n\n/endrant",
            "author": "storm170",
            "id": "fseh4d8",
            "parent_id": "t3_gtttpo",
            "score": 0,
            "created_utc": 1590909780.0,
            "replies": [
                {
                    "body": "This isn't my experience in California.  Those who ask the highest allowances are whoever think they can, and I've see the higher end from \\*all\\* races/ethnicities.  (e.g., similar allowance ask from average + very curvy African American; curvy Indian American; slim and curvy Caussian; slim Asian) \n\nMaybe the market here is the most diverse?  Most girls, regardless of ethnicity, tend to ask for the average--and those who ask way above aren't exceptional enough to me to warrant it TBH.",
                    "author": null,
                    "id": "fsgqh0q",
                    "parent_id": "t1_fseh4d8",
                    "score": 3,
                    "created_utc": 1590962747.0,
                    "replies": []
                },
                {
                    "body": "I’m sorry for your experiences in seattle. Though i do not live there, i’m very aware that white girls are the most sought after in the bowl. But my ppm was average except one arrangement where i received 2-3x than the average ppm. I was very lucky and he agreed whatever i suggested. I know that sugaring is prostitution so i do whatever in my ways to make the SD happy while they’re with me and not to bore them with certain topics they cant relate to.",
                    "author": "throawaway17117",
                    "id": "fsei81i",
                    "parent_id": "t1_fseh4d8",
                    "score": 2,
                    "created_utc": 1590910732.0,
                    "replies": [
                        {
                            "body": "I’m curious. \n\nMy personal bias is that Asian women do expect a fairly large allowance compared to other women I’ve met on the site (mostly white).  \n\nI’ve attributed that to the assumption that There are a lot of Asian and white SDs and that Asian SBs are more likely to be in an SR with an Asian or white male while white SB’s, generally speaking, prefer a white SD. \n\nThat increases the odds for the Asian SB and I’ve also read that Asian SDs tend to be, again no data, just a vibe, more generous. \n\nI also have a bias and I’m not proud to admit this, but I just have gotten the feeling from the Asian SBs I’ve interacted with that this is far more transactional for them than the white SBs I’ve met. \n\nAnd this is where real life blends in. I live in California and interact with Asian women a fair amount and older (my age) Asian women talk a lot about money and status. \n\nSo all these points have led me to this belief system. \n\nWhat is your opinion of all this?",
                            "author": null,
                            "id": "fsfbivu",
                            "parent_id": "t1_fsei81i",
                            "score": 4,
                            "created_utc": 1590935883.0,
                            "replies": [
                                {
                                    "body": "I’m in Sydney and agree. I got to a point where I would avoid Asian women pot SB’S as it was all so transactional with them.\nHere is very multi cultural with many Asian people.\n\nFor me I just want a person who looks after herself and has a nice personality.\nI don’t care about race.\n\nFor perspective my long term partner is Asian and my SB is also Asian .\nI like my SB for her personality and I guess looks but it has zero to do with her Asian background.\n\nBased on my experience on SA she is the exception to Asian SB’S in general.",
                                    "author": "SydSd1",
                                    "id": "fsgxyo6",
                                    "parent_id": "t1_fsfbivu",
                                    "score": 2,
                                    "created_utc": 1590966741.0,
                                    "replies": []
                                },
                                {
                                    "body": "I never heard about this, but in nyc, i think white sbs get more allowance in general. In general, eurocentric beauty standards are more sought after. But its true that money and status does matter alot. When i joined the bowl, i wanted the discreet arrangement so i wasnt looking for hanging out in public type of arrangement. Its not my thing and i’m not that social person and also wanted to remain my privacy.",
                                    "author": "throawaway17117",
                                    "id": "fsgnnpt",
                                    "parent_id": "t1_fsfbivu",
                                    "score": 1,
                                    "created_utc": 1590961254.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh sweet girl. Sugaring may be sex work, which is debated on this forum on a regular basis, but it is absolutely not prostitution.\n\nYes, making the person you are in an arrangement happy is a great thing.  But only if they give the same consideration to you and your happiness.",
                            "author": "storm170",
                            "id": "fseidpc",
                            "parent_id": "t1_fsei81i",
                            "score": 7,
                            "created_utc": 1590910868.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fseisof",
                    "parent_id": "t1_fseh4d8",
                    "score": -1,
                    "created_utc": 1590911235.0,
                    "replies": [
                        {
                            "body": "Just to be clear.\n\nYou feel that I was wrong to be frustrated because:\n\n- Asian girls are fetishized in general, even though they are the second highest ethnicity in my area which limits that factor\n- They more often fit the standard physical expectations for a SB and have womanly virtues (not going there)\n- You have not had Asian girls lie about what they look like, unlike your experiences with white and Latina women\n\nIf that's your argument as to why they should expect to command a higher rate in Seattle then I disagree.  None of those statements provides a clear reason why in Seattle specifically an Asian girl should command a higher PPM or allowance than any other ethnicity that isn't lying about how they look.\n\nAnd to be clear, half of my vanilla girlfriends over the past 20 years have been Asian.  I dig them for sure.  But I don't fetishize them, to me they are only as attractive as any other attractive white, black, latina, or other girl.  And yes, I have dated all of those ethnicities in the past decade.  I just like attractive.  Period.",
                            "author": "storm170",
                            "id": "fsejjur",
                            "parent_id": "t1_fseisof",
                            "score": 4,
                            "created_utc": 1590911905.0,
                            "replies": [
                                {
                                    "body": "Stop inquiring as to what they expect! You're setting yourself up for these feelings. Say what you pay and if they're still talking to you that means they'd like to get paid that.",
                                    "author": "TeddyTMI",
                                    "id": "fsen6mm",
                                    "parent_id": "t1_fsejjur",
                                    "score": 1,
                                    "created_utc": 1590915214.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do like a tiny asian girl, if they have the bubbly, not the boring personality. Stop asking them what they \"expect.\" Tell them what you pay and what you expect. \n\nGolden Rule: You have the gold you make the rules.",
                    "author": "TeddyTMI",
                    "id": "fsen2gn",
                    "parent_id": "t1_fseh4d8",
                    "score": -4,
                    "created_utc": 1590915105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im 4'11 about 170lb and i get dms all the time. Being chubby... there is nothing wrong with that. Alot POT arent just look for sex they would like someone with personality and the ability to have deep convos at times and have pillow talks at times. If they wanted u just for that they wouldve hired someone. Ur meet and greet, isnt about just what u like  in bed both ways its about how is the vibe is between u two. Again this is my personal experience",
            "author": "geeky206",
            "id": "fsg3wh8",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1590950975.0,
            "replies": []
        },
        {
            "body": "Exactly this. If you take 2 sds, both have good personalities and offerring the same allowance, one is overweight / obese the other is slim / fit, the sb will choose the fit sd almost everytime. We also want slim / fit / healthy sbs. 40% of Americans are obese, with another 30% overweight. 20 % of children to age 19 are obese. \"Body positivity\" is just a label to justify unhealthy food addictions and not taking personal responsibility for ones health. There is no \"body positive\"  standard for men, because we understand its not good to be overweight / obese, and we know people dont want to see our beer bellies.",
            "author": "dade_murphy1",
            "id": "fsg44b1",
            "parent_id": "t3_gtttpo",
            "score": 1,
            "created_utc": 1590951090.0,
            "replies": []
        },
        {
            "body": "I think most guys would admit that slim is best, is only the feminist agenda selling it to you that it isn't...as for the race thing, yeah, white is still the prettiest if you're looking at the 9/10 range so there you go, on average east Asian are prettier, but SDs are looking at the prettiest so that maybe where you're feeling the skew so much. Also at the higher end of men, you get less people who are \"yellow fevered\" as that is kinda loser behaviour too.\n\nBut if you're an 8+ then it shouldn't matter, at that level personality matters more and an SD, you get so much attention you're only gonna go with the best.",
            "author": "Massgumption",
            "id": "fsg1l43",
            "parent_id": "t3_gtttpo",
            "score": -3,
            "created_utc": 1590949779.0,
            "replies": [
                {
                    "body": ">as for the race thing, yeah, white is still the prettiest if you're looking at the 9/10 range so there you go\n\nI'm sorry, WHAT?!",
                    "author": "bsbdfw",
                    "id": "fsh1vmf",
                    "parent_id": "t1_fsg1l43",
                    "score": 3,
                    "created_utc": 1590968900.0,
                    "replies": [
                        {
                            "body": "This just an honest opinion so don't be offended, and explains what you go thru. Namely put that hottest 5% of white girls are hotter (by general opinion) than the top 5% Asian girls objectively speaking, this is most apparent in the most successful black and asian guys where you see far far higher % dating white than the normal cause when you're a real successful guy, you will have your pick of the top 5% be it white, Asian, black or Latino. Also look at say white NFL or sports stars, they mix with non white far less than say the norm, which white movie star has married an Asian girl? There will be a few but it's super super rare Vs what you see on the streets \n\nAsian girls on average are more popular, since they are slimmer and more gentle and appeal more to nerdier/geekier guys due to the fact they are indeed a little more submissive...however top tier men don't care for this, so white wins out at higher level. \n\nI'm just explaining cultural circumstance as it is, it's not right or wrong (like how Asian girls love white guys) it's just a trend of what's going on today.",
                            "author": "Massgumption",
                            "id": "fsh474f",
                            "parent_id": "t1_fsh1vmf",
                            "score": -1,
                            "created_utc": 1590970210.0,
                            "replies": [
                                {
                                    "body": ">This just an honest opinion so don't be offended\n\nThe only thing that \"offends\" me is you phrasing an opinion as a fact. Using fictional stats on subjective matters is laughable. I'm just tickled.",
                                    "author": "bsbdfw",
                                    "id": "fsh9rsj",
                                    "parent_id": "t1_fsh474f",
                                    "score": 3,
                                    "created_utc": 1590973396.0,
                                    "replies": [
                                        {
                                            "body": "The same as you stating that if you were white you'd get a lot matches AS A FACT, when in reality it could be that you're not as attractive as you THINK you are, or that your personality or profile sucks. However I take the benefit of the doubt and believe your truth from your point of view and discuss from there. Same same. \n\nMy theory actually supports what YOU experience so I don't know why you're so adamant against it, there will never be research done on this so of course it'll have to be annidoctal. However you can observe this easily, just name me a major white male movie star with an Asian wife? And then compare that with how many normal white people have Asian wives. You just want to believe the truth that confirms YOUR world view (what like white girls have it easy or white men are racist...who knows), but if that's the case why bother even posting on Reddit when all you want is a sound board.\n\nAs for Asian girls being easy on white guys as a stereotype (you say this as if your don't believe it), it is undeniably true, there is definitely a pedestal effect and speaking to Asian girls it's to do with an inferiority complex and fitting in, a lot would never even consider dating their own apart from maybe first bf or perhaps when they are 30+ and need to settle down.",
                                            "author": "Massgumption",
                                            "id": "fsi9b8m",
                                            "parent_id": "t1_fsh9rsj",
                                            "score": -2,
                                            "created_utc": 1590998094.0,
                                            "replies": [
                                                {
                                                    "body": ">My theory actually supports what YOU experience\n\n...um, who are you confusing me for? Because I haven't shared any experience with you. I was just thrown for a loop where you gave statistics of white people being the prettiest. My 3 comments are *strictly* about this.",
                                                    "author": "bsbdfw",
                                                    "id": "fsiaupg",
                                                    "parent_id": "t1_fsi9b8m",
                                                    "score": 3,
                                                    "created_utc": 1590999573.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
                                                            "author": "Massgumption",
                                                            "id": "fsid89t",
                                                            "parent_id": "t1_fsiaupg",
                                                            "score": 0,
                                                            "created_utc": 1591001926.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Haha indeed.",
                                                                    "author": "bsbdfw",
                                                                    "id": "fsidfsr",
                                                                    "parent_id": "t1_fsid89t",
                                                                    "score": 2,
                                                                    "created_utc": 1591002134.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree, even though i’m asian i met alot of SD who believed i should act certain way as i’m asian and was looking for girl to satisfy their perfectly stereotyped asian.",
            "author": "throawaway17117",
            "id": "fsedpoq",
            "parent_id": "t1_fseciof",
            "score": 13,
            "created_utc": 1590906961.0,
            "replies": []
        },
        {
            "body": "You have a niche product to sell. Get to selling girl.",
            "author": "ElementShow",
            "id": "fsff4xh",
            "parent_id": "t1_fseciof",
            "score": 6,
            "created_utc": 1590937984.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fsffewd",
                    "parent_id": "t1_fsff4xh",
                    "score": 1,
                    "created_utc": 1590938140.0,
                    "replies": [
                        {
                            "body": "I'm a \"type\" as well. Once I decided to play that card to the fullest and own it, I learned what kind of men are looking for me. So I look for those men. Makes my search short and sweet.",
                            "author": "ElementShow",
                            "id": "fsffmzr",
                            "parent_id": "t1_fsffewd",
                            "score": 2,
                            "created_utc": 1590938269.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsfhb4f",
            "parent_id": "t1_fseciof",
            "score": 7,
            "created_utc": 1590939203.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fsfhy23",
                    "parent_id": "t1_fsfhb4f",
                    "score": 7,
                    "created_utc": 1590939555.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seconded. Hardly anyones preference but definitely their fetish. But sometimes that works in my favour. Especially since SRs are slightly different than traditional dating and who men would usually date. There's an opportunity for them to date outside of 'the norm'.",
            "author": "DramaticStruggle0",
            "id": "fsedlqq",
            "parent_id": "t1_fseciof",
            "score": 8,
            "created_utc": 1590906873.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fseeecs",
                    "parent_id": "t1_fsedlqq",
                    "score": 8,
                    "created_utc": 1590907519.0,
                    "replies": [
                        {
                            "body": "Gosh that’s absolutely terrible. Did it not make you feel put down? I feel like in general women have been inferior throughout history but that just sounds like men who want to feel superior by having someone disposable and inferior to be in control of.\n\nI know the power aspect does come into some relationships in a less jaded and judgemental way - but I think I would just be so annoyed after the initial excitement wears off and I can understand how that would get old super quick. You’re worth more than that hun.",
                            "author": "Silver-Strawberry",
                            "id": "fsf77d0",
                            "parent_id": "t1_fseeecs",
                            "score": 3,
                            "created_utc": 1590933083.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am almost in the same boat as you, however I fall a little bit lower on the attractive scale while my body is still fetishized. I rarely am anyone’s “type” but when I am it’s always the “I hear black chicks give the best s*x.” I’ve been on SA for a year now and have only had 2 POT, both who ended up not working out. I’ve tried everything from sending thoughtful messages to lowering my expectations, which have gotten me nowhere. I’m curious to how women of color are supposed to navigate the SL when men search for only skinny, white women?",
            "author": "babyykds",
            "id": "fsp50lk",
            "parent_id": "t1_fseciof",
            "score": 2,
            "created_utc": 1591146476.0,
            "replies": []
        },
        {
            "body": "Oh that was before i lost my weight. I was 120lbs. But the SDs i met, surprisingly the fit ones werent vocal about my body but the out of shape guys were very vocal about my looks",
            "author": "throawaway17117",
            "id": "fsf0icj",
            "parent_id": "t1_fsf0f44",
            "score": 18,
            "created_utc": 1590928063.0,
            "replies": [
                {
                    "body": "Even that's only a BMI of 21.3.",
                    "author": "aotus_trivirgatus",
                    "id": "fsf0x4x",
                    "parent_id": "t1_fsf0icj",
                    "score": 13,
                    "created_utc": 1590928401.0,
                    "replies": [
                        {
                            "body": "I wish they were accepting but since they pay someone to have sex, most guys would prefer to sleep with slim woman. \n\nI’ve had numerous encounters where a guy was coming back to me ( i made new account so they werent aware that it was me ) and what i couldnt understand was why its so hard for them to find a girl when theres thousands of girls in nyc. We were discussing allowance and then i saw him searching for another girl on SA. \nOr quiz me with certain things as if its the test i have to pass or harassing me because i wouldnt agree to his suggested ppm. \n\nDiscreet type of SDs dont care much. \n\nSurprisingly the better looking the SD was, the less judgemental they were.\n\nI was extremely lucky to meet really nice SD, i even met a guy who looked like he was straight out of movie or guy who was in 50s but looked like he was in 30s and respected me well and sex was very intense with bdsm but arragement usually lasted only an hr.",
                            "author": "throawaway17117",
                            "id": "fsf1c4n",
                            "parent_id": "t1_fsf0x4x",
                            "score": 11,
                            "created_utc": 1590928740.0,
                            "replies": []
                        },
                        {
                            "body": "Ikr I'm bmi 21 and am always called \"lean fit\", no where close to chubby. I think even a BMI up to 24 shouldn't be called chubby, or they're just straightaway rude",
                            "author": "komeonebabe",
                            "id": "fsgk064",
                            "parent_id": "t1_fsf0x4x",
                            "score": 2,
                            "created_utc": 1590959344.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ugh, I’m so sorry you were judged and treated that way",
                    "author": "Silver-Strawberry",
                    "id": "fsf7baq",
                    "parent_id": "t1_fsf0icj",
                    "score": 4,
                    "created_utc": 1590933160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsg9h5m",
            "parent_id": "t1_fsf0f44",
            "score": 3,
            "created_utc": 1590953869.0,
            "replies": [
                {
                    "body": "I'm actually a research biologist.  I understand the limitations of the BMI.  The BMI is a reasonably good guide for humans near the average height range of around 150 years ago, which is when BMI was invented (yeah, it's old).  If you're between 5'0\" and 5'10\", it's a reasonable measure.  Outside of that range, it's not so great.",
                    "author": "aotus_trivirgatus",
                    "id": "fshq4kc",
                    "parent_id": "t1_fsg9h5m",
                    "score": 3,
                    "created_utc": 1590983110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true. Women have it so backwards. I LOVE simple long hair. You dont need to dye your hair.",
            "author": "dade_murphy1",
            "id": "fsg2sk9",
            "parent_id": "t1_fsf56p1",
            "score": 5,
            "created_utc": 1590950397.0,
            "replies": []
        },
        {
            "body": "Not just body types.  Height is a major one, as is attractiveness overall.  It's well known and documented in multiple studies of the data from dating site interactions that 80% of the women go for the top 10% of the men, while with men it's definitely more of a bell curve.\n\nNothing wrong with that.  Everyone gets to choose who they go for...\n\nThe pattern does lead to frustration on both sides though.",
            "author": "soicansaywhatiwant",
            "id": "fsf2dct",
            "parent_id": "t1_fsedejm",
            "score": 5,
            "created_utc": 1590929561.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fsf6u15",
                    "parent_id": "t1_fsf2dct",
                    "score": 2,
                    "created_utc": 1590932789.0,
                    "replies": [
                        {
                            "body": "Before the Match Group bought up nearly every major dating app there was some good data out there.  Now, due to $ motives, a lot of it is tougher to find since it has been taken down. \n\nHere's one still floating around out there:\n\n[Tinder Experiments II: Guys, unless you are really hot you are probably better off not wasting your time](https://medium.com/@worstonlinedater/tinder-experiments-ii-guys-unless-you-are-really-hot-you-are-probably-better-off-not-wasting-your-2ddf370a6e9a)\n\n\"*Unfortunately, this percentage decreases rapidly as you go down the attractiveness scale. According to this analysis a man of average attractiveness can only expect to be liked by slightly less than 1% of females (0.87%). \"*\n\nThere was another similar one out there for OKCupid a few year ago but the research was done by the OKCupid company before they got bought by Match so it's not as easy to find.  I think women rated 80% of the men on the site as unattractive while the men rated in a classic bell curve.",
                            "author": "soicansaywhatiwant",
                            "id": "fsf8foo",
                            "parent_id": "t1_fsf6u15",
                            "score": 6,
                            "created_utc": 1590933921.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fsfi6m2",
                                    "parent_id": "t1_fsf8foo",
                                    "score": 4,
                                    "created_utc": 1590939684.0,
                                    "replies": [
                                        {
                                            "body": "Fair enough but my experience on OKCupid, Match, and Tinder has been pretty much the same. Women value height a lot and go for the really good looking guys. Seen a few friends tinder gold or matches.  The great-looking tall guy is hammered with swipes.  The tall average guy is not far behind.  Being successful, in shape, politically similar, kink similar doesn't really produce the same interest.  I know that women get avalanched with right swipes/likes/messages depending on the app so I don't blame them for devoting their limited time to the profiles they really like. It's the nature of online dating.\n\nI've been out of that vanilla dating world for over a year.  I dabble in the sugar lifestyle looking for a woman open to the swinging/BDSM lifestyle. Now, that world is so different in my experience. People say it's impossible for single males but, no, it most definitely is not.  So many awesome people. Most, unfortunately for me, are already coupled but better single there than in the in a relationship in the vanilla world and unconnected sexually/intimately.",
                                            "author": "soicansaywhatiwant",
                                            "id": "fsjkz3n",
                                            "parent_id": "t1_fsfi6m2",
                                            "score": 2,
                                            "created_utc": 1591031580.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "\\>their tastes and preferences are a lot more individual than men's are.\n\nHahahahahahahahahahah\n\nOh man, I wish I had time to get into this but I am not touching this baloney right now. Needless to say I couldn't agree less. In fact, there is plenty of evidence to suggest that [women prefer men when they know other women approve of their appearance.](https://www.businessinsider.com/women-are-more-attracted-to-men-when-other-women-like-them-2018-1)\n\nAnyway I've experienced dating as a thin guy, fit guy, and fat guy as my body has changed up and down a lot over the years. I assure you that there is a major disparity in the experiences between physically fit men and unfit men. Beyond what you'd expect, I imagine. It's the difference between being inundated with matches and being lucky to get any if you manage to take really good photos.",
                                            "author": "NoBromo3213",
                                            "id": "fsmgicv",
                                            "parent_id": "t1_fsfi6m2",
                                            "score": 1,
                                            "created_utc": 1591095104.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm about the same as you size wise, but I'm not exotic.  Maybe my personality it though lol 😆 \n\nBut i know guys love the curves and naturally shaped women.  They like to say they prefer skinny white chick's with enhanced boobs and bleached hair. But in the end the curves normally win over.. just my personal experience.",
            "author": "Madisonesthe1",
            "id": "fsfmhoa",
            "parent_id": "t1_fsfd06d",
            "score": 2,
            "created_utc": 1590942019.0,
            "replies": [
                {
                    "body": "Awesome to hear from someone In a similar position.",
                    "author": "shesanewman",
                    "id": "fsfphu5",
                    "parent_id": "t1_fsfmhoa",
                    "score": 2,
                    "created_utc": 1590943598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "BC weight is a necessary evil.😭 \nCan anything be done about it tho?",
            "author": "PioneerExperience",
            "id": "fshs8vz",
            "parent_id": "t1_fsfhbd1",
            "score": 2,
            "created_utc": 1590984481.0,
            "replies": [
                {
                    "body": "Ugh took me damn near a year to get it off",
                    "author": "cornycatlady",
                    "id": "fshshzb",
                    "parent_id": "t1_fshs8vz",
                    "score": 2,
                    "created_utc": 1590984645.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsfm5rh",
            "parent_id": "t1_fsf1az3",
            "score": 2,
            "created_utc": 1590941843.0,
            "replies": [
                {
                    "body": "No, just in person when I am out!",
                    "author": null,
                    "id": "fsfpzs3",
                    "parent_id": "t1_fsfm5rh",
                    "score": 1,
                    "created_utc": 1590943859.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fsfrdjs",
                            "parent_id": "t1_fsfpzs3",
                            "score": 3,
                            "created_utc": 1590944571.0,
                            "replies": [
                                {
                                    "body": "Hang out where wealthy men hang out.",
                                    "author": "babylina",
                                    "id": "fsgglsr",
                                    "parent_id": "t1_fsfrdjs",
                                    "score": 2,
                                    "created_utc": 1590957575.0,
                                    "replies": []
                                },
                                {
                                    "body": "Actually yes! Or better yet, have you tried tinder and changing the setting to an older age? 90% are crap but some are really really fantastic and want to find something real!",
                                    "author": null,
                                    "id": "fsg0fzl",
                                    "parent_id": "t1_fsfrdjs",
                                    "score": 1,
                                    "created_utc": 1590949196.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hypocricy is a power to be reckoned with.  Second only in power to ignorance.  Dont try to fight either as you will lose. :P\n\n**EVERYBODY** will always have preferences.  Even(especially) if we pretend otherwise.  But, we also have the right to complain about other peoples preferences if they annoy us! :)",
            "author": "duckydee543",
            "id": "fsf6b97",
            "parent_id": "t1_fsf22yq",
            "score": 8,
            "created_utc": 1590932434.0,
            "replies": []
        },
        {
            "body": "I agree but it was hard not to while in the bowl, sadly. Just like SDs, i couldnt have arrangement with any SD. I had a type of guys i could sleep with and these guys had a type i had to adhere to in order to start an arrangement with them.",
            "author": "throawaway17117",
            "id": "fseh0sl",
            "parent_id": "t1_fsegwu0",
            "score": 3,
            "created_utc": 1590909696.0,
            "replies": [
                {
                    "body": "There’s a huge difference between having a type and changing yourself to fit the types you think you’re expected to be. You are who you are and no amount of weight loss or makeup or book smarts is going to make you more attractive to someone that expects perfection in an imperfect world.",
                    "author": "pumpkinspicedcream",
                    "id": "fsehtf1",
                    "parent_id": "t1_fseh0sl",
                    "score": 6,
                    "created_utc": 1590910385.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This isn't my experience in California.  Those who ask the highest allowances are whoever think they can, and I've see the higher end from \\*all\\* races/ethnicities.  (e.g., similar allowance ask from average + very curvy African American; curvy Indian American; slim and curvy Caussian; slim Asian) \n\nMaybe the market here is the most diverse?  Most girls, regardless of ethnicity, tend to ask for the average--and those who ask way above aren't exceptional enough to me to warrant it TBH.",
            "author": null,
            "id": "fsgqh0q",
            "parent_id": "t1_fseh4d8",
            "score": 3,
            "created_utc": 1590962747.0,
            "replies": []
        },
        {
            "body": "I’m sorry for your experiences in seattle. Though i do not live there, i’m very aware that white girls are the most sought after in the bowl. But my ppm was average except one arrangement where i received 2-3x than the average ppm. I was very lucky and he agreed whatever i suggested. I know that sugaring is prostitution so i do whatever in my ways to make the SD happy while they’re with me and not to bore them with certain topics they cant relate to.",
            "author": "throawaway17117",
            "id": "fsei81i",
            "parent_id": "t1_fseh4d8",
            "score": 2,
            "created_utc": 1590910732.0,
            "replies": [
                {
                    "body": "I’m curious. \n\nMy personal bias is that Asian women do expect a fairly large allowance compared to other women I’ve met on the site (mostly white).  \n\nI’ve attributed that to the assumption that There are a lot of Asian and white SDs and that Asian SBs are more likely to be in an SR with an Asian or white male while white SB’s, generally speaking, prefer a white SD. \n\nThat increases the odds for the Asian SB and I’ve also read that Asian SDs tend to be, again no data, just a vibe, more generous. \n\nI also have a bias and I’m not proud to admit this, but I just have gotten the feeling from the Asian SBs I’ve interacted with that this is far more transactional for them than the white SBs I’ve met. \n\nAnd this is where real life blends in. I live in California and interact with Asian women a fair amount and older (my age) Asian women talk a lot about money and status. \n\nSo all these points have led me to this belief system. \n\nWhat is your opinion of all this?",
                    "author": null,
                    "id": "fsfbivu",
                    "parent_id": "t1_fsei81i",
                    "score": 4,
                    "created_utc": 1590935883.0,
                    "replies": [
                        {
                            "body": "I’m in Sydney and agree. I got to a point where I would avoid Asian women pot SB’S as it was all so transactional with them.\nHere is very multi cultural with many Asian people.\n\nFor me I just want a person who looks after herself and has a nice personality.\nI don’t care about race.\n\nFor perspective my long term partner is Asian and my SB is also Asian .\nI like my SB for her personality and I guess looks but it has zero to do with her Asian background.\n\nBased on my experience on SA she is the exception to Asian SB’S in general.",
                            "author": "SydSd1",
                            "id": "fsgxyo6",
                            "parent_id": "t1_fsfbivu",
                            "score": 2,
                            "created_utc": 1590966741.0,
                            "replies": []
                        },
                        {
                            "body": "I never heard about this, but in nyc, i think white sbs get more allowance in general. In general, eurocentric beauty standards are more sought after. But its true that money and status does matter alot. When i joined the bowl, i wanted the discreet arrangement so i wasnt looking for hanging out in public type of arrangement. Its not my thing and i’m not that social person and also wanted to remain my privacy.",
                            "author": "throawaway17117",
                            "id": "fsgnnpt",
                            "parent_id": "t1_fsfbivu",
                            "score": 1,
                            "created_utc": 1590961254.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh sweet girl. Sugaring may be sex work, which is debated on this forum on a regular basis, but it is absolutely not prostitution.\n\nYes, making the person you are in an arrangement happy is a great thing.  But only if they give the same consideration to you and your happiness.",
                    "author": "storm170",
                    "id": "fseidpc",
                    "parent_id": "t1_fsei81i",
                    "score": 7,
                    "created_utc": 1590910868.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fseisof",
            "parent_id": "t1_fseh4d8",
            "score": -1,
            "created_utc": 1590911235.0,
            "replies": [
                {
                    "body": "Just to be clear.\n\nYou feel that I was wrong to be frustrated because:\n\n- Asian girls are fetishized in general, even though they are the second highest ethnicity in my area which limits that factor\n- They more often fit the standard physical expectations for a SB and have womanly virtues (not going there)\n- You have not had Asian girls lie about what they look like, unlike your experiences with white and Latina women\n\nIf that's your argument as to why they should expect to command a higher rate in Seattle then I disagree.  None of those statements provides a clear reason why in Seattle specifically an Asian girl should command a higher PPM or allowance than any other ethnicity that isn't lying about how they look.\n\nAnd to be clear, half of my vanilla girlfriends over the past 20 years have been Asian.  I dig them for sure.  But I don't fetishize them, to me they are only as attractive as any other attractive white, black, latina, or other girl.  And yes, I have dated all of those ethnicities in the past decade.  I just like attractive.  Period.",
                    "author": "storm170",
                    "id": "fsejjur",
                    "parent_id": "t1_fseisof",
                    "score": 4,
                    "created_utc": 1590911905.0,
                    "replies": [
                        {
                            "body": "Stop inquiring as to what they expect! You're setting yourself up for these feelings. Say what you pay and if they're still talking to you that means they'd like to get paid that.",
                            "author": "TeddyTMI",
                            "id": "fsen6mm",
                            "parent_id": "t1_fsejjur",
                            "score": 1,
                            "created_utc": 1590915214.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do like a tiny asian girl, if they have the bubbly, not the boring personality. Stop asking them what they \"expect.\" Tell them what you pay and what you expect. \n\nGolden Rule: You have the gold you make the rules.",
            "author": "TeddyTMI",
            "id": "fsen2gn",
            "parent_id": "t1_fseh4d8",
            "score": -4,
            "created_utc": 1590915105.0,
            "replies": []
        },
        {
            "body": ">as for the race thing, yeah, white is still the prettiest if you're looking at the 9/10 range so there you go\n\nI'm sorry, WHAT?!",
            "author": "bsbdfw",
            "id": "fsh1vmf",
            "parent_id": "t1_fsg1l43",
            "score": 3,
            "created_utc": 1590968900.0,
            "replies": [
                {
                    "body": "This just an honest opinion so don't be offended, and explains what you go thru. Namely put that hottest 5% of white girls are hotter (by general opinion) than the top 5% Asian girls objectively speaking, this is most apparent in the most successful black and asian guys where you see far far higher % dating white than the normal cause when you're a real successful guy, you will have your pick of the top 5% be it white, Asian, black or Latino. Also look at say white NFL or sports stars, they mix with non white far less than say the norm, which white movie star has married an Asian girl? There will be a few but it's super super rare Vs what you see on the streets \n\nAsian girls on average are more popular, since they are slimmer and more gentle and appeal more to nerdier/geekier guys due to the fact they are indeed a little more submissive...however top tier men don't care for this, so white wins out at higher level. \n\nI'm just explaining cultural circumstance as it is, it's not right or wrong (like how Asian girls love white guys) it's just a trend of what's going on today.",
                    "author": "Massgumption",
                    "id": "fsh474f",
                    "parent_id": "t1_fsh1vmf",
                    "score": -1,
                    "created_utc": 1590970210.0,
                    "replies": [
                        {
                            "body": ">This just an honest opinion so don't be offended\n\nThe only thing that \"offends\" me is you phrasing an opinion as a fact. Using fictional stats on subjective matters is laughable. I'm just tickled.",
                            "author": "bsbdfw",
                            "id": "fsh9rsj",
                            "parent_id": "t1_fsh474f",
                            "score": 3,
                            "created_utc": 1590973396.0,
                            "replies": [
                                {
                                    "body": "The same as you stating that if you were white you'd get a lot matches AS A FACT, when in reality it could be that you're not as attractive as you THINK you are, or that your personality or profile sucks. However I take the benefit of the doubt and believe your truth from your point of view and discuss from there. Same same. \n\nMy theory actually supports what YOU experience so I don't know why you're so adamant against it, there will never be research done on this so of course it'll have to be annidoctal. However you can observe this easily, just name me a major white male movie star with an Asian wife? And then compare that with how many normal white people have Asian wives. You just want to believe the truth that confirms YOUR world view (what like white girls have it easy or white men are racist...who knows), but if that's the case why bother even posting on Reddit when all you want is a sound board.\n\nAs for Asian girls being easy on white guys as a stereotype (you say this as if your don't believe it), it is undeniably true, there is definitely a pedestal effect and speaking to Asian girls it's to do with an inferiority complex and fitting in, a lot would never even consider dating their own apart from maybe first bf or perhaps when they are 30+ and need to settle down.",
                                    "author": "Massgumption",
                                    "id": "fsi9b8m",
                                    "parent_id": "t1_fsh9rsj",
                                    "score": -2,
                                    "created_utc": 1590998094.0,
                                    "replies": [
                                        {
                                            "body": ">My theory actually supports what YOU experience\n\n...um, who are you confusing me for? Because I haven't shared any experience with you. I was just thrown for a loop where you gave statistics of white people being the prettiest. My 3 comments are *strictly* about this.",
                                            "author": "bsbdfw",
                                            "id": "fsiaupg",
                                            "parent_id": "t1_fsi9b8m",
                                            "score": 3,
                                            "created_utc": 1590999573.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
                                                    "author": "Massgumption",
                                                    "id": "fsid89t",
                                                    "parent_id": "t1_fsiaupg",
                                                    "score": 0,
                                                    "created_utc": 1591001926.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha indeed.",
                                                            "author": "bsbdfw",
                                                            "id": "fsidfsr",
                                                            "parent_id": "t1_fsid89t",
                                                            "score": 2,
                                                            "created_utc": 1591002134.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsffewd",
            "parent_id": "t1_fsff4xh",
            "score": 1,
            "created_utc": 1590938140.0,
            "replies": [
                {
                    "body": "I'm a \"type\" as well. Once I decided to play that card to the fullest and own it, I learned what kind of men are looking for me. So I look for those men. Makes my search short and sweet.",
                    "author": "ElementShow",
                    "id": "fsffmzr",
                    "parent_id": "t1_fsffewd",
                    "score": 2,
                    "created_utc": 1590938269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsfhy23",
            "parent_id": "t1_fsfhb4f",
            "score": 7,
            "created_utc": 1590939555.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fseeecs",
            "parent_id": "t1_fsedlqq",
            "score": 8,
            "created_utc": 1590907519.0,
            "replies": [
                {
                    "body": "Gosh that’s absolutely terrible. Did it not make you feel put down? I feel like in general women have been inferior throughout history but that just sounds like men who want to feel superior by having someone disposable and inferior to be in control of.\n\nI know the power aspect does come into some relationships in a less jaded and judgemental way - but I think I would just be so annoyed after the initial excitement wears off and I can understand how that would get old super quick. You’re worth more than that hun.",
                    "author": "Silver-Strawberry",
                    "id": "fsf77d0",
                    "parent_id": "t1_fseeecs",
                    "score": 3,
                    "created_utc": 1590933083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even that's only a BMI of 21.3.",
            "author": "aotus_trivirgatus",
            "id": "fsf0x4x",
            "parent_id": "t1_fsf0icj",
            "score": 13,
            "created_utc": 1590928401.0,
            "replies": [
                {
                    "body": "I wish they were accepting but since they pay someone to have sex, most guys would prefer to sleep with slim woman. \n\nI’ve had numerous encounters where a guy was coming back to me ( i made new account so they werent aware that it was me ) and what i couldnt understand was why its so hard for them to find a girl when theres thousands of girls in nyc. We were discussing allowance and then i saw him searching for another girl on SA. \nOr quiz me with certain things as if its the test i have to pass or harassing me because i wouldnt agree to his suggested ppm. \n\nDiscreet type of SDs dont care much. \n\nSurprisingly the better looking the SD was, the less judgemental they were.\n\nI was extremely lucky to meet really nice SD, i even met a guy who looked like he was straight out of movie or guy who was in 50s but looked like he was in 30s and respected me well and sex was very intense with bdsm but arragement usually lasted only an hr.",
                    "author": "throawaway17117",
                    "id": "fsf1c4n",
                    "parent_id": "t1_fsf0x4x",
                    "score": 11,
                    "created_utc": 1590928740.0,
                    "replies": []
                },
                {
                    "body": "Ikr I'm bmi 21 and am always called \"lean fit\", no where close to chubby. I think even a BMI up to 24 shouldn't be called chubby, or they're just straightaway rude",
                    "author": "komeonebabe",
                    "id": "fsgk064",
                    "parent_id": "t1_fsf0x4x",
                    "score": 2,
                    "created_utc": 1590959344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh, I’m so sorry you were judged and treated that way",
            "author": "Silver-Strawberry",
            "id": "fsf7baq",
            "parent_id": "t1_fsf0icj",
            "score": 4,
            "created_utc": 1590933160.0,
            "replies": []
        },
        {
            "body": "I'm actually a research biologist.  I understand the limitations of the BMI.  The BMI is a reasonably good guide for humans near the average height range of around 150 years ago, which is when BMI was invented (yeah, it's old).  If you're between 5'0\" and 5'10\", it's a reasonable measure.  Outside of that range, it's not so great.",
            "author": "aotus_trivirgatus",
            "id": "fshq4kc",
            "parent_id": "t1_fsg9h5m",
            "score": 3,
            "created_utc": 1590983110.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fsf6u15",
            "parent_id": "t1_fsf2dct",
            "score": 2,
            "created_utc": 1590932789.0,
            "replies": [
                {
                    "body": "Before the Match Group bought up nearly every major dating app there was some good data out there.  Now, due to $ motives, a lot of it is tougher to find since it has been taken down. \n\nHere's one still floating around out there:\n\n[Tinder Experiments II: Guys, unless you are really hot you are probably better off not wasting your time](https://medium.com/@worstonlinedater/tinder-experiments-ii-guys-unless-you-are-really-hot-you-are-probably-better-off-not-wasting-your-2ddf370a6e9a)\n\n\"*Unfortunately, this percentage decreases rapidly as you go down the attractiveness scale. According to this analysis a man of average attractiveness can only expect to be liked by slightly less than 1% of females (0.87%). \"*\n\nThere was another similar one out there for OKCupid a few year ago but the research was done by the OKCupid company before they got bought by Match so it's not as easy to find.  I think women rated 80% of the men on the site as unattractive while the men rated in a classic bell curve.",
                    "author": "soicansaywhatiwant",
                    "id": "fsf8foo",
                    "parent_id": "t1_fsf6u15",
                    "score": 6,
                    "created_utc": 1590933921.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fsfi6m2",
                            "parent_id": "t1_fsf8foo",
                            "score": 4,
                            "created_utc": 1590939684.0,
                            "replies": [
                                {
                                    "body": "Fair enough but my experience on OKCupid, Match, and Tinder has been pretty much the same. Women value height a lot and go for the really good looking guys. Seen a few friends tinder gold or matches.  The great-looking tall guy is hammered with swipes.  The tall average guy is not far behind.  Being successful, in shape, politically similar, kink similar doesn't really produce the same interest.  I know that women get avalanched with right swipes/likes/messages depending on the app so I don't blame them for devoting their limited time to the profiles they really like. It's the nature of online dating.\n\nI've been out of that vanilla dating world for over a year.  I dabble in the sugar lifestyle looking for a woman open to the swinging/BDSM lifestyle. Now, that world is so different in my experience. People say it's impossible for single males but, no, it most definitely is not.  So many awesome people. Most, unfortunately for me, are already coupled but better single there than in the in a relationship in the vanilla world and unconnected sexually/intimately.",
                                    "author": "soicansaywhatiwant",
                                    "id": "fsjkz3n",
                                    "parent_id": "t1_fsfi6m2",
                                    "score": 2,
                                    "created_utc": 1591031580.0,
                                    "replies": []
                                },
                                {
                                    "body": "\\>their tastes and preferences are a lot more individual than men's are.\n\nHahahahahahahahahahah\n\nOh man, I wish I had time to get into this but I am not touching this baloney right now. Needless to say I couldn't agree less. In fact, there is plenty of evidence to suggest that [women prefer men when they know other women approve of their appearance.](https://www.businessinsider.com/women-are-more-attracted-to-men-when-other-women-like-them-2018-1)\n\nAnyway I've experienced dating as a thin guy, fit guy, and fat guy as my body has changed up and down a lot over the years. I assure you that there is a major disparity in the experiences between physically fit men and unfit men. Beyond what you'd expect, I imagine. It's the difference between being inundated with matches and being lucky to get any if you manage to take really good photos.",
                                    "author": "NoBromo3213",
                                    "id": "fsmgicv",
                                    "parent_id": "t1_fsfi6m2",
                                    "score": 1,
                                    "created_utc": 1591095104.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awesome to hear from someone In a similar position.",
            "author": "shesanewman",
            "id": "fsfphu5",
            "parent_id": "t1_fsfmhoa",
            "score": 2,
            "created_utc": 1590943598.0,
            "replies": []
        },
        {
            "body": "Ugh took me damn near a year to get it off",
            "author": "cornycatlady",
            "id": "fshshzb",
            "parent_id": "t1_fshs8vz",
            "score": 2,
            "created_utc": 1590984645.0,
            "replies": []
        },
        {
            "body": "No, just in person when I am out!",
            "author": null,
            "id": "fsfpzs3",
            "parent_id": "t1_fsfm5rh",
            "score": 1,
            "created_utc": 1590943859.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fsfrdjs",
                    "parent_id": "t1_fsfpzs3",
                    "score": 3,
                    "created_utc": 1590944571.0,
                    "replies": [
                        {
                            "body": "Hang out where wealthy men hang out.",
                            "author": "babylina",
                            "id": "fsgglsr",
                            "parent_id": "t1_fsfrdjs",
                            "score": 2,
                            "created_utc": 1590957575.0,
                            "replies": []
                        },
                        {
                            "body": "Actually yes! Or better yet, have you tried tinder and changing the setting to an older age? 90% are crap but some are really really fantastic and want to find something real!",
                            "author": null,
                            "id": "fsg0fzl",
                            "parent_id": "t1_fsfrdjs",
                            "score": 1,
                            "created_utc": 1590949196.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s a huge difference between having a type and changing yourself to fit the types you think you’re expected to be. You are who you are and no amount of weight loss or makeup or book smarts is going to make you more attractive to someone that expects perfection in an imperfect world.",
            "author": "pumpkinspicedcream",
            "id": "fsehtf1",
            "parent_id": "t1_fseh0sl",
            "score": 6,
            "created_utc": 1590910385.0,
            "replies": []
        },
        {
            "body": "I’m curious. \n\nMy personal bias is that Asian women do expect a fairly large allowance compared to other women I’ve met on the site (mostly white).  \n\nI’ve attributed that to the assumption that There are a lot of Asian and white SDs and that Asian SBs are more likely to be in an SR with an Asian or white male while white SB’s, generally speaking, prefer a white SD. \n\nThat increases the odds for the Asian SB and I’ve also read that Asian SDs tend to be, again no data, just a vibe, more generous. \n\nI also have a bias and I’m not proud to admit this, but I just have gotten the feeling from the Asian SBs I’ve interacted with that this is far more transactional for them than the white SBs I’ve met. \n\nAnd this is where real life blends in. I live in California and interact with Asian women a fair amount and older (my age) Asian women talk a lot about money and status. \n\nSo all these points have led me to this belief system. \n\nWhat is your opinion of all this?",
            "author": null,
            "id": "fsfbivu",
            "parent_id": "t1_fsei81i",
            "score": 4,
            "created_utc": 1590935883.0,
            "replies": [
                {
                    "body": "I’m in Sydney and agree. I got to a point where I would avoid Asian women pot SB’S as it was all so transactional with them.\nHere is very multi cultural with many Asian people.\n\nFor me I just want a person who looks after herself and has a nice personality.\nI don’t care about race.\n\nFor perspective my long term partner is Asian and my SB is also Asian .\nI like my SB for her personality and I guess looks but it has zero to do with her Asian background.\n\nBased on my experience on SA she is the exception to Asian SB’S in general.",
                    "author": "SydSd1",
                    "id": "fsgxyo6",
                    "parent_id": "t1_fsfbivu",
                    "score": 2,
                    "created_utc": 1590966741.0,
                    "replies": []
                },
                {
                    "body": "I never heard about this, but in nyc, i think white sbs get more allowance in general. In general, eurocentric beauty standards are more sought after. But its true that money and status does matter alot. When i joined the bowl, i wanted the discreet arrangement so i wasnt looking for hanging out in public type of arrangement. Its not my thing and i’m not that social person and also wanted to remain my privacy.",
                    "author": "throawaway17117",
                    "id": "fsgnnpt",
                    "parent_id": "t1_fsfbivu",
                    "score": 1,
                    "created_utc": 1590961254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh sweet girl. Sugaring may be sex work, which is debated on this forum on a regular basis, but it is absolutely not prostitution.\n\nYes, making the person you are in an arrangement happy is a great thing.  But only if they give the same consideration to you and your happiness.",
            "author": "storm170",
            "id": "fseidpc",
            "parent_id": "t1_fsei81i",
            "score": 7,
            "created_utc": 1590910868.0,
            "replies": []
        },
        {
            "body": "Just to be clear.\n\nYou feel that I was wrong to be frustrated because:\n\n- Asian girls are fetishized in general, even though they are the second highest ethnicity in my area which limits that factor\n- They more often fit the standard physical expectations for a SB and have womanly virtues (not going there)\n- You have not had Asian girls lie about what they look like, unlike your experiences with white and Latina women\n\nIf that's your argument as to why they should expect to command a higher rate in Seattle then I disagree.  None of those statements provides a clear reason why in Seattle specifically an Asian girl should command a higher PPM or allowance than any other ethnicity that isn't lying about how they look.\n\nAnd to be clear, half of my vanilla girlfriends over the past 20 years have been Asian.  I dig them for sure.  But I don't fetishize them, to me they are only as attractive as any other attractive white, black, latina, or other girl.  And yes, I have dated all of those ethnicities in the past decade.  I just like attractive.  Period.",
            "author": "storm170",
            "id": "fsejjur",
            "parent_id": "t1_fseisof",
            "score": 4,
            "created_utc": 1590911905.0,
            "replies": [
                {
                    "body": "Stop inquiring as to what they expect! You're setting yourself up for these feelings. Say what you pay and if they're still talking to you that means they'd like to get paid that.",
                    "author": "TeddyTMI",
                    "id": "fsen6mm",
                    "parent_id": "t1_fsejjur",
                    "score": 1,
                    "created_utc": 1590915214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This just an honest opinion so don't be offended, and explains what you go thru. Namely put that hottest 5% of white girls are hotter (by general opinion) than the top 5% Asian girls objectively speaking, this is most apparent in the most successful black and asian guys where you see far far higher % dating white than the normal cause when you're a real successful guy, you will have your pick of the top 5% be it white, Asian, black or Latino. Also look at say white NFL or sports stars, they mix with non white far less than say the norm, which white movie star has married an Asian girl? There will be a few but it's super super rare Vs what you see on the streets \n\nAsian girls on average are more popular, since they are slimmer and more gentle and appeal more to nerdier/geekier guys due to the fact they are indeed a little more submissive...however top tier men don't care for this, so white wins out at higher level. \n\nI'm just explaining cultural circumstance as it is, it's not right or wrong (like how Asian girls love white guys) it's just a trend of what's going on today.",
            "author": "Massgumption",
            "id": "fsh474f",
            "parent_id": "t1_fsh1vmf",
            "score": -1,
            "created_utc": 1590970210.0,
            "replies": [
                {
                    "body": ">This just an honest opinion so don't be offended\n\nThe only thing that \"offends\" me is you phrasing an opinion as a fact. Using fictional stats on subjective matters is laughable. I'm just tickled.",
                    "author": "bsbdfw",
                    "id": "fsh9rsj",
                    "parent_id": "t1_fsh474f",
                    "score": 3,
                    "created_utc": 1590973396.0,
                    "replies": [
                        {
                            "body": "The same as you stating that if you were white you'd get a lot matches AS A FACT, when in reality it could be that you're not as attractive as you THINK you are, or that your personality or profile sucks. However I take the benefit of the doubt and believe your truth from your point of view and discuss from there. Same same. \n\nMy theory actually supports what YOU experience so I don't know why you're so adamant against it, there will never be research done on this so of course it'll have to be annidoctal. However you can observe this easily, just name me a major white male movie star with an Asian wife? And then compare that with how many normal white people have Asian wives. You just want to believe the truth that confirms YOUR world view (what like white girls have it easy or white men are racist...who knows), but if that's the case why bother even posting on Reddit when all you want is a sound board.\n\nAs for Asian girls being easy on white guys as a stereotype (you say this as if your don't believe it), it is undeniably true, there is definitely a pedestal effect and speaking to Asian girls it's to do with an inferiority complex and fitting in, a lot would never even consider dating their own apart from maybe first bf or perhaps when they are 30+ and need to settle down.",
                            "author": "Massgumption",
                            "id": "fsi9b8m",
                            "parent_id": "t1_fsh9rsj",
                            "score": -2,
                            "created_utc": 1590998094.0,
                            "replies": [
                                {
                                    "body": ">My theory actually supports what YOU experience\n\n...um, who are you confusing me for? Because I haven't shared any experience with you. I was just thrown for a loop where you gave statistics of white people being the prettiest. My 3 comments are *strictly* about this.",
                                    "author": "bsbdfw",
                                    "id": "fsiaupg",
                                    "parent_id": "t1_fsi9b8m",
                                    "score": 3,
                                    "created_utc": 1590999573.0,
                                    "replies": [
                                        {
                                            "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
                                            "author": "Massgumption",
                                            "id": "fsid89t",
                                            "parent_id": "t1_fsiaupg",
                                            "score": 0,
                                            "created_utc": 1591001926.0,
                                            "replies": [
                                                {
                                                    "body": "Haha indeed.",
                                                    "author": "bsbdfw",
                                                    "id": "fsidfsr",
                                                    "parent_id": "t1_fsid89t",
                                                    "score": 2,
                                                    "created_utc": 1591002134.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a \"type\" as well. Once I decided to play that card to the fullest and own it, I learned what kind of men are looking for me. So I look for those men. Makes my search short and sweet.",
            "author": "ElementShow",
            "id": "fsffmzr",
            "parent_id": "t1_fsffewd",
            "score": 2,
            "created_utc": 1590938269.0,
            "replies": []
        },
        {
            "body": "Gosh that’s absolutely terrible. Did it not make you feel put down? I feel like in general women have been inferior throughout history but that just sounds like men who want to feel superior by having someone disposable and inferior to be in control of.\n\nI know the power aspect does come into some relationships in a less jaded and judgemental way - but I think I would just be so annoyed after the initial excitement wears off and I can understand how that would get old super quick. You’re worth more than that hun.",
            "author": "Silver-Strawberry",
            "id": "fsf77d0",
            "parent_id": "t1_fseeecs",
            "score": 3,
            "created_utc": 1590933083.0,
            "replies": []
        },
        {
            "body": "I wish they were accepting but since they pay someone to have sex, most guys would prefer to sleep with slim woman. \n\nI’ve had numerous encounters where a guy was coming back to me ( i made new account so they werent aware that it was me ) and what i couldnt understand was why its so hard for them to find a girl when theres thousands of girls in nyc. We were discussing allowance and then i saw him searching for another girl on SA. \nOr quiz me with certain things as if its the test i have to pass or harassing me because i wouldnt agree to his suggested ppm. \n\nDiscreet type of SDs dont care much. \n\nSurprisingly the better looking the SD was, the less judgemental they were.\n\nI was extremely lucky to meet really nice SD, i even met a guy who looked like he was straight out of movie or guy who was in 50s but looked like he was in 30s and respected me well and sex was very intense with bdsm but arragement usually lasted only an hr.",
            "author": "throawaway17117",
            "id": "fsf1c4n",
            "parent_id": "t1_fsf0x4x",
            "score": 11,
            "created_utc": 1590928740.0,
            "replies": []
        },
        {
            "body": "Ikr I'm bmi 21 and am always called \"lean fit\", no where close to chubby. I think even a BMI up to 24 shouldn't be called chubby, or they're just straightaway rude",
            "author": "komeonebabe",
            "id": "fsgk064",
            "parent_id": "t1_fsf0x4x",
            "score": 2,
            "created_utc": 1590959344.0,
            "replies": []
        },
        {
            "body": "Before the Match Group bought up nearly every major dating app there was some good data out there.  Now, due to $ motives, a lot of it is tougher to find since it has been taken down. \n\nHere's one still floating around out there:\n\n[Tinder Experiments II: Guys, unless you are really hot you are probably better off not wasting your time](https://medium.com/@worstonlinedater/tinder-experiments-ii-guys-unless-you-are-really-hot-you-are-probably-better-off-not-wasting-your-2ddf370a6e9a)\n\n\"*Unfortunately, this percentage decreases rapidly as you go down the attractiveness scale. According to this analysis a man of average attractiveness can only expect to be liked by slightly less than 1% of females (0.87%). \"*\n\nThere was another similar one out there for OKCupid a few year ago but the research was done by the OKCupid company before they got bought by Match so it's not as easy to find.  I think women rated 80% of the men on the site as unattractive while the men rated in a classic bell curve.",
            "author": "soicansaywhatiwant",
            "id": "fsf8foo",
            "parent_id": "t1_fsf6u15",
            "score": 6,
            "created_utc": 1590933921.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fsfi6m2",
                    "parent_id": "t1_fsf8foo",
                    "score": 4,
                    "created_utc": 1590939684.0,
                    "replies": [
                        {
                            "body": "Fair enough but my experience on OKCupid, Match, and Tinder has been pretty much the same. Women value height a lot and go for the really good looking guys. Seen a few friends tinder gold or matches.  The great-looking tall guy is hammered with swipes.  The tall average guy is not far behind.  Being successful, in shape, politically similar, kink similar doesn't really produce the same interest.  I know that women get avalanched with right swipes/likes/messages depending on the app so I don't blame them for devoting their limited time to the profiles they really like. It's the nature of online dating.\n\nI've been out of that vanilla dating world for over a year.  I dabble in the sugar lifestyle looking for a woman open to the swinging/BDSM lifestyle. Now, that world is so different in my experience. People say it's impossible for single males but, no, it most definitely is not.  So many awesome people. Most, unfortunately for me, are already coupled but better single there than in the in a relationship in the vanilla world and unconnected sexually/intimately.",
                            "author": "soicansaywhatiwant",
                            "id": "fsjkz3n",
                            "parent_id": "t1_fsfi6m2",
                            "score": 2,
                            "created_utc": 1591031580.0,
                            "replies": []
                        },
                        {
                            "body": "\\>their tastes and preferences are a lot more individual than men's are.\n\nHahahahahahahahahahah\n\nOh man, I wish I had time to get into this but I am not touching this baloney right now. Needless to say I couldn't agree less. In fact, there is plenty of evidence to suggest that [women prefer men when they know other women approve of their appearance.](https://www.businessinsider.com/women-are-more-attracted-to-men-when-other-women-like-them-2018-1)\n\nAnyway I've experienced dating as a thin guy, fit guy, and fat guy as my body has changed up and down a lot over the years. I assure you that there is a major disparity in the experiences between physically fit men and unfit men. Beyond what you'd expect, I imagine. It's the difference between being inundated with matches and being lucky to get any if you manage to take really good photos.",
                            "author": "NoBromo3213",
                            "id": "fsmgicv",
                            "parent_id": "t1_fsfi6m2",
                            "score": 1,
                            "created_utc": 1591095104.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fsfrdjs",
            "parent_id": "t1_fsfpzs3",
            "score": 3,
            "created_utc": 1590944571.0,
            "replies": [
                {
                    "body": "Hang out where wealthy men hang out.",
                    "author": "babylina",
                    "id": "fsgglsr",
                    "parent_id": "t1_fsfrdjs",
                    "score": 2,
                    "created_utc": 1590957575.0,
                    "replies": []
                },
                {
                    "body": "Actually yes! Or better yet, have you tried tinder and changing the setting to an older age? 90% are crap but some are really really fantastic and want to find something real!",
                    "author": null,
                    "id": "fsg0fzl",
                    "parent_id": "t1_fsfrdjs",
                    "score": 1,
                    "created_utc": 1590949196.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m in Sydney and agree. I got to a point where I would avoid Asian women pot SB’S as it was all so transactional with them.\nHere is very multi cultural with many Asian people.\n\nFor me I just want a person who looks after herself and has a nice personality.\nI don’t care about race.\n\nFor perspective my long term partner is Asian and my SB is also Asian .\nI like my SB for her personality and I guess looks but it has zero to do with her Asian background.\n\nBased on my experience on SA she is the exception to Asian SB’S in general.",
            "author": "SydSd1",
            "id": "fsgxyo6",
            "parent_id": "t1_fsfbivu",
            "score": 2,
            "created_utc": 1590966741.0,
            "replies": []
        },
        {
            "body": "I never heard about this, but in nyc, i think white sbs get more allowance in general. In general, eurocentric beauty standards are more sought after. But its true that money and status does matter alot. When i joined the bowl, i wanted the discreet arrangement so i wasnt looking for hanging out in public type of arrangement. Its not my thing and i’m not that social person and also wanted to remain my privacy.",
            "author": "throawaway17117",
            "id": "fsgnnpt",
            "parent_id": "t1_fsfbivu",
            "score": 1,
            "created_utc": 1590961254.0,
            "replies": []
        },
        {
            "body": "Stop inquiring as to what they expect! You're setting yourself up for these feelings. Say what you pay and if they're still talking to you that means they'd like to get paid that.",
            "author": "TeddyTMI",
            "id": "fsen6mm",
            "parent_id": "t1_fsejjur",
            "score": 1,
            "created_utc": 1590915214.0,
            "replies": []
        },
        {
            "body": ">This just an honest opinion so don't be offended\n\nThe only thing that \"offends\" me is you phrasing an opinion as a fact. Using fictional stats on subjective matters is laughable. I'm just tickled.",
            "author": "bsbdfw",
            "id": "fsh9rsj",
            "parent_id": "t1_fsh474f",
            "score": 3,
            "created_utc": 1590973396.0,
            "replies": [
                {
                    "body": "The same as you stating that if you were white you'd get a lot matches AS A FACT, when in reality it could be that you're not as attractive as you THINK you are, or that your personality or profile sucks. However I take the benefit of the doubt and believe your truth from your point of view and discuss from there. Same same. \n\nMy theory actually supports what YOU experience so I don't know why you're so adamant against it, there will never be research done on this so of course it'll have to be annidoctal. However you can observe this easily, just name me a major white male movie star with an Asian wife? And then compare that with how many normal white people have Asian wives. You just want to believe the truth that confirms YOUR world view (what like white girls have it easy or white men are racist...who knows), but if that's the case why bother even posting on Reddit when all you want is a sound board.\n\nAs for Asian girls being easy on white guys as a stereotype (you say this as if your don't believe it), it is undeniably true, there is definitely a pedestal effect and speaking to Asian girls it's to do with an inferiority complex and fitting in, a lot would never even consider dating their own apart from maybe first bf or perhaps when they are 30+ and need to settle down.",
                    "author": "Massgumption",
                    "id": "fsi9b8m",
                    "parent_id": "t1_fsh9rsj",
                    "score": -2,
                    "created_utc": 1590998094.0,
                    "replies": [
                        {
                            "body": ">My theory actually supports what YOU experience\n\n...um, who are you confusing me for? Because I haven't shared any experience with you. I was just thrown for a loop where you gave statistics of white people being the prettiest. My 3 comments are *strictly* about this.",
                            "author": "bsbdfw",
                            "id": "fsiaupg",
                            "parent_id": "t1_fsi9b8m",
                            "score": 3,
                            "created_utc": 1590999573.0,
                            "replies": [
                                {
                                    "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
                                    "author": "Massgumption",
                                    "id": "fsid89t",
                                    "parent_id": "t1_fsiaupg",
                                    "score": 0,
                                    "created_utc": 1591001926.0,
                                    "replies": [
                                        {
                                            "body": "Haha indeed.",
                                            "author": "bsbdfw",
                                            "id": "fsidfsr",
                                            "parent_id": "t1_fsid89t",
                                            "score": 2,
                                            "created_utc": 1591002134.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fsfi6m2",
            "parent_id": "t1_fsf8foo",
            "score": 4,
            "created_utc": 1590939684.0,
            "replies": [
                {
                    "body": "Fair enough but my experience on OKCupid, Match, and Tinder has been pretty much the same. Women value height a lot and go for the really good looking guys. Seen a few friends tinder gold or matches.  The great-looking tall guy is hammered with swipes.  The tall average guy is not far behind.  Being successful, in shape, politically similar, kink similar doesn't really produce the same interest.  I know that women get avalanched with right swipes/likes/messages depending on the app so I don't blame them for devoting their limited time to the profiles they really like. It's the nature of online dating.\n\nI've been out of that vanilla dating world for over a year.  I dabble in the sugar lifestyle looking for a woman open to the swinging/BDSM lifestyle. Now, that world is so different in my experience. People say it's impossible for single males but, no, it most definitely is not.  So many awesome people. Most, unfortunately for me, are already coupled but better single there than in the in a relationship in the vanilla world and unconnected sexually/intimately.",
                    "author": "soicansaywhatiwant",
                    "id": "fsjkz3n",
                    "parent_id": "t1_fsfi6m2",
                    "score": 2,
                    "created_utc": 1591031580.0,
                    "replies": []
                },
                {
                    "body": "\\>their tastes and preferences are a lot more individual than men's are.\n\nHahahahahahahahahahah\n\nOh man, I wish I had time to get into this but I am not touching this baloney right now. Needless to say I couldn't agree less. In fact, there is plenty of evidence to suggest that [women prefer men when they know other women approve of their appearance.](https://www.businessinsider.com/women-are-more-attracted-to-men-when-other-women-like-them-2018-1)\n\nAnyway I've experienced dating as a thin guy, fit guy, and fat guy as my body has changed up and down a lot over the years. I assure you that there is a major disparity in the experiences between physically fit men and unfit men. Beyond what you'd expect, I imagine. It's the difference between being inundated with matches and being lucky to get any if you manage to take really good photos.",
                    "author": "NoBromo3213",
                    "id": "fsmgicv",
                    "parent_id": "t1_fsfi6m2",
                    "score": 1,
                    "created_utc": 1591095104.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hang out where wealthy men hang out.",
            "author": "babylina",
            "id": "fsgglsr",
            "parent_id": "t1_fsfrdjs",
            "score": 2,
            "created_utc": 1590957575.0,
            "replies": []
        },
        {
            "body": "Actually yes! Or better yet, have you tried tinder and changing the setting to an older age? 90% are crap but some are really really fantastic and want to find something real!",
            "author": null,
            "id": "fsg0fzl",
            "parent_id": "t1_fsfrdjs",
            "score": 1,
            "created_utc": 1590949196.0,
            "replies": []
        },
        {
            "body": "The same as you stating that if you were white you'd get a lot matches AS A FACT, when in reality it could be that you're not as attractive as you THINK you are, or that your personality or profile sucks. However I take the benefit of the doubt and believe your truth from your point of view and discuss from there. Same same. \n\nMy theory actually supports what YOU experience so I don't know why you're so adamant against it, there will never be research done on this so of course it'll have to be annidoctal. However you can observe this easily, just name me a major white male movie star with an Asian wife? And then compare that with how many normal white people have Asian wives. You just want to believe the truth that confirms YOUR world view (what like white girls have it easy or white men are racist...who knows), but if that's the case why bother even posting on Reddit when all you want is a sound board.\n\nAs for Asian girls being easy on white guys as a stereotype (you say this as if your don't believe it), it is undeniably true, there is definitely a pedestal effect and speaking to Asian girls it's to do with an inferiority complex and fitting in, a lot would never even consider dating their own apart from maybe first bf or perhaps when they are 30+ and need to settle down.",
            "author": "Massgumption",
            "id": "fsi9b8m",
            "parent_id": "t1_fsh9rsj",
            "score": -2,
            "created_utc": 1590998094.0,
            "replies": [
                {
                    "body": ">My theory actually supports what YOU experience\n\n...um, who are you confusing me for? Because I haven't shared any experience with you. I was just thrown for a loop where you gave statistics of white people being the prettiest. My 3 comments are *strictly* about this.",
                    "author": "bsbdfw",
                    "id": "fsiaupg",
                    "parent_id": "t1_fsi9b8m",
                    "score": 3,
                    "created_utc": 1590999573.0,
                    "replies": [
                        {
                            "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
                            "author": "Massgumption",
                            "id": "fsid89t",
                            "parent_id": "t1_fsiaupg",
                            "score": 0,
                            "created_utc": 1591001926.0,
                            "replies": [
                                {
                                    "body": "Haha indeed.",
                                    "author": "bsbdfw",
                                    "id": "fsidfsr",
                                    "parent_id": "t1_fsid89t",
                                    "score": 2,
                                    "created_utc": 1591002134.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fair enough but my experience on OKCupid, Match, and Tinder has been pretty much the same. Women value height a lot and go for the really good looking guys. Seen a few friends tinder gold or matches.  The great-looking tall guy is hammered with swipes.  The tall average guy is not far behind.  Being successful, in shape, politically similar, kink similar doesn't really produce the same interest.  I know that women get avalanched with right swipes/likes/messages depending on the app so I don't blame them for devoting their limited time to the profiles they really like. It's the nature of online dating.\n\nI've been out of that vanilla dating world for over a year.  I dabble in the sugar lifestyle looking for a woman open to the swinging/BDSM lifestyle. Now, that world is so different in my experience. People say it's impossible for single males but, no, it most definitely is not.  So many awesome people. Most, unfortunately for me, are already coupled but better single there than in the in a relationship in the vanilla world and unconnected sexually/intimately.",
            "author": "soicansaywhatiwant",
            "id": "fsjkz3n",
            "parent_id": "t1_fsfi6m2",
            "score": 2,
            "created_utc": 1591031580.0,
            "replies": []
        },
        {
            "body": "\\>their tastes and preferences are a lot more individual than men's are.\n\nHahahahahahahahahahah\n\nOh man, I wish I had time to get into this but I am not touching this baloney right now. Needless to say I couldn't agree less. In fact, there is plenty of evidence to suggest that [women prefer men when they know other women approve of their appearance.](https://www.businessinsider.com/women-are-more-attracted-to-men-when-other-women-like-them-2018-1)\n\nAnyway I've experienced dating as a thin guy, fit guy, and fat guy as my body has changed up and down a lot over the years. I assure you that there is a major disparity in the experiences between physically fit men and unfit men. Beyond what you'd expect, I imagine. It's the difference between being inundated with matches and being lucky to get any if you manage to take really good photos.",
            "author": "NoBromo3213",
            "id": "fsmgicv",
            "parent_id": "t1_fsfi6m2",
            "score": 1,
            "created_utc": 1591095104.0,
            "replies": []
        },
        {
            "body": ">My theory actually supports what YOU experience\n\n...um, who are you confusing me for? Because I haven't shared any experience with you. I was just thrown for a loop where you gave statistics of white people being the prettiest. My 3 comments are *strictly* about this.",
            "author": "bsbdfw",
            "id": "fsiaupg",
            "parent_id": "t1_fsi9b8m",
            "score": 3,
            "created_utc": 1590999573.0,
            "replies": [
                {
                    "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
                    "author": "Massgumption",
                    "id": "fsid89t",
                    "parent_id": "t1_fsiaupg",
                    "score": 0,
                    "created_utc": 1591001926.0,
                    "replies": [
                        {
                            "body": "Haha indeed.",
                            "author": "bsbdfw",
                            "id": "fsidfsr",
                            "parent_id": "t1_fsid89t",
                            "score": 2,
                            "created_utc": 1591002134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry, that's my bad, you're not even the OP!! Why are you fucking replying to this, I'm not even talking to you.... Hahaha.",
            "author": "Massgumption",
            "id": "fsid89t",
            "parent_id": "t1_fsiaupg",
            "score": 0,
            "created_utc": 1591001926.0,
            "replies": [
                {
                    "body": "Haha indeed.",
                    "author": "bsbdfw",
                    "id": "fsidfsr",
                    "parent_id": "t1_fsid89t",
                    "score": 2,
                    "created_utc": 1591002134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha indeed.",
            "author": "bsbdfw",
            "id": "fsidfsr",
            "parent_id": "t1_fsid89t",
            "score": 2,
            "created_utc": 1591002134.0,
            "replies": []
        }
    ]
}