{
    "title": "Hashirama Senju😎",
    "post_id": "ohbfro",
    "post_url": "https://www.reddit.com/r/dankruto/comments/ohbfro/hashirama_senju/",
    "author": "Common_Look3321",
    "body": "",
    "url": "https://i.redd.it/gjvzcgx06ba71.jpg",
    "score": 3982,
    "upvote_ratio": 0.99,
    "created_utc": 1625889267.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I still don't understand how he didn't live a long live. Obito didn't need to eat to survive apparently, it can mitigate or slowdown the side effect of Sharingan Jutsu, regeneration, etc.",
            "author": "DecayDancing",
            "id": "h4oldzf",
            "parent_id": "t3_ohbfro",
            "score": 87,
            "created_utc": 1625905534.0,
            "replies": [
                {
                    "body": "He was kia.",
                    "author": "FatCatTitties",
                    "id": "h4p5kax",
                    "parent_id": "t1_h4oldzf",
                    "score": 24,
                    "created_utc": 1625922921.0,
                    "replies": []
                },
                {
                    "body": "i think it’s assumed that his godlike regeneration shortened his lifespan, i could remember wrong tho",
                    "author": "BudTrip",
                    "id": "h4ow9qc",
                    "parent_id": "t1_h4oldzf",
                    "score": 39,
                    "created_utc": 1625916094.0,
                    "replies": [
                        {
                            "body": "No, your right. Tsunade's healing is basically the same as Hashirama's...which makes sense. And her technique considerably shortens her lifespan, which is why it's a good thing that she can't use it all the time. I mean, she's only in her early 50s by the start of the show, but she looks much older when her henge falls.\n\nSo it would stand to reason that Hashirama, who couldn't turn his technique off, and was using it repeatedly, would live a considerably shorter lifespan. From what I understand, I don't even think the guy cleared 40.",
                            "author": null,
                            "id": "h4phgrh",
                            "parent_id": "t1_h4ow9qc",
                            "score": 22,
                            "created_utc": 1625929433.0,
                            "replies": []
                        },
                        {
                            "body": "I kind of just assumed he lived a long life and died of old age tbh. He at least lived long enough for Tsunade to remember him well, but he must have stepped down from hokage pretty early bc Tobirama was only (assumed) a few years younger than him.",
                            "author": "sheogoraths-bitch",
                            "id": "h4p47fa",
                            "parent_id": "t1_h4ow9qc",
                            "score": 32,
                            "created_utc": 1625922045.0,
                            "replies": [
                                {
                                    "body": "Tsunade is over 50 years old, and is the guys direct granddaughter.  She was young, but we actually see how Hashi remembers her; 4 or 5 years old.",
                                    "author": null,
                                    "id": "h4phmvn",
                                    "parent_id": "t1_h4p47fa",
                                    "score": 27,
                                    "created_utc": 1625929517.0,
                                    "replies": [
                                        {
                                            "body": "Tsunade being 4-5 and having a gambling problem is fucking hilarious",
                                            "author": "LiveLoveKanye",
                                            "id": "h4t5ck9",
                                            "parent_id": "t1_h4phmvn",
                                            "score": 11,
                                            "created_utc": 1626012469.0,
                                            "replies": [
                                                {
                                                    "body": "Isn't it? Tiny Tsuna with a big wad of cash is just so funny.",
                                                    "author": null,
                                                    "id": "h57tsq7",
                                                    "parent_id": "t1_h4t5ck9",
                                                    "score": 2,
                                                    "created_utc": 1626308213.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "yeah you’re right",
                                    "author": "BudTrip",
                                    "id": "h4pvjxo",
                                    "parent_id": "t1_h4p47fa",
                                    "score": 3,
                                    "created_utc": 1625936023.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Similar to Tsunade's 100 healings when healing you use up the bodies finite amount of cell division which lowers your overall lifespan, so I assume he didnt do the age regression technique Tsunade does to look younger that makes her seem to rapidly age when her chakra is low but just burned out his cells at about the age we see him revived at",
                    "author": "Far-Resident-4913",
                    "id": "h4p4z9i",
                    "parent_id": "t1_h4oldzf",
                    "score": 11,
                    "created_utc": 1625922545.0,
                    "replies": []
                },
                {
                    "body": "madara gave hashirama ninja aids when he bit him",
                    "author": "jwaters0122",
                    "id": "h4q8dvh",
                    "parent_id": "t1_h4oldzf",
                    "score": 2,
                    "created_utc": 1625942643.0,
                    "replies": []
                },
                {
                    "body": "he died using wood styles regeneration too much.\n\nIt’s hinted that madara kept kicking hashiramas ass but he would constantly heal the wounds .\n\nEvery single time he heals his lifespan is shortened, He lives in the first world war so you know how things went",
                    "author": "verifiedjay",
                    "id": "h4pi5hm",
                    "parent_id": "t1_h4oldzf",
                    "score": -7,
                    "created_utc": 1625929775.0,
                    "replies": [
                        {
                            "body": "It’s never hinted that Madara was getting the better of hashirama.",
                            "author": "HeraldofblueRP",
                            "id": "h4pmlur",
                            "parent_id": "t1_h4pi5hm",
                            "score": 8,
                            "created_utc": 1625931918.0,
                            "replies": [
                                {
                                    "body": "yes it is, in some  flash backs, like of their final fight if you look closely you’ll see him damaged  badly at one point then healed up at another\n\nhinting that he was constantly healing through the fight. that’s why it took so long for him to beat an uchiha, a clan without much stamina. Because he wasn’t necessarily beating him.\n\n\n\nWe know his wood style is good for taking out the susannoo and for taking out the 9 tails. Both very large entities \n\nBut every time we saw them right as humans it was hands (or sword and fan)  Madara was most definitely whooping his ass in hand to hand combat. can’t convince me other wise tbh",
                                    "author": "verifiedjay",
                                    "id": "h4pnd2r",
                                    "parent_id": "t1_h4pmlur",
                                    "score": -3,
                                    "created_utc": 1625932269.0,
                                    "replies": [
                                        {
                                            "body": "Madara has lost every major fight with hashi except post reanimated",
                                            "author": null,
                                            "id": "h4qgdmo",
                                            "parent_id": "t1_h4pnd2r",
                                            "score": 5,
                                            "created_utc": 1625946929.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "That’s just not true. Hashirama had been countering madara’s every move. Hashirama had been holding back the entire time in the Final Valley battle hoping Madara would cease his attack. Hashirama did make it a battle of stamina. He was also defensive the majority of the time. \n\nThe final valley battle goes like this \n1. Madara attacks Hashirama \n2. Hashirama blocks or massively over powers every attack Madara threw at him\n3. Hashirama tells Madara to stop or else\n4. Repeat a few times. \n\nAt no point in the Final Valley battle did Madara have the upper hand. I could be wrong, but I believe the scene you’re referring to is when they both cross the river to attack each other and hashirama is downed. Turned out that the downed Hashirama was a clone. The real hashirama snuck behind an exhausted Madara who’s Sharigan had just faded away due to exhaustion.",
                                            "author": "HeraldofblueRP",
                                            "id": "h4qcqyp",
                                            "parent_id": "t1_h4pnd2r",
                                            "score": 4,
                                            "created_utc": 1625944942.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the truest thing I've ever seen. The White Zetsus are made from Hashirama cells, and without them 2/3rds of shipuden wouldn't have happened since the war would've been much shorter, black zetsu wouldn't have had a body, danzo wouldn't have been collecting sharigans- well . . . Actually, danzo doesn't change much. His arm wasn't important at all. But a whole plot story in borutos endless filler wouldn't have happened (the one with the hashirama cell arm deal) madara wouldn't have had renigan, orochimaru wouldn't be as far in his research, kabuto wouldn't have been as important which would have been good for us because he's boring (he had the most boring flashback ever. Wasted potential in his back story) and much more\n\nBut now, petition to get a spin off 1 season show about kabutos past and his adventures as a spy, something similar to rock lees show",
            "author": "xNuxIsGod",
            "id": "h4o83r6",
            "parent_id": "t3_ohbfro",
            "score": 58,
            "created_utc": 1625894155.0,
            "replies": [
                {
                    "body": "Truest thing xD",
                    "author": "Common_Look3321",
                    "id": "h4orfox",
                    "parent_id": "t1_h4o83r6",
                    "score": 4,
                    "created_utc": 1625911554.0,
                    "replies": []
                },
                {
                    "body": "Madara only needed senju/uzimake cells. He could have harvested them from pain not entirely unlike orochimaru collected kekkei genkai. He would have had his rinnegan anyway. If rinnegan is more powerful than EMS then he should have beat hashi but hashi is basically \"lol it's just magic guys stop looking for answers lol bro he is wood guy lol just get over it lol. Bro fuck you.\" -kishi",
                    "author": "GoodboyGotter",
                    "id": "h4ob6o3",
                    "parent_id": "t1_h4o83r6",
                    "score": 10,
                    "created_utc": 1625896502.0,
                    "replies": [
                        {
                            "body": "He didn't need senju/uzumaki cells, he needed Ashura's chakra which came from Hashirama. You need both Indra's and Ashura's chakra to make the rinnegan.",
                            "author": "imjarrod12",
                            "id": "h4obomf",
                            "parent_id": "t1_h4ob6o3",
                            "score": 29,
                            "created_utc": 1625896899.0,
                            "replies": [
                                {
                                    "body": "you speaketh the truth",
                                    "author": null,
                                    "id": "h4phqyf",
                                    "parent_id": "t1_h4obomf",
                                    "score": 2,
                                    "created_utc": 1625929574.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yep and each incarnation had it including pain and naruto. :)",
                                    "author": "GoodboyGotter",
                                    "id": "h4oc5bj",
                                    "parent_id": "t1_h4obomf",
                                    "score": -17,
                                    "created_utc": 1625897263.0,
                                    "replies": [
                                        {
                                            "body": "Pain wasn't a reincarnation, he was just an Uzumaki. The only known reincarnations of Indra and Ashura are Madara/Sasuke and Hashirama/Naruto.",
                                            "author": "imjarrod12",
                                            "id": "h4oc8oz",
                                            "parent_id": "t1_h4oc5bj",
                                            "score": 25,
                                            "created_utc": 1625897341.0,
                                            "replies": [
                                                {
                                                    "body": "So you admit it. He didn't need hashi trash cells",
                                                    "author": "GoodboyGotter",
                                                    "id": "h4ocb35",
                                                    "parent_id": "t1_h4oc8oz",
                                                    "score": -23,
                                                    "created_utc": 1625897394.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't think you understand at all.",
                                                            "author": "imjarrod12",
                                                            "id": "h4ocdjz",
                                                            "parent_id": "t1_h4ocb35",
                                                            "score": 22,
                                                            "created_utc": 1625897449.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You dont either....",
                                                                    "author": "GoodboyGotter",
                                                                    "id": "h4ocrkg",
                                                                    "parent_id": "t1_h4ocdjz",
                                                                    "score": -21,
                                                                    "created_utc": 1625897769.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "He does, you don't. Go back and watch the clip.",
                                                                            "author": "xNuxIsGod",
                                                                            "id": "h4omxtm",
                                                                            "parent_id": "t1_h4ocrkg",
                                                                            "score": 12,
                                                                            "created_utc": 1625907092.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "bruh sorry but you're not right",
                                                                            "author": null,
                                                                            "id": "h4phsd1",
                                                                            "parent_id": "t1_h4ocrkg",
                                                                            "score": 4,
                                                                            "created_utc": 1625929593.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "They took the bait",
                                                                                    "author": "GoodboyGotter",
                                                                                    "id": "h4pinm7",
                                                                                    "parent_id": "t1_h4phsd1",
                                                                                    "score": -4,
                                                                                    "created_utc": 1625930022.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Ah",
                                                                                            "author": null,
                                                                                            "id": "h4pq3hn",
                                                                                            "parent_id": "t1_h4pinm7",
                                                                                            "score": 1,
                                                                                            "created_utc": 1625933544.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
                                                            "author": "noneeduselesss",
                                                            "id": "h4ono6f",
                                                            "parent_id": "t1_h4ocb35",
                                                            "score": 6,
                                                            "created_utc": 1625907821.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
                                                            "author": null,
                                                            "id": "h4ougis",
                                                            "parent_id": "t1_h4ocb35",
                                                            "score": 2,
                                                            "created_utc": 1625914460.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Nagato was absolutely not a transmigration. He was a random uzumaki that was given Madaras rinnegan.",
                                            "author": "CaptnUchiha",
                                            "id": "h4om6xk",
                                            "parent_id": "t1_h4oc5bj",
                                            "score": 10,
                                            "created_utc": 1625906337.0,
                                            "replies": [
                                                {
                                                    "body": "> transmigration \n\nLmao",
                                                    "author": "GoodboyGotter",
                                                    "id": "h4p9qq2",
                                                    "parent_id": "t1_h4om6xk",
                                                    "score": 0,
                                                    "created_utc": 1625925400.0,
                                                    "replies": [
                                                        {
                                                            "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
                                                            "author": "CaptnUchiha",
                                                            "id": "h4pnltu",
                                                            "parent_id": "t1_h4p9qq2",
                                                            "score": 3,
                                                            "created_utc": 1625932381.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I only use words that I understand 😎😎😎",
                                                                    "author": "GoodboyGotter",
                                                                    "id": "h4po6mb",
                                                                    "parent_id": "t1_h4pnltu",
                                                                    "score": 0,
                                                                    "created_utc": 1625932654.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Aiyo where did pain come from it’s sasuke",
                                            "author": "noneeduselesss",
                                            "id": "h4onm9v",
                                            "parent_id": "t1_h4oc5bj",
                                            "score": 3,
                                            "created_utc": 1625907771.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What? I just watched Kabutos flashback the other day. I actually loved it. It had great tones and ideas behind it",
                    "author": "TheFabledFamilyGuy",
                    "id": "h4q728n",
                    "parent_id": "t1_h4o83r6",
                    "score": 2,
                    "created_utc": 1625941954.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "B)",
            "author": "NoName14007",
            "id": "h4o827v",
            "parent_id": "t3_ohbfro",
            "score": 13,
            "created_utc": 1625894123.0,
            "replies": [
                {
                    "body": "#B)",
                    "author": "Common_Look3321",
                    "id": "h4og39x",
                    "parent_id": "t1_h4o827v",
                    "score": 4,
                    "created_utc": 1625900611.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Morning wood jutsu.",
            "author": null,
            "id": "h4osh9p",
            "parent_id": "t3_ohbfro",
            "score": 9,
            "created_utc": 1625912572.0,
            "replies": []
        },
        {
            "body": "You know, no Indra incarnation was ever chosen to lead. Madara was clan head coz he was born into it(iirc) but even then the Uchiha chose to stay in Konohagakure rather than follow him. Indra was denied the position by his father, and Sasuke is the head of a clan of two Uchiha, one of whom wears glasses. It's always the Ashura who gets chosen to lead",
            "author": "Edgar3t",
            "id": "h4ora41",
            "parent_id": "t3_ohbfro",
            "score": 21,
            "created_utc": 1625911402.0,
            "replies": [
                {
                    "body": "That was literally one of the main points in the show lol. It's supposed to be history repeating itself in each incarnation with ashura representing the kind-hearted path of light, and Indra representing the power-driven path of darkness. Naruto and Sasuke finally broke that chain.",
                    "author": "BuccellatiExplainsIt",
                    "id": "h4oybai",
                    "parent_id": "t1_h4ora41",
                    "score": 17,
                    "created_utc": 1625917809.0,
                    "replies": []
                },
                {
                    "body": "# hm.... Interesting",
                    "author": "Common_Look3321",
                    "id": "h4ore7w",
                    "parent_id": "t1_h4ora41",
                    "score": 8,
                    "created_utc": 1625911512.0,
                    "replies": []
                },
                {
                    "body": "Indra's are too jealous tbh though .",
                    "author": "Tarkik_Vatsa",
                    "id": "h4otebo",
                    "parent_id": "t1_h4ora41",
                    "score": 9,
                    "created_utc": 1625913464.0,
                    "replies": [
                        {
                            "body": "But they look cooler and don’t have as much talknojutsu",
                            "author": "mo-did",
                            "id": "h4p5y8f",
                            "parent_id": "t1_h4otebo",
                            "score": 0,
                            "created_utc": 1625923161.0,
                            "replies": [
                                {
                                    "body": "Indra definitely looked cooler than Ashura . But Hashirama and Naruto look as cool as Sasuke and Madara if not more . Naruto definitely looked cooler than Sasuke in Shippuden .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h4pekgk",
                                    "parent_id": "t1_h4p5y8f",
                                    "score": 7,
                                    "created_utc": 1625927965.0,
                                    "replies": [
                                        {
                                            "body": "Naruto isn’t as cool looking to me as Sasuke",
                                            "author": "mo-did",
                                            "id": "h4q1ky9",
                                            "parent_id": "t1_h4pekgk",
                                            "score": 1,
                                            "created_utc": 1625939102.0,
                                            "replies": [
                                                {
                                                    "body": "All right . I respect your opinion . But there are many people like me who find Naruto cooler than Sasuke so it depends on person to person .",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h4q49af",
                                                    "parent_id": "t1_h4q1ky9",
                                                    "score": 5,
                                                    "created_utc": 1625940483.0,
                                                    "replies": [
                                                        {
                                                            "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
                                                            "author": "mo-did",
                                                            "id": "h4q4fa1",
                                                            "parent_id": "t1_h4q49af",
                                                            "score": 1,
                                                            "created_utc": 1625940569.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                                                                    "author": "Tarkik_Vatsa",
                                                                    "id": "h4q81vw",
                                                                    "parent_id": "t1_h4q4fa1",
                                                                    "score": 3,
                                                                    "created_utc": 1625942470.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                                                                            "author": "mo-did",
                                                                            "id": "h4q8c46",
                                                                            "parent_id": "t1_h4q81vw",
                                                                            "score": 2,
                                                                            "created_utc": 1625942618.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "They're all each other's copy-paste and have annoying hax instead.",
                                    "author": "TyrionGoldenLion",
                                    "id": "h4p82hw",
                                    "parent_id": "t1_h4p5y8f",
                                    "score": 3,
                                    "created_utc": 1625924444.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You gotta be super shitty for your own clan to turn their backs on you.",
                    "author": "TyrionGoldenLion",
                    "id": "h4p84bt",
                    "parent_id": "t1_h4ora41",
                    "score": 1,
                    "created_utc": 1625924475.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Must be how Dr Gero felt.",
            "author": "android151",
            "id": "h4oqcog",
            "parent_id": "t3_ohbfro",
            "score": 4,
            "created_utc": 1625910502.0,
            "replies": []
        },
        {
            "body": "Enabled Madara in both life and death. What an amazing friend.",
            "author": "TyrionGoldenLion",
            "id": "h4omkic",
            "parent_id": "t3_ohbfro",
            "score": 6,
            "created_utc": 1625906721.0,
            "replies": []
        },
        {
            "body": "Imagine being Tsunade 🤢🤮",
            "author": "GoodboyGotter",
            "id": "h4ob2tt",
            "parent_id": "t3_ohbfro",
            "score": 12,
            "created_utc": 1625896417.0,
            "replies": [
                {
                    "body": "Weak senju makes me 🤮🤮",
                    "author": "Ricky_Thein",
                    "id": "h4ogtti",
                    "parent_id": "t1_h4ob2tt",
                    "score": 10,
                    "created_utc": 1625901269.0,
                    "replies": [
                        {
                            "body": "###Weakness Disgusts Me",
                            "author": "OPgang",
                            "id": "h4osqqv",
                            "parent_id": "t1_h4ogtti",
                            "score": 5,
                            "created_utc": 1625912832.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "#xD",
                    "author": "Common_Look3321",
                    "id": "h4p36pn",
                    "parent_id": "t1_h4ob2tt",
                    "score": 1,
                    "created_utc": 1625921376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can anyone explain the hashirama cells to me im confused",
            "author": "turtle_theturtle2006",
            "id": "h4paxb6",
            "parent_id": "t3_ohbfro",
            "score": 3,
            "created_utc": 1625926062.0,
            "replies": [
                {
                    "body": "Can anyone pray pardon me the hashirama cells to me im did confuse\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                    "author": "Shakespeare-Bot",
                    "id": "h4payqf",
                    "parent_id": "t1_h4paxb6",
                    "score": 1,
                    "created_utc": 1625926084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can anyone explain the hashirama cells to me im confused",
            "author": "turtle_theturtle2006",
            "id": "h4pay45",
            "parent_id": "t3_ohbfro",
            "score": 3,
            "created_utc": 1625926074.0,
            "replies": [
                {
                    "body": "Hashirama cells are ninja steroids.",
                    "author": "Rohan-kun",
                    "id": "h4prqg2",
                    "parent_id": "t1_h4pay45",
                    "score": 3,
                    "created_utc": 1625934289.0,
                    "replies": []
                },
                {
                    "body": "They're like, magical cancer cells that help their host",
                    "author": "that_guy_who_existed",
                    "id": "h51uuyi",
                    "parent_id": "t1_h4pay45",
                    "score": 1,
                    "created_utc": 1626193069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gotta actually give Sasuke his props for saying no to them",
            "author": "HanataSanchou",
            "id": "h4pogny",
            "parent_id": "t3_ohbfro",
            "score": 3,
            "created_utc": 1625932784.0,
            "replies": []
        },
        {
            "body": "Senju Cells at Work.",
            "author": "Rohan-kun",
            "id": "h4pqwj3",
            "parent_id": "t3_ohbfro",
            "score": 3,
            "created_utc": 1625933914.0,
            "replies": []
        },
        {
            "body": "Hashirama is so savage that he would summon the 1000 hands statue just to make em dab",
            "author": "CoukizeforU",
            "id": "h4q6l5t",
            "parent_id": "t3_ohbfro",
            "score": 3,
            "created_utc": 1625941706.0,
            "replies": []
        },
        {
            "body": "HASHIRAMAAAA",
            "author": "ThatEpicDude",
            "id": "h4os0e8",
            "parent_id": "t3_ohbfro",
            "score": 4,
            "created_utc": 1625912130.0,
            "replies": [
                {
                    "body": "\"Points finger\"\nI'll deal with you later",
                    "author": "Far-Resident-4913",
                    "id": "h4p5fer",
                    "parent_id": "t1_h4os0e8",
                    "score": 2,
                    "created_utc": 1625922830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But wait why are hashiramas cells so powerful? \nIf so will I become equal to a God if I eat sasuke and naruto?",
            "author": "Deathbringer2048",
            "id": "h4p3ua7",
            "parent_id": "t3_ohbfro",
            "score": 5,
            "created_utc": 1625921806.0,
            "replies": []
        },
        {
            "body": "**Hasarama Sancho**",
            "author": "Ab43Gaming_YT",
            "id": "h4omhr1",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625906643.0,
            "replies": []
        },
        {
            "body": "And your rival also running on them",
            "author": "mhamZa366",
            "id": "h4osmtp",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625912723.0,
            "replies": []
        },
        {
            "body": "Why does it sound so wrong",
            "author": "ASSASSINWOLFO7",
            "id": "h4osu38",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625912925.0,
            "replies": []
        },
        {
            "body": "Dr. Gero be like:",
            "author": null,
            "id": "h4p5gvx",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625922860.0,
            "replies": []
        },
        {
            "body": "hell yeah",
            "author": "AustenStorm",
            "id": "h4p5i47",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625922883.0,
            "replies": []
        },
        {
            "body": "The trees are hashirama every1 dumb af",
            "author": "cantfindnamebruh",
            "id": "h4ppw9f",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625933450.0,
            "replies": []
        },
        {
            "body": "I have seen this joke more times than i showered in my life",
            "author": "I_hate_PMO-15",
            "id": "h4pcj2w",
            "parent_id": "t3_ohbfro",
            "score": 2,
            "created_utc": 1625926914.0,
            "replies": []
        },
        {
            "body": "Boruto's plot literally revolves around hashirama cells and they haven't even explained how he died. Watch, they're gonna make up some alien sickness or some shit lol",
            "author": "HazyMirror",
            "id": "h4p21g1",
            "parent_id": "t3_ohbfro",
            "score": 3,
            "created_utc": 1625920605.0,
            "replies": [
                {
                    "body": "Did give me my favorite Orochimaru fight though so I give it a pass so far for coming back in Boruto",
                    "author": "Far-Resident-4913",
                    "id": "h4p56yc",
                    "parent_id": "t1_h4p21g1",
                    "score": 3,
                    "created_utc": 1625922679.0,
                    "replies": [
                        {
                            "body": "Lol orochimaru erased that woman from her existence in a second",
                            "author": "TheGamingSage",
                            "id": "h4qbrly",
                            "parent_id": "t1_h4p56yc",
                            "score": 2,
                            "created_utc": 1625944423.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "More lile ruining the show B)",
            "author": "woomer56",
            "id": "h4olxmt",
            "parent_id": "t3_ohbfro",
            "score": 1,
            "created_utc": 1625906074.0,
            "replies": []
        },
        {
            "body": "overused joke",
            "author": "s4ndr3x",
            "id": "h4ot9eb",
            "parent_id": "t3_ohbfro",
            "score": 1,
            "created_utc": 1625913332.0,
            "replies": [
                {
                    "body": "It might be used before too IDK about it but, I thought of it myself so pls don't send any hate to me",
                    "author": "Common_Look3321",
                    "id": "h4oto6v",
                    "parent_id": "t1_h4ot9eb",
                    "score": 2,
                    "created_utc": 1625913729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have seen this joke more times than i showered in my life",
            "author": "I_hate_PMO-15",
            "id": "h4pcjwu",
            "parent_id": "t3_ohbfro",
            "score": 1,
            "created_utc": 1625926925.0,
            "replies": []
        },
        {
            "body": "So techniccly himawaris hashiramasnduaghter",
            "author": "f36goose",
            "id": "h4pmqmu",
            "parent_id": "t3_ohbfro",
            "score": 1,
            "created_utc": 1625931978.0,
            "replies": []
        },
        {
            "body": "One of those sharks the Naruto manga/anime jumped.",
            "author": "DisneyPrincessDVorah",
            "id": "h4ptuzd",
            "parent_id": "t3_ohbfro",
            "score": 1,
            "created_utc": 1625935256.0,
            "replies": []
        },
        {
            "body": "He was kia.",
            "author": "FatCatTitties",
            "id": "h4p5kax",
            "parent_id": "t1_h4oldzf",
            "score": 24,
            "created_utc": 1625922921.0,
            "replies": []
        },
        {
            "body": "i think it’s assumed that his godlike regeneration shortened his lifespan, i could remember wrong tho",
            "author": "BudTrip",
            "id": "h4ow9qc",
            "parent_id": "t1_h4oldzf",
            "score": 39,
            "created_utc": 1625916094.0,
            "replies": [
                {
                    "body": "No, your right. Tsunade's healing is basically the same as Hashirama's...which makes sense. And her technique considerably shortens her lifespan, which is why it's a good thing that she can't use it all the time. I mean, she's only in her early 50s by the start of the show, but she looks much older when her henge falls.\n\nSo it would stand to reason that Hashirama, who couldn't turn his technique off, and was using it repeatedly, would live a considerably shorter lifespan. From what I understand, I don't even think the guy cleared 40.",
                    "author": null,
                    "id": "h4phgrh",
                    "parent_id": "t1_h4ow9qc",
                    "score": 22,
                    "created_utc": 1625929433.0,
                    "replies": []
                },
                {
                    "body": "I kind of just assumed he lived a long life and died of old age tbh. He at least lived long enough for Tsunade to remember him well, but he must have stepped down from hokage pretty early bc Tobirama was only (assumed) a few years younger than him.",
                    "author": "sheogoraths-bitch",
                    "id": "h4p47fa",
                    "parent_id": "t1_h4ow9qc",
                    "score": 32,
                    "created_utc": 1625922045.0,
                    "replies": [
                        {
                            "body": "Tsunade is over 50 years old, and is the guys direct granddaughter.  She was young, but we actually see how Hashi remembers her; 4 or 5 years old.",
                            "author": null,
                            "id": "h4phmvn",
                            "parent_id": "t1_h4p47fa",
                            "score": 27,
                            "created_utc": 1625929517.0,
                            "replies": [
                                {
                                    "body": "Tsunade being 4-5 and having a gambling problem is fucking hilarious",
                                    "author": "LiveLoveKanye",
                                    "id": "h4t5ck9",
                                    "parent_id": "t1_h4phmvn",
                                    "score": 11,
                                    "created_utc": 1626012469.0,
                                    "replies": [
                                        {
                                            "body": "Isn't it? Tiny Tsuna with a big wad of cash is just so funny.",
                                            "author": null,
                                            "id": "h57tsq7",
                                            "parent_id": "t1_h4t5ck9",
                                            "score": 2,
                                            "created_utc": 1626308213.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "yeah you’re right",
                            "author": "BudTrip",
                            "id": "h4pvjxo",
                            "parent_id": "t1_h4p47fa",
                            "score": 3,
                            "created_utc": 1625936023.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Similar to Tsunade's 100 healings when healing you use up the bodies finite amount of cell division which lowers your overall lifespan, so I assume he didnt do the age regression technique Tsunade does to look younger that makes her seem to rapidly age when her chakra is low but just burned out his cells at about the age we see him revived at",
            "author": "Far-Resident-4913",
            "id": "h4p4z9i",
            "parent_id": "t1_h4oldzf",
            "score": 11,
            "created_utc": 1625922545.0,
            "replies": []
        },
        {
            "body": "madara gave hashirama ninja aids when he bit him",
            "author": "jwaters0122",
            "id": "h4q8dvh",
            "parent_id": "t1_h4oldzf",
            "score": 2,
            "created_utc": 1625942643.0,
            "replies": []
        },
        {
            "body": "he died using wood styles regeneration too much.\n\nIt’s hinted that madara kept kicking hashiramas ass but he would constantly heal the wounds .\n\nEvery single time he heals his lifespan is shortened, He lives in the first world war so you know how things went",
            "author": "verifiedjay",
            "id": "h4pi5hm",
            "parent_id": "t1_h4oldzf",
            "score": -7,
            "created_utc": 1625929775.0,
            "replies": [
                {
                    "body": "It’s never hinted that Madara was getting the better of hashirama.",
                    "author": "HeraldofblueRP",
                    "id": "h4pmlur",
                    "parent_id": "t1_h4pi5hm",
                    "score": 8,
                    "created_utc": 1625931918.0,
                    "replies": [
                        {
                            "body": "yes it is, in some  flash backs, like of their final fight if you look closely you’ll see him damaged  badly at one point then healed up at another\n\nhinting that he was constantly healing through the fight. that’s why it took so long for him to beat an uchiha, a clan without much stamina. Because he wasn’t necessarily beating him.\n\n\n\nWe know his wood style is good for taking out the susannoo and for taking out the 9 tails. Both very large entities \n\nBut every time we saw them right as humans it was hands (or sword and fan)  Madara was most definitely whooping his ass in hand to hand combat. can’t convince me other wise tbh",
                            "author": "verifiedjay",
                            "id": "h4pnd2r",
                            "parent_id": "t1_h4pmlur",
                            "score": -3,
                            "created_utc": 1625932269.0,
                            "replies": [
                                {
                                    "body": "Madara has lost every major fight with hashi except post reanimated",
                                    "author": null,
                                    "id": "h4qgdmo",
                                    "parent_id": "t1_h4pnd2r",
                                    "score": 5,
                                    "created_utc": 1625946929.0,
                                    "replies": []
                                },
                                {
                                    "body": "That’s just not true. Hashirama had been countering madara’s every move. Hashirama had been holding back the entire time in the Final Valley battle hoping Madara would cease his attack. Hashirama did make it a battle of stamina. He was also defensive the majority of the time. \n\nThe final valley battle goes like this \n1. Madara attacks Hashirama \n2. Hashirama blocks or massively over powers every attack Madara threw at him\n3. Hashirama tells Madara to stop or else\n4. Repeat a few times. \n\nAt no point in the Final Valley battle did Madara have the upper hand. I could be wrong, but I believe the scene you’re referring to is when they both cross the river to attack each other and hashirama is downed. Turned out that the downed Hashirama was a clone. The real hashirama snuck behind an exhausted Madara who’s Sharigan had just faded away due to exhaustion.",
                                    "author": "HeraldofblueRP",
                                    "id": "h4qcqyp",
                                    "parent_id": "t1_h4pnd2r",
                                    "score": 4,
                                    "created_utc": 1625944942.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Truest thing xD",
            "author": "Common_Look3321",
            "id": "h4orfox",
            "parent_id": "t1_h4o83r6",
            "score": 4,
            "created_utc": 1625911554.0,
            "replies": []
        },
        {
            "body": "Madara only needed senju/uzimake cells. He could have harvested them from pain not entirely unlike orochimaru collected kekkei genkai. He would have had his rinnegan anyway. If rinnegan is more powerful than EMS then he should have beat hashi but hashi is basically \"lol it's just magic guys stop looking for answers lol bro he is wood guy lol just get over it lol. Bro fuck you.\" -kishi",
            "author": "GoodboyGotter",
            "id": "h4ob6o3",
            "parent_id": "t1_h4o83r6",
            "score": 10,
            "created_utc": 1625896502.0,
            "replies": [
                {
                    "body": "He didn't need senju/uzumaki cells, he needed Ashura's chakra which came from Hashirama. You need both Indra's and Ashura's chakra to make the rinnegan.",
                    "author": "imjarrod12",
                    "id": "h4obomf",
                    "parent_id": "t1_h4ob6o3",
                    "score": 29,
                    "created_utc": 1625896899.0,
                    "replies": [
                        {
                            "body": "you speaketh the truth",
                            "author": null,
                            "id": "h4phqyf",
                            "parent_id": "t1_h4obomf",
                            "score": 2,
                            "created_utc": 1625929574.0,
                            "replies": []
                        },
                        {
                            "body": "Yep and each incarnation had it including pain and naruto. :)",
                            "author": "GoodboyGotter",
                            "id": "h4oc5bj",
                            "parent_id": "t1_h4obomf",
                            "score": -17,
                            "created_utc": 1625897263.0,
                            "replies": [
                                {
                                    "body": "Pain wasn't a reincarnation, he was just an Uzumaki. The only known reincarnations of Indra and Ashura are Madara/Sasuke and Hashirama/Naruto.",
                                    "author": "imjarrod12",
                                    "id": "h4oc8oz",
                                    "parent_id": "t1_h4oc5bj",
                                    "score": 25,
                                    "created_utc": 1625897341.0,
                                    "replies": [
                                        {
                                            "body": "So you admit it. He didn't need hashi trash cells",
                                            "author": "GoodboyGotter",
                                            "id": "h4ocb35",
                                            "parent_id": "t1_h4oc8oz",
                                            "score": -23,
                                            "created_utc": 1625897394.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think you understand at all.",
                                                    "author": "imjarrod12",
                                                    "id": "h4ocdjz",
                                                    "parent_id": "t1_h4ocb35",
                                                    "score": 22,
                                                    "created_utc": 1625897449.0,
                                                    "replies": [
                                                        {
                                                            "body": "You dont either....",
                                                            "author": "GoodboyGotter",
                                                            "id": "h4ocrkg",
                                                            "parent_id": "t1_h4ocdjz",
                                                            "score": -21,
                                                            "created_utc": 1625897769.0,
                                                            "replies": [
                                                                {
                                                                    "body": "He does, you don't. Go back and watch the clip.",
                                                                    "author": "xNuxIsGod",
                                                                    "id": "h4omxtm",
                                                                    "parent_id": "t1_h4ocrkg",
                                                                    "score": 12,
                                                                    "created_utc": 1625907092.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "bruh sorry but you're not right",
                                                                    "author": null,
                                                                    "id": "h4phsd1",
                                                                    "parent_id": "t1_h4ocrkg",
                                                                    "score": 4,
                                                                    "created_utc": 1625929593.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "They took the bait",
                                                                            "author": "GoodboyGotter",
                                                                            "id": "h4pinm7",
                                                                            "parent_id": "t1_h4phsd1",
                                                                            "score": -4,
                                                                            "created_utc": 1625930022.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Ah",
                                                                                    "author": null,
                                                                                    "id": "h4pq3hn",
                                                                                    "parent_id": "t1_h4pinm7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1625933544.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
                                                    "author": "noneeduselesss",
                                                    "id": "h4ono6f",
                                                    "parent_id": "t1_h4ocb35",
                                                    "score": 6,
                                                    "created_utc": 1625907821.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
                                                    "author": null,
                                                    "id": "h4ougis",
                                                    "parent_id": "t1_h4ocb35",
                                                    "score": 2,
                                                    "created_utc": 1625914460.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Nagato was absolutely not a transmigration. He was a random uzumaki that was given Madaras rinnegan.",
                                    "author": "CaptnUchiha",
                                    "id": "h4om6xk",
                                    "parent_id": "t1_h4oc5bj",
                                    "score": 10,
                                    "created_utc": 1625906337.0,
                                    "replies": [
                                        {
                                            "body": "> transmigration \n\nLmao",
                                            "author": "GoodboyGotter",
                                            "id": "h4p9qq2",
                                            "parent_id": "t1_h4om6xk",
                                            "score": 0,
                                            "created_utc": 1625925400.0,
                                            "replies": [
                                                {
                                                    "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
                                                    "author": "CaptnUchiha",
                                                    "id": "h4pnltu",
                                                    "parent_id": "t1_h4p9qq2",
                                                    "score": 3,
                                                    "created_utc": 1625932381.0,
                                                    "replies": [
                                                        {
                                                            "body": "I only use words that I understand 😎😎😎",
                                                            "author": "GoodboyGotter",
                                                            "id": "h4po6mb",
                                                            "parent_id": "t1_h4pnltu",
                                                            "score": 0,
                                                            "created_utc": 1625932654.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Aiyo where did pain come from it’s sasuke",
                                    "author": "noneeduselesss",
                                    "id": "h4onm9v",
                                    "parent_id": "t1_h4oc5bj",
                                    "score": 3,
                                    "created_utc": 1625907771.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What? I just watched Kabutos flashback the other day. I actually loved it. It had great tones and ideas behind it",
            "author": "TheFabledFamilyGuy",
            "id": "h4q728n",
            "parent_id": "t1_h4o83r6",
            "score": 2,
            "created_utc": 1625941954.0,
            "replies": []
        },
        {
            "body": "#B)",
            "author": "Common_Look3321",
            "id": "h4og39x",
            "parent_id": "t1_h4o827v",
            "score": 4,
            "created_utc": 1625900611.0,
            "replies": []
        },
        {
            "body": "That was literally one of the main points in the show lol. It's supposed to be history repeating itself in each incarnation with ashura representing the kind-hearted path of light, and Indra representing the power-driven path of darkness. Naruto and Sasuke finally broke that chain.",
            "author": "BuccellatiExplainsIt",
            "id": "h4oybai",
            "parent_id": "t1_h4ora41",
            "score": 17,
            "created_utc": 1625917809.0,
            "replies": []
        },
        {
            "body": "# hm.... Interesting",
            "author": "Common_Look3321",
            "id": "h4ore7w",
            "parent_id": "t1_h4ora41",
            "score": 8,
            "created_utc": 1625911512.0,
            "replies": []
        },
        {
            "body": "Indra's are too jealous tbh though .",
            "author": "Tarkik_Vatsa",
            "id": "h4otebo",
            "parent_id": "t1_h4ora41",
            "score": 9,
            "created_utc": 1625913464.0,
            "replies": [
                {
                    "body": "But they look cooler and don’t have as much talknojutsu",
                    "author": "mo-did",
                    "id": "h4p5y8f",
                    "parent_id": "t1_h4otebo",
                    "score": 0,
                    "created_utc": 1625923161.0,
                    "replies": [
                        {
                            "body": "Indra definitely looked cooler than Ashura . But Hashirama and Naruto look as cool as Sasuke and Madara if not more . Naruto definitely looked cooler than Sasuke in Shippuden .",
                            "author": "Tarkik_Vatsa",
                            "id": "h4pekgk",
                            "parent_id": "t1_h4p5y8f",
                            "score": 7,
                            "created_utc": 1625927965.0,
                            "replies": [
                                {
                                    "body": "Naruto isn’t as cool looking to me as Sasuke",
                                    "author": "mo-did",
                                    "id": "h4q1ky9",
                                    "parent_id": "t1_h4pekgk",
                                    "score": 1,
                                    "created_utc": 1625939102.0,
                                    "replies": [
                                        {
                                            "body": "All right . I respect your opinion . But there are many people like me who find Naruto cooler than Sasuke so it depends on person to person .",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h4q49af",
                                            "parent_id": "t1_h4q1ky9",
                                            "score": 5,
                                            "created_utc": 1625940483.0,
                                            "replies": [
                                                {
                                                    "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
                                                    "author": "mo-did",
                                                    "id": "h4q4fa1",
                                                    "parent_id": "t1_h4q49af",
                                                    "score": 1,
                                                    "created_utc": 1625940569.0,
                                                    "replies": [
                                                        {
                                                            "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                                                            "author": "Tarkik_Vatsa",
                                                            "id": "h4q81vw",
                                                            "parent_id": "t1_h4q4fa1",
                                                            "score": 3,
                                                            "created_utc": 1625942470.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                                                                    "author": "mo-did",
                                                                    "id": "h4q8c46",
                                                                    "parent_id": "t1_h4q81vw",
                                                                    "score": 2,
                                                                    "created_utc": 1625942618.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "They're all each other's copy-paste and have annoying hax instead.",
                            "author": "TyrionGoldenLion",
                            "id": "h4p82hw",
                            "parent_id": "t1_h4p5y8f",
                            "score": 3,
                            "created_utc": 1625924444.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You gotta be super shitty for your own clan to turn their backs on you.",
            "author": "TyrionGoldenLion",
            "id": "h4p84bt",
            "parent_id": "t1_h4ora41",
            "score": 1,
            "created_utc": 1625924475.0,
            "replies": []
        },
        {
            "body": "Weak senju makes me 🤮🤮",
            "author": "Ricky_Thein",
            "id": "h4ogtti",
            "parent_id": "t1_h4ob2tt",
            "score": 10,
            "created_utc": 1625901269.0,
            "replies": [
                {
                    "body": "###Weakness Disgusts Me",
                    "author": "OPgang",
                    "id": "h4osqqv",
                    "parent_id": "t1_h4ogtti",
                    "score": 5,
                    "created_utc": 1625912832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "#xD",
            "author": "Common_Look3321",
            "id": "h4p36pn",
            "parent_id": "t1_h4ob2tt",
            "score": 1,
            "created_utc": 1625921376.0,
            "replies": []
        },
        {
            "body": "Can anyone pray pardon me the hashirama cells to me im did confuse\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
            "author": "Shakespeare-Bot",
            "id": "h4payqf",
            "parent_id": "t1_h4paxb6",
            "score": 1,
            "created_utc": 1625926084.0,
            "replies": []
        },
        {
            "body": "Hashirama cells are ninja steroids.",
            "author": "Rohan-kun",
            "id": "h4prqg2",
            "parent_id": "t1_h4pay45",
            "score": 3,
            "created_utc": 1625934289.0,
            "replies": []
        },
        {
            "body": "They're like, magical cancer cells that help their host",
            "author": "that_guy_who_existed",
            "id": "h51uuyi",
            "parent_id": "t1_h4pay45",
            "score": 1,
            "created_utc": 1626193069.0,
            "replies": []
        },
        {
            "body": "\"Points finger\"\nI'll deal with you later",
            "author": "Far-Resident-4913",
            "id": "h4p5fer",
            "parent_id": "t1_h4os0e8",
            "score": 2,
            "created_utc": 1625922830.0,
            "replies": []
        },
        {
            "body": "Did give me my favorite Orochimaru fight though so I give it a pass so far for coming back in Boruto",
            "author": "Far-Resident-4913",
            "id": "h4p56yc",
            "parent_id": "t1_h4p21g1",
            "score": 3,
            "created_utc": 1625922679.0,
            "replies": [
                {
                    "body": "Lol orochimaru erased that woman from her existence in a second",
                    "author": "TheGamingSage",
                    "id": "h4qbrly",
                    "parent_id": "t1_h4p56yc",
                    "score": 2,
                    "created_utc": 1625944423.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It might be used before too IDK about it but, I thought of it myself so pls don't send any hate to me",
            "author": "Common_Look3321",
            "id": "h4oto6v",
            "parent_id": "t1_h4ot9eb",
            "score": 2,
            "created_utc": 1625913729.0,
            "replies": []
        },
        {
            "body": "No, your right. Tsunade's healing is basically the same as Hashirama's...which makes sense. And her technique considerably shortens her lifespan, which is why it's a good thing that she can't use it all the time. I mean, she's only in her early 50s by the start of the show, but she looks much older when her henge falls.\n\nSo it would stand to reason that Hashirama, who couldn't turn his technique off, and was using it repeatedly, would live a considerably shorter lifespan. From what I understand, I don't even think the guy cleared 40.",
            "author": null,
            "id": "h4phgrh",
            "parent_id": "t1_h4ow9qc",
            "score": 22,
            "created_utc": 1625929433.0,
            "replies": []
        },
        {
            "body": "I kind of just assumed he lived a long life and died of old age tbh. He at least lived long enough for Tsunade to remember him well, but he must have stepped down from hokage pretty early bc Tobirama was only (assumed) a few years younger than him.",
            "author": "sheogoraths-bitch",
            "id": "h4p47fa",
            "parent_id": "t1_h4ow9qc",
            "score": 32,
            "created_utc": 1625922045.0,
            "replies": [
                {
                    "body": "Tsunade is over 50 years old, and is the guys direct granddaughter.  She was young, but we actually see how Hashi remembers her; 4 or 5 years old.",
                    "author": null,
                    "id": "h4phmvn",
                    "parent_id": "t1_h4p47fa",
                    "score": 27,
                    "created_utc": 1625929517.0,
                    "replies": [
                        {
                            "body": "Tsunade being 4-5 and having a gambling problem is fucking hilarious",
                            "author": "LiveLoveKanye",
                            "id": "h4t5ck9",
                            "parent_id": "t1_h4phmvn",
                            "score": 11,
                            "created_utc": 1626012469.0,
                            "replies": [
                                {
                                    "body": "Isn't it? Tiny Tsuna with a big wad of cash is just so funny.",
                                    "author": null,
                                    "id": "h57tsq7",
                                    "parent_id": "t1_h4t5ck9",
                                    "score": 2,
                                    "created_utc": 1626308213.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "yeah you’re right",
                    "author": "BudTrip",
                    "id": "h4pvjxo",
                    "parent_id": "t1_h4p47fa",
                    "score": 3,
                    "created_utc": 1625936023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s never hinted that Madara was getting the better of hashirama.",
            "author": "HeraldofblueRP",
            "id": "h4pmlur",
            "parent_id": "t1_h4pi5hm",
            "score": 8,
            "created_utc": 1625931918.0,
            "replies": [
                {
                    "body": "yes it is, in some  flash backs, like of their final fight if you look closely you’ll see him damaged  badly at one point then healed up at another\n\nhinting that he was constantly healing through the fight. that’s why it took so long for him to beat an uchiha, a clan without much stamina. Because he wasn’t necessarily beating him.\n\n\n\nWe know his wood style is good for taking out the susannoo and for taking out the 9 tails. Both very large entities \n\nBut every time we saw them right as humans it was hands (or sword and fan)  Madara was most definitely whooping his ass in hand to hand combat. can’t convince me other wise tbh",
                    "author": "verifiedjay",
                    "id": "h4pnd2r",
                    "parent_id": "t1_h4pmlur",
                    "score": -3,
                    "created_utc": 1625932269.0,
                    "replies": [
                        {
                            "body": "Madara has lost every major fight with hashi except post reanimated",
                            "author": null,
                            "id": "h4qgdmo",
                            "parent_id": "t1_h4pnd2r",
                            "score": 5,
                            "created_utc": 1625946929.0,
                            "replies": []
                        },
                        {
                            "body": "That’s just not true. Hashirama had been countering madara’s every move. Hashirama had been holding back the entire time in the Final Valley battle hoping Madara would cease his attack. Hashirama did make it a battle of stamina. He was also defensive the majority of the time. \n\nThe final valley battle goes like this \n1. Madara attacks Hashirama \n2. Hashirama blocks or massively over powers every attack Madara threw at him\n3. Hashirama tells Madara to stop or else\n4. Repeat a few times. \n\nAt no point in the Final Valley battle did Madara have the upper hand. I could be wrong, but I believe the scene you’re referring to is when they both cross the river to attack each other and hashirama is downed. Turned out that the downed Hashirama was a clone. The real hashirama snuck behind an exhausted Madara who’s Sharigan had just faded away due to exhaustion.",
                            "author": "HeraldofblueRP",
                            "id": "h4qcqyp",
                            "parent_id": "t1_h4pnd2r",
                            "score": 4,
                            "created_utc": 1625944942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He didn't need senju/uzumaki cells, he needed Ashura's chakra which came from Hashirama. You need both Indra's and Ashura's chakra to make the rinnegan.",
            "author": "imjarrod12",
            "id": "h4obomf",
            "parent_id": "t1_h4ob6o3",
            "score": 29,
            "created_utc": 1625896899.0,
            "replies": [
                {
                    "body": "you speaketh the truth",
                    "author": null,
                    "id": "h4phqyf",
                    "parent_id": "t1_h4obomf",
                    "score": 2,
                    "created_utc": 1625929574.0,
                    "replies": []
                },
                {
                    "body": "Yep and each incarnation had it including pain and naruto. :)",
                    "author": "GoodboyGotter",
                    "id": "h4oc5bj",
                    "parent_id": "t1_h4obomf",
                    "score": -17,
                    "created_utc": 1625897263.0,
                    "replies": [
                        {
                            "body": "Pain wasn't a reincarnation, he was just an Uzumaki. The only known reincarnations of Indra and Ashura are Madara/Sasuke and Hashirama/Naruto.",
                            "author": "imjarrod12",
                            "id": "h4oc8oz",
                            "parent_id": "t1_h4oc5bj",
                            "score": 25,
                            "created_utc": 1625897341.0,
                            "replies": [
                                {
                                    "body": "So you admit it. He didn't need hashi trash cells",
                                    "author": "GoodboyGotter",
                                    "id": "h4ocb35",
                                    "parent_id": "t1_h4oc8oz",
                                    "score": -23,
                                    "created_utc": 1625897394.0,
                                    "replies": [
                                        {
                                            "body": "I don't think you understand at all.",
                                            "author": "imjarrod12",
                                            "id": "h4ocdjz",
                                            "parent_id": "t1_h4ocb35",
                                            "score": 22,
                                            "created_utc": 1625897449.0,
                                            "replies": [
                                                {
                                                    "body": "You dont either....",
                                                    "author": "GoodboyGotter",
                                                    "id": "h4ocrkg",
                                                    "parent_id": "t1_h4ocdjz",
                                                    "score": -21,
                                                    "created_utc": 1625897769.0,
                                                    "replies": [
                                                        {
                                                            "body": "He does, you don't. Go back and watch the clip.",
                                                            "author": "xNuxIsGod",
                                                            "id": "h4omxtm",
                                                            "parent_id": "t1_h4ocrkg",
                                                            "score": 12,
                                                            "created_utc": 1625907092.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "bruh sorry but you're not right",
                                                            "author": null,
                                                            "id": "h4phsd1",
                                                            "parent_id": "t1_h4ocrkg",
                                                            "score": 4,
                                                            "created_utc": 1625929593.0,
                                                            "replies": [
                                                                {
                                                                    "body": "They took the bait",
                                                                    "author": "GoodboyGotter",
                                                                    "id": "h4pinm7",
                                                                    "parent_id": "t1_h4phsd1",
                                                                    "score": -4,
                                                                    "created_utc": 1625930022.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ah",
                                                                            "author": null,
                                                                            "id": "h4pq3hn",
                                                                            "parent_id": "t1_h4pinm7",
                                                                            "score": 1,
                                                                            "created_utc": 1625933544.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
                                            "author": "noneeduselesss",
                                            "id": "h4ono6f",
                                            "parent_id": "t1_h4ocb35",
                                            "score": 6,
                                            "created_utc": 1625907821.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
                                            "author": null,
                                            "id": "h4ougis",
                                            "parent_id": "t1_h4ocb35",
                                            "score": 2,
                                            "created_utc": 1625914460.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Nagato was absolutely not a transmigration. He was a random uzumaki that was given Madaras rinnegan.",
                            "author": "CaptnUchiha",
                            "id": "h4om6xk",
                            "parent_id": "t1_h4oc5bj",
                            "score": 10,
                            "created_utc": 1625906337.0,
                            "replies": [
                                {
                                    "body": "> transmigration \n\nLmao",
                                    "author": "GoodboyGotter",
                                    "id": "h4p9qq2",
                                    "parent_id": "t1_h4om6xk",
                                    "score": 0,
                                    "created_utc": 1625925400.0,
                                    "replies": [
                                        {
                                            "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
                                            "author": "CaptnUchiha",
                                            "id": "h4pnltu",
                                            "parent_id": "t1_h4p9qq2",
                                            "score": 3,
                                            "created_utc": 1625932381.0,
                                            "replies": [
                                                {
                                                    "body": "I only use words that I understand 😎😎😎",
                                                    "author": "GoodboyGotter",
                                                    "id": "h4po6mb",
                                                    "parent_id": "t1_h4pnltu",
                                                    "score": 0,
                                                    "created_utc": 1625932654.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Aiyo where did pain come from it’s sasuke",
                            "author": "noneeduselesss",
                            "id": "h4onm9v",
                            "parent_id": "t1_h4oc5bj",
                            "score": 3,
                            "created_utc": 1625907771.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But they look cooler and don’t have as much talknojutsu",
            "author": "mo-did",
            "id": "h4p5y8f",
            "parent_id": "t1_h4otebo",
            "score": 0,
            "created_utc": 1625923161.0,
            "replies": [
                {
                    "body": "Indra definitely looked cooler than Ashura . But Hashirama and Naruto look as cool as Sasuke and Madara if not more . Naruto definitely looked cooler than Sasuke in Shippuden .",
                    "author": "Tarkik_Vatsa",
                    "id": "h4pekgk",
                    "parent_id": "t1_h4p5y8f",
                    "score": 7,
                    "created_utc": 1625927965.0,
                    "replies": [
                        {
                            "body": "Naruto isn’t as cool looking to me as Sasuke",
                            "author": "mo-did",
                            "id": "h4q1ky9",
                            "parent_id": "t1_h4pekgk",
                            "score": 1,
                            "created_utc": 1625939102.0,
                            "replies": [
                                {
                                    "body": "All right . I respect your opinion . But there are many people like me who find Naruto cooler than Sasuke so it depends on person to person .",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h4q49af",
                                    "parent_id": "t1_h4q1ky9",
                                    "score": 5,
                                    "created_utc": 1625940483.0,
                                    "replies": [
                                        {
                                            "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
                                            "author": "mo-did",
                                            "id": "h4q4fa1",
                                            "parent_id": "t1_h4q49af",
                                            "score": 1,
                                            "created_utc": 1625940569.0,
                                            "replies": [
                                                {
                                                    "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                                                    "author": "Tarkik_Vatsa",
                                                    "id": "h4q81vw",
                                                    "parent_id": "t1_h4q4fa1",
                                                    "score": 3,
                                                    "created_utc": 1625942470.0,
                                                    "replies": [
                                                        {
                                                            "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                                                            "author": "mo-did",
                                                            "id": "h4q8c46",
                                                            "parent_id": "t1_h4q81vw",
                                                            "score": 2,
                                                            "created_utc": 1625942618.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "They're all each other's copy-paste and have annoying hax instead.",
                    "author": "TyrionGoldenLion",
                    "id": "h4p82hw",
                    "parent_id": "t1_h4p5y8f",
                    "score": 3,
                    "created_utc": 1625924444.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "###Weakness Disgusts Me",
            "author": "OPgang",
            "id": "h4osqqv",
            "parent_id": "t1_h4ogtti",
            "score": 5,
            "created_utc": 1625912832.0,
            "replies": []
        },
        {
            "body": "Lol orochimaru erased that woman from her existence in a second",
            "author": "TheGamingSage",
            "id": "h4qbrly",
            "parent_id": "t1_h4p56yc",
            "score": 2,
            "created_utc": 1625944423.0,
            "replies": []
        },
        {
            "body": "Tsunade is over 50 years old, and is the guys direct granddaughter.  She was young, but we actually see how Hashi remembers her; 4 or 5 years old.",
            "author": null,
            "id": "h4phmvn",
            "parent_id": "t1_h4p47fa",
            "score": 27,
            "created_utc": 1625929517.0,
            "replies": [
                {
                    "body": "Tsunade being 4-5 and having a gambling problem is fucking hilarious",
                    "author": "LiveLoveKanye",
                    "id": "h4t5ck9",
                    "parent_id": "t1_h4phmvn",
                    "score": 11,
                    "created_utc": 1626012469.0,
                    "replies": [
                        {
                            "body": "Isn't it? Tiny Tsuna with a big wad of cash is just so funny.",
                            "author": null,
                            "id": "h57tsq7",
                            "parent_id": "t1_h4t5ck9",
                            "score": 2,
                            "created_utc": 1626308213.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah you’re right",
            "author": "BudTrip",
            "id": "h4pvjxo",
            "parent_id": "t1_h4p47fa",
            "score": 3,
            "created_utc": 1625936023.0,
            "replies": []
        },
        {
            "body": "yes it is, in some  flash backs, like of their final fight if you look closely you’ll see him damaged  badly at one point then healed up at another\n\nhinting that he was constantly healing through the fight. that’s why it took so long for him to beat an uchiha, a clan without much stamina. Because he wasn’t necessarily beating him.\n\n\n\nWe know his wood style is good for taking out the susannoo and for taking out the 9 tails. Both very large entities \n\nBut every time we saw them right as humans it was hands (or sword and fan)  Madara was most definitely whooping his ass in hand to hand combat. can’t convince me other wise tbh",
            "author": "verifiedjay",
            "id": "h4pnd2r",
            "parent_id": "t1_h4pmlur",
            "score": -3,
            "created_utc": 1625932269.0,
            "replies": [
                {
                    "body": "Madara has lost every major fight with hashi except post reanimated",
                    "author": null,
                    "id": "h4qgdmo",
                    "parent_id": "t1_h4pnd2r",
                    "score": 5,
                    "created_utc": 1625946929.0,
                    "replies": []
                },
                {
                    "body": "That’s just not true. Hashirama had been countering madara’s every move. Hashirama had been holding back the entire time in the Final Valley battle hoping Madara would cease his attack. Hashirama did make it a battle of stamina. He was also defensive the majority of the time. \n\nThe final valley battle goes like this \n1. Madara attacks Hashirama \n2. Hashirama blocks or massively over powers every attack Madara threw at him\n3. Hashirama tells Madara to stop or else\n4. Repeat a few times. \n\nAt no point in the Final Valley battle did Madara have the upper hand. I could be wrong, but I believe the scene you’re referring to is when they both cross the river to attack each other and hashirama is downed. Turned out that the downed Hashirama was a clone. The real hashirama snuck behind an exhausted Madara who’s Sharigan had just faded away due to exhaustion.",
                    "author": "HeraldofblueRP",
                    "id": "h4qcqyp",
                    "parent_id": "t1_h4pnd2r",
                    "score": 4,
                    "created_utc": 1625944942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you speaketh the truth",
            "author": null,
            "id": "h4phqyf",
            "parent_id": "t1_h4obomf",
            "score": 2,
            "created_utc": 1625929574.0,
            "replies": []
        },
        {
            "body": "Yep and each incarnation had it including pain and naruto. :)",
            "author": "GoodboyGotter",
            "id": "h4oc5bj",
            "parent_id": "t1_h4obomf",
            "score": -17,
            "created_utc": 1625897263.0,
            "replies": [
                {
                    "body": "Pain wasn't a reincarnation, he was just an Uzumaki. The only known reincarnations of Indra and Ashura are Madara/Sasuke and Hashirama/Naruto.",
                    "author": "imjarrod12",
                    "id": "h4oc8oz",
                    "parent_id": "t1_h4oc5bj",
                    "score": 25,
                    "created_utc": 1625897341.0,
                    "replies": [
                        {
                            "body": "So you admit it. He didn't need hashi trash cells",
                            "author": "GoodboyGotter",
                            "id": "h4ocb35",
                            "parent_id": "t1_h4oc8oz",
                            "score": -23,
                            "created_utc": 1625897394.0,
                            "replies": [
                                {
                                    "body": "I don't think you understand at all.",
                                    "author": "imjarrod12",
                                    "id": "h4ocdjz",
                                    "parent_id": "t1_h4ocb35",
                                    "score": 22,
                                    "created_utc": 1625897449.0,
                                    "replies": [
                                        {
                                            "body": "You dont either....",
                                            "author": "GoodboyGotter",
                                            "id": "h4ocrkg",
                                            "parent_id": "t1_h4ocdjz",
                                            "score": -21,
                                            "created_utc": 1625897769.0,
                                            "replies": [
                                                {
                                                    "body": "He does, you don't. Go back and watch the clip.",
                                                    "author": "xNuxIsGod",
                                                    "id": "h4omxtm",
                                                    "parent_id": "t1_h4ocrkg",
                                                    "score": 12,
                                                    "created_utc": 1625907092.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "bruh sorry but you're not right",
                                                    "author": null,
                                                    "id": "h4phsd1",
                                                    "parent_id": "t1_h4ocrkg",
                                                    "score": 4,
                                                    "created_utc": 1625929593.0,
                                                    "replies": [
                                                        {
                                                            "body": "They took the bait",
                                                            "author": "GoodboyGotter",
                                                            "id": "h4pinm7",
                                                            "parent_id": "t1_h4phsd1",
                                                            "score": -4,
                                                            "created_utc": 1625930022.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ah",
                                                                    "author": null,
                                                                    "id": "h4pq3hn",
                                                                    "parent_id": "t1_h4pinm7",
                                                                    "score": 1,
                                                                    "created_utc": 1625933544.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
                                    "author": "noneeduselesss",
                                    "id": "h4ono6f",
                                    "parent_id": "t1_h4ocb35",
                                    "score": 6,
                                    "created_utc": 1625907821.0,
                                    "replies": []
                                },
                                {
                                    "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
                                    "author": null,
                                    "id": "h4ougis",
                                    "parent_id": "t1_h4ocb35",
                                    "score": 2,
                                    "created_utc": 1625914460.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nagato was absolutely not a transmigration. He was a random uzumaki that was given Madaras rinnegan.",
                    "author": "CaptnUchiha",
                    "id": "h4om6xk",
                    "parent_id": "t1_h4oc5bj",
                    "score": 10,
                    "created_utc": 1625906337.0,
                    "replies": [
                        {
                            "body": "> transmigration \n\nLmao",
                            "author": "GoodboyGotter",
                            "id": "h4p9qq2",
                            "parent_id": "t1_h4om6xk",
                            "score": 0,
                            "created_utc": 1625925400.0,
                            "replies": [
                                {
                                    "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
                                    "author": "CaptnUchiha",
                                    "id": "h4pnltu",
                                    "parent_id": "t1_h4p9qq2",
                                    "score": 3,
                                    "created_utc": 1625932381.0,
                                    "replies": [
                                        {
                                            "body": "I only use words that I understand 😎😎😎",
                                            "author": "GoodboyGotter",
                                            "id": "h4po6mb",
                                            "parent_id": "t1_h4pnltu",
                                            "score": 0,
                                            "created_utc": 1625932654.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Aiyo where did pain come from it’s sasuke",
                    "author": "noneeduselesss",
                    "id": "h4onm9v",
                    "parent_id": "t1_h4oc5bj",
                    "score": 3,
                    "created_utc": 1625907771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Indra definitely looked cooler than Ashura . But Hashirama and Naruto look as cool as Sasuke and Madara if not more . Naruto definitely looked cooler than Sasuke in Shippuden .",
            "author": "Tarkik_Vatsa",
            "id": "h4pekgk",
            "parent_id": "t1_h4p5y8f",
            "score": 7,
            "created_utc": 1625927965.0,
            "replies": [
                {
                    "body": "Naruto isn’t as cool looking to me as Sasuke",
                    "author": "mo-did",
                    "id": "h4q1ky9",
                    "parent_id": "t1_h4pekgk",
                    "score": 1,
                    "created_utc": 1625939102.0,
                    "replies": [
                        {
                            "body": "All right . I respect your opinion . But there are many people like me who find Naruto cooler than Sasuke so it depends on person to person .",
                            "author": "Tarkik_Vatsa",
                            "id": "h4q49af",
                            "parent_id": "t1_h4q1ky9",
                            "score": 5,
                            "created_utc": 1625940483.0,
                            "replies": [
                                {
                                    "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
                                    "author": "mo-did",
                                    "id": "h4q4fa1",
                                    "parent_id": "t1_h4q49af",
                                    "score": 1,
                                    "created_utc": 1625940569.0,
                                    "replies": [
                                        {
                                            "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                                            "author": "Tarkik_Vatsa",
                                            "id": "h4q81vw",
                                            "parent_id": "t1_h4q4fa1",
                                            "score": 3,
                                            "created_utc": 1625942470.0,
                                            "replies": [
                                                {
                                                    "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                                                    "author": "mo-did",
                                                    "id": "h4q8c46",
                                                    "parent_id": "t1_h4q81vw",
                                                    "score": 2,
                                                    "created_utc": 1625942618.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They're all each other's copy-paste and have annoying hax instead.",
            "author": "TyrionGoldenLion",
            "id": "h4p82hw",
            "parent_id": "t1_h4p5y8f",
            "score": 3,
            "created_utc": 1625924444.0,
            "replies": []
        },
        {
            "body": "Tsunade being 4-5 and having a gambling problem is fucking hilarious",
            "author": "LiveLoveKanye",
            "id": "h4t5ck9",
            "parent_id": "t1_h4phmvn",
            "score": 11,
            "created_utc": 1626012469.0,
            "replies": [
                {
                    "body": "Isn't it? Tiny Tsuna with a big wad of cash is just so funny.",
                    "author": null,
                    "id": "h57tsq7",
                    "parent_id": "t1_h4t5ck9",
                    "score": 2,
                    "created_utc": 1626308213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Madara has lost every major fight with hashi except post reanimated",
            "author": null,
            "id": "h4qgdmo",
            "parent_id": "t1_h4pnd2r",
            "score": 5,
            "created_utc": 1625946929.0,
            "replies": []
        },
        {
            "body": "That’s just not true. Hashirama had been countering madara’s every move. Hashirama had been holding back the entire time in the Final Valley battle hoping Madara would cease his attack. Hashirama did make it a battle of stamina. He was also defensive the majority of the time. \n\nThe final valley battle goes like this \n1. Madara attacks Hashirama \n2. Hashirama blocks or massively over powers every attack Madara threw at him\n3. Hashirama tells Madara to stop or else\n4. Repeat a few times. \n\nAt no point in the Final Valley battle did Madara have the upper hand. I could be wrong, but I believe the scene you’re referring to is when they both cross the river to attack each other and hashirama is downed. Turned out that the downed Hashirama was a clone. The real hashirama snuck behind an exhausted Madara who’s Sharigan had just faded away due to exhaustion.",
            "author": "HeraldofblueRP",
            "id": "h4qcqyp",
            "parent_id": "t1_h4pnd2r",
            "score": 4,
            "created_utc": 1625944942.0,
            "replies": []
        },
        {
            "body": "Pain wasn't a reincarnation, he was just an Uzumaki. The only known reincarnations of Indra and Ashura are Madara/Sasuke and Hashirama/Naruto.",
            "author": "imjarrod12",
            "id": "h4oc8oz",
            "parent_id": "t1_h4oc5bj",
            "score": 25,
            "created_utc": 1625897341.0,
            "replies": [
                {
                    "body": "So you admit it. He didn't need hashi trash cells",
                    "author": "GoodboyGotter",
                    "id": "h4ocb35",
                    "parent_id": "t1_h4oc8oz",
                    "score": -23,
                    "created_utc": 1625897394.0,
                    "replies": [
                        {
                            "body": "I don't think you understand at all.",
                            "author": "imjarrod12",
                            "id": "h4ocdjz",
                            "parent_id": "t1_h4ocb35",
                            "score": 22,
                            "created_utc": 1625897449.0,
                            "replies": [
                                {
                                    "body": "You dont either....",
                                    "author": "GoodboyGotter",
                                    "id": "h4ocrkg",
                                    "parent_id": "t1_h4ocdjz",
                                    "score": -21,
                                    "created_utc": 1625897769.0,
                                    "replies": [
                                        {
                                            "body": "He does, you don't. Go back and watch the clip.",
                                            "author": "xNuxIsGod",
                                            "id": "h4omxtm",
                                            "parent_id": "t1_h4ocrkg",
                                            "score": 12,
                                            "created_utc": 1625907092.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "bruh sorry but you're not right",
                                            "author": null,
                                            "id": "h4phsd1",
                                            "parent_id": "t1_h4ocrkg",
                                            "score": 4,
                                            "created_utc": 1625929593.0,
                                            "replies": [
                                                {
                                                    "body": "They took the bait",
                                                    "author": "GoodboyGotter",
                                                    "id": "h4pinm7",
                                                    "parent_id": "t1_h4phsd1",
                                                    "score": -4,
                                                    "created_utc": 1625930022.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ah",
                                                            "author": null,
                                                            "id": "h4pq3hn",
                                                            "parent_id": "t1_h4pinm7",
                                                            "score": 1,
                                                            "created_utc": 1625933544.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
                            "author": "noneeduselesss",
                            "id": "h4ono6f",
                            "parent_id": "t1_h4ocb35",
                            "score": 6,
                            "created_utc": 1625907821.0,
                            "replies": []
                        },
                        {
                            "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
                            "author": null,
                            "id": "h4ougis",
                            "parent_id": "t1_h4ocb35",
                            "score": 2,
                            "created_utc": 1625914460.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nagato was absolutely not a transmigration. He was a random uzumaki that was given Madaras rinnegan.",
            "author": "CaptnUchiha",
            "id": "h4om6xk",
            "parent_id": "t1_h4oc5bj",
            "score": 10,
            "created_utc": 1625906337.0,
            "replies": [
                {
                    "body": "> transmigration \n\nLmao",
                    "author": "GoodboyGotter",
                    "id": "h4p9qq2",
                    "parent_id": "t1_h4om6xk",
                    "score": 0,
                    "created_utc": 1625925400.0,
                    "replies": [
                        {
                            "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
                            "author": "CaptnUchiha",
                            "id": "h4pnltu",
                            "parent_id": "t1_h4p9qq2",
                            "score": 3,
                            "created_utc": 1625932381.0,
                            "replies": [
                                {
                                    "body": "I only use words that I understand 😎😎😎",
                                    "author": "GoodboyGotter",
                                    "id": "h4po6mb",
                                    "parent_id": "t1_h4pnltu",
                                    "score": 0,
                                    "created_utc": 1625932654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aiyo where did pain come from it’s sasuke",
            "author": "noneeduselesss",
            "id": "h4onm9v",
            "parent_id": "t1_h4oc5bj",
            "score": 3,
            "created_utc": 1625907771.0,
            "replies": []
        },
        {
            "body": "Naruto isn’t as cool looking to me as Sasuke",
            "author": "mo-did",
            "id": "h4q1ky9",
            "parent_id": "t1_h4pekgk",
            "score": 1,
            "created_utc": 1625939102.0,
            "replies": [
                {
                    "body": "All right . I respect your opinion . But there are many people like me who find Naruto cooler than Sasuke so it depends on person to person .",
                    "author": "Tarkik_Vatsa",
                    "id": "h4q49af",
                    "parent_id": "t1_h4q1ky9",
                    "score": 5,
                    "created_utc": 1625940483.0,
                    "replies": [
                        {
                            "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
                            "author": "mo-did",
                            "id": "h4q4fa1",
                            "parent_id": "t1_h4q49af",
                            "score": 1,
                            "created_utc": 1625940569.0,
                            "replies": [
                                {
                                    "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                                    "author": "Tarkik_Vatsa",
                                    "id": "h4q81vw",
                                    "parent_id": "t1_h4q4fa1",
                                    "score": 3,
                                    "created_utc": 1625942470.0,
                                    "replies": [
                                        {
                                            "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                                            "author": "mo-did",
                                            "id": "h4q8c46",
                                            "parent_id": "t1_h4q81vw",
                                            "score": 2,
                                            "created_utc": 1625942618.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Isn't it? Tiny Tsuna with a big wad of cash is just so funny.",
            "author": null,
            "id": "h57tsq7",
            "parent_id": "t1_h4t5ck9",
            "score": 2,
            "created_utc": 1626308213.0,
            "replies": []
        },
        {
            "body": "So you admit it. He didn't need hashi trash cells",
            "author": "GoodboyGotter",
            "id": "h4ocb35",
            "parent_id": "t1_h4oc8oz",
            "score": -23,
            "created_utc": 1625897394.0,
            "replies": [
                {
                    "body": "I don't think you understand at all.",
                    "author": "imjarrod12",
                    "id": "h4ocdjz",
                    "parent_id": "t1_h4ocb35",
                    "score": 22,
                    "created_utc": 1625897449.0,
                    "replies": [
                        {
                            "body": "You dont either....",
                            "author": "GoodboyGotter",
                            "id": "h4ocrkg",
                            "parent_id": "t1_h4ocdjz",
                            "score": -21,
                            "created_utc": 1625897769.0,
                            "replies": [
                                {
                                    "body": "He does, you don't. Go back and watch the clip.",
                                    "author": "xNuxIsGod",
                                    "id": "h4omxtm",
                                    "parent_id": "t1_h4ocrkg",
                                    "score": 12,
                                    "created_utc": 1625907092.0,
                                    "replies": []
                                },
                                {
                                    "body": "bruh sorry but you're not right",
                                    "author": null,
                                    "id": "h4phsd1",
                                    "parent_id": "t1_h4ocrkg",
                                    "score": 4,
                                    "created_utc": 1625929593.0,
                                    "replies": [
                                        {
                                            "body": "They took the bait",
                                            "author": "GoodboyGotter",
                                            "id": "h4pinm7",
                                            "parent_id": "t1_h4phsd1",
                                            "score": -4,
                                            "created_utc": 1625930022.0,
                                            "replies": [
                                                {
                                                    "body": "Ah",
                                                    "author": null,
                                                    "id": "h4pq3hn",
                                                    "parent_id": "t1_h4pinm7",
                                                    "score": 1,
                                                    "created_utc": 1625933544.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
                    "author": "noneeduselesss",
                    "id": "h4ono6f",
                    "parent_id": "t1_h4ocb35",
                    "score": 6,
                    "created_utc": 1625907821.0,
                    "replies": []
                },
                {
                    "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
                    "author": null,
                    "id": "h4ougis",
                    "parent_id": "t1_h4ocb35",
                    "score": 2,
                    "created_utc": 1625914460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> transmigration \n\nLmao",
            "author": "GoodboyGotter",
            "id": "h4p9qq2",
            "parent_id": "t1_h4om6xk",
            "score": 0,
            "created_utc": 1625925400.0,
            "replies": [
                {
                    "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
                    "author": "CaptnUchiha",
                    "id": "h4pnltu",
                    "parent_id": "t1_h4p9qq2",
                    "score": 3,
                    "created_utc": 1625932381.0,
                    "replies": [
                        {
                            "body": "I only use words that I understand 😎😎😎",
                            "author": "GoodboyGotter",
                            "id": "h4po6mb",
                            "parent_id": "t1_h4pnltu",
                            "score": 0,
                            "created_utc": 1625932654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All right . I respect your opinion . But there are many people like me who find Naruto cooler than Sasuke so it depends on person to person .",
            "author": "Tarkik_Vatsa",
            "id": "h4q49af",
            "parent_id": "t1_h4q1ky9",
            "score": 5,
            "created_utc": 1625940483.0,
            "replies": [
                {
                    "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
                    "author": "mo-did",
                    "id": "h4q4fa1",
                    "parent_id": "t1_h4q49af",
                    "score": 1,
                    "created_utc": 1625940569.0,
                    "replies": [
                        {
                            "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                            "author": "Tarkik_Vatsa",
                            "id": "h4q81vw",
                            "parent_id": "t1_h4q4fa1",
                            "score": 3,
                            "created_utc": 1625942470.0,
                            "replies": [
                                {
                                    "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                                    "author": "mo-did",
                                    "id": "h4q8c46",
                                    "parent_id": "t1_h4q81vw",
                                    "score": 2,
                                    "created_utc": 1625942618.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think you understand at all.",
            "author": "imjarrod12",
            "id": "h4ocdjz",
            "parent_id": "t1_h4ocb35",
            "score": 22,
            "created_utc": 1625897449.0,
            "replies": [
                {
                    "body": "You dont either....",
                    "author": "GoodboyGotter",
                    "id": "h4ocrkg",
                    "parent_id": "t1_h4ocdjz",
                    "score": -21,
                    "created_utc": 1625897769.0,
                    "replies": [
                        {
                            "body": "He does, you don't. Go back and watch the clip.",
                            "author": "xNuxIsGod",
                            "id": "h4omxtm",
                            "parent_id": "t1_h4ocrkg",
                            "score": 12,
                            "created_utc": 1625907092.0,
                            "replies": []
                        },
                        {
                            "body": "bruh sorry but you're not right",
                            "author": null,
                            "id": "h4phsd1",
                            "parent_id": "t1_h4ocrkg",
                            "score": 4,
                            "created_utc": 1625929593.0,
                            "replies": [
                                {
                                    "body": "They took the bait",
                                    "author": "GoodboyGotter",
                                    "id": "h4pinm7",
                                    "parent_id": "t1_h4phsd1",
                                    "score": -4,
                                    "created_utc": 1625930022.0,
                                    "replies": [
                                        {
                                            "body": "Ah",
                                            "author": null,
                                            "id": "h4pq3hn",
                                            "parent_id": "t1_h4pinm7",
                                            "score": 1,
                                            "created_utc": 1625933544.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh I don’t even think u have coke to the war arc yet madara literally said he gave his eyes to nagato",
            "author": "noneeduselesss",
            "id": "h4ono6f",
            "parent_id": "t1_h4ocb35",
            "score": 6,
            "created_utc": 1625907821.0,
            "replies": []
        },
        {
            "body": "Neither Indra nor Ashura had Rinnegan of their own, unlike their father. \n\nAshura + Indra = Hagoromo\n\nUzumaki/Senju + Uchiha = Rinnegan\n\nThe onioneye gives you such a boost that Madara did need it in order to gain some of Hagoromo's power and be able to control the tree.",
            "author": null,
            "id": "h4ougis",
            "parent_id": "t1_h4ocb35",
            "score": 2,
            "created_utc": 1625914460.0,
            "replies": []
        },
        {
            "body": "[Yes, Transmigration](https://narutofanon.fandom.com/wiki/Transmigration). This was in the manga and I'm pretty sure the anime as well.",
            "author": "CaptnUchiha",
            "id": "h4pnltu",
            "parent_id": "t1_h4p9qq2",
            "score": 3,
            "created_utc": 1625932381.0,
            "replies": [
                {
                    "body": "I only use words that I understand 😎😎😎",
                    "author": "GoodboyGotter",
                    "id": "h4po6mb",
                    "parent_id": "t1_h4pnltu",
                    "score": 0,
                    "created_utc": 1625932654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " I just find Sasuke to more of a actual ninja and less flashy then naruto if u catch my drift. In the sense of attire at least",
            "author": "mo-did",
            "id": "h4q4fa1",
            "parent_id": "t1_h4q49af",
            "score": 1,
            "created_utc": 1625940569.0,
            "replies": [
                {
                    "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
                    "author": "Tarkik_Vatsa",
                    "id": "h4q81vw",
                    "parent_id": "t1_h4q4fa1",
                    "score": 3,
                    "created_utc": 1625942470.0,
                    "replies": [
                        {
                            "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                            "author": "mo-did",
                            "id": "h4q8c46",
                            "parent_id": "t1_h4q81vw",
                            "score": 2,
                            "created_utc": 1625942618.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You dont either....",
            "author": "GoodboyGotter",
            "id": "h4ocrkg",
            "parent_id": "t1_h4ocdjz",
            "score": -21,
            "created_utc": 1625897769.0,
            "replies": [
                {
                    "body": "He does, you don't. Go back and watch the clip.",
                    "author": "xNuxIsGod",
                    "id": "h4omxtm",
                    "parent_id": "t1_h4ocrkg",
                    "score": 12,
                    "created_utc": 1625907092.0,
                    "replies": []
                },
                {
                    "body": "bruh sorry but you're not right",
                    "author": null,
                    "id": "h4phsd1",
                    "parent_id": "t1_h4ocrkg",
                    "score": 4,
                    "created_utc": 1625929593.0,
                    "replies": [
                        {
                            "body": "They took the bait",
                            "author": "GoodboyGotter",
                            "id": "h4pinm7",
                            "parent_id": "t1_h4phsd1",
                            "score": -4,
                            "created_utc": 1625930022.0,
                            "replies": [
                                {
                                    "body": "Ah",
                                    "author": null,
                                    "id": "h4pq3hn",
                                    "parent_id": "t1_h4pinm7",
                                    "score": 1,
                                    "created_utc": 1625933544.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I only use words that I understand 😎😎😎",
            "author": "GoodboyGotter",
            "id": "h4po6mb",
            "parent_id": "t1_h4pnltu",
            "score": 0,
            "created_utc": 1625932654.0,
            "replies": []
        },
        {
            "body": "I agree with the attire thing no doubt . But Sasuke wasnt in any ways less flashy than Naruto ( in Shippuden only though )",
            "author": "Tarkik_Vatsa",
            "id": "h4q81vw",
            "parent_id": "t1_h4q4fa1",
            "score": 3,
            "created_utc": 1625942470.0,
            "replies": [
                {
                    "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
                    "author": "mo-did",
                    "id": "h4q8c46",
                    "parent_id": "t1_h4q81vw",
                    "score": 2,
                    "created_utc": 1625942618.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He does, you don't. Go back and watch the clip.",
            "author": "xNuxIsGod",
            "id": "h4omxtm",
            "parent_id": "t1_h4ocrkg",
            "score": 12,
            "created_utc": 1625907092.0,
            "replies": []
        },
        {
            "body": "bruh sorry but you're not right",
            "author": null,
            "id": "h4phsd1",
            "parent_id": "t1_h4ocrkg",
            "score": 4,
            "created_utc": 1625929593.0,
            "replies": [
                {
                    "body": "They took the bait",
                    "author": "GoodboyGotter",
                    "id": "h4pinm7",
                    "parent_id": "t1_h4phsd1",
                    "score": -4,
                    "created_utc": 1625930022.0,
                    "replies": [
                        {
                            "body": "Ah",
                            "author": null,
                            "id": "h4pq3hn",
                            "parent_id": "t1_h4pinm7",
                            "score": 1,
                            "created_utc": 1625933544.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Few thought I was gonna be hated on for saying I think Sasuke is more of a ninja in that sense",
            "author": "mo-did",
            "id": "h4q8c46",
            "parent_id": "t1_h4q81vw",
            "score": 2,
            "created_utc": 1625942618.0,
            "replies": []
        },
        {
            "body": "They took the bait",
            "author": "GoodboyGotter",
            "id": "h4pinm7",
            "parent_id": "t1_h4phsd1",
            "score": -4,
            "created_utc": 1625930022.0,
            "replies": [
                {
                    "body": "Ah",
                    "author": null,
                    "id": "h4pq3hn",
                    "parent_id": "t1_h4pinm7",
                    "score": 1,
                    "created_utc": 1625933544.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah",
            "author": null,
            "id": "h4pq3hn",
            "parent_id": "t1_h4pinm7",
            "score": 1,
            "created_utc": 1625933544.0,
            "replies": []
        }
    ]
}