{
    "title": "An SB in 1857",
    "post_id": "i1y91i",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i1y91i/an_sb_in_1857/",
    "author": null,
    "body": "A Smithsonian story popped into my inbox this week, titled \"Everything Was Fake but Her Wealth\"\n\nIt tells the story of Ida Wood, who at the age of 19 moved to New York and decided she wanted a better life, so she did some research and proposed an arrangement to a complete stranger named Benjamin Wood: a married, 37-year-old businessman and politician.\n\nShe wrote him a letter:\n\n    May 28, 1857\n    \n    Mr. Wood—Sir\n    \n    Having heard of you often, I venture to address you from hearing a young lady,\n    one of your ‘former loves,’ speak of you. She says you are fond of ‘new faces.’\n    I fancy that as I am new in the city and in ‘affairs de coeur’ that I might \n    contract an agreeable intimacy with you; of as long duration as you saw fit to\n    have it. I believe that I am not extremely bad looking, nor disagreeable. Perhaps\n    not quite as handsome as the lady with you at present, but I know a little more,\n    and there is an old saying—‘Knowledge is power.’ If you would wish an interview\n    address a letter to No. Broadway P O New York stating what time we may meet.\n\nTen years after meeting they were married and it lasted until Benjamin's death in 1900.\n\nI just thought it was interesting how little things have changed in 163 years.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i1y91i/an_sb_in_1857/",
    "score": 174,
    "upvote_ratio": 0.97,
    "created_utc": 1596310895.0,
    "num_comments": 52,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "g00n154",
            "parent_id": "t3_i1y91i",
            "score": 61,
            "created_utc": 1596312222.0,
            "replies": [
                {
                    "body": "Yes! LOL",
                    "author": "comin_up_shawt",
                    "id": "g00ohff",
                    "parent_id": "t1_g00n154",
                    "score": 9,
                    "created_utc": 1596313000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so wisely written. I respect this woman for her move and words. ✨",
            "author": "sara2a5",
            "id": "g00nvho",
            "parent_id": "t3_i1y91i",
            "score": 24,
            "created_utc": 1596312663.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g00of1o",
                    "parent_id": "t1_g00nvho",
                    "score": 22,
                    "created_utc": 1596312963.0,
                    "replies": [
                        {
                            "body": "Expect for this part 😂 but she made though. I put it on the account of modesty perhaps hahah",
                            "author": "sara2a5",
                            "id": "g00one5",
                            "parent_id": "t1_g00of1o",
                            "score": 4,
                            "created_utc": 1596313093.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g00s5vh",
                                    "parent_id": "t1_g00one5",
                                    "score": 29,
                                    "created_utc": 1596314955.0,
                                    "replies": [
                                        {
                                            "body": "Oh I wish I knew what she looked like! I love this letter- thanks for posting",
                                            "author": null,
                                            "id": "g00u6y1",
                                            "parent_id": "t1_g00s5vh",
                                            "score": 6,
                                            "created_utc": 1596316073.0,
                                            "replies": [
                                                {
                                                    "body": "There's actually a picture or two of her in Google, I thought the same thing!",
                                                    "author": "yeehaw_yall",
                                                    "id": "g00viep",
                                                    "parent_id": "t1_g00u6y1",
                                                    "score": 5,
                                                    "created_utc": 1596316827.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "For that time and place she is attractive.",
                                    "author": "BigBearSD",
                                    "id": "g02w30o",
                                    "parent_id": "t1_g00one5",
                                    "score": 2,
                                    "created_utc": 1596365230.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If she even wrote it herself. It was extremely common for people to dictate letters to writers that would produce this formal language for a couple of coins.",
                    "author": "Zealousideal-Web5898",
                    "id": "g01lioa",
                    "parent_id": "t1_g00nvho",
                    "score": 4,
                    "created_utc": 1596332222.0,
                    "replies": [
                        {
                            "body": "This. She was a dirt poor Irish immigrant trying to make her start in the new world. She probably knew how to read and write, a little, but probably not to that extent. Most poor working people of that time were relatively illiterate.",
                            "author": "BigBearSD",
                            "id": "g02wckf",
                            "parent_id": "t1_g01lioa",
                            "score": 3,
                            "created_utc": 1596365380.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Link to [Ida and Benjamin photo](https://imgix.ranker.com/user_node_img/50100/1001989488/original/she-embraced-high-society-met-abraham-lincoln-and-danced-with-the-prince-of-wales-photo-u1?w=650&q=50&fm=pjpg&fit=crop&crop=faces)",
            "author": null,
            "id": "g00tw83",
            "parent_id": "t3_i1y91i",
            "score": 18,
            "created_utc": 1596315902.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g01ibqm",
                    "parent_id": "t1_g00tw83",
                    "score": 9,
                    "created_utc": 1596330269.0,
                    "replies": [
                        {
                            "body": "Haha.. and beautiful, wide dresses for ladies. Lol or maybe I’m just weird.\n\nAlso, our society doesn’t really have any particular dress so heck, why not bring it back? I think that what/ how you wear it carry yourself is more important than how you look when you have no clothes on at all. I think it’s called “allure”.. I can’t wait to see your photo! 😂😜",
                            "author": "why_so_sexy_",
                            "id": "g01xu51",
                            "parent_id": "t1_g01ibqm",
                            "score": 3,
                            "created_utc": 1596339925.0,
                            "replies": [
                                {
                                    "body": "Our current architecture does not promote the use of such a wide dress but maybe in light of covid we will be permitted the distance to pull it off Haha.I'm down if any gentlemen want to play dress up lol where would one even buy this type of costume? #2020bringbackthebustle",
                                    "author": "knot_yours_yet",
                                    "id": "g0289ve",
                                    "parent_id": "t1_g01xu51",
                                    "score": 6,
                                    "created_utc": 1596347889.0,
                                    "replies": []
                                },
                                {
                                    "body": "I wish we had the same standard of beauty now as it was back in those time.",
                                    "author": null,
                                    "id": "g026dkl",
                                    "parent_id": "t1_g01xu51",
                                    "score": 4,
                                    "created_utc": 1596346287.0,
                                    "replies": [
                                        {
                                            "body": "*sigh* Where we don’t worship taking clothes off with everything we do? Lol",
                                            "author": "why_so_sexy_",
                                            "id": "g035thq",
                                            "parent_id": "t1_g026dkl",
                                            "score": 1,
                                            "created_utc": 1596370917.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha.. what wit, and her bravery is awesome.. ❤️ This is amazing and op, I am indebted to you for sharing. Lol who writes letters though anymore.. 😂 *sigh* I keep thinking that the one guy who would be my perfect SD isn’t on sa. Does it ever feel like you’re looking in the wrong place for the right thing? 🤔🤷‍♀️",
            "author": "why_so_sexy_",
            "id": "g00seyg",
            "parent_id": "t3_i1y91i",
            "score": 12,
            "created_utc": 1596315073.0,
            "replies": [
                {
                    "body": "yes it does! I ask myself the same thing all the time.😅 My first boyfriend wrote me letter and poems! It was the most sweetest thing! My ex husband made me throw them out after we got married. I told him to take a page from the this guys book. 😅 before i threw them out!",
                    "author": "Sweetbaby79",
                    "id": "g01xagh",
                    "parent_id": "t1_g00seyg",
                    "score": 1,
                    "created_utc": 1596339558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting history! Did she just tell him \"I'm better educated than your wife\" or am I misreading it?",
            "author": "SkepticalChallenge",
            "id": "g00n628",
            "parent_id": "t3_i1y91i",
            "score": 20,
            "created_utc": 1596312301.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g00px75",
                    "parent_id": "t1_g00n628",
                    "score": 39,
                    "created_utc": 1596313774.0,
                    "replies": [
                        {
                            "body": "Oh! I guess she was a little too subtle for me - thanks.",
                            "author": "SkepticalChallenge",
                            "id": "g00rhov",
                            "parent_id": "t1_g00px75",
                            "score": 12,
                            "created_utc": 1596314593.0,
                            "replies": [
                                {
                                    "body": "Same. I thought the same thing you did.",
                                    "author": null,
                                    "id": "g01fyc5",
                                    "parent_id": "t1_g00rhov",
                                    "score": 4,
                                    "created_utc": 1596328838.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">affairs de couer \n\nAnd again, my vocabulary grows. If I am ever seeking again I will definitely use this in my profile “Seeking a discrete affair de couer...” has a nice ring to it.",
            "author": null,
            "id": "g015v5w",
            "parent_id": "t3_i1y91i",
            "score": 7,
            "created_utc": 1596322787.0,
            "replies": [
                {
                    "body": "It definitely does have a ring to it! I think I might use it too, plus I am learning French so it might be fun to use once I go there for a couple semesters. Affairs of the heart.. it sounds so romantic, honestly though, when I read this I forget that usually that is not how an sr works. But one can hope.. ;)",
                    "author": "why_so_sexy_",
                    "id": "g01ztuo",
                    "parent_id": "t1_g015v5w",
                    "score": 2,
                    "created_utc": 1596341306.0,
                    "replies": [
                        {
                            "body": ">honestly though, when I read this I forget that usually that is not how an sr works\n\nWRONG WRONG WRONG (Yes, I feel strongly about this, and had a nice pint of beer on an empty stomach after a 12km run)\n\nSRs can certainly be affairs of the heart if that is what you seek. I have had 5 SRs, 3 have been founded in emotion, dare I say LOVE. They are what I seek. I can get sex easily, emotion is what sustains me.",
                            "author": null,
                            "id": "g020pwc",
                            "parent_id": "t1_g01ztuo",
                            "score": 7,
                            "created_utc": 1596341920.0,
                            "replies": [
                                {
                                    "body": "Haha.. that you for the lovely reminder that I’m just twenty. ;)\n\nI just don’t think it’s the norm.. people may say that an affair de couer is what they want but I think that to most people, they learn that it takes more energy and even in a sr, has more of an emotional toll when it is based on love. Imagine for a moment, one of your SBs... perhaps you’re married, to another person or maybe to work, whatever way.. one of them probably never got over you. It takes a toll.. how many times can we be “in love” without feeling it? That’s the real question and I think that that puts the limit on how young most SBs are. How well can they handle understanding that who we love and how we love is never fair?\n\nI’m not saying that two people understanding that the love they share can’t last forever, I’m not saying that that is wrong or not beautiful. Only, that usually it’s not that simple and saying that sugar relationships are “ideal” in some way, is a mistake. \n\nI’m a romantic at heart though, so congratulations on your amazing SRs! ❤️\n\nEdit: you said in your comment that emotion is what sustains you… I think that that is true for me as well. It’s just that I wonder sometimes if having a “affair de couer” is the best way of satiating that need.",
                                    "author": "why_so_sexy_",
                                    "id": "g0226uu",
                                    "parent_id": "t1_g020pwc",
                                    "score": 2,
                                    "created_utc": 1596343000.0,
                                    "replies": [
                                        {
                                            "body": "Oh, so much here! So much love, so much hope, so much...you.\n\nMy SGF (I did not use SB by design) asked me to write her a love letter. I closed it with:\n\n“This is sugar. It is always for now, never for ever\n\nOne day it will end, and you will break my heart. \n\nFor a while, the memory of our time together will be painfully.\n\nBut, with time, the pain will fade, and what I will be left with is\n\nThe love you have shown me\nThe joy you have given me\nThe man you have made me”\n\nThe love of any woman is sweet, but the love of a young woman, who gives herself to you, mentally and physically, is intoxicating. \n\nDon’t give up beautiful girl.",
                                            "author": null,
                                            "id": "g02x0hk",
                                            "parent_id": "t1_g0226uu",
                                            "score": 2,
                                            "created_utc": 1596365794.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Honest question: does using french phrases sound nice for english speakers? I find it kind of cringy and \"trying too hard\".\n\nMaybe it's a cultural thing since i speak spanish and using french would make people say: wtf??",
                    "author": "Zealousideal-Web5898",
                    "id": "g032ge6",
                    "parent_id": "t1_g015v5w",
                    "score": 2,
                    "created_utc": 1596369179.0,
                    "replies": [
                        {
                            "body": ">Honest question: does using french phrases sound nice for english speakers? I find it kind of cringy and \"trying too hard\".\n\nYou have to keep in mind that when it was written, French was literally the \"lingua franca\" of the upper crust, royalty, intelligentsia, etc and that's the place she wants to get to, so usage of French in that intro is a smart move.",
                            "author": "roscoe7585",
                            "id": "g03bk3a",
                            "parent_id": "t1_g032ge6",
                            "score": 2,
                            "created_utc": 1596373480.0,
                            "replies": []
                        },
                        {
                            "body": "Hmm, it's all part of finding the right expression I guess. There seem to be many French expressions that better describe affairs of the heart than English. For example, ménage à trois sounds so much more classy than \"threesome\"",
                            "author": null,
                            "id": "g032w5r",
                            "parent_id": "t1_g032ge6",
                            "score": 1,
                            "created_utc": 1596369406.0,
                            "replies": [
                                {
                                    "body": ">For example, ménage à trois sounds so much more classy than \"threesome\"\n\nBut why? French is just another language, why not polish? or swedish?",
                                    "author": "Zealousideal-Web5898",
                                    "id": "g033eef",
                                    "parent_id": "t1_g032w5r",
                                    "score": 2,
                                    "created_utc": 1596369676.0,
                                    "replies": [
                                        {
                                            "body": "Well, what is polish for threesome?",
                                            "author": null,
                                            "id": "g035qw1",
                                            "parent_id": "t1_g033eef",
                                            "score": 1,
                                            "created_utc": 1596370881.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love this! I also really love her \"description of her proposed arrangement\" ..\n\n\"Not bad looking. Or disagreeable\"😉\n\nGet 'em Ida! 😍😂",
            "author": "NattyLiteSaber",
            "id": "g00yicr",
            "parent_id": "t3_i1y91i",
            "score": 6,
            "created_utc": 1596318530.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g00nrp8",
            "parent_id": "t3_i1y91i",
            "score": 19,
            "created_utc": 1596312616.0,
            "replies": [
                {
                    "body": "That is what I say to u/davebellgood2020 all the time. 😂😂",
                    "author": null,
                    "id": "g01g4s0",
                    "parent_id": "t1_g00nrp8",
                    "score": 3,
                    "created_utc": 1596328947.0,
                    "replies": [
                        {
                            "body": "Yes. You definitely have the “good good” u/elle4200 and much like Ida you are not “disagreeable”",
                            "author": "DaveBellGood2020",
                            "id": "g01navt",
                            "parent_id": "t1_g01g4s0",
                            "score": 3,
                            "created_utc": 1596333309.0,
                            "replies": [
                                {
                                    "body": "Hahah! Im glad you think so. 😘",
                                    "author": null,
                                    "id": "g01nulv",
                                    "parent_id": "t1_g01navt",
                                    "score": 3,
                                    "created_utc": 1596333650.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love this. I love the way people spoke so eloquently in those days but I worry about sounding pretentious when I talk like that.",
            "author": "Mistress_Sassy",
            "id": "g00z7a0",
            "parent_id": "t3_i1y91i",
            "score": 3,
            "created_utc": 1596318919.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g0103oq",
                    "parent_id": "t1_g00z7a0",
                    "score": 4,
                    "created_utc": 1596319435.0,
                    "replies": [
                        {
                            "body": "Oh absolutely. As long as they know all the words you're using hehe. I got a word of the day calendar once and most of the words were esoteric or eccentric, whichi made me realize that having a robust vocabulary is only useful if the words you use are relevant to the general populace. Personally I have no problem saying \"what does _____ mean?\" But I know alot of people don't appreciate having to ask.",
                            "author": "Mistress_Sassy",
                            "id": "g010sd5",
                            "parent_id": "t1_g0103oq",
                            "score": 5,
                            "created_utc": 1596319828.0,
                            "replies": [
                                {
                                    "body": "I'm with you. I, actually, thoroughly enjoy when I have to ask the definition of a word when I'm talking with someone. Robust vocabularies somehow turn me on?",
                                    "author": "1SweetCheeks",
                                    "id": "g01728m",
                                    "parent_id": "t1_g010sd5",
                                    "score": 2,
                                    "created_utc": 1596323498.0,
                                    "replies": [
                                        {
                                            "body": "Me too! Being well read is hella sexy.",
                                            "author": "Mistress_Sassy",
                                            "id": "g0qmvgl",
                                            "parent_id": "t1_g01728m",
                                            "score": 1,
                                            "created_utc": 1596845819.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I love the way people spoke so eloquently in those days\n\nThey didn't, they used this style mostly for writing. And there were people (scribes) whose whole job was writing letters from either illiterate people or people that wanted to sound this \"classy\".",
                    "author": "Zealousideal-Web5898",
                    "id": "g01mj10",
                    "parent_id": "t1_g00z7a0",
                    "score": 4,
                    "created_utc": 1596332829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People are people, technology changes, names change, places, change, everything around us changes, but human nature is largely unchanging. There are always the odd exceptions here and there, and yes people may be taught how to act differently but by in large, people have been and always will be the same.",
            "author": "Mr_Curious_Cat",
            "id": "g010hp4",
            "parent_id": "t3_i1y91i",
            "score": 3,
            "created_utc": 1596319657.0,
            "replies": []
        },
        {
            "body": "What an awesome find! Thank you so much for sharing.",
            "author": null,
            "id": "g01gaf6",
            "parent_id": "t3_i1y91i",
            "score": 3,
            "created_utc": 1596329043.0,
            "replies": []
        },
        {
            "body": "As a history buff / historian I like the post. Enjoy the gold.\n\nAs I have said in the past \"SBs\" have ALWAYS been around, that is just their modern title. Mistress or courtesan (depending on how much love vs. Quid pro quo kind of thing) were what mist SBs / SGFs were called. Through all of human history there have been men of wealth and power, many married, and many had women on the side that they cared for and helped. \"Kept Women\" was another term. Essentially mistress. They would pay for them to have their own place, all needs met etc... of course most mistresses, especially like Miss Wood wanted to eventually marry their partner, either out of love or more free access to his money or both. Especially given she was a poor Irish immigrant, and the civil war was about to start (unbeknownst to them) which would make some people richer, a lot of people poorer, and put fear in to a lot of Americans, I am sure she clung extra tightly to him in the early 1860s.\n\nGreat find.",
            "author": "BigBearSD",
            "id": "g02voz4",
            "parent_id": "t3_i1y91i",
            "score": 3,
            "created_utc": 1596365022.0,
            "replies": []
        },
        {
            "body": "Yes and no. Back then, taking a mistress, was by necessity only available to the elite. With the rise of the working class pretending to be a middle class (currently in turmoil with rising unemployment, falling wages and a Depression era contraction of GDP), any old john can pretend to be a sugar daddy. And ditto the sex workers playing the mistress game.",
            "author": null,
            "id": "g00yemp",
            "parent_id": "t3_i1y91i",
            "score": 5,
            "created_utc": 1596318472.0,
            "replies": []
        },
        {
            "body": "I read this too. Do you really wanna die in a hotel room with all the money in your overcoat and room? Lonely, miserable? 😂😂",
            "author": "rickrat",
            "id": "g017v59",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596323967.0,
            "replies": []
        },
        {
            "body": "Thanks for taking the time to post this.  I think we all take it at face value that 'sugaring' must be an age-old tradition... how could it not be?  But seeing this correspondence is very fun!",
            "author": "TY2022",
            "id": "g01irjw",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596330537.0,
            "replies": []
        },
        {
            "body": "I like the way this lady talks. Very businesslike and straightforward. I'd definitely give her a shot if she said this to me on a M&G! Then again, I'd be wondering what year it was if she talked this way too. :)",
            "author": "mrjimmyjsz",
            "id": "g01knnr",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596331696.0,
            "replies": []
        },
        {
            "body": "Excellent letter I would interview her immediately",
            "author": null,
            "id": "g01kwbt",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596331841.0,
            "replies": []
        },
        {
            "body": "Awesome find OP. And thanks for adding the picture of the lovely couple!",
            "author": "Wallytrollman95",
            "id": "g01pzb5",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596334978.0,
            "replies": []
        },
        {
            "body": "On a similar note, I consider Alexander Hamilton’s affair with Maria Reynolds essentially to be a sugar arrangement. From the Reynolds Pamphlet:\n\n>\tSome time in the summer of the year 1791 a woman called at my house in the city of Philadelphia and asked to speak with me in private. I attended her into a room apart from the family. With a seeming air of affliction she informed that she was a daughter of a Mr. Lewis, sister to a Mr. G. Livingston of the State of New-York, and wife to a Mr. Reynolds whose father was in the Commissary Department during the war with Great Britain, that her husband, who for a long time had treated her very cruelly, had lately left her, to live with another woman, and in so destitute a condition, that though desirous of returning to her friends she had not the means—that knowing I was a citizen of New-York, she had taken the liberty to apply to my humanity for assistance. I replied, that her situation was a very interesting one—that I was disposed to afford her assistance to convey her to her friends, but this at the moment not being convenient to me (which was the fact) I must request the place of her residence, to which I should bring or send a small supply of money. She told me the street and the number of the house where she lodged. In the evening I put a bank-bill in my pocket and went to the house. I inquired for Mrs. Reynolds and was shewn up stairs, at the head of which she met me and conducted me into a bed room. I took the bill out of my pocket and gave it to her. Some conversation ensued from which it was quickly apparent that other than pecuniary consolation would be acceptable. After this, I had frequent meetings with her, most of them at my own house [DAMN.]; Mrs. Hamilton with her children being absent on a visit to her father. [BOOOOO]  In the course of a short time, she mentioned to me that her husband had solicited a reconciliation, and affected to consult me about it. I advised to it, and was soon after informed by her that it had taken place.\n\nThere is, in true Hamilton fashion of course, a lot more. The full text can be found here: https://founders.archives.gov/documents/Hamilton/01-21-02-0138-0002",
            "author": null,
            "id": "g034j1g",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596370238.0,
            "replies": []
        },
        {
            "body": "Good girls go to Heaven. Bad girls go *everywhere*. \n\n~ Mae West",
            "author": "LaGriffeDuLion",
            "id": "g03x4qe",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596381874.0,
            "replies": []
        },
        {
            "body": "Sugaring was probably more prevalent throughout history than most of us think.  Brandon Wade brought arrangements to the masses like Henry Ford did with automobiles. But before that there were classified ads, circulars, social clubs, and who know what else for arrangements to be made. I recall Don Draper referred to \"Party Girls\" on one episode of Mad Men.  Sugaring sixties style. ;-)",
            "author": "AquariiATX",
            "id": "g05qpqq",
            "parent_id": "t3_i1y91i",
            "score": 2,
            "created_utc": 1596414623.0,
            "replies": []
        },
        {
            "body": "Awesome how she had the nerve to take her shot like that, and succeeded!",
            "author": "roscoe7585",
            "id": "g03bnz5",
            "parent_id": "t3_i1y91i",
            "score": 1,
            "created_utc": 1596373522.0,
            "replies": []
        },
        {
            "body": "Now everything is textual 🤦🏼‍♂️",
            "author": "RobnHit",
            "id": "g04u7gf",
            "parent_id": "t3_i1y91i",
            "score": 1,
            "created_utc": 1596396787.0,
            "replies": []
        },
        {
            "body": "Yes! LOL",
            "author": "comin_up_shawt",
            "id": "g00ohff",
            "parent_id": "t1_g00n154",
            "score": 9,
            "created_utc": 1596313000.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g00of1o",
            "parent_id": "t1_g00nvho",
            "score": 22,
            "created_utc": 1596312963.0,
            "replies": [
                {
                    "body": "Expect for this part 😂 but she made though. I put it on the account of modesty perhaps hahah",
                    "author": "sara2a5",
                    "id": "g00one5",
                    "parent_id": "t1_g00of1o",
                    "score": 4,
                    "created_utc": 1596313093.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g00s5vh",
                            "parent_id": "t1_g00one5",
                            "score": 29,
                            "created_utc": 1596314955.0,
                            "replies": [
                                {
                                    "body": "Oh I wish I knew what she looked like! I love this letter- thanks for posting",
                                    "author": null,
                                    "id": "g00u6y1",
                                    "parent_id": "t1_g00s5vh",
                                    "score": 6,
                                    "created_utc": 1596316073.0,
                                    "replies": [
                                        {
                                            "body": "There's actually a picture or two of her in Google, I thought the same thing!",
                                            "author": "yeehaw_yall",
                                            "id": "g00viep",
                                            "parent_id": "t1_g00u6y1",
                                            "score": 5,
                                            "created_utc": 1596316827.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "For that time and place she is attractive.",
                            "author": "BigBearSD",
                            "id": "g02w30o",
                            "parent_id": "t1_g00one5",
                            "score": 2,
                            "created_utc": 1596365230.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If she even wrote it herself. It was extremely common for people to dictate letters to writers that would produce this formal language for a couple of coins.",
            "author": "Zealousideal-Web5898",
            "id": "g01lioa",
            "parent_id": "t1_g00nvho",
            "score": 4,
            "created_utc": 1596332222.0,
            "replies": [
                {
                    "body": "This. She was a dirt poor Irish immigrant trying to make her start in the new world. She probably knew how to read and write, a little, but probably not to that extent. Most poor working people of that time were relatively illiterate.",
                    "author": "BigBearSD",
                    "id": "g02wckf",
                    "parent_id": "t1_g01lioa",
                    "score": 3,
                    "created_utc": 1596365380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g01ibqm",
            "parent_id": "t1_g00tw83",
            "score": 9,
            "created_utc": 1596330269.0,
            "replies": [
                {
                    "body": "Haha.. and beautiful, wide dresses for ladies. Lol or maybe I’m just weird.\n\nAlso, our society doesn’t really have any particular dress so heck, why not bring it back? I think that what/ how you wear it carry yourself is more important than how you look when you have no clothes on at all. I think it’s called “allure”.. I can’t wait to see your photo! 😂😜",
                    "author": "why_so_sexy_",
                    "id": "g01xu51",
                    "parent_id": "t1_g01ibqm",
                    "score": 3,
                    "created_utc": 1596339925.0,
                    "replies": [
                        {
                            "body": "Our current architecture does not promote the use of such a wide dress but maybe in light of covid we will be permitted the distance to pull it off Haha.I'm down if any gentlemen want to play dress up lol where would one even buy this type of costume? #2020bringbackthebustle",
                            "author": "knot_yours_yet",
                            "id": "g0289ve",
                            "parent_id": "t1_g01xu51",
                            "score": 6,
                            "created_utc": 1596347889.0,
                            "replies": []
                        },
                        {
                            "body": "I wish we had the same standard of beauty now as it was back in those time.",
                            "author": null,
                            "id": "g026dkl",
                            "parent_id": "t1_g01xu51",
                            "score": 4,
                            "created_utc": 1596346287.0,
                            "replies": [
                                {
                                    "body": "*sigh* Where we don’t worship taking clothes off with everything we do? Lol",
                                    "author": "why_so_sexy_",
                                    "id": "g035thq",
                                    "parent_id": "t1_g026dkl",
                                    "score": 1,
                                    "created_utc": 1596370917.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes it does! I ask myself the same thing all the time.😅 My first boyfriend wrote me letter and poems! It was the most sweetest thing! My ex husband made me throw them out after we got married. I told him to take a page from the this guys book. 😅 before i threw them out!",
            "author": "Sweetbaby79",
            "id": "g01xagh",
            "parent_id": "t1_g00seyg",
            "score": 1,
            "created_utc": 1596339558.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g00px75",
            "parent_id": "t1_g00n628",
            "score": 39,
            "created_utc": 1596313774.0,
            "replies": [
                {
                    "body": "Oh! I guess she was a little too subtle for me - thanks.",
                    "author": "SkepticalChallenge",
                    "id": "g00rhov",
                    "parent_id": "t1_g00px75",
                    "score": 12,
                    "created_utc": 1596314593.0,
                    "replies": [
                        {
                            "body": "Same. I thought the same thing you did.",
                            "author": null,
                            "id": "g01fyc5",
                            "parent_id": "t1_g00rhov",
                            "score": 4,
                            "created_utc": 1596328838.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It definitely does have a ring to it! I think I might use it too, plus I am learning French so it might be fun to use once I go there for a couple semesters. Affairs of the heart.. it sounds so romantic, honestly though, when I read this I forget that usually that is not how an sr works. But one can hope.. ;)",
            "author": "why_so_sexy_",
            "id": "g01ztuo",
            "parent_id": "t1_g015v5w",
            "score": 2,
            "created_utc": 1596341306.0,
            "replies": [
                {
                    "body": ">honestly though, when I read this I forget that usually that is not how an sr works\n\nWRONG WRONG WRONG (Yes, I feel strongly about this, and had a nice pint of beer on an empty stomach after a 12km run)\n\nSRs can certainly be affairs of the heart if that is what you seek. I have had 5 SRs, 3 have been founded in emotion, dare I say LOVE. They are what I seek. I can get sex easily, emotion is what sustains me.",
                    "author": null,
                    "id": "g020pwc",
                    "parent_id": "t1_g01ztuo",
                    "score": 7,
                    "created_utc": 1596341920.0,
                    "replies": [
                        {
                            "body": "Haha.. that you for the lovely reminder that I’m just twenty. ;)\n\nI just don’t think it’s the norm.. people may say that an affair de couer is what they want but I think that to most people, they learn that it takes more energy and even in a sr, has more of an emotional toll when it is based on love. Imagine for a moment, one of your SBs... perhaps you’re married, to another person or maybe to work, whatever way.. one of them probably never got over you. It takes a toll.. how many times can we be “in love” without feeling it? That’s the real question and I think that that puts the limit on how young most SBs are. How well can they handle understanding that who we love and how we love is never fair?\n\nI’m not saying that two people understanding that the love they share can’t last forever, I’m not saying that that is wrong or not beautiful. Only, that usually it’s not that simple and saying that sugar relationships are “ideal” in some way, is a mistake. \n\nI’m a romantic at heart though, so congratulations on your amazing SRs! ❤️\n\nEdit: you said in your comment that emotion is what sustains you… I think that that is true for me as well. It’s just that I wonder sometimes if having a “affair de couer” is the best way of satiating that need.",
                            "author": "why_so_sexy_",
                            "id": "g0226uu",
                            "parent_id": "t1_g020pwc",
                            "score": 2,
                            "created_utc": 1596343000.0,
                            "replies": [
                                {
                                    "body": "Oh, so much here! So much love, so much hope, so much...you.\n\nMy SGF (I did not use SB by design) asked me to write her a love letter. I closed it with:\n\n“This is sugar. It is always for now, never for ever\n\nOne day it will end, and you will break my heart. \n\nFor a while, the memory of our time together will be painfully.\n\nBut, with time, the pain will fade, and what I will be left with is\n\nThe love you have shown me\nThe joy you have given me\nThe man you have made me”\n\nThe love of any woman is sweet, but the love of a young woman, who gives herself to you, mentally and physically, is intoxicating. \n\nDon’t give up beautiful girl.",
                                    "author": null,
                                    "id": "g02x0hk",
                                    "parent_id": "t1_g0226uu",
                                    "score": 2,
                                    "created_utc": 1596365794.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honest question: does using french phrases sound nice for english speakers? I find it kind of cringy and \"trying too hard\".\n\nMaybe it's a cultural thing since i speak spanish and using french would make people say: wtf??",
            "author": "Zealousideal-Web5898",
            "id": "g032ge6",
            "parent_id": "t1_g015v5w",
            "score": 2,
            "created_utc": 1596369179.0,
            "replies": [
                {
                    "body": ">Honest question: does using french phrases sound nice for english speakers? I find it kind of cringy and \"trying too hard\".\n\nYou have to keep in mind that when it was written, French was literally the \"lingua franca\" of the upper crust, royalty, intelligentsia, etc and that's the place she wants to get to, so usage of French in that intro is a smart move.",
                    "author": "roscoe7585",
                    "id": "g03bk3a",
                    "parent_id": "t1_g032ge6",
                    "score": 2,
                    "created_utc": 1596373480.0,
                    "replies": []
                },
                {
                    "body": "Hmm, it's all part of finding the right expression I guess. There seem to be many French expressions that better describe affairs of the heart than English. For example, ménage à trois sounds so much more classy than \"threesome\"",
                    "author": null,
                    "id": "g032w5r",
                    "parent_id": "t1_g032ge6",
                    "score": 1,
                    "created_utc": 1596369406.0,
                    "replies": [
                        {
                            "body": ">For example, ménage à trois sounds so much more classy than \"threesome\"\n\nBut why? French is just another language, why not polish? or swedish?",
                            "author": "Zealousideal-Web5898",
                            "id": "g033eef",
                            "parent_id": "t1_g032w5r",
                            "score": 2,
                            "created_utc": 1596369676.0,
                            "replies": [
                                {
                                    "body": "Well, what is polish for threesome?",
                                    "author": null,
                                    "id": "g035qw1",
                                    "parent_id": "t1_g033eef",
                                    "score": 1,
                                    "created_utc": 1596370881.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is what I say to u/davebellgood2020 all the time. 😂😂",
            "author": null,
            "id": "g01g4s0",
            "parent_id": "t1_g00nrp8",
            "score": 3,
            "created_utc": 1596328947.0,
            "replies": [
                {
                    "body": "Yes. You definitely have the “good good” u/elle4200 and much like Ida you are not “disagreeable”",
                    "author": "DaveBellGood2020",
                    "id": "g01navt",
                    "parent_id": "t1_g01g4s0",
                    "score": 3,
                    "created_utc": 1596333309.0,
                    "replies": [
                        {
                            "body": "Hahah! Im glad you think so. 😘",
                            "author": null,
                            "id": "g01nulv",
                            "parent_id": "t1_g01navt",
                            "score": 3,
                            "created_utc": 1596333650.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g0103oq",
            "parent_id": "t1_g00z7a0",
            "score": 4,
            "created_utc": 1596319435.0,
            "replies": [
                {
                    "body": "Oh absolutely. As long as they know all the words you're using hehe. I got a word of the day calendar once and most of the words were esoteric or eccentric, whichi made me realize that having a robust vocabulary is only useful if the words you use are relevant to the general populace. Personally I have no problem saying \"what does _____ mean?\" But I know alot of people don't appreciate having to ask.",
                    "author": "Mistress_Sassy",
                    "id": "g010sd5",
                    "parent_id": "t1_g0103oq",
                    "score": 5,
                    "created_utc": 1596319828.0,
                    "replies": [
                        {
                            "body": "I'm with you. I, actually, thoroughly enjoy when I have to ask the definition of a word when I'm talking with someone. Robust vocabularies somehow turn me on?",
                            "author": "1SweetCheeks",
                            "id": "g01728m",
                            "parent_id": "t1_g010sd5",
                            "score": 2,
                            "created_utc": 1596323498.0,
                            "replies": [
                                {
                                    "body": "Me too! Being well read is hella sexy.",
                                    "author": "Mistress_Sassy",
                                    "id": "g0qmvgl",
                                    "parent_id": "t1_g01728m",
                                    "score": 1,
                                    "created_utc": 1596845819.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I love the way people spoke so eloquently in those days\n\nThey didn't, they used this style mostly for writing. And there were people (scribes) whose whole job was writing letters from either illiterate people or people that wanted to sound this \"classy\".",
            "author": "Zealousideal-Web5898",
            "id": "g01mj10",
            "parent_id": "t1_g00z7a0",
            "score": 4,
            "created_utc": 1596332829.0,
            "replies": []
        },
        {
            "body": "Expect for this part 😂 but she made though. I put it on the account of modesty perhaps hahah",
            "author": "sara2a5",
            "id": "g00one5",
            "parent_id": "t1_g00of1o",
            "score": 4,
            "created_utc": 1596313093.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g00s5vh",
                    "parent_id": "t1_g00one5",
                    "score": 29,
                    "created_utc": 1596314955.0,
                    "replies": [
                        {
                            "body": "Oh I wish I knew what she looked like! I love this letter- thanks for posting",
                            "author": null,
                            "id": "g00u6y1",
                            "parent_id": "t1_g00s5vh",
                            "score": 6,
                            "created_utc": 1596316073.0,
                            "replies": [
                                {
                                    "body": "There's actually a picture or two of her in Google, I thought the same thing!",
                                    "author": "yeehaw_yall",
                                    "id": "g00viep",
                                    "parent_id": "t1_g00u6y1",
                                    "score": 5,
                                    "created_utc": 1596316827.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "For that time and place she is attractive.",
                    "author": "BigBearSD",
                    "id": "g02w30o",
                    "parent_id": "t1_g00one5",
                    "score": 2,
                    "created_utc": 1596365230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This. She was a dirt poor Irish immigrant trying to make her start in the new world. She probably knew how to read and write, a little, but probably not to that extent. Most poor working people of that time were relatively illiterate.",
            "author": "BigBearSD",
            "id": "g02wckf",
            "parent_id": "t1_g01lioa",
            "score": 3,
            "created_utc": 1596365380.0,
            "replies": []
        },
        {
            "body": "Haha.. and beautiful, wide dresses for ladies. Lol or maybe I’m just weird.\n\nAlso, our society doesn’t really have any particular dress so heck, why not bring it back? I think that what/ how you wear it carry yourself is more important than how you look when you have no clothes on at all. I think it’s called “allure”.. I can’t wait to see your photo! 😂😜",
            "author": "why_so_sexy_",
            "id": "g01xu51",
            "parent_id": "t1_g01ibqm",
            "score": 3,
            "created_utc": 1596339925.0,
            "replies": [
                {
                    "body": "Our current architecture does not promote the use of such a wide dress but maybe in light of covid we will be permitted the distance to pull it off Haha.I'm down if any gentlemen want to play dress up lol where would one even buy this type of costume? #2020bringbackthebustle",
                    "author": "knot_yours_yet",
                    "id": "g0289ve",
                    "parent_id": "t1_g01xu51",
                    "score": 6,
                    "created_utc": 1596347889.0,
                    "replies": []
                },
                {
                    "body": "I wish we had the same standard of beauty now as it was back in those time.",
                    "author": null,
                    "id": "g026dkl",
                    "parent_id": "t1_g01xu51",
                    "score": 4,
                    "created_utc": 1596346287.0,
                    "replies": [
                        {
                            "body": "*sigh* Where we don’t worship taking clothes off with everything we do? Lol",
                            "author": "why_so_sexy_",
                            "id": "g035thq",
                            "parent_id": "t1_g026dkl",
                            "score": 1,
                            "created_utc": 1596370917.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh! I guess she was a little too subtle for me - thanks.",
            "author": "SkepticalChallenge",
            "id": "g00rhov",
            "parent_id": "t1_g00px75",
            "score": 12,
            "created_utc": 1596314593.0,
            "replies": [
                {
                    "body": "Same. I thought the same thing you did.",
                    "author": null,
                    "id": "g01fyc5",
                    "parent_id": "t1_g00rhov",
                    "score": 4,
                    "created_utc": 1596328838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">honestly though, when I read this I forget that usually that is not how an sr works\n\nWRONG WRONG WRONG (Yes, I feel strongly about this, and had a nice pint of beer on an empty stomach after a 12km run)\n\nSRs can certainly be affairs of the heart if that is what you seek. I have had 5 SRs, 3 have been founded in emotion, dare I say LOVE. They are what I seek. I can get sex easily, emotion is what sustains me.",
            "author": null,
            "id": "g020pwc",
            "parent_id": "t1_g01ztuo",
            "score": 7,
            "created_utc": 1596341920.0,
            "replies": [
                {
                    "body": "Haha.. that you for the lovely reminder that I’m just twenty. ;)\n\nI just don’t think it’s the norm.. people may say that an affair de couer is what they want but I think that to most people, they learn that it takes more energy and even in a sr, has more of an emotional toll when it is based on love. Imagine for a moment, one of your SBs... perhaps you’re married, to another person or maybe to work, whatever way.. one of them probably never got over you. It takes a toll.. how many times can we be “in love” without feeling it? That’s the real question and I think that that puts the limit on how young most SBs are. How well can they handle understanding that who we love and how we love is never fair?\n\nI’m not saying that two people understanding that the love they share can’t last forever, I’m not saying that that is wrong or not beautiful. Only, that usually it’s not that simple and saying that sugar relationships are “ideal” in some way, is a mistake. \n\nI’m a romantic at heart though, so congratulations on your amazing SRs! ❤️\n\nEdit: you said in your comment that emotion is what sustains you… I think that that is true for me as well. It’s just that I wonder sometimes if having a “affair de couer” is the best way of satiating that need.",
                    "author": "why_so_sexy_",
                    "id": "g0226uu",
                    "parent_id": "t1_g020pwc",
                    "score": 2,
                    "created_utc": 1596343000.0,
                    "replies": [
                        {
                            "body": "Oh, so much here! So much love, so much hope, so much...you.\n\nMy SGF (I did not use SB by design) asked me to write her a love letter. I closed it with:\n\n“This is sugar. It is always for now, never for ever\n\nOne day it will end, and you will break my heart. \n\nFor a while, the memory of our time together will be painfully.\n\nBut, with time, the pain will fade, and what I will be left with is\n\nThe love you have shown me\nThe joy you have given me\nThe man you have made me”\n\nThe love of any woman is sweet, but the love of a young woman, who gives herself to you, mentally and physically, is intoxicating. \n\nDon’t give up beautiful girl.",
                            "author": null,
                            "id": "g02x0hk",
                            "parent_id": "t1_g0226uu",
                            "score": 2,
                            "created_utc": 1596365794.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Honest question: does using french phrases sound nice for english speakers? I find it kind of cringy and \"trying too hard\".\n\nYou have to keep in mind that when it was written, French was literally the \"lingua franca\" of the upper crust, royalty, intelligentsia, etc and that's the place she wants to get to, so usage of French in that intro is a smart move.",
            "author": "roscoe7585",
            "id": "g03bk3a",
            "parent_id": "t1_g032ge6",
            "score": 2,
            "created_utc": 1596373480.0,
            "replies": []
        },
        {
            "body": "Hmm, it's all part of finding the right expression I guess. There seem to be many French expressions that better describe affairs of the heart than English. For example, ménage à trois sounds so much more classy than \"threesome\"",
            "author": null,
            "id": "g032w5r",
            "parent_id": "t1_g032ge6",
            "score": 1,
            "created_utc": 1596369406.0,
            "replies": [
                {
                    "body": ">For example, ménage à trois sounds so much more classy than \"threesome\"\n\nBut why? French is just another language, why not polish? or swedish?",
                    "author": "Zealousideal-Web5898",
                    "id": "g033eef",
                    "parent_id": "t1_g032w5r",
                    "score": 2,
                    "created_utc": 1596369676.0,
                    "replies": [
                        {
                            "body": "Well, what is polish for threesome?",
                            "author": null,
                            "id": "g035qw1",
                            "parent_id": "t1_g033eef",
                            "score": 1,
                            "created_utc": 1596370881.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. You definitely have the “good good” u/elle4200 and much like Ida you are not “disagreeable”",
            "author": "DaveBellGood2020",
            "id": "g01navt",
            "parent_id": "t1_g01g4s0",
            "score": 3,
            "created_utc": 1596333309.0,
            "replies": [
                {
                    "body": "Hahah! Im glad you think so. 😘",
                    "author": null,
                    "id": "g01nulv",
                    "parent_id": "t1_g01navt",
                    "score": 3,
                    "created_utc": 1596333650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh absolutely. As long as they know all the words you're using hehe. I got a word of the day calendar once and most of the words were esoteric or eccentric, whichi made me realize that having a robust vocabulary is only useful if the words you use are relevant to the general populace. Personally I have no problem saying \"what does _____ mean?\" But I know alot of people don't appreciate having to ask.",
            "author": "Mistress_Sassy",
            "id": "g010sd5",
            "parent_id": "t1_g0103oq",
            "score": 5,
            "created_utc": 1596319828.0,
            "replies": [
                {
                    "body": "I'm with you. I, actually, thoroughly enjoy when I have to ask the definition of a word when I'm talking with someone. Robust vocabularies somehow turn me on?",
                    "author": "1SweetCheeks",
                    "id": "g01728m",
                    "parent_id": "t1_g010sd5",
                    "score": 2,
                    "created_utc": 1596323498.0,
                    "replies": [
                        {
                            "body": "Me too! Being well read is hella sexy.",
                            "author": "Mistress_Sassy",
                            "id": "g0qmvgl",
                            "parent_id": "t1_g01728m",
                            "score": 1,
                            "created_utc": 1596845819.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g00s5vh",
            "parent_id": "t1_g00one5",
            "score": 29,
            "created_utc": 1596314955.0,
            "replies": [
                {
                    "body": "Oh I wish I knew what she looked like! I love this letter- thanks for posting",
                    "author": null,
                    "id": "g00u6y1",
                    "parent_id": "t1_g00s5vh",
                    "score": 6,
                    "created_utc": 1596316073.0,
                    "replies": [
                        {
                            "body": "There's actually a picture or two of her in Google, I thought the same thing!",
                            "author": "yeehaw_yall",
                            "id": "g00viep",
                            "parent_id": "t1_g00u6y1",
                            "score": 5,
                            "created_utc": 1596316827.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "For that time and place she is attractive.",
            "author": "BigBearSD",
            "id": "g02w30o",
            "parent_id": "t1_g00one5",
            "score": 2,
            "created_utc": 1596365230.0,
            "replies": []
        },
        {
            "body": "Our current architecture does not promote the use of such a wide dress but maybe in light of covid we will be permitted the distance to pull it off Haha.I'm down if any gentlemen want to play dress up lol where would one even buy this type of costume? #2020bringbackthebustle",
            "author": "knot_yours_yet",
            "id": "g0289ve",
            "parent_id": "t1_g01xu51",
            "score": 6,
            "created_utc": 1596347889.0,
            "replies": []
        },
        {
            "body": "I wish we had the same standard of beauty now as it was back in those time.",
            "author": null,
            "id": "g026dkl",
            "parent_id": "t1_g01xu51",
            "score": 4,
            "created_utc": 1596346287.0,
            "replies": [
                {
                    "body": "*sigh* Where we don’t worship taking clothes off with everything we do? Lol",
                    "author": "why_so_sexy_",
                    "id": "g035thq",
                    "parent_id": "t1_g026dkl",
                    "score": 1,
                    "created_utc": 1596370917.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same. I thought the same thing you did.",
            "author": null,
            "id": "g01fyc5",
            "parent_id": "t1_g00rhov",
            "score": 4,
            "created_utc": 1596328838.0,
            "replies": []
        },
        {
            "body": "Haha.. that you for the lovely reminder that I’m just twenty. ;)\n\nI just don’t think it’s the norm.. people may say that an affair de couer is what they want but I think that to most people, they learn that it takes more energy and even in a sr, has more of an emotional toll when it is based on love. Imagine for a moment, one of your SBs... perhaps you’re married, to another person or maybe to work, whatever way.. one of them probably never got over you. It takes a toll.. how many times can we be “in love” without feeling it? That’s the real question and I think that that puts the limit on how young most SBs are. How well can they handle understanding that who we love and how we love is never fair?\n\nI’m not saying that two people understanding that the love they share can’t last forever, I’m not saying that that is wrong or not beautiful. Only, that usually it’s not that simple and saying that sugar relationships are “ideal” in some way, is a mistake. \n\nI’m a romantic at heart though, so congratulations on your amazing SRs! ❤️\n\nEdit: you said in your comment that emotion is what sustains you… I think that that is true for me as well. It’s just that I wonder sometimes if having a “affair de couer” is the best way of satiating that need.",
            "author": "why_so_sexy_",
            "id": "g0226uu",
            "parent_id": "t1_g020pwc",
            "score": 2,
            "created_utc": 1596343000.0,
            "replies": [
                {
                    "body": "Oh, so much here! So much love, so much hope, so much...you.\n\nMy SGF (I did not use SB by design) asked me to write her a love letter. I closed it with:\n\n“This is sugar. It is always for now, never for ever\n\nOne day it will end, and you will break my heart. \n\nFor a while, the memory of our time together will be painfully.\n\nBut, with time, the pain will fade, and what I will be left with is\n\nThe love you have shown me\nThe joy you have given me\nThe man you have made me”\n\nThe love of any woman is sweet, but the love of a young woman, who gives herself to you, mentally and physically, is intoxicating. \n\nDon’t give up beautiful girl.",
                    "author": null,
                    "id": "g02x0hk",
                    "parent_id": "t1_g0226uu",
                    "score": 2,
                    "created_utc": 1596365794.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">For example, ménage à trois sounds so much more classy than \"threesome\"\n\nBut why? French is just another language, why not polish? or swedish?",
            "author": "Zealousideal-Web5898",
            "id": "g033eef",
            "parent_id": "t1_g032w5r",
            "score": 2,
            "created_utc": 1596369676.0,
            "replies": [
                {
                    "body": "Well, what is polish for threesome?",
                    "author": null,
                    "id": "g035qw1",
                    "parent_id": "t1_g033eef",
                    "score": 1,
                    "created_utc": 1596370881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahah! Im glad you think so. 😘",
            "author": null,
            "id": "g01nulv",
            "parent_id": "t1_g01navt",
            "score": 3,
            "created_utc": 1596333650.0,
            "replies": []
        },
        {
            "body": "I'm with you. I, actually, thoroughly enjoy when I have to ask the definition of a word when I'm talking with someone. Robust vocabularies somehow turn me on?",
            "author": "1SweetCheeks",
            "id": "g01728m",
            "parent_id": "t1_g010sd5",
            "score": 2,
            "created_utc": 1596323498.0,
            "replies": [
                {
                    "body": "Me too! Being well read is hella sexy.",
                    "author": "Mistress_Sassy",
                    "id": "g0qmvgl",
                    "parent_id": "t1_g01728m",
                    "score": 1,
                    "created_utc": 1596845819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I wish I knew what she looked like! I love this letter- thanks for posting",
            "author": null,
            "id": "g00u6y1",
            "parent_id": "t1_g00s5vh",
            "score": 6,
            "created_utc": 1596316073.0,
            "replies": [
                {
                    "body": "There's actually a picture or two of her in Google, I thought the same thing!",
                    "author": "yeehaw_yall",
                    "id": "g00viep",
                    "parent_id": "t1_g00u6y1",
                    "score": 5,
                    "created_utc": 1596316827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*sigh* Where we don’t worship taking clothes off with everything we do? Lol",
            "author": "why_so_sexy_",
            "id": "g035thq",
            "parent_id": "t1_g026dkl",
            "score": 1,
            "created_utc": 1596370917.0,
            "replies": []
        },
        {
            "body": "Oh, so much here! So much love, so much hope, so much...you.\n\nMy SGF (I did not use SB by design) asked me to write her a love letter. I closed it with:\n\n“This is sugar. It is always for now, never for ever\n\nOne day it will end, and you will break my heart. \n\nFor a while, the memory of our time together will be painfully.\n\nBut, with time, the pain will fade, and what I will be left with is\n\nThe love you have shown me\nThe joy you have given me\nThe man you have made me”\n\nThe love of any woman is sweet, but the love of a young woman, who gives herself to you, mentally and physically, is intoxicating. \n\nDon’t give up beautiful girl.",
            "author": null,
            "id": "g02x0hk",
            "parent_id": "t1_g0226uu",
            "score": 2,
            "created_utc": 1596365794.0,
            "replies": []
        },
        {
            "body": "Well, what is polish for threesome?",
            "author": null,
            "id": "g035qw1",
            "parent_id": "t1_g033eef",
            "score": 1,
            "created_utc": 1596370881.0,
            "replies": []
        },
        {
            "body": "Me too! Being well read is hella sexy.",
            "author": "Mistress_Sassy",
            "id": "g0qmvgl",
            "parent_id": "t1_g01728m",
            "score": 1,
            "created_utc": 1596845819.0,
            "replies": []
        },
        {
            "body": "There's actually a picture or two of her in Google, I thought the same thing!",
            "author": "yeehaw_yall",
            "id": "g00viep",
            "parent_id": "t1_g00u6y1",
            "score": 5,
            "created_utc": 1596316827.0,
            "replies": []
        }
    ]
}