{
    "title": "Pardon my nerd moment, but what would be the real life equivalent to this hairstyle?",
    "post_id": "kgc61a",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/kgc61a/pardon_my_nerd_moment_but_what_would_be_the_real/",
    "author": "AdenShadows",
    "body": "",
    "url": "https://i.redd.it/lss0cqcvj6661.jpg",
    "score": 316,
    "upvote_ratio": 0.97,
    "created_utc": 1608399465.0,
    "num_comments": 48,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It's giving me [Nikolaj Coster-Waldau](https://api.time.com/wp-content/uploads/2017/07/nikolaj-coster-waldau-jamie-lannister.jpg) vibes",
            "author": "pinkiepieinthesky",
            "id": "ggdxkhv",
            "parent_id": "t3_kgc61a",
            "score": 130,
            "created_utc": 1608403189.0,
            "replies": [
                {
                    "body": "It’s pronounced *Nikolaj.*",
                    "author": "isarl",
                    "id": "ggf7iaq",
                    "parent_id": "t1_ggdxkhv",
                    "score": 49,
                    "created_utc": 1608423481.0,
                    "replies": [
                        {
                            "body": "Nikolaj",
                            "author": "MyCanSeeYou",
                            "id": "ggf8yc5",
                            "parent_id": "t1_ggf7iaq",
                            "score": 25,
                            "created_utc": 1608424094.0,
                            "replies": [
                                {
                                    "body": "I really feel like I’m saying it",
                                    "author": "Schratzenholtzen",
                                    "id": "ggffz6a",
                                    "parent_id": "t1_ggf8yc5",
                                    "score": 21,
                                    "created_utc": 1608428114.0,
                                    "replies": [
                                        {
                                            "body": "Nikolaj",
                                            "author": "blazefire13",
                                            "id": "ggfyhah",
                                            "parent_id": "t1_ggffz6a",
                                            "score": 10,
                                            "created_utc": 1608439217.0,
                                            "replies": [
                                                {
                                                    "body": "Nee-kolaj",
                                                    "author": "michael14375",
                                                    "id": "ggg06fm",
                                                    "parent_id": "t1_ggfyhah",
                                                    "score": 9,
                                                    "created_utc": 1608440315.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Holy crap! Spitting image!",
                    "author": "AdenShadows",
                    "id": "gge0ayt",
                    "parent_id": "t1_ggdxkhv",
                    "score": 34,
                    "created_utc": 1608404615.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You must sell your child for this haircut.",
            "author": "Ronburgundy2099",
            "id": "ggdvphw",
            "parent_id": "t3_kgc61a",
            "score": 193,
            "created_utc": 1608402215.0,
            "replies": [
                {
                    "body": "Show them the picture, and that’s the cut you’ll get!",
                    "author": "SANcapITY",
                    "id": "gge1yvm",
                    "parent_id": "t1_ggdvphw",
                    "score": 47,
                    "created_utc": 1608405493.0,
                    "replies": []
                },
                {
                    "body": "haha!\nGreetings, fellow Bioshock fan!",
                    "author": "AdenShadows",
                    "id": "ggdvsmi",
                    "parent_id": "t1_ggdvphw",
                    "score": 25,
                    "created_utc": 1608402260.0,
                    "replies": [
                        {
                            "body": "Hello to you too mr Dewitt.",
                            "author": "Ronburgundy2099",
                            "id": "ggdvv7k",
                            "parent_id": "t1_ggdvsmi",
                            "score": 12,
                            "created_utc": 1608402297.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Bring us the picture and we’ll wipe your neck clean.",
                    "author": "ryanthelion4444",
                    "id": "gge2ctp",
                    "parent_id": "t1_ggdvphw",
                    "score": 16,
                    "created_utc": 1608405697.0,
                    "replies": [
                        {
                            "body": "might have to bring the girl to the barber to wipe the debt",
                            "author": null,
                            "id": "gge9x0f",
                            "parent_id": "t1_gge2ctp",
                            "score": 6,
                            "created_utc": 1608409653.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just a very normal side part haircut, styled down",
            "author": "beachballbrother",
            "id": "ggdun3c",
            "parent_id": "t3_kgc61a",
            "score": 52,
            "created_utc": 1608401707.0,
            "replies": []
        },
        {
            "body": "Umm, as a 35 year cosmetologist, in real life it would look the same on your head. It’s pretty close to real life. Just bring the drawing in with you.",
            "author": "beanner468",
            "id": "ggdu9ya",
            "parent_id": "t3_kgc61a",
            "score": 76,
            "created_utc": 1608401548.0,
            "replies": [
                {
                    "body": "Thanks! Do you think the sides are scissors or clippers?",
                    "author": "AdenShadows",
                    "id": "ggdusbm",
                    "parent_id": "t1_ggdu9ya",
                    "score": 22,
                    "created_utc": 1608401768.0,
                    "replies": [
                        {
                            "body": "It all depends on the experience of the person doing the cutting. I have 35 years of experience. I can do a cut with clippers over comb, or scissors over comb. I prefer scissors over comb, but if requested, I will do clippers. A barber will probably do clippers over comb, a hairdresser will probably do scissors over comb.",
                            "author": "beanner468",
                            "id": "gge19th",
                            "parent_id": "t1_ggdusbm",
                            "score": 28,
                            "created_utc": 1608405128.0,
                            "replies": [
                                {
                                    "body": "Hey, thank you for taking the time to elaborate!\nWhat would you say is done on top? Textured?",
                                    "author": "AdenShadows",
                                    "id": "gge20z3",
                                    "parent_id": "t1_gge19th",
                                    "score": 12,
                                    "created_utc": 1608405524.0,
                                    "replies": [
                                        {
                                            "body": "It’s highly texturized.",
                                            "author": "beanner468",
                                            "id": "gge69hs",
                                            "parent_id": "t1_gge20z3",
                                            "score": 5,
                                            "created_utc": 1608407718.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Definitely scissors",
                            "author": "ReplicaFlexer300",
                            "id": "ggdvdvd",
                            "parent_id": "t1_ggdusbm",
                            "score": 9,
                            "created_utc": 1608402049.0,
                            "replies": []
                        },
                        {
                            "body": "Definitely scissors. Someone here mentioned scissors or clipper over comb.. I dont think any version of 'over comb' is right, just need scissor & sectioning. If the barber whips out the clippers it would only be to taper out the neckline. Thats my opinion (as a barber who used to be a hairdresser). Someone else above posted a pic of Nikolaj C-W & I extremely doubt clippers went anywhere near his hair!",
                            "author": "Wild_Obligation",
                            "id": "ggffnjn",
                            "parent_id": "t1_ggdusbm",
                            "score": 1,
                            "created_utc": 1608427923.0,
                            "replies": [
                                {
                                    "body": "I have 35 years of experience. I could do this cut not only with scissors, AND clippers, I could do one side with the clippers and one side with scissors and make them match. I have both a cosmetologist license AND a barber license, along with having owned several salons. I highly doubt that you have the experience that I do, so maybe you shouldn’t judge.",
                                    "author": "beanner468",
                                    "id": "gghnlcl",
                                    "parent_id": "t1_ggffnjn",
                                    "score": 0,
                                    "created_utc": 1608480448.0,
                                    "replies": [
                                        {
                                            "body": "I was merely suggesting an alternative & how I would do it, I would assume based on 35 years experience you must be around 50 years old at least, yet your response is very immature. Also, if you view the response from the OP it is exactly why I suggest NOT using scissor or clipper over comb.. \"Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show\"",
                                            "author": "Wild_Obligation",
                                            "id": "gghyh66",
                                            "parent_id": "t1_gghnlcl",
                                            "score": 2,
                                            "created_utc": 1608486097.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe you should have stated it that way, which you did not. You can not make a suggestion that works for everyone. Continuing education is the most important part of my industry. Teaching is also a part of my life. I can’t speak for the cut that you received, as it can only be as good as the person giving the cut. It’s not the tool that’s used to execute the cut, it’s completely dependent on if that person is capable of translating what they hear, to your head, or what they see in a photo to your head. Try another salon, and another cutter. If you went to a barber, do the same.",
                                                    "author": "beanner468",
                                                    "id": "ggih54u",
                                                    "parent_id": "t1_gghyh66",
                                                    "score": 1,
                                                    "created_utc": 1608495253.0,
                                                    "replies": [
                                                        {
                                                            "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
                                                            "author": "Wild_Obligation",
                                                            "id": "ggiief0",
                                                            "parent_id": "t1_ggih54u",
                                                            "score": 1,
                                                            "created_utc": 1608495863.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                                                                    "author": "beanner468",
                                                                    "id": "ggip5dz",
                                                                    "parent_id": "t1_ggiief0",
                                                                    "score": 1,
                                                                    "created_utc": 1608499140.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                                                                            "author": "Wild_Obligation",
                                                                            "id": "ggix2d5",
                                                                            "parent_id": "t1_ggip5dz",
                                                                            "score": 1,
                                                                            "created_utc": 1608503131.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                                                                    "author": "beanner468",
                                                                                    "id": "ggj6h4v",
                                                                                    "parent_id": "t1_ggix2d5",
                                                                                    "score": 1,
                                                                                    "created_utc": 1608508029.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                                                                            "author": "Wild_Obligation",
                                                                                            "id": "ggj7nur",
                                                                                            "parent_id": "t1_ggj6h4v",
                                                                                            "score": 1,
                                                                                            "created_utc": 1608508654.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                                                                    "author": "beanner468",
                                                                                                    "id": "ggjghog",
                                                                                                    "parent_id": "t1_ggj7nur",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1608513354.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show. Luckily my sister who is a barber and stylist just moved back to town and she can cut it.",
                                    "author": "divuthen",
                                    "id": "ggg1a29",
                                    "parent_id": "t1_ggffnjn",
                                    "score": 1,
                                    "created_utc": 1608441077.0,
                                    "replies": [
                                        {
                                            "body": "Thats why I think sections & scissors is the best approach, it just gives a different direction/texture to using the over the comb method. You can overdirect sections and control length better when you have a solid guide line to follow. I would actually suggest you go to a hairdresser over a barber tbh",
                                            "author": "Wild_Obligation",
                                            "id": "gghyw3b",
                                            "parent_id": "t1_ggg1a29",
                                            "score": 2,
                                            "created_utc": 1608486305.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I used to have a real old school barber and he would do almost everything with scissors. But her was like 84 and finally retired. I personally like how scissor cut sides look way better than clippers unless your doing a fade down to skin.",
                                                    "author": "divuthen",
                                                    "id": "ggipbtb",
                                                    "parent_id": "t1_gghyw3b",
                                                    "score": 1,
                                                    "created_utc": 1608499228.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hairline isn't realistic tho, wtf is that narrow recess xD",
            "author": "NoScopeJustMe",
            "id": "gge2e00",
            "parent_id": "t3_kgc61a",
            "score": 19,
            "created_utc": 1608405715.0,
            "replies": [
                {
                    "body": "Fuck me I've never noticed that lol",
                    "author": "DDESTRUCTOTRON",
                    "id": "gge70vh",
                    "parent_id": "t1_gge2e00",
                    "score": 5,
                    "created_utc": 1608408114.0,
                    "replies": []
                },
                {
                    "body": "I used to have that a couple years ago, now I have more of a widow's peak though",
                    "author": "FPLGOD98",
                    "id": "ggefbk3",
                    "parent_id": "t1_gge2e00",
                    "score": 2,
                    "created_utc": 1608412294.0,
                    "replies": []
                },
                {
                    "body": "My hairline does that. So did my dads and my brothers do as well.",
                    "author": "divuthen",
                    "id": "ggg1hc9",
                    "parent_id": "t1_gge2e00",
                    "score": 1,
                    "created_utc": 1608441221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have this haircut. Pretty much.\n\nThe sides must shaved in a fade from a 3 down to a 1. Barber must use scisscors on the top, not a buzzer. Have the bangs reach down to the middle of your forehead. Tell him to blend the top of your hair into the 3 on the sides, leaving a little bit longer so you can push the hair behind your ears. \n\nThis hair is reflective of this but after a few weeks of growth. You need to be able to find your part line and use it (Gosling style) but not a super hard part line because it doesn't work with the look.\n\nAlso you need a good pomade, for this look I use Reuzel pink, best hold of any pomade I've ever bought.\n\nIf that's too complicated message me and we can chat.",
            "author": "adamsmith93",
            "id": "ggeujaq",
            "parent_id": "t3_kgc61a",
            "score": 4,
            "created_utc": 1608418293.0,
            "replies": []
        },
        {
            "body": "Honestly, makes me think of Chris Hemsworth haricut",
            "author": "tombm91",
            "id": "ggedd5i",
            "parent_id": "t3_kgc61a",
            "score": 3,
            "created_utc": 1608411486.0,
            "replies": []
        },
        {
            "body": "What game is this?",
            "author": null,
            "id": "ggfkfyg",
            "parent_id": "t3_kgc61a",
            "score": 3,
            "created_utc": 1608430687.0,
            "replies": [
                {
                    "body": "Bioshock Infinite. \nCharacter's name is Booker DeWitt.",
                    "author": "AdenShadows",
                    "id": "ggfklj1",
                    "parent_id": "t1_ggfkfyg",
                    "score": 8,
                    "created_utc": 1608430778.0,
                    "replies": []
                },
                {
                    "body": "Best game of all time",
                    "author": "Roso567",
                    "id": "ggi9uvp",
                    "parent_id": "t1_ggfkfyg",
                    "score": 3,
                    "created_utc": 1608491642.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Nathan Drake.",
            "author": "tibetan-sand-fox",
            "id": "ggez4q5",
            "parent_id": "t3_kgc61a",
            "score": 2,
            "created_utc": 1608420095.0,
            "replies": []
        },
        {
            "body": "Just go in and say, \"cut my hair just like everyone else\"",
            "author": "toychristopher",
            "id": "ggfi1k8",
            "parent_id": "t3_kgc61a",
            "score": 1,
            "created_utc": 1608429295.0,
            "replies": []
        },
        {
            "body": "Reminds me so much of Timothy Olifant",
            "author": "sonaglioc",
            "id": "ggf7d1l",
            "parent_id": "t3_kgc61a",
            "score": 1,
            "created_utc": 1608423425.0,
            "replies": []
        },
        {
            "body": "Like [this](https://i.pinimg.com/564x/92/92/a2/9292a268dd06a5beb946107fb2da1702.jpg)? [Short sides, long top with a side part](https://www.google.com/search?q=side+part+short+sides+long+top&tbm=isch&ved=2ahUKEwjnl7XFz9vtAhUJa60KHWhsCssQ2-cCegQIABAB&oq=side+part+short+sides+l&gs_lcp=ChJtb2JpbGUtZ3dzLXdpei1pbWcQARgBMgIIADICCAAyBggAEAgQHjIGCAAQCBAeMgUIIRCrAjoECAAQQzoGCAAQBxAeOgYIABAFEB46BAgAEB5QsK4BWIK3AWCGwAFoAnAAeACAAYABiAG6A5IBAzAuNJgBAKABAcABAQ&sclient=mobile-gws-wiz-img&ei=eMXeX-f7K4nWtQXo2KnYDA&bih=520&biw=360&client=ms-android-virgin-us)? Or an [undercut style](https://www.google.com/search?q=undercut+short+sides+long+top&tbm=isch&client=ms-android-virgin-us&hl=en&sa=X&ved=2ahUKEwir9p3Sz9vtAhUMcqwKHUuNClMQrNwCKAB6BQgBELYB&biw=360&bih=616)?",
            "author": "drunky_crowette",
            "id": "ggfrmot",
            "parent_id": "t3_kgc61a",
            "score": 1,
            "created_utc": 1608434973.0,
            "replies": []
        },
        {
            "body": "The Rachel Maddow",
            "author": "Moraghmackay",
            "id": "ggfvp2v",
            "parent_id": "t3_kgc61a",
            "score": 1,
            "created_utc": 1608437496.0,
            "replies": []
        },
        {
            "body": "It’s pronounced *Nikolaj.*",
            "author": "isarl",
            "id": "ggf7iaq",
            "parent_id": "t1_ggdxkhv",
            "score": 49,
            "created_utc": 1608423481.0,
            "replies": [
                {
                    "body": "Nikolaj",
                    "author": "MyCanSeeYou",
                    "id": "ggf8yc5",
                    "parent_id": "t1_ggf7iaq",
                    "score": 25,
                    "created_utc": 1608424094.0,
                    "replies": [
                        {
                            "body": "I really feel like I’m saying it",
                            "author": "Schratzenholtzen",
                            "id": "ggffz6a",
                            "parent_id": "t1_ggf8yc5",
                            "score": 21,
                            "created_utc": 1608428114.0,
                            "replies": [
                                {
                                    "body": "Nikolaj",
                                    "author": "blazefire13",
                                    "id": "ggfyhah",
                                    "parent_id": "t1_ggffz6a",
                                    "score": 10,
                                    "created_utc": 1608439217.0,
                                    "replies": [
                                        {
                                            "body": "Nee-kolaj",
                                            "author": "michael14375",
                                            "id": "ggg06fm",
                                            "parent_id": "t1_ggfyhah",
                                            "score": 9,
                                            "created_utc": 1608440315.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy crap! Spitting image!",
            "author": "AdenShadows",
            "id": "gge0ayt",
            "parent_id": "t1_ggdxkhv",
            "score": 34,
            "created_utc": 1608404615.0,
            "replies": []
        },
        {
            "body": "Show them the picture, and that’s the cut you’ll get!",
            "author": "SANcapITY",
            "id": "gge1yvm",
            "parent_id": "t1_ggdvphw",
            "score": 47,
            "created_utc": 1608405493.0,
            "replies": []
        },
        {
            "body": "haha!\nGreetings, fellow Bioshock fan!",
            "author": "AdenShadows",
            "id": "ggdvsmi",
            "parent_id": "t1_ggdvphw",
            "score": 25,
            "created_utc": 1608402260.0,
            "replies": [
                {
                    "body": "Hello to you too mr Dewitt.",
                    "author": "Ronburgundy2099",
                    "id": "ggdvv7k",
                    "parent_id": "t1_ggdvsmi",
                    "score": 12,
                    "created_utc": 1608402297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bring us the picture and we’ll wipe your neck clean.",
            "author": "ryanthelion4444",
            "id": "gge2ctp",
            "parent_id": "t1_ggdvphw",
            "score": 16,
            "created_utc": 1608405697.0,
            "replies": [
                {
                    "body": "might have to bring the girl to the barber to wipe the debt",
                    "author": null,
                    "id": "gge9x0f",
                    "parent_id": "t1_gge2ctp",
                    "score": 6,
                    "created_utc": 1608409653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks! Do you think the sides are scissors or clippers?",
            "author": "AdenShadows",
            "id": "ggdusbm",
            "parent_id": "t1_ggdu9ya",
            "score": 22,
            "created_utc": 1608401768.0,
            "replies": [
                {
                    "body": "It all depends on the experience of the person doing the cutting. I have 35 years of experience. I can do a cut with clippers over comb, or scissors over comb. I prefer scissors over comb, but if requested, I will do clippers. A barber will probably do clippers over comb, a hairdresser will probably do scissors over comb.",
                    "author": "beanner468",
                    "id": "gge19th",
                    "parent_id": "t1_ggdusbm",
                    "score": 28,
                    "created_utc": 1608405128.0,
                    "replies": [
                        {
                            "body": "Hey, thank you for taking the time to elaborate!\nWhat would you say is done on top? Textured?",
                            "author": "AdenShadows",
                            "id": "gge20z3",
                            "parent_id": "t1_gge19th",
                            "score": 12,
                            "created_utc": 1608405524.0,
                            "replies": [
                                {
                                    "body": "It’s highly texturized.",
                                    "author": "beanner468",
                                    "id": "gge69hs",
                                    "parent_id": "t1_gge20z3",
                                    "score": 5,
                                    "created_utc": 1608407718.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Definitely scissors",
                    "author": "ReplicaFlexer300",
                    "id": "ggdvdvd",
                    "parent_id": "t1_ggdusbm",
                    "score": 9,
                    "created_utc": 1608402049.0,
                    "replies": []
                },
                {
                    "body": "Definitely scissors. Someone here mentioned scissors or clipper over comb.. I dont think any version of 'over comb' is right, just need scissor & sectioning. If the barber whips out the clippers it would only be to taper out the neckline. Thats my opinion (as a barber who used to be a hairdresser). Someone else above posted a pic of Nikolaj C-W & I extremely doubt clippers went anywhere near his hair!",
                    "author": "Wild_Obligation",
                    "id": "ggffnjn",
                    "parent_id": "t1_ggdusbm",
                    "score": 1,
                    "created_utc": 1608427923.0,
                    "replies": [
                        {
                            "body": "I have 35 years of experience. I could do this cut not only with scissors, AND clippers, I could do one side with the clippers and one side with scissors and make them match. I have both a cosmetologist license AND a barber license, along with having owned several salons. I highly doubt that you have the experience that I do, so maybe you shouldn’t judge.",
                            "author": "beanner468",
                            "id": "gghnlcl",
                            "parent_id": "t1_ggffnjn",
                            "score": 0,
                            "created_utc": 1608480448.0,
                            "replies": [
                                {
                                    "body": "I was merely suggesting an alternative & how I would do it, I would assume based on 35 years experience you must be around 50 years old at least, yet your response is very immature. Also, if you view the response from the OP it is exactly why I suggest NOT using scissor or clipper over comb.. \"Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show\"",
                                    "author": "Wild_Obligation",
                                    "id": "gghyh66",
                                    "parent_id": "t1_gghnlcl",
                                    "score": 2,
                                    "created_utc": 1608486097.0,
                                    "replies": [
                                        {
                                            "body": "Maybe you should have stated it that way, which you did not. You can not make a suggestion that works for everyone. Continuing education is the most important part of my industry. Teaching is also a part of my life. I can’t speak for the cut that you received, as it can only be as good as the person giving the cut. It’s not the tool that’s used to execute the cut, it’s completely dependent on if that person is capable of translating what they hear, to your head, or what they see in a photo to your head. Try another salon, and another cutter. If you went to a barber, do the same.",
                                            "author": "beanner468",
                                            "id": "ggih54u",
                                            "parent_id": "t1_gghyh66",
                                            "score": 1,
                                            "created_utc": 1608495253.0,
                                            "replies": [
                                                {
                                                    "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
                                                    "author": "Wild_Obligation",
                                                    "id": "ggiief0",
                                                    "parent_id": "t1_ggih54u",
                                                    "score": 1,
                                                    "created_utc": 1608495863.0,
                                                    "replies": [
                                                        {
                                                            "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                                                            "author": "beanner468",
                                                            "id": "ggip5dz",
                                                            "parent_id": "t1_ggiief0",
                                                            "score": 1,
                                                            "created_utc": 1608499140.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                                                                    "author": "Wild_Obligation",
                                                                    "id": "ggix2d5",
                                                                    "parent_id": "t1_ggip5dz",
                                                                    "score": 1,
                                                                    "created_utc": 1608503131.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                                                            "author": "beanner468",
                                                                            "id": "ggj6h4v",
                                                                            "parent_id": "t1_ggix2d5",
                                                                            "score": 1,
                                                                            "created_utc": 1608508029.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                                                                    "author": "Wild_Obligation",
                                                                                    "id": "ggj7nur",
                                                                                    "parent_id": "t1_ggj6h4v",
                                                                                    "score": 1,
                                                                                    "created_utc": 1608508654.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                                                            "author": "beanner468",
                                                                                            "id": "ggjghog",
                                                                                            "parent_id": "t1_ggj7nur",
                                                                                            "score": 1,
                                                                                            "created_utc": 1608513354.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show. Luckily my sister who is a barber and stylist just moved back to town and she can cut it.",
                            "author": "divuthen",
                            "id": "ggg1a29",
                            "parent_id": "t1_ggffnjn",
                            "score": 1,
                            "created_utc": 1608441077.0,
                            "replies": [
                                {
                                    "body": "Thats why I think sections & scissors is the best approach, it just gives a different direction/texture to using the over the comb method. You can overdirect sections and control length better when you have a solid guide line to follow. I would actually suggest you go to a hairdresser over a barber tbh",
                                    "author": "Wild_Obligation",
                                    "id": "gghyw3b",
                                    "parent_id": "t1_ggg1a29",
                                    "score": 2,
                                    "created_utc": 1608486305.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I used to have a real old school barber and he would do almost everything with scissors. But her was like 84 and finally retired. I personally like how scissor cut sides look way better than clippers unless your doing a fade down to skin.",
                                            "author": "divuthen",
                                            "id": "ggipbtb",
                                            "parent_id": "t1_gghyw3b",
                                            "score": 1,
                                            "created_utc": 1608499228.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fuck me I've never noticed that lol",
            "author": "DDESTRUCTOTRON",
            "id": "gge70vh",
            "parent_id": "t1_gge2e00",
            "score": 5,
            "created_utc": 1608408114.0,
            "replies": []
        },
        {
            "body": "I used to have that a couple years ago, now I have more of a widow's peak though",
            "author": "FPLGOD98",
            "id": "ggefbk3",
            "parent_id": "t1_gge2e00",
            "score": 2,
            "created_utc": 1608412294.0,
            "replies": []
        },
        {
            "body": "My hairline does that. So did my dads and my brothers do as well.",
            "author": "divuthen",
            "id": "ggg1hc9",
            "parent_id": "t1_gge2e00",
            "score": 1,
            "created_utc": 1608441221.0,
            "replies": []
        },
        {
            "body": "Bioshock Infinite. \nCharacter's name is Booker DeWitt.",
            "author": "AdenShadows",
            "id": "ggfklj1",
            "parent_id": "t1_ggfkfyg",
            "score": 8,
            "created_utc": 1608430778.0,
            "replies": []
        },
        {
            "body": "Best game of all time",
            "author": "Roso567",
            "id": "ggi9uvp",
            "parent_id": "t1_ggfkfyg",
            "score": 3,
            "created_utc": 1608491642.0,
            "replies": []
        },
        {
            "body": "Nikolaj",
            "author": "MyCanSeeYou",
            "id": "ggf8yc5",
            "parent_id": "t1_ggf7iaq",
            "score": 25,
            "created_utc": 1608424094.0,
            "replies": [
                {
                    "body": "I really feel like I’m saying it",
                    "author": "Schratzenholtzen",
                    "id": "ggffz6a",
                    "parent_id": "t1_ggf8yc5",
                    "score": 21,
                    "created_utc": 1608428114.0,
                    "replies": [
                        {
                            "body": "Nikolaj",
                            "author": "blazefire13",
                            "id": "ggfyhah",
                            "parent_id": "t1_ggffz6a",
                            "score": 10,
                            "created_utc": 1608439217.0,
                            "replies": [
                                {
                                    "body": "Nee-kolaj",
                                    "author": "michael14375",
                                    "id": "ggg06fm",
                                    "parent_id": "t1_ggfyhah",
                                    "score": 9,
                                    "created_utc": 1608440315.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hello to you too mr Dewitt.",
            "author": "Ronburgundy2099",
            "id": "ggdvv7k",
            "parent_id": "t1_ggdvsmi",
            "score": 12,
            "created_utc": 1608402297.0,
            "replies": []
        },
        {
            "body": "might have to bring the girl to the barber to wipe the debt",
            "author": null,
            "id": "gge9x0f",
            "parent_id": "t1_gge2ctp",
            "score": 6,
            "created_utc": 1608409653.0,
            "replies": []
        },
        {
            "body": "It all depends on the experience of the person doing the cutting. I have 35 years of experience. I can do a cut with clippers over comb, or scissors over comb. I prefer scissors over comb, but if requested, I will do clippers. A barber will probably do clippers over comb, a hairdresser will probably do scissors over comb.",
            "author": "beanner468",
            "id": "gge19th",
            "parent_id": "t1_ggdusbm",
            "score": 28,
            "created_utc": 1608405128.0,
            "replies": [
                {
                    "body": "Hey, thank you for taking the time to elaborate!\nWhat would you say is done on top? Textured?",
                    "author": "AdenShadows",
                    "id": "gge20z3",
                    "parent_id": "t1_gge19th",
                    "score": 12,
                    "created_utc": 1608405524.0,
                    "replies": [
                        {
                            "body": "It’s highly texturized.",
                            "author": "beanner468",
                            "id": "gge69hs",
                            "parent_id": "t1_gge20z3",
                            "score": 5,
                            "created_utc": 1608407718.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely scissors",
            "author": "ReplicaFlexer300",
            "id": "ggdvdvd",
            "parent_id": "t1_ggdusbm",
            "score": 9,
            "created_utc": 1608402049.0,
            "replies": []
        },
        {
            "body": "Definitely scissors. Someone here mentioned scissors or clipper over comb.. I dont think any version of 'over comb' is right, just need scissor & sectioning. If the barber whips out the clippers it would only be to taper out the neckline. Thats my opinion (as a barber who used to be a hairdresser). Someone else above posted a pic of Nikolaj C-W & I extremely doubt clippers went anywhere near his hair!",
            "author": "Wild_Obligation",
            "id": "ggffnjn",
            "parent_id": "t1_ggdusbm",
            "score": 1,
            "created_utc": 1608427923.0,
            "replies": [
                {
                    "body": "I have 35 years of experience. I could do this cut not only with scissors, AND clippers, I could do one side with the clippers and one side with scissors and make them match. I have both a cosmetologist license AND a barber license, along with having owned several salons. I highly doubt that you have the experience that I do, so maybe you shouldn’t judge.",
                    "author": "beanner468",
                    "id": "gghnlcl",
                    "parent_id": "t1_ggffnjn",
                    "score": 0,
                    "created_utc": 1608480448.0,
                    "replies": [
                        {
                            "body": "I was merely suggesting an alternative & how I would do it, I would assume based on 35 years experience you must be around 50 years old at least, yet your response is very immature. Also, if you view the response from the OP it is exactly why I suggest NOT using scissor or clipper over comb.. \"Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show\"",
                            "author": "Wild_Obligation",
                            "id": "gghyh66",
                            "parent_id": "t1_gghnlcl",
                            "score": 2,
                            "created_utc": 1608486097.0,
                            "replies": [
                                {
                                    "body": "Maybe you should have stated it that way, which you did not. You can not make a suggestion that works for everyone. Continuing education is the most important part of my industry. Teaching is also a part of my life. I can’t speak for the cut that you received, as it can only be as good as the person giving the cut. It’s not the tool that’s used to execute the cut, it’s completely dependent on if that person is capable of translating what they hear, to your head, or what they see in a photo to your head. Try another salon, and another cutter. If you went to a barber, do the same.",
                                    "author": "beanner468",
                                    "id": "ggih54u",
                                    "parent_id": "t1_gghyh66",
                                    "score": 1,
                                    "created_utc": 1608495253.0,
                                    "replies": [
                                        {
                                            "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
                                            "author": "Wild_Obligation",
                                            "id": "ggiief0",
                                            "parent_id": "t1_ggih54u",
                                            "score": 1,
                                            "created_utc": 1608495863.0,
                                            "replies": [
                                                {
                                                    "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                                                    "author": "beanner468",
                                                    "id": "ggip5dz",
                                                    "parent_id": "t1_ggiief0",
                                                    "score": 1,
                                                    "created_utc": 1608499140.0,
                                                    "replies": [
                                                        {
                                                            "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                                                            "author": "Wild_Obligation",
                                                            "id": "ggix2d5",
                                                            "parent_id": "t1_ggip5dz",
                                                            "score": 1,
                                                            "created_utc": 1608503131.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                                                    "author": "beanner468",
                                                                    "id": "ggj6h4v",
                                                                    "parent_id": "t1_ggix2d5",
                                                                    "score": 1,
                                                                    "created_utc": 1608508029.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                                                            "author": "Wild_Obligation",
                                                                            "id": "ggj7nur",
                                                                            "parent_id": "t1_ggj6h4v",
                                                                            "score": 1,
                                                                            "created_utc": 1608508654.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                                                    "author": "beanner468",
                                                                                    "id": "ggjghog",
                                                                                    "parent_id": "t1_ggj7nur",
                                                                                    "score": 1,
                                                                                    "created_utc": 1608513354.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show. Luckily my sister who is a barber and stylist just moved back to town and she can cut it.",
                    "author": "divuthen",
                    "id": "ggg1a29",
                    "parent_id": "t1_ggffnjn",
                    "score": 1,
                    "created_utc": 1608441077.0,
                    "replies": [
                        {
                            "body": "Thats why I think sections & scissors is the best approach, it just gives a different direction/texture to using the over the comb method. You can overdirect sections and control length better when you have a solid guide line to follow. I would actually suggest you go to a hairdresser over a barber tbh",
                            "author": "Wild_Obligation",
                            "id": "gghyw3b",
                            "parent_id": "t1_ggg1a29",
                            "score": 2,
                            "created_utc": 1608486305.0,
                            "replies": [
                                {
                                    "body": "Yeah I used to have a real old school barber and he would do almost everything with scissors. But her was like 84 and finally retired. I personally like how scissor cut sides look way better than clippers unless your doing a fade down to skin.",
                                    "author": "divuthen",
                                    "id": "ggipbtb",
                                    "parent_id": "t1_gghyw3b",
                                    "score": 1,
                                    "created_utc": 1608499228.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really feel like I’m saying it",
            "author": "Schratzenholtzen",
            "id": "ggffz6a",
            "parent_id": "t1_ggf8yc5",
            "score": 21,
            "created_utc": 1608428114.0,
            "replies": [
                {
                    "body": "Nikolaj",
                    "author": "blazefire13",
                    "id": "ggfyhah",
                    "parent_id": "t1_ggffz6a",
                    "score": 10,
                    "created_utc": 1608439217.0,
                    "replies": [
                        {
                            "body": "Nee-kolaj",
                            "author": "michael14375",
                            "id": "ggg06fm",
                            "parent_id": "t1_ggfyhah",
                            "score": 9,
                            "created_utc": 1608440315.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey, thank you for taking the time to elaborate!\nWhat would you say is done on top? Textured?",
            "author": "AdenShadows",
            "id": "gge20z3",
            "parent_id": "t1_gge19th",
            "score": 12,
            "created_utc": 1608405524.0,
            "replies": [
                {
                    "body": "It’s highly texturized.",
                    "author": "beanner468",
                    "id": "gge69hs",
                    "parent_id": "t1_gge20z3",
                    "score": 5,
                    "created_utc": 1608407718.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have 35 years of experience. I could do this cut not only with scissors, AND clippers, I could do one side with the clippers and one side with scissors and make them match. I have both a cosmetologist license AND a barber license, along with having owned several salons. I highly doubt that you have the experience that I do, so maybe you shouldn’t judge.",
            "author": "beanner468",
            "id": "gghnlcl",
            "parent_id": "t1_ggffnjn",
            "score": 0,
            "created_utc": 1608480448.0,
            "replies": [
                {
                    "body": "I was merely suggesting an alternative & how I would do it, I would assume based on 35 years experience you must be around 50 years old at least, yet your response is very immature. Also, if you view the response from the OP it is exactly why I suggest NOT using scissor or clipper over comb.. \"Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show\"",
                    "author": "Wild_Obligation",
                    "id": "gghyh66",
                    "parent_id": "t1_gghnlcl",
                    "score": 2,
                    "created_utc": 1608486097.0,
                    "replies": [
                        {
                            "body": "Maybe you should have stated it that way, which you did not. You can not make a suggestion that works for everyone. Continuing education is the most important part of my industry. Teaching is also a part of my life. I can’t speak for the cut that you received, as it can only be as good as the person giving the cut. It’s not the tool that’s used to execute the cut, it’s completely dependent on if that person is capable of translating what they hear, to your head, or what they see in a photo to your head. Try another salon, and another cutter. If you went to a barber, do the same.",
                            "author": "beanner468",
                            "id": "ggih54u",
                            "parent_id": "t1_gghyh66",
                            "score": 1,
                            "created_utc": 1608495253.0,
                            "replies": [
                                {
                                    "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
                                    "author": "Wild_Obligation",
                                    "id": "ggiief0",
                                    "parent_id": "t1_ggih54u",
                                    "score": 1,
                                    "created_utc": 1608495863.0,
                                    "replies": [
                                        {
                                            "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                                            "author": "beanner468",
                                            "id": "ggip5dz",
                                            "parent_id": "t1_ggiief0",
                                            "score": 1,
                                            "created_utc": 1608499140.0,
                                            "replies": [
                                                {
                                                    "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                                                    "author": "Wild_Obligation",
                                                    "id": "ggix2d5",
                                                    "parent_id": "t1_ggip5dz",
                                                    "score": 1,
                                                    "created_utc": 1608503131.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                                            "author": "beanner468",
                                                            "id": "ggj6h4v",
                                                            "parent_id": "t1_ggix2d5",
                                                            "score": 1,
                                                            "created_utc": 1608508029.0,
                                                            "replies": [
                                                                {
                                                                    "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                                                    "author": "Wild_Obligation",
                                                                    "id": "ggj7nur",
                                                                    "parent_id": "t1_ggj6h4v",
                                                                    "score": 1,
                                                                    "created_utc": 1608508654.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                                            "author": "beanner468",
                                                                            "id": "ggjghog",
                                                                            "parent_id": "t1_ggj7nur",
                                                                            "score": 1,
                                                                            "created_utc": 1608513354.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show. Luckily my sister who is a barber and stylist just moved back to town and she can cut it.",
            "author": "divuthen",
            "id": "ggg1a29",
            "parent_id": "t1_ggffnjn",
            "score": 1,
            "created_utc": 1608441077.0,
            "replies": [
                {
                    "body": "Thats why I think sections & scissors is the best approach, it just gives a different direction/texture to using the over the comb method. You can overdirect sections and control length better when you have a solid guide line to follow. I would actually suggest you go to a hairdresser over a barber tbh",
                    "author": "Wild_Obligation",
                    "id": "gghyw3b",
                    "parent_id": "t1_ggg1a29",
                    "score": 2,
                    "created_utc": 1608486305.0,
                    "replies": [
                        {
                            "body": "Yeah I used to have a real old school barber and he would do almost everything with scissors. But her was like 84 and finally retired. I personally like how scissor cut sides look way better than clippers unless your doing a fade down to skin.",
                            "author": "divuthen",
                            "id": "ggipbtb",
                            "parent_id": "t1_gghyw3b",
                            "score": 1,
                            "created_utc": 1608499228.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nikolaj",
            "author": "blazefire13",
            "id": "ggfyhah",
            "parent_id": "t1_ggffz6a",
            "score": 10,
            "created_utc": 1608439217.0,
            "replies": [
                {
                    "body": "Nee-kolaj",
                    "author": "michael14375",
                    "id": "ggg06fm",
                    "parent_id": "t1_ggfyhah",
                    "score": 9,
                    "created_utc": 1608440315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s highly texturized.",
            "author": "beanner468",
            "id": "gge69hs",
            "parent_id": "t1_gge20z3",
            "score": 5,
            "created_utc": 1608407718.0,
            "replies": []
        },
        {
            "body": "I was merely suggesting an alternative & how I would do it, I would assume based on 35 years experience you must be around 50 years old at least, yet your response is very immature. Also, if you view the response from the OP it is exactly why I suggest NOT using scissor or clipper over comb.. \"Yeah this is the kind of sides I wanted last time I got my hair cut. And before I could say anything those clippers were cutting. I’m like well guess I’m getting a fade now awesome. Then she cut each section to length then faded them out and by the time she was done it was way shorter than I wanted and higher up, just a total shit show\"",
            "author": "Wild_Obligation",
            "id": "gghyh66",
            "parent_id": "t1_gghnlcl",
            "score": 2,
            "created_utc": 1608486097.0,
            "replies": [
                {
                    "body": "Maybe you should have stated it that way, which you did not. You can not make a suggestion that works for everyone. Continuing education is the most important part of my industry. Teaching is also a part of my life. I can’t speak for the cut that you received, as it can only be as good as the person giving the cut. It’s not the tool that’s used to execute the cut, it’s completely dependent on if that person is capable of translating what they hear, to your head, or what they see in a photo to your head. Try another salon, and another cutter. If you went to a barber, do the same.",
                    "author": "beanner468",
                    "id": "ggih54u",
                    "parent_id": "t1_gghyh66",
                    "score": 1,
                    "created_utc": 1608495253.0,
                    "replies": [
                        {
                            "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
                            "author": "Wild_Obligation",
                            "id": "ggiief0",
                            "parent_id": "t1_ggih54u",
                            "score": 1,
                            "created_utc": 1608495863.0,
                            "replies": [
                                {
                                    "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                                    "author": "beanner468",
                                    "id": "ggip5dz",
                                    "parent_id": "t1_ggiief0",
                                    "score": 1,
                                    "created_utc": 1608499140.0,
                                    "replies": [
                                        {
                                            "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                                            "author": "Wild_Obligation",
                                            "id": "ggix2d5",
                                            "parent_id": "t1_ggip5dz",
                                            "score": 1,
                                            "created_utc": 1608503131.0,
                                            "replies": [
                                                {
                                                    "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                                    "author": "beanner468",
                                                    "id": "ggj6h4v",
                                                    "parent_id": "t1_ggix2d5",
                                                    "score": 1,
                                                    "created_utc": 1608508029.0,
                                                    "replies": [
                                                        {
                                                            "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                                            "author": "Wild_Obligation",
                                                            "id": "ggj7nur",
                                                            "parent_id": "t1_ggj6h4v",
                                                            "score": 1,
                                                            "created_utc": 1608508654.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                                    "author": "beanner468",
                                                                    "id": "ggjghog",
                                                                    "parent_id": "t1_ggj7nur",
                                                                    "score": 1,
                                                                    "created_utc": 1608513354.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thats why I think sections & scissors is the best approach, it just gives a different direction/texture to using the over the comb method. You can overdirect sections and control length better when you have a solid guide line to follow. I would actually suggest you go to a hairdresser over a barber tbh",
            "author": "Wild_Obligation",
            "id": "gghyw3b",
            "parent_id": "t1_ggg1a29",
            "score": 2,
            "created_utc": 1608486305.0,
            "replies": [
                {
                    "body": "Yeah I used to have a real old school barber and he would do almost everything with scissors. But her was like 84 and finally retired. I personally like how scissor cut sides look way better than clippers unless your doing a fade down to skin.",
                    "author": "divuthen",
                    "id": "ggipbtb",
                    "parent_id": "t1_gghyw3b",
                    "score": 1,
                    "created_utc": 1608499228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nee-kolaj",
            "author": "michael14375",
            "id": "ggg06fm",
            "parent_id": "t1_ggfyhah",
            "score": 9,
            "created_utc": 1608440315.0,
            "replies": []
        },
        {
            "body": "Maybe you should have stated it that way, which you did not. You can not make a suggestion that works for everyone. Continuing education is the most important part of my industry. Teaching is also a part of my life. I can’t speak for the cut that you received, as it can only be as good as the person giving the cut. It’s not the tool that’s used to execute the cut, it’s completely dependent on if that person is capable of translating what they hear, to your head, or what they see in a photo to your head. Try another salon, and another cutter. If you went to a barber, do the same.",
            "author": "beanner468",
            "id": "ggih54u",
            "parent_id": "t1_gghyh66",
            "score": 1,
            "created_utc": 1608495253.0,
            "replies": [
                {
                    "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
                    "author": "Wild_Obligation",
                    "id": "ggiief0",
                    "parent_id": "t1_ggih54u",
                    "score": 1,
                    "created_utc": 1608495863.0,
                    "replies": [
                        {
                            "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                            "author": "beanner468",
                            "id": "ggip5dz",
                            "parent_id": "t1_ggiief0",
                            "score": 1,
                            "created_utc": 1608499140.0,
                            "replies": [
                                {
                                    "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                                    "author": "Wild_Obligation",
                                    "id": "ggix2d5",
                                    "parent_id": "t1_ggip5dz",
                                    "score": 1,
                                    "created_utc": 1608503131.0,
                                    "replies": [
                                        {
                                            "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                            "author": "beanner468",
                                            "id": "ggj6h4v",
                                            "parent_id": "t1_ggix2d5",
                                            "score": 1,
                                            "created_utc": 1608508029.0,
                                            "replies": [
                                                {
                                                    "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                                    "author": "Wild_Obligation",
                                                    "id": "ggj7nur",
                                                    "parent_id": "t1_ggj6h4v",
                                                    "score": 1,
                                                    "created_utc": 1608508654.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                            "author": "beanner468",
                                                            "id": "ggjghog",
                                                            "parent_id": "t1_ggj7nur",
                                                            "score": 1,
                                                            "created_utc": 1608513354.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I used to have a real old school barber and he would do almost everything with scissors. But her was like 84 and finally retired. I personally like how scissor cut sides look way better than clippers unless your doing a fade down to skin.",
            "author": "divuthen",
            "id": "ggipbtb",
            "parent_id": "t1_gghyw3b",
            "score": 1,
            "created_utc": 1608499228.0,
            "replies": []
        },
        {
            "body": "I apologise, before I respond to another users comment I will firstly clarify that it is the internet and that strangers should not take it personally.. & you seem to be taking this very personally for some reason. You have also made a mistake, I am not the one after the cut I was merely suggesting an approach to doing the cut. Please don't take comments online by strangers to heart so much, its not healthy & neither is having a dick measuring contest.",
            "author": "Wild_Obligation",
            "id": "ggiief0",
            "parent_id": "t1_ggih54u",
            "score": 1,
            "created_utc": 1608495863.0,
            "replies": [
                {
                    "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
                    "author": "beanner468",
                    "id": "ggip5dz",
                    "parent_id": "t1_ggiief0",
                    "score": 1,
                    "created_utc": 1608499140.0,
                    "replies": [
                        {
                            "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                            "author": "Wild_Obligation",
                            "id": "ggix2d5",
                            "parent_id": "t1_ggip5dz",
                            "score": 1,
                            "created_utc": 1608503131.0,
                            "replies": [
                                {
                                    "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                                    "author": "beanner468",
                                    "id": "ggj6h4v",
                                    "parent_id": "t1_ggix2d5",
                                    "score": 1,
                                    "created_utc": 1608508029.0,
                                    "replies": [
                                        {
                                            "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                            "author": "Wild_Obligation",
                                            "id": "ggj7nur",
                                            "parent_id": "t1_ggj6h4v",
                                            "score": 1,
                                            "created_utc": 1608508654.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                                    "author": "beanner468",
                                                    "id": "ggjghog",
                                                    "parent_id": "t1_ggj7nur",
                                                    "score": 1,
                                                    "created_utc": 1608513354.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess I should tell you that I don’t have a dick. Because you were nice enough to apologize, I will also apologize. When you suggested how to do the cut, you directly discredited what I said. Had you simply said here is a different way, or this is how I would do it, maybe I would have felt different. The vibe I got was you don’t even do hair, which I think sausage lot. The sides of this cut are actually not long enough to fit a finger to cut over. It doesn’t mean that you could ask to have the sides done a touch longer to have them cut that way, but it isn’t the way the art was done. When a laymen tells me how to do my job , it can feel personal. Sue me.",
            "author": "beanner468",
            "id": "ggip5dz",
            "parent_id": "t1_ggiief0",
            "score": 1,
            "created_utc": 1608499140.0,
            "replies": [
                {
                    "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
                    "author": "Wild_Obligation",
                    "id": "ggix2d5",
                    "parent_id": "t1_ggip5dz",
                    "score": 1,
                    "created_utc": 1608503131.0,
                    "replies": [
                        {
                            "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                            "author": "beanner468",
                            "id": "ggj6h4v",
                            "parent_id": "t1_ggix2d5",
                            "score": 1,
                            "created_utc": 1608508029.0,
                            "replies": [
                                {
                                    "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                                    "author": "Wild_Obligation",
                                    "id": "ggj7nur",
                                    "parent_id": "t1_ggj6h4v",
                                    "score": 1,
                                    "created_utc": 1608508654.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                            "author": "beanner468",
                                            "id": "ggjghog",
                                            "parent_id": "t1_ggj7nur",
                                            "score": 1,
                                            "created_utc": 1608513354.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay but I do hair lol Level 4 NVQ hairdressing & Level 3 NVQ Barbering. The dick thing is just an expression",
            "author": "Wild_Obligation",
            "id": "ggix2d5",
            "parent_id": "t1_ggip5dz",
            "score": 1,
            "created_utc": 1608503131.0,
            "replies": [
                {
                    "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
                    "author": "beanner468",
                    "id": "ggj6h4v",
                    "parent_id": "t1_ggix2d5",
                    "score": 1,
                    "created_utc": 1608508029.0,
                    "replies": [
                        {
                            "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                            "author": "Wild_Obligation",
                            "id": "ggj7nur",
                            "parent_id": "t1_ggj6h4v",
                            "score": 1,
                            "created_utc": 1608508654.0,
                            "replies": [
                                {
                                    "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                                    "author": "beanner468",
                                    "id": "ggjghog",
                                    "parent_id": "t1_ggj7nur",
                                    "score": 1,
                                    "created_utc": 1608513354.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you do hair, then you should be able to see that the sides a 1/4”, and know that a finger is about 1/2”. So, how do you plan to do the sides? Those levels mean nothing to me, LOL.",
            "author": "beanner468",
            "id": "ggj6h4v",
            "parent_id": "t1_ggix2d5",
            "score": 1,
            "created_utc": 1608508029.0,
            "replies": [
                {
                    "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
                    "author": "Wild_Obligation",
                    "id": "ggj7nur",
                    "parent_id": "t1_ggj6h4v",
                    "score": 1,
                    "created_utc": 1608508654.0,
                    "replies": [
                        {
                            "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                            "author": "beanner468",
                            "id": "ggjghog",
                            "parent_id": "t1_ggj7nur",
                            "score": 1,
                            "created_utc": 1608513354.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "NVQ in Hairdressing is the recognised qualification you need to be employed in the U.K. The highest level is 4, which allows you to teach the different levels of NVQ to assistants or stylists within salons & is always held by senior stylists, the highest level within the hairdressing industry here in the UK. I hope you you can appreciate this comment without feeling the need to respond in another childish manner. Seriously, how old are you because you come across like you have the maturity of a teenager? You obviously can’t have a rational & adult interaction so I’m not wasting anymore time responding to you... at least now you know what an NVQ in Hairdressing is, a qualification that is dedicated to hair, unlike the ‘jack of all trades, master of none’ cosmetology license. Peace out",
            "author": "Wild_Obligation",
            "id": "ggj7nur",
            "parent_id": "t1_ggj6h4v",
            "score": 1,
            "created_utc": 1608508654.0,
            "replies": [
                {
                    "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
                    "author": "beanner468",
                    "id": "ggjghog",
                    "parent_id": "t1_ggj7nur",
                    "score": 1,
                    "created_utc": 1608513354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn’t say I didn’t understand it, I said it means NOTHING TO ME.",
            "author": "beanner468",
            "id": "ggjghog",
            "parent_id": "t1_ggj7nur",
            "score": 1,
            "created_utc": 1608513354.0,
            "replies": []
        }
    ]
}