{
    "title": "[NEWS] Lee Kwangsoo will be guesting on 《Game Caterers》!",
    "post_id": "yb6ryi",
    "post_url": "https://www.reddit.com/r/runningman/comments/yb6ryi/news_lee_kwangsoo_will_be_guesting_on_game/",
    "author": "Deroucadetoo",
    "body": "",
    "url": "https://v.redd.it/6nkk7s365hv91",
    "score": 209,
    "upvote_ratio": 0.97,
    "created_utc": 1666495509.0,
    "num_comments": 53,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Ok jeez I almost had a heart attack... 😶",
            "author": null,
            "id": "itezzge",
            "parent_id": "t3_yb6ryi",
            "score": 27,
            "created_utc": 1666496068.0,
            "replies": []
        },
        {
            "body": "Isn't Somin of the same agency?\n\nEither she's been ignored or she's really busy.\n\nI hope that the second part is true that she is busy to make it time for this program.",
            "author": "NavdeepNSG",
            "id": "itf631r",
            "parent_id": "t3_yb6ryi",
            "score": 16,
            "created_utc": 1666499760.0,
            "replies": [
                {
                    "body": "I think this is recorded on the same day as Running Man. (2 days 1 night, maybe one day falls on the same day as RM shooting?) \n\nOtherwise, that's really sus and makes me think the reason she's not there is because LKS is there and I hate that idea and don't ever want that to be true. I secretly wanna know what went down but at the same time I'm not at all ready or want there to be any actual stuff that went down so I'd rather just pretend nothing is wrong and they are secretly still good friends. 🤷‍♀️",
                    "author": null,
                    "id": "itf85mb",
                    "parent_id": "t1_itf631r",
                    "score": 16,
                    "created_utc": 1666501116.0,
                    "replies": [
                        {
                            "body": "All the rumour of rift bw LKS and JSM sounds very amateurish. I mean, all people can point out is that they were awkward during the shoots and nothing else. \n\nSo, my guess is this is not because of LKS. \n\nMaybe she is done with this agency, or she is busy. Just saw that she was a guest at some music event.",
                            "author": "NavdeepNSG",
                            "id": "itfa4h1",
                            "parent_id": "t1_itf85mb",
                            "score": 6,
                            "created_utc": 1666502495.0,
                            "replies": [
                                {
                                    "body": "Well, we don't know anything. I wouldn't trust follow/unfollow on Instagram as proof of anything either. But you've got to admit a lot of it doesn't look too great! Just one incident wouldn't be odd, it wouldn't stick out. But a few things happening definitely is kind of strange to say the least. But anything anyone says aside from those people who were actually there is going to be speculation! We just have to trust that if either of them had done something unspeakable or bad, that the others wouldn't have stayed friends with them. So it's at least safe to say that whatever happened between them is private and doesn't affect other people, so it really isn't anybody's business. \n\nDoes it suck? Yes. As a huge kwangMin fan (not shipper) it really does. I miss them rolling around on the floor wrestling over a hint. But oh well. 🤷‍♀️\n\nAnd I don't know anything about the agency. I do know she didn't do a music show, it was just a festival and she attended last year too. She just happened to go up on stage with Soran. I don't think it was official kingkong business, just SoMin having fun in her free time. \n\nShe is one of the best actresses around. She just won a best actress award at the drama awards. Any agency would be lucky to have her. I don't think they'll let her go easily.",
                                    "author": null,
                                    "id": "itfcdyy",
                                    "parent_id": "t1_itfa4h1",
                                    "score": 11,
                                    "created_utc": 1666504149.0,
                                    "replies": [
                                        {
                                            "body": "Yes, it does seem a bit odd. \n\nI'm watching some old episodes and the bond between these two really stands apart. It was like as if they were real siblings but in the last few episodes before KLS' departure, they just seem so distant.\n\nBut anyways, it's better not to trust online gossip and trolls. Could be anything, could be nothing.",
                                            "author": "NavdeepNSG",
                                            "id": "itfcps3",
                                            "parent_id": "t1_itfcdyy",
                                            "score": 10,
                                            "created_utc": 1666504399.0,
                                            "replies": [
                                                {
                                                    "body": "I did wonder if that behavior in those last few months of RM was bc there were so many KwangMin shippers that he really wanted to draw a line in the sand bc he had a gf irl but man it was pretty awkward and abrupt change so it made a lot of people speculate and imagine some creative rifts.",
                                                    "author": "ImpossibleWarning6",
                                                    "id": "itfevsz",
                                                    "parent_id": "t1_itfcps3",
                                                    "score": 8,
                                                    "created_utc": 1666506092.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
                                                            "author": null,
                                                            "id": "itffsc5",
                                                            "parent_id": "t1_itfevsz",
                                                            "score": 9,
                                                            "created_utc": 1666506807.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                                                                    "author": "NavdeepNSG",
                                                                    "id": "itfhi7d",
                                                                    "parent_id": "t1_itffsc5",
                                                                    "score": 7,
                                                                    "created_utc": 1666508166.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The episodes were filmed on October 10-11 [(Source: Episode 1-3)](https://www.youtube.com/watch?v=Px3RZk_LIqU&t=462s). Looks like Somin had to shoot RM :D",
                    "author": "Terrible_Albatross53",
                    "id": "ivhq2zs",
                    "parent_id": "t1_itf631r",
                    "score": 3,
                    "created_utc": 1667870732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[Source](https://www.instagram.com/reel/Cj-8TbFgPsM/?igshid=YmMyMTA2M2Y=)📷",
            "author": "Deroucadetoo",
            "id": "itezclf",
            "parent_id": "t3_yb6ryi",
            "score": 5,
            "created_utc": 1666495703.0,
            "replies": []
        },
        {
            "body": "Yo wtf the cast is stacked",
            "author": "SquintPop",
            "id": "itixhis",
            "parent_id": "t3_yb6ryi",
            "score": 3,
            "created_utc": 1666569006.0,
            "replies": []
        },
        {
            "body": "Why are people so worried about JSM not being there? There might be thousand reasons for that. She might be busy with work or personal stuff or maybe the filming falls on her day off or she just didn’t feel like filming this. I don’t see any reason to be concerned",
            "author": "babymin",
            "id": "itg1av6",
            "parent_id": "t3_yb6ryi",
            "score": 13,
            "created_utc": 1666524199.0,
            "replies": [
                {
                    "body": "For me, \n\n1. This is RM sub, so if they post here I expect it's RM related. LKS and JSM are both in this agency. JSM is the only one currently on RM.\n\n2. She is a well-known actress and variety star. \n\n3. People wanted to see LKS x JSM chemistry again. \n\n4. A lot of people were looking forward to seeing interactions between idols and their favorite actors. \n\n5. If I were in charge, I'd get her on it for sure. Not just because she is well-known and good at variety, but honestly just because it would've been iconic to have kwangMin back on another show. \n\nIt's just dissapointing she's not there, and naturally people wanna know why this is the case. I don't think anyone is being unreasonable with expecting this. Especially on a running man sub!",
                    "author": null,
                    "id": "itgd3gn",
                    "parent_id": "t1_itg1av6",
                    "score": -3,
                    "created_utc": 1666531386.0,
                    "replies": [
                        {
                            "body": "People are being unnecessary dramatic about this and coming up with weird scenarios without any evidence. It’s weird.",
                            "author": "babymin",
                            "id": "itge4ee",
                            "parent_id": "t1_itgd3gn",
                            "score": 12,
                            "created_utc": 1666531909.0,
                            "replies": [
                                {
                                    "body": "I don't think anyone is coming up with stories here. We've said multiple times that we don't know the reason.",
                                    "author": null,
                                    "id": "itget8r",
                                    "parent_id": "t1_itge4ee",
                                    "score": 1,
                                    "created_utc": 1666532250.0,
                                    "replies": [
                                        {
                                            "body": "I’m talking about assumptions about LKS and JSM relationship or that JSM is being ignored",
                                            "author": "babymin",
                                            "id": "itglj7v",
                                            "parent_id": "t1_itget8r",
                                            "score": 4,
                                            "created_utc": 1666535422.0,
                                            "replies": [
                                                {
                                                    "body": "Again, you're speaking as if we're writing out conspiracy theories and stories when at least I myself have made it clear that we don't know anything and the awkwardness we are talking about is just something we felt. It isn't in our minds either. Just because you didn't feel it, doesn't mean you're right. Many sensed it. We're not starting rumours and we're not making up lies. So I don't understand your concern here. I detailed several reasons why JSM's name is brought up here all of which are valid points. She is in this agency, this is a RM sub and many expected to see her in this lineup. So it's only natural that people wonder why she isn't there. \n\nHonestly, at this point we can't talk about anything! This entire sub is just supposed to be what exactly? If you praise someone, you get called cringe. If you criticize someone, you're a hater. If you post pictures and content you're spamming. If you talk about your feelings towards a guest or member or a joke or a scenario, you're too much. \n\nI'd say just ban posting on this subreddit all together. Nothing is allowed here and everything is taken way too seriously and is looked down upon. What in the world is the purpose of having a discussion forum if no topic is allowed for discussion?",
                                                    "author": null,
                                                    "id": "itgmqnb",
                                                    "parent_id": "t1_itglj7v",
                                                    "score": -1,
                                                    "created_utc": 1666535956.0,
                                                    "replies": [
                                                        {
                                                            "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
                                                            "author": "babymin",
                                                            "id": "itgpbgm",
                                                            "parent_id": "t1_itgmqnb",
                                                            "score": 14,
                                                            "created_utc": 1666537079.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                                                                    "author": null,
                                                                    "id": "itgwrl6",
                                                                    "parent_id": "t1_itgpbgm",
                                                                    "score": 2,
                                                                    "created_utc": 1666540259.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol so much drama here just because Somin isn't there. So many speculations and so on.\n\nKingkong by Starship actor/actress have a lot of artists and Somin is not the only one that is not there. Stop being so dramatic lol.",
            "author": "whitefang0824",
            "id": "iti96kd",
            "parent_id": "t3_yb6ryi",
            "score": 9,
            "created_utc": 1666558895.0,
            "replies": [
                {
                    "body": "Those other actors aren't running man members. This is a running man subreddit. Why would we care about non-running man related news and actors? Of course if this is posted on the RM sub, the only active RM member directly related to this will be discussed.",
                    "author": null,
                    "id": "itipvtq",
                    "parent_id": "t1_iti96kd",
                    "score": -6,
                    "created_utc": 1666565647.0,
                    "replies": [
                        {
                            "body": "Lol you guys are claiming Somin isn't there because she and Kwangsoo are not in good terms. What I'm saying is that she isn't the only artist of Kingkong not there so she might just be busy and not avaiable that time just like their other artists so it is stupid to assume she is not there just because Kwangsoo is there. You didn't even get what I'm pointing out. You guys are seriously making an issue out of nothing. I'm seriously getting tired of  people always bringing up this \"what do go wrong between LKS and JSM thing\". If they are not like what they did before, then fine it is their life.",
                            "author": "whitefang0824",
                            "id": "itixo4x",
                            "parent_id": "t1_itipvtq",
                            "score": 8,
                            "created_utc": 1666569092.0,
                            "replies": [
                                {
                                    "body": "Claiming? I don't see anyone claiming anything, as in, stating something like it is a fact. We are discussing something we think is strange and saying it might be, and probably isn't (literally mentioned this 100 times to avoid your exact misunderstanding) something. That something? Nobody knows. We're just sharing our thoughts. Nobody is stating these as facts. It's speculation, only based on limited evidence. It isn't slander or rumours. We aren't making anything into an issue, YOU are. \n\nDid I ever present my ideas and thoughts as facts? Did I say I have evidence for things I was saying? No. I said the exact opposite. So I don't understand this notion of acting like we're spreading lies and stating them as facts.",
                                    "author": null,
                                    "id": "itjjs9s",
                                    "parent_id": "t1_itixo4x",
                                    "score": -2,
                                    "created_utc": 1666579482.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm surprised that there are some who don't want any Kwangsoo news in this sub. I'm hurt because wasn't he part of RM for a decade and just left like a year ago? Why can't he be part of this sub now when he is family already? I understand that he is not part of RM now but the guy spent an entire decade with us. If Gary is active, you can post some news of him here too. Why are some people salty about THIS being here? The flair is literally under \"Different Show\".",
            "author": "glassesinglamour",
            "id": "itja0b5",
            "parent_id": "t3_yb6ryi",
            "score": 10,
            "created_utc": 1666574886.0,
            "replies": [
                {
                    "body": "they probably think that their oppa abandoned them or something and are being bitter about it lol.",
                    "author": "botolsusu",
                    "id": "itjon1s",
                    "parent_id": "t1_itja0b5",
                    "score": 3,
                    "created_utc": 1666581898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally I'm more surprised that idols AND actors are guesting together. Usually its only idols (to promote a comeback) or only actors (to promote a movie/drama). I feels like it's rare to see them interact on variety show, so I'm looking forward to this episode!",
            "author": "NotHereBecause",
            "id": "itfsbl8",
            "parent_id": "t3_yb6ryi",
            "score": 3,
            "created_utc": 1666517122.0,
            "replies": []
        },
        {
            "body": "No Somin? She fits well with this show.",
            "author": "Aggressive-Dream-700",
            "id": "itfcy24",
            "parent_id": "t3_yb6ryi",
            "score": 3,
            "created_utc": 1666504579.0,
            "replies": []
        },
        {
            "body": "How come LKS can guest in other shows but can’t continue on RM though ?",
            "author": "LowKeySaiyan",
            "id": "itfpzur",
            "parent_id": "t3_yb6ryi",
            "score": 3,
            "created_utc": 1666515196.0,
            "replies": [
                {
                    "body": "I think it's because being on a show regularly is a bigger commitment than just guesting so it would make sense why he also can do shorter shows like The Zone etc.",
                    "author": null,
                    "id": "itfshy4",
                    "parent_id": "t1_itfpzur",
                    "score": 14,
                    "created_utc": 1666517273.0,
                    "replies": [
                        {
                            "body": "Ah I see. Because I thought the reason for him leaving is because of his ankle and also filming tv shows and movies. \nFor the other commenters, I don’t mean anything malicious. Just curious haha",
                            "author": "LowKeySaiyan",
                            "id": "iu90yq7",
                            "parent_id": "t1_itfshy4",
                            "score": 2,
                            "created_utc": 1667053843.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "maybe it's because he wants",
                    "author": "Jaded_Technician_308",
                    "id": "iu1kym2",
                    "parent_id": "t1_itfpzur",
                    "score": 2,
                    "created_utc": 1666906621.0,
                    "replies": []
                },
                {
                    "body": "Because he can do whatever he wants",
                    "author": "magablossom",
                    "id": "iu275j9",
                    "parent_id": "t1_itfpzur",
                    "score": 1,
                    "created_utc": 1666916698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Always wanted to watch LKS + LDW + YYS together, sooo excited for this 😍 why are there so many guests tho, feels like it’ll be less air time for each of them",
            "author": "iwantaspudgun",
            "id": "itg97om",
            "parent_id": "t3_yb6ryi",
            "score": 2,
            "created_utc": 1666529242.0,
            "replies": []
        },
        {
            "body": "Does Kwang So news still related to Running Man?",
            "author": "Hortifruto",
            "id": "ith6uee",
            "parent_id": "t3_yb6ryi",
            "score": 2,
            "created_utc": 1666544385.0,
            "replies": []
        },
        {
            "body": "What and no JSM ?",
            "author": "gyojoo",
            "id": "itf5kzi",
            "parent_id": "t3_yb6ryi",
            "score": 0,
            "created_utc": 1666499445.0,
            "replies": [
                {
                    "body": "Somin was spotted a few days ago with Bopil and JSJ by a fan who posted pictures with them on Instagram. There's a possibility Bopil has a show planned with Somin and JSJ as members. Somin is also filming the new dating programme with JS.",
                    "author": "Mission-Loquat9290",
                    "id": "itmjob8",
                    "parent_id": "t1_itf5kzi",
                    "score": 3,
                    "created_utc": 1666638755.0,
                    "replies": []
                },
                {
                    "body": "Are variety show actors allowed to attend other variety shows? I remember Chae tae Hyun wearing a mask when KJK called him for a mission in a episode of running man.",
                    "author": "typical_punk",
                    "id": "itfdy28",
                    "parent_id": "t1_itf5kzi",
                    "score": 1,
                    "created_utc": 1666505362.0,
                    "replies": [
                        {
                            "body": "Well it’s because at the time Cha Tae Hyun was in a rival variety show. Game caterers on the other hand is a not that. It’s possible she was busy, they wanted just specific actors, or there could be some truth about the rift between them. We’ll never know",
                            "author": "Mozart-Luna-Echo",
                            "id": "itfeuf0",
                            "parent_id": "t1_itfdy28",
                            "score": 12,
                            "created_utc": 1666506062.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ith92hf",
                                    "parent_id": "t1_itfeuf0",
                                    "score": 6,
                                    "created_utc": 1666545272.0,
                                    "replies": [
                                        {
                                            "body": "if you look at the video, theres an actress in actor team 1 and two actresses in actor team 2. \n\nanyways, i don't think it's weird somins not there (though i'd prefer if she was). i saw that some of the idol groups were missing members too so scheduling must've been a nightmare for that many people lol.",
                                            "author": "botolsusu",
                                            "id": "itjpof8",
                                            "parent_id": "t1_ith92hf",
                                            "score": 3,
                                            "created_utc": 1666582430.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Makes sense, for the HYBE episode there was a team that had the soloists but it only had the makes. Nana is still in Pledis but she wasn’t there. Maybe they just want single gender teams",
                                            "author": "Mozart-Luna-Echo",
                                            "id": "itit9q4",
                                            "parent_id": "t1_ith92hf",
                                            "score": 4,
                                            "created_utc": 1666567107.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "it was because they were from different networks he couldn't legally show his face",
                            "author": "Complete_Roof_7703",
                            "id": "ivdh28b",
                            "parent_id": "t1_itfdy28",
                            "score": 1,
                            "created_utc": 1667792938.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Looks fun. The last one I watched was the Hybe",
            "author": "asrafzonan",
            "id": "itf9i3a",
            "parent_id": "t3_yb6ryi",
            "score": 1,
            "created_utc": 1666502052.0,
            "replies": []
        },
        {
            "body": "This looks fun!",
            "author": "Crashingshores",
            "id": "itfyw69",
            "parent_id": "t3_yb6ryi",
            "score": 1,
            "created_utc": 1666522410.0,
            "replies": []
        },
        {
            "body": "Was that Song SeungHoon???",
            "author": "Witty_Inspection_310",
            "id": "itgabpg",
            "parent_id": "t3_yb6ryi",
            "score": 1,
            "created_utc": 1666529876.0,
            "replies": []
        },
        {
            "body": "guang soo abandoned the show. Enough about him",
            "author": "PopeStPiousX",
            "id": "itgvhd7",
            "parent_id": "t3_yb6ryi",
            "score": -6,
            "created_utc": 1666539721.0,
            "replies": []
        },
        {
            "body": "OMG!!! I’m no good!!! 👀😭♥️",
            "author": "Puzzleheaded-Park-69",
            "id": "itj2832",
            "parent_id": "t3_yb6ryi",
            "score": 0,
            "created_utc": 1666571238.0,
            "replies": []
        },
        {
            "body": "JSM not being there is so sus, u cant deny it. Her being busy or has other programs is just a lame excuse. What, other actors like Lee Dang Wook and Yoo Yeon Soon can be there, but not JSM?… on a variety show some more. They could’ve worked around her schedule … yeahh, there definitely is going on",
            "author": "mzh277",
            "id": "itfbywx",
            "parent_id": "t3_yb6ryi",
            "score": -15,
            "created_utc": 1666503836.0,
            "replies": [
                {
                    "body": "It's filmed on Monday, stop being dramatic and I hope people will shut up and stop making scenario in their head when we don't know what happened.",
                    "author": "jikol1992",
                    "id": "itff8mr",
                    "parent_id": "t1_itfbywx",
                    "score": 16,
                    "created_utc": 1666506374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is recorded on the same day as Running Man. (2 days 1 night, maybe one day falls on the same day as RM shooting?) \n\nOtherwise, that's really sus and makes me think the reason she's not there is because LKS is there and I hate that idea and don't ever want that to be true. I secretly wanna know what went down but at the same time I'm not at all ready or want there to be any actual stuff that went down so I'd rather just pretend nothing is wrong and they are secretly still good friends. 🤷‍♀️",
            "author": null,
            "id": "itf85mb",
            "parent_id": "t1_itf631r",
            "score": 16,
            "created_utc": 1666501116.0,
            "replies": [
                {
                    "body": "All the rumour of rift bw LKS and JSM sounds very amateurish. I mean, all people can point out is that they were awkward during the shoots and nothing else. \n\nSo, my guess is this is not because of LKS. \n\nMaybe she is done with this agency, or she is busy. Just saw that she was a guest at some music event.",
                    "author": "NavdeepNSG",
                    "id": "itfa4h1",
                    "parent_id": "t1_itf85mb",
                    "score": 6,
                    "created_utc": 1666502495.0,
                    "replies": [
                        {
                            "body": "Well, we don't know anything. I wouldn't trust follow/unfollow on Instagram as proof of anything either. But you've got to admit a lot of it doesn't look too great! Just one incident wouldn't be odd, it wouldn't stick out. But a few things happening definitely is kind of strange to say the least. But anything anyone says aside from those people who were actually there is going to be speculation! We just have to trust that if either of them had done something unspeakable or bad, that the others wouldn't have stayed friends with them. So it's at least safe to say that whatever happened between them is private and doesn't affect other people, so it really isn't anybody's business. \n\nDoes it suck? Yes. As a huge kwangMin fan (not shipper) it really does. I miss them rolling around on the floor wrestling over a hint. But oh well. 🤷‍♀️\n\nAnd I don't know anything about the agency. I do know she didn't do a music show, it was just a festival and she attended last year too. She just happened to go up on stage with Soran. I don't think it was official kingkong business, just SoMin having fun in her free time. \n\nShe is one of the best actresses around. She just won a best actress award at the drama awards. Any agency would be lucky to have her. I don't think they'll let her go easily.",
                            "author": null,
                            "id": "itfcdyy",
                            "parent_id": "t1_itfa4h1",
                            "score": 11,
                            "created_utc": 1666504149.0,
                            "replies": [
                                {
                                    "body": "Yes, it does seem a bit odd. \n\nI'm watching some old episodes and the bond between these two really stands apart. It was like as if they were real siblings but in the last few episodes before KLS' departure, they just seem so distant.\n\nBut anyways, it's better not to trust online gossip and trolls. Could be anything, could be nothing.",
                                    "author": "NavdeepNSG",
                                    "id": "itfcps3",
                                    "parent_id": "t1_itfcdyy",
                                    "score": 10,
                                    "created_utc": 1666504399.0,
                                    "replies": [
                                        {
                                            "body": "I did wonder if that behavior in those last few months of RM was bc there were so many KwangMin shippers that he really wanted to draw a line in the sand bc he had a gf irl but man it was pretty awkward and abrupt change so it made a lot of people speculate and imagine some creative rifts.",
                                            "author": "ImpossibleWarning6",
                                            "id": "itfevsz",
                                            "parent_id": "t1_itfcps3",
                                            "score": 8,
                                            "created_utc": 1666506092.0,
                                            "replies": [
                                                {
                                                    "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
                                                    "author": null,
                                                    "id": "itffsc5",
                                                    "parent_id": "t1_itfevsz",
                                                    "score": 9,
                                                    "created_utc": 1666506807.0,
                                                    "replies": [
                                                        {
                                                            "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                                                            "author": "NavdeepNSG",
                                                            "id": "itfhi7d",
                                                            "parent_id": "t1_itffsc5",
                                                            "score": 7,
                                                            "created_utc": 1666508166.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The episodes were filmed on October 10-11 [(Source: Episode 1-3)](https://www.youtube.com/watch?v=Px3RZk_LIqU&t=462s). Looks like Somin had to shoot RM :D",
            "author": "Terrible_Albatross53",
            "id": "ivhq2zs",
            "parent_id": "t1_itf631r",
            "score": 3,
            "created_utc": 1667870732.0,
            "replies": []
        },
        {
            "body": "For me, \n\n1. This is RM sub, so if they post here I expect it's RM related. LKS and JSM are both in this agency. JSM is the only one currently on RM.\n\n2. She is a well-known actress and variety star. \n\n3. People wanted to see LKS x JSM chemistry again. \n\n4. A lot of people were looking forward to seeing interactions between idols and their favorite actors. \n\n5. If I were in charge, I'd get her on it for sure. Not just because she is well-known and good at variety, but honestly just because it would've been iconic to have kwangMin back on another show. \n\nIt's just dissapointing she's not there, and naturally people wanna know why this is the case. I don't think anyone is being unreasonable with expecting this. Especially on a running man sub!",
            "author": null,
            "id": "itgd3gn",
            "parent_id": "t1_itg1av6",
            "score": -3,
            "created_utc": 1666531386.0,
            "replies": [
                {
                    "body": "People are being unnecessary dramatic about this and coming up with weird scenarios without any evidence. It’s weird.",
                    "author": "babymin",
                    "id": "itge4ee",
                    "parent_id": "t1_itgd3gn",
                    "score": 12,
                    "created_utc": 1666531909.0,
                    "replies": [
                        {
                            "body": "I don't think anyone is coming up with stories here. We've said multiple times that we don't know the reason.",
                            "author": null,
                            "id": "itget8r",
                            "parent_id": "t1_itge4ee",
                            "score": 1,
                            "created_utc": 1666532250.0,
                            "replies": [
                                {
                                    "body": "I’m talking about assumptions about LKS and JSM relationship or that JSM is being ignored",
                                    "author": "babymin",
                                    "id": "itglj7v",
                                    "parent_id": "t1_itget8r",
                                    "score": 4,
                                    "created_utc": 1666535422.0,
                                    "replies": [
                                        {
                                            "body": "Again, you're speaking as if we're writing out conspiracy theories and stories when at least I myself have made it clear that we don't know anything and the awkwardness we are talking about is just something we felt. It isn't in our minds either. Just because you didn't feel it, doesn't mean you're right. Many sensed it. We're not starting rumours and we're not making up lies. So I don't understand your concern here. I detailed several reasons why JSM's name is brought up here all of which are valid points. She is in this agency, this is a RM sub and many expected to see her in this lineup. So it's only natural that people wonder why she isn't there. \n\nHonestly, at this point we can't talk about anything! This entire sub is just supposed to be what exactly? If you praise someone, you get called cringe. If you criticize someone, you're a hater. If you post pictures and content you're spamming. If you talk about your feelings towards a guest or member or a joke or a scenario, you're too much. \n\nI'd say just ban posting on this subreddit all together. Nothing is allowed here and everything is taken way too seriously and is looked down upon. What in the world is the purpose of having a discussion forum if no topic is allowed for discussion?",
                                            "author": null,
                                            "id": "itgmqnb",
                                            "parent_id": "t1_itglj7v",
                                            "score": -1,
                                            "created_utc": 1666535956.0,
                                            "replies": [
                                                {
                                                    "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
                                                    "author": "babymin",
                                                    "id": "itgpbgm",
                                                    "parent_id": "t1_itgmqnb",
                                                    "score": 14,
                                                    "created_utc": 1666537079.0,
                                                    "replies": [
                                                        {
                                                            "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                                                            "author": null,
                                                            "id": "itgwrl6",
                                                            "parent_id": "t1_itgpbgm",
                                                            "score": 2,
                                                            "created_utc": 1666540259.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those other actors aren't running man members. This is a running man subreddit. Why would we care about non-running man related news and actors? Of course if this is posted on the RM sub, the only active RM member directly related to this will be discussed.",
            "author": null,
            "id": "itipvtq",
            "parent_id": "t1_iti96kd",
            "score": -6,
            "created_utc": 1666565647.0,
            "replies": [
                {
                    "body": "Lol you guys are claiming Somin isn't there because she and Kwangsoo are not in good terms. What I'm saying is that she isn't the only artist of Kingkong not there so she might just be busy and not avaiable that time just like their other artists so it is stupid to assume she is not there just because Kwangsoo is there. You didn't even get what I'm pointing out. You guys are seriously making an issue out of nothing. I'm seriously getting tired of  people always bringing up this \"what do go wrong between LKS and JSM thing\". If they are not like what they did before, then fine it is their life.",
                    "author": "whitefang0824",
                    "id": "itixo4x",
                    "parent_id": "t1_itipvtq",
                    "score": 8,
                    "created_utc": 1666569092.0,
                    "replies": [
                        {
                            "body": "Claiming? I don't see anyone claiming anything, as in, stating something like it is a fact. We are discussing something we think is strange and saying it might be, and probably isn't (literally mentioned this 100 times to avoid your exact misunderstanding) something. That something? Nobody knows. We're just sharing our thoughts. Nobody is stating these as facts. It's speculation, only based on limited evidence. It isn't slander or rumours. We aren't making anything into an issue, YOU are. \n\nDid I ever present my ideas and thoughts as facts? Did I say I have evidence for things I was saying? No. I said the exact opposite. So I don't understand this notion of acting like we're spreading lies and stating them as facts.",
                            "author": null,
                            "id": "itjjs9s",
                            "parent_id": "t1_itixo4x",
                            "score": -2,
                            "created_utc": 1666579482.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "they probably think that their oppa abandoned them or something and are being bitter about it lol.",
            "author": "botolsusu",
            "id": "itjon1s",
            "parent_id": "t1_itja0b5",
            "score": 3,
            "created_utc": 1666581898.0,
            "replies": []
        },
        {
            "body": "I think it's because being on a show regularly is a bigger commitment than just guesting so it would make sense why he also can do shorter shows like The Zone etc.",
            "author": null,
            "id": "itfshy4",
            "parent_id": "t1_itfpzur",
            "score": 14,
            "created_utc": 1666517273.0,
            "replies": [
                {
                    "body": "Ah I see. Because I thought the reason for him leaving is because of his ankle and also filming tv shows and movies. \nFor the other commenters, I don’t mean anything malicious. Just curious haha",
                    "author": "LowKeySaiyan",
                    "id": "iu90yq7",
                    "parent_id": "t1_itfshy4",
                    "score": 2,
                    "created_utc": 1667053843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "maybe it's because he wants",
            "author": "Jaded_Technician_308",
            "id": "iu1kym2",
            "parent_id": "t1_itfpzur",
            "score": 2,
            "created_utc": 1666906621.0,
            "replies": []
        },
        {
            "body": "Because he can do whatever he wants",
            "author": "magablossom",
            "id": "iu275j9",
            "parent_id": "t1_itfpzur",
            "score": 1,
            "created_utc": 1666916698.0,
            "replies": []
        },
        {
            "body": "Somin was spotted a few days ago with Bopil and JSJ by a fan who posted pictures with them on Instagram. There's a possibility Bopil has a show planned with Somin and JSJ as members. Somin is also filming the new dating programme with JS.",
            "author": "Mission-Loquat9290",
            "id": "itmjob8",
            "parent_id": "t1_itf5kzi",
            "score": 3,
            "created_utc": 1666638755.0,
            "replies": []
        },
        {
            "body": "Are variety show actors allowed to attend other variety shows? I remember Chae tae Hyun wearing a mask when KJK called him for a mission in a episode of running man.",
            "author": "typical_punk",
            "id": "itfdy28",
            "parent_id": "t1_itf5kzi",
            "score": 1,
            "created_utc": 1666505362.0,
            "replies": [
                {
                    "body": "Well it’s because at the time Cha Tae Hyun was in a rival variety show. Game caterers on the other hand is a not that. It’s possible she was busy, they wanted just specific actors, or there could be some truth about the rift between them. We’ll never know",
                    "author": "Mozart-Luna-Echo",
                    "id": "itfeuf0",
                    "parent_id": "t1_itfdy28",
                    "score": 12,
                    "created_utc": 1666506062.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ith92hf",
                            "parent_id": "t1_itfeuf0",
                            "score": 6,
                            "created_utc": 1666545272.0,
                            "replies": [
                                {
                                    "body": "if you look at the video, theres an actress in actor team 1 and two actresses in actor team 2. \n\nanyways, i don't think it's weird somins not there (though i'd prefer if she was). i saw that some of the idol groups were missing members too so scheduling must've been a nightmare for that many people lol.",
                                    "author": "botolsusu",
                                    "id": "itjpof8",
                                    "parent_id": "t1_ith92hf",
                                    "score": 3,
                                    "created_utc": 1666582430.0,
                                    "replies": []
                                },
                                {
                                    "body": "Makes sense, for the HYBE episode there was a team that had the soloists but it only had the makes. Nana is still in Pledis but she wasn’t there. Maybe they just want single gender teams",
                                    "author": "Mozart-Luna-Echo",
                                    "id": "itit9q4",
                                    "parent_id": "t1_ith92hf",
                                    "score": 4,
                                    "created_utc": 1666567107.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "it was because they were from different networks he couldn't legally show his face",
                    "author": "Complete_Roof_7703",
                    "id": "ivdh28b",
                    "parent_id": "t1_itfdy28",
                    "score": 1,
                    "created_utc": 1667792938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's filmed on Monday, stop being dramatic and I hope people will shut up and stop making scenario in their head when we don't know what happened.",
            "author": "jikol1992",
            "id": "itff8mr",
            "parent_id": "t1_itfbywx",
            "score": 16,
            "created_utc": 1666506374.0,
            "replies": []
        },
        {
            "body": "All the rumour of rift bw LKS and JSM sounds very amateurish. I mean, all people can point out is that they were awkward during the shoots and nothing else. \n\nSo, my guess is this is not because of LKS. \n\nMaybe she is done with this agency, or she is busy. Just saw that she was a guest at some music event.",
            "author": "NavdeepNSG",
            "id": "itfa4h1",
            "parent_id": "t1_itf85mb",
            "score": 6,
            "created_utc": 1666502495.0,
            "replies": [
                {
                    "body": "Well, we don't know anything. I wouldn't trust follow/unfollow on Instagram as proof of anything either. But you've got to admit a lot of it doesn't look too great! Just one incident wouldn't be odd, it wouldn't stick out. But a few things happening definitely is kind of strange to say the least. But anything anyone says aside from those people who were actually there is going to be speculation! We just have to trust that if either of them had done something unspeakable or bad, that the others wouldn't have stayed friends with them. So it's at least safe to say that whatever happened between them is private and doesn't affect other people, so it really isn't anybody's business. \n\nDoes it suck? Yes. As a huge kwangMin fan (not shipper) it really does. I miss them rolling around on the floor wrestling over a hint. But oh well. 🤷‍♀️\n\nAnd I don't know anything about the agency. I do know she didn't do a music show, it was just a festival and she attended last year too. She just happened to go up on stage with Soran. I don't think it was official kingkong business, just SoMin having fun in her free time. \n\nShe is one of the best actresses around. She just won a best actress award at the drama awards. Any agency would be lucky to have her. I don't think they'll let her go easily.",
                    "author": null,
                    "id": "itfcdyy",
                    "parent_id": "t1_itfa4h1",
                    "score": 11,
                    "created_utc": 1666504149.0,
                    "replies": [
                        {
                            "body": "Yes, it does seem a bit odd. \n\nI'm watching some old episodes and the bond between these two really stands apart. It was like as if they were real siblings but in the last few episodes before KLS' departure, they just seem so distant.\n\nBut anyways, it's better not to trust online gossip and trolls. Could be anything, could be nothing.",
                            "author": "NavdeepNSG",
                            "id": "itfcps3",
                            "parent_id": "t1_itfcdyy",
                            "score": 10,
                            "created_utc": 1666504399.0,
                            "replies": [
                                {
                                    "body": "I did wonder if that behavior in those last few months of RM was bc there were so many KwangMin shippers that he really wanted to draw a line in the sand bc he had a gf irl but man it was pretty awkward and abrupt change so it made a lot of people speculate and imagine some creative rifts.",
                                    "author": "ImpossibleWarning6",
                                    "id": "itfevsz",
                                    "parent_id": "t1_itfcps3",
                                    "score": 8,
                                    "created_utc": 1666506092.0,
                                    "replies": [
                                        {
                                            "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
                                            "author": null,
                                            "id": "itffsc5",
                                            "parent_id": "t1_itfevsz",
                                            "score": 9,
                                            "created_utc": 1666506807.0,
                                            "replies": [
                                                {
                                                    "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                                                    "author": "NavdeepNSG",
                                                    "id": "itfhi7d",
                                                    "parent_id": "t1_itffsc5",
                                                    "score": 7,
                                                    "created_utc": 1666508166.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "People are being unnecessary dramatic about this and coming up with weird scenarios without any evidence. It’s weird.",
            "author": "babymin",
            "id": "itge4ee",
            "parent_id": "t1_itgd3gn",
            "score": 12,
            "created_utc": 1666531909.0,
            "replies": [
                {
                    "body": "I don't think anyone is coming up with stories here. We've said multiple times that we don't know the reason.",
                    "author": null,
                    "id": "itget8r",
                    "parent_id": "t1_itge4ee",
                    "score": 1,
                    "created_utc": 1666532250.0,
                    "replies": [
                        {
                            "body": "I’m talking about assumptions about LKS and JSM relationship or that JSM is being ignored",
                            "author": "babymin",
                            "id": "itglj7v",
                            "parent_id": "t1_itget8r",
                            "score": 4,
                            "created_utc": 1666535422.0,
                            "replies": [
                                {
                                    "body": "Again, you're speaking as if we're writing out conspiracy theories and stories when at least I myself have made it clear that we don't know anything and the awkwardness we are talking about is just something we felt. It isn't in our minds either. Just because you didn't feel it, doesn't mean you're right. Many sensed it. We're not starting rumours and we're not making up lies. So I don't understand your concern here. I detailed several reasons why JSM's name is brought up here all of which are valid points. She is in this agency, this is a RM sub and many expected to see her in this lineup. So it's only natural that people wonder why she isn't there. \n\nHonestly, at this point we can't talk about anything! This entire sub is just supposed to be what exactly? If you praise someone, you get called cringe. If you criticize someone, you're a hater. If you post pictures and content you're spamming. If you talk about your feelings towards a guest or member or a joke or a scenario, you're too much. \n\nI'd say just ban posting on this subreddit all together. Nothing is allowed here and everything is taken way too seriously and is looked down upon. What in the world is the purpose of having a discussion forum if no topic is allowed for discussion?",
                                    "author": null,
                                    "id": "itgmqnb",
                                    "parent_id": "t1_itglj7v",
                                    "score": -1,
                                    "created_utc": 1666535956.0,
                                    "replies": [
                                        {
                                            "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
                                            "author": "babymin",
                                            "id": "itgpbgm",
                                            "parent_id": "t1_itgmqnb",
                                            "score": 14,
                                            "created_utc": 1666537079.0,
                                            "replies": [
                                                {
                                                    "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                                                    "author": null,
                                                    "id": "itgwrl6",
                                                    "parent_id": "t1_itgpbgm",
                                                    "score": 2,
                                                    "created_utc": 1666540259.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol you guys are claiming Somin isn't there because she and Kwangsoo are not in good terms. What I'm saying is that she isn't the only artist of Kingkong not there so she might just be busy and not avaiable that time just like their other artists so it is stupid to assume she is not there just because Kwangsoo is there. You didn't even get what I'm pointing out. You guys are seriously making an issue out of nothing. I'm seriously getting tired of  people always bringing up this \"what do go wrong between LKS and JSM thing\". If they are not like what they did before, then fine it is their life.",
            "author": "whitefang0824",
            "id": "itixo4x",
            "parent_id": "t1_itipvtq",
            "score": 8,
            "created_utc": 1666569092.0,
            "replies": [
                {
                    "body": "Claiming? I don't see anyone claiming anything, as in, stating something like it is a fact. We are discussing something we think is strange and saying it might be, and probably isn't (literally mentioned this 100 times to avoid your exact misunderstanding) something. That something? Nobody knows. We're just sharing our thoughts. Nobody is stating these as facts. It's speculation, only based on limited evidence. It isn't slander or rumours. We aren't making anything into an issue, YOU are. \n\nDid I ever present my ideas and thoughts as facts? Did I say I have evidence for things I was saying? No. I said the exact opposite. So I don't understand this notion of acting like we're spreading lies and stating them as facts.",
                    "author": null,
                    "id": "itjjs9s",
                    "parent_id": "t1_itixo4x",
                    "score": -2,
                    "created_utc": 1666579482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah I see. Because I thought the reason for him leaving is because of his ankle and also filming tv shows and movies. \nFor the other commenters, I don’t mean anything malicious. Just curious haha",
            "author": "LowKeySaiyan",
            "id": "iu90yq7",
            "parent_id": "t1_itfshy4",
            "score": 2,
            "created_utc": 1667053843.0,
            "replies": []
        },
        {
            "body": "Well it’s because at the time Cha Tae Hyun was in a rival variety show. Game caterers on the other hand is a not that. It’s possible she was busy, they wanted just specific actors, or there could be some truth about the rift between them. We’ll never know",
            "author": "Mozart-Luna-Echo",
            "id": "itfeuf0",
            "parent_id": "t1_itfdy28",
            "score": 12,
            "created_utc": 1666506062.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ith92hf",
                    "parent_id": "t1_itfeuf0",
                    "score": 6,
                    "created_utc": 1666545272.0,
                    "replies": [
                        {
                            "body": "if you look at the video, theres an actress in actor team 1 and two actresses in actor team 2. \n\nanyways, i don't think it's weird somins not there (though i'd prefer if she was). i saw that some of the idol groups were missing members too so scheduling must've been a nightmare for that many people lol.",
                            "author": "botolsusu",
                            "id": "itjpof8",
                            "parent_id": "t1_ith92hf",
                            "score": 3,
                            "created_utc": 1666582430.0,
                            "replies": []
                        },
                        {
                            "body": "Makes sense, for the HYBE episode there was a team that had the soloists but it only had the makes. Nana is still in Pledis but she wasn’t there. Maybe they just want single gender teams",
                            "author": "Mozart-Luna-Echo",
                            "id": "itit9q4",
                            "parent_id": "t1_ith92hf",
                            "score": 4,
                            "created_utc": 1666567107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "it was because they were from different networks he couldn't legally show his face",
            "author": "Complete_Roof_7703",
            "id": "ivdh28b",
            "parent_id": "t1_itfdy28",
            "score": 1,
            "created_utc": 1667792938.0,
            "replies": []
        },
        {
            "body": "Well, we don't know anything. I wouldn't trust follow/unfollow on Instagram as proof of anything either. But you've got to admit a lot of it doesn't look too great! Just one incident wouldn't be odd, it wouldn't stick out. But a few things happening definitely is kind of strange to say the least. But anything anyone says aside from those people who were actually there is going to be speculation! We just have to trust that if either of them had done something unspeakable or bad, that the others wouldn't have stayed friends with them. So it's at least safe to say that whatever happened between them is private and doesn't affect other people, so it really isn't anybody's business. \n\nDoes it suck? Yes. As a huge kwangMin fan (not shipper) it really does. I miss them rolling around on the floor wrestling over a hint. But oh well. 🤷‍♀️\n\nAnd I don't know anything about the agency. I do know she didn't do a music show, it was just a festival and she attended last year too. She just happened to go up on stage with Soran. I don't think it was official kingkong business, just SoMin having fun in her free time. \n\nShe is one of the best actresses around. She just won a best actress award at the drama awards. Any agency would be lucky to have her. I don't think they'll let her go easily.",
            "author": null,
            "id": "itfcdyy",
            "parent_id": "t1_itfa4h1",
            "score": 11,
            "created_utc": 1666504149.0,
            "replies": [
                {
                    "body": "Yes, it does seem a bit odd. \n\nI'm watching some old episodes and the bond between these two really stands apart. It was like as if they were real siblings but in the last few episodes before KLS' departure, they just seem so distant.\n\nBut anyways, it's better not to trust online gossip and trolls. Could be anything, could be nothing.",
                    "author": "NavdeepNSG",
                    "id": "itfcps3",
                    "parent_id": "t1_itfcdyy",
                    "score": 10,
                    "created_utc": 1666504399.0,
                    "replies": [
                        {
                            "body": "I did wonder if that behavior in those last few months of RM was bc there were so many KwangMin shippers that he really wanted to draw a line in the sand bc he had a gf irl but man it was pretty awkward and abrupt change so it made a lot of people speculate and imagine some creative rifts.",
                            "author": "ImpossibleWarning6",
                            "id": "itfevsz",
                            "parent_id": "t1_itfcps3",
                            "score": 8,
                            "created_utc": 1666506092.0,
                            "replies": [
                                {
                                    "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
                                    "author": null,
                                    "id": "itffsc5",
                                    "parent_id": "t1_itfevsz",
                                    "score": 9,
                                    "created_utc": 1666506807.0,
                                    "replies": [
                                        {
                                            "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                                            "author": "NavdeepNSG",
                                            "id": "itfhi7d",
                                            "parent_id": "t1_itffsc5",
                                            "score": 7,
                                            "created_utc": 1666508166.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think anyone is coming up with stories here. We've said multiple times that we don't know the reason.",
            "author": null,
            "id": "itget8r",
            "parent_id": "t1_itge4ee",
            "score": 1,
            "created_utc": 1666532250.0,
            "replies": [
                {
                    "body": "I’m talking about assumptions about LKS and JSM relationship or that JSM is being ignored",
                    "author": "babymin",
                    "id": "itglj7v",
                    "parent_id": "t1_itget8r",
                    "score": 4,
                    "created_utc": 1666535422.0,
                    "replies": [
                        {
                            "body": "Again, you're speaking as if we're writing out conspiracy theories and stories when at least I myself have made it clear that we don't know anything and the awkwardness we are talking about is just something we felt. It isn't in our minds either. Just because you didn't feel it, doesn't mean you're right. Many sensed it. We're not starting rumours and we're not making up lies. So I don't understand your concern here. I detailed several reasons why JSM's name is brought up here all of which are valid points. She is in this agency, this is a RM sub and many expected to see her in this lineup. So it's only natural that people wonder why she isn't there. \n\nHonestly, at this point we can't talk about anything! This entire sub is just supposed to be what exactly? If you praise someone, you get called cringe. If you criticize someone, you're a hater. If you post pictures and content you're spamming. If you talk about your feelings towards a guest or member or a joke or a scenario, you're too much. \n\nI'd say just ban posting on this subreddit all together. Nothing is allowed here and everything is taken way too seriously and is looked down upon. What in the world is the purpose of having a discussion forum if no topic is allowed for discussion?",
                            "author": null,
                            "id": "itgmqnb",
                            "parent_id": "t1_itglj7v",
                            "score": -1,
                            "created_utc": 1666535956.0,
                            "replies": [
                                {
                                    "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
                                    "author": "babymin",
                                    "id": "itgpbgm",
                                    "parent_id": "t1_itgmqnb",
                                    "score": 14,
                                    "created_utc": 1666537079.0,
                                    "replies": [
                                        {
                                            "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                                            "author": null,
                                            "id": "itgwrl6",
                                            "parent_id": "t1_itgpbgm",
                                            "score": 2,
                                            "created_utc": 1666540259.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Claiming? I don't see anyone claiming anything, as in, stating something like it is a fact. We are discussing something we think is strange and saying it might be, and probably isn't (literally mentioned this 100 times to avoid your exact misunderstanding) something. That something? Nobody knows. We're just sharing our thoughts. Nobody is stating these as facts. It's speculation, only based on limited evidence. It isn't slander or rumours. We aren't making anything into an issue, YOU are. \n\nDid I ever present my ideas and thoughts as facts? Did I say I have evidence for things I was saying? No. I said the exact opposite. So I don't understand this notion of acting like we're spreading lies and stating them as facts.",
            "author": null,
            "id": "itjjs9s",
            "parent_id": "t1_itixo4x",
            "score": -2,
            "created_utc": 1666579482.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ith92hf",
            "parent_id": "t1_itfeuf0",
            "score": 6,
            "created_utc": 1666545272.0,
            "replies": [
                {
                    "body": "if you look at the video, theres an actress in actor team 1 and two actresses in actor team 2. \n\nanyways, i don't think it's weird somins not there (though i'd prefer if she was). i saw that some of the idol groups were missing members too so scheduling must've been a nightmare for that many people lol.",
                    "author": "botolsusu",
                    "id": "itjpof8",
                    "parent_id": "t1_ith92hf",
                    "score": 3,
                    "created_utc": 1666582430.0,
                    "replies": []
                },
                {
                    "body": "Makes sense, for the HYBE episode there was a team that had the soloists but it only had the makes. Nana is still in Pledis but she wasn’t there. Maybe they just want single gender teams",
                    "author": "Mozart-Luna-Echo",
                    "id": "itit9q4",
                    "parent_id": "t1_ith92hf",
                    "score": 4,
                    "created_utc": 1666567107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, it does seem a bit odd. \n\nI'm watching some old episodes and the bond between these two really stands apart. It was like as if they were real siblings but in the last few episodes before KLS' departure, they just seem so distant.\n\nBut anyways, it's better not to trust online gossip and trolls. Could be anything, could be nothing.",
            "author": "NavdeepNSG",
            "id": "itfcps3",
            "parent_id": "t1_itfcdyy",
            "score": 10,
            "created_utc": 1666504399.0,
            "replies": [
                {
                    "body": "I did wonder if that behavior in those last few months of RM was bc there were so many KwangMin shippers that he really wanted to draw a line in the sand bc he had a gf irl but man it was pretty awkward and abrupt change so it made a lot of people speculate and imagine some creative rifts.",
                    "author": "ImpossibleWarning6",
                    "id": "itfevsz",
                    "parent_id": "t1_itfcps3",
                    "score": 8,
                    "created_utc": 1666506092.0,
                    "replies": [
                        {
                            "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
                            "author": null,
                            "id": "itffsc5",
                            "parent_id": "t1_itfevsz",
                            "score": 9,
                            "created_utc": 1666506807.0,
                            "replies": [
                                {
                                    "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                                    "author": "NavdeepNSG",
                                    "id": "itfhi7d",
                                    "parent_id": "t1_itffsc5",
                                    "score": 7,
                                    "created_utc": 1666508166.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m talking about assumptions about LKS and JSM relationship or that JSM is being ignored",
            "author": "babymin",
            "id": "itglj7v",
            "parent_id": "t1_itget8r",
            "score": 4,
            "created_utc": 1666535422.0,
            "replies": [
                {
                    "body": "Again, you're speaking as if we're writing out conspiracy theories and stories when at least I myself have made it clear that we don't know anything and the awkwardness we are talking about is just something we felt. It isn't in our minds either. Just because you didn't feel it, doesn't mean you're right. Many sensed it. We're not starting rumours and we're not making up lies. So I don't understand your concern here. I detailed several reasons why JSM's name is brought up here all of which are valid points. She is in this agency, this is a RM sub and many expected to see her in this lineup. So it's only natural that people wonder why she isn't there. \n\nHonestly, at this point we can't talk about anything! This entire sub is just supposed to be what exactly? If you praise someone, you get called cringe. If you criticize someone, you're a hater. If you post pictures and content you're spamming. If you talk about your feelings towards a guest or member or a joke or a scenario, you're too much. \n\nI'd say just ban posting on this subreddit all together. Nothing is allowed here and everything is taken way too seriously and is looked down upon. What in the world is the purpose of having a discussion forum if no topic is allowed for discussion?",
                    "author": null,
                    "id": "itgmqnb",
                    "parent_id": "t1_itglj7v",
                    "score": -1,
                    "created_utc": 1666535956.0,
                    "replies": [
                        {
                            "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
                            "author": "babymin",
                            "id": "itgpbgm",
                            "parent_id": "t1_itgmqnb",
                            "score": 14,
                            "created_utc": 1666537079.0,
                            "replies": [
                                {
                                    "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                                    "author": null,
                                    "id": "itgwrl6",
                                    "parent_id": "t1_itgpbgm",
                                    "score": 2,
                                    "created_utc": 1666540259.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "if you look at the video, theres an actress in actor team 1 and two actresses in actor team 2. \n\nanyways, i don't think it's weird somins not there (though i'd prefer if she was). i saw that some of the idol groups were missing members too so scheduling must've been a nightmare for that many people lol.",
            "author": "botolsusu",
            "id": "itjpof8",
            "parent_id": "t1_ith92hf",
            "score": 3,
            "created_utc": 1666582430.0,
            "replies": []
        },
        {
            "body": "Makes sense, for the HYBE episode there was a team that had the soloists but it only had the makes. Nana is still in Pledis but she wasn’t there. Maybe they just want single gender teams",
            "author": "Mozart-Luna-Echo",
            "id": "itit9q4",
            "parent_id": "t1_ith92hf",
            "score": 4,
            "created_utc": 1666567107.0,
            "replies": []
        },
        {
            "body": "I did wonder if that behavior in those last few months of RM was bc there were so many KwangMin shippers that he really wanted to draw a line in the sand bc he had a gf irl but man it was pretty awkward and abrupt change so it made a lot of people speculate and imagine some creative rifts.",
            "author": "ImpossibleWarning6",
            "id": "itfevsz",
            "parent_id": "t1_itfcps3",
            "score": 8,
            "created_utc": 1666506092.0,
            "replies": [
                {
                    "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
                    "author": null,
                    "id": "itffsc5",
                    "parent_id": "t1_itfevsz",
                    "score": 9,
                    "created_utc": 1666506807.0,
                    "replies": [
                        {
                            "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                            "author": "NavdeepNSG",
                            "id": "itfhi7d",
                            "parent_id": "t1_itffsc5",
                            "score": 7,
                            "created_utc": 1666508166.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Again, you're speaking as if we're writing out conspiracy theories and stories when at least I myself have made it clear that we don't know anything and the awkwardness we are talking about is just something we felt. It isn't in our minds either. Just because you didn't feel it, doesn't mean you're right. Many sensed it. We're not starting rumours and we're not making up lies. So I don't understand your concern here. I detailed several reasons why JSM's name is brought up here all of which are valid points. She is in this agency, this is a RM sub and many expected to see her in this lineup. So it's only natural that people wonder why she isn't there. \n\nHonestly, at this point we can't talk about anything! This entire sub is just supposed to be what exactly? If you praise someone, you get called cringe. If you criticize someone, you're a hater. If you post pictures and content you're spamming. If you talk about your feelings towards a guest or member or a joke or a scenario, you're too much. \n\nI'd say just ban posting on this subreddit all together. Nothing is allowed here and everything is taken way too seriously and is looked down upon. What in the world is the purpose of having a discussion forum if no topic is allowed for discussion?",
            "author": null,
            "id": "itgmqnb",
            "parent_id": "t1_itglj7v",
            "score": -1,
            "created_utc": 1666535956.0,
            "replies": [
                {
                    "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
                    "author": "babymin",
                    "id": "itgpbgm",
                    "parent_id": "t1_itgmqnb",
                    "score": 14,
                    "created_utc": 1666537079.0,
                    "replies": [
                        {
                            "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                            "author": null,
                            "id": "itgwrl6",
                            "parent_id": "t1_itgpbgm",
                            "score": 2,
                            "created_utc": 1666540259.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, not just the instagram follow/unfollow stuff, and not just them being \"awkward\" or not interacting much. They literally stopped talking and reacting to each other and they almost never teamed up or partnered up after episode 525ish. In 524, they had a physical fight with the touch-counter vests and I think it was just a weird mood on set with everyone else standing around watching these two fight and not even laughing or interfering; and at one point I think KJK even said \"they're acting on real feelings\". That whole episode everyone seemed tense though; like Haha actually looked super mad at SJH for blowing/not blowing a whistle and LKS looked mad at YSC and haha and YSC at each other. It was just messy all around, so JSMxLKS didn't even stand out. I just only remembered that one comment. \n\nAnyways, we missed out on a lot more kwangMin between episodes 525-until his departure. I don't care about their personal lives, as in, why they seemed weird, I just hope whatever it was they worked it out and if not they can move on. We got so many great kwangMin moments to look back on and it's easy enough to pretend not to see them being weird. Kind of. I mean I know it's there but I forget. They're professionals is all I'm saying.",
            "author": null,
            "id": "itffsc5",
            "parent_id": "t1_itfevsz",
            "score": 9,
            "created_utc": 1666506807.0,
            "replies": [
                {
                    "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
                    "author": "NavdeepNSG",
                    "id": "itfhi7d",
                    "parent_id": "t1_itffsc5",
                    "score": 7,
                    "created_utc": 1666508166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You just took dramatic to a whole new level. Listen, i don’t care about this enough to keep arguing with you. My opinion is still the same and your essay won’t change it. You are also free to think whatever you want. So I’d like to end this conversation and wish you a good day/evening.",
            "author": "babymin",
            "id": "itgpbgm",
            "parent_id": "t1_itgmqnb",
            "score": 14,
            "created_utc": 1666537079.0,
            "replies": [
                {
                    "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
                    "author": null,
                    "id": "itgwrl6",
                    "parent_id": "t1_itgpbgm",
                    "score": 2,
                    "created_utc": 1666540259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Though, they looked absolutely normal in the next episode.\n\nTime is a great healer.\n\nEven if something happened between them, I hope they would ultimately forget about it.",
            "author": "NavdeepNSG",
            "id": "itfhi7d",
            "parent_id": "t1_itffsc5",
            "score": 7,
            "created_utc": 1666508166.0,
            "replies": []
        },
        {
            "body": "You're right. My explosion wasn't directed at you, just other things piling up. Sorry for snapping at you. You have a good day too.",
            "author": null,
            "id": "itgwrl6",
            "parent_id": "t1_itgpbgm",
            "score": 2,
            "created_utc": 1666540259.0,
            "replies": []
        }
    ]
}