{
    "title": "He was just a liar and a loser",
    "post_id": "ryzjqw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ryzjqw/he_was_just_a_liar_and_a_loser/",
    "author": "AnitaShott",
    "body": "This potential SD I was chatting with asked me how I got into the lifestyle and I told him I was introduced via a friend. He started bragging about dating a ton of different sb’s and hooking up with them, and that he probably knew the friend.(She’s not even on seeking or in this country) \n\nHe asked her name and I gave him a random one. He said she sounded familiar. His words were “If she’s who I’m thinking of shes not a SB she’s basically a hooker.” I was like….okay. 🙄 He asked if I had a picture of her(like yes but I wouldn’t send it to YOU)- so I pulled a random egirl photo from google and he starts ripping this imaginary woman to shreds telling me how what she’s doing isn’t sugaring and she needs to value herself more and how he definitely slept with her on multiple occasions.\n \nHe asked what I was looking for and I let him know I prefer long term dynamics and gave him what I would expect though after him lying I was no longer interested. He told me it was too high for him so I wished him well in his search. He then proceeded to send me photos of him with various women, most of which he was having some sort sexual encounter with(oral or otherwise) and asked me how much I would charge to just meet with him and have sex with no protection. Finally blocked him after that. I don’t know if those women gave him permission to take those photos even, but a fair amount of them were looking into the camera and looked kind of out of it. I think he preys on desperate women and drug addicts just stay safe out there please guys. \n\nThis all happened last year but another post about sending photos with your face brought it to mind. Just be patient and be PICKY! I did find a Daddy through Seeking that aligned with what i was in search of and we fell in love and are now engaged.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ryzjqw/he_was_just_a_liar_and_a_loser/",
    "score": 97,
    "upvote_ratio": 0.96,
    "created_utc": 1641647472.0,
    "num_comments": 39,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Ewwww...can you imagine being in a relationship (of any kind).with that dude? He legit built a full story off a fake name and a Google pic! Smh. Thats a level of crazy you don't even want to be near!! 🤣🤣🤣",
            "author": "letsjusthavefunnow",
            "id": "hrrw2o1",
            "parent_id": "t3_ryzjqw",
            "score": 46,
            "created_utc": 1641648367.0,
            "replies": [
                {
                    "body": "EXACTLY! 😩🤣 All I could think was like those poor women that he’s already been with. Also weird that he shamed the fake woman for ppm and low prices then told me my price was too steep 🥴😂",
                    "author": "AnitaShott",
                    "id": "hrryy8p",
                    "parent_id": "t1_hrrw2o1",
                    "score": 16,
                    "created_utc": 1641649951.0,
                    "replies": []
                },
                {
                    "body": "Good for u thinking to send fake pic of her! That proves everything haha",
                    "author": "NorthernGirlHere",
                    "id": "hrtmwcy",
                    "parent_id": "t1_hrrw2o1",
                    "score": 3,
                    "created_utc": 1641674794.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He is a predator, pure and simple. Lower than pond scum.",
            "author": "Intrepid_Seeker",
            "id": "hrs3q5e",
            "parent_id": "t3_ryzjqw",
            "score": 24,
            "created_utc": 1641652371.0,
            "replies": [
                {
                    "body": "Agreed!",
                    "author": "AnitaShott",
                    "id": "hrs4f11",
                    "parent_id": "t1_hrs3q5e",
                    "score": 3,
                    "created_utc": 1641652699.0,
                    "replies": []
                },
                {
                    "body": "Ummmm how is his predatory behavior different from yalls predatory behavior?  It's a serious question and I'm not trying to troll....",
                    "author": "drmoroe30",
                    "id": "hru8qyl",
                    "parent_id": "t1_hrs3q5e",
                    "score": -1,
                    "created_utc": 1641683704.0,
                    "replies": [
                        {
                            "body": "You're saying that you know that all of us are predators in the same sense? We send images of us having sex with others without their permission, brag endlessly about our conquests and use demeaning language of women? I am pointing out his horrendous behavior. You seem to be assuming were all of the same ilk.",
                            "author": "Intrepid_Seeker",
                            "id": "hrua2nx",
                            "parent_id": "t1_hru8qyl",
                            "score": 1,
                            "created_utc": 1641684248.0,
                            "replies": [
                                {
                                    "body": "While my generalization was unfortunate, every SB/SD experience that I have heard about boils down to the daddy dude wanting sex for as little money as possible while the baby wants as little sex as possible for the most money.   Both sides are manipulating each other to either have more sex or have less sex.   You can slap as much perfume on this pig as you want but that's the crux of it",
                                    "author": "drmoroe30",
                                    "id": "hrubsgv",
                                    "parent_id": "t1_hrua2nx",
                                    "score": 2,
                                    "created_utc": 1641684960.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow congratulations on the engagement, don’t hear of that happening often!",
            "author": "Dry-Location1824",
            "id": "hrrzfue",
            "parent_id": "t3_ryzjqw",
            "score": 7,
            "created_utc": 1641650212.0,
            "replies": [
                {
                    "body": "Thank you! ❤️\nWhen it initially happened I searched this subreddit for it to bond with some other SB’s, and only found like one post on it- I wonder why that it!",
                    "author": "AnitaShott",
                    "id": "hrrztkb",
                    "parent_id": "t1_hrrzfue",
                    "score": 7,
                    "created_utc": 1641650412.0,
                    "replies": [
                        {
                            "body": "Yes it is very unusual, but I have always said “never say never, expect the unexpected!” Maybe you’ll go on to have your own little “sugar babies!?”\n\nI am not engaged but I had two children with my (now ex) SD, after meeting him on SA when I was backpacking in Australia five years ago. \n\nHe’s still heavily involved with our children and we co parent well together, even though we don’t live together no more. I’m yet to still hear another story similar too mine!",
                            "author": "Dry-Location1824",
                            "id": "hrs07x7",
                            "parent_id": "t1_hrrztkb",
                            "score": 4,
                            "created_utc": 1641650617.0,
                            "replies": [
                                {
                                    "body": "Wow! Well I’m glad that even after separating, that you two are able to make the best of it for your little ones! Co-parenting when done right is a beautiful beautiful thing. 😊\n\nAlso yes 😂 the moment I say I do he said he wants to start trying for another! I already have a little one(5) that he’s absolutely amazing with. She adores him and vice versa.",
                                    "author": "AnitaShott",
                                    "id": "hrs0z8l",
                                    "parent_id": "t1_hrs07x7",
                                    "score": 3,
                                    "created_utc": 1641651005.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s very rare but happens. One lady I dated had massive student debt and debt in general and found her fiancé in the bowl. He is 20 odd years older with grown children. She is very happy with him.",
                    "author": null,
                    "id": "hrs6ldz",
                    "parent_id": "t1_hrrzfue",
                    "score": 3,
                    "created_utc": 1641653731.0,
                    "replies": []
                },
                {
                    "body": "*is",
                    "author": "AnitaShott",
                    "id": "hrrzusj",
                    "parent_id": "t1_hrrzfue",
                    "score": 1,
                    "created_utc": 1641650429.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why do SD’s think we get impressed by what they did with other girls… like grow tf up. Or start to list everything they want to do too you.. like I get that you want a fantasy, but give me some freedom to create one!",
            "author": "Brilliant-Fig4189",
            "id": "hru8uk0",
            "parent_id": "t3_ryzjqw",
            "score": 6,
            "created_utc": 1641683745.0,
            "replies": []
        },
        {
            "body": "His schtick was funny in the sense that he is trash talking women for doing what he wants with him. Has to be some twisted self loathing in there, too, which can be dangerous to be around.\n\nYou're probably right that he sees desperate women who need money enough to do what he asks. Makes me sad 😢",
            "author": "ziggy440",
            "id": "hrtpzq6",
            "parent_id": "t3_ryzjqw",
            "score": 6,
            "created_utc": 1641676050.0,
            "replies": []
        },
        {
            "body": "What a weirdo",
            "author": "ma-ri-ah",
            "id": "hrsj452",
            "parent_id": "t3_ryzjqw",
            "score": 3,
            "created_utc": 1641659126.0,
            "replies": []
        },
        {
            "body": "Love your username!",
            "author": "gvsulaker82",
            "id": "hrs572d",
            "parent_id": "t3_ryzjqw",
            "score": 3,
            "created_utc": 1641653072.0,
            "replies": [
                {
                    "body": "Lol thank you!",
                    "author": "AnitaShott",
                    "id": "hrs5stz",
                    "parent_id": "t1_hrs572d",
                    "score": 1,
                    "created_utc": 1641653360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"He started bragging about dating a ton of different sb’s and hooking up with them, and that he probably knew the friend.\"\n\nWhy waste time on losers. \n\nYou should have blocked him at this point.",
            "author": "LuckyINTJ",
            "id": "hrslys2",
            "parent_id": "t3_ryzjqw",
            "score": 3,
            "created_utc": 1641660282.0,
            "replies": [
                {
                    "body": "When he mentioned knowing the friend though I can admit too much free time and curiosity took over, I guess I wanted to see how far he’s take it",
                    "author": "AnitaShott",
                    "id": "hrssoa0",
                    "parent_id": "t1_hrslys2",
                    "score": 4,
                    "created_utc": 1641662911.0,
                    "replies": [
                        {
                            "body": "Boredom happens to the best of us 🤣",
                            "author": "MistressMM",
                            "id": "hru34lh",
                            "parent_id": "t1_hrssoa0",
                            "score": 2,
                            "created_utc": 1641681382.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This was after normal convo so I had given him my Snapchat and I was giving him a little leeway thinking it was just a low self esteem thing.",
                    "author": "AnitaShott",
                    "id": "hrssedm",
                    "parent_id": "t1_hrslys2",
                    "score": 1,
                    "created_utc": 1641662801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "predatory scum",
            "author": "bookworm010101",
            "id": "hrstp5k",
            "parent_id": "t3_ryzjqw",
            "score": 3,
            "created_utc": 1641663310.0,
            "replies": []
        },
        {
            "body": "Yeah, I've been dealing with that crap from broke fucks on SDM. SA has been my favorite, getting more 6-800,000 \"income\" ( I take it with a grain of salt ) message and be respectful. I had a guy tell me he wouldn't be a baller giving me my price 🤣🤣 boo boo, you ain't a baller right now!! 🤣🤣🤣 \nPersonally I think your instincts were dead on...gave a fake name and picture for his grave to be dug deeper by himself. You're disinterest before the stock photo is a good sign that your instincts are strong, follow it!!! Best of luck on your search 🥰🥰",
            "author": "ModdedDoll",
            "id": "hrtxv44",
            "parent_id": "t3_ryzjqw",
            "score": 3,
            "created_utc": 1641679247.0,
            "replies": []
        },
        {
            "body": "PLEASE REPORT HIM. He sounds like a predator! If those women were wasted they couldn’t of consented, or he could of taken advantage of the fact they needed money desperately and that’s why the women when in intoxicated. Please send photo evidence of the texts aswell to seeking.",
            "author": "Intelligent_Signal86",
            "id": "hruk2pj",
            "parent_id": "t3_ryzjqw",
            "score": 3,
            "created_utc": 1641688387.0,
            "replies": [
                {
                    "body": "I did report his profile after the photos! Unfortunately it wasn’t taken down- maybe multiple people have to? \nI’m not on the site anymore though, if I can find the old screen shots of the snaps- I’ll put it in the SB watchlist group I’m in on FB. Thanks for this. I didn’t even consider that portion.",
                    "author": "AnitaShott",
                    "id": "hrukx8d",
                    "parent_id": "t1_hruk2pj",
                    "score": 1,
                    "created_utc": 1641688746.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats on the engagement!!! \n\nNot sure why you talked to creepo for so long though, maybe you were amused. I would have ended things once he began bragging.",
            "author": "thereadinessisall",
            "id": "hrrwioc",
            "parent_id": "t3_ryzjqw",
            "score": 5,
            "created_utc": 1641648621.0,
            "replies": [
                {
                    "body": "Yeah it was for amusement immediately after he started lying. I was sending screenshots to my friend like ‘get a load of this guy.’ Lol but yeah when he started sending pics of him and those other women in compromising position I was like “yeah not cool.” He apologized but I blocked him.",
                    "author": "AnitaShott",
                    "id": "hrrydi5",
                    "parent_id": "t1_hrrwioc",
                    "score": 6,
                    "created_utc": 1641649642.0,
                    "replies": []
                },
                {
                    "body": "Also thank you!!! \nDidn’t think I’d find my soul mate on Seeking but life’s funny like that haha",
                    "author": "AnitaShott",
                    "id": "hrryg7k",
                    "parent_id": "t1_hrrwioc",
                    "score": 4,
                    "created_utc": 1641649683.0,
                    "replies": [
                        {
                            "body": "Gives me some hope. Rare yes. But a boy can dream right?",
                            "author": "thereadinessisall",
                            "id": "hrryjji",
                            "parent_id": "t1_hrryg7k",
                            "score": 6,
                            "created_utc": 1641649734.0,
                            "replies": [
                                {
                                    "body": "I’m wishing you all the best in this new year!! You’ll find your person❤️",
                                    "author": "AnitaShott",
                                    "id": "hrrz5dw",
                                    "parent_id": "t1_hrryjji",
                                    "score": 3,
                                    "created_utc": 1641650056.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nothing happens for nothings. Everything in life has a purpose",
            "author": "Valxxamorcitaaa",
            "id": "hrt7g2b",
            "parent_id": "t3_ryzjqw",
            "score": 2,
            "created_utc": 1641668666.0,
            "replies": []
        },
        {
            "body": ">This all happened last year but another post about sending photos with your face brought it to mind. Just be patient and be PICKY! I did find a Daddy through Seeking that aligned with what i was in search of and we fell in love and are now engaged.\n\ncongrats on the engagement",
            "author": "therewasguy",
            "id": "hrtubu6",
            "parent_id": "t3_ryzjqw",
            "score": 2,
            "created_utc": 1641677818.0,
            "replies": [
                {
                    "body": "Thank you!!!! ❤️",
                    "author": "AnitaShott",
                    "id": "hru2mqd",
                    "parent_id": "t1_hrtubu6",
                    "score": 2,
                    "created_utc": 1641681179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These posts about sugar relationships leading to love, engagement, marriage, are all very uplifting, though it is said that that is very rare.  It's what I was looking for in my first and only sugar relationship, but others emphatically advised that neither party should ever fall in love with the other, and in my case it was indeed a big mistake because I was being played.  The guy you described is obviously a jackass, and there are too many of them in the bowl.",
            "author": "Devastavit",
            "id": "hrwvhet",
            "parent_id": "t3_ryzjqw",
            "score": 2,
            "created_utc": 1641735984.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hrxtfsh",
            "parent_id": "t3_ryzjqw",
            "score": 2,
            "created_utc": 1641750001.0,
            "replies": [
                {
                    "body": "We were in the “talking” stage for a few months, and we dated for six before we decided. Not quite a year, but hey. When you know you know.",
                    "author": "AnitaShott",
                    "id": "hrxuhaq",
                    "parent_id": "t1_hrxtfsh",
                    "score": 1,
                    "created_utc": 1641750378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats on getting engaged. Do you mind making a post on how you met your SD and how it turned into engagement",
            "author": "sxnikki",
            "id": "hs4ynzt",
            "parent_id": "t3_ryzjqw",
            "score": 1,
            "created_utc": 1641860132.0,
            "replies": [
                {
                    "body": "I’ve thought of this! I might, lol if I did I’ll update this comment",
                    "author": "AnitaShott",
                    "id": "hs721i4",
                    "parent_id": "t1_hs4ynzt",
                    "score": 1,
                    "created_utc": 1641901583.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "EXACTLY! 😩🤣 All I could think was like those poor women that he’s already been with. Also weird that he shamed the fake woman for ppm and low prices then told me my price was too steep 🥴😂",
            "author": "AnitaShott",
            "id": "hrryy8p",
            "parent_id": "t1_hrrw2o1",
            "score": 16,
            "created_utc": 1641649951.0,
            "replies": []
        },
        {
            "body": "Good for u thinking to send fake pic of her! That proves everything haha",
            "author": "NorthernGirlHere",
            "id": "hrtmwcy",
            "parent_id": "t1_hrrw2o1",
            "score": 3,
            "created_utc": 1641674794.0,
            "replies": []
        },
        {
            "body": "Agreed!",
            "author": "AnitaShott",
            "id": "hrs4f11",
            "parent_id": "t1_hrs3q5e",
            "score": 3,
            "created_utc": 1641652699.0,
            "replies": []
        },
        {
            "body": "Ummmm how is his predatory behavior different from yalls predatory behavior?  It's a serious question and I'm not trying to troll....",
            "author": "drmoroe30",
            "id": "hru8qyl",
            "parent_id": "t1_hrs3q5e",
            "score": -1,
            "created_utc": 1641683704.0,
            "replies": [
                {
                    "body": "You're saying that you know that all of us are predators in the same sense? We send images of us having sex with others without their permission, brag endlessly about our conquests and use demeaning language of women? I am pointing out his horrendous behavior. You seem to be assuming were all of the same ilk.",
                    "author": "Intrepid_Seeker",
                    "id": "hrua2nx",
                    "parent_id": "t1_hru8qyl",
                    "score": 1,
                    "created_utc": 1641684248.0,
                    "replies": [
                        {
                            "body": "While my generalization was unfortunate, every SB/SD experience that I have heard about boils down to the daddy dude wanting sex for as little money as possible while the baby wants as little sex as possible for the most money.   Both sides are manipulating each other to either have more sex or have less sex.   You can slap as much perfume on this pig as you want but that's the crux of it",
                            "author": "drmoroe30",
                            "id": "hrubsgv",
                            "parent_id": "t1_hrua2nx",
                            "score": 2,
                            "created_utc": 1641684960.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! ❤️\nWhen it initially happened I searched this subreddit for it to bond with some other SB’s, and only found like one post on it- I wonder why that it!",
            "author": "AnitaShott",
            "id": "hrrztkb",
            "parent_id": "t1_hrrzfue",
            "score": 7,
            "created_utc": 1641650412.0,
            "replies": [
                {
                    "body": "Yes it is very unusual, but I have always said “never say never, expect the unexpected!” Maybe you’ll go on to have your own little “sugar babies!?”\n\nI am not engaged but I had two children with my (now ex) SD, after meeting him on SA when I was backpacking in Australia five years ago. \n\nHe’s still heavily involved with our children and we co parent well together, even though we don’t live together no more. I’m yet to still hear another story similar too mine!",
                    "author": "Dry-Location1824",
                    "id": "hrs07x7",
                    "parent_id": "t1_hrrztkb",
                    "score": 4,
                    "created_utc": 1641650617.0,
                    "replies": [
                        {
                            "body": "Wow! Well I’m glad that even after separating, that you two are able to make the best of it for your little ones! Co-parenting when done right is a beautiful beautiful thing. 😊\n\nAlso yes 😂 the moment I say I do he said he wants to start trying for another! I already have a little one(5) that he’s absolutely amazing with. She adores him and vice versa.",
                            "author": "AnitaShott",
                            "id": "hrs0z8l",
                            "parent_id": "t1_hrs07x7",
                            "score": 3,
                            "created_utc": 1641651005.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s very rare but happens. One lady I dated had massive student debt and debt in general and found her fiancé in the bowl. He is 20 odd years older with grown children. She is very happy with him.",
            "author": null,
            "id": "hrs6ldz",
            "parent_id": "t1_hrrzfue",
            "score": 3,
            "created_utc": 1641653731.0,
            "replies": []
        },
        {
            "body": "*is",
            "author": "AnitaShott",
            "id": "hrrzusj",
            "parent_id": "t1_hrrzfue",
            "score": 1,
            "created_utc": 1641650429.0,
            "replies": []
        },
        {
            "body": "Lol thank you!",
            "author": "AnitaShott",
            "id": "hrs5stz",
            "parent_id": "t1_hrs572d",
            "score": 1,
            "created_utc": 1641653360.0,
            "replies": []
        },
        {
            "body": "When he mentioned knowing the friend though I can admit too much free time and curiosity took over, I guess I wanted to see how far he’s take it",
            "author": "AnitaShott",
            "id": "hrssoa0",
            "parent_id": "t1_hrslys2",
            "score": 4,
            "created_utc": 1641662911.0,
            "replies": [
                {
                    "body": "Boredom happens to the best of us 🤣",
                    "author": "MistressMM",
                    "id": "hru34lh",
                    "parent_id": "t1_hrssoa0",
                    "score": 2,
                    "created_utc": 1641681382.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was after normal convo so I had given him my Snapchat and I was giving him a little leeway thinking it was just a low self esteem thing.",
            "author": "AnitaShott",
            "id": "hrssedm",
            "parent_id": "t1_hrslys2",
            "score": 1,
            "created_utc": 1641662801.0,
            "replies": []
        },
        {
            "body": "I did report his profile after the photos! Unfortunately it wasn’t taken down- maybe multiple people have to? \nI’m not on the site anymore though, if I can find the old screen shots of the snaps- I’ll put it in the SB watchlist group I’m in on FB. Thanks for this. I didn’t even consider that portion.",
            "author": "AnitaShott",
            "id": "hrukx8d",
            "parent_id": "t1_hruk2pj",
            "score": 1,
            "created_utc": 1641688746.0,
            "replies": []
        },
        {
            "body": "Yeah it was for amusement immediately after he started lying. I was sending screenshots to my friend like ‘get a load of this guy.’ Lol but yeah when he started sending pics of him and those other women in compromising position I was like “yeah not cool.” He apologized but I blocked him.",
            "author": "AnitaShott",
            "id": "hrrydi5",
            "parent_id": "t1_hrrwioc",
            "score": 6,
            "created_utc": 1641649642.0,
            "replies": []
        },
        {
            "body": "Also thank you!!! \nDidn’t think I’d find my soul mate on Seeking but life’s funny like that haha",
            "author": "AnitaShott",
            "id": "hrryg7k",
            "parent_id": "t1_hrrwioc",
            "score": 4,
            "created_utc": 1641649683.0,
            "replies": [
                {
                    "body": "Gives me some hope. Rare yes. But a boy can dream right?",
                    "author": "thereadinessisall",
                    "id": "hrryjji",
                    "parent_id": "t1_hrryg7k",
                    "score": 6,
                    "created_utc": 1641649734.0,
                    "replies": [
                        {
                            "body": "I’m wishing you all the best in this new year!! You’ll find your person❤️",
                            "author": "AnitaShott",
                            "id": "hrrz5dw",
                            "parent_id": "t1_hrryjji",
                            "score": 3,
                            "created_utc": 1641650056.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!!!! ❤️",
            "author": "AnitaShott",
            "id": "hru2mqd",
            "parent_id": "t1_hrtubu6",
            "score": 2,
            "created_utc": 1641681179.0,
            "replies": []
        },
        {
            "body": "We were in the “talking” stage for a few months, and we dated for six before we decided. Not quite a year, but hey. When you know you know.",
            "author": "AnitaShott",
            "id": "hrxuhaq",
            "parent_id": "t1_hrxtfsh",
            "score": 1,
            "created_utc": 1641750378.0,
            "replies": []
        },
        {
            "body": "I’ve thought of this! I might, lol if I did I’ll update this comment",
            "author": "AnitaShott",
            "id": "hs721i4",
            "parent_id": "t1_hs4ynzt",
            "score": 1,
            "created_utc": 1641901583.0,
            "replies": []
        },
        {
            "body": "You're saying that you know that all of us are predators in the same sense? We send images of us having sex with others without their permission, brag endlessly about our conquests and use demeaning language of women? I am pointing out his horrendous behavior. You seem to be assuming were all of the same ilk.",
            "author": "Intrepid_Seeker",
            "id": "hrua2nx",
            "parent_id": "t1_hru8qyl",
            "score": 1,
            "created_utc": 1641684248.0,
            "replies": [
                {
                    "body": "While my generalization was unfortunate, every SB/SD experience that I have heard about boils down to the daddy dude wanting sex for as little money as possible while the baby wants as little sex as possible for the most money.   Both sides are manipulating each other to either have more sex or have less sex.   You can slap as much perfume on this pig as you want but that's the crux of it",
                    "author": "drmoroe30",
                    "id": "hrubsgv",
                    "parent_id": "t1_hrua2nx",
                    "score": 2,
                    "created_utc": 1641684960.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes it is very unusual, but I have always said “never say never, expect the unexpected!” Maybe you’ll go on to have your own little “sugar babies!?”\n\nI am not engaged but I had two children with my (now ex) SD, after meeting him on SA when I was backpacking in Australia five years ago. \n\nHe’s still heavily involved with our children and we co parent well together, even though we don’t live together no more. I’m yet to still hear another story similar too mine!",
            "author": "Dry-Location1824",
            "id": "hrs07x7",
            "parent_id": "t1_hrrztkb",
            "score": 4,
            "created_utc": 1641650617.0,
            "replies": [
                {
                    "body": "Wow! Well I’m glad that even after separating, that you two are able to make the best of it for your little ones! Co-parenting when done right is a beautiful beautiful thing. 😊\n\nAlso yes 😂 the moment I say I do he said he wants to start trying for another! I already have a little one(5) that he’s absolutely amazing with. She adores him and vice versa.",
                    "author": "AnitaShott",
                    "id": "hrs0z8l",
                    "parent_id": "t1_hrs07x7",
                    "score": 3,
                    "created_utc": 1641651005.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Boredom happens to the best of us 🤣",
            "author": "MistressMM",
            "id": "hru34lh",
            "parent_id": "t1_hrssoa0",
            "score": 2,
            "created_utc": 1641681382.0,
            "replies": []
        },
        {
            "body": "Gives me some hope. Rare yes. But a boy can dream right?",
            "author": "thereadinessisall",
            "id": "hrryjji",
            "parent_id": "t1_hrryg7k",
            "score": 6,
            "created_utc": 1641649734.0,
            "replies": [
                {
                    "body": "I’m wishing you all the best in this new year!! You’ll find your person❤️",
                    "author": "AnitaShott",
                    "id": "hrrz5dw",
                    "parent_id": "t1_hrryjji",
                    "score": 3,
                    "created_utc": 1641650056.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While my generalization was unfortunate, every SB/SD experience that I have heard about boils down to the daddy dude wanting sex for as little money as possible while the baby wants as little sex as possible for the most money.   Both sides are manipulating each other to either have more sex or have less sex.   You can slap as much perfume on this pig as you want but that's the crux of it",
            "author": "drmoroe30",
            "id": "hrubsgv",
            "parent_id": "t1_hrua2nx",
            "score": 2,
            "created_utc": 1641684960.0,
            "replies": []
        },
        {
            "body": "Wow! Well I’m glad that even after separating, that you two are able to make the best of it for your little ones! Co-parenting when done right is a beautiful beautiful thing. 😊\n\nAlso yes 😂 the moment I say I do he said he wants to start trying for another! I already have a little one(5) that he’s absolutely amazing with. She adores him and vice versa.",
            "author": "AnitaShott",
            "id": "hrs0z8l",
            "parent_id": "t1_hrs07x7",
            "score": 3,
            "created_utc": 1641651005.0,
            "replies": []
        },
        {
            "body": "I’m wishing you all the best in this new year!! You’ll find your person❤️",
            "author": "AnitaShott",
            "id": "hrrz5dw",
            "parent_id": "t1_hrryjji",
            "score": 3,
            "created_utc": 1641650056.0,
            "replies": []
        }
    ]
}