{
    "title": "entirety of naruto shippuden",
    "post_id": "m6xxva",
    "post_url": "https://www.reddit.com/r/dankruto/comments/m6xxva/entirety_of_naruto_shippuden/",
    "author": "azulepearl",
    "body": "",
    "url": "https://i.redd.it/sh776e72mkn61.png",
    "score": 9151,
    "upvote_ratio": 1.0,
    "created_utc": 1615979123.0,
    "num_comments": 96,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I was wondering if I should rewatch Shippuden and damn you Imma do it. I miss old depressed Naruto",
            "author": "Albreitx",
            "id": "gr8dgok",
            "parent_id": "t3_m6xxva",
            "score": 374,
            "created_utc": 1615985979.0,
            "replies": [
                {
                    "body": "The shit Naruto went through is more than enough to have a few cases of PTSD",
                    "author": "saiyanfang10",
                    "id": "gr8jn0b",
                    "parent_id": "t1_gr8dgok",
                    "score": 236,
                    "created_utc": 1615989355.0,
                    "replies": [
                        {
                            "body": "I know, how I summarize the entire show is Knucklehead Ninja becomes super OP trying to fulfill a promise that is eating at his life.",
                            "author": "T-ROY_T-REDDIT",
                            "id": "gr93rob",
                            "parent_id": "t1_gr8jn0b",
                            "score": 159,
                            "created_utc": 1615998752.0,
                            "replies": [
                                {
                                    "body": "It surpassed just being for the promise not very long into the show tbh",
                                    "author": "lexie98789",
                                    "id": "gr9bb9p",
                                    "parent_id": "t1_gr93rob",
                                    "score": 39,
                                    "created_utc": 1616002096.0,
                                    "replies": [
                                        {
                                            "body": "im pretty sure you could argue it was never about the promise. do you really think if Sakura hadn't asked Naruto to get Sasuke back that he would have just let him leave? from the time when they fought on the rooftop and Sasuke refused to put on his headband, Naruto's mind was set on helping Sasuke.\n\nAfter he left, it instantly became about getting him back. It was already going to be the exact same mindset for Naruto, hell the Shikamaru 5 already had their mission before Sakura came running up crying, making it all about her. And tbh, Sasuke didn't give af about Sakura during his vengeance tour; Naruto was the one who entirely won him back. Hell, I think Sai had a greater impact on Sasuke's return to Konoha than Sakura lmfao",
                                            "author": "Harden-Soul",
                                            "id": "gr9wbm0",
                                            "parent_id": "t1_gr9bb9p",
                                            "score": 48,
                                            "created_utc": 1616011394.0,
                                            "replies": [
                                                {
                                                    "body": "I think you’re honestly very close to being right, but I think in Naruto’s mind it was about the promise in the beginning.",
                                                    "author": "lexie98789",
                                                    "id": "gra4cz5",
                                                    "parent_id": "t1_gr9wbm0",
                                                    "score": 10,
                                                    "created_utc": 1616015025.0,
                                                    "replies": [
                                                        {
                                                            "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
                                                            "author": null,
                                                            "id": "grage1h",
                                                            "parent_id": "t1_gra4cz5",
                                                            "score": 12,
                                                            "created_utc": 1616020818.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                                                                    "author": "lexie98789",
                                                                    "id": "grb2tmh",
                                                                    "parent_id": "t1_grage1h",
                                                                    "score": 6,
                                                                    "created_utc": 1616032471.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It wasn't bc of the promise tho. It was something he wanted to do anyways with or without the promise. He himself tells sai during that orochimaru's lair arc that he was trying to bring sasuke back bc he was his closest friend and sasuke was among the first people who acknowledged him properly which is kinda big for him",
                                    "author": "azulepearl",
                                    "id": "gr9brs7",
                                    "parent_id": "t1_gr93rob",
                                    "score": 25,
                                    "created_utc": 1616002297.0,
                                    "replies": []
                                },
                                {
                                    "body": "not just that, Naruto's soul got split in half",
                                    "author": "saiyanfang10",
                                    "id": "gr95ktr",
                                    "parent_id": "t1_gr93rob",
                                    "score": 26,
                                    "created_utc": 1615999552.0,
                                    "replies": [
                                        {
                                            "body": "Basically all the best shounen have the main character be The Left Brain and his friend/sidekick is The Right Brain. Or maybe just a few but it’s true for naruto",
                                            "author": "suzellezus",
                                            "id": "gr9t2id",
                                            "parent_id": "t1_gr95ktr",
                                            "score": 8,
                                            "created_utc": 1616009946.0,
                                            "replies": [
                                                {
                                                    "body": "what does this have to do with anything, Naruto's soul was literally sawn in half",
                                                    "author": "saiyanfang10",
                                                    "id": "gra5fbh",
                                                    "parent_id": "t1_gr9t2id",
                                                    "score": 5,
                                                    "created_utc": 1616015525.0,
                                                    "replies": [
                                                        {
                                                            "body": "Maybe I haven’t gotten to that part or missed it",
                                                            "author": "suzellezus",
                                                            "id": "gramm8m",
                                                            "parent_id": "t1_gra5fbh",
                                                            "score": 2,
                                                            "created_utc": 1616024024.0,
                                                            "replies": [
                                                                {
                                                                    "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                                                                    "author": "saiyanfang10",
                                                                    "id": "graoh3i",
                                                                    "parent_id": "t1_gramm8m",
                                                                    "score": 4,
                                                                    "created_utc": 1616024994.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh yeah",
                                                                            "author": "suzellezus",
                                                                            "id": "grard1t",
                                                                            "parent_id": "t1_graoh3i",
                                                                            "score": 2,
                                                                            "created_utc": 1616026507.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It wasn't just a promise it was a self rule straight from the school of youth.",
                                    "author": "SmallerBork",
                                    "id": "grbbzt8",
                                    "parent_id": "t1_gr93rob",
                                    "score": 3,
                                    "created_utc": 1616037498.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My man literally fainted from stress at one point, so I wouldn't be surprised",
                            "author": "CombatWombat994",
                            "id": "gr9wkdw",
                            "parent_id": "t1_gr8jn0b",
                            "score": 3,
                            "created_utc": 1616011507.0,
                            "replies": []
                        },
                        {
                            "body": "All for an emo ass boi who couldn't give a shit about him.",
                            "author": "TyrionGoldenLion",
                            "id": "gr9if6w",
                            "parent_id": "t1_gr8jn0b",
                            "score": 6,
                            "created_utc": 1616005212.0,
                            "replies": [
                                {
                                    "body": "He did gave a shit about him tho. He literally nearly sacrificed his life TWICE for naruto during part 1 and went door to door looking for naruto when he found out that itachi was after him. It was just that after his encounter with itachi he was too traumatized to give a shit about anything except his goals. All this continued in shippuden till the end.",
                                    "author": "azulepearl",
                                    "id": "gr9ncdx",
                                    "parent_id": "t1_gr9if6w",
                                    "score": 28,
                                    "created_utc": 1616007387.0,
                                    "replies": [
                                        {
                                            "body": "Not at this point. Sasuke after Itachi just didn't give a fuck anymore.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gr9ng4t",
                                            "parent_id": "t1_gr9ncdx",
                                            "score": 5,
                                            "created_utc": 1616007433.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "not just Sasuke, he was treated like not a human, it's literally everyone but Hinata and Teuchi",
                                    "author": "saiyanfang10",
                                    "id": "gr9ik4g",
                                    "parent_id": "t1_gr9if6w",
                                    "score": 5,
                                    "created_utc": 1616005272.0,
                                    "replies": [
                                        {
                                            "body": "Yeah but I meant at this particular time the original post is about. Naruto's life got so much better after Pein arc but he put himself through so much for an emo boi who didn't deserve it.",
                                            "author": "TyrionGoldenLion",
                                            "id": "gr9ir58",
                                            "parent_id": "t1_gr9ik4g",
                                            "score": 2,
                                            "created_utc": 1616005359.0,
                                            "replies": [
                                                {
                                                    "body": "Okay but like can we please talk about how fucked up and hollow it must have felt for him when all these people who used to make his life hell started acting like all the shit they put him through never happened and just started idolizing him because he saved the village? \n\nLike, um, no. Fuck you villagers you don't get to pretend you didn't emotionally, psychologically, and in some cases physically abuse and neglect a child for over a decade and a half and then turn around and act like he's the best thing that's ever happened to Konoha once he's proved himself useful to you. \n\nHe shouldn't have had to work as hard as he did just to earn the villager's approval, hell if anything the villagers are the ones who should be putting in an effort to try and earn his forgiveness. \n\nIf there is anyone who doesn't deserve all the hard work Naruto put into rescuing them, it's the villagers of Konoha.",
                                                    "author": "HollyTheMage",
                                                    "id": "gr9ypne",
                                                    "parent_id": "t1_gr9ir58",
                                                    "score": 12,
                                                    "created_utc": 1616012477.0,
                                                    "replies": [
                                                        {
                                                            "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
                                                            "author": "saiyanfang10",
                                                            "id": "gracgke",
                                                            "parent_id": "t1_gr9ypne",
                                                            "score": 5,
                                                            "created_utc": 1616018869.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
                                                            "author": "TyrionGoldenLion",
                                                            "id": "grbngmu",
                                                            "parent_id": "t1_gr9ypne",
                                                            "score": 2,
                                                            "created_utc": 1616045187.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If I wanted to re watch naruto from beginning to end who has it? \n\nNetflix has naruto shippuden but who has the OG naruto before that? Or is naruto shippuden the First series?",
                    "author": "LowkeyEboy",
                    "id": "gr9o4b7",
                    "parent_id": "t1_gr8dgok",
                    "score": 6,
                    "created_utc": 1616007729.0,
                    "replies": [
                        {
                            "body": "I don't know where you are, but where I live all or Naruto is available on Crunchyroll for free (although with ads but the AdBlock does the trick). And yeah, first is just \"Naruto\" and then Naruto Shippuden.",
                            "author": "Albreitx",
                            "id": "gr9okdr",
                            "parent_id": "t1_gr9o4b7",
                            "score": 7,
                            "created_utc": 1616007929.0,
                            "replies": [
                                {
                                    "body": "Some people are saying to stop at a certain episode of naruto then start naruto shippuden? Then go back to naruto? I’m confused lol.",
                                    "author": "LowkeyEboy",
                                    "id": "gr9ow8q",
                                    "parent_id": "t1_gr9okdr",
                                    "score": 3,
                                    "created_utc": 1616008077.0,
                                    "replies": [
                                        {
                                            "body": "It is probably to skip fillers. Just check Anime Filler List and watch according to it. And after SD, watch Naruto: The Last. It is a movie.",
                                            "author": "MrLeeRob",
                                            "id": "gr9pu9e",
                                            "parent_id": "t1_gr9ow8q",
                                            "score": 8,
                                            "created_utc": 1616008502.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gr9qoyb",
                                                    "parent_id": "t1_gr9pu9e",
                                                    "score": 1,
                                                    "created_utc": 1616008879.0,
                                                    "replies": [
                                                        {
                                                            "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
                                                            "author": "MrLeeRob",
                                                            "id": "gr9s26j",
                                                            "parent_id": "t1_gr9qoyb",
                                                            "score": 1,
                                                            "created_utc": 1616009491.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Naruspot",
                                                            "author": "Captainprice101",
                                                            "id": "graj59m",
                                                            "parent_id": "t1_gr9qoyb",
                                                            "score": 1,
                                                            "created_utc": 1616022223.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I've never heard something like that lol. I only know that the last 80 or so episodes of \"Naruto\" are fillers. You can google lists of filler episodes and just skip them. However, I recommend you to watch the \"Chikara\"(Power) fillers in Shippuden. They are really good.\n\nFor clarity: fillers are episodes that were made to \"fill\" time because the anime advanced way faster than the manga. They had to air something while the manga was being done and therefore these fillers are \"non-canon\".",
                                            "author": "Albreitx",
                                            "id": "gr9pxxu",
                                            "parent_id": "t1_gr9ow8q",
                                            "score": 3,
                                            "created_utc": 1616008547.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[This site](https://www18.naruspot.tv/category/naruto-shippuden-dubbed/) is my friend aaaahahh.\n\nAlso, i have ad block plus so we might experience that part of the internet differently in that.. I don't experience any ads",
                    "author": "Lonesome_Ninja",
                    "id": "gra61ke",
                    "parent_id": "t1_gr8dgok",
                    "score": 3,
                    "created_utc": 1616015814.0,
                    "replies": []
                },
                {
                    "body": "I rewatched up to the end of the pain arc, then stopped because I remember the rest of the show from that point in being a fucking slog to get through",
                    "author": "wallyjwaddles",
                    "id": "gramhd3",
                    "parent_id": "t1_gr8dgok",
                    "score": 2,
                    "created_utc": 1616023952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto simping for Sasuke so hard that he allowed himself to get his ass beat by Karui for him. Now that’s true love.",
            "author": "UnfilteredRedditor",
            "id": "gr9nsor",
            "parent_id": "t3_m6xxva",
            "score": 93,
            "created_utc": 1616007586.0,
            "replies": [
                {
                    "body": "That was so fucking funny. I read that in the manga like “...ok?”",
                    "author": "Femartian",
                    "id": "gr9s6w1",
                    "parent_id": "t1_gr9nsor",
                    "score": 36,
                    "created_utc": 1616009550.0,
                    "replies": [
                        {
                            "body": "Me personally that was the point that reassured that I lost all respect for the character.",
                            "author": "UnfilteredRedditor",
                            "id": "gr9vgrs",
                            "parent_id": "t1_gr9s6w1",
                            "score": 2,
                            "created_utc": 1616011015.0,
                            "replies": [
                                {
                                    "body": "I started crying at that part actually",
                                    "author": "HollyTheMage",
                                    "id": "gr9yui1",
                                    "parent_id": "t1_gr9vgrs",
                                    "score": 17,
                                    "created_utc": 1616012538.0,
                                    "replies": [
                                        {
                                            "body": "I thought it was kind of unnecessary. \n\nBut it also tells a lot about Naruto's mental state.\n\nMost people think Naruto dealt with his trauma in a healthy way because he didn't go nuts like Sasuke.",
                                            "author": null,
                                            "id": "grahdy8",
                                            "parent_id": "t1_gr9yui1",
                                            "score": 13,
                                            "created_utc": 1616021320.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Honestly i wish that after sasuke came back they at least SHOWED them hanging out as friends just to make everything naruto went through for sasuke worthwhile like what even was the point of showing naruto letting himself get beat up and begging on his knees to save sasuke if they weren't even going to show them as friends again??? Sasuke \"becomes good\" and leaves the village again and then we just skip to boruto where they ARE friends but their interactions have been tinged with their adult personalities and sasuke still is not in the village most of the time\nWe really deserved to see naruto and sasuke during their early 20s just goofing around lol",
                    "author": "azulepearl",
                    "id": "grbedn1",
                    "parent_id": "t1_gr9nsor",
                    "score": 22,
                    "created_utc": 1616038902.0,
                    "replies": []
                },
                {
                    "body": "Simping and true love are mutually exclusive.",
                    "author": "SmallerBork",
                    "id": "grbcwip",
                    "parent_id": "t1_gr9nsor",
                    "score": 5,
                    "created_utc": 1616038029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this hurts because it's true.",
            "author": "shadowylurking",
            "id": "gr93cyu",
            "parent_id": "t3_m6xxva",
            "score": 34,
            "created_utc": 1615998571.0,
            "replies": []
        },
        {
            "body": "Bro's before hoes",
            "author": "P12hP0sh",
            "id": "gr8ypfd",
            "parent_id": "t3_m6xxva",
            "score": 92,
            "created_utc": 1615996516.0,
            "replies": [
                {
                    "body": "Y'all just have to accept that Sasuke and Naruto where in love with one another and both Hinata and Sakura were sidepieces.",
                    "author": "Anonim97",
                    "id": "gr9pcbg",
                    "parent_id": "t1_gr8ypfd",
                    "score": 56,
                    "created_utc": 1616008278.0,
                    "replies": [
                        {
                            "body": "Yes",
                            "author": null,
                            "id": "gr9ucnv",
                            "parent_id": "t1_gr9pcbg",
                            "score": 18,
                            "created_utc": 1616010520.0,
                            "replies": []
                        },
                        {
                            "body": "Wait but if they're bros, that's incest",
                            "author": "SmallerBork",
                            "id": "grbml4l",
                            "parent_id": "t1_gr9pcbg",
                            "score": 3,
                            "created_utc": 1616044493.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sasuke seemed more of a hoe in that scenario tho 😭 naruto was chasing the high of that first kiss 😭",
                    "author": "azulepearl",
                    "id": "gr9c3m7",
                    "parent_id": "t1_gr8ypfd",
                    "score": 75,
                    "created_utc": 1616002441.0,
                    "replies": []
                },
                {
                    "body": "Hinata wasn't a hoe but I get your point. Sakura was when she tempted Naruto in the snow though.",
                    "author": "SmallerBork",
                    "id": "grbdhu8",
                    "parent_id": "t1_gr8ypfd",
                    "score": 7,
                    "created_utc": 1616038376.0,
                    "replies": [
                        {
                            "body": "Imagine defending a fictional characters honor 😎",
                            "author": "PleasantPeanut4",
                            "id": "grbhwsb",
                            "parent_id": "t1_grbdhu8",
                            "score": 1,
                            "created_utc": 1616041133.0,
                            "replies": [
                                {
                                    "body": "Nope, I don't have waifus.\n\nDebating over fiction is what you do in English class. It's usually boring because of the material but when it's a good fiction of our time we do what people have done since the beginning of civilization.\n\nAnd I like Sakura's overall character as well, I don't hate on her like others.",
                                    "author": "SmallerBork",
                                    "id": "grbld7c",
                                    "parent_id": "t1_grbhwsb",
                                    "score": 4,
                                    "created_utc": 1616043565.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But my parents aren't home\n\nNeither are sasukes",
            "author": "Angelemonade",
            "id": "gr9rk3x",
            "parent_id": "t3_m6xxva",
            "score": 31,
            "created_utc": 1616009270.0,
            "replies": [
                {
                    "body": "Or Iruka's. Or Kakashi's. Or Yamato's. Or Sai's. Or Gaara, Temari, and Kankuro's. \n\nActually where are Rock Lee's parents (I mean Guy is basically a father to him, but I mean like biologically)?\n\nOr Tenten's parents for that matter?\n\nWhere are Neji and Hinata's respective mothers?\n\nThere are so many questions that are just never answered.",
                    "author": "HollyTheMage",
                    "id": "gr9zh8j",
                    "parent_id": "t1_gr9rk3x",
                    "score": 20,
                    "created_utc": 1616012829.0,
                    "replies": [
                        {
                            "body": ">Actually where are Rock Lee's parents\n\nI know this is a little late but in one of the fillers, it was revealed the Lee's father sacrified himself in order to save Lee from the Mist Swordsmen that were trying to infiltrate the village (the group Zabusa was part of IDK how they were called). \n\nMfer unleased almost all his Gates and managed to kill 2 or 3 HIGHLY TRAINED SHINOBI despite being seen as a joke by the rest of the village for only using Taijutsu.",
                            "author": "kriosken12",
                            "id": "guhedpe",
                            "parent_id": "t1_gr9zh8j",
                            "score": 6,
                            "created_utc": 1618405529.0,
                            "replies": [
                                {
                                    "body": "I know it's a little late but that was guy's father, not rock lee's",
                                    "author": "Prinsekat",
                                    "id": "j75jc3b",
                                    "parent_id": "t1_guhedpe",
                                    "score": 2,
                                    "created_utc": 1675489642.0,
                                    "replies": [
                                        {
                                            "body": "My bad",
                                            "author": "kriosken12",
                                            "id": "j75ku0n",
                                            "parent_id": "t1_j75jc3b",
                                            "score": 1,
                                            "created_utc": 1675490681.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "i mean kakashi, gaara, temari, and kankuro's parents are all dead and were the whole series lmao",
                            "author": "ChainsOfHearts",
                            "id": "gradjo8",
                            "parent_id": "t1_gr9zh8j",
                            "score": 1,
                            "created_utc": 1616019395.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then the flute starts playing",
            "author": "Skygamimg35",
            "id": "gr9ikqc",
            "parent_id": "t3_m6xxva",
            "score": 16,
            "created_utc": 1616005280.0,
            "replies": []
        },
        {
            "body": "Good one",
            "author": "LayZyt",
            "id": "gr856vu",
            "parent_id": "t3_m6xxva",
            "score": 23,
            "created_utc": 1615980245.0,
            "replies": []
        },
        {
            "body": "could have said ‘neither are mine’ but thats too sad ahahaha",
            "author": "amajidx",
            "id": "gr9lul8",
            "parent_id": "t3_m6xxva",
            "score": 13,
            "created_utc": 1616006730.0,
            "replies": []
        },
        {
            "body": "I got my boyfriend into watch Naruto and he is convinced Naruto is in love with Sasuke and this is not just a friendship. We both are mad that nothing really happens with them (romantically) by the ending of Shippuden",
            "author": "Belensmontana",
            "id": "gr9wlqw",
            "parent_id": "t3_m6xxva",
            "score": 23,
            "created_utc": 1616011525.0,
            "replies": [
                {
                    "body": "People always complain about “forced homosexuality” on Netflix, but Naruto has forced heterosexuality fr. They had to make a whole ass movie for NaruHina to make sense smh",
                    "author": "PleasantPeanut4",
                    "id": "grbi586",
                    "parent_id": "t1_gr9wlqw",
                    "score": 24,
                    "created_utc": 1616041287.0,
                    "replies": [
                        {
                            "body": "Omg friend, you’re so right :(",
                            "author": "Belensmontana",
                            "id": "grbiby2",
                            "parent_id": "t1_grbi586",
                            "score": 8,
                            "created_utc": 1616041413.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best meme I've ever seen I'M NOT LYING",
            "author": "1984_Eye",
            "id": "gr9i56x",
            "parent_id": "t3_m6xxva",
            "score": 9,
            "created_utc": 1616005088.0,
            "replies": [
                {
                    "body": "Yas you are. Or you have not seen this:\n\n\nhttps://i.pinimg.com/736x/54/82/19/548219fdc984cf545d6012cd71134f4f.jpg",
                    "author": "km4xX",
                    "id": "gr9kzbd",
                    "parent_id": "t1_gr9i56x",
                    "score": 13,
                    "created_utc": 1616006348.0,
                    "replies": [
                        {
                            "body": "Yeah no he's lying, especially if he's seen this one",
                            "author": "Haelstrom101",
                            "id": "gr9y6ns",
                            "parent_id": "t1_gr9kzbd",
                            "score": 7,
                            "created_utc": 1616012243.0,
                            "replies": [
                                {
                                    "body": "Deserved",
                                    "author": "1984_Eye",
                                    "id": "grercsv",
                                    "parent_id": "t1_gr9y6ns",
                                    "score": 3,
                                    "created_utc": 1616102478.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mentions sasuke in shippuden s/n has a mental breakdown",
            "author": "Loose_Meal_499",
            "id": "gr9pacn",
            "parent_id": "t3_m6xxva",
            "score": 9,
            "created_utc": 1616008253.0,
            "replies": []
        },
        {
            "body": "My brother and I were convinced that Naruto was bisexual... for real... I mean, I know its just a caring friendship but uh, the guy tried to kill you multiple times and he still chased after him??? WHAT???",
            "author": "brokebacknomountain",
            "id": "gr9inyl",
            "parent_id": "t3_m6xxva",
            "score": 22,
            "created_utc": 1616005319.0,
            "replies": [
                {
                    "body": "i think naruto just loves the high he gets from the chase",
                    "author": null,
                    "id": "grb5gfn",
                    "parent_id": "t1_gr9inyl",
                    "score": 6,
                    "created_utc": 1616033854.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I want this framed and hung on my wall. This is the best version of that meme I’ve ever seen in the thousands and thousands. I’m still giggling like an idiot at it.",
            "author": "WildFire97936",
            "id": "gra9xet",
            "parent_id": "t3_m6xxva",
            "score": 6,
            "created_utc": 1616017658.0,
            "replies": []
        },
        {
            "body": "yep",
            "author": "AtlaSecretTunnel",
            "id": "gr93eb8",
            "parent_id": "t3_m6xxva",
            "score": 4,
            "created_utc": 1615998588.0,
            "replies": []
        },
        {
            "body": "Ok but the second picture pleaseeeeee 🥴",
            "author": "cosmicZED",
            "id": "gr96m7c",
            "parent_id": "t3_m6xxva",
            "score": 5,
            "created_utc": 1616000010.0,
            "replies": [
                {
                    "body": "Mans was going through it",
                    "author": "azulepearl",
                    "id": "gr9c82o",
                    "parent_id": "t1_gr96m7c",
                    "score": 7,
                    "created_utc": 1616002495.0,
                    "replies": [
                        {
                            "body": "DO YOU REMEMBER WHEN HE HAD A PANIC ATTACK AND PASSED OUT IN THE SNOW THAT SHIT GOT WAY TOO REAL FOR ME",
                            "author": "HollyTheMage",
                            "id": "gr9z0dm",
                            "parent_id": "t1_gr9c82o",
                            "score": 9,
                            "created_utc": 1616012614.0,
                            "replies": [
                                {
                                    "body": "I LEGIT CRIED OML",
                                    "author": "cosmicZED",
                                    "id": "grapnv5",
                                    "parent_id": "t1_gr9z0dm",
                                    "score": 5,
                                    "created_utc": 1616025624.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now that’s a homie",
            "author": null,
            "id": "grak5bh",
            "parent_id": "t3_m6xxva",
            "score": 2,
            "created_utc": 1616022738.0,
            "replies": []
        },
        {
            "body": "Does hinata have a mom?",
            "author": "Kobil420",
            "id": "grbtqsc",
            "parent_id": "t3_m6xxva",
            "score": 2,
            "created_utc": 1616050661.0,
            "replies": [
                {
                    "body": "With the way that her father acts and treats her, I'm guessing not. Studio Pierrot might try to give her one for filler purposes, but that doesn't change the fact that Kishimoto never gave Hinata a mother",
                    "author": "gotumms146",
                    "id": "gs2mb8s",
                    "parent_id": "t1_grbtqsc",
                    "score": 1,
                    "created_utc": 1616607402.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Neither are mine\" would make this 10x better",
            "author": "ElTamalero69",
            "id": "gra72yt",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616016307.0,
            "replies": []
        },
        {
            "body": "Useless trash(hinata for all of you idiotic simps/sakura haters): my parents aren’t home\nNaruto: mine aren’t either",
            "author": "j4hdisgdjq",
            "id": "gr9o0gt",
            "parent_id": "t3_m6xxva",
            "score": -13,
            "created_utc": 1616007681.0,
            "replies": [
                {
                    "body": "Toxic anime fan cringe",
                    "author": "DECLANYS",
                    "id": "grbco68",
                    "parent_id": "t1_gr9o0gt",
                    "score": 2,
                    "created_utc": 1616037893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This made my day",
            "author": "Cherry-5503",
            "id": "gr9rxor",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616009436.0,
            "replies": []
        },
        {
            "body": "The real question is did Kurama watch?",
            "author": "suck-my-penut",
            "id": "graoyg3",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616025250.0,
            "replies": []
        },
        {
            "body": "Mood",
            "author": "NotAzuraa",
            "id": "grayd51",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616030177.0,
            "replies": []
        },
        {
            "body": "Bros even before non-hoes",
            "author": "SmallerBork",
            "id": "grbcsy0",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616037968.0,
            "replies": []
        },
        {
            "body": "someone told me that Sasuke and Naruto were originally supposed to be gay, that true?",
            "author": "Acrobatic-Time2242",
            "id": "grbnwkq",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616045548.0,
            "replies": [
                {
                    "body": "No, Kishimoto says it is based on him and his brother.",
                    "author": null,
                    "id": "grbpog1",
                    "parent_id": "t1_grbnwkq",
                    "score": 1,
                    "created_utc": 1616047033.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nor his parents for that fact, but we don't talk about that",
            "author": "FerArtOnline",
            "id": "grbz4yf",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616055888.0,
            "replies": []
        },
        {
            "body": "Neither are mine",
            "author": "IdcAboutUsernames69",
            "id": "grw3gig",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616470769.0,
            "replies": []
        },
        {
            "body": "Neither are his...",
            "author": "IdcAboutUsernames69",
            "id": "grzpbkf",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1616543697.0,
            "replies": []
        },
        {
            "body": "Masterpiece",
            "author": null,
            "id": "gtca4q4",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1617538894.0,
            "replies": []
        },
        {
            "body": "I thought he would say: Neither are mine",
            "author": "DoggoManWasTaken",
            "id": "gujmrol",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1618442117.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": "MrBrainstorm_X",
            "id": "hc5blzv",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1631162689.0,
            "replies": []
        },
        {
            "body": "Legend has it When Naruto was putting a child in Hinata he was thinking about Sasuke",
            "author": "Extra-Border6470",
            "id": "hswcko9",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1642340014.0,
            "replies": []
        },
        {
            "body": "Bruh no time for pussy when a homie on the loose",
            "author": "FreakySunday07",
            "id": "ijgzv2i",
            "parent_id": "t3_m6xxva",
            "score": 1,
            "created_utc": 1659982154.0,
            "replies": []
        },
        {
            "body": "The shit Naruto went through is more than enough to have a few cases of PTSD",
            "author": "saiyanfang10",
            "id": "gr8jn0b",
            "parent_id": "t1_gr8dgok",
            "score": 236,
            "created_utc": 1615989355.0,
            "replies": [
                {
                    "body": "I know, how I summarize the entire show is Knucklehead Ninja becomes super OP trying to fulfill a promise that is eating at his life.",
                    "author": "T-ROY_T-REDDIT",
                    "id": "gr93rob",
                    "parent_id": "t1_gr8jn0b",
                    "score": 159,
                    "created_utc": 1615998752.0,
                    "replies": [
                        {
                            "body": "It surpassed just being for the promise not very long into the show tbh",
                            "author": "lexie98789",
                            "id": "gr9bb9p",
                            "parent_id": "t1_gr93rob",
                            "score": 39,
                            "created_utc": 1616002096.0,
                            "replies": [
                                {
                                    "body": "im pretty sure you could argue it was never about the promise. do you really think if Sakura hadn't asked Naruto to get Sasuke back that he would have just let him leave? from the time when they fought on the rooftop and Sasuke refused to put on his headband, Naruto's mind was set on helping Sasuke.\n\nAfter he left, it instantly became about getting him back. It was already going to be the exact same mindset for Naruto, hell the Shikamaru 5 already had their mission before Sakura came running up crying, making it all about her. And tbh, Sasuke didn't give af about Sakura during his vengeance tour; Naruto was the one who entirely won him back. Hell, I think Sai had a greater impact on Sasuke's return to Konoha than Sakura lmfao",
                                    "author": "Harden-Soul",
                                    "id": "gr9wbm0",
                                    "parent_id": "t1_gr9bb9p",
                                    "score": 48,
                                    "created_utc": 1616011394.0,
                                    "replies": [
                                        {
                                            "body": "I think you’re honestly very close to being right, but I think in Naruto’s mind it was about the promise in the beginning.",
                                            "author": "lexie98789",
                                            "id": "gra4cz5",
                                            "parent_id": "t1_gr9wbm0",
                                            "score": 10,
                                            "created_utc": 1616015025.0,
                                            "replies": [
                                                {
                                                    "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
                                                    "author": null,
                                                    "id": "grage1h",
                                                    "parent_id": "t1_gra4cz5",
                                                    "score": 12,
                                                    "created_utc": 1616020818.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                                                            "author": "lexie98789",
                                                            "id": "grb2tmh",
                                                            "parent_id": "t1_grage1h",
                                                            "score": 6,
                                                            "created_utc": 1616032471.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It wasn't bc of the promise tho. It was something he wanted to do anyways with or without the promise. He himself tells sai during that orochimaru's lair arc that he was trying to bring sasuke back bc he was his closest friend and sasuke was among the first people who acknowledged him properly which is kinda big for him",
                            "author": "azulepearl",
                            "id": "gr9brs7",
                            "parent_id": "t1_gr93rob",
                            "score": 25,
                            "created_utc": 1616002297.0,
                            "replies": []
                        },
                        {
                            "body": "not just that, Naruto's soul got split in half",
                            "author": "saiyanfang10",
                            "id": "gr95ktr",
                            "parent_id": "t1_gr93rob",
                            "score": 26,
                            "created_utc": 1615999552.0,
                            "replies": [
                                {
                                    "body": "Basically all the best shounen have the main character be The Left Brain and his friend/sidekick is The Right Brain. Or maybe just a few but it’s true for naruto",
                                    "author": "suzellezus",
                                    "id": "gr9t2id",
                                    "parent_id": "t1_gr95ktr",
                                    "score": 8,
                                    "created_utc": 1616009946.0,
                                    "replies": [
                                        {
                                            "body": "what does this have to do with anything, Naruto's soul was literally sawn in half",
                                            "author": "saiyanfang10",
                                            "id": "gra5fbh",
                                            "parent_id": "t1_gr9t2id",
                                            "score": 5,
                                            "created_utc": 1616015525.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe I haven’t gotten to that part or missed it",
                                                    "author": "suzellezus",
                                                    "id": "gramm8m",
                                                    "parent_id": "t1_gra5fbh",
                                                    "score": 2,
                                                    "created_utc": 1616024024.0,
                                                    "replies": [
                                                        {
                                                            "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                                                            "author": "saiyanfang10",
                                                            "id": "graoh3i",
                                                            "parent_id": "t1_gramm8m",
                                                            "score": 4,
                                                            "created_utc": 1616024994.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh yeah",
                                                                    "author": "suzellezus",
                                                                    "id": "grard1t",
                                                                    "parent_id": "t1_graoh3i",
                                                                    "score": 2,
                                                                    "created_utc": 1616026507.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It wasn't just a promise it was a self rule straight from the school of youth.",
                            "author": "SmallerBork",
                            "id": "grbbzt8",
                            "parent_id": "t1_gr93rob",
                            "score": 3,
                            "created_utc": 1616037498.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My man literally fainted from stress at one point, so I wouldn't be surprised",
                    "author": "CombatWombat994",
                    "id": "gr9wkdw",
                    "parent_id": "t1_gr8jn0b",
                    "score": 3,
                    "created_utc": 1616011507.0,
                    "replies": []
                },
                {
                    "body": "All for an emo ass boi who couldn't give a shit about him.",
                    "author": "TyrionGoldenLion",
                    "id": "gr9if6w",
                    "parent_id": "t1_gr8jn0b",
                    "score": 6,
                    "created_utc": 1616005212.0,
                    "replies": [
                        {
                            "body": "He did gave a shit about him tho. He literally nearly sacrificed his life TWICE for naruto during part 1 and went door to door looking for naruto when he found out that itachi was after him. It was just that after his encounter with itachi he was too traumatized to give a shit about anything except his goals. All this continued in shippuden till the end.",
                            "author": "azulepearl",
                            "id": "gr9ncdx",
                            "parent_id": "t1_gr9if6w",
                            "score": 28,
                            "created_utc": 1616007387.0,
                            "replies": [
                                {
                                    "body": "Not at this point. Sasuke after Itachi just didn't give a fuck anymore.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gr9ng4t",
                                    "parent_id": "t1_gr9ncdx",
                                    "score": 5,
                                    "created_utc": 1616007433.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "not just Sasuke, he was treated like not a human, it's literally everyone but Hinata and Teuchi",
                            "author": "saiyanfang10",
                            "id": "gr9ik4g",
                            "parent_id": "t1_gr9if6w",
                            "score": 5,
                            "created_utc": 1616005272.0,
                            "replies": [
                                {
                                    "body": "Yeah but I meant at this particular time the original post is about. Naruto's life got so much better after Pein arc but he put himself through so much for an emo boi who didn't deserve it.",
                                    "author": "TyrionGoldenLion",
                                    "id": "gr9ir58",
                                    "parent_id": "t1_gr9ik4g",
                                    "score": 2,
                                    "created_utc": 1616005359.0,
                                    "replies": [
                                        {
                                            "body": "Okay but like can we please talk about how fucked up and hollow it must have felt for him when all these people who used to make his life hell started acting like all the shit they put him through never happened and just started idolizing him because he saved the village? \n\nLike, um, no. Fuck you villagers you don't get to pretend you didn't emotionally, psychologically, and in some cases physically abuse and neglect a child for over a decade and a half and then turn around and act like he's the best thing that's ever happened to Konoha once he's proved himself useful to you. \n\nHe shouldn't have had to work as hard as he did just to earn the villager's approval, hell if anything the villagers are the ones who should be putting in an effort to try and earn his forgiveness. \n\nIf there is anyone who doesn't deserve all the hard work Naruto put into rescuing them, it's the villagers of Konoha.",
                                            "author": "HollyTheMage",
                                            "id": "gr9ypne",
                                            "parent_id": "t1_gr9ir58",
                                            "score": 12,
                                            "created_utc": 1616012477.0,
                                            "replies": [
                                                {
                                                    "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
                                                    "author": "saiyanfang10",
                                                    "id": "gracgke",
                                                    "parent_id": "t1_gr9ypne",
                                                    "score": 5,
                                                    "created_utc": 1616018869.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
                                                    "author": "TyrionGoldenLion",
                                                    "id": "grbngmu",
                                                    "parent_id": "t1_gr9ypne",
                                                    "score": 2,
                                                    "created_utc": 1616045187.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I wanted to re watch naruto from beginning to end who has it? \n\nNetflix has naruto shippuden but who has the OG naruto before that? Or is naruto shippuden the First series?",
            "author": "LowkeyEboy",
            "id": "gr9o4b7",
            "parent_id": "t1_gr8dgok",
            "score": 6,
            "created_utc": 1616007729.0,
            "replies": [
                {
                    "body": "I don't know where you are, but where I live all or Naruto is available on Crunchyroll for free (although with ads but the AdBlock does the trick). And yeah, first is just \"Naruto\" and then Naruto Shippuden.",
                    "author": "Albreitx",
                    "id": "gr9okdr",
                    "parent_id": "t1_gr9o4b7",
                    "score": 7,
                    "created_utc": 1616007929.0,
                    "replies": [
                        {
                            "body": "Some people are saying to stop at a certain episode of naruto then start naruto shippuden? Then go back to naruto? I’m confused lol.",
                            "author": "LowkeyEboy",
                            "id": "gr9ow8q",
                            "parent_id": "t1_gr9okdr",
                            "score": 3,
                            "created_utc": 1616008077.0,
                            "replies": [
                                {
                                    "body": "It is probably to skip fillers. Just check Anime Filler List and watch according to it. And after SD, watch Naruto: The Last. It is a movie.",
                                    "author": "MrLeeRob",
                                    "id": "gr9pu9e",
                                    "parent_id": "t1_gr9ow8q",
                                    "score": 8,
                                    "created_utc": 1616008502.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gr9qoyb",
                                            "parent_id": "t1_gr9pu9e",
                                            "score": 1,
                                            "created_utc": 1616008879.0,
                                            "replies": [
                                                {
                                                    "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
                                                    "author": "MrLeeRob",
                                                    "id": "gr9s26j",
                                                    "parent_id": "t1_gr9qoyb",
                                                    "score": 1,
                                                    "created_utc": 1616009491.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Naruspot",
                                                    "author": "Captainprice101",
                                                    "id": "graj59m",
                                                    "parent_id": "t1_gr9qoyb",
                                                    "score": 1,
                                                    "created_utc": 1616022223.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I've never heard something like that lol. I only know that the last 80 or so episodes of \"Naruto\" are fillers. You can google lists of filler episodes and just skip them. However, I recommend you to watch the \"Chikara\"(Power) fillers in Shippuden. They are really good.\n\nFor clarity: fillers are episodes that were made to \"fill\" time because the anime advanced way faster than the manga. They had to air something while the manga was being done and therefore these fillers are \"non-canon\".",
                                    "author": "Albreitx",
                                    "id": "gr9pxxu",
                                    "parent_id": "t1_gr9ow8q",
                                    "score": 3,
                                    "created_utc": 1616008547.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[This site](https://www18.naruspot.tv/category/naruto-shippuden-dubbed/) is my friend aaaahahh.\n\nAlso, i have ad block plus so we might experience that part of the internet differently in that.. I don't experience any ads",
            "author": "Lonesome_Ninja",
            "id": "gra61ke",
            "parent_id": "t1_gr8dgok",
            "score": 3,
            "created_utc": 1616015814.0,
            "replies": []
        },
        {
            "body": "I rewatched up to the end of the pain arc, then stopped because I remember the rest of the show from that point in being a fucking slog to get through",
            "author": "wallyjwaddles",
            "id": "gramhd3",
            "parent_id": "t1_gr8dgok",
            "score": 2,
            "created_utc": 1616023952.0,
            "replies": []
        },
        {
            "body": "That was so fucking funny. I read that in the manga like “...ok?”",
            "author": "Femartian",
            "id": "gr9s6w1",
            "parent_id": "t1_gr9nsor",
            "score": 36,
            "created_utc": 1616009550.0,
            "replies": [
                {
                    "body": "Me personally that was the point that reassured that I lost all respect for the character.",
                    "author": "UnfilteredRedditor",
                    "id": "gr9vgrs",
                    "parent_id": "t1_gr9s6w1",
                    "score": 2,
                    "created_utc": 1616011015.0,
                    "replies": [
                        {
                            "body": "I started crying at that part actually",
                            "author": "HollyTheMage",
                            "id": "gr9yui1",
                            "parent_id": "t1_gr9vgrs",
                            "score": 17,
                            "created_utc": 1616012538.0,
                            "replies": [
                                {
                                    "body": "I thought it was kind of unnecessary. \n\nBut it also tells a lot about Naruto's mental state.\n\nMost people think Naruto dealt with his trauma in a healthy way because he didn't go nuts like Sasuke.",
                                    "author": null,
                                    "id": "grahdy8",
                                    "parent_id": "t1_gr9yui1",
                                    "score": 13,
                                    "created_utc": 1616021320.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly i wish that after sasuke came back they at least SHOWED them hanging out as friends just to make everything naruto went through for sasuke worthwhile like what even was the point of showing naruto letting himself get beat up and begging on his knees to save sasuke if they weren't even going to show them as friends again??? Sasuke \"becomes good\" and leaves the village again and then we just skip to boruto where they ARE friends but their interactions have been tinged with their adult personalities and sasuke still is not in the village most of the time\nWe really deserved to see naruto and sasuke during their early 20s just goofing around lol",
            "author": "azulepearl",
            "id": "grbedn1",
            "parent_id": "t1_gr9nsor",
            "score": 22,
            "created_utc": 1616038902.0,
            "replies": []
        },
        {
            "body": "Simping and true love are mutually exclusive.",
            "author": "SmallerBork",
            "id": "grbcwip",
            "parent_id": "t1_gr9nsor",
            "score": 5,
            "created_utc": 1616038029.0,
            "replies": []
        },
        {
            "body": "Y'all just have to accept that Sasuke and Naruto where in love with one another and both Hinata and Sakura were sidepieces.",
            "author": "Anonim97",
            "id": "gr9pcbg",
            "parent_id": "t1_gr8ypfd",
            "score": 56,
            "created_utc": 1616008278.0,
            "replies": [
                {
                    "body": "Yes",
                    "author": null,
                    "id": "gr9ucnv",
                    "parent_id": "t1_gr9pcbg",
                    "score": 18,
                    "created_utc": 1616010520.0,
                    "replies": []
                },
                {
                    "body": "Wait but if they're bros, that's incest",
                    "author": "SmallerBork",
                    "id": "grbml4l",
                    "parent_id": "t1_gr9pcbg",
                    "score": 3,
                    "created_utc": 1616044493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sasuke seemed more of a hoe in that scenario tho 😭 naruto was chasing the high of that first kiss 😭",
            "author": "azulepearl",
            "id": "gr9c3m7",
            "parent_id": "t1_gr8ypfd",
            "score": 75,
            "created_utc": 1616002441.0,
            "replies": []
        },
        {
            "body": "Hinata wasn't a hoe but I get your point. Sakura was when she tempted Naruto in the snow though.",
            "author": "SmallerBork",
            "id": "grbdhu8",
            "parent_id": "t1_gr8ypfd",
            "score": 7,
            "created_utc": 1616038376.0,
            "replies": [
                {
                    "body": "Imagine defending a fictional characters honor 😎",
                    "author": "PleasantPeanut4",
                    "id": "grbhwsb",
                    "parent_id": "t1_grbdhu8",
                    "score": 1,
                    "created_utc": 1616041133.0,
                    "replies": [
                        {
                            "body": "Nope, I don't have waifus.\n\nDebating over fiction is what you do in English class. It's usually boring because of the material but when it's a good fiction of our time we do what people have done since the beginning of civilization.\n\nAnd I like Sakura's overall character as well, I don't hate on her like others.",
                            "author": "SmallerBork",
                            "id": "grbld7c",
                            "parent_id": "t1_grbhwsb",
                            "score": 4,
                            "created_utc": 1616043565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or Iruka's. Or Kakashi's. Or Yamato's. Or Sai's. Or Gaara, Temari, and Kankuro's. \n\nActually where are Rock Lee's parents (I mean Guy is basically a father to him, but I mean like biologically)?\n\nOr Tenten's parents for that matter?\n\nWhere are Neji and Hinata's respective mothers?\n\nThere are so many questions that are just never answered.",
            "author": "HollyTheMage",
            "id": "gr9zh8j",
            "parent_id": "t1_gr9rk3x",
            "score": 20,
            "created_utc": 1616012829.0,
            "replies": [
                {
                    "body": ">Actually where are Rock Lee's parents\n\nI know this is a little late but in one of the fillers, it was revealed the Lee's father sacrified himself in order to save Lee from the Mist Swordsmen that were trying to infiltrate the village (the group Zabusa was part of IDK how they were called). \n\nMfer unleased almost all his Gates and managed to kill 2 or 3 HIGHLY TRAINED SHINOBI despite being seen as a joke by the rest of the village for only using Taijutsu.",
                    "author": "kriosken12",
                    "id": "guhedpe",
                    "parent_id": "t1_gr9zh8j",
                    "score": 6,
                    "created_utc": 1618405529.0,
                    "replies": [
                        {
                            "body": "I know it's a little late but that was guy's father, not rock lee's",
                            "author": "Prinsekat",
                            "id": "j75jc3b",
                            "parent_id": "t1_guhedpe",
                            "score": 2,
                            "created_utc": 1675489642.0,
                            "replies": [
                                {
                                    "body": "My bad",
                                    "author": "kriosken12",
                                    "id": "j75ku0n",
                                    "parent_id": "t1_j75jc3b",
                                    "score": 1,
                                    "created_utc": 1675490681.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "i mean kakashi, gaara, temari, and kankuro's parents are all dead and were the whole series lmao",
                    "author": "ChainsOfHearts",
                    "id": "gradjo8",
                    "parent_id": "t1_gr9zh8j",
                    "score": 1,
                    "created_utc": 1616019395.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People always complain about “forced homosexuality” on Netflix, but Naruto has forced heterosexuality fr. They had to make a whole ass movie for NaruHina to make sense smh",
            "author": "PleasantPeanut4",
            "id": "grbi586",
            "parent_id": "t1_gr9wlqw",
            "score": 24,
            "created_utc": 1616041287.0,
            "replies": [
                {
                    "body": "Omg friend, you’re so right :(",
                    "author": "Belensmontana",
                    "id": "grbiby2",
                    "parent_id": "t1_grbi586",
                    "score": 8,
                    "created_utc": 1616041413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yas you are. Or you have not seen this:\n\n\nhttps://i.pinimg.com/736x/54/82/19/548219fdc984cf545d6012cd71134f4f.jpg",
            "author": "km4xX",
            "id": "gr9kzbd",
            "parent_id": "t1_gr9i56x",
            "score": 13,
            "created_utc": 1616006348.0,
            "replies": [
                {
                    "body": "Yeah no he's lying, especially if he's seen this one",
                    "author": "Haelstrom101",
                    "id": "gr9y6ns",
                    "parent_id": "t1_gr9kzbd",
                    "score": 7,
                    "created_utc": 1616012243.0,
                    "replies": [
                        {
                            "body": "Deserved",
                            "author": "1984_Eye",
                            "id": "grercsv",
                            "parent_id": "t1_gr9y6ns",
                            "score": 3,
                            "created_utc": 1616102478.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i think naruto just loves the high he gets from the chase",
            "author": null,
            "id": "grb5gfn",
            "parent_id": "t1_gr9inyl",
            "score": 6,
            "created_utc": 1616033854.0,
            "replies": []
        },
        {
            "body": "Mans was going through it",
            "author": "azulepearl",
            "id": "gr9c82o",
            "parent_id": "t1_gr96m7c",
            "score": 7,
            "created_utc": 1616002495.0,
            "replies": [
                {
                    "body": "DO YOU REMEMBER WHEN HE HAD A PANIC ATTACK AND PASSED OUT IN THE SNOW THAT SHIT GOT WAY TOO REAL FOR ME",
                    "author": "HollyTheMage",
                    "id": "gr9z0dm",
                    "parent_id": "t1_gr9c82o",
                    "score": 9,
                    "created_utc": 1616012614.0,
                    "replies": [
                        {
                            "body": "I LEGIT CRIED OML",
                            "author": "cosmicZED",
                            "id": "grapnv5",
                            "parent_id": "t1_gr9z0dm",
                            "score": 5,
                            "created_utc": 1616025624.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "With the way that her father acts and treats her, I'm guessing not. Studio Pierrot might try to give her one for filler purposes, but that doesn't change the fact that Kishimoto never gave Hinata a mother",
            "author": "gotumms146",
            "id": "gs2mb8s",
            "parent_id": "t1_grbtqsc",
            "score": 1,
            "created_utc": 1616607402.0,
            "replies": []
        },
        {
            "body": "Toxic anime fan cringe",
            "author": "DECLANYS",
            "id": "grbco68",
            "parent_id": "t1_gr9o0gt",
            "score": 2,
            "created_utc": 1616037893.0,
            "replies": []
        },
        {
            "body": "No, Kishimoto says it is based on him and his brother.",
            "author": null,
            "id": "grbpog1",
            "parent_id": "t1_grbnwkq",
            "score": 1,
            "created_utc": 1616047033.0,
            "replies": []
        },
        {
            "body": "I know, how I summarize the entire show is Knucklehead Ninja becomes super OP trying to fulfill a promise that is eating at his life.",
            "author": "T-ROY_T-REDDIT",
            "id": "gr93rob",
            "parent_id": "t1_gr8jn0b",
            "score": 159,
            "created_utc": 1615998752.0,
            "replies": [
                {
                    "body": "It surpassed just being for the promise not very long into the show tbh",
                    "author": "lexie98789",
                    "id": "gr9bb9p",
                    "parent_id": "t1_gr93rob",
                    "score": 39,
                    "created_utc": 1616002096.0,
                    "replies": [
                        {
                            "body": "im pretty sure you could argue it was never about the promise. do you really think if Sakura hadn't asked Naruto to get Sasuke back that he would have just let him leave? from the time when they fought on the rooftop and Sasuke refused to put on his headband, Naruto's mind was set on helping Sasuke.\n\nAfter he left, it instantly became about getting him back. It was already going to be the exact same mindset for Naruto, hell the Shikamaru 5 already had their mission before Sakura came running up crying, making it all about her. And tbh, Sasuke didn't give af about Sakura during his vengeance tour; Naruto was the one who entirely won him back. Hell, I think Sai had a greater impact on Sasuke's return to Konoha than Sakura lmfao",
                            "author": "Harden-Soul",
                            "id": "gr9wbm0",
                            "parent_id": "t1_gr9bb9p",
                            "score": 48,
                            "created_utc": 1616011394.0,
                            "replies": [
                                {
                                    "body": "I think you’re honestly very close to being right, but I think in Naruto’s mind it was about the promise in the beginning.",
                                    "author": "lexie98789",
                                    "id": "gra4cz5",
                                    "parent_id": "t1_gr9wbm0",
                                    "score": 10,
                                    "created_utc": 1616015025.0,
                                    "replies": [
                                        {
                                            "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
                                            "author": null,
                                            "id": "grage1h",
                                            "parent_id": "t1_gra4cz5",
                                            "score": 12,
                                            "created_utc": 1616020818.0,
                                            "replies": [
                                                {
                                                    "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                                                    "author": "lexie98789",
                                                    "id": "grb2tmh",
                                                    "parent_id": "t1_grage1h",
                                                    "score": 6,
                                                    "created_utc": 1616032471.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It wasn't bc of the promise tho. It was something he wanted to do anyways with or without the promise. He himself tells sai during that orochimaru's lair arc that he was trying to bring sasuke back bc he was his closest friend and sasuke was among the first people who acknowledged him properly which is kinda big for him",
                    "author": "azulepearl",
                    "id": "gr9brs7",
                    "parent_id": "t1_gr93rob",
                    "score": 25,
                    "created_utc": 1616002297.0,
                    "replies": []
                },
                {
                    "body": "not just that, Naruto's soul got split in half",
                    "author": "saiyanfang10",
                    "id": "gr95ktr",
                    "parent_id": "t1_gr93rob",
                    "score": 26,
                    "created_utc": 1615999552.0,
                    "replies": [
                        {
                            "body": "Basically all the best shounen have the main character be The Left Brain and his friend/sidekick is The Right Brain. Or maybe just a few but it’s true for naruto",
                            "author": "suzellezus",
                            "id": "gr9t2id",
                            "parent_id": "t1_gr95ktr",
                            "score": 8,
                            "created_utc": 1616009946.0,
                            "replies": [
                                {
                                    "body": "what does this have to do with anything, Naruto's soul was literally sawn in half",
                                    "author": "saiyanfang10",
                                    "id": "gra5fbh",
                                    "parent_id": "t1_gr9t2id",
                                    "score": 5,
                                    "created_utc": 1616015525.0,
                                    "replies": [
                                        {
                                            "body": "Maybe I haven’t gotten to that part or missed it",
                                            "author": "suzellezus",
                                            "id": "gramm8m",
                                            "parent_id": "t1_gra5fbh",
                                            "score": 2,
                                            "created_utc": 1616024024.0,
                                            "replies": [
                                                {
                                                    "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                                                    "author": "saiyanfang10",
                                                    "id": "graoh3i",
                                                    "parent_id": "t1_gramm8m",
                                                    "score": 4,
                                                    "created_utc": 1616024994.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh yeah",
                                                            "author": "suzellezus",
                                                            "id": "grard1t",
                                                            "parent_id": "t1_graoh3i",
                                                            "score": 2,
                                                            "created_utc": 1616026507.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It wasn't just a promise it was a self rule straight from the school of youth.",
                    "author": "SmallerBork",
                    "id": "grbbzt8",
                    "parent_id": "t1_gr93rob",
                    "score": 3,
                    "created_utc": 1616037498.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My man literally fainted from stress at one point, so I wouldn't be surprised",
            "author": "CombatWombat994",
            "id": "gr9wkdw",
            "parent_id": "t1_gr8jn0b",
            "score": 3,
            "created_utc": 1616011507.0,
            "replies": []
        },
        {
            "body": "All for an emo ass boi who couldn't give a shit about him.",
            "author": "TyrionGoldenLion",
            "id": "gr9if6w",
            "parent_id": "t1_gr8jn0b",
            "score": 6,
            "created_utc": 1616005212.0,
            "replies": [
                {
                    "body": "He did gave a shit about him tho. He literally nearly sacrificed his life TWICE for naruto during part 1 and went door to door looking for naruto when he found out that itachi was after him. It was just that after his encounter with itachi he was too traumatized to give a shit about anything except his goals. All this continued in shippuden till the end.",
                    "author": "azulepearl",
                    "id": "gr9ncdx",
                    "parent_id": "t1_gr9if6w",
                    "score": 28,
                    "created_utc": 1616007387.0,
                    "replies": [
                        {
                            "body": "Not at this point. Sasuke after Itachi just didn't give a fuck anymore.",
                            "author": "TyrionGoldenLion",
                            "id": "gr9ng4t",
                            "parent_id": "t1_gr9ncdx",
                            "score": 5,
                            "created_utc": 1616007433.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "not just Sasuke, he was treated like not a human, it's literally everyone but Hinata and Teuchi",
                    "author": "saiyanfang10",
                    "id": "gr9ik4g",
                    "parent_id": "t1_gr9if6w",
                    "score": 5,
                    "created_utc": 1616005272.0,
                    "replies": [
                        {
                            "body": "Yeah but I meant at this particular time the original post is about. Naruto's life got so much better after Pein arc but he put himself through so much for an emo boi who didn't deserve it.",
                            "author": "TyrionGoldenLion",
                            "id": "gr9ir58",
                            "parent_id": "t1_gr9ik4g",
                            "score": 2,
                            "created_utc": 1616005359.0,
                            "replies": [
                                {
                                    "body": "Okay but like can we please talk about how fucked up and hollow it must have felt for him when all these people who used to make his life hell started acting like all the shit they put him through never happened and just started idolizing him because he saved the village? \n\nLike, um, no. Fuck you villagers you don't get to pretend you didn't emotionally, psychologically, and in some cases physically abuse and neglect a child for over a decade and a half and then turn around and act like he's the best thing that's ever happened to Konoha once he's proved himself useful to you. \n\nHe shouldn't have had to work as hard as he did just to earn the villager's approval, hell if anything the villagers are the ones who should be putting in an effort to try and earn his forgiveness. \n\nIf there is anyone who doesn't deserve all the hard work Naruto put into rescuing them, it's the villagers of Konoha.",
                                    "author": "HollyTheMage",
                                    "id": "gr9ypne",
                                    "parent_id": "t1_gr9ir58",
                                    "score": 12,
                                    "created_utc": 1616012477.0,
                                    "replies": [
                                        {
                                            "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
                                            "author": "saiyanfang10",
                                            "id": "gracgke",
                                            "parent_id": "t1_gr9ypne",
                                            "score": 5,
                                            "created_utc": 1616018869.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
                                            "author": "TyrionGoldenLion",
                                            "id": "grbngmu",
                                            "parent_id": "t1_gr9ypne",
                                            "score": 2,
                                            "created_utc": 1616045187.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know where you are, but where I live all or Naruto is available on Crunchyroll for free (although with ads but the AdBlock does the trick). And yeah, first is just \"Naruto\" and then Naruto Shippuden.",
            "author": "Albreitx",
            "id": "gr9okdr",
            "parent_id": "t1_gr9o4b7",
            "score": 7,
            "created_utc": 1616007929.0,
            "replies": [
                {
                    "body": "Some people are saying to stop at a certain episode of naruto then start naruto shippuden? Then go back to naruto? I’m confused lol.",
                    "author": "LowkeyEboy",
                    "id": "gr9ow8q",
                    "parent_id": "t1_gr9okdr",
                    "score": 3,
                    "created_utc": 1616008077.0,
                    "replies": [
                        {
                            "body": "It is probably to skip fillers. Just check Anime Filler List and watch according to it. And after SD, watch Naruto: The Last. It is a movie.",
                            "author": "MrLeeRob",
                            "id": "gr9pu9e",
                            "parent_id": "t1_gr9ow8q",
                            "score": 8,
                            "created_utc": 1616008502.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gr9qoyb",
                                    "parent_id": "t1_gr9pu9e",
                                    "score": 1,
                                    "created_utc": 1616008879.0,
                                    "replies": [
                                        {
                                            "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
                                            "author": "MrLeeRob",
                                            "id": "gr9s26j",
                                            "parent_id": "t1_gr9qoyb",
                                            "score": 1,
                                            "created_utc": 1616009491.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Naruspot",
                                            "author": "Captainprice101",
                                            "id": "graj59m",
                                            "parent_id": "t1_gr9qoyb",
                                            "score": 1,
                                            "created_utc": 1616022223.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I've never heard something like that lol. I only know that the last 80 or so episodes of \"Naruto\" are fillers. You can google lists of filler episodes and just skip them. However, I recommend you to watch the \"Chikara\"(Power) fillers in Shippuden. They are really good.\n\nFor clarity: fillers are episodes that were made to \"fill\" time because the anime advanced way faster than the manga. They had to air something while the manga was being done and therefore these fillers are \"non-canon\".",
                            "author": "Albreitx",
                            "id": "gr9pxxu",
                            "parent_id": "t1_gr9ow8q",
                            "score": 3,
                            "created_utc": 1616008547.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me personally that was the point that reassured that I lost all respect for the character.",
            "author": "UnfilteredRedditor",
            "id": "gr9vgrs",
            "parent_id": "t1_gr9s6w1",
            "score": 2,
            "created_utc": 1616011015.0,
            "replies": [
                {
                    "body": "I started crying at that part actually",
                    "author": "HollyTheMage",
                    "id": "gr9yui1",
                    "parent_id": "t1_gr9vgrs",
                    "score": 17,
                    "created_utc": 1616012538.0,
                    "replies": [
                        {
                            "body": "I thought it was kind of unnecessary. \n\nBut it also tells a lot about Naruto's mental state.\n\nMost people think Naruto dealt with his trauma in a healthy way because he didn't go nuts like Sasuke.",
                            "author": null,
                            "id": "grahdy8",
                            "parent_id": "t1_gr9yui1",
                            "score": 13,
                            "created_utc": 1616021320.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes",
            "author": null,
            "id": "gr9ucnv",
            "parent_id": "t1_gr9pcbg",
            "score": 18,
            "created_utc": 1616010520.0,
            "replies": []
        },
        {
            "body": "Wait but if they're bros, that's incest",
            "author": "SmallerBork",
            "id": "grbml4l",
            "parent_id": "t1_gr9pcbg",
            "score": 3,
            "created_utc": 1616044493.0,
            "replies": []
        },
        {
            "body": "Imagine defending a fictional characters honor 😎",
            "author": "PleasantPeanut4",
            "id": "grbhwsb",
            "parent_id": "t1_grbdhu8",
            "score": 1,
            "created_utc": 1616041133.0,
            "replies": [
                {
                    "body": "Nope, I don't have waifus.\n\nDebating over fiction is what you do in English class. It's usually boring because of the material but when it's a good fiction of our time we do what people have done since the beginning of civilization.\n\nAnd I like Sakura's overall character as well, I don't hate on her like others.",
                    "author": "SmallerBork",
                    "id": "grbld7c",
                    "parent_id": "t1_grbhwsb",
                    "score": 4,
                    "created_utc": 1616043565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Actually where are Rock Lee's parents\n\nI know this is a little late but in one of the fillers, it was revealed the Lee's father sacrified himself in order to save Lee from the Mist Swordsmen that were trying to infiltrate the village (the group Zabusa was part of IDK how they were called). \n\nMfer unleased almost all his Gates and managed to kill 2 or 3 HIGHLY TRAINED SHINOBI despite being seen as a joke by the rest of the village for only using Taijutsu.",
            "author": "kriosken12",
            "id": "guhedpe",
            "parent_id": "t1_gr9zh8j",
            "score": 6,
            "created_utc": 1618405529.0,
            "replies": [
                {
                    "body": "I know it's a little late but that was guy's father, not rock lee's",
                    "author": "Prinsekat",
                    "id": "j75jc3b",
                    "parent_id": "t1_guhedpe",
                    "score": 2,
                    "created_utc": 1675489642.0,
                    "replies": [
                        {
                            "body": "My bad",
                            "author": "kriosken12",
                            "id": "j75ku0n",
                            "parent_id": "t1_j75jc3b",
                            "score": 1,
                            "created_utc": 1675490681.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i mean kakashi, gaara, temari, and kankuro's parents are all dead and were the whole series lmao",
            "author": "ChainsOfHearts",
            "id": "gradjo8",
            "parent_id": "t1_gr9zh8j",
            "score": 1,
            "created_utc": 1616019395.0,
            "replies": []
        },
        {
            "body": "Omg friend, you’re so right :(",
            "author": "Belensmontana",
            "id": "grbiby2",
            "parent_id": "t1_grbi586",
            "score": 8,
            "created_utc": 1616041413.0,
            "replies": []
        },
        {
            "body": "Yeah no he's lying, especially if he's seen this one",
            "author": "Haelstrom101",
            "id": "gr9y6ns",
            "parent_id": "t1_gr9kzbd",
            "score": 7,
            "created_utc": 1616012243.0,
            "replies": [
                {
                    "body": "Deserved",
                    "author": "1984_Eye",
                    "id": "grercsv",
                    "parent_id": "t1_gr9y6ns",
                    "score": 3,
                    "created_utc": 1616102478.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "DO YOU REMEMBER WHEN HE HAD A PANIC ATTACK AND PASSED OUT IN THE SNOW THAT SHIT GOT WAY TOO REAL FOR ME",
            "author": "HollyTheMage",
            "id": "gr9z0dm",
            "parent_id": "t1_gr9c82o",
            "score": 9,
            "created_utc": 1616012614.0,
            "replies": [
                {
                    "body": "I LEGIT CRIED OML",
                    "author": "cosmicZED",
                    "id": "grapnv5",
                    "parent_id": "t1_gr9z0dm",
                    "score": 5,
                    "created_utc": 1616025624.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It surpassed just being for the promise not very long into the show tbh",
            "author": "lexie98789",
            "id": "gr9bb9p",
            "parent_id": "t1_gr93rob",
            "score": 39,
            "created_utc": 1616002096.0,
            "replies": [
                {
                    "body": "im pretty sure you could argue it was never about the promise. do you really think if Sakura hadn't asked Naruto to get Sasuke back that he would have just let him leave? from the time when they fought on the rooftop and Sasuke refused to put on his headband, Naruto's mind was set on helping Sasuke.\n\nAfter he left, it instantly became about getting him back. It was already going to be the exact same mindset for Naruto, hell the Shikamaru 5 already had their mission before Sakura came running up crying, making it all about her. And tbh, Sasuke didn't give af about Sakura during his vengeance tour; Naruto was the one who entirely won him back. Hell, I think Sai had a greater impact on Sasuke's return to Konoha than Sakura lmfao",
                    "author": "Harden-Soul",
                    "id": "gr9wbm0",
                    "parent_id": "t1_gr9bb9p",
                    "score": 48,
                    "created_utc": 1616011394.0,
                    "replies": [
                        {
                            "body": "I think you’re honestly very close to being right, but I think in Naruto’s mind it was about the promise in the beginning.",
                            "author": "lexie98789",
                            "id": "gra4cz5",
                            "parent_id": "t1_gr9wbm0",
                            "score": 10,
                            "created_utc": 1616015025.0,
                            "replies": [
                                {
                                    "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
                                    "author": null,
                                    "id": "grage1h",
                                    "parent_id": "t1_gra4cz5",
                                    "score": 12,
                                    "created_utc": 1616020818.0,
                                    "replies": [
                                        {
                                            "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                                            "author": "lexie98789",
                                            "id": "grb2tmh",
                                            "parent_id": "t1_grage1h",
                                            "score": 6,
                                            "created_utc": 1616032471.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It wasn't bc of the promise tho. It was something he wanted to do anyways with or without the promise. He himself tells sai during that orochimaru's lair arc that he was trying to bring sasuke back bc he was his closest friend and sasuke was among the first people who acknowledged him properly which is kinda big for him",
            "author": "azulepearl",
            "id": "gr9brs7",
            "parent_id": "t1_gr93rob",
            "score": 25,
            "created_utc": 1616002297.0,
            "replies": []
        },
        {
            "body": "not just that, Naruto's soul got split in half",
            "author": "saiyanfang10",
            "id": "gr95ktr",
            "parent_id": "t1_gr93rob",
            "score": 26,
            "created_utc": 1615999552.0,
            "replies": [
                {
                    "body": "Basically all the best shounen have the main character be The Left Brain and his friend/sidekick is The Right Brain. Or maybe just a few but it’s true for naruto",
                    "author": "suzellezus",
                    "id": "gr9t2id",
                    "parent_id": "t1_gr95ktr",
                    "score": 8,
                    "created_utc": 1616009946.0,
                    "replies": [
                        {
                            "body": "what does this have to do with anything, Naruto's soul was literally sawn in half",
                            "author": "saiyanfang10",
                            "id": "gra5fbh",
                            "parent_id": "t1_gr9t2id",
                            "score": 5,
                            "created_utc": 1616015525.0,
                            "replies": [
                                {
                                    "body": "Maybe I haven’t gotten to that part or missed it",
                                    "author": "suzellezus",
                                    "id": "gramm8m",
                                    "parent_id": "t1_gra5fbh",
                                    "score": 2,
                                    "created_utc": 1616024024.0,
                                    "replies": [
                                        {
                                            "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                                            "author": "saiyanfang10",
                                            "id": "graoh3i",
                                            "parent_id": "t1_gramm8m",
                                            "score": 4,
                                            "created_utc": 1616024994.0,
                                            "replies": [
                                                {
                                                    "body": "Oh yeah",
                                                    "author": "suzellezus",
                                                    "id": "grard1t",
                                                    "parent_id": "t1_graoh3i",
                                                    "score": 2,
                                                    "created_utc": 1616026507.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It wasn't just a promise it was a self rule straight from the school of youth.",
            "author": "SmallerBork",
            "id": "grbbzt8",
            "parent_id": "t1_gr93rob",
            "score": 3,
            "created_utc": 1616037498.0,
            "replies": []
        },
        {
            "body": "He did gave a shit about him tho. He literally nearly sacrificed his life TWICE for naruto during part 1 and went door to door looking for naruto when he found out that itachi was after him. It was just that after his encounter with itachi he was too traumatized to give a shit about anything except his goals. All this continued in shippuden till the end.",
            "author": "azulepearl",
            "id": "gr9ncdx",
            "parent_id": "t1_gr9if6w",
            "score": 28,
            "created_utc": 1616007387.0,
            "replies": [
                {
                    "body": "Not at this point. Sasuke after Itachi just didn't give a fuck anymore.",
                    "author": "TyrionGoldenLion",
                    "id": "gr9ng4t",
                    "parent_id": "t1_gr9ncdx",
                    "score": 5,
                    "created_utc": 1616007433.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "not just Sasuke, he was treated like not a human, it's literally everyone but Hinata and Teuchi",
            "author": "saiyanfang10",
            "id": "gr9ik4g",
            "parent_id": "t1_gr9if6w",
            "score": 5,
            "created_utc": 1616005272.0,
            "replies": [
                {
                    "body": "Yeah but I meant at this particular time the original post is about. Naruto's life got so much better after Pein arc but he put himself through so much for an emo boi who didn't deserve it.",
                    "author": "TyrionGoldenLion",
                    "id": "gr9ir58",
                    "parent_id": "t1_gr9ik4g",
                    "score": 2,
                    "created_utc": 1616005359.0,
                    "replies": [
                        {
                            "body": "Okay but like can we please talk about how fucked up and hollow it must have felt for him when all these people who used to make his life hell started acting like all the shit they put him through never happened and just started idolizing him because he saved the village? \n\nLike, um, no. Fuck you villagers you don't get to pretend you didn't emotionally, psychologically, and in some cases physically abuse and neglect a child for over a decade and a half and then turn around and act like he's the best thing that's ever happened to Konoha once he's proved himself useful to you. \n\nHe shouldn't have had to work as hard as he did just to earn the villager's approval, hell if anything the villagers are the ones who should be putting in an effort to try and earn his forgiveness. \n\nIf there is anyone who doesn't deserve all the hard work Naruto put into rescuing them, it's the villagers of Konoha.",
                            "author": "HollyTheMage",
                            "id": "gr9ypne",
                            "parent_id": "t1_gr9ir58",
                            "score": 12,
                            "created_utc": 1616012477.0,
                            "replies": [
                                {
                                    "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
                                    "author": "saiyanfang10",
                                    "id": "gracgke",
                                    "parent_id": "t1_gr9ypne",
                                    "score": 5,
                                    "created_utc": 1616018869.0,
                                    "replies": []
                                },
                                {
                                    "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
                                    "author": "TyrionGoldenLion",
                                    "id": "grbngmu",
                                    "parent_id": "t1_gr9ypne",
                                    "score": 2,
                                    "created_utc": 1616045187.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some people are saying to stop at a certain episode of naruto then start naruto shippuden? Then go back to naruto? I’m confused lol.",
            "author": "LowkeyEboy",
            "id": "gr9ow8q",
            "parent_id": "t1_gr9okdr",
            "score": 3,
            "created_utc": 1616008077.0,
            "replies": [
                {
                    "body": "It is probably to skip fillers. Just check Anime Filler List and watch according to it. And after SD, watch Naruto: The Last. It is a movie.",
                    "author": "MrLeeRob",
                    "id": "gr9pu9e",
                    "parent_id": "t1_gr9ow8q",
                    "score": 8,
                    "created_utc": 1616008502.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gr9qoyb",
                            "parent_id": "t1_gr9pu9e",
                            "score": 1,
                            "created_utc": 1616008879.0,
                            "replies": [
                                {
                                    "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
                                    "author": "MrLeeRob",
                                    "id": "gr9s26j",
                                    "parent_id": "t1_gr9qoyb",
                                    "score": 1,
                                    "created_utc": 1616009491.0,
                                    "replies": []
                                },
                                {
                                    "body": "Naruspot",
                                    "author": "Captainprice101",
                                    "id": "graj59m",
                                    "parent_id": "t1_gr9qoyb",
                                    "score": 1,
                                    "created_utc": 1616022223.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've never heard something like that lol. I only know that the last 80 or so episodes of \"Naruto\" are fillers. You can google lists of filler episodes and just skip them. However, I recommend you to watch the \"Chikara\"(Power) fillers in Shippuden. They are really good.\n\nFor clarity: fillers are episodes that were made to \"fill\" time because the anime advanced way faster than the manga. They had to air something while the manga was being done and therefore these fillers are \"non-canon\".",
                    "author": "Albreitx",
                    "id": "gr9pxxu",
                    "parent_id": "t1_gr9ow8q",
                    "score": 3,
                    "created_utc": 1616008547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I started crying at that part actually",
            "author": "HollyTheMage",
            "id": "gr9yui1",
            "parent_id": "t1_gr9vgrs",
            "score": 17,
            "created_utc": 1616012538.0,
            "replies": [
                {
                    "body": "I thought it was kind of unnecessary. \n\nBut it also tells a lot about Naruto's mental state.\n\nMost people think Naruto dealt with his trauma in a healthy way because he didn't go nuts like Sasuke.",
                    "author": null,
                    "id": "grahdy8",
                    "parent_id": "t1_gr9yui1",
                    "score": 13,
                    "created_utc": 1616021320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope, I don't have waifus.\n\nDebating over fiction is what you do in English class. It's usually boring because of the material but when it's a good fiction of our time we do what people have done since the beginning of civilization.\n\nAnd I like Sakura's overall character as well, I don't hate on her like others.",
            "author": "SmallerBork",
            "id": "grbld7c",
            "parent_id": "t1_grbhwsb",
            "score": 4,
            "created_utc": 1616043565.0,
            "replies": []
        },
        {
            "body": "I know it's a little late but that was guy's father, not rock lee's",
            "author": "Prinsekat",
            "id": "j75jc3b",
            "parent_id": "t1_guhedpe",
            "score": 2,
            "created_utc": 1675489642.0,
            "replies": [
                {
                    "body": "My bad",
                    "author": "kriosken12",
                    "id": "j75ku0n",
                    "parent_id": "t1_j75jc3b",
                    "score": 1,
                    "created_utc": 1675490681.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Deserved",
            "author": "1984_Eye",
            "id": "grercsv",
            "parent_id": "t1_gr9y6ns",
            "score": 3,
            "created_utc": 1616102478.0,
            "replies": []
        },
        {
            "body": "I LEGIT CRIED OML",
            "author": "cosmicZED",
            "id": "grapnv5",
            "parent_id": "t1_gr9z0dm",
            "score": 5,
            "created_utc": 1616025624.0,
            "replies": []
        },
        {
            "body": "im pretty sure you could argue it was never about the promise. do you really think if Sakura hadn't asked Naruto to get Sasuke back that he would have just let him leave? from the time when they fought on the rooftop and Sasuke refused to put on his headband, Naruto's mind was set on helping Sasuke.\n\nAfter he left, it instantly became about getting him back. It was already going to be the exact same mindset for Naruto, hell the Shikamaru 5 already had their mission before Sakura came running up crying, making it all about her. And tbh, Sasuke didn't give af about Sakura during his vengeance tour; Naruto was the one who entirely won him back. Hell, I think Sai had a greater impact on Sasuke's return to Konoha than Sakura lmfao",
            "author": "Harden-Soul",
            "id": "gr9wbm0",
            "parent_id": "t1_gr9bb9p",
            "score": 48,
            "created_utc": 1616011394.0,
            "replies": [
                {
                    "body": "I think you’re honestly very close to being right, but I think in Naruto’s mind it was about the promise in the beginning.",
                    "author": "lexie98789",
                    "id": "gra4cz5",
                    "parent_id": "t1_gr9wbm0",
                    "score": 10,
                    "created_utc": 1616015025.0,
                    "replies": [
                        {
                            "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
                            "author": null,
                            "id": "grage1h",
                            "parent_id": "t1_gra4cz5",
                            "score": 12,
                            "created_utc": 1616020818.0,
                            "replies": [
                                {
                                    "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                                    "author": "lexie98789",
                                    "id": "grb2tmh",
                                    "parent_id": "t1_grage1h",
                                    "score": 6,
                                    "created_utc": 1616032471.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Basically all the best shounen have the main character be The Left Brain and his friend/sidekick is The Right Brain. Or maybe just a few but it’s true for naruto",
            "author": "suzellezus",
            "id": "gr9t2id",
            "parent_id": "t1_gr95ktr",
            "score": 8,
            "created_utc": 1616009946.0,
            "replies": [
                {
                    "body": "what does this have to do with anything, Naruto's soul was literally sawn in half",
                    "author": "saiyanfang10",
                    "id": "gra5fbh",
                    "parent_id": "t1_gr9t2id",
                    "score": 5,
                    "created_utc": 1616015525.0,
                    "replies": [
                        {
                            "body": "Maybe I haven’t gotten to that part or missed it",
                            "author": "suzellezus",
                            "id": "gramm8m",
                            "parent_id": "t1_gra5fbh",
                            "score": 2,
                            "created_utc": 1616024024.0,
                            "replies": [
                                {
                                    "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                                    "author": "saiyanfang10",
                                    "id": "graoh3i",
                                    "parent_id": "t1_gramm8m",
                                    "score": 4,
                                    "created_utc": 1616024994.0,
                                    "replies": [
                                        {
                                            "body": "Oh yeah",
                                            "author": "suzellezus",
                                            "id": "grard1t",
                                            "parent_id": "t1_graoh3i",
                                            "score": 2,
                                            "created_utc": 1616026507.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not at this point. Sasuke after Itachi just didn't give a fuck anymore.",
            "author": "TyrionGoldenLion",
            "id": "gr9ng4t",
            "parent_id": "t1_gr9ncdx",
            "score": 5,
            "created_utc": 1616007433.0,
            "replies": []
        },
        {
            "body": "Yeah but I meant at this particular time the original post is about. Naruto's life got so much better after Pein arc but he put himself through so much for an emo boi who didn't deserve it.",
            "author": "TyrionGoldenLion",
            "id": "gr9ir58",
            "parent_id": "t1_gr9ik4g",
            "score": 2,
            "created_utc": 1616005359.0,
            "replies": [
                {
                    "body": "Okay but like can we please talk about how fucked up and hollow it must have felt for him when all these people who used to make his life hell started acting like all the shit they put him through never happened and just started idolizing him because he saved the village? \n\nLike, um, no. Fuck you villagers you don't get to pretend you didn't emotionally, psychologically, and in some cases physically abuse and neglect a child for over a decade and a half and then turn around and act like he's the best thing that's ever happened to Konoha once he's proved himself useful to you. \n\nHe shouldn't have had to work as hard as he did just to earn the villager's approval, hell if anything the villagers are the ones who should be putting in an effort to try and earn his forgiveness. \n\nIf there is anyone who doesn't deserve all the hard work Naruto put into rescuing them, it's the villagers of Konoha.",
                    "author": "HollyTheMage",
                    "id": "gr9ypne",
                    "parent_id": "t1_gr9ir58",
                    "score": 12,
                    "created_utc": 1616012477.0,
                    "replies": [
                        {
                            "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
                            "author": "saiyanfang10",
                            "id": "gracgke",
                            "parent_id": "t1_gr9ypne",
                            "score": 5,
                            "created_utc": 1616018869.0,
                            "replies": []
                        },
                        {
                            "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
                            "author": "TyrionGoldenLion",
                            "id": "grbngmu",
                            "parent_id": "t1_gr9ypne",
                            "score": 2,
                            "created_utc": 1616045187.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is probably to skip fillers. Just check Anime Filler List and watch according to it. And after SD, watch Naruto: The Last. It is a movie.",
            "author": "MrLeeRob",
            "id": "gr9pu9e",
            "parent_id": "t1_gr9ow8q",
            "score": 8,
            "created_utc": 1616008502.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gr9qoyb",
                    "parent_id": "t1_gr9pu9e",
                    "score": 1,
                    "created_utc": 1616008879.0,
                    "replies": [
                        {
                            "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
                            "author": "MrLeeRob",
                            "id": "gr9s26j",
                            "parent_id": "t1_gr9qoyb",
                            "score": 1,
                            "created_utc": 1616009491.0,
                            "replies": []
                        },
                        {
                            "body": "Naruspot",
                            "author": "Captainprice101",
                            "id": "graj59m",
                            "parent_id": "t1_gr9qoyb",
                            "score": 1,
                            "created_utc": 1616022223.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've never heard something like that lol. I only know that the last 80 or so episodes of \"Naruto\" are fillers. You can google lists of filler episodes and just skip them. However, I recommend you to watch the \"Chikara\"(Power) fillers in Shippuden. They are really good.\n\nFor clarity: fillers are episodes that were made to \"fill\" time because the anime advanced way faster than the manga. They had to air something while the manga was being done and therefore these fillers are \"non-canon\".",
            "author": "Albreitx",
            "id": "gr9pxxu",
            "parent_id": "t1_gr9ow8q",
            "score": 3,
            "created_utc": 1616008547.0,
            "replies": []
        },
        {
            "body": "I thought it was kind of unnecessary. \n\nBut it also tells a lot about Naruto's mental state.\n\nMost people think Naruto dealt with his trauma in a healthy way because he didn't go nuts like Sasuke.",
            "author": null,
            "id": "grahdy8",
            "parent_id": "t1_gr9yui1",
            "score": 13,
            "created_utc": 1616021320.0,
            "replies": []
        },
        {
            "body": "My bad",
            "author": "kriosken12",
            "id": "j75ku0n",
            "parent_id": "t1_j75jc3b",
            "score": 1,
            "created_utc": 1675490681.0,
            "replies": []
        },
        {
            "body": "I think you’re honestly very close to being right, but I think in Naruto’s mind it was about the promise in the beginning.",
            "author": "lexie98789",
            "id": "gra4cz5",
            "parent_id": "t1_gr9wbm0",
            "score": 10,
            "created_utc": 1616015025.0,
            "replies": [
                {
                    "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
                    "author": null,
                    "id": "grage1h",
                    "parent_id": "t1_gra4cz5",
                    "score": 12,
                    "created_utc": 1616020818.0,
                    "replies": [
                        {
                            "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                            "author": "lexie98789",
                            "id": "grb2tmh",
                            "parent_id": "t1_grage1h",
                            "score": 6,
                            "created_utc": 1616032471.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "what does this have to do with anything, Naruto's soul was literally sawn in half",
            "author": "saiyanfang10",
            "id": "gra5fbh",
            "parent_id": "t1_gr9t2id",
            "score": 5,
            "created_utc": 1616015525.0,
            "replies": [
                {
                    "body": "Maybe I haven’t gotten to that part or missed it",
                    "author": "suzellezus",
                    "id": "gramm8m",
                    "parent_id": "t1_gra5fbh",
                    "score": 2,
                    "created_utc": 1616024024.0,
                    "replies": [
                        {
                            "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                            "author": "saiyanfang10",
                            "id": "graoh3i",
                            "parent_id": "t1_gramm8m",
                            "score": 4,
                            "created_utc": 1616024994.0,
                            "replies": [
                                {
                                    "body": "Oh yeah",
                                    "author": "suzellezus",
                                    "id": "grard1t",
                                    "parent_id": "t1_graoh3i",
                                    "score": 2,
                                    "created_utc": 1616026507.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay but like can we please talk about how fucked up and hollow it must have felt for him when all these people who used to make his life hell started acting like all the shit they put him through never happened and just started idolizing him because he saved the village? \n\nLike, um, no. Fuck you villagers you don't get to pretend you didn't emotionally, psychologically, and in some cases physically abuse and neglect a child for over a decade and a half and then turn around and act like he's the best thing that's ever happened to Konoha once he's proved himself useful to you. \n\nHe shouldn't have had to work as hard as he did just to earn the villager's approval, hell if anything the villagers are the ones who should be putting in an effort to try and earn his forgiveness. \n\nIf there is anyone who doesn't deserve all the hard work Naruto put into rescuing them, it's the villagers of Konoha.",
            "author": "HollyTheMage",
            "id": "gr9ypne",
            "parent_id": "t1_gr9ir58",
            "score": 12,
            "created_utc": 1616012477.0,
            "replies": [
                {
                    "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
                    "author": "saiyanfang10",
                    "id": "gracgke",
                    "parent_id": "t1_gr9ypne",
                    "score": 5,
                    "created_utc": 1616018869.0,
                    "replies": []
                },
                {
                    "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
                    "author": "TyrionGoldenLion",
                    "id": "grbngmu",
                    "parent_id": "t1_gr9ypne",
                    "score": 2,
                    "created_utc": 1616045187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gr9qoyb",
            "parent_id": "t1_gr9pu9e",
            "score": 1,
            "created_utc": 1616008879.0,
            "replies": [
                {
                    "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
                    "author": "MrLeeRob",
                    "id": "gr9s26j",
                    "parent_id": "t1_gr9qoyb",
                    "score": 1,
                    "created_utc": 1616009491.0,
                    "replies": []
                },
                {
                    "body": "Naruspot",
                    "author": "Captainprice101",
                    "id": "graj59m",
                    "parent_id": "t1_gr9qoyb",
                    "score": 1,
                    "created_utc": 1616022223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto was inspired by Sasuke in part 1 and looked up to him. He was already on his way to retrieve him before Sakura's promise.",
            "author": null,
            "id": "grage1h",
            "parent_id": "t1_gra4cz5",
            "score": 12,
            "created_utc": 1616020818.0,
            "replies": [
                {
                    "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
                    "author": "lexie98789",
                    "id": "grb2tmh",
                    "parent_id": "t1_grage1h",
                    "score": 6,
                    "created_utc": 1616032471.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe I haven’t gotten to that part or missed it",
            "author": "suzellezus",
            "id": "gramm8m",
            "parent_id": "t1_gra5fbh",
            "score": 2,
            "created_utc": 1616024024.0,
            "replies": [
                {
                    "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
                    "author": "saiyanfang10",
                    "id": "graoh3i",
                    "parent_id": "t1_gramm8m",
                    "score": 4,
                    "created_utc": 1616024994.0,
                    "replies": [
                        {
                            "body": "Oh yeah",
                            "author": "suzellezus",
                            "id": "grard1t",
                            "parent_id": "t1_graoh3i",
                            "score": 2,
                            "created_utc": 1616026507.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "and that's not even talking about how he maintained mental strength for 13 years that he never got pissed off ONCE because if he did, he'd have massacred the village until he calmed down",
            "author": "saiyanfang10",
            "id": "gracgke",
            "parent_id": "t1_gr9ypne",
            "score": 5,
            "created_utc": 1616018869.0,
            "replies": []
        },
        {
            "body": "But Naruto himself chose to prove himself to them. And you know what? At least his efforts worked and the results were organic.\n\nWhat about Sasuke? Naruto goes through hell for a someone who can't be bothered to give a damn.",
            "author": "TyrionGoldenLion",
            "id": "grbngmu",
            "parent_id": "t1_gr9ypne",
            "score": 2,
            "created_utc": 1616045187.0,
            "replies": []
        },
        {
            "body": "Just google. Or check the Naruto sub. They probably have the links. In US, the english audio used to be on VIZ's site but not anymore. It is only on Hulu and Netflix I think.",
            "author": "MrLeeRob",
            "id": "gr9s26j",
            "parent_id": "t1_gr9qoyb",
            "score": 1,
            "created_utc": 1616009491.0,
            "replies": []
        },
        {
            "body": "Naruspot",
            "author": "Captainprice101",
            "id": "graj59m",
            "parent_id": "t1_gr9qoyb",
            "score": 1,
            "created_utc": 1616022223.0,
            "replies": []
        },
        {
            "body": "You’re right but I guess I’m just referring to him constantly telling people that it’s ‘for the promise’",
            "author": "lexie98789",
            "id": "grb2tmh",
            "parent_id": "t1_grage1h",
            "score": 6,
            "created_utc": 1616032471.0,
            "replies": []
        },
        {
            "body": "\"Dark Naruto\" is the other part of himself that he hid, when Guy went to the waterfall nothing showed up",
            "author": "saiyanfang10",
            "id": "graoh3i",
            "parent_id": "t1_gramm8m",
            "score": 4,
            "created_utc": 1616024994.0,
            "replies": [
                {
                    "body": "Oh yeah",
                    "author": "suzellezus",
                    "id": "grard1t",
                    "parent_id": "t1_graoh3i",
                    "score": 2,
                    "created_utc": 1616026507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh yeah",
            "author": "suzellezus",
            "id": "grard1t",
            "parent_id": "t1_graoh3i",
            "score": 2,
            "created_utc": 1616026507.0,
            "replies": []
        }
    ]
}