{
    "title": "Itachi is the best",
    "post_id": "hpy8g5",
    "post_url": "https://www.reddit.com/r/dankruto/comments/hpy8g5/itachi_is_the_best/",
    "author": "MaxCannon25",
    "body": "",
    "url": "https://i.redd.it/kzc49cfgoga51.jpg",
    "score": 3807,
    "upvote_ratio": 0.99,
    "created_utc": 1594574938.0,
    "num_comments": 130,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Itachi is a good guy, but he needed to put Sasuke in a Tsukyomi seeing his family die over and over again just to make sasuke a sad boy?\n\nI think killing the entire clan was enough trauma",
            "author": "PlsDontBotherMeHere",
            "id": "fxvjxat",
            "parent_id": "t3_hpy8g5",
            "score": 197,
            "created_utc": 1594595650.0,
            "replies": [
                {
                    "body": "maybe at that point in the series Kishimoto hadn't thought of Itachi's entire arc yet. what you're mentioning is actually something I had thought about before",
                    "author": "_Tovar_",
                    "id": "fxvlc64",
                    "parent_id": "t1_fxvjxat",
                    "score": 118,
                    "created_utc": 1594596472.0,
                    "replies": [
                        {
                            "body": "Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\nHe also changed Edo Tensei. In Naruto(Hokage Battle Royale), Hashirama threw kunai at Hiruzen.\n\nBut in Shippuden, all 7 Ninja swordsmen of Mist are born without their swords.",
                            "author": null,
                            "id": "fxvot25",
                            "parent_id": "t1_fxvlc64",
                            "score": 73,
                            "created_utc": 1594598552.0,
                            "replies": [
                                {
                                    "body": "Is this from changing the jutsu or because the bodies sacrificed had kunai/didnt have the swords?\n\nBut I did hear he changed his kind about Itachi at some point to make him what he is today. Hell Itachi translates to 'weasel' in English",
                                    "author": "CelticDK",
                                    "id": "fxw1c5r",
                                    "parent_id": "t1_fxvot25",
                                    "score": 20,
                                    "created_utc": 1594606244.0,
                                    "replies": [
                                        {
                                            "body": "Edo Tensei only brings back souls of people into new sacrificial bodies. they look like what they were when they died. and they dont have any weapons they had when they died. so, when 7 swordsmen of mist are summoned from the dead, none of them have their swords. akatsuki had to collect their swords and give it to them.\nBUT, in the hokage fight, hashirama threw kunai at hiruzen. where did hashirama get kunai from, cos we didnt see orochimaru giving hashirama any weapons.\n\nso, yeah. kishimoto did change a lot of things\n\nand yes, itachi means weasel so maybe itachi was also changed. boruto means bolt and he is kinda sharp and OP, neji means screw and neji did, in the end, get screwed lol\n\nkakashi means scarecrow, and he is lazier than a scarecrow",
                                            "author": null,
                                            "id": "fxw4i42",
                                            "parent_id": "t1_fxw1c5r",
                                            "score": 7,
                                            "created_utc": 1594608243.0,
                                            "replies": [
                                                {
                                                    "body": "When the Hokage were brought back, they had their tool pouches like when they were alive though. And honestly, even without debating the edo tensei, homage level shinobi probably just summon the damn things somehow. Like an advanced way of what Sasuke did vs Itachi and his wrist seals.\n\nI think we've even seen Hiruzen just summon some big ass shuriken too",
                                                    "author": "CelticDK",
                                                    "id": "fxw4vk6",
                                                    "parent_id": "t1_fxw4i42",
                                                    "score": 11,
                                                    "created_utc": 1594608482.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
                                                            "author": null,
                                                            "id": "fxw60wa",
                                                            "parent_id": "t1_fxw4vk6",
                                                            "score": 5,
                                                            "created_utc": 1594609233.0,
                                                            "replies": [
                                                                {
                                                                    "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                                                                    "author": "CelticDK",
                                                                    "id": "fxw959o",
                                                                    "parent_id": "t1_fxw60wa",
                                                                    "score": 3,
                                                                    "created_utc": 1594611311.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                                                                    "author": "SomeSaltyDude",
                                                                    "id": "fxwoj15",
                                                                    "parent_id": "t1_fxw60wa",
                                                                    "score": 3,
                                                                    "created_utc": 1594623700.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "The 7 ninja did summon their weapons though",
                                                                    "author": "TheCaptainIRL",
                                                                    "id": "fxx9mav",
                                                                    "parent_id": "t1_fxw60wa",
                                                                    "score": 1,
                                                                    "created_utc": 1594643969.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Nope, the swords were collected for them.",
                                                                            "author": null,
                                                                            "id": "fxxfcug",
                                                                            "parent_id": "t1_fxx9mav",
                                                                            "score": 2,
                                                                            "created_utc": 1594647731.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                                                                    "author": "TheCaptainIRL",
                                                                                    "id": "fy0btc3",
                                                                                    "parent_id": "t1_fxxfcug",
                                                                                    "score": 1,
                                                                                    "created_utc": 1594704087.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
                                                            "author": "notanarutofan",
                                                            "id": "fy51nta",
                                                            "parent_id": "t1_fxw4vk6",
                                                            "score": 1,
                                                            "created_utc": 1594818026.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\n\"He was out of chakra, bruh\"\n\n - Kishimoto probably",
                                    "author": null,
                                    "id": "fxwyrnc",
                                    "parent_id": "t1_fxvot25",
                                    "score": 4,
                                    "created_utc": 1594634130.0,
                                    "replies": []
                                },
                                {
                                    "body": "I feel like the reanimating thing can be attributed to the fact that the swords are owned by people alive not just generic weapons that every ninja owns",
                                    "author": "NoisyTornado",
                                    "id": "fxwpqk1",
                                    "parent_id": "t1_fxvot25",
                                    "score": 3,
                                    "created_utc": 1594624855.0,
                                    "replies": []
                                },
                                {
                                    "body": "Substitution Jutsu was basically a get out of character death free card from the getgo",
                                    "author": "RollerCoasterBacon",
                                    "id": "fxx1bv2",
                                    "parent_id": "t1_fxvot25",
                                    "score": 1,
                                    "created_utc": 1594636800.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I've always sworn up and down that Itachi's entire arc and motivations were added afterwards.  It's *conceivable* that Itachi was actually a mastermind good guy all along and was working against hidden evils in the village, but idk man, he's pretty much a pure villain up to Shippuden.  He tortures both Kakashi and Sasuke over and over and over for really no reason.\n\nI think the original plan for Itachi was keeping Sasuke alive to take his eyes.  Stealing eyes was obviously planned early on because of Kakashi.  However, I think the idea of humanizing an antagonist and giving new meaning to earlier parts in the series ended up being seen as a more interesting plot point (IMO it absolutely is) and the Eye-theft was pushed to another antagonist (who wasn't planned from the start).\n\nJust pure speculation on my part, but it's the main reason I roll my eyes when people want to rewatch original Naruto to see good guy Itachi with a new meaning behind him.  Like, eh, he's still a really bad guy at that point.",
                            "author": "Packrat1010",
                            "id": "fxxk20g",
                            "parent_id": "t1_fxvlc64",
                            "score": 2,
                            "created_utc": 1594650442.0,
                            "replies": [
                                {
                                    "body": "I agree, and Danzo is a way better antagonist than Itachi. I fucking hate that guy.\n\nAnd Kisame DID say when he and Itachi came to Konoha in the original that Itachi wasn’t at his full strength (implying the sickness he died from) so possibly you could infer he tortured Kakashi and Sasuke to keep up the big bad boy facade and to encourage Sasuke to figure out how to take him in and defeat him? And also, he did have to make it super believable, because if Sasuke had any reservations about killing Itachi, Itachi wouldn’t have been able to extract Orochimaru from him.",
                                    "author": "notanarutofan",
                                    "id": "fy5246p",
                                    "parent_id": "t1_fxxk20g",
                                    "score": 3,
                                    "created_utc": 1594818317.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I can understand the argument for doing it to Sasuke, but did he really need to torture Kakashi for three days in a Tsukuyomi",
                    "author": "TheIronMuffin",
                    "id": "fxvynb5",
                    "parent_id": "t1_fxvjxat",
                    "score": 16,
                    "created_utc": 1594604588.0,
                    "replies": [
                        {
                            "body": "Easier than actually fighting Kakashi. He could have made it weeks if he wanted to. Three days is enough to wear him out",
                            "author": "iNonEntity",
                            "id": "fxw0mru",
                            "parent_id": "t1_fxvynb5",
                            "score": 7,
                            "created_utc": 1594605804.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Honestly, I think he did have to do that. Sasuke thought he was such a badass charging him with that chidori. Itachi probably realized that he needed to give Sasuke a major reality check, or he would never become strong enough.",
                    "author": "DizKord",
                    "id": "fxvte2e",
                    "parent_id": "t1_fxvjxat",
                    "score": 30,
                    "created_utc": 1594601367.0,
                    "replies": [
                        {
                            "body": "My ma’an\nItachi putted the Tsukyomi in Sasuke when he was 5 fucking years old,when he awakened the sharingan,sasuke was just another normal child who one say saw his entire clan be massacrated over and over again when he was a dumb kid\nNot the Chidori Sasuke from chunin arc",
                            "author": "PlsDontBotherMeHere",
                            "id": "fxvtqk9",
                            "parent_id": "t1_fxvte2e",
                            "score": 28,
                            "created_utc": 1594601574.0,
                            "replies": [
                                {
                                    "body": "Oh, shit, forgot about that. I think it's a similar explanation though. Regular trauma, even as fucked up as having both of your parents killed by your brother, isn't necessarily going to set you on a path of revenge. I think the tsukuyomi was insurance. Itachi probably wanted to directly connect to Sasuke's brain and shape it in the way he thought he needed to, leaving no doubt that Sasuke would go down the path he did. Very fucked up situation but the fact that Itachi suffered immensely from having to do all of this is canon.",
                                    "author": "DizKord",
                                    "id": "fxvuyxf",
                                    "parent_id": "t1_fxvtqk9",
                                    "score": 7,
                                    "created_utc": 1594602329.0,
                                    "replies": [
                                        {
                                            "body": "Yeah this is possible\nAnd maybe when he put the tsukyomi he implanted the amaterasu as well",
                                            "author": "PlsDontBotherMeHere",
                                            "id": "fxvv308",
                                            "parent_id": "t1_fxvuyxf",
                                            "score": 3,
                                            "created_utc": 1594602398.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Also, did Sasuke awaken the sharingan before or after being put under Tsukyomi? I can’t remember, honestly.",
                                            "author": "notanarutofan",
                                            "id": "fy52dy2",
                                            "parent_id": "t1_fxvuyxf",
                                            "score": 1,
                                            "created_utc": 1594818490.0,
                                            "replies": [
                                                {
                                                    "body": "After the tsukyiomi,probably another explanation",
                                                    "author": "PlsDontBotherMeHere",
                                                    "id": "fy80lzy",
                                                    "parent_id": "t1_fy52dy2",
                                                    "score": 2,
                                                    "created_utc": 1594874427.0,
                                                    "replies": [
                                                        {
                                                            "body": "That’s what I was thinking",
                                                            "author": "notanarutofan",
                                                            "id": "fy878s2",
                                                            "parent_id": "t1_fy80lzy",
                                                            "score": 1,
                                                            "created_utc": 1594879725.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's what big brothers are for",
                    "author": "UindiaUwin",
                    "id": "fxwzcuq",
                    "parent_id": "t1_fxvjxat",
                    "score": 6,
                    "created_utc": 1594634752.0,
                    "replies": []
                },
                {
                    "body": "Itachi IMO just wanted to make Sasuke powerful. He planned everything, he wanted to be killed by Sasuke to make him have mangekyo and because he had an illness.",
                    "author": "Pizzatime2610",
                    "id": "fxwjaml",
                    "parent_id": "t1_fxvjxat",
                    "score": 5,
                    "created_utc": 1594618981.0,
                    "replies": [
                        {
                            "body": "My dude did you read the comments section in this Debate or are  you just an Itachi Fan Boy,because half of Naruto fandom is of your type of people",
                            "author": "PlsDontBotherMeHere",
                            "id": "fy80hkl",
                            "parent_id": "t1_fxwjaml",
                            "score": 1,
                            "created_utc": 1594874339.0,
                            "replies": [
                                {
                                    "body": "Yes. I'm an Itachi fan boy. What's the other half can you tell me?",
                                    "author": "Pizzatime2610",
                                    "id": "fy82gfq",
                                    "parent_id": "t1_fy80hkl",
                                    "score": 2,
                                    "created_utc": 1594875770.0,
                                    "replies": [
                                        {
                                            "body": "Other Fanboys of Sasuke Naruto and the rest",
                                            "author": "PlsDontBotherMeHere",
                                            "id": "fy8iv1w",
                                            "parent_id": "t1_fy82gfq",
                                            "score": 1,
                                            "created_utc": 1594890956.0,
                                            "replies": [
                                                {
                                                    "body": "Are you a fanboy?",
                                                    "author": "Pizzatime2610",
                                                    "id": "fy9tqe8",
                                                    "parent_id": "t1_fy8iv1w",
                                                    "score": 1,
                                                    "created_utc": 1594920596.0,
                                                    "replies": [
                                                        {
                                                            "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
                                                            "author": "PlsDontBotherMeHere",
                                                            "id": "fyb5tzs",
                                                            "parent_id": "t1_fy9tqe8",
                                                            "score": 1,
                                                            "created_utc": 1594944833.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't see how killing literally his entire clan allows him to be a good guy? A good guy would have turned down that order. And if he was strong enough to kill them all then a coup by the Uchiha was never really a threat... was it?",
                    "author": "CleanSnchz",
                    "id": "fzj18nw",
                    "parent_id": "t1_fxvjxat",
                    "score": 1,
                    "created_utc": 1595955017.0,
                    "replies": [
                        {
                            "body": "Itachi did not turned himself down so after he killed his entire clan and became a nukenin, he could be a spy in akatsuki so he could pass important information to konoha",
                            "author": "PlsDontBotherMeHere",
                            "id": "g05wgdn",
                            "parent_id": "t1_fzj18nw",
                            "score": 1,
                            "created_utc": 1596418061.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Itachi did the better of two options. He was 10000% not a good guy. A badass yes 100%. Good guy? No. He put sasuke in a genjutsu and made him watch his parents and family die over and over like 100,000 times if I remember the maths right.\n\nEdit: it was 4am and I said Kakashi instead of Itachi for some reason.",
            "author": "PixelSushii",
            "id": "fxw0ne5",
            "parent_id": "t3_hpy8g5",
            "score": 22,
            "created_utc": 1594605815.0,
            "replies": [
                {
                    "body": "When?",
                    "author": null,
                    "id": "fxwch7e",
                    "parent_id": "t1_fxw0ne5",
                    "score": 1,
                    "created_utc": 1594613639.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fxwfpqi",
                            "parent_id": "t1_fxwch7e",
                            "score": 1,
                            "created_utc": 1594616054.0,
                            "replies": [
                                {
                                    "body": "Oh itachi, because you wrote Kakashi in your comment.",
                                    "author": null,
                                    "id": "fxwg0lv",
                                    "parent_id": "t1_fxwfpqi",
                                    "score": 1,
                                    "created_utc": 1594616293.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I’m just an idiot it was late, I meant Itachi",
                                            "author": "PixelSushii",
                                            "id": "fxwoe5r",
                                            "parent_id": "t1_fxwg0lv",
                                            "score": 2,
                                            "created_utc": 1594623576.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah he was a murderer. Could have gotten jairaiah to help take down danzo. All that smarts for nothing.",
            "author": null,
            "id": "fxw99o1",
            "parent_id": "t3_hpy8g5",
            "score": 17,
            "created_utc": 1594611393.0,
            "replies": [
                {
                    "body": "The fact that you couldn’t even do a simple google search to spell Jiraiya correctly says a lot about the credibility of your opinion here.",
                    "author": "notanarutofan",
                    "id": "fy52jbf",
                    "parent_id": "t1_fxw99o1",
                    "score": 3,
                    "created_utc": 1594818584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m gonna get downvoted to hell for this, but I personally don’t think Itachi was a good guy. While what he did undoubtedly delayed the 4th Shinobi War, he still committed genocide against his entire clan—including innocent civilians—and essentially tortured his brother with Tsukuyomi. Yes he was manipulated by Danzo, Madara and the elders, but it was still ultimately a decision he made.\n\nHowever, it’s precisely this complicated view we get of his motives that makes him one of the best characters in the show. So, in that sense, he is best boy, but not a good boy.",
            "author": "HugoSalvia",
            "id": "fxvte6c",
            "parent_id": "t3_hpy8g5",
            "score": 82,
            "created_utc": 1594601369.0,
            "replies": [
                {
                    "body": "Exactly my point, what he did was extremely unnecessary to me. I had this exact convo with my friend last night.",
                    "author": "MarcelSSJ4",
                    "id": "fxvzq4h",
                    "parent_id": "t1_fxvte6c",
                    "score": 16,
                    "created_utc": 1594605243.0,
                    "replies": []
                },
                {
                    "body": "\n>However, it’s precisely this complicated view we get of his motives that makes him one of the best characters in the show. So, in that sense, he is best boy, but not a good boy.\n\nThis is exactly what I keep saying, but most people think you're either a stan or a hater if you do. It's like Snape all over again.",
                    "author": "SirVer51",
                    "id": "fxwp7s4",
                    "parent_id": "t1_fxvte6c",
                    "score": 8,
                    "created_utc": 1594624348.0,
                    "replies": [
                        {
                            "body": "I wouldn't worry about that tbh. Honestly that seems like more of a vocal minority of fans who actually genuinely care if you like Itachi or not. He's one of the most popular Naruto characters for a reason. I think most people like Itachi.",
                            "author": "silverx2000",
                            "id": "fxwvl0m",
                            "parent_id": "t1_fxwp7s4",
                            "score": 3,
                            "created_utc": 1594630801.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He wasn't manipulated by anyone but he had to make all the decisions on his own and just listened to what they had to say to know their plans too for full context and understanding. He was literally trapped between the world and his clan, and knew which one had to win.. \n\nWe can debate philosophies about what makes someone good or evil, but if a dog kills someone to defend its owner, is the dog bad? If killing makes you bad, then no one in that show was good... especially Kakashi.\n\nHashirama had to kill Madara (or so he thought) so I guess he was a bad guy too.\n\nEven Itachi's parents commented on how kind and gentle Itachi his. They saw his goodness even though he was taking their lives.\n\nThe innocent civilians part is speculation because almost everyone was in on the plan, and technically, Obito coulda been the ones to kill them (haha kidding here) but letting them live will create hatred and revenge vs the village anyway, like with Sasuke.\n\nBut as for torturing Sasuke, this was when Itachi wasnt written to become what he eventually became, so yeah going that far was excessive. But being an Uchiha, the deeper the trauma, the deeper the power so who knows if it was needed or not.",
                    "author": "CelticDK",
                    "id": "fxw2bi4",
                    "parent_id": "t1_fxvte6c",
                    "score": 8,
                    "created_utc": 1594606856.0,
                    "replies": [
                        {
                            "body": "Damn even the babies were in the plan?",
                            "author": null,
                            "id": "fxwcfm3",
                            "parent_id": "t1_fxw2bi4",
                            "score": 9,
                            "created_utc": 1594613608.0,
                            "replies": [
                                {
                                    "body": "Hell yeah! Babies are evil.\n\nWere there any babies at that time?",
                                    "author": "CelticDK",
                                    "id": "fxwcu3o",
                                    "parent_id": "t1_fxwcfm3",
                                    "score": 3,
                                    "created_utc": 1594613897.0,
                                    "replies": [
                                        {
                                            "body": "A clan with hundred of people not making a child in 8 years, what kind of plot hole would that be lol.",
                                            "author": null,
                                            "id": "fxwd87i",
                                            "parent_id": "t1_fxwcu3o",
                                            "score": 7,
                                            "created_utc": 1594614176.0,
                                            "replies": [
                                                {
                                                    "body": "Still didnt answer my question. And your definition of 'baby' being under 8 years is a bit strange. \n\nWhy did Danzou specifically offer to save Sasuke for Itachi and not those other kids possibly younger than him too if they existed?\n\nPs. Even if there were kids younger that had to die too, they're in a ninja world where killing is alright and doing whatever you had to do was simply that. My point was Itachi didn't want to kill a single member of his clan, and had to kill them all for the sake of the village (and the world).",
                                                    "author": "CelticDK",
                                                    "id": "fxwe387",
                                                    "parent_id": "t1_fxwd87i",
                                                    "score": 1,
                                                    "created_utc": 1594614811.0,
                                                    "replies": [
                                                        {
                                                            "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
                                                            "author": null,
                                                            "id": "fxwerfb",
                                                            "parent_id": "t1_fxwe387",
                                                            "score": 2,
                                                            "created_utc": 1594615315.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                                                                    "author": "CelticDK",
                                                                    "id": "fxwflf6",
                                                                    "parent_id": "t1_fxwerfb",
                                                                    "score": 0,
                                                                    "created_utc": 1594615961.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                                                                            "author": null,
                                                                            "id": "fxwgnkx",
                                                                            "parent_id": "t1_fxwflf6",
                                                                            "score": 1,
                                                                            "created_utc": 1594616807.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not to jump too far into ethics, but most people agree that killing in self defense isn't nearly as abhorrent as genocide.  You might be able to say that Itachi committed genocide for the greater good, but... I mean, genocide is still genocide.",
                            "author": "Packrat1010",
                            "id": "fxxllrh",
                            "parent_id": "t1_fxw2bi4",
                            "score": 0,
                            "created_utc": 1594651294.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well yeah he did fucked up shit but in the bigger picture it was for the greater good",
                    "author": null,
                    "id": "fxvz54u",
                    "parent_id": "t1_fxvte6c",
                    "score": 5,
                    "created_utc": 1594604886.0,
                    "replies": [
                        {
                            "body": "90% of the stuff he did was for the greater good. He had absolutely no need to force sasuke to watch his parents die over and over. It wasn’t necessary",
                            "author": "PixelSushii",
                            "id": "fxw0suh",
                            "parent_id": "t1_fxvz54u",
                            "score": 24,
                            "created_utc": 1594605912.0,
                            "replies": [
                                {
                                    "body": "Killing young children and regular citizens wasnt for the greater good",
                                    "author": "crazyfrecs",
                                    "id": "fxwyy9s",
                                    "parent_id": "t1_fxw0suh",
                                    "score": 3,
                                    "created_utc": 1594634325.0,
                                    "replies": []
                                },
                                {
                                    "body": "I'd say it was necessary, sasuke had many flashbacks to this which showed it had a big impact. Without it he may not have had enough hatred to chase revenge all the way through. Itachi wasnt going to risk something like that, he needed to make sure his plan succeeded",
                                    "author": null,
                                    "id": "fxw135i",
                                    "parent_id": "t1_fxw0suh",
                                    "score": 0,
                                    "created_utc": 1594606090.0,
                                    "replies": [
                                        {
                                            "body": "Forcing sasuke to exact revenge for the uchiha clan wasn’t necessary either, it was selfish because he wanted somebody to hold him accountable for what he did. His entire plan for sasuke was born out of selfishness. Sasuke, a child, is now more than likely scarred for eternity, probably still has nightmares about the whole thing in his late 20’s/ early 30’s.",
                                            "author": "PixelSushii",
                                            "id": "fxw1dah",
                                            "parent_id": "t1_fxw135i",
                                            "score": 12,
                                            "created_utc": 1594606263.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nope, I agree completely.\n\nI actually would've liked Itachi as a character a lot better if Kishi portrayed him not as an ''infallible hero'' (although Itachi HIMSELF admits he failed and what not, the manga doesn't do a well enough job of demonstrating it IMO) but as a misguided dude not unlike Obito and Madara.",
                    "author": null,
                    "id": "fxxbtv8",
                    "parent_id": "t1_fxvte6c",
                    "score": 1,
                    "created_utc": 1594645484.0,
                    "replies": []
                },
                {
                    "body": "He had to. The clan could have been killed either by him or the leaf.",
                    "author": "Pizzatime2610",
                    "id": "fxwjgv9",
                    "parent_id": "t1_fxvte6c",
                    "score": 0,
                    "created_utc": 1594619126.0,
                    "replies": [
                        {
                            "body": "Literally in his last conversation with Sasuke after defeating Kabuto he says that killing his clan probably wasn’t necessary if he had just trusted his clan members and Sasuke enough to speak with them honestly, because he tried to solve the problem himself (and due to pressure from Danzo who doesn’t trust anybody) he was led down the dark path that we see. The entire theme of Naruto is about trusting your friends and the people around you",
                            "author": "Anything_Random",
                            "id": "fxwwx6k",
                            "parent_id": "t1_fxwjgv9",
                            "score": 3,
                            "created_utc": 1594632197.0,
                            "replies": [
                                {
                                    "body": "I think we’re forgetting about the fact that he was 13 when he committed the genocide. And if any of y’all said you knew how to properly deal with problems and couldn’t be manipulated by authorities at the age of 12, you’re lying.",
                                    "author": "notanarutofan",
                                    "id": "fy532j8",
                                    "parent_id": "t1_fxwwx6k",
                                    "score": 2,
                                    "created_utc": 1594818916.0,
                                    "replies": []
                                },
                                {
                                    "body": "He did the right thing. The Uchiha's were very powerful.",
                                    "author": "Pizzatime2610",
                                    "id": "fxwx1ax",
                                    "parent_id": "t1_fxwwx6k",
                                    "score": 1,
                                    "created_utc": 1594632317.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know this is gonna be controversial, but Itachi is hella overrated. He killed his entire clan when he, being as smart as he is, could of settled the situation  better. He also practically tortured his brother which he loved, who he could of easily told his secret to and Sasuke most likely wouldn't have told anyone out of respect for him. If he told Sasuke maybe Obito wouldn't have manipulated him into joining the Akatsuki and practically becoming the very thing Itachi was. He stopped the reanimaion jutsu out of sheer luck. He put on a farce of being psychopath when he kinda was.",
            "author": "sielnt_assassin",
            "id": "fxvwqco",
            "parent_id": "t3_hpy8g5",
            "score": 41,
            "created_utc": 1594603409.0,
            "replies": [
                {
                    "body": "His power level is also a Mary Sue.  I was watching [Swagkage's](https://www.youtube.com/watch?v=YVtzjaf-N_A) video talking about his power level and it was soooo over the top.  Oh, he was a 5 year old that could stop a giant boulder and he completed the Chunin exam in 10 minutes, and he was a Jonin by 7.\n\nIdk, I like the end result of Itachi's character, but sometimes he feels like he was written by an edgy 12 year old.",
                    "author": "Packrat1010",
                    "id": "fxxom1o",
                    "parent_id": "t1_fxvwqco",
                    "score": 6,
                    "created_utc": 1594652910.0,
                    "replies": []
                },
                {
                    "body": "I think he tortured Sasuke with his mangekyo because he wanted to give him power to survive in the shinobi world.",
                    "author": "Pizzatime2610",
                    "id": "fxwj467",
                    "parent_id": "t1_fxvwqco",
                    "score": 4,
                    "created_utc": 1594618833.0,
                    "replies": [
                        {
                            "body": "Sasuke had already witnessed the horrors of the shinobi world when his entire clan was kill. Itachi made him relive it for 72 hours which way overkill",
                            "author": "sielnt_assassin",
                            "id": "fxwjtd1",
                            "parent_id": "t1_fxwj467",
                            "score": 6,
                            "created_utc": 1594619418.0,
                            "replies": [
                                {
                                    "body": "That was for his hatred.",
                                    "author": "Pizzatime2610",
                                    "id": "fxx22gc",
                                    "parent_id": "t1_fxwjtd1",
                                    "score": 1,
                                    "created_utc": 1594637548.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He was 13 my guy.",
                    "author": "notanarutofan",
                    "id": "fy534ch",
                    "parent_id": "t1_fxvwqco",
                    "score": 1,
                    "created_utc": 1594818947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know what they say, road to hell is paved with good intentions.",
            "author": "thiccythighs69",
            "id": "fxwwodz",
            "parent_id": "t3_hpy8g5",
            "score": 6,
            "created_utc": 1594631945.0,
            "replies": []
        },
        {
            "body": "I am forever in the Itachi is a terrorist camp. The ends did not justify the means",
            "author": "77pimp",
            "id": "fxw475c",
            "parent_id": "t3_hpy8g5",
            "score": 10,
            "created_utc": 1594608047.0,
            "replies": [
                {
                    "body": "Could have easily made Shisui or Itachi hokage if they really wanted peace. What they wanted is simple, they wanted the Uchiha out and nothing else.",
                    "author": null,
                    "id": "fxwcnp4",
                    "parent_id": "t1_fxw475c",
                    "score": 6,
                    "created_utc": 1594613766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If there is one thing in common amongst the Uchiha clan that not even Itachi escaped from is their sense of pride and desire for power. Even as a kid, he saw power as the ultimate way to achieve peace, and didn’t actively make any friends because he felt it was a waste of time and effort. \nI’ve heard somewhere that a character flaw is something that gets in the way of their goals. Itachi wanted to achieve peace but he dismissed the idea of getting help from others simply out of stubbornness that it was solely his own problem to solve or he doesn’t have the necessary connections. Hiruzen? he flat out distrusted him on not taking the extreme route. Jiraiya? No way of contacting nor does he know the guy. Kakashi? Itachi looked up to him as a trustworthy senior but he wasn’t at Shisui levels of trust. In short, his entourage consists of very few people. I just can’t see him asking for help from anybody due to his personality.",
            "author": "casualbreeze",
            "id": "fxwwncc",
            "parent_id": "t3_hpy8g5",
            "score": 4,
            "created_utc": 1594631914.0,
            "replies": [
                {
                    "body": "He even addressed that when he was edo tensei’d. That was his parting words to Naruto: that he needed help and he couldn’t do everything alone, because that was his (Itachi’s) biggest mistake in life.",
                    "author": "notanarutofan",
                    "id": "fy53h4i",
                    "parent_id": "t1_fxwwncc",
                    "score": 3,
                    "created_utc": 1594819165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "U don’t murder ur entire clan if ur a good guy. Idc about his ‘redemption’. But since everyone in the naruto fandom loves his design and thinks he’s cool. You can like a character and admit they’re still shitty.\n\nEdit: also what the other commenters have pointed out? What he did to sasuke afterwards with the tsukuyomi? All his shitty actions? There is no greater good, just watch fate zero, it literally shows that. lmaooo",
            "author": "klowndykebar",
            "id": "fxw064o",
            "parent_id": "t3_hpy8g5",
            "score": 15,
            "created_utc": 1594605516.0,
            "replies": [
                {
                    "body": ">But since everyone in the naruto fandom loves his design and thinks he’s cool.\n\nOr maybe people genuinely like him. It's cool if you don't, but don't act like you're above the rest of the fandom lmaooo.",
                    "author": "The96thPoet",
                    "id": "fxwxjwa",
                    "parent_id": "t1_fxw064o",
                    "score": 3,
                    "created_utc": 1594632855.0,
                    "replies": [
                        {
                            "body": "Don’t know where you got that I feel above the fandom but aight. If the shoe fits I guess, you’re free to like him idc. I was saying people try to excuse his actions because they find him cool.",
                            "author": "klowndykebar",
                            "id": "fxwyi1d",
                            "parent_id": "t1_fxwxjwa",
                            "score": 2,
                            "created_utc": 1594633848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine getting downvoted because you don't think Itachi is the best",
            "author": "rusty-toast",
            "id": "fxvidyn",
            "parent_id": "t3_hpy8g5",
            "score": 18,
            "created_utc": 1594594763.0,
            "replies": [
                {
                    "body": "They’re getting downvoted because they’re basically saying he’s a bad guy",
                    "author": "Peng1GT",
                    "id": "fxvlzbm",
                    "parent_id": "t1_fxvidyn",
                    "score": 13,
                    "created_utc": 1594596855.0,
                    "replies": [
                        {
                            "body": "They said hes not the best and that's it lmao now I'm getting downvoted",
                            "author": "rusty-toast",
                            "id": "fxvnh99",
                            "parent_id": "t1_fxvlzbm",
                            "score": 7,
                            "created_utc": 1594597748.0,
                            "replies": [
                                {
                                    "body": "Oh that’s an oof",
                                    "author": "Peng1GT",
                                    "id": "fxvnjry",
                                    "parent_id": "t1_fxvnh99",
                                    "score": 5,
                                    "created_utc": 1594597789.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a good guy, killing several innocent kids and stuff. Just the best :)",
            "author": "uSidney03",
            "id": "fxvurxb",
            "parent_id": "t3_hpy8g5",
            "score": 9,
            "created_utc": 1594602210.0,
            "replies": []
        },
        {
            "body": "I don’t like Itachi",
            "author": "MarcelSSJ4",
            "id": "fxvovjt",
            "parent_id": "t3_hpy8g5",
            "score": 10,
            "created_utc": 1594598593.0,
            "replies": [
                {
                    "body": "Why do you prefer to live with this in ur heart?",
                    "author": "MIKEY_VEE123youandME",
                    "id": "fxvwg54",
                    "parent_id": "t1_fxvovjt",
                    "score": -7,
                    "created_utc": 1594603236.0,
                    "replies": [
                        {
                            "body": "What he did wasn’t justified or ethical to me",
                            "author": "MarcelSSJ4",
                            "id": "fxvwjqz",
                            "parent_id": "t1_fxvwg54",
                            "score": 14,
                            "created_utc": 1594603298.0,
                            "replies": [
                                {
                                    "body": "It was an order from the black ops, if he didn’t follow orders they would’ve killed them either way but itachi was able to save his brother at least if he did it himself, he loved the rest of the village too much to let war take place\n\nBut I see where you’re coming from",
                                    "author": "MIKEY_VEE123youandME",
                                    "id": "fxvxb70",
                                    "parent_id": "t1_fxvwjqz",
                                    "score": -2,
                                    "created_utc": 1594603763.0,
                                    "replies": [
                                        {
                                            "body": "Or proceed with the coup.",
                                            "author": null,
                                            "id": "fxwcqlt",
                                            "parent_id": "t1_fxvxb70",
                                            "score": 5,
                                            "created_utc": 1594613824.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly, coup=war (basically)",
                                                    "author": "MIKEY_VEE123youandME",
                                                    "id": "fxwlm3w",
                                                    "parent_id": "t1_fxwcqlt",
                                                    "score": 2,
                                                    "created_utc": 1594621014.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
                                                            "author": null,
                                                            "id": "fxwo55l",
                                                            "parent_id": "t1_fxwlm3w",
                                                            "score": 0,
                                                            "created_utc": 1594623345.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                                                                    "author": "MIKEY_VEE123youandME",
                                                                    "id": "fxwokra",
                                                                    "parent_id": "t1_fxwo55l",
                                                                    "score": 1,
                                                                    "created_utc": 1594623744.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                                                                            "author": null,
                                                                            "id": "fxwp1kd",
                                                                            "parent_id": "t1_fxwokra",
                                                                            "score": 0,
                                                                            "created_utc": 1594624183.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                                                                    "author": "MIKEY_VEE123youandME",
                                                                                    "id": "fxwqi06",
                                                                                    "parent_id": "t1_fxwp1kd",
                                                                                    "score": 1,
                                                                                    "created_utc": 1594625604.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                                                                            "author": null,
                                                                                            "id": "fxwsw2j",
                                                                                            "parent_id": "t1_fxwqi06",
                                                                                            "score": 1,
                                                                                            "created_utc": 1594628037.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                                                                    "author": "MIKEY_VEE123youandME",
                                                                                                    "id": "fxwu2gt",
                                                                                                    "parent_id": "t1_fxwsw2j",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1594629253.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't get this meme",
            "author": "b3astM0de3",
            "id": "fxvuz76",
            "parent_id": "t3_hpy8g5",
            "score": 2,
            "created_utc": 1594602334.0,
            "replies": [
                {
                    "body": "You probably haven't finished Naruto yet. Don't come on Naruto subreddits when you haven't finished the series, you'll get it spoiled",
                    "author": null,
                    "id": "fxyolup",
                    "parent_id": "t1_fxvuz76",
                    "score": 1,
                    "created_utc": 1594670308.0,
                    "replies": [
                        {
                            "body": "No I finished naruto, I mean i dont get the context of the meme like why Is the astronaut holding the gun.",
                            "author": "b3astM0de3",
                            "id": "fxyv1oz",
                            "parent_id": "t1_fxyolup",
                            "score": 2,
                            "created_utc": 1594673386.0,
                            "replies": [
                                {
                                    "body": "It's a meme template, I don't know where it's from though",
                                    "author": null,
                                    "id": "fy1iqqz",
                                    "parent_id": "t1_fxyv1oz",
                                    "score": 2,
                                    "created_utc": 1594738796.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[https://imgur.com/A6nvx7j](https://imgur.com/A6nvx7j)\n\n\\#plannedparenthood#greatergood#edgygenocide#konohahitler\n\nI put in as much effort with this photo as kishi did with character development :3",
            "author": "kishipleasestop",
            "id": "fxx5xix",
            "parent_id": "t3_hpy8g5",
            "score": 2,
            "created_utc": 1594641086.0,
            "replies": []
        },
        {
            "body": "snape V2",
            "author": null,
            "id": "fxxc1tn",
            "parent_id": "t3_hpy8g5",
            "score": 2,
            "created_utc": 1594645632.0,
            "replies": []
        },
        {
            "body": "Itachi is an angsty, \"Oh look I'm so clever\" piece of shit who makes unnecessarily long unnecessarily painful unnecessarily convoluted plans with multiple points of failure. Everything he does is more unnecessary than the number of times I've used the word 'unnecessary' here.\n\nItachi is bad writing personified.",
            "author": "SuperFartmeister",
            "id": "fxwf8gu",
            "parent_id": "t3_hpy8g5",
            "score": 5,
            "created_utc": 1594615682.0,
            "replies": [
                {
                    "body": "Just because you don't like a character doesn't mean they're \"badly written\"",
                    "author": null,
                    "id": "fxyofim",
                    "parent_id": "t1_fxwf8gu",
                    "score": 2,
                    "created_utc": 1594670225.0,
                    "replies": [
                        {
                            "body": "You're right. \n\nIt's because the character was so badly written that I didn't like him.",
                            "author": "SuperFartmeister",
                            "id": "fy092fi",
                            "parent_id": "t1_fxyofim",
                            "score": 1,
                            "created_utc": 1594701946.0,
                            "replies": [
                                {
                                    "body": "Uhh, about your comment, what did he do that was unnecessary other than torturing Sasuke?",
                                    "author": null,
                                    "id": "fy1iwlv",
                                    "parent_id": "t1_fy092fi",
                                    "score": 2,
                                    "created_utc": 1594738877.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The uchiha was planning for coup , the leaf found out , they want to eliminate them because of that which ( makes sense) itachi did it himself . Is he bad ? Yes \nBut he saved the village. \n\nI think itachi is very interesting character who made choices, the village or family? He have to save one !",
                    "author": null,
                    "id": "fxwlpx3",
                    "parent_id": "t1_fxwf8gu",
                    "score": 3,
                    "created_utc": 1594621111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh look, if it isn’t another circlejerky “meme” about everyone’s favorite Gary Stu. \n\nCome at me! Downvote me fanboys!",
            "author": "Ancap_Free_Thinker",
            "id": "fxvv8ro",
            "parent_id": "t3_hpy8g5",
            "score": 4,
            "created_utc": 1594602499.0,
            "replies": [
                {
                    "body": "I agree with u. People are gonna downvote ya but karma is meaningless anyways. Lol People love to do mental gymnastics to prove itachi was good.",
                    "author": "klowndykebar",
                    "id": "fxw18cm",
                    "parent_id": "t1_fxvv8ro",
                    "score": 4,
                    "created_utc": 1594606179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "and that’s a fact",
            "author": "PageProdigy",
            "id": "fxx0mtk",
            "parent_id": "t3_hpy8g5",
            "score": 2,
            "created_utc": 1594636094.0,
            "replies": []
        },
        {
            "body": "Itachi is best boy",
            "author": "crustycroutons",
            "id": "fxvs8un",
            "parent_id": "t3_hpy8g5",
            "score": 2,
            "created_utc": 1594600667.0,
            "replies": []
        },
        {
            "body": "Itachi is definitely a bad guy, but this is still a good meme bc I imagine the guy on the right as Itachi killing an innocent person unlucky enough to learn the wrong thing which is beautifully ironic",
            "author": "just-_-",
            "id": "fxv7c5z",
            "parent_id": "t3_hpy8g5",
            "score": 0,
            "created_utc": 1594588628.0,
            "replies": [
                {
                    "body": "Have you finished the series...?",
                    "author": "notanarutofan",
                    "id": "fxv7mmm",
                    "parent_id": "t1_fxv7c5z",
                    "score": 9,
                    "created_utc": 1594588789.0,
                    "replies": [
                        {
                            "body": "I have, and Itachi would absolutely smoke someone if he thought they would tell Sasuke he was acting on orders.",
                            "author": "just-_-",
                            "id": "fxv92ny",
                            "parent_id": "t1_fxv7mmm",
                            "score": 0,
                            "created_utc": 1594589593.0,
                            "replies": [
                                {
                                    "body": "But that never happens, because Itachi is too elite to be the one to expose the Uchiha’s secrets. If it wasn’t for Kamui, Itachi would have taken out Obito, the only other person who knew the truth along with himself.",
                                    "author": "Snxdgrass",
                                    "id": "fxvabob",
                                    "parent_id": "t1_fxv92ny",
                                    "score": 6,
                                    "created_utc": 1594590269.0,
                                    "replies": [
                                        {
                                            "body": "Big sike, i watched the episode recently and the amaterasu touched Obito on his zetsu side. So he didn't need kamui.",
                                            "author": null,
                                            "id": "fxwcvqr",
                                            "parent_id": "t1_fxvabob",
                                            "score": 1,
                                            "created_utc": 1594613930.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Right, which is why not many people knew and the people who did know knew not to let that shit out. That doesn’t make him a bad person.",
                                    "author": "notanarutofan",
                                    "id": "fxvadnm",
                                    "parent_id": "t1_fxv92ny",
                                    "score": 1,
                                    "created_utc": 1594590299.0,
                                    "replies": [
                                        {
                                            "body": "all the child murder is what makes him a bad person",
                                            "author": "just-_-",
                                            "id": "fy3xqr6",
                                            "parent_id": "t1_fxvadnm",
                                            "score": 0,
                                            "created_utc": 1594784028.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry kid, but the world isn’t black and white. Sometimes people have to do bad things to prevent worse things from happening. Itachi was the only person who was willing to put his emotions and love for his clan aside and complete a mission for the betterment of the village. If you want to be mad at someone, be mad at Danzo, because had he not stolen Shisui’s eye, they could have taken care of it with nonviolent means. Itachi’s dad was even like “I understand why you have to do this”",
                                                    "author": "notanarutofan",
                                                    "id": "fy5100e",
                                                    "parent_id": "t1_fy3xqr6",
                                                    "score": 2,
                                                    "created_utc": 1594817601.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Its ironic how you don't really know Itachi was good all along.",
                    "author": "DogHouseRedOfficial",
                    "id": "fxvnhhl",
                    "parent_id": "t1_fxv7c5z",
                    "score": -1,
                    "created_utc": 1594597752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A visual representation of toneri killing a main family member",
            "author": "GMOneyGucci",
            "id": "fxwftqk",
            "parent_id": "t3_hpy8g5",
            "score": 1,
            "created_utc": 1594616141.0,
            "replies": []
        },
        {
            "body": "In space that gunpowder is not going to ignite.",
            "author": "AaaaNinja",
            "id": "fxwmpll",
            "parent_id": "t3_hpy8g5",
            "score": 1,
            "created_utc": 1594622026.0,
            "replies": []
        },
        {
            "body": "Imag calling danzo 2 a good guy while hating on danzo 1",
            "author": null,
            "id": "g19oo6s",
            "parent_id": "t3_hpy8g5",
            "score": 1,
            "created_utc": 1597273766.0,
            "replies": []
        },
        {
            "body": "Sasuke should have killed him and not this stupid disease\n\nHim being blind was his own fault for over using the mangekyou",
            "author": null,
            "id": "g19otti",
            "parent_id": "t3_hpy8g5",
            "score": 1,
            "created_utc": 1597273845.0,
            "replies": []
        },
        {
            "body": "Y'all are so salty in this thread.",
            "author": "The96thPoet",
            "id": "fxwxoqf",
            "parent_id": "t3_hpy8g5",
            "score": 1,
            "created_utc": 1594632995.0,
            "replies": []
        },
        {
            "body": "Ppl here clowning by forgetting itachi didn’t kill anybody in his clan but his parents in the day of the massacre. It was Tobi who kill them (he was asked by itachi bcs he couldn’t do it). Also I’m pretty sure kishimoto changes his mind about his purpose at some point, así he changed it",
            "author": "J_Ihnen",
            "id": "fxweb50",
            "parent_id": "t3_hpy8g5",
            "score": 0,
            "created_utc": 1594614974.0,
            "replies": [
                {
                    "body": "he killed all the civilians and Tobi killed all the police",
                    "author": "just-_-",
                    "id": "fy3xv9k",
                    "parent_id": "t1_fxweb50",
                    "score": 1,
                    "created_utc": 1594784110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's.. No, Just No",
            "author": "YaBoiLelz",
            "id": "fxv67uw",
            "parent_id": "t3_hpy8g5",
            "score": -6,
            "created_utc": 1594588012.0,
            "replies": []
        },
        {
            "body": "Haha *NO*",
            "author": "Taigerus",
            "id": "fxv62f1",
            "parent_id": "t3_hpy8g5",
            "score": -9,
            "created_utc": 1594587927.0,
            "replies": []
        },
        {
            "body": "Ofc",
            "author": "UrieFlimFlamSaints",
            "id": "fxw1oej",
            "parent_id": "t3_hpy8g5",
            "score": -1,
            "created_utc": 1594606455.0,
            "replies": []
        },
        {
            "body": "maybe at that point in the series Kishimoto hadn't thought of Itachi's entire arc yet. what you're mentioning is actually something I had thought about before",
            "author": "_Tovar_",
            "id": "fxvlc64",
            "parent_id": "t1_fxvjxat",
            "score": 118,
            "created_utc": 1594596472.0,
            "replies": [
                {
                    "body": "Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\nHe also changed Edo Tensei. In Naruto(Hokage Battle Royale), Hashirama threw kunai at Hiruzen.\n\nBut in Shippuden, all 7 Ninja swordsmen of Mist are born without their swords.",
                    "author": null,
                    "id": "fxvot25",
                    "parent_id": "t1_fxvlc64",
                    "score": 73,
                    "created_utc": 1594598552.0,
                    "replies": [
                        {
                            "body": "Is this from changing the jutsu or because the bodies sacrificed had kunai/didnt have the swords?\n\nBut I did hear he changed his kind about Itachi at some point to make him what he is today. Hell Itachi translates to 'weasel' in English",
                            "author": "CelticDK",
                            "id": "fxw1c5r",
                            "parent_id": "t1_fxvot25",
                            "score": 20,
                            "created_utc": 1594606244.0,
                            "replies": [
                                {
                                    "body": "Edo Tensei only brings back souls of people into new sacrificial bodies. they look like what they were when they died. and they dont have any weapons they had when they died. so, when 7 swordsmen of mist are summoned from the dead, none of them have their swords. akatsuki had to collect their swords and give it to them.\nBUT, in the hokage fight, hashirama threw kunai at hiruzen. where did hashirama get kunai from, cos we didnt see orochimaru giving hashirama any weapons.\n\nso, yeah. kishimoto did change a lot of things\n\nand yes, itachi means weasel so maybe itachi was also changed. boruto means bolt and he is kinda sharp and OP, neji means screw and neji did, in the end, get screwed lol\n\nkakashi means scarecrow, and he is lazier than a scarecrow",
                                    "author": null,
                                    "id": "fxw4i42",
                                    "parent_id": "t1_fxw1c5r",
                                    "score": 7,
                                    "created_utc": 1594608243.0,
                                    "replies": [
                                        {
                                            "body": "When the Hokage were brought back, they had their tool pouches like when they were alive though. And honestly, even without debating the edo tensei, homage level shinobi probably just summon the damn things somehow. Like an advanced way of what Sasuke did vs Itachi and his wrist seals.\n\nI think we've even seen Hiruzen just summon some big ass shuriken too",
                                            "author": "CelticDK",
                                            "id": "fxw4vk6",
                                            "parent_id": "t1_fxw4i42",
                                            "score": 11,
                                            "created_utc": 1594608482.0,
                                            "replies": [
                                                {
                                                    "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
                                                    "author": null,
                                                    "id": "fxw60wa",
                                                    "parent_id": "t1_fxw4vk6",
                                                    "score": 5,
                                                    "created_utc": 1594609233.0,
                                                    "replies": [
                                                        {
                                                            "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                                                            "author": "CelticDK",
                                                            "id": "fxw959o",
                                                            "parent_id": "t1_fxw60wa",
                                                            "score": 3,
                                                            "created_utc": 1594611311.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                                                            "author": "SomeSaltyDude",
                                                            "id": "fxwoj15",
                                                            "parent_id": "t1_fxw60wa",
                                                            "score": 3,
                                                            "created_utc": 1594623700.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "The 7 ninja did summon their weapons though",
                                                            "author": "TheCaptainIRL",
                                                            "id": "fxx9mav",
                                                            "parent_id": "t1_fxw60wa",
                                                            "score": 1,
                                                            "created_utc": 1594643969.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nope, the swords were collected for them.",
                                                                    "author": null,
                                                                    "id": "fxxfcug",
                                                                    "parent_id": "t1_fxx9mav",
                                                                    "score": 2,
                                                                    "created_utc": 1594647731.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                                                            "author": "TheCaptainIRL",
                                                                            "id": "fy0btc3",
                                                                            "parent_id": "t1_fxxfcug",
                                                                            "score": 1,
                                                                            "created_utc": 1594704087.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
                                                    "author": "notanarutofan",
                                                    "id": "fy51nta",
                                                    "parent_id": "t1_fxw4vk6",
                                                    "score": 1,
                                                    "created_utc": 1594818026.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\n\"He was out of chakra, bruh\"\n\n - Kishimoto probably",
                            "author": null,
                            "id": "fxwyrnc",
                            "parent_id": "t1_fxvot25",
                            "score": 4,
                            "created_utc": 1594634130.0,
                            "replies": []
                        },
                        {
                            "body": "I feel like the reanimating thing can be attributed to the fact that the swords are owned by people alive not just generic weapons that every ninja owns",
                            "author": "NoisyTornado",
                            "id": "fxwpqk1",
                            "parent_id": "t1_fxvot25",
                            "score": 3,
                            "created_utc": 1594624855.0,
                            "replies": []
                        },
                        {
                            "body": "Substitution Jutsu was basically a get out of character death free card from the getgo",
                            "author": "RollerCoasterBacon",
                            "id": "fxx1bv2",
                            "parent_id": "t1_fxvot25",
                            "score": 1,
                            "created_utc": 1594636800.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I've always sworn up and down that Itachi's entire arc and motivations were added afterwards.  It's *conceivable* that Itachi was actually a mastermind good guy all along and was working against hidden evils in the village, but idk man, he's pretty much a pure villain up to Shippuden.  He tortures both Kakashi and Sasuke over and over and over for really no reason.\n\nI think the original plan for Itachi was keeping Sasuke alive to take his eyes.  Stealing eyes was obviously planned early on because of Kakashi.  However, I think the idea of humanizing an antagonist and giving new meaning to earlier parts in the series ended up being seen as a more interesting plot point (IMO it absolutely is) and the Eye-theft was pushed to another antagonist (who wasn't planned from the start).\n\nJust pure speculation on my part, but it's the main reason I roll my eyes when people want to rewatch original Naruto to see good guy Itachi with a new meaning behind him.  Like, eh, he's still a really bad guy at that point.",
                    "author": "Packrat1010",
                    "id": "fxxk20g",
                    "parent_id": "t1_fxvlc64",
                    "score": 2,
                    "created_utc": 1594650442.0,
                    "replies": [
                        {
                            "body": "I agree, and Danzo is a way better antagonist than Itachi. I fucking hate that guy.\n\nAnd Kisame DID say when he and Itachi came to Konoha in the original that Itachi wasn’t at his full strength (implying the sickness he died from) so possibly you could infer he tortured Kakashi and Sasuke to keep up the big bad boy facade and to encourage Sasuke to figure out how to take him in and defeat him? And also, he did have to make it super believable, because if Sasuke had any reservations about killing Itachi, Itachi wouldn’t have been able to extract Orochimaru from him.",
                            "author": "notanarutofan",
                            "id": "fy5246p",
                            "parent_id": "t1_fxxk20g",
                            "score": 3,
                            "created_utc": 1594818317.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can understand the argument for doing it to Sasuke, but did he really need to torture Kakashi for three days in a Tsukuyomi",
            "author": "TheIronMuffin",
            "id": "fxvynb5",
            "parent_id": "t1_fxvjxat",
            "score": 16,
            "created_utc": 1594604588.0,
            "replies": [
                {
                    "body": "Easier than actually fighting Kakashi. He could have made it weeks if he wanted to. Three days is enough to wear him out",
                    "author": "iNonEntity",
                    "id": "fxw0mru",
                    "parent_id": "t1_fxvynb5",
                    "score": 7,
                    "created_utc": 1594605804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly, I think he did have to do that. Sasuke thought he was such a badass charging him with that chidori. Itachi probably realized that he needed to give Sasuke a major reality check, or he would never become strong enough.",
            "author": "DizKord",
            "id": "fxvte2e",
            "parent_id": "t1_fxvjxat",
            "score": 30,
            "created_utc": 1594601367.0,
            "replies": [
                {
                    "body": "My ma’an\nItachi putted the Tsukyomi in Sasuke when he was 5 fucking years old,when he awakened the sharingan,sasuke was just another normal child who one say saw his entire clan be massacrated over and over again when he was a dumb kid\nNot the Chidori Sasuke from chunin arc",
                    "author": "PlsDontBotherMeHere",
                    "id": "fxvtqk9",
                    "parent_id": "t1_fxvte2e",
                    "score": 28,
                    "created_utc": 1594601574.0,
                    "replies": [
                        {
                            "body": "Oh, shit, forgot about that. I think it's a similar explanation though. Regular trauma, even as fucked up as having both of your parents killed by your brother, isn't necessarily going to set you on a path of revenge. I think the tsukuyomi was insurance. Itachi probably wanted to directly connect to Sasuke's brain and shape it in the way he thought he needed to, leaving no doubt that Sasuke would go down the path he did. Very fucked up situation but the fact that Itachi suffered immensely from having to do all of this is canon.",
                            "author": "DizKord",
                            "id": "fxvuyxf",
                            "parent_id": "t1_fxvtqk9",
                            "score": 7,
                            "created_utc": 1594602329.0,
                            "replies": [
                                {
                                    "body": "Yeah this is possible\nAnd maybe when he put the tsukyomi he implanted the amaterasu as well",
                                    "author": "PlsDontBotherMeHere",
                                    "id": "fxvv308",
                                    "parent_id": "t1_fxvuyxf",
                                    "score": 3,
                                    "created_utc": 1594602398.0,
                                    "replies": []
                                },
                                {
                                    "body": "Also, did Sasuke awaken the sharingan before or after being put under Tsukyomi? I can’t remember, honestly.",
                                    "author": "notanarutofan",
                                    "id": "fy52dy2",
                                    "parent_id": "t1_fxvuyxf",
                                    "score": 1,
                                    "created_utc": 1594818490.0,
                                    "replies": [
                                        {
                                            "body": "After the tsukyiomi,probably another explanation",
                                            "author": "PlsDontBotherMeHere",
                                            "id": "fy80lzy",
                                            "parent_id": "t1_fy52dy2",
                                            "score": 2,
                                            "created_utc": 1594874427.0,
                                            "replies": [
                                                {
                                                    "body": "That’s what I was thinking",
                                                    "author": "notanarutofan",
                                                    "id": "fy878s2",
                                                    "parent_id": "t1_fy80lzy",
                                                    "score": 1,
                                                    "created_utc": 1594879725.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's what big brothers are for",
            "author": "UindiaUwin",
            "id": "fxwzcuq",
            "parent_id": "t1_fxvjxat",
            "score": 6,
            "created_utc": 1594634752.0,
            "replies": []
        },
        {
            "body": "Itachi IMO just wanted to make Sasuke powerful. He planned everything, he wanted to be killed by Sasuke to make him have mangekyo and because he had an illness.",
            "author": "Pizzatime2610",
            "id": "fxwjaml",
            "parent_id": "t1_fxvjxat",
            "score": 5,
            "created_utc": 1594618981.0,
            "replies": [
                {
                    "body": "My dude did you read the comments section in this Debate or are  you just an Itachi Fan Boy,because half of Naruto fandom is of your type of people",
                    "author": "PlsDontBotherMeHere",
                    "id": "fy80hkl",
                    "parent_id": "t1_fxwjaml",
                    "score": 1,
                    "created_utc": 1594874339.0,
                    "replies": [
                        {
                            "body": "Yes. I'm an Itachi fan boy. What's the other half can you tell me?",
                            "author": "Pizzatime2610",
                            "id": "fy82gfq",
                            "parent_id": "t1_fy80hkl",
                            "score": 2,
                            "created_utc": 1594875770.0,
                            "replies": [
                                {
                                    "body": "Other Fanboys of Sasuke Naruto and the rest",
                                    "author": "PlsDontBotherMeHere",
                                    "id": "fy8iv1w",
                                    "parent_id": "t1_fy82gfq",
                                    "score": 1,
                                    "created_utc": 1594890956.0,
                                    "replies": [
                                        {
                                            "body": "Are you a fanboy?",
                                            "author": "Pizzatime2610",
                                            "id": "fy9tqe8",
                                            "parent_id": "t1_fy8iv1w",
                                            "score": 1,
                                            "created_utc": 1594920596.0,
                                            "replies": [
                                                {
                                                    "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
                                                    "author": "PlsDontBotherMeHere",
                                                    "id": "fyb5tzs",
                                                    "parent_id": "t1_fy9tqe8",
                                                    "score": 1,
                                                    "created_utc": 1594944833.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't see how killing literally his entire clan allows him to be a good guy? A good guy would have turned down that order. And if he was strong enough to kill them all then a coup by the Uchiha was never really a threat... was it?",
            "author": "CleanSnchz",
            "id": "fzj18nw",
            "parent_id": "t1_fxvjxat",
            "score": 1,
            "created_utc": 1595955017.0,
            "replies": [
                {
                    "body": "Itachi did not turned himself down so after he killed his entire clan and became a nukenin, he could be a spy in akatsuki so he could pass important information to konoha",
                    "author": "PlsDontBotherMeHere",
                    "id": "g05wgdn",
                    "parent_id": "t1_fzj18nw",
                    "score": 1,
                    "created_utc": 1596418061.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When?",
            "author": null,
            "id": "fxwch7e",
            "parent_id": "t1_fxw0ne5",
            "score": 1,
            "created_utc": 1594613639.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fxwfpqi",
                    "parent_id": "t1_fxwch7e",
                    "score": 1,
                    "created_utc": 1594616054.0,
                    "replies": [
                        {
                            "body": "Oh itachi, because you wrote Kakashi in your comment.",
                            "author": null,
                            "id": "fxwg0lv",
                            "parent_id": "t1_fxwfpqi",
                            "score": 1,
                            "created_utc": 1594616293.0,
                            "replies": [
                                {
                                    "body": "Yeah I’m just an idiot it was late, I meant Itachi",
                                    "author": "PixelSushii",
                                    "id": "fxwoe5r",
                                    "parent_id": "t1_fxwg0lv",
                                    "score": 2,
                                    "created_utc": 1594623576.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The fact that you couldn’t even do a simple google search to spell Jiraiya correctly says a lot about the credibility of your opinion here.",
            "author": "notanarutofan",
            "id": "fy52jbf",
            "parent_id": "t1_fxw99o1",
            "score": 3,
            "created_utc": 1594818584.0,
            "replies": []
        },
        {
            "body": "Exactly my point, what he did was extremely unnecessary to me. I had this exact convo with my friend last night.",
            "author": "MarcelSSJ4",
            "id": "fxvzq4h",
            "parent_id": "t1_fxvte6c",
            "score": 16,
            "created_utc": 1594605243.0,
            "replies": []
        },
        {
            "body": "\n>However, it’s precisely this complicated view we get of his motives that makes him one of the best characters in the show. So, in that sense, he is best boy, but not a good boy.\n\nThis is exactly what I keep saying, but most people think you're either a stan or a hater if you do. It's like Snape all over again.",
            "author": "SirVer51",
            "id": "fxwp7s4",
            "parent_id": "t1_fxvte6c",
            "score": 8,
            "created_utc": 1594624348.0,
            "replies": [
                {
                    "body": "I wouldn't worry about that tbh. Honestly that seems like more of a vocal minority of fans who actually genuinely care if you like Itachi or not. He's one of the most popular Naruto characters for a reason. I think most people like Itachi.",
                    "author": "silverx2000",
                    "id": "fxwvl0m",
                    "parent_id": "t1_fxwp7s4",
                    "score": 3,
                    "created_utc": 1594630801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He wasn't manipulated by anyone but he had to make all the decisions on his own and just listened to what they had to say to know their plans too for full context and understanding. He was literally trapped between the world and his clan, and knew which one had to win.. \n\nWe can debate philosophies about what makes someone good or evil, but if a dog kills someone to defend its owner, is the dog bad? If killing makes you bad, then no one in that show was good... especially Kakashi.\n\nHashirama had to kill Madara (or so he thought) so I guess he was a bad guy too.\n\nEven Itachi's parents commented on how kind and gentle Itachi his. They saw his goodness even though he was taking their lives.\n\nThe innocent civilians part is speculation because almost everyone was in on the plan, and technically, Obito coulda been the ones to kill them (haha kidding here) but letting them live will create hatred and revenge vs the village anyway, like with Sasuke.\n\nBut as for torturing Sasuke, this was when Itachi wasnt written to become what he eventually became, so yeah going that far was excessive. But being an Uchiha, the deeper the trauma, the deeper the power so who knows if it was needed or not.",
            "author": "CelticDK",
            "id": "fxw2bi4",
            "parent_id": "t1_fxvte6c",
            "score": 8,
            "created_utc": 1594606856.0,
            "replies": [
                {
                    "body": "Damn even the babies were in the plan?",
                    "author": null,
                    "id": "fxwcfm3",
                    "parent_id": "t1_fxw2bi4",
                    "score": 9,
                    "created_utc": 1594613608.0,
                    "replies": [
                        {
                            "body": "Hell yeah! Babies are evil.\n\nWere there any babies at that time?",
                            "author": "CelticDK",
                            "id": "fxwcu3o",
                            "parent_id": "t1_fxwcfm3",
                            "score": 3,
                            "created_utc": 1594613897.0,
                            "replies": [
                                {
                                    "body": "A clan with hundred of people not making a child in 8 years, what kind of plot hole would that be lol.",
                                    "author": null,
                                    "id": "fxwd87i",
                                    "parent_id": "t1_fxwcu3o",
                                    "score": 7,
                                    "created_utc": 1594614176.0,
                                    "replies": [
                                        {
                                            "body": "Still didnt answer my question. And your definition of 'baby' being under 8 years is a bit strange. \n\nWhy did Danzou specifically offer to save Sasuke for Itachi and not those other kids possibly younger than him too if they existed?\n\nPs. Even if there were kids younger that had to die too, they're in a ninja world where killing is alright and doing whatever you had to do was simply that. My point was Itachi didn't want to kill a single member of his clan, and had to kill them all for the sake of the village (and the world).",
                                            "author": "CelticDK",
                                            "id": "fxwe387",
                                            "parent_id": "t1_fxwd87i",
                                            "score": 1,
                                            "created_utc": 1594614811.0,
                                            "replies": [
                                                {
                                                    "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
                                                    "author": null,
                                                    "id": "fxwerfb",
                                                    "parent_id": "t1_fxwe387",
                                                    "score": 2,
                                                    "created_utc": 1594615315.0,
                                                    "replies": [
                                                        {
                                                            "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                                                            "author": "CelticDK",
                                                            "id": "fxwflf6",
                                                            "parent_id": "t1_fxwerfb",
                                                            "score": 0,
                                                            "created_utc": 1594615961.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                                                                    "author": null,
                                                                    "id": "fxwgnkx",
                                                                    "parent_id": "t1_fxwflf6",
                                                                    "score": 1,
                                                                    "created_utc": 1594616807.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not to jump too far into ethics, but most people agree that killing in self defense isn't nearly as abhorrent as genocide.  You might be able to say that Itachi committed genocide for the greater good, but... I mean, genocide is still genocide.",
                    "author": "Packrat1010",
                    "id": "fxxllrh",
                    "parent_id": "t1_fxw2bi4",
                    "score": 0,
                    "created_utc": 1594651294.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well yeah he did fucked up shit but in the bigger picture it was for the greater good",
            "author": null,
            "id": "fxvz54u",
            "parent_id": "t1_fxvte6c",
            "score": 5,
            "created_utc": 1594604886.0,
            "replies": [
                {
                    "body": "90% of the stuff he did was for the greater good. He had absolutely no need to force sasuke to watch his parents die over and over. It wasn’t necessary",
                    "author": "PixelSushii",
                    "id": "fxw0suh",
                    "parent_id": "t1_fxvz54u",
                    "score": 24,
                    "created_utc": 1594605912.0,
                    "replies": [
                        {
                            "body": "Killing young children and regular citizens wasnt for the greater good",
                            "author": "crazyfrecs",
                            "id": "fxwyy9s",
                            "parent_id": "t1_fxw0suh",
                            "score": 3,
                            "created_utc": 1594634325.0,
                            "replies": []
                        },
                        {
                            "body": "I'd say it was necessary, sasuke had many flashbacks to this which showed it had a big impact. Without it he may not have had enough hatred to chase revenge all the way through. Itachi wasnt going to risk something like that, he needed to make sure his plan succeeded",
                            "author": null,
                            "id": "fxw135i",
                            "parent_id": "t1_fxw0suh",
                            "score": 0,
                            "created_utc": 1594606090.0,
                            "replies": [
                                {
                                    "body": "Forcing sasuke to exact revenge for the uchiha clan wasn’t necessary either, it was selfish because he wanted somebody to hold him accountable for what he did. His entire plan for sasuke was born out of selfishness. Sasuke, a child, is now more than likely scarred for eternity, probably still has nightmares about the whole thing in his late 20’s/ early 30’s.",
                                    "author": "PixelSushii",
                                    "id": "fxw1dah",
                                    "parent_id": "t1_fxw135i",
                                    "score": 12,
                                    "created_utc": 1594606263.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope, I agree completely.\n\nI actually would've liked Itachi as a character a lot better if Kishi portrayed him not as an ''infallible hero'' (although Itachi HIMSELF admits he failed and what not, the manga doesn't do a well enough job of demonstrating it IMO) but as a misguided dude not unlike Obito and Madara.",
            "author": null,
            "id": "fxxbtv8",
            "parent_id": "t1_fxvte6c",
            "score": 1,
            "created_utc": 1594645484.0,
            "replies": []
        },
        {
            "body": "He had to. The clan could have been killed either by him or the leaf.",
            "author": "Pizzatime2610",
            "id": "fxwjgv9",
            "parent_id": "t1_fxvte6c",
            "score": 0,
            "created_utc": 1594619126.0,
            "replies": [
                {
                    "body": "Literally in his last conversation with Sasuke after defeating Kabuto he says that killing his clan probably wasn’t necessary if he had just trusted his clan members and Sasuke enough to speak with them honestly, because he tried to solve the problem himself (and due to pressure from Danzo who doesn’t trust anybody) he was led down the dark path that we see. The entire theme of Naruto is about trusting your friends and the people around you",
                    "author": "Anything_Random",
                    "id": "fxwwx6k",
                    "parent_id": "t1_fxwjgv9",
                    "score": 3,
                    "created_utc": 1594632197.0,
                    "replies": [
                        {
                            "body": "I think we’re forgetting about the fact that he was 13 when he committed the genocide. And if any of y’all said you knew how to properly deal with problems and couldn’t be manipulated by authorities at the age of 12, you’re lying.",
                            "author": "notanarutofan",
                            "id": "fy532j8",
                            "parent_id": "t1_fxwwx6k",
                            "score": 2,
                            "created_utc": 1594818916.0,
                            "replies": []
                        },
                        {
                            "body": "He did the right thing. The Uchiha's were very powerful.",
                            "author": "Pizzatime2610",
                            "id": "fxwx1ax",
                            "parent_id": "t1_fxwwx6k",
                            "score": 1,
                            "created_utc": 1594632317.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His power level is also a Mary Sue.  I was watching [Swagkage's](https://www.youtube.com/watch?v=YVtzjaf-N_A) video talking about his power level and it was soooo over the top.  Oh, he was a 5 year old that could stop a giant boulder and he completed the Chunin exam in 10 minutes, and he was a Jonin by 7.\n\nIdk, I like the end result of Itachi's character, but sometimes he feels like he was written by an edgy 12 year old.",
            "author": "Packrat1010",
            "id": "fxxom1o",
            "parent_id": "t1_fxvwqco",
            "score": 6,
            "created_utc": 1594652910.0,
            "replies": []
        },
        {
            "body": "I think he tortured Sasuke with his mangekyo because he wanted to give him power to survive in the shinobi world.",
            "author": "Pizzatime2610",
            "id": "fxwj467",
            "parent_id": "t1_fxvwqco",
            "score": 4,
            "created_utc": 1594618833.0,
            "replies": [
                {
                    "body": "Sasuke had already witnessed the horrors of the shinobi world when his entire clan was kill. Itachi made him relive it for 72 hours which way overkill",
                    "author": "sielnt_assassin",
                    "id": "fxwjtd1",
                    "parent_id": "t1_fxwj467",
                    "score": 6,
                    "created_utc": 1594619418.0,
                    "replies": [
                        {
                            "body": "That was for his hatred.",
                            "author": "Pizzatime2610",
                            "id": "fxx22gc",
                            "parent_id": "t1_fxwjtd1",
                            "score": 1,
                            "created_utc": 1594637548.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was 13 my guy.",
            "author": "notanarutofan",
            "id": "fy534ch",
            "parent_id": "t1_fxvwqco",
            "score": 1,
            "created_utc": 1594818947.0,
            "replies": []
        },
        {
            "body": "Could have easily made Shisui or Itachi hokage if they really wanted peace. What they wanted is simple, they wanted the Uchiha out and nothing else.",
            "author": null,
            "id": "fxwcnp4",
            "parent_id": "t1_fxw475c",
            "score": 6,
            "created_utc": 1594613766.0,
            "replies": []
        },
        {
            "body": "He even addressed that when he was edo tensei’d. That was his parting words to Naruto: that he needed help and he couldn’t do everything alone, because that was his (Itachi’s) biggest mistake in life.",
            "author": "notanarutofan",
            "id": "fy53h4i",
            "parent_id": "t1_fxwwncc",
            "score": 3,
            "created_utc": 1594819165.0,
            "replies": []
        },
        {
            "body": ">But since everyone in the naruto fandom loves his design and thinks he’s cool.\n\nOr maybe people genuinely like him. It's cool if you don't, but don't act like you're above the rest of the fandom lmaooo.",
            "author": "The96thPoet",
            "id": "fxwxjwa",
            "parent_id": "t1_fxw064o",
            "score": 3,
            "created_utc": 1594632855.0,
            "replies": [
                {
                    "body": "Don’t know where you got that I feel above the fandom but aight. If the shoe fits I guess, you’re free to like him idc. I was saying people try to excuse his actions because they find him cool.",
                    "author": "klowndykebar",
                    "id": "fxwyi1d",
                    "parent_id": "t1_fxwxjwa",
                    "score": 2,
                    "created_utc": 1594633848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They’re getting downvoted because they’re basically saying he’s a bad guy",
            "author": "Peng1GT",
            "id": "fxvlzbm",
            "parent_id": "t1_fxvidyn",
            "score": 13,
            "created_utc": 1594596855.0,
            "replies": [
                {
                    "body": "They said hes not the best and that's it lmao now I'm getting downvoted",
                    "author": "rusty-toast",
                    "id": "fxvnh99",
                    "parent_id": "t1_fxvlzbm",
                    "score": 7,
                    "created_utc": 1594597748.0,
                    "replies": [
                        {
                            "body": "Oh that’s an oof",
                            "author": "Peng1GT",
                            "id": "fxvnjry",
                            "parent_id": "t1_fxvnh99",
                            "score": 5,
                            "created_utc": 1594597789.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why do you prefer to live with this in ur heart?",
            "author": "MIKEY_VEE123youandME",
            "id": "fxvwg54",
            "parent_id": "t1_fxvovjt",
            "score": -7,
            "created_utc": 1594603236.0,
            "replies": [
                {
                    "body": "What he did wasn’t justified or ethical to me",
                    "author": "MarcelSSJ4",
                    "id": "fxvwjqz",
                    "parent_id": "t1_fxvwg54",
                    "score": 14,
                    "created_utc": 1594603298.0,
                    "replies": [
                        {
                            "body": "It was an order from the black ops, if he didn’t follow orders they would’ve killed them either way but itachi was able to save his brother at least if he did it himself, he loved the rest of the village too much to let war take place\n\nBut I see where you’re coming from",
                            "author": "MIKEY_VEE123youandME",
                            "id": "fxvxb70",
                            "parent_id": "t1_fxvwjqz",
                            "score": -2,
                            "created_utc": 1594603763.0,
                            "replies": [
                                {
                                    "body": "Or proceed with the coup.",
                                    "author": null,
                                    "id": "fxwcqlt",
                                    "parent_id": "t1_fxvxb70",
                                    "score": 5,
                                    "created_utc": 1594613824.0,
                                    "replies": [
                                        {
                                            "body": "Exactly, coup=war (basically)",
                                            "author": "MIKEY_VEE123youandME",
                                            "id": "fxwlm3w",
                                            "parent_id": "t1_fxwcqlt",
                                            "score": 2,
                                            "created_utc": 1594621014.0,
                                            "replies": [
                                                {
                                                    "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
                                                    "author": null,
                                                    "id": "fxwo55l",
                                                    "parent_id": "t1_fxwlm3w",
                                                    "score": 0,
                                                    "created_utc": 1594623345.0,
                                                    "replies": [
                                                        {
                                                            "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                                                            "author": "MIKEY_VEE123youandME",
                                                            "id": "fxwokra",
                                                            "parent_id": "t1_fxwo55l",
                                                            "score": 1,
                                                            "created_utc": 1594623744.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                                                                    "author": null,
                                                                    "id": "fxwp1kd",
                                                                    "parent_id": "t1_fxwokra",
                                                                    "score": 0,
                                                                    "created_utc": 1594624183.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                                                            "author": "MIKEY_VEE123youandME",
                                                                            "id": "fxwqi06",
                                                                            "parent_id": "t1_fxwp1kd",
                                                                            "score": 1,
                                                                            "created_utc": 1594625604.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                                                                    "author": null,
                                                                                    "id": "fxwsw2j",
                                                                                    "parent_id": "t1_fxwqi06",
                                                                                    "score": 1,
                                                                                    "created_utc": 1594628037.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                                                            "author": "MIKEY_VEE123youandME",
                                                                                            "id": "fxwu2gt",
                                                                                            "parent_id": "t1_fxwsw2j",
                                                                                            "score": 1,
                                                                                            "created_utc": 1594629253.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You probably haven't finished Naruto yet. Don't come on Naruto subreddits when you haven't finished the series, you'll get it spoiled",
            "author": null,
            "id": "fxyolup",
            "parent_id": "t1_fxvuz76",
            "score": 1,
            "created_utc": 1594670308.0,
            "replies": [
                {
                    "body": "No I finished naruto, I mean i dont get the context of the meme like why Is the astronaut holding the gun.",
                    "author": "b3astM0de3",
                    "id": "fxyv1oz",
                    "parent_id": "t1_fxyolup",
                    "score": 2,
                    "created_utc": 1594673386.0,
                    "replies": [
                        {
                            "body": "It's a meme template, I don't know where it's from though",
                            "author": null,
                            "id": "fy1iqqz",
                            "parent_id": "t1_fxyv1oz",
                            "score": 2,
                            "created_utc": 1594738796.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just because you don't like a character doesn't mean they're \"badly written\"",
            "author": null,
            "id": "fxyofim",
            "parent_id": "t1_fxwf8gu",
            "score": 2,
            "created_utc": 1594670225.0,
            "replies": [
                {
                    "body": "You're right. \n\nIt's because the character was so badly written that I didn't like him.",
                    "author": "SuperFartmeister",
                    "id": "fy092fi",
                    "parent_id": "t1_fxyofim",
                    "score": 1,
                    "created_utc": 1594701946.0,
                    "replies": [
                        {
                            "body": "Uhh, about your comment, what did he do that was unnecessary other than torturing Sasuke?",
                            "author": null,
                            "id": "fy1iwlv",
                            "parent_id": "t1_fy092fi",
                            "score": 2,
                            "created_utc": 1594738877.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The uchiha was planning for coup , the leaf found out , they want to eliminate them because of that which ( makes sense) itachi did it himself . Is he bad ? Yes \nBut he saved the village. \n\nI think itachi is very interesting character who made choices, the village or family? He have to save one !",
            "author": null,
            "id": "fxwlpx3",
            "parent_id": "t1_fxwf8gu",
            "score": 3,
            "created_utc": 1594621111.0,
            "replies": []
        },
        {
            "body": "I agree with u. People are gonna downvote ya but karma is meaningless anyways. Lol People love to do mental gymnastics to prove itachi was good.",
            "author": "klowndykebar",
            "id": "fxw18cm",
            "parent_id": "t1_fxvv8ro",
            "score": 4,
            "created_utc": 1594606179.0,
            "replies": []
        },
        {
            "body": "Have you finished the series...?",
            "author": "notanarutofan",
            "id": "fxv7mmm",
            "parent_id": "t1_fxv7c5z",
            "score": 9,
            "created_utc": 1594588789.0,
            "replies": [
                {
                    "body": "I have, and Itachi would absolutely smoke someone if he thought they would tell Sasuke he was acting on orders.",
                    "author": "just-_-",
                    "id": "fxv92ny",
                    "parent_id": "t1_fxv7mmm",
                    "score": 0,
                    "created_utc": 1594589593.0,
                    "replies": [
                        {
                            "body": "But that never happens, because Itachi is too elite to be the one to expose the Uchiha’s secrets. If it wasn’t for Kamui, Itachi would have taken out Obito, the only other person who knew the truth along with himself.",
                            "author": "Snxdgrass",
                            "id": "fxvabob",
                            "parent_id": "t1_fxv92ny",
                            "score": 6,
                            "created_utc": 1594590269.0,
                            "replies": [
                                {
                                    "body": "Big sike, i watched the episode recently and the amaterasu touched Obito on his zetsu side. So he didn't need kamui.",
                                    "author": null,
                                    "id": "fxwcvqr",
                                    "parent_id": "t1_fxvabob",
                                    "score": 1,
                                    "created_utc": 1594613930.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Right, which is why not many people knew and the people who did know knew not to let that shit out. That doesn’t make him a bad person.",
                            "author": "notanarutofan",
                            "id": "fxvadnm",
                            "parent_id": "t1_fxv92ny",
                            "score": 1,
                            "created_utc": 1594590299.0,
                            "replies": [
                                {
                                    "body": "all the child murder is what makes him a bad person",
                                    "author": "just-_-",
                                    "id": "fy3xqr6",
                                    "parent_id": "t1_fxvadnm",
                                    "score": 0,
                                    "created_utc": 1594784028.0,
                                    "replies": [
                                        {
                                            "body": "Sorry kid, but the world isn’t black and white. Sometimes people have to do bad things to prevent worse things from happening. Itachi was the only person who was willing to put his emotions and love for his clan aside and complete a mission for the betterment of the village. If you want to be mad at someone, be mad at Danzo, because had he not stolen Shisui’s eye, they could have taken care of it with nonviolent means. Itachi’s dad was even like “I understand why you have to do this”",
                                            "author": "notanarutofan",
                                            "id": "fy5100e",
                                            "parent_id": "t1_fy3xqr6",
                                            "score": 2,
                                            "created_utc": 1594817601.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its ironic how you don't really know Itachi was good all along.",
            "author": "DogHouseRedOfficial",
            "id": "fxvnhhl",
            "parent_id": "t1_fxv7c5z",
            "score": -1,
            "created_utc": 1594597752.0,
            "replies": []
        },
        {
            "body": "he killed all the civilians and Tobi killed all the police",
            "author": "just-_-",
            "id": "fy3xv9k",
            "parent_id": "t1_fxweb50",
            "score": 1,
            "created_utc": 1594784110.0,
            "replies": []
        },
        {
            "body": "Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\nHe also changed Edo Tensei. In Naruto(Hokage Battle Royale), Hashirama threw kunai at Hiruzen.\n\nBut in Shippuden, all 7 Ninja swordsmen of Mist are born without their swords.",
            "author": null,
            "id": "fxvot25",
            "parent_id": "t1_fxvlc64",
            "score": 73,
            "created_utc": 1594598552.0,
            "replies": [
                {
                    "body": "Is this from changing the jutsu or because the bodies sacrificed had kunai/didnt have the swords?\n\nBut I did hear he changed his kind about Itachi at some point to make him what he is today. Hell Itachi translates to 'weasel' in English",
                    "author": "CelticDK",
                    "id": "fxw1c5r",
                    "parent_id": "t1_fxvot25",
                    "score": 20,
                    "created_utc": 1594606244.0,
                    "replies": [
                        {
                            "body": "Edo Tensei only brings back souls of people into new sacrificial bodies. they look like what they were when they died. and they dont have any weapons they had when they died. so, when 7 swordsmen of mist are summoned from the dead, none of them have their swords. akatsuki had to collect their swords and give it to them.\nBUT, in the hokage fight, hashirama threw kunai at hiruzen. where did hashirama get kunai from, cos we didnt see orochimaru giving hashirama any weapons.\n\nso, yeah. kishimoto did change a lot of things\n\nand yes, itachi means weasel so maybe itachi was also changed. boruto means bolt and he is kinda sharp and OP, neji means screw and neji did, in the end, get screwed lol\n\nkakashi means scarecrow, and he is lazier than a scarecrow",
                            "author": null,
                            "id": "fxw4i42",
                            "parent_id": "t1_fxw1c5r",
                            "score": 7,
                            "created_utc": 1594608243.0,
                            "replies": [
                                {
                                    "body": "When the Hokage were brought back, they had their tool pouches like when they were alive though. And honestly, even without debating the edo tensei, homage level shinobi probably just summon the damn things somehow. Like an advanced way of what Sasuke did vs Itachi and his wrist seals.\n\nI think we've even seen Hiruzen just summon some big ass shuriken too",
                                    "author": "CelticDK",
                                    "id": "fxw4vk6",
                                    "parent_id": "t1_fxw4i42",
                                    "score": 11,
                                    "created_utc": 1594608482.0,
                                    "replies": [
                                        {
                                            "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
                                            "author": null,
                                            "id": "fxw60wa",
                                            "parent_id": "t1_fxw4vk6",
                                            "score": 5,
                                            "created_utc": 1594609233.0,
                                            "replies": [
                                                {
                                                    "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                                                    "author": "CelticDK",
                                                    "id": "fxw959o",
                                                    "parent_id": "t1_fxw60wa",
                                                    "score": 3,
                                                    "created_utc": 1594611311.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                                                    "author": "SomeSaltyDude",
                                                    "id": "fxwoj15",
                                                    "parent_id": "t1_fxw60wa",
                                                    "score": 3,
                                                    "created_utc": 1594623700.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "The 7 ninja did summon their weapons though",
                                                    "author": "TheCaptainIRL",
                                                    "id": "fxx9mav",
                                                    "parent_id": "t1_fxw60wa",
                                                    "score": 1,
                                                    "created_utc": 1594643969.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nope, the swords were collected for them.",
                                                            "author": null,
                                                            "id": "fxxfcug",
                                                            "parent_id": "t1_fxx9mav",
                                                            "score": 2,
                                                            "created_utc": 1594647731.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                                                    "author": "TheCaptainIRL",
                                                                    "id": "fy0btc3",
                                                                    "parent_id": "t1_fxxfcug",
                                                                    "score": 1,
                                                                    "created_utc": 1594704087.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
                                            "author": "notanarutofan",
                                            "id": "fy51nta",
                                            "parent_id": "t1_fxw4vk6",
                                            "score": 1,
                                            "created_utc": 1594818026.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\n\"He was out of chakra, bruh\"\n\n - Kishimoto probably",
                    "author": null,
                    "id": "fxwyrnc",
                    "parent_id": "t1_fxvot25",
                    "score": 4,
                    "created_utc": 1594634130.0,
                    "replies": []
                },
                {
                    "body": "I feel like the reanimating thing can be attributed to the fact that the swords are owned by people alive not just generic weapons that every ninja owns",
                    "author": "NoisyTornado",
                    "id": "fxwpqk1",
                    "parent_id": "t1_fxvot25",
                    "score": 3,
                    "created_utc": 1594624855.0,
                    "replies": []
                },
                {
                    "body": "Substitution Jutsu was basically a get out of character death free card from the getgo",
                    "author": "RollerCoasterBacon",
                    "id": "fxx1bv2",
                    "parent_id": "t1_fxvot25",
                    "score": 1,
                    "created_utc": 1594636800.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've always sworn up and down that Itachi's entire arc and motivations were added afterwards.  It's *conceivable* that Itachi was actually a mastermind good guy all along and was working against hidden evils in the village, but idk man, he's pretty much a pure villain up to Shippuden.  He tortures both Kakashi and Sasuke over and over and over for really no reason.\n\nI think the original plan for Itachi was keeping Sasuke alive to take his eyes.  Stealing eyes was obviously planned early on because of Kakashi.  However, I think the idea of humanizing an antagonist and giving new meaning to earlier parts in the series ended up being seen as a more interesting plot point (IMO it absolutely is) and the Eye-theft was pushed to another antagonist (who wasn't planned from the start).\n\nJust pure speculation on my part, but it's the main reason I roll my eyes when people want to rewatch original Naruto to see good guy Itachi with a new meaning behind him.  Like, eh, he's still a really bad guy at that point.",
            "author": "Packrat1010",
            "id": "fxxk20g",
            "parent_id": "t1_fxvlc64",
            "score": 2,
            "created_utc": 1594650442.0,
            "replies": [
                {
                    "body": "I agree, and Danzo is a way better antagonist than Itachi. I fucking hate that guy.\n\nAnd Kisame DID say when he and Itachi came to Konoha in the original that Itachi wasn’t at his full strength (implying the sickness he died from) so possibly you could infer he tortured Kakashi and Sasuke to keep up the big bad boy facade and to encourage Sasuke to figure out how to take him in and defeat him? And also, he did have to make it super believable, because if Sasuke had any reservations about killing Itachi, Itachi wouldn’t have been able to extract Orochimaru from him.",
                    "author": "notanarutofan",
                    "id": "fy5246p",
                    "parent_id": "t1_fxxk20g",
                    "score": 3,
                    "created_utc": 1594818317.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Easier than actually fighting Kakashi. He could have made it weeks if he wanted to. Three days is enough to wear him out",
            "author": "iNonEntity",
            "id": "fxw0mru",
            "parent_id": "t1_fxvynb5",
            "score": 7,
            "created_utc": 1594605804.0,
            "replies": []
        },
        {
            "body": "My ma’an\nItachi putted the Tsukyomi in Sasuke when he was 5 fucking years old,when he awakened the sharingan,sasuke was just another normal child who one say saw his entire clan be massacrated over and over again when he was a dumb kid\nNot the Chidori Sasuke from chunin arc",
            "author": "PlsDontBotherMeHere",
            "id": "fxvtqk9",
            "parent_id": "t1_fxvte2e",
            "score": 28,
            "created_utc": 1594601574.0,
            "replies": [
                {
                    "body": "Oh, shit, forgot about that. I think it's a similar explanation though. Regular trauma, even as fucked up as having both of your parents killed by your brother, isn't necessarily going to set you on a path of revenge. I think the tsukuyomi was insurance. Itachi probably wanted to directly connect to Sasuke's brain and shape it in the way he thought he needed to, leaving no doubt that Sasuke would go down the path he did. Very fucked up situation but the fact that Itachi suffered immensely from having to do all of this is canon.",
                    "author": "DizKord",
                    "id": "fxvuyxf",
                    "parent_id": "t1_fxvtqk9",
                    "score": 7,
                    "created_utc": 1594602329.0,
                    "replies": [
                        {
                            "body": "Yeah this is possible\nAnd maybe when he put the tsukyomi he implanted the amaterasu as well",
                            "author": "PlsDontBotherMeHere",
                            "id": "fxvv308",
                            "parent_id": "t1_fxvuyxf",
                            "score": 3,
                            "created_utc": 1594602398.0,
                            "replies": []
                        },
                        {
                            "body": "Also, did Sasuke awaken the sharingan before or after being put under Tsukyomi? I can’t remember, honestly.",
                            "author": "notanarutofan",
                            "id": "fy52dy2",
                            "parent_id": "t1_fxvuyxf",
                            "score": 1,
                            "created_utc": 1594818490.0,
                            "replies": [
                                {
                                    "body": "After the tsukyiomi,probably another explanation",
                                    "author": "PlsDontBotherMeHere",
                                    "id": "fy80lzy",
                                    "parent_id": "t1_fy52dy2",
                                    "score": 2,
                                    "created_utc": 1594874427.0,
                                    "replies": [
                                        {
                                            "body": "That’s what I was thinking",
                                            "author": "notanarutofan",
                                            "id": "fy878s2",
                                            "parent_id": "t1_fy80lzy",
                                            "score": 1,
                                            "created_utc": 1594879725.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My dude did you read the comments section in this Debate or are  you just an Itachi Fan Boy,because half of Naruto fandom is of your type of people",
            "author": "PlsDontBotherMeHere",
            "id": "fy80hkl",
            "parent_id": "t1_fxwjaml",
            "score": 1,
            "created_utc": 1594874339.0,
            "replies": [
                {
                    "body": "Yes. I'm an Itachi fan boy. What's the other half can you tell me?",
                    "author": "Pizzatime2610",
                    "id": "fy82gfq",
                    "parent_id": "t1_fy80hkl",
                    "score": 2,
                    "created_utc": 1594875770.0,
                    "replies": [
                        {
                            "body": "Other Fanboys of Sasuke Naruto and the rest",
                            "author": "PlsDontBotherMeHere",
                            "id": "fy8iv1w",
                            "parent_id": "t1_fy82gfq",
                            "score": 1,
                            "created_utc": 1594890956.0,
                            "replies": [
                                {
                                    "body": "Are you a fanboy?",
                                    "author": "Pizzatime2610",
                                    "id": "fy9tqe8",
                                    "parent_id": "t1_fy8iv1w",
                                    "score": 1,
                                    "created_utc": 1594920596.0,
                                    "replies": [
                                        {
                                            "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
                                            "author": "PlsDontBotherMeHere",
                                            "id": "fyb5tzs",
                                            "parent_id": "t1_fy9tqe8",
                                            "score": 1,
                                            "created_utc": 1594944833.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Itachi did not turned himself down so after he killed his entire clan and became a nukenin, he could be a spy in akatsuki so he could pass important information to konoha",
            "author": "PlsDontBotherMeHere",
            "id": "g05wgdn",
            "parent_id": "t1_fzj18nw",
            "score": 1,
            "created_utc": 1596418061.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fxwfpqi",
            "parent_id": "t1_fxwch7e",
            "score": 1,
            "created_utc": 1594616054.0,
            "replies": [
                {
                    "body": "Oh itachi, because you wrote Kakashi in your comment.",
                    "author": null,
                    "id": "fxwg0lv",
                    "parent_id": "t1_fxwfpqi",
                    "score": 1,
                    "created_utc": 1594616293.0,
                    "replies": [
                        {
                            "body": "Yeah I’m just an idiot it was late, I meant Itachi",
                            "author": "PixelSushii",
                            "id": "fxwoe5r",
                            "parent_id": "t1_fxwg0lv",
                            "score": 2,
                            "created_utc": 1594623576.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn't worry about that tbh. Honestly that seems like more of a vocal minority of fans who actually genuinely care if you like Itachi or not. He's one of the most popular Naruto characters for a reason. I think most people like Itachi.",
            "author": "silverx2000",
            "id": "fxwvl0m",
            "parent_id": "t1_fxwp7s4",
            "score": 3,
            "created_utc": 1594630801.0,
            "replies": []
        },
        {
            "body": "Damn even the babies were in the plan?",
            "author": null,
            "id": "fxwcfm3",
            "parent_id": "t1_fxw2bi4",
            "score": 9,
            "created_utc": 1594613608.0,
            "replies": [
                {
                    "body": "Hell yeah! Babies are evil.\n\nWere there any babies at that time?",
                    "author": "CelticDK",
                    "id": "fxwcu3o",
                    "parent_id": "t1_fxwcfm3",
                    "score": 3,
                    "created_utc": 1594613897.0,
                    "replies": [
                        {
                            "body": "A clan with hundred of people not making a child in 8 years, what kind of plot hole would that be lol.",
                            "author": null,
                            "id": "fxwd87i",
                            "parent_id": "t1_fxwcu3o",
                            "score": 7,
                            "created_utc": 1594614176.0,
                            "replies": [
                                {
                                    "body": "Still didnt answer my question. And your definition of 'baby' being under 8 years is a bit strange. \n\nWhy did Danzou specifically offer to save Sasuke for Itachi and not those other kids possibly younger than him too if they existed?\n\nPs. Even if there were kids younger that had to die too, they're in a ninja world where killing is alright and doing whatever you had to do was simply that. My point was Itachi didn't want to kill a single member of his clan, and had to kill them all for the sake of the village (and the world).",
                                    "author": "CelticDK",
                                    "id": "fxwe387",
                                    "parent_id": "t1_fxwd87i",
                                    "score": 1,
                                    "created_utc": 1594614811.0,
                                    "replies": [
                                        {
                                            "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
                                            "author": null,
                                            "id": "fxwerfb",
                                            "parent_id": "t1_fxwe387",
                                            "score": 2,
                                            "created_utc": 1594615315.0,
                                            "replies": [
                                                {
                                                    "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                                                    "author": "CelticDK",
                                                    "id": "fxwflf6",
                                                    "parent_id": "t1_fxwerfb",
                                                    "score": 0,
                                                    "created_utc": 1594615961.0,
                                                    "replies": [
                                                        {
                                                            "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                                                            "author": null,
                                                            "id": "fxwgnkx",
                                                            "parent_id": "t1_fxwflf6",
                                                            "score": 1,
                                                            "created_utc": 1594616807.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not to jump too far into ethics, but most people agree that killing in self defense isn't nearly as abhorrent as genocide.  You might be able to say that Itachi committed genocide for the greater good, but... I mean, genocide is still genocide.",
            "author": "Packrat1010",
            "id": "fxxllrh",
            "parent_id": "t1_fxw2bi4",
            "score": 0,
            "created_utc": 1594651294.0,
            "replies": []
        },
        {
            "body": "90% of the stuff he did was for the greater good. He had absolutely no need to force sasuke to watch his parents die over and over. It wasn’t necessary",
            "author": "PixelSushii",
            "id": "fxw0suh",
            "parent_id": "t1_fxvz54u",
            "score": 24,
            "created_utc": 1594605912.0,
            "replies": [
                {
                    "body": "Killing young children and regular citizens wasnt for the greater good",
                    "author": "crazyfrecs",
                    "id": "fxwyy9s",
                    "parent_id": "t1_fxw0suh",
                    "score": 3,
                    "created_utc": 1594634325.0,
                    "replies": []
                },
                {
                    "body": "I'd say it was necessary, sasuke had many flashbacks to this which showed it had a big impact. Without it he may not have had enough hatred to chase revenge all the way through. Itachi wasnt going to risk something like that, he needed to make sure his plan succeeded",
                    "author": null,
                    "id": "fxw135i",
                    "parent_id": "t1_fxw0suh",
                    "score": 0,
                    "created_utc": 1594606090.0,
                    "replies": [
                        {
                            "body": "Forcing sasuke to exact revenge for the uchiha clan wasn’t necessary either, it was selfish because he wanted somebody to hold him accountable for what he did. His entire plan for sasuke was born out of selfishness. Sasuke, a child, is now more than likely scarred for eternity, probably still has nightmares about the whole thing in his late 20’s/ early 30’s.",
                            "author": "PixelSushii",
                            "id": "fxw1dah",
                            "parent_id": "t1_fxw135i",
                            "score": 12,
                            "created_utc": 1594606263.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Literally in his last conversation with Sasuke after defeating Kabuto he says that killing his clan probably wasn’t necessary if he had just trusted his clan members and Sasuke enough to speak with them honestly, because he tried to solve the problem himself (and due to pressure from Danzo who doesn’t trust anybody) he was led down the dark path that we see. The entire theme of Naruto is about trusting your friends and the people around you",
            "author": "Anything_Random",
            "id": "fxwwx6k",
            "parent_id": "t1_fxwjgv9",
            "score": 3,
            "created_utc": 1594632197.0,
            "replies": [
                {
                    "body": "I think we’re forgetting about the fact that he was 13 when he committed the genocide. And if any of y’all said you knew how to properly deal with problems and couldn’t be manipulated by authorities at the age of 12, you’re lying.",
                    "author": "notanarutofan",
                    "id": "fy532j8",
                    "parent_id": "t1_fxwwx6k",
                    "score": 2,
                    "created_utc": 1594818916.0,
                    "replies": []
                },
                {
                    "body": "He did the right thing. The Uchiha's were very powerful.",
                    "author": "Pizzatime2610",
                    "id": "fxwx1ax",
                    "parent_id": "t1_fxwwx6k",
                    "score": 1,
                    "created_utc": 1594632317.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sasuke had already witnessed the horrors of the shinobi world when his entire clan was kill. Itachi made him relive it for 72 hours which way overkill",
            "author": "sielnt_assassin",
            "id": "fxwjtd1",
            "parent_id": "t1_fxwj467",
            "score": 6,
            "created_utc": 1594619418.0,
            "replies": [
                {
                    "body": "That was for his hatred.",
                    "author": "Pizzatime2610",
                    "id": "fxx22gc",
                    "parent_id": "t1_fxwjtd1",
                    "score": 1,
                    "created_utc": 1594637548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t know where you got that I feel above the fandom but aight. If the shoe fits I guess, you’re free to like him idc. I was saying people try to excuse his actions because they find him cool.",
            "author": "klowndykebar",
            "id": "fxwyi1d",
            "parent_id": "t1_fxwxjwa",
            "score": 2,
            "created_utc": 1594633848.0,
            "replies": []
        },
        {
            "body": "They said hes not the best and that's it lmao now I'm getting downvoted",
            "author": "rusty-toast",
            "id": "fxvnh99",
            "parent_id": "t1_fxvlzbm",
            "score": 7,
            "created_utc": 1594597748.0,
            "replies": [
                {
                    "body": "Oh that’s an oof",
                    "author": "Peng1GT",
                    "id": "fxvnjry",
                    "parent_id": "t1_fxvnh99",
                    "score": 5,
                    "created_utc": 1594597789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What he did wasn’t justified or ethical to me",
            "author": "MarcelSSJ4",
            "id": "fxvwjqz",
            "parent_id": "t1_fxvwg54",
            "score": 14,
            "created_utc": 1594603298.0,
            "replies": [
                {
                    "body": "It was an order from the black ops, if he didn’t follow orders they would’ve killed them either way but itachi was able to save his brother at least if he did it himself, he loved the rest of the village too much to let war take place\n\nBut I see where you’re coming from",
                    "author": "MIKEY_VEE123youandME",
                    "id": "fxvxb70",
                    "parent_id": "t1_fxvwjqz",
                    "score": -2,
                    "created_utc": 1594603763.0,
                    "replies": [
                        {
                            "body": "Or proceed with the coup.",
                            "author": null,
                            "id": "fxwcqlt",
                            "parent_id": "t1_fxvxb70",
                            "score": 5,
                            "created_utc": 1594613824.0,
                            "replies": [
                                {
                                    "body": "Exactly, coup=war (basically)",
                                    "author": "MIKEY_VEE123youandME",
                                    "id": "fxwlm3w",
                                    "parent_id": "t1_fxwcqlt",
                                    "score": 2,
                                    "created_utc": 1594621014.0,
                                    "replies": [
                                        {
                                            "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
                                            "author": null,
                                            "id": "fxwo55l",
                                            "parent_id": "t1_fxwlm3w",
                                            "score": 0,
                                            "created_utc": 1594623345.0,
                                            "replies": [
                                                {
                                                    "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                                                    "author": "MIKEY_VEE123youandME",
                                                    "id": "fxwokra",
                                                    "parent_id": "t1_fxwo55l",
                                                    "score": 1,
                                                    "created_utc": 1594623744.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                                                            "author": null,
                                                            "id": "fxwp1kd",
                                                            "parent_id": "t1_fxwokra",
                                                            "score": 0,
                                                            "created_utc": 1594624183.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                                                    "author": "MIKEY_VEE123youandME",
                                                                    "id": "fxwqi06",
                                                                    "parent_id": "t1_fxwp1kd",
                                                                    "score": 1,
                                                                    "created_utc": 1594625604.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                                                            "author": null,
                                                                            "id": "fxwsw2j",
                                                                            "parent_id": "t1_fxwqi06",
                                                                            "score": 1,
                                                                            "created_utc": 1594628037.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                                                    "author": "MIKEY_VEE123youandME",
                                                                                    "id": "fxwu2gt",
                                                                                    "parent_id": "t1_fxwsw2j",
                                                                                    "score": 1,
                                                                                    "created_utc": 1594629253.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No I finished naruto, I mean i dont get the context of the meme like why Is the astronaut holding the gun.",
            "author": "b3astM0de3",
            "id": "fxyv1oz",
            "parent_id": "t1_fxyolup",
            "score": 2,
            "created_utc": 1594673386.0,
            "replies": [
                {
                    "body": "It's a meme template, I don't know where it's from though",
                    "author": null,
                    "id": "fy1iqqz",
                    "parent_id": "t1_fxyv1oz",
                    "score": 2,
                    "created_utc": 1594738796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right. \n\nIt's because the character was so badly written that I didn't like him.",
            "author": "SuperFartmeister",
            "id": "fy092fi",
            "parent_id": "t1_fxyofim",
            "score": 1,
            "created_utc": 1594701946.0,
            "replies": [
                {
                    "body": "Uhh, about your comment, what did he do that was unnecessary other than torturing Sasuke?",
                    "author": null,
                    "id": "fy1iwlv",
                    "parent_id": "t1_fy092fi",
                    "score": 2,
                    "created_utc": 1594738877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have, and Itachi would absolutely smoke someone if he thought they would tell Sasuke he was acting on orders.",
            "author": "just-_-",
            "id": "fxv92ny",
            "parent_id": "t1_fxv7mmm",
            "score": 0,
            "created_utc": 1594589593.0,
            "replies": [
                {
                    "body": "But that never happens, because Itachi is too elite to be the one to expose the Uchiha’s secrets. If it wasn’t for Kamui, Itachi would have taken out Obito, the only other person who knew the truth along with himself.",
                    "author": "Snxdgrass",
                    "id": "fxvabob",
                    "parent_id": "t1_fxv92ny",
                    "score": 6,
                    "created_utc": 1594590269.0,
                    "replies": [
                        {
                            "body": "Big sike, i watched the episode recently and the amaterasu touched Obito on his zetsu side. So he didn't need kamui.",
                            "author": null,
                            "id": "fxwcvqr",
                            "parent_id": "t1_fxvabob",
                            "score": 1,
                            "created_utc": 1594613930.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Right, which is why not many people knew and the people who did know knew not to let that shit out. That doesn’t make him a bad person.",
                    "author": "notanarutofan",
                    "id": "fxvadnm",
                    "parent_id": "t1_fxv92ny",
                    "score": 1,
                    "created_utc": 1594590299.0,
                    "replies": [
                        {
                            "body": "all the child murder is what makes him a bad person",
                            "author": "just-_-",
                            "id": "fy3xqr6",
                            "parent_id": "t1_fxvadnm",
                            "score": 0,
                            "created_utc": 1594784028.0,
                            "replies": [
                                {
                                    "body": "Sorry kid, but the world isn’t black and white. Sometimes people have to do bad things to prevent worse things from happening. Itachi was the only person who was willing to put his emotions and love for his clan aside and complete a mission for the betterment of the village. If you want to be mad at someone, be mad at Danzo, because had he not stolen Shisui’s eye, they could have taken care of it with nonviolent means. Itachi’s dad was even like “I understand why you have to do this”",
                                    "author": "notanarutofan",
                                    "id": "fy5100e",
                                    "parent_id": "t1_fy3xqr6",
                                    "score": 2,
                                    "created_utc": 1594817601.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is this from changing the jutsu or because the bodies sacrificed had kunai/didnt have the swords?\n\nBut I did hear he changed his kind about Itachi at some point to make him what he is today. Hell Itachi translates to 'weasel' in English",
            "author": "CelticDK",
            "id": "fxw1c5r",
            "parent_id": "t1_fxvot25",
            "score": 20,
            "created_utc": 1594606244.0,
            "replies": [
                {
                    "body": "Edo Tensei only brings back souls of people into new sacrificial bodies. they look like what they were when they died. and they dont have any weapons they had when they died. so, when 7 swordsmen of mist are summoned from the dead, none of them have their swords. akatsuki had to collect their swords and give it to them.\nBUT, in the hokage fight, hashirama threw kunai at hiruzen. where did hashirama get kunai from, cos we didnt see orochimaru giving hashirama any weapons.\n\nso, yeah. kishimoto did change a lot of things\n\nand yes, itachi means weasel so maybe itachi was also changed. boruto means bolt and he is kinda sharp and OP, neji means screw and neji did, in the end, get screwed lol\n\nkakashi means scarecrow, and he is lazier than a scarecrow",
                    "author": null,
                    "id": "fxw4i42",
                    "parent_id": "t1_fxw1c5r",
                    "score": 7,
                    "created_utc": 1594608243.0,
                    "replies": [
                        {
                            "body": "When the Hokage were brought back, they had their tool pouches like when they were alive though. And honestly, even without debating the edo tensei, homage level shinobi probably just summon the damn things somehow. Like an advanced way of what Sasuke did vs Itachi and his wrist seals.\n\nI think we've even seen Hiruzen just summon some big ass shuriken too",
                            "author": "CelticDK",
                            "id": "fxw4vk6",
                            "parent_id": "t1_fxw4i42",
                            "score": 11,
                            "created_utc": 1594608482.0,
                            "replies": [
                                {
                                    "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
                                    "author": null,
                                    "id": "fxw60wa",
                                    "parent_id": "t1_fxw4vk6",
                                    "score": 5,
                                    "created_utc": 1594609233.0,
                                    "replies": [
                                        {
                                            "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                                            "author": "CelticDK",
                                            "id": "fxw959o",
                                            "parent_id": "t1_fxw60wa",
                                            "score": 3,
                                            "created_utc": 1594611311.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                                            "author": "SomeSaltyDude",
                                            "id": "fxwoj15",
                                            "parent_id": "t1_fxw60wa",
                                            "score": 3,
                                            "created_utc": 1594623700.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The 7 ninja did summon their weapons though",
                                            "author": "TheCaptainIRL",
                                            "id": "fxx9mav",
                                            "parent_id": "t1_fxw60wa",
                                            "score": 1,
                                            "created_utc": 1594643969.0,
                                            "replies": [
                                                {
                                                    "body": "Nope, the swords were collected for them.",
                                                    "author": null,
                                                    "id": "fxxfcug",
                                                    "parent_id": "t1_fxx9mav",
                                                    "score": 2,
                                                    "created_utc": 1594647731.0,
                                                    "replies": [
                                                        {
                                                            "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                                            "author": "TheCaptainIRL",
                                                            "id": "fy0btc3",
                                                            "parent_id": "t1_fxxfcug",
                                                            "score": 1,
                                                            "created_utc": 1594704087.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
                                    "author": "notanarutofan",
                                    "id": "fy51nta",
                                    "parent_id": "t1_fxw4vk6",
                                    "score": 1,
                                    "created_utc": 1594818026.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Yeah, Kishimoto has changed a lot of things. Like Substitution Jutsu was removed from Shippuden cos they had to kill Neji somehow. \n\n\"He was out of chakra, bruh\"\n\n - Kishimoto probably",
            "author": null,
            "id": "fxwyrnc",
            "parent_id": "t1_fxvot25",
            "score": 4,
            "created_utc": 1594634130.0,
            "replies": []
        },
        {
            "body": "I feel like the reanimating thing can be attributed to the fact that the swords are owned by people alive not just generic weapons that every ninja owns",
            "author": "NoisyTornado",
            "id": "fxwpqk1",
            "parent_id": "t1_fxvot25",
            "score": 3,
            "created_utc": 1594624855.0,
            "replies": []
        },
        {
            "body": "Substitution Jutsu was basically a get out of character death free card from the getgo",
            "author": "RollerCoasterBacon",
            "id": "fxx1bv2",
            "parent_id": "t1_fxvot25",
            "score": 1,
            "created_utc": 1594636800.0,
            "replies": []
        },
        {
            "body": "I agree, and Danzo is a way better antagonist than Itachi. I fucking hate that guy.\n\nAnd Kisame DID say when he and Itachi came to Konoha in the original that Itachi wasn’t at his full strength (implying the sickness he died from) so possibly you could infer he tortured Kakashi and Sasuke to keep up the big bad boy facade and to encourage Sasuke to figure out how to take him in and defeat him? And also, he did have to make it super believable, because if Sasuke had any reservations about killing Itachi, Itachi wouldn’t have been able to extract Orochimaru from him.",
            "author": "notanarutofan",
            "id": "fy5246p",
            "parent_id": "t1_fxxk20g",
            "score": 3,
            "created_utc": 1594818317.0,
            "replies": []
        },
        {
            "body": "Oh, shit, forgot about that. I think it's a similar explanation though. Regular trauma, even as fucked up as having both of your parents killed by your brother, isn't necessarily going to set you on a path of revenge. I think the tsukuyomi was insurance. Itachi probably wanted to directly connect to Sasuke's brain and shape it in the way he thought he needed to, leaving no doubt that Sasuke would go down the path he did. Very fucked up situation but the fact that Itachi suffered immensely from having to do all of this is canon.",
            "author": "DizKord",
            "id": "fxvuyxf",
            "parent_id": "t1_fxvtqk9",
            "score": 7,
            "created_utc": 1594602329.0,
            "replies": [
                {
                    "body": "Yeah this is possible\nAnd maybe when he put the tsukyomi he implanted the amaterasu as well",
                    "author": "PlsDontBotherMeHere",
                    "id": "fxvv308",
                    "parent_id": "t1_fxvuyxf",
                    "score": 3,
                    "created_utc": 1594602398.0,
                    "replies": []
                },
                {
                    "body": "Also, did Sasuke awaken the sharingan before or after being put under Tsukyomi? I can’t remember, honestly.",
                    "author": "notanarutofan",
                    "id": "fy52dy2",
                    "parent_id": "t1_fxvuyxf",
                    "score": 1,
                    "created_utc": 1594818490.0,
                    "replies": [
                        {
                            "body": "After the tsukyiomi,probably another explanation",
                            "author": "PlsDontBotherMeHere",
                            "id": "fy80lzy",
                            "parent_id": "t1_fy52dy2",
                            "score": 2,
                            "created_utc": 1594874427.0,
                            "replies": [
                                {
                                    "body": "That’s what I was thinking",
                                    "author": "notanarutofan",
                                    "id": "fy878s2",
                                    "parent_id": "t1_fy80lzy",
                                    "score": 1,
                                    "created_utc": 1594879725.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. I'm an Itachi fan boy. What's the other half can you tell me?",
            "author": "Pizzatime2610",
            "id": "fy82gfq",
            "parent_id": "t1_fy80hkl",
            "score": 2,
            "created_utc": 1594875770.0,
            "replies": [
                {
                    "body": "Other Fanboys of Sasuke Naruto and the rest",
                    "author": "PlsDontBotherMeHere",
                    "id": "fy8iv1w",
                    "parent_id": "t1_fy82gfq",
                    "score": 1,
                    "created_utc": 1594890956.0,
                    "replies": [
                        {
                            "body": "Are you a fanboy?",
                            "author": "Pizzatime2610",
                            "id": "fy9tqe8",
                            "parent_id": "t1_fy8iv1w",
                            "score": 1,
                            "created_utc": 1594920596.0,
                            "replies": [
                                {
                                    "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
                                    "author": "PlsDontBotherMeHere",
                                    "id": "fyb5tzs",
                                    "parent_id": "t1_fy9tqe8",
                                    "score": 1,
                                    "created_utc": 1594944833.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh itachi, because you wrote Kakashi in your comment.",
            "author": null,
            "id": "fxwg0lv",
            "parent_id": "t1_fxwfpqi",
            "score": 1,
            "created_utc": 1594616293.0,
            "replies": [
                {
                    "body": "Yeah I’m just an idiot it was late, I meant Itachi",
                    "author": "PixelSushii",
                    "id": "fxwoe5r",
                    "parent_id": "t1_fxwg0lv",
                    "score": 2,
                    "created_utc": 1594623576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hell yeah! Babies are evil.\n\nWere there any babies at that time?",
            "author": "CelticDK",
            "id": "fxwcu3o",
            "parent_id": "t1_fxwcfm3",
            "score": 3,
            "created_utc": 1594613897.0,
            "replies": [
                {
                    "body": "A clan with hundred of people not making a child in 8 years, what kind of plot hole would that be lol.",
                    "author": null,
                    "id": "fxwd87i",
                    "parent_id": "t1_fxwcu3o",
                    "score": 7,
                    "created_utc": 1594614176.0,
                    "replies": [
                        {
                            "body": "Still didnt answer my question. And your definition of 'baby' being under 8 years is a bit strange. \n\nWhy did Danzou specifically offer to save Sasuke for Itachi and not those other kids possibly younger than him too if they existed?\n\nPs. Even if there were kids younger that had to die too, they're in a ninja world where killing is alright and doing whatever you had to do was simply that. My point was Itachi didn't want to kill a single member of his clan, and had to kill them all for the sake of the village (and the world).",
                            "author": "CelticDK",
                            "id": "fxwe387",
                            "parent_id": "t1_fxwd87i",
                            "score": 1,
                            "created_utc": 1594614811.0,
                            "replies": [
                                {
                                    "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
                                    "author": null,
                                    "id": "fxwerfb",
                                    "parent_id": "t1_fxwe387",
                                    "score": 2,
                                    "created_utc": 1594615315.0,
                                    "replies": [
                                        {
                                            "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                                            "author": "CelticDK",
                                            "id": "fxwflf6",
                                            "parent_id": "t1_fxwerfb",
                                            "score": 0,
                                            "created_utc": 1594615961.0,
                                            "replies": [
                                                {
                                                    "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                                                    "author": null,
                                                    "id": "fxwgnkx",
                                                    "parent_id": "t1_fxwflf6",
                                                    "score": 1,
                                                    "created_utc": 1594616807.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Killing young children and regular citizens wasnt for the greater good",
            "author": "crazyfrecs",
            "id": "fxwyy9s",
            "parent_id": "t1_fxw0suh",
            "score": 3,
            "created_utc": 1594634325.0,
            "replies": []
        },
        {
            "body": "I'd say it was necessary, sasuke had many flashbacks to this which showed it had a big impact. Without it he may not have had enough hatred to chase revenge all the way through. Itachi wasnt going to risk something like that, he needed to make sure his plan succeeded",
            "author": null,
            "id": "fxw135i",
            "parent_id": "t1_fxw0suh",
            "score": 0,
            "created_utc": 1594606090.0,
            "replies": [
                {
                    "body": "Forcing sasuke to exact revenge for the uchiha clan wasn’t necessary either, it was selfish because he wanted somebody to hold him accountable for what he did. His entire plan for sasuke was born out of selfishness. Sasuke, a child, is now more than likely scarred for eternity, probably still has nightmares about the whole thing in his late 20’s/ early 30’s.",
                    "author": "PixelSushii",
                    "id": "fxw1dah",
                    "parent_id": "t1_fxw135i",
                    "score": 12,
                    "created_utc": 1594606263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think we’re forgetting about the fact that he was 13 when he committed the genocide. And if any of y’all said you knew how to properly deal with problems and couldn’t be manipulated by authorities at the age of 12, you’re lying.",
            "author": "notanarutofan",
            "id": "fy532j8",
            "parent_id": "t1_fxwwx6k",
            "score": 2,
            "created_utc": 1594818916.0,
            "replies": []
        },
        {
            "body": "He did the right thing. The Uchiha's were very powerful.",
            "author": "Pizzatime2610",
            "id": "fxwx1ax",
            "parent_id": "t1_fxwwx6k",
            "score": 1,
            "created_utc": 1594632317.0,
            "replies": []
        },
        {
            "body": "That was for his hatred.",
            "author": "Pizzatime2610",
            "id": "fxx22gc",
            "parent_id": "t1_fxwjtd1",
            "score": 1,
            "created_utc": 1594637548.0,
            "replies": []
        },
        {
            "body": "Oh that’s an oof",
            "author": "Peng1GT",
            "id": "fxvnjry",
            "parent_id": "t1_fxvnh99",
            "score": 5,
            "created_utc": 1594597789.0,
            "replies": []
        },
        {
            "body": "It was an order from the black ops, if he didn’t follow orders they would’ve killed them either way but itachi was able to save his brother at least if he did it himself, he loved the rest of the village too much to let war take place\n\nBut I see where you’re coming from",
            "author": "MIKEY_VEE123youandME",
            "id": "fxvxb70",
            "parent_id": "t1_fxvwjqz",
            "score": -2,
            "created_utc": 1594603763.0,
            "replies": [
                {
                    "body": "Or proceed with the coup.",
                    "author": null,
                    "id": "fxwcqlt",
                    "parent_id": "t1_fxvxb70",
                    "score": 5,
                    "created_utc": 1594613824.0,
                    "replies": [
                        {
                            "body": "Exactly, coup=war (basically)",
                            "author": "MIKEY_VEE123youandME",
                            "id": "fxwlm3w",
                            "parent_id": "t1_fxwcqlt",
                            "score": 2,
                            "created_utc": 1594621014.0,
                            "replies": [
                                {
                                    "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
                                    "author": null,
                                    "id": "fxwo55l",
                                    "parent_id": "t1_fxwlm3w",
                                    "score": 0,
                                    "created_utc": 1594623345.0,
                                    "replies": [
                                        {
                                            "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                                            "author": "MIKEY_VEE123youandME",
                                            "id": "fxwokra",
                                            "parent_id": "t1_fxwo55l",
                                            "score": 1,
                                            "created_utc": 1594623744.0,
                                            "replies": [
                                                {
                                                    "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                                                    "author": null,
                                                    "id": "fxwp1kd",
                                                    "parent_id": "t1_fxwokra",
                                                    "score": 0,
                                                    "created_utc": 1594624183.0,
                                                    "replies": [
                                                        {
                                                            "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                                            "author": "MIKEY_VEE123youandME",
                                                            "id": "fxwqi06",
                                                            "parent_id": "t1_fxwp1kd",
                                                            "score": 1,
                                                            "created_utc": 1594625604.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                                                    "author": null,
                                                                    "id": "fxwsw2j",
                                                                    "parent_id": "t1_fxwqi06",
                                                                    "score": 1,
                                                                    "created_utc": 1594628037.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                                            "author": "MIKEY_VEE123youandME",
                                                                            "id": "fxwu2gt",
                                                                            "parent_id": "t1_fxwsw2j",
                                                                            "score": 1,
                                                                            "created_utc": 1594629253.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's a meme template, I don't know where it's from though",
            "author": null,
            "id": "fy1iqqz",
            "parent_id": "t1_fxyv1oz",
            "score": 2,
            "created_utc": 1594738796.0,
            "replies": []
        },
        {
            "body": "Uhh, about your comment, what did he do that was unnecessary other than torturing Sasuke?",
            "author": null,
            "id": "fy1iwlv",
            "parent_id": "t1_fy092fi",
            "score": 2,
            "created_utc": 1594738877.0,
            "replies": []
        },
        {
            "body": "But that never happens, because Itachi is too elite to be the one to expose the Uchiha’s secrets. If it wasn’t for Kamui, Itachi would have taken out Obito, the only other person who knew the truth along with himself.",
            "author": "Snxdgrass",
            "id": "fxvabob",
            "parent_id": "t1_fxv92ny",
            "score": 6,
            "created_utc": 1594590269.0,
            "replies": [
                {
                    "body": "Big sike, i watched the episode recently and the amaterasu touched Obito on his zetsu side. So he didn't need kamui.",
                    "author": null,
                    "id": "fxwcvqr",
                    "parent_id": "t1_fxvabob",
                    "score": 1,
                    "created_utc": 1594613930.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right, which is why not many people knew and the people who did know knew not to let that shit out. That doesn’t make him a bad person.",
            "author": "notanarutofan",
            "id": "fxvadnm",
            "parent_id": "t1_fxv92ny",
            "score": 1,
            "created_utc": 1594590299.0,
            "replies": [
                {
                    "body": "all the child murder is what makes him a bad person",
                    "author": "just-_-",
                    "id": "fy3xqr6",
                    "parent_id": "t1_fxvadnm",
                    "score": 0,
                    "created_utc": 1594784028.0,
                    "replies": [
                        {
                            "body": "Sorry kid, but the world isn’t black and white. Sometimes people have to do bad things to prevent worse things from happening. Itachi was the only person who was willing to put his emotions and love for his clan aside and complete a mission for the betterment of the village. If you want to be mad at someone, be mad at Danzo, because had he not stolen Shisui’s eye, they could have taken care of it with nonviolent means. Itachi’s dad was even like “I understand why you have to do this”",
                            "author": "notanarutofan",
                            "id": "fy5100e",
                            "parent_id": "t1_fy3xqr6",
                            "score": 2,
                            "created_utc": 1594817601.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Edo Tensei only brings back souls of people into new sacrificial bodies. they look like what they were when they died. and they dont have any weapons they had when they died. so, when 7 swordsmen of mist are summoned from the dead, none of them have their swords. akatsuki had to collect their swords and give it to them.\nBUT, in the hokage fight, hashirama threw kunai at hiruzen. where did hashirama get kunai from, cos we didnt see orochimaru giving hashirama any weapons.\n\nso, yeah. kishimoto did change a lot of things\n\nand yes, itachi means weasel so maybe itachi was also changed. boruto means bolt and he is kinda sharp and OP, neji means screw and neji did, in the end, get screwed lol\n\nkakashi means scarecrow, and he is lazier than a scarecrow",
            "author": null,
            "id": "fxw4i42",
            "parent_id": "t1_fxw1c5r",
            "score": 7,
            "created_utc": 1594608243.0,
            "replies": [
                {
                    "body": "When the Hokage were brought back, they had their tool pouches like when they were alive though. And honestly, even without debating the edo tensei, homage level shinobi probably just summon the damn things somehow. Like an advanced way of what Sasuke did vs Itachi and his wrist seals.\n\nI think we've even seen Hiruzen just summon some big ass shuriken too",
                    "author": "CelticDK",
                    "id": "fxw4vk6",
                    "parent_id": "t1_fxw4i42",
                    "score": 11,
                    "created_utc": 1594608482.0,
                    "replies": [
                        {
                            "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
                            "author": null,
                            "id": "fxw60wa",
                            "parent_id": "t1_fxw4vk6",
                            "score": 5,
                            "created_utc": 1594609233.0,
                            "replies": [
                                {
                                    "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                                    "author": "CelticDK",
                                    "id": "fxw959o",
                                    "parent_id": "t1_fxw60wa",
                                    "score": 3,
                                    "created_utc": 1594611311.0,
                                    "replies": []
                                },
                                {
                                    "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                                    "author": "SomeSaltyDude",
                                    "id": "fxwoj15",
                                    "parent_id": "t1_fxw60wa",
                                    "score": 3,
                                    "created_utc": 1594623700.0,
                                    "replies": []
                                },
                                {
                                    "body": "The 7 ninja did summon their weapons though",
                                    "author": "TheCaptainIRL",
                                    "id": "fxx9mav",
                                    "parent_id": "t1_fxw60wa",
                                    "score": 1,
                                    "created_utc": 1594643969.0,
                                    "replies": [
                                        {
                                            "body": "Nope, the swords were collected for them.",
                                            "author": null,
                                            "id": "fxxfcug",
                                            "parent_id": "t1_fxx9mav",
                                            "score": 2,
                                            "created_utc": 1594647731.0,
                                            "replies": [
                                                {
                                                    "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                                    "author": "TheCaptainIRL",
                                                    "id": "fy0btc3",
                                                    "parent_id": "t1_fxxfcug",
                                                    "score": 1,
                                                    "created_utc": 1594704087.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
                            "author": "notanarutofan",
                            "id": "fy51nta",
                            "parent_id": "t1_fxw4vk6",
                            "score": 1,
                            "created_utc": 1594818026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah this is possible\nAnd maybe when he put the tsukyomi he implanted the amaterasu as well",
            "author": "PlsDontBotherMeHere",
            "id": "fxvv308",
            "parent_id": "t1_fxvuyxf",
            "score": 3,
            "created_utc": 1594602398.0,
            "replies": []
        },
        {
            "body": "Also, did Sasuke awaken the sharingan before or after being put under Tsukyomi? I can’t remember, honestly.",
            "author": "notanarutofan",
            "id": "fy52dy2",
            "parent_id": "t1_fxvuyxf",
            "score": 1,
            "created_utc": 1594818490.0,
            "replies": [
                {
                    "body": "After the tsukyiomi,probably another explanation",
                    "author": "PlsDontBotherMeHere",
                    "id": "fy80lzy",
                    "parent_id": "t1_fy52dy2",
                    "score": 2,
                    "created_utc": 1594874427.0,
                    "replies": [
                        {
                            "body": "That’s what I was thinking",
                            "author": "notanarutofan",
                            "id": "fy878s2",
                            "parent_id": "t1_fy80lzy",
                            "score": 1,
                            "created_utc": 1594879725.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Other Fanboys of Sasuke Naruto and the rest",
            "author": "PlsDontBotherMeHere",
            "id": "fy8iv1w",
            "parent_id": "t1_fy82gfq",
            "score": 1,
            "created_utc": 1594890956.0,
            "replies": [
                {
                    "body": "Are you a fanboy?",
                    "author": "Pizzatime2610",
                    "id": "fy9tqe8",
                    "parent_id": "t1_fy8iv1w",
                    "score": 1,
                    "created_utc": 1594920596.0,
                    "replies": [
                        {
                            "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
                            "author": "PlsDontBotherMeHere",
                            "id": "fyb5tzs",
                            "parent_id": "t1_fy9tqe8",
                            "score": 1,
                            "created_utc": 1594944833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I’m just an idiot it was late, I meant Itachi",
            "author": "PixelSushii",
            "id": "fxwoe5r",
            "parent_id": "t1_fxwg0lv",
            "score": 2,
            "created_utc": 1594623576.0,
            "replies": []
        },
        {
            "body": "A clan with hundred of people not making a child in 8 years, what kind of plot hole would that be lol.",
            "author": null,
            "id": "fxwd87i",
            "parent_id": "t1_fxwcu3o",
            "score": 7,
            "created_utc": 1594614176.0,
            "replies": [
                {
                    "body": "Still didnt answer my question. And your definition of 'baby' being under 8 years is a bit strange. \n\nWhy did Danzou specifically offer to save Sasuke for Itachi and not those other kids possibly younger than him too if they existed?\n\nPs. Even if there were kids younger that had to die too, they're in a ninja world where killing is alright and doing whatever you had to do was simply that. My point was Itachi didn't want to kill a single member of his clan, and had to kill them all for the sake of the village (and the world).",
                    "author": "CelticDK",
                    "id": "fxwe387",
                    "parent_id": "t1_fxwd87i",
                    "score": 1,
                    "created_utc": 1594614811.0,
                    "replies": [
                        {
                            "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
                            "author": null,
                            "id": "fxwerfb",
                            "parent_id": "t1_fxwe387",
                            "score": 2,
                            "created_utc": 1594615315.0,
                            "replies": [
                                {
                                    "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                                    "author": "CelticDK",
                                    "id": "fxwflf6",
                                    "parent_id": "t1_fxwerfb",
                                    "score": 0,
                                    "created_utc": 1594615961.0,
                                    "replies": [
                                        {
                                            "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                                            "author": null,
                                            "id": "fxwgnkx",
                                            "parent_id": "t1_fxwflf6",
                                            "score": 1,
                                            "created_utc": 1594616807.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Forcing sasuke to exact revenge for the uchiha clan wasn’t necessary either, it was selfish because he wanted somebody to hold him accountable for what he did. His entire plan for sasuke was born out of selfishness. Sasuke, a child, is now more than likely scarred for eternity, probably still has nightmares about the whole thing in his late 20’s/ early 30’s.",
            "author": "PixelSushii",
            "id": "fxw1dah",
            "parent_id": "t1_fxw135i",
            "score": 12,
            "created_utc": 1594606263.0,
            "replies": []
        },
        {
            "body": "Or proceed with the coup.",
            "author": null,
            "id": "fxwcqlt",
            "parent_id": "t1_fxvxb70",
            "score": 5,
            "created_utc": 1594613824.0,
            "replies": [
                {
                    "body": "Exactly, coup=war (basically)",
                    "author": "MIKEY_VEE123youandME",
                    "id": "fxwlm3w",
                    "parent_id": "t1_fxwcqlt",
                    "score": 2,
                    "created_utc": 1594621014.0,
                    "replies": [
                        {
                            "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
                            "author": null,
                            "id": "fxwo55l",
                            "parent_id": "t1_fxwlm3w",
                            "score": 0,
                            "created_utc": 1594623345.0,
                            "replies": [
                                {
                                    "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                                    "author": "MIKEY_VEE123youandME",
                                    "id": "fxwokra",
                                    "parent_id": "t1_fxwo55l",
                                    "score": 1,
                                    "created_utc": 1594623744.0,
                                    "replies": [
                                        {
                                            "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                                            "author": null,
                                            "id": "fxwp1kd",
                                            "parent_id": "t1_fxwokra",
                                            "score": 0,
                                            "created_utc": 1594624183.0,
                                            "replies": [
                                                {
                                                    "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                                    "author": "MIKEY_VEE123youandME",
                                                    "id": "fxwqi06",
                                                    "parent_id": "t1_fxwp1kd",
                                                    "score": 1,
                                                    "created_utc": 1594625604.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                                            "author": null,
                                                            "id": "fxwsw2j",
                                                            "parent_id": "t1_fxwqi06",
                                                            "score": 1,
                                                            "created_utc": 1594628037.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                                    "author": "MIKEY_VEE123youandME",
                                                                    "id": "fxwu2gt",
                                                                    "parent_id": "t1_fxwsw2j",
                                                                    "score": 1,
                                                                    "created_utc": 1594629253.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Big sike, i watched the episode recently and the amaterasu touched Obito on his zetsu side. So he didn't need kamui.",
            "author": null,
            "id": "fxwcvqr",
            "parent_id": "t1_fxvabob",
            "score": 1,
            "created_utc": 1594613930.0,
            "replies": []
        },
        {
            "body": "all the child murder is what makes him a bad person",
            "author": "just-_-",
            "id": "fy3xqr6",
            "parent_id": "t1_fxvadnm",
            "score": 0,
            "created_utc": 1594784028.0,
            "replies": [
                {
                    "body": "Sorry kid, but the world isn’t black and white. Sometimes people have to do bad things to prevent worse things from happening. Itachi was the only person who was willing to put his emotions and love for his clan aside and complete a mission for the betterment of the village. If you want to be mad at someone, be mad at Danzo, because had he not stolen Shisui’s eye, they could have taken care of it with nonviolent means. Itachi’s dad was even like “I understand why you have to do this”",
                    "author": "notanarutofan",
                    "id": "fy5100e",
                    "parent_id": "t1_fy3xqr6",
                    "score": 2,
                    "created_utc": 1594817601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When the Hokage were brought back, they had their tool pouches like when they were alive though. And honestly, even without debating the edo tensei, homage level shinobi probably just summon the damn things somehow. Like an advanced way of what Sasuke did vs Itachi and his wrist seals.\n\nI think we've even seen Hiruzen just summon some big ass shuriken too",
            "author": "CelticDK",
            "id": "fxw4vk6",
            "parent_id": "t1_fxw4i42",
            "score": 11,
            "created_utc": 1594608482.0,
            "replies": [
                {
                    "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
                    "author": null,
                    "id": "fxw60wa",
                    "parent_id": "t1_fxw4vk6",
                    "score": 5,
                    "created_utc": 1594609233.0,
                    "replies": [
                        {
                            "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                            "author": "CelticDK",
                            "id": "fxw959o",
                            "parent_id": "t1_fxw60wa",
                            "score": 3,
                            "created_utc": 1594611311.0,
                            "replies": []
                        },
                        {
                            "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                            "author": "SomeSaltyDude",
                            "id": "fxwoj15",
                            "parent_id": "t1_fxw60wa",
                            "score": 3,
                            "created_utc": 1594623700.0,
                            "replies": []
                        },
                        {
                            "body": "The 7 ninja did summon their weapons though",
                            "author": "TheCaptainIRL",
                            "id": "fxx9mav",
                            "parent_id": "t1_fxw60wa",
                            "score": 1,
                            "created_utc": 1594643969.0,
                            "replies": [
                                {
                                    "body": "Nope, the swords were collected for them.",
                                    "author": null,
                                    "id": "fxxfcug",
                                    "parent_id": "t1_fxx9mav",
                                    "score": 2,
                                    "created_utc": 1594647731.0,
                                    "replies": [
                                        {
                                            "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                            "author": "TheCaptainIRL",
                                            "id": "fy0btc3",
                                            "parent_id": "t1_fxxfcug",
                                            "score": 1,
                                            "created_utc": 1594704087.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
                    "author": "notanarutofan",
                    "id": "fy51nta",
                    "parent_id": "t1_fxw4vk6",
                    "score": 1,
                    "created_utc": 1594818026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "After the tsukyiomi,probably another explanation",
            "author": "PlsDontBotherMeHere",
            "id": "fy80lzy",
            "parent_id": "t1_fy52dy2",
            "score": 2,
            "created_utc": 1594874427.0,
            "replies": [
                {
                    "body": "That’s what I was thinking",
                    "author": "notanarutofan",
                    "id": "fy878s2",
                    "parent_id": "t1_fy80lzy",
                    "score": 1,
                    "created_utc": 1594879725.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you a fanboy?",
            "author": "Pizzatime2610",
            "id": "fy9tqe8",
            "parent_id": "t1_fy8iv1w",
            "score": 1,
            "created_utc": 1594920596.0,
            "replies": [
                {
                    "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
                    "author": "PlsDontBotherMeHere",
                    "id": "fyb5tzs",
                    "parent_id": "t1_fy9tqe8",
                    "score": 1,
                    "created_utc": 1594944833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Still didnt answer my question. And your definition of 'baby' being under 8 years is a bit strange. \n\nWhy did Danzou specifically offer to save Sasuke for Itachi and not those other kids possibly younger than him too if they existed?\n\nPs. Even if there were kids younger that had to die too, they're in a ninja world where killing is alright and doing whatever you had to do was simply that. My point was Itachi didn't want to kill a single member of his clan, and had to kill them all for the sake of the village (and the world).",
            "author": "CelticDK",
            "id": "fxwe387",
            "parent_id": "t1_fxwd87i",
            "score": 1,
            "created_utc": 1594614811.0,
            "replies": [
                {
                    "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
                    "author": null,
                    "id": "fxwerfb",
                    "parent_id": "t1_fxwe387",
                    "score": 2,
                    "created_utc": 1594615315.0,
                    "replies": [
                        {
                            "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                            "author": "CelticDK",
                            "id": "fxwflf6",
                            "parent_id": "t1_fxwerfb",
                            "score": 0,
                            "created_utc": 1594615961.0,
                            "replies": [
                                {
                                    "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                                    "author": null,
                                    "id": "fxwgnkx",
                                    "parent_id": "t1_fxwflf6",
                                    "score": 1,
                                    "created_utc": 1594616807.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly, coup=war (basically)",
            "author": "MIKEY_VEE123youandME",
            "id": "fxwlm3w",
            "parent_id": "t1_fxwcqlt",
            "score": 2,
            "created_utc": 1594621014.0,
            "replies": [
                {
                    "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
                    "author": null,
                    "id": "fxwo55l",
                    "parent_id": "t1_fxwlm3w",
                    "score": 0,
                    "created_utc": 1594623345.0,
                    "replies": [
                        {
                            "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                            "author": "MIKEY_VEE123youandME",
                            "id": "fxwokra",
                            "parent_id": "t1_fxwo55l",
                            "score": 1,
                            "created_utc": 1594623744.0,
                            "replies": [
                                {
                                    "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                                    "author": null,
                                    "id": "fxwp1kd",
                                    "parent_id": "t1_fxwokra",
                                    "score": 0,
                                    "created_utc": 1594624183.0,
                                    "replies": [
                                        {
                                            "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                            "author": "MIKEY_VEE123youandME",
                                            "id": "fxwqi06",
                                            "parent_id": "t1_fxwp1kd",
                                            "score": 1,
                                            "created_utc": 1594625604.0,
                                            "replies": [
                                                {
                                                    "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                                    "author": null,
                                                    "id": "fxwsw2j",
                                                    "parent_id": "t1_fxwqi06",
                                                    "score": 1,
                                                    "created_utc": 1594628037.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                            "author": "MIKEY_VEE123youandME",
                                                            "id": "fxwu2gt",
                                                            "parent_id": "t1_fxwsw2j",
                                                            "score": 1,
                                                            "created_utc": 1594629253.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry kid, but the world isn’t black and white. Sometimes people have to do bad things to prevent worse things from happening. Itachi was the only person who was willing to put his emotions and love for his clan aside and complete a mission for the betterment of the village. If you want to be mad at someone, be mad at Danzo, because had he not stolen Shisui’s eye, they could have taken care of it with nonviolent means. Itachi’s dad was even like “I understand why you have to do this”",
            "author": "notanarutofan",
            "id": "fy5100e",
            "parent_id": "t1_fy3xqr6",
            "score": 2,
            "created_utc": 1594817601.0,
            "replies": []
        },
        {
            "body": "Ohh yeah, I remember. So, Edo Tensei from Kabuto cant summon their weapons, but Edo Tensei from Orochimaru \ncan suppon kunai and shuriken\n\nEdo tensei is not consistent. kishi needs to straighten this shit out lol",
            "author": null,
            "id": "fxw60wa",
            "parent_id": "t1_fxw4vk6",
            "score": 5,
            "created_utc": 1594609233.0,
            "replies": [
                {
                    "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
                    "author": "CelticDK",
                    "id": "fxw959o",
                    "parent_id": "t1_fxw60wa",
                    "score": 3,
                    "created_utc": 1594611311.0,
                    "replies": []
                },
                {
                    "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
                    "author": "SomeSaltyDude",
                    "id": "fxwoj15",
                    "parent_id": "t1_fxw60wa",
                    "score": 3,
                    "created_utc": 1594623700.0,
                    "replies": []
                },
                {
                    "body": "The 7 ninja did summon their weapons though",
                    "author": "TheCaptainIRL",
                    "id": "fxx9mav",
                    "parent_id": "t1_fxw60wa",
                    "score": 1,
                    "created_utc": 1594643969.0,
                    "replies": [
                        {
                            "body": "Nope, the swords were collected for them.",
                            "author": null,
                            "id": "fxxfcug",
                            "parent_id": "t1_fxx9mav",
                            "score": 2,
                            "created_utc": 1594647731.0,
                            "replies": [
                                {
                                    "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                                    "author": "TheCaptainIRL",
                                    "id": "fy0btc3",
                                    "parent_id": "t1_fxxfcug",
                                    "score": 1,
                                    "created_utc": 1594704087.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not only that, but Minato also had his customized flying raijin kunai when Orochimaru reanimated him",
            "author": "notanarutofan",
            "id": "fy51nta",
            "parent_id": "t1_fxw4vk6",
            "score": 1,
            "created_utc": 1594818026.0,
            "replies": []
        },
        {
            "body": "That’s what I was thinking",
            "author": "notanarutofan",
            "id": "fy878s2",
            "parent_id": "t1_fy80lzy",
            "score": 1,
            "created_utc": 1594879725.0,
            "replies": []
        },
        {
            "body": "Depends,I love Obito,but I know where he stops to be so powerfull,I really like Obito but I know that he was almost useless agaisnt Kaguya\nBut Im not like the Itachi Fanboys that invented that Kishimoto said he killed Itachi because Itachi could have killed Kaguya\nThis is SERIOUS BULLSHIT",
            "author": "PlsDontBotherMeHere",
            "id": "fyb5tzs",
            "parent_id": "t1_fy9tqe8",
            "score": 1,
            "created_utc": 1594944833.0,
            "replies": []
        },
        {
            "body": "Never said babies = 8 and under. What kind of trash straw man is that, putting words in my mouth pathetic lol. Ninja world or not, it doesn't change the fact that killing babies automatically removes you from good guys club. It was clearly stated that Obito killed the shinobi while Itachi killed the civilians.",
            "author": null,
            "id": "fxwerfb",
            "parent_id": "t1_fxwe387",
            "score": 2,
            "created_utc": 1594615315.0,
            "replies": [
                {
                    "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
                    "author": "CelticDK",
                    "id": "fxwflf6",
                    "parent_id": "t1_fxwerfb",
                    "score": 0,
                    "created_utc": 1594615961.0,
                    "replies": [
                        {
                            "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                            "author": null,
                            "id": "fxwgnkx",
                            "parent_id": "t1_fxwflf6",
                            "score": 1,
                            "created_utc": 1594616807.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah, coup = they all show up in the middle of the night in the hokage office with a list of requests and then proceed to kill the hokage and his counselors if they don't accept. Itachi could take out the whole anbu with a genjutsu.",
            "author": null,
            "id": "fxwo55l",
            "parent_id": "t1_fxwlm3w",
            "score": 0,
            "created_utc": 1594623345.0,
            "replies": [
                {
                    "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
                    "author": "MIKEY_VEE123youandME",
                    "id": "fxwokra",
                    "parent_id": "t1_fxwo55l",
                    "score": 1,
                    "created_utc": 1594623744.0,
                    "replies": [
                        {
                            "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                            "author": null,
                            "id": "fxwp1kd",
                            "parent_id": "t1_fxwokra",
                            "score": 0,
                            "created_utc": 1594624183.0,
                            "replies": [
                                {
                                    "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                                    "author": "MIKEY_VEE123youandME",
                                    "id": "fxwqi06",
                                    "parent_id": "t1_fxwp1kd",
                                    "score": 1,
                                    "created_utc": 1594625604.0,
                                    "replies": [
                                        {
                                            "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                            "author": null,
                                            "id": "fxwsw2j",
                                            "parent_id": "t1_fxwqi06",
                                            "score": 1,
                                            "created_utc": 1594628037.0,
                                            "replies": [
                                                {
                                                    "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                                    "author": "MIKEY_VEE123youandME",
                                                    "id": "fxwu2gt",
                                                    "parent_id": "t1_fxwsw2j",
                                                    "score": 1,
                                                    "created_utc": 1594629253.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And Kabuto said he perfected it.. lol. I'm too lazy to go check but I'm sure some edo zombies had kunai too. But yeah those crazy other weapons had to be collected first",
            "author": "CelticDK",
            "id": "fxw959o",
            "parent_id": "t1_fxw60wa",
            "score": 3,
            "created_utc": 1594611311.0,
            "replies": []
        },
        {
            "body": "IIRC Kin and Zaku were used as the sacrifices for the Edo Tensai during the Chuunin exams so the weapons Harashima/Tobirama  were using were probably theirs.",
            "author": "SomeSaltyDude",
            "id": "fxwoj15",
            "parent_id": "t1_fxw60wa",
            "score": 3,
            "created_utc": 1594623700.0,
            "replies": []
        },
        {
            "body": "The 7 ninja did summon their weapons though",
            "author": "TheCaptainIRL",
            "id": "fxx9mav",
            "parent_id": "t1_fxw60wa",
            "score": 1,
            "created_utc": 1594643969.0,
            "replies": [
                {
                    "body": "Nope, the swords were collected for them.",
                    "author": null,
                    "id": "fxxfcug",
                    "parent_id": "t1_fxx9mav",
                    "score": 2,
                    "created_utc": 1594647731.0,
                    "replies": [
                        {
                            "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                            "author": "TheCaptainIRL",
                            "id": "fy0btc3",
                            "parent_id": "t1_fxxfcug",
                            "score": 1,
                            "created_utc": 1594704087.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You specified babies as your concern, then said no one had a kid in 8 years. Why would 8 years matter if a baby should be <1-2 years at the time of the massacre? By your logic, some kids could be 3, 4, 5, 6, 7, or even 8 but younger than Sasuke and still be considered a baby, since that's what you said. You call me pathetic and yet you're this stupid.. well at least it's consistent.\n\nAgain, your morality being drawn at babies and not \"killing anyone\" is also highly convenient thinking. It's just interesting to see your logic in play here. And now since you're gonna be all flustered and embarrassed, things are just gonna devolve more from here on so your reply to this probably wont warrant my continued response.\n\nI'll preemptively just say take care now.",
            "author": "CelticDK",
            "id": "fxwflf6",
            "parent_id": "t1_fxwerfb",
            "score": 0,
            "created_utc": 1594615961.0,
            "replies": [
                {
                    "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
                    "author": null,
                    "id": "fxwgnkx",
                    "parent_id": "t1_fxwflf6",
                    "score": 1,
                    "created_utc": 1594616807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If the uchiha killed the hokage and the councilors then the other clans of the village would see this and fight the uchiha starting a civil war of the leaf",
            "author": "MIKEY_VEE123youandME",
            "id": "fxwokra",
            "parent_id": "t1_fxwo55l",
            "score": 1,
            "created_utc": 1594623744.0,
            "replies": [
                {
                    "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
                    "author": null,
                    "id": "fxwp1kd",
                    "parent_id": "t1_fxwokra",
                    "score": 0,
                    "created_utc": 1594624183.0,
                    "replies": [
                        {
                            "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                            "author": "MIKEY_VEE123youandME",
                            "id": "fxwqi06",
                            "parent_id": "t1_fxwp1kd",
                            "score": 1,
                            "created_utc": 1594625604.0,
                            "replies": [
                                {
                                    "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                                    "author": null,
                                    "id": "fxwsw2j",
                                    "parent_id": "t1_fxwqi06",
                                    "score": 1,
                                    "created_utc": 1594628037.0,
                                    "replies": [
                                        {
                                            "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                            "author": "MIKEY_VEE123youandME",
                                            "id": "fxwu2gt",
                                            "parent_id": "t1_fxwsw2j",
                                            "score": 1,
                                            "created_utc": 1594629253.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope, the swords were collected for them.",
            "author": null,
            "id": "fxxfcug",
            "parent_id": "t1_fxx9mav",
            "score": 2,
            "created_utc": 1594647731.0,
            "replies": [
                {
                    "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
                    "author": "TheCaptainIRL",
                    "id": "fy0btc3",
                    "parent_id": "t1_fxxfcug",
                    "score": 1,
                    "created_utc": 1594704087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Calling me stupid, but you are not able to discern basic statements; lmao hahahahaha. You asked if there even were babies when Itachi killed everyone. So i said what kind of clan with hundreds of people wouldn't make babies in so many years. I said 8 years because Sasuke was 7 when the massacre happened + 9 month pregnancy ≈ 8 years. Hence me saying it would be a huge plot hole and you couldn't even understand that, yet you talk about logic hahaha what a joke. And look how pissed you became for the \"honor\" of a fictional character hahahahaha.",
            "author": null,
            "id": "fxwgnkx",
            "parent_id": "t1_fxwflf6",
            "score": 1,
            "created_utc": 1594616807.0,
            "replies": []
        },
        {
            "body": "Nah not necessarily, they cam simply replace the hokage and the new one will understand what is the price of discrimination.",
            "author": null,
            "id": "fxwp1kd",
            "parent_id": "t1_fxwokra",
            "score": 0,
            "created_utc": 1594624183.0,
            "replies": [
                {
                    "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
                    "author": "MIKEY_VEE123youandME",
                    "id": "fxwqi06",
                    "parent_id": "t1_fxwp1kd",
                    "score": 1,
                    "created_utc": 1594625604.0,
                    "replies": [
                        {
                            "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                            "author": null,
                            "id": "fxwsw2j",
                            "parent_id": "t1_fxwqi06",
                            "score": 1,
                            "created_utc": 1594628037.0,
                            "replies": [
                                {
                                    "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                                    "author": "MIKEY_VEE123youandME",
                                    "id": "fxwu2gt",
                                    "parent_id": "t1_fxwsw2j",
                                    "score": 1,
                                    "created_utc": 1594629253.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Who is summoning them at the beginning of this clip? [0:33](https://youtu.be/hdHZmdpX1RQ)",
            "author": "TheCaptainIRL",
            "id": "fy0btc3",
            "parent_id": "t1_fxxfcug",
            "score": 1,
            "created_utc": 1594704087.0,
            "replies": []
        },
        {
            "body": "If the most oshtredized clan decides to off the elected leader and the councilors it won’t go without a fight, that’s like all of Michigan killing the president and his cabinet, the rest of the US. Would attack Michigan and the next president wouldn’t be like “we’ll let’s treat Michigan better”...not exactly the best analogy but yknow\n\nLol why am I invested in this😂",
            "author": "MIKEY_VEE123youandME",
            "id": "fxwqi06",
            "parent_id": "t1_fxwp1kd",
            "score": 1,
            "created_utc": 1594625604.0,
            "replies": [
                {
                    "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
                    "author": null,
                    "id": "fxwsw2j",
                    "parent_id": "t1_fxwqi06",
                    "score": 1,
                    "created_utc": 1594628037.0,
                    "replies": [
                        {
                            "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                            "author": "MIKEY_VEE123youandME",
                            "id": "fxwu2gt",
                            "parent_id": "t1_fxwsw2j",
                            "score": 1,
                            "created_utc": 1594629253.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well technically the hokage isn't really elected, to some extent they could simply kill the hokage and a few counselors, but not all of them. This way the remaining counselors can choose a new hokage.",
            "author": null,
            "id": "fxwsw2j",
            "parent_id": "t1_fxwqi06",
            "score": 1,
            "created_utc": 1594628037.0,
            "replies": [
                {
                    "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
                    "author": "MIKEY_VEE123youandME",
                    "id": "fxwu2gt",
                    "parent_id": "t1_fxwsw2j",
                    "score": 1,
                    "created_utc": 1594629253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I just remember hashirama and madara we’re running elections and hashirama won",
            "author": "MIKEY_VEE123youandME",
            "id": "fxwu2gt",
            "parent_id": "t1_fxwsw2j",
            "score": 1,
            "created_utc": 1594629253.0,
            "replies": []
        }
    ]
}