{
    "title": "My hair is starting to get long, it’s been growing out for about a year. Often it gets in my face then I get acne (I’m 16). How can I keep it out of my face? I got some pomade, how do I use it for long hair?",
    "post_id": "urpgx7",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/urpgx7/my_hair_is_starting_to_get_long_its_been_growing/",
    "author": "Thunderingthought",
    "body": "",
    "url": "https://i.redd.it/wjhuw79f52091.jpg",
    "score": 271,
    "upvote_ratio": 0.95,
    "created_utc": 1652802680.0,
    "num_comments": 138,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Bro's beautiful",
            "author": "CeleryNo1743",
            "id": "i8yqa66",
            "parent_id": "t3_urpgx7",
            "score": 371,
            "created_utc": 1652805584.0,
            "replies": [
                {
                    "body": "I might switch teams tbh",
                    "author": "x_frame",
                    "id": "i8za2k3",
                    "parent_id": "t1_i8yqa66",
                    "score": 145,
                    "created_utc": 1652813576.0,
                    "replies": [
                        {
                            "body": "I might switch teams just to have hair on my head",
                            "author": "CeleryNo1743",
                            "id": "i8zafmg",
                            "parent_id": "t1_i8za2k3",
                            "score": 44,
                            "created_utc": 1652813722.0,
                            "replies": [
                                {
                                    "body": "Probably be getting more bitches too",
                                    "author": "x_frame",
                                    "id": "i8zapl6",
                                    "parent_id": "t1_i8zafmg",
                                    "score": 22,
                                    "created_utc": 1652813837.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah this is androgynous beauty at its best. He should consider lesbianism. Would do super well.",
                    "author": "8Ariadnesthread8",
                    "id": "i8zqxx4",
                    "parent_id": "t1_i8yqa66",
                    "score": 59,
                    "created_utc": 1652820532.0,
                    "replies": [
                        {
                            "body": "You guys are brutal. The kid is 16. Just a freshly cut rose.",
                            "author": "MooseleaderMusic",
                            "id": "i90docz",
                            "parent_id": "t1_i8zqxx4",
                            "score": 42,
                            "created_utc": 1652830755.0,
                            "replies": [
                                {
                                    "body": "He's gorgeous and needs to know it so he can break hearts and get the best jobs lol.",
                                    "author": "8Ariadnesthread8",
                                    "id": "i90fgpq",
                                    "parent_id": "t1_i90docz",
                                    "score": 40,
                                    "created_utc": 1652831621.0,
                                    "replies": [
                                        {
                                            "body": "All roses wither",
                                            "author": "MooseleaderMusic",
                                            "id": "i91bh18",
                                            "parent_id": "t1_i90fgpq",
                                            "score": 1,
                                            "created_utc": 1652847548.0,
                                            "replies": [
                                                {
                                                    "body": "Tell that to Helen mirren.",
                                                    "author": "8Ariadnesthread8",
                                                    "id": "i92lii3",
                                                    "parent_id": "t1_i91bh18",
                                                    "score": 5,
                                                    "created_utc": 1652880983.0,
                                                    "replies": [
                                                        {
                                                            "body": "I will. I tried to tell it to Betty White the other day.",
                                                            "author": "MooseleaderMusic",
                                                            "id": "i95obcl",
                                                            "parent_id": "t1_i92lii3",
                                                            "score": 1,
                                                            "created_utc": 1652928875.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "He didn’t come here for comments on his sexuality. The boy is a minor",
                            "author": "entredeuxeaux",
                            "id": "i9283u4",
                            "parent_id": "t1_i8zqxx4",
                            "score": 19,
                            "created_utc": 1652873711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The most masculine woman or the most feminine man?",
            "author": "BadBanana99",
            "id": "i8zzgxr",
            "parent_id": "t3_urpgx7",
            "score": 197,
            "created_utc": 1652824164.0,
            "replies": [
                {
                    "body": "Both 🤫😉",
                    "author": "Thunderingthought",
                    "id": "i90fqbi",
                    "parent_id": "t1_i8zzgxr",
                    "score": 87,
                    "created_utc": 1652831751.0,
                    "replies": []
                },
                {
                    "body": "Bro I was thinking the same thing lmao",
                    "author": "Flat_Link3959",
                    "id": "i91bz1x",
                    "parent_id": "t1_i8zzgxr",
                    "score": 7,
                    "created_utc": 1652847851.0,
                    "replies": []
                },
                {
                    "body": "A bi girl's dream",
                    "author": "PitiRR",
                    "id": "i92r3rc",
                    "parent_id": "t1_i8zzgxr",
                    "score": 2,
                    "created_utc": 1652883541.0,
                    "replies": [
                        {
                            "body": "im a bi girl and true",
                            "author": "rotten_milk420",
                            "id": "id6f2qa",
                            "parent_id": "t1_i92r3rc",
                            "score": 2,
                            "created_utc": 1655817031.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly ur getting acne not because of ur hair but because ur 16. Happened to me a lot and I had hair that fell on my face. You can’t really avoid it. What you could do is tie your hair back, Eren Yeager style.",
            "author": "Twindo",
            "id": "i909k7v",
            "parent_id": "t3_urpgx7",
            "score": 61,
            "created_utc": 1652828785.0,
            "replies": []
        },
        {
            "body": "Hello Jesus, i lost my savings in Luna how can i get them back?",
            "author": "Jugurrtha",
            "id": "i8zzih4",
            "parent_id": "t3_urpgx7",
            "score": 53,
            "created_utc": 1652824182.0,
            "replies": []
        },
        {
            "body": "y’all being weird af dude’s 16",
            "author": "Space-clout",
            "id": "i90rnyc",
            "parent_id": "t3_urpgx7",
            "score": 31,
            "created_utc": 1652837401.0,
            "replies": []
        },
        {
            "body": "i had hair down to my shoulders when i was your age, now im bald.\n\nyou get used to it generally and it becomes second nature to brush the hair out of the way/back. keep your hair clean and find a good pomade you like, it will give you some hold without the stiff gel look. but dont go to a big box store, hit up a supply store like Sally's Beauty Supply, they will have the same and better quality stuff for cheaper usually. are manbuns still a thing with kids these days? if you play sports, straight up get a few of those elastic headband things, game changer.",
            "author": "CubbyNINJA",
            "id": "i8ytpwp",
            "parent_id": "t3_urpgx7",
            "score": 50,
            "created_utc": 1652806958.0,
            "replies": [
                {
                    "body": "Any advice on how to not go bald",
                    "author": "Visible-Employer-773",
                    "id": "i8zg7s0",
                    "parent_id": "t1_i8ytpwp",
                    "score": 21,
                    "created_utc": 1652816086.0,
                    "replies": [
                        {
                            "body": "Win the genetic lottery basically. You basically have a 60-70% chance to experience some form of hair loss by the time you are 30. \n\nYou will likely have you hairline “settle” and pull back a bit, usually on the sides when you are around 18 to early 20s, this is normal. Most guys will have it stop at that point till they are mid to late 20s/early 30s where thinning(not necessarily balding) can happen. In my case, when my hairline started to settle in college, it didn’t stop and I slowly started to grow an island of skin in the back by the time I was 27. I owned it and shaved my head clean, and honestly it looks good.",
                            "author": "CubbyNINJA",
                            "id": "i8zhpp9",
                            "parent_id": "t1_i8zg7s0",
                            "score": 33,
                            "created_utc": 1652816702.0,
                            "replies": [
                                {
                                    "body": "Good example of the sucky genes, I’m thinning out significantly at 16. Not much I can do, just the horrid genetics. Luckily I have a nice jawline, I never really got to enjoy my hair.",
                                    "author": "somestreamerguy1",
                                    "id": "i911ie3",
                                    "parent_id": "t1_i8zhpp9",
                                    "score": 3,
                                    "created_utc": 1652842099.0,
                                    "replies": []
                                },
                                {
                                    "body": "Taking supplements and eating a healthy diet won’t help? My daddy is bald not fully but he started balding way before my age and I have a good hairline but kinda wide on the sides",
                                    "author": "Visible-Employer-773",
                                    "id": "i8zia0z",
                                    "parent_id": "t1_i8zhpp9",
                                    "score": 6,
                                    "created_utc": 1652816935.0,
                                    "replies": [
                                        {
                                            "body": "I mean yeah, it all helps. But if your genes suck, they suck lol \n\nAlso male pattern baldness is often passed along from a gene given to you by your mother",
                                            "author": "CubbyNINJA",
                                            "id": "i8ziy8z",
                                            "parent_id": "t1_i8zia0z",
                                            "score": 13,
                                            "created_utc": 1652817212.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I was told the mother part my uncles have great hairlines(expect for one due to stress) and grandpa too and my mom has a great hairline too I hope I don’t go fully bald",
                                                    "author": "Visible-Employer-773",
                                                    "id": "i8zkqr5",
                                                    "parent_id": "t1_i8ziy8z",
                                                    "score": 5,
                                                    "created_utc": 1652817953.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
                                                            "author": "MoreFadesMoreBaes",
                                                            "id": "i90rdx8",
                                                            "parent_id": "t1_i8zkqr5",
                                                            "score": 7,
                                                            "created_utc": 1652837273.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                                                                    "author": "MoreFadesMoreBaes",
                                                                    "id": "i90rier",
                                                                    "parent_id": "t1_i90rdx8",
                                                                    "score": 3,
                                                                    "created_utc": 1652837331.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                                                                    "author": "Visible-Employer-773",
                                                                    "id": "i91onkl",
                                                                    "parent_id": "t1_i90rdx8",
                                                                    "score": 2,
                                                                    "created_utc": 1652857167.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                                                                            "author": "WillfulMurder",
                                                                            "id": "i92btcb",
                                                                            "parent_id": "t1_i91onkl",
                                                                            "score": 4,
                                                                            "created_utc": 1652875980.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                                                                    "author": "Illustrious_Pin_2084",
                                                                                    "id": "ib7ob5f",
                                                                                    "parent_id": "t1_i92btcb",
                                                                                    "score": 2,
                                                                                    "created_utc": 1654397932.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                                                                            "author": "Supersquigi",
                                                                            "id": "i92nnek",
                                                                            "parent_id": "t1_i91onkl",
                                                                            "score": 1,
                                                                            "created_utc": 1652881979.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                                                                            "author": "MoreFadesMoreBaes",
                                                                            "id": "i931w5x",
                                                                            "parent_id": "t1_i91onkl",
                                                                            "score": 1,
                                                                            "created_utc": 1652888060.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                                                                    "author": "Visible-Employer-773",
                                                                                    "id": "i93f9lr",
                                                                                    "parent_id": "t1_i931w5x",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652893465.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                                                                            "author": "MoreFadesMoreBaes",
                                                                                            "id": "i93fm03",
                                                                                            "parent_id": "t1_i93f9lr",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652893603.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
                                                            "author": "MoreFadesMoreBaes",
                                                            "id": "i92yaob",
                                                            "parent_id": "t1_i8zkqr5",
                                                            "score": 2,
                                                            "created_utc": 1652886584.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Probably",
                                                                    "author": "Visible-Employer-773",
                                                                    "id": "i93f2zj",
                                                                    "parent_id": "t1_i92yaob",
                                                                    "score": 1,
                                                                    "created_utc": 1652893391.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Finasteride/propecia",
                            "author": "Flaffelll",
                            "id": "i90oryf",
                            "parent_id": "t1_i8zg7s0",
                            "score": 2,
                            "created_utc": 1652836039.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I say this as a dude, you're absolutely fucking fine, holy shit",
            "author": "hoesuay",
            "id": "i8zq5sh",
            "parent_id": "t3_urpgx7",
            "score": 39,
            "created_utc": 1652820210.0,
            "replies": []
        },
        {
            "body": "My hair is pretty long too. I just use a hair tie and keep it in a pony tail.",
            "author": "Brave-Safe-1581",
            "id": "i90854e",
            "parent_id": "t3_urpgx7",
            "score": 9,
            "created_utc": 1652828114.0,
            "replies": []
        },
        {
            "body": "wow. your hair is amazing and you’re SO fine",
            "author": "melissoraptor",
            "id": "i90k3eh",
            "parent_id": "t3_urpgx7",
            "score": 8,
            "created_utc": 1652833833.0,
            "replies": []
        },
        {
            "body": "Looks great, tbh\n\nGenuine look but well counterbalanced with jumper and chain",
            "author": "oliverjohansson",
            "id": "i8ykdwu",
            "parent_id": "t3_urpgx7",
            "score": 21,
            "created_utc": 1652803176.0,
            "replies": []
        },
        {
            "body": ">How can I keep it out of my face?\n\nIf you're looking for something with medium hold for longer hair, Redken and American Crew both make a decent fiber cream. Put maybe a quarter-sized amount in your hands, coat your palms and fingers, and run fingers through your hair in a backward motion. Use a bit more if your hair is damp and a bit less if it's dry.",
            "author": "Willravel",
            "id": "i90ig7u",
            "parent_id": "t3_urpgx7",
            "score": 6,
            "created_utc": 1652833076.0,
            "replies": []
        },
        {
            "body": "Dude you’re good looking as hell. I think the hair suits u tbh. The way it is now has that surfer, blown out style but I can definitely see how that would get annoying. Even a trim might help, but I wouldn’t suggest getting a short cut",
            "author": "ashtondaniel137",
            "id": "i907qg8",
            "parent_id": "t3_urpgx7",
            "score": 10,
            "created_utc": 1652827920.0,
            "replies": [
                {
                    "body": "I do actually surf!",
                    "author": "Thunderingthought",
                    "id": "i90fwzk",
                    "parent_id": "t1_i907qg8",
                    "score": 8,
                    "created_utc": 1652831842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My hair isn’t nearly as long as yours but I bought a 3 pack of these metal/wire headbands on Amazon that look cool and are comfortable. You could give those a shot, it was only like $8.",
            "author": "whaleweaves",
            "id": "i8z5mcr",
            "parent_id": "t3_urpgx7",
            "score": 9,
            "created_utc": 1652811759.0,
            "replies": [
                {
                    "body": "Could you link them? Dm if have to",
                    "author": "phazeight",
                    "id": "ics7xzq",
                    "parent_id": "t1_i8z5mcr",
                    "score": 1,
                    "created_utc": 1655515178.0,
                    "replies": [
                        {
                            "body": "Just search ‘wire headband’ on Amazon and it’s the first option, 7.99 for 3",
                            "author": "whaleweaves",
                            "id": "ics8c50",
                            "parent_id": "t1_ics7xzq",
                            "score": 1,
                            "created_utc": 1655515389.0,
                            "replies": [
                                {
                                    "body": "The wavy one?",
                                    "author": "phazeight",
                                    "id": "ics95q6",
                                    "parent_id": "t1_ics8c50",
                                    "score": 1,
                                    "created_utc": 1655515826.0,
                                    "replies": [
                                        {
                                            "body": "Yup, that’s the one",
                                            "author": "whaleweaves",
                                            "id": "ics97u1",
                                            "parent_id": "t1_ics95q6",
                                            "score": 1,
                                            "created_utc": 1655515857.0,
                                            "replies": [
                                                {
                                                    "body": "Ty",
                                                    "author": "phazeight",
                                                    "id": "icsc6e0",
                                                    "parent_id": "t1_ics97u1",
                                                    "score": 1,
                                                    "created_utc": 1655517486.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your eyebrows and eyes are so much like Billie Eilish’s. Handsome fellow",
            "author": "Old-Commission6613",
            "id": "i8z4yrc",
            "parent_id": "t3_urpgx7",
            "score": 10,
            "created_utc": 1652811493.0,
            "replies": []
        },
        {
            "body": "Omg id go gay for u",
            "author": "Lynshyttt",
            "id": "i90zvid",
            "parent_id": "t3_urpgx7",
            "score": 4,
            "created_utc": 1652841297.0,
            "replies": []
        },
        {
            "body": "I get medieval prince energy from you king",
            "author": "tecrazy",
            "id": "i8zgn2l",
            "parent_id": "t3_urpgx7",
            "score": 7,
            "created_utc": 1652816260.0,
            "replies": []
        },
        {
            "body": "Try putting your hair up at night before you sleep",
            "author": "gianzin",
            "id": "i8z7bvi",
            "parent_id": "t3_urpgx7",
            "score": 6,
            "created_utc": 1652812454.0,
            "replies": []
        },
        {
            "body": "I don't know bro. I'm still using all my brain powers to figure out if you are a boy or girl.",
            "author": null,
            "id": "i90frci",
            "parent_id": "t3_urpgx7",
            "score": 5,
            "created_utc": 1652831765.0,
            "replies": [
                {
                    "body": "Both",
                    "author": "Thunderingthought",
                    "id": "i90l3hq",
                    "parent_id": "t1_i90frci",
                    "score": 4,
                    "created_utc": 1652834310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Real talk: your hair is bringing out your feminine traits, not your masculine ones. If you want to look feminine, thats fine. If you want to look more masculine, you gotta cut it. Its nice hair. You dont need to look as masculine as possible either. Rather a balance would work quite well. Something like 4 inch waivy hair with a head band or something could work well. You should go to a male barber who only cuts mens hair.",
            "author": "-DeadLock",
            "id": "i8zbmnb",
            "parent_id": "t3_urpgx7",
            "score": 21,
            "created_utc": 1652814213.0,
            "replies": [
                {
                    "body": "Yea I don’t have a dad anymore so for haircuts my mom drags me along to a salon and says ‘don’t worry haircuts are haircuts’. I like my long hair tho, I want to keep it around shoulder length, but idk how to have shoulder length hair and a masculine-ish cut. Would layers help or would that just make me look even more feminine? \n\nBtw masculinity isn’t the most important thing in the world to me since I’m bisexual, but it would still be nice",
                    "author": "Thunderingthought",
                    "id": "i8zzj9f",
                    "parent_id": "t1_i8zbmnb",
                    "score": 13,
                    "created_utc": 1652824192.0,
                    "replies": [
                        {
                            "body": "Sorry to hear about dad. Your mom is wrong tho. I think personally youd need to cut maybe an inch or two off to get what you want. Idk tho. Search \"mid length hair men\" (or long length hair men) look for men with similar  shape as you. (Not face, face shape IE contour). Maybe even take an hour two to to go thru pics. Save 5 or 6 and bring it to barber. Good luck man",
                            "author": "-DeadLock",
                            "id": "i900mes",
                            "parent_id": "t1_i8zzj9f",
                            "score": 4,
                            "created_utc": 1652824675.0,
                            "replies": []
                        },
                        {
                            "body": "Idk what the other guy is talking about. People who think hair is feminine or masculine are silly. If your hair is pretty that doesn't make you feminine. Lots of chicks dig pretty boys.\n\nI have long, thick curly hair that forms coils, and from behind I get mistaken as a woman sometimes and nothing is going to change that.\n\nRock what you want my dude.",
                            "author": "SSPokaLink",
                            "id": "i91lwq5",
                            "parent_id": "t1_i8zzj9f",
                            "score": 2,
                            "created_utc": 1652854900.0,
                            "replies": [
                                {
                                    "body": "i’m a barber, there is 100% a difference.",
                                    "author": "Soggy_Newspaper8798",
                                    "id": "i91pcji",
                                    "parent_id": "t1_i91lwq5",
                                    "score": 0,
                                    "created_utc": 1652857748.0,
                                    "replies": [
                                        {
                                            "body": "Ok. Well I'm a person who has hair.",
                                            "author": "SSPokaLink",
                                            "id": "i91rwov",
                                            "parent_id": "t1_i91pcji",
                                            "score": 0,
                                            "created_utc": 1652860019.0,
                                            "replies": [
                                                {
                                                    "body": "okay? so do most people. that doesn’t mean you understand. \n\nthere has always been a difference, it’s only due to genders switching over on styles that it has become more “same same”. yet when i do a woman’s haircut in my shop, i will still give her the triangular sideburns, a more natural hairline, different volume of layers. a whole plethora of things, unless she asks otherwise. same goes for a man. \n\nmullets are a good example of this, female & male mullets are very different in how they are cut & laid. little details you wouldn’t otherwise notice just because you have hair.",
                                                    "author": "Soggy_Newspaper8798",
                                                    "id": "i91w3id",
                                                    "parent_id": "t1_i91rwov",
                                                    "score": 2,
                                                    "created_utc": 1652863944.0,
                                                    "replies": [
                                                        {
                                                            "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
                                                            "author": "SSPokaLink",
                                                            "id": "i91xwph",
                                                            "parent_id": "t1_i91w3id",
                                                            "score": -1,
                                                            "created_utc": 1652865636.0,
                                                            "replies": [
                                                                {
                                                                    "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                                                                    "author": "Soggy_Newspaper8798",
                                                                    "id": "i91y2ps",
                                                                    "parent_id": "t1_i91xwph",
                                                                    "score": 2,
                                                                    "created_utc": 1652865786.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "idk why people are roasting, u said in the best and more respectable possible way",
                    "author": "Daniel-adonai",
                    "id": "i8zn7le",
                    "parent_id": "t1_i8zbmnb",
                    "score": 7,
                    "created_utc": 1652818978.0,
                    "replies": [
                        {
                            "body": "Freal it's not like he was being disrespectful or anything and people are getting mad over it",
                            "author": "Erabuokino",
                            "id": "i8zouhi",
                            "parent_id": "t1_i8zn7le",
                            "score": 2,
                            "created_utc": 1652819664.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "fair enough i guess, i think it looks good. if you're muscular  you can rock long hair and look masculine af though",
                    "author": null,
                    "id": "i8zsyx5",
                    "parent_id": "t1_i8zbmnb",
                    "score": 4,
                    "created_utc": 1652821376.0,
                    "replies": []
                },
                {
                    "body": "You ever think someone is comfortable enough in their masculinity to wear feminine traits? \n\nSorry chief but not all of us are insecure about our gender expression",
                    "author": "russsaa",
                    "id": "i8zippp",
                    "parent_id": "t1_i8zbmnb",
                    "score": 5,
                    "created_utc": 1652817114.0,
                    "replies": [
                        {
                            "body": "ok",
                            "author": "-DeadLock",
                            "id": "i8ziswb",
                            "parent_id": "t1_i8zippp",
                            "score": -4,
                            "created_utc": 1652817150.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Mad that he's pulling more girls than you huh",
                    "author": "MythicExplorer",
                    "id": "i8zg845",
                    "parent_id": "t1_i8zbmnb",
                    "score": 2,
                    "created_utc": 1652816090.0,
                    "replies": [
                        {
                            "body": "I pull exactly 0 bitches my guy",
                            "author": "Thunderingthought",
                            "id": "i8zyj8h",
                            "parent_id": "t1_i8zg845",
                            "score": 15,
                            "created_utc": 1652823756.0,
                            "replies": [
                                {
                                    "body": "You're also 16 and probably unsure of yourself around then still, if my senses are accurate\n\nYou have plenty of time to slay\n\nAnd honestly fucking up, learning from it, and being better next time is part of the fun",
                                    "author": "mistahARK",
                                    "id": "i90251j",
                                    "parent_id": "t1_i8zyj8h",
                                    "score": 9,
                                    "created_utc": 1652825351.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh wow you nailed it. I get 0 bitches",
                            "author": "-DeadLock",
                            "id": "i8zgcl8",
                            "parent_id": "t1_i8zg845",
                            "score": 4,
                            "created_utc": 1652816141.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If it really is annoying you I suggest getting some hair ties. Your hair is long enough for a ponytail or a bun. Wear it tied beach when it’s getting aggravating and wear it loose when it’s more tolerable.",
            "author": "Vulcan_Jedi",
            "id": "i90c07w",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652829946.0,
            "replies": [
                {
                    "body": "People think I’m a girl when I do that though ):",
                    "author": "Thunderingthought",
                    "id": "i90l2li",
                    "parent_id": "t1_i90c07w",
                    "score": 2,
                    "created_utc": 1652834298.0,
                    "replies": [
                        {
                            "body": "People will make that mistake regardless that’s one of the consequences of being a a man with long hair. I can attest from personal experience",
                            "author": "Vulcan_Jedi",
                            "id": "i90sslc",
                            "parent_id": "t1_i90l2li",
                            "score": 2,
                            "created_utc": 1652837934.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t think the hair is causin the acne brotha. Not a dermo or anything but it’s normal to get some at 16. I didn’t have anyyyyy growing up until I hit 18 it hit realllttt bad and I didn’t change anything about my diet nor did anything touch my face more so than before",
            "author": "DatBoiHecton",
            "id": "i90rnyq",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652837402.0,
            "replies": []
        },
        {
            "body": "Thought you were a girl. Sorry bro! Get hair clips/ pins.",
            "author": "createusername101",
            "id": "i90u1ss",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652838515.0,
            "replies": []
        },
        {
            "body": "Not sure about pomade for long hair- might be a bit heavy?- but when mine was still long I would flip it upside down after washing and scrunch in a bit of gel, then once it dried and the gel had set I’d flip it again and “scrunch out the crunch.” That way the gel sets and holds the curl in and keeps your hair where you want it (out of your face) without looking wet or stringy. Also, a curl-specific leave-in conditioner will be your best friend.",
            "author": "notdannytrejo",
            "id": "i90yyyl",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652840855.0,
            "replies": []
        },
        {
            "body": "You look like a male Billie Eilish",
            "author": "chonchcreature",
            "id": "i910xmk",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652841810.0,
            "replies": []
        },
        {
            "body": "Messy man bun, or leave in conditioner if down. Benzoyl Peroxide for the acne (careful it does bleach hair).My look came together in my 20s when I got a bit of facial hair, my hair is same length. Dont be brush your hair, knots are masculine according to my wife haha. Whatever you are doing now works too- people on here acting like you a white Prince.",
            "author": "Dharmaclown802",
            "id": "i913pqk",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652843216.0,
            "replies": []
        },
        {
            "body": "You’re very beautiful",
            "author": "Ok_Song4610",
            "id": "i91fpyo",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652850303.0,
            "replies": []
        },
        {
            "body": "dude ur eyes are beautiful",
            "author": "69simp6_9",
            "id": "i91oh3v",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652857013.0,
            "replies": []
        },
        {
            "body": "I use hair clips to keep the crazier bits of my hair down, it's about 16 inches or so. Hair clips can keep hair out of your face too. If you want something less noticeable, you can get clips matching the same hair color as yours. I use them at work.",
            "author": "Straleos",
            "id": "i91ryjh",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652860067.0,
            "replies": [
                {
                    "body": "16 inches of hair? what else is 16 inches?",
                    "author": "lalabaya12",
                    "id": "jf5jatz",
                    "parent_id": "t1_i91ryjh",
                    "score": 1,
                    "created_utc": 1680760467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bro you look like if Billie Eilish was an average person. Try putting your hair in a high bun or a pony tail. Works for me, makes your face visible, look more masculine and it's practical. The only downside is that my scalp hurts a but afterwards.",
            "author": "lotlotov",
            "id": "i921gcz",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652868805.0,
            "replies": []
        },
        {
            "body": "Haven't done it w long hair but I find that the blow dryer has been my best friend w pomade. I usually blow dry it the direction I want it with my head upside-down to get a little lift, then after it's pretty dry put a dime-sized blob of pomade on my hands, rub it smooth on my hands, and work it into my hair. Some guys like to just towel dry their hair, work the pomade into their hair and THEN blow-dry it (or even just leave it damp), but I haven't had as much luck with that personally.",
            "author": "scottyLogJobs",
            "id": "i8z6spt",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652812237.0,
            "replies": []
        },
        {
            "body": "I have longer hair now too\n\nYou get used to it \n\n you could tuck them behind your ears . Sometimes you are lucky,  your hair behaves nicely and don't bother you sometimes they are annoying.\n\nAt home you can use a hairband , they are fairly comfy.",
            "author": "chronos0009",
            "id": "i8zi3pe",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652816864.0,
            "replies": []
        },
        {
            "body": "Wear a bun when sleeping or doing activities that’ll make you sweat like work or exercise",
            "author": "russsaa",
            "id": "i8zissq",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652817150.0,
            "replies": []
        },
        {
            "body": "You’re 16, acne will happen no matter how hard you try. Looking great tho king. I had to start changing my pillow cases every day cuz my hair’s grease/products would get on my skin after i slept on the same pillowcase for more than one night consecutively, cleared up my acne. Try getting like 6 pillowcases and wash them with sensitive skin detergent w fewer chemicals and dyes, and change pillowcases every night. Cleared up my acne p fast (also you gotta be washing ur face every day but im guessing u know that)",
            "author": "im_monwan",
            "id": "i8zk9nj",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652817755.0,
            "replies": []
        },
        {
            "body": "The trick to pomade is \"less is more\". You don't want those locks looking like you're a greasy toolbag, if it looks wet, that's too much. The hair should look dry, but be plyable. Take a dime sized amount in your palm and rub your hands together until it gets warm and workable. Work in sections to move it back from your face. Use a hair-dryer to fix melt and work out your fuckups.",
            "author": "Pepe5ilvia",
            "id": "i8zpy9o",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652820124.0,
            "replies": []
        },
        {
            "body": "bro is pretty as fuck holy shit",
            "author": "AltPunkAcc",
            "id": "i90z1ou",
            "parent_id": "t3_urpgx7",
            "score": 2,
            "created_utc": 1652840893.0,
            "replies": []
        },
        {
            "body": "[https://longreadsblog.files.wordpress.com/2017/06/gettyimages-639600538.jpg](https://longreadsblog.files.wordpress.com/2017/06/gettyimages-639600538.jpg)\n\nGet a headband if you are hellbent on keeping it out of your face. If not don't fret, everyone gets acne.",
            "author": "Yobymmas13",
            "id": "i8zr7sc",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652820645.0,
            "replies": []
        },
        {
            "body": "You can use a plastic headband use a hair tie bandana I would recvomend looking at the long hairs youtube channel they have some good stuff on there",
            "author": "deathmetalandblood",
            "id": "i8z9eon",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652813300.0,
            "replies": []
        },
        {
            "body": "I have these metal hair bands that have different wavy patterns. You can put long hair back and it adds texture and volume on top. I've been vibin on my legendary hair reputation.",
            "author": null,
            "id": "i8zda41",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652814886.0,
            "replies": []
        },
        {
            "body": "Just use a bobby pin on the bangs if you want something less noticeable. Otherwise get a headband. Also if you blowdry it towards the back while it's wet it'll generally keep that shape for a day",
            "author": "MythicExplorer",
            "id": "i8zgd98",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652816148.0,
            "replies": []
        },
        {
            "body": "When I have long hair, I comb s line to separate the \"crown\" and braid the top starting at my whorl and comb the lower part down. Then I comb in wax.\n\nAlso, I cut my hair once a year so I can have short hair sometimes and long hair sometimes so it doesn't get boring.",
            "author": "FaithlessnessSure592",
            "id": "i8ziaaf",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652816938.0,
            "replies": []
        },
        {
            "body": "Don't use it! Just keep it clean and use leave in say I. Pomade used to give me acne.",
            "author": "Extra-Swim9793",
            "id": "i8zmflz",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652818656.0,
            "replies": []
        },
        {
            "body": "Bandanas can be your best friend and an excellent accessory",
            "author": "slothsmerp",
            "id": "i8zqr5x",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652820455.0,
            "replies": []
        },
        {
            "body": "Keep it that way. You're the prettiest guy I've ever seen.",
            "author": "PhilosopherFirm4382",
            "id": "i8zuem2",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652821990.0,
            "replies": []
        },
        {
            "body": "face scrub is pretty good voor acne, used to have a lot of pimples on my face but now its less on my face and more on my neck (where i forget to use the scrub often)",
            "author": null,
            "id": "i8zthaq",
            "parent_id": "t3_urpgx7",
            "score": 0,
            "created_utc": 1652821590.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i8zv9ek",
            "parent_id": "t3_urpgx7",
            "score": -9,
            "created_utc": 1652822350.0,
            "replies": [
                {
                    "body": "Pretty good looking chick if you ask me",
                    "author": "Ok_Song4610",
                    "id": "i91g2u3",
                    "parent_id": "t1_i8zv9ek",
                    "score": 0,
                    "created_utc": 1652850549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude, just get an athletic head band or something. Get a pair of studs or rocks on your ear too. You got killer hair bro. Get some HIMS or something now to prevent hair loss",
            "author": "JustBouncin",
            "id": "i8ytl6v",
            "parent_id": "t3_urpgx7",
            "score": -3,
            "created_utc": 1652806907.0,
            "replies": []
        },
        {
            "body": "since your hair is long you should probably get curtain bangs. then cut the side and back length up to your ear lobes. give it a clean middle part look while also keeping your face clear. but be warned, pick a barber that is used to getting male long hair",
            "author": "Isaiah-Collazo",
            "id": "i8zn3sc",
            "parent_id": "t3_urpgx7",
            "score": 0,
            "created_utc": 1652818933.0,
            "replies": []
        },
        {
            "body": "hello amber heard",
            "author": null,
            "id": "i91zly2",
            "parent_id": "t3_urpgx7",
            "score": 0,
            "created_utc": 1652867189.0,
            "replies": []
        },
        {
            "body": "U r 16 it’s hormones not hair just drink lot of water nd veggies. Avoid oily nd junk food. Keep ur stomach nd digestion good, avoid meat. Try yoga and use salycylic based face wash 2 times especially before sleep u can also use clindac-A gel over the counter ointment. \nDo all this it will definitely go away.",
            "author": "Shiv_master",
            "id": "i8zg1sj",
            "parent_id": "t3_urpgx7",
            "score": -3,
            "created_utc": 1652816019.0,
            "replies": []
        },
        {
            "body": "You're a pretty girl. Use mousse and blow dry",
            "author": "Zealousideal-Rain354",
            "id": "i90a8hj",
            "parent_id": "t3_urpgx7",
            "score": -5,
            "created_utc": 1652829105.0,
            "replies": []
        },
        {
            "body": "Hear me out…",
            "author": "PapasMP",
            "id": "i90abh8",
            "parent_id": "t3_urpgx7",
            "score": -2,
            "created_utc": 1652829144.0,
            "replies": []
        },
        {
            "body": "Cut it bitch",
            "author": "Samuel444x",
            "id": "i90lwty",
            "parent_id": "t3_urpgx7",
            "score": -3,
            "created_utc": 1652834692.0,
            "replies": []
        },
        {
            "body": "bro if you are straight you need a harder look. as for the hair pomade will weight your hair down. use mousse for wavy hair and get a cut done by a female stylist as they probably know how to work with longer hair. but even then bring pics and make sure that shit looks cool",
            "author": "shazamishod",
            "id": "i90qj7d",
            "parent_id": "t3_urpgx7",
            "score": -5,
            "created_utc": 1652836876.0,
            "replies": [
                {
                    "body": "I’m bisexual so I’m ok with being effeminate",
                    "author": "Thunderingthought",
                    "id": "i924heh",
                    "parent_id": "t1_i90qj7d",
                    "score": 1,
                    "created_utc": 1652871206.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My advice is to stop fishing for compliments on reddit",
            "author": "Slasherballz98",
            "id": "i90typ2",
            "parent_id": "t3_urpgx7",
            "score": -6,
            "created_utc": 1652838476.0,
            "replies": []
        },
        {
            "body": "r/SwordOrSheath",
            "author": "skarbles",
            "id": "i9042mg",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652826231.0,
            "replies": [
                {
                    "body": "Crossbow 😳",
                    "author": "Thunderingthought",
                    "id": "i90l15g",
                    "parent_id": "t1_i9042mg",
                    "score": 4,
                    "created_utc": 1652834280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dove soap and scar away. Leave it on your face overnight",
            "author": "Weary-Ad-3051",
            "id": "i904jdq",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652826448.0,
            "replies": []
        },
        {
            "body": "Inosuke??",
            "author": "ayylotus",
            "id": "i90bl51",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652829744.0,
            "replies": []
        },
        {
            "body": "Tie it back is the most sure fire way.\nBut blow dry it back while it’s drying after a shower. Your hairstyle should be in place before you add product. Product should hold it in place, not style it if that makes sense",
            "author": "Thepresocratic",
            "id": "i90n8x9",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652835325.0,
            "replies": []
        },
        {
            "body": "I feel like braids also would look so good on u! Or half up/half down hairstyle!! Btw you're absolutely gorgeous, super angelic😍❤️❤️",
            "author": "taiwaneseplant",
            "id": "i90qnwc",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652836938.0,
            "replies": []
        },
        {
            "body": "Have hair slightly longer than this atm.  First time growing it out so I have been learning a lot.  My go to lately has been either a leave in conditioner or Shear Revival Amity texture spray to protect it while blowdrying.  I blowdry back off of my face initially then roughly into whatever style I am going for.  Sometimes thats all I do.  If I want to do more, I have been using Morrocanoil Hyrdating cream or Hanz De Fuko Scheme Cream or sometimes Quicksand.  I have been staying away from heavier hold stuff as its gotten longer.  I also sometimes throw on a light mist of hair spray but hate to use too much of it.  Often I just tie it as well and if I know I will just be doing that I usually skip the extras.  Also dry shampoo is your friend if it needs sprucing up.",
            "author": "PAKMAN1987",
            "id": "i90uust",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652838897.0,
            "replies": []
        },
        {
            "body": "Ponytail",
            "author": "Straight-Emergency17",
            "id": "i912ix0",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652842611.0,
            "replies": []
        },
        {
            "body": "See… sometimes nature really does put in the work. Unfortunately for me I was a rushed project but it is what is.",
            "author": "mundos35",
            "id": "i913boq",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652843015.0,
            "replies": []
        },
        {
            "body": "R u male or female?",
            "author": "Immediate_Bad2631",
            "id": "i918ax4",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652845685.0,
            "replies": [
                {
                    "body": "Both my friend",
                    "author": "Thunderingthought",
                    "id": "i924a6a",
                    "parent_id": "t1_i918ax4",
                    "score": 1,
                    "created_utc": 1652871057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd recommend you to buy the Stridex Pads (Red ones) and A cleanser like cerave (Light green one) with that you won't have acne in 2 months max.  Anyways Wash with cleanser and then use the pads.",
            "author": "Sebastian0977",
            "id": "i91bkyw",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652847613.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "i91deax",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652848751.0,
            "replies": [
                {
                    "body": "I haven’t cut my hair in over a year lmao, I’m gonna go longer",
                    "author": "Thunderingthought",
                    "id": "i924cq9",
                    "parent_id": "t1_i91deax",
                    "score": 2,
                    "created_utc": 1652871109.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Head(Alice)band. Btw you're beautiful dude.",
            "author": "Chip673",
            "id": "i91vzep",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652863831.0,
            "replies": []
        },
        {
            "body": "Tie it back, use an cream (not gel) product and gently brush it back from face with hands. Your only 16 so the acne is not coming from the hair for the most part. Make sure to take extra care with skin routine if you are finding you are breaking out around the edges where your hair touches.\n\nLastly, this kid is a minor people stop talking about how \"fine\" He looks. Don't be gross.",
            "author": "BatBorg",
            "id": "i92cvil",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652876582.0,
            "replies": []
        },
        {
            "body": "I’m 16 too and I had acne back when I had long hair and now when I have short hair too. Healthy diet, drinking water and exercise helped me reduce it.",
            "author": "Flaymar-0_0",
            "id": "i92ew5q",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652877688.0,
            "replies": []
        },
        {
            "body": "Took me til my late 20's to find something called \"acne patches\"...a few companies make them and it would have changed my life in my teens",
            "author": "sharts_with_wolves",
            "id": "i92mf35",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652881412.0,
            "replies": []
        },
        {
            "body": "you look like Billie eilish had a twin brother",
            "author": "Duduzan",
            "id": "i92shs9",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652884145.0,
            "replies": []
        },
        {
            "body": "Very pretty mouth",
            "author": null,
            "id": "i92vd13",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652885365.0,
            "replies": []
        },
        {
            "body": "Bro is irl Griffith from berserk holy fuck",
            "author": "xRealVengeancex",
            "id": "i935jiu",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1652889551.0,
            "replies": []
        },
        {
            "body": "When I had long hair I used a loose hairband to keep hair out of my face and kept it there. If not that, then I would use my headphones (loose or light headphones) whenever I listened to music or played games to slick my hair back. Eventually it started to naturally stay that way.",
            "author": "PastramiReubens",
            "id": "icj0sw4",
            "parent_id": "t3_urpgx7",
            "score": 1,
            "created_utc": 1655341945.0,
            "replies": []
        },
        {
            "body": "I might switch teams tbh",
            "author": "x_frame",
            "id": "i8za2k3",
            "parent_id": "t1_i8yqa66",
            "score": 145,
            "created_utc": 1652813576.0,
            "replies": [
                {
                    "body": "I might switch teams just to have hair on my head",
                    "author": "CeleryNo1743",
                    "id": "i8zafmg",
                    "parent_id": "t1_i8za2k3",
                    "score": 44,
                    "created_utc": 1652813722.0,
                    "replies": [
                        {
                            "body": "Probably be getting more bitches too",
                            "author": "x_frame",
                            "id": "i8zapl6",
                            "parent_id": "t1_i8zafmg",
                            "score": 22,
                            "created_utc": 1652813837.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah this is androgynous beauty at its best. He should consider lesbianism. Would do super well.",
            "author": "8Ariadnesthread8",
            "id": "i8zqxx4",
            "parent_id": "t1_i8yqa66",
            "score": 59,
            "created_utc": 1652820532.0,
            "replies": [
                {
                    "body": "You guys are brutal. The kid is 16. Just a freshly cut rose.",
                    "author": "MooseleaderMusic",
                    "id": "i90docz",
                    "parent_id": "t1_i8zqxx4",
                    "score": 42,
                    "created_utc": 1652830755.0,
                    "replies": [
                        {
                            "body": "He's gorgeous and needs to know it so he can break hearts and get the best jobs lol.",
                            "author": "8Ariadnesthread8",
                            "id": "i90fgpq",
                            "parent_id": "t1_i90docz",
                            "score": 40,
                            "created_utc": 1652831621.0,
                            "replies": [
                                {
                                    "body": "All roses wither",
                                    "author": "MooseleaderMusic",
                                    "id": "i91bh18",
                                    "parent_id": "t1_i90fgpq",
                                    "score": 1,
                                    "created_utc": 1652847548.0,
                                    "replies": [
                                        {
                                            "body": "Tell that to Helen mirren.",
                                            "author": "8Ariadnesthread8",
                                            "id": "i92lii3",
                                            "parent_id": "t1_i91bh18",
                                            "score": 5,
                                            "created_utc": 1652880983.0,
                                            "replies": [
                                                {
                                                    "body": "I will. I tried to tell it to Betty White the other day.",
                                                    "author": "MooseleaderMusic",
                                                    "id": "i95obcl",
                                                    "parent_id": "t1_i92lii3",
                                                    "score": 1,
                                                    "created_utc": 1652928875.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He didn’t come here for comments on his sexuality. The boy is a minor",
                    "author": "entredeuxeaux",
                    "id": "i9283u4",
                    "parent_id": "t1_i8zqxx4",
                    "score": 19,
                    "created_utc": 1652873711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Both 🤫😉",
            "author": "Thunderingthought",
            "id": "i90fqbi",
            "parent_id": "t1_i8zzgxr",
            "score": 87,
            "created_utc": 1652831751.0,
            "replies": []
        },
        {
            "body": "Bro I was thinking the same thing lmao",
            "author": "Flat_Link3959",
            "id": "i91bz1x",
            "parent_id": "t1_i8zzgxr",
            "score": 7,
            "created_utc": 1652847851.0,
            "replies": []
        },
        {
            "body": "A bi girl's dream",
            "author": "PitiRR",
            "id": "i92r3rc",
            "parent_id": "t1_i8zzgxr",
            "score": 2,
            "created_utc": 1652883541.0,
            "replies": [
                {
                    "body": "im a bi girl and true",
                    "author": "rotten_milk420",
                    "id": "id6f2qa",
                    "parent_id": "t1_i92r3rc",
                    "score": 2,
                    "created_utc": 1655817031.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any advice on how to not go bald",
            "author": "Visible-Employer-773",
            "id": "i8zg7s0",
            "parent_id": "t1_i8ytpwp",
            "score": 21,
            "created_utc": 1652816086.0,
            "replies": [
                {
                    "body": "Win the genetic lottery basically. You basically have a 60-70% chance to experience some form of hair loss by the time you are 30. \n\nYou will likely have you hairline “settle” and pull back a bit, usually on the sides when you are around 18 to early 20s, this is normal. Most guys will have it stop at that point till they are mid to late 20s/early 30s where thinning(not necessarily balding) can happen. In my case, when my hairline started to settle in college, it didn’t stop and I slowly started to grow an island of skin in the back by the time I was 27. I owned it and shaved my head clean, and honestly it looks good.",
                    "author": "CubbyNINJA",
                    "id": "i8zhpp9",
                    "parent_id": "t1_i8zg7s0",
                    "score": 33,
                    "created_utc": 1652816702.0,
                    "replies": [
                        {
                            "body": "Good example of the sucky genes, I’m thinning out significantly at 16. Not much I can do, just the horrid genetics. Luckily I have a nice jawline, I never really got to enjoy my hair.",
                            "author": "somestreamerguy1",
                            "id": "i911ie3",
                            "parent_id": "t1_i8zhpp9",
                            "score": 3,
                            "created_utc": 1652842099.0,
                            "replies": []
                        },
                        {
                            "body": "Taking supplements and eating a healthy diet won’t help? My daddy is bald not fully but he started balding way before my age and I have a good hairline but kinda wide on the sides",
                            "author": "Visible-Employer-773",
                            "id": "i8zia0z",
                            "parent_id": "t1_i8zhpp9",
                            "score": 6,
                            "created_utc": 1652816935.0,
                            "replies": [
                                {
                                    "body": "I mean yeah, it all helps. But if your genes suck, they suck lol \n\nAlso male pattern baldness is often passed along from a gene given to you by your mother",
                                    "author": "CubbyNINJA",
                                    "id": "i8ziy8z",
                                    "parent_id": "t1_i8zia0z",
                                    "score": 13,
                                    "created_utc": 1652817212.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I was told the mother part my uncles have great hairlines(expect for one due to stress) and grandpa too and my mom has a great hairline too I hope I don’t go fully bald",
                                            "author": "Visible-Employer-773",
                                            "id": "i8zkqr5",
                                            "parent_id": "t1_i8ziy8z",
                                            "score": 5,
                                            "created_utc": 1652817953.0,
                                            "replies": [
                                                {
                                                    "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
                                                    "author": "MoreFadesMoreBaes",
                                                    "id": "i90rdx8",
                                                    "parent_id": "t1_i8zkqr5",
                                                    "score": 7,
                                                    "created_utc": 1652837273.0,
                                                    "replies": [
                                                        {
                                                            "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                                                            "author": "MoreFadesMoreBaes",
                                                            "id": "i90rier",
                                                            "parent_id": "t1_i90rdx8",
                                                            "score": 3,
                                                            "created_utc": 1652837331.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                                                            "author": "Visible-Employer-773",
                                                            "id": "i91onkl",
                                                            "parent_id": "t1_i90rdx8",
                                                            "score": 2,
                                                            "created_utc": 1652857167.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                                                                    "author": "WillfulMurder",
                                                                    "id": "i92btcb",
                                                                    "parent_id": "t1_i91onkl",
                                                                    "score": 4,
                                                                    "created_utc": 1652875980.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                                                            "author": "Illustrious_Pin_2084",
                                                                            "id": "ib7ob5f",
                                                                            "parent_id": "t1_i92btcb",
                                                                            "score": 2,
                                                                            "created_utc": 1654397932.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                                                                    "author": "Supersquigi",
                                                                    "id": "i92nnek",
                                                                    "parent_id": "t1_i91onkl",
                                                                    "score": 1,
                                                                    "created_utc": 1652881979.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                                                                    "author": "MoreFadesMoreBaes",
                                                                    "id": "i931w5x",
                                                                    "parent_id": "t1_i91onkl",
                                                                    "score": 1,
                                                                    "created_utc": 1652888060.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                                                            "author": "Visible-Employer-773",
                                                                            "id": "i93f9lr",
                                                                            "parent_id": "t1_i931w5x",
                                                                            "score": 1,
                                                                            "created_utc": 1652893465.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                                                                    "author": "MoreFadesMoreBaes",
                                                                                    "id": "i93fm03",
                                                                                    "parent_id": "t1_i93f9lr",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652893603.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
                                                    "author": "MoreFadesMoreBaes",
                                                    "id": "i92yaob",
                                                    "parent_id": "t1_i8zkqr5",
                                                    "score": 2,
                                                    "created_utc": 1652886584.0,
                                                    "replies": [
                                                        {
                                                            "body": "Probably",
                                                            "author": "Visible-Employer-773",
                                                            "id": "i93f2zj",
                                                            "parent_id": "t1_i92yaob",
                                                            "score": 1,
                                                            "created_utc": 1652893391.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Finasteride/propecia",
                    "author": "Flaffelll",
                    "id": "i90oryf",
                    "parent_id": "t1_i8zg7s0",
                    "score": 2,
                    "created_utc": 1652836039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do actually surf!",
            "author": "Thunderingthought",
            "id": "i90fwzk",
            "parent_id": "t1_i907qg8",
            "score": 8,
            "created_utc": 1652831842.0,
            "replies": []
        },
        {
            "body": "Could you link them? Dm if have to",
            "author": "phazeight",
            "id": "ics7xzq",
            "parent_id": "t1_i8z5mcr",
            "score": 1,
            "created_utc": 1655515178.0,
            "replies": [
                {
                    "body": "Just search ‘wire headband’ on Amazon and it’s the first option, 7.99 for 3",
                    "author": "whaleweaves",
                    "id": "ics8c50",
                    "parent_id": "t1_ics7xzq",
                    "score": 1,
                    "created_utc": 1655515389.0,
                    "replies": [
                        {
                            "body": "The wavy one?",
                            "author": "phazeight",
                            "id": "ics95q6",
                            "parent_id": "t1_ics8c50",
                            "score": 1,
                            "created_utc": 1655515826.0,
                            "replies": [
                                {
                                    "body": "Yup, that’s the one",
                                    "author": "whaleweaves",
                                    "id": "ics97u1",
                                    "parent_id": "t1_ics95q6",
                                    "score": 1,
                                    "created_utc": 1655515857.0,
                                    "replies": [
                                        {
                                            "body": "Ty",
                                            "author": "phazeight",
                                            "id": "icsc6e0",
                                            "parent_id": "t1_ics97u1",
                                            "score": 1,
                                            "created_utc": 1655517486.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Both",
            "author": "Thunderingthought",
            "id": "i90l3hq",
            "parent_id": "t1_i90frci",
            "score": 4,
            "created_utc": 1652834310.0,
            "replies": []
        },
        {
            "body": "Yea I don’t have a dad anymore so for haircuts my mom drags me along to a salon and says ‘don’t worry haircuts are haircuts’. I like my long hair tho, I want to keep it around shoulder length, but idk how to have shoulder length hair and a masculine-ish cut. Would layers help or would that just make me look even more feminine? \n\nBtw masculinity isn’t the most important thing in the world to me since I’m bisexual, but it would still be nice",
            "author": "Thunderingthought",
            "id": "i8zzj9f",
            "parent_id": "t1_i8zbmnb",
            "score": 13,
            "created_utc": 1652824192.0,
            "replies": [
                {
                    "body": "Sorry to hear about dad. Your mom is wrong tho. I think personally youd need to cut maybe an inch or two off to get what you want. Idk tho. Search \"mid length hair men\" (or long length hair men) look for men with similar  shape as you. (Not face, face shape IE contour). Maybe even take an hour two to to go thru pics. Save 5 or 6 and bring it to barber. Good luck man",
                    "author": "-DeadLock",
                    "id": "i900mes",
                    "parent_id": "t1_i8zzj9f",
                    "score": 4,
                    "created_utc": 1652824675.0,
                    "replies": []
                },
                {
                    "body": "Idk what the other guy is talking about. People who think hair is feminine or masculine are silly. If your hair is pretty that doesn't make you feminine. Lots of chicks dig pretty boys.\n\nI have long, thick curly hair that forms coils, and from behind I get mistaken as a woman sometimes and nothing is going to change that.\n\nRock what you want my dude.",
                    "author": "SSPokaLink",
                    "id": "i91lwq5",
                    "parent_id": "t1_i8zzj9f",
                    "score": 2,
                    "created_utc": 1652854900.0,
                    "replies": [
                        {
                            "body": "i’m a barber, there is 100% a difference.",
                            "author": "Soggy_Newspaper8798",
                            "id": "i91pcji",
                            "parent_id": "t1_i91lwq5",
                            "score": 0,
                            "created_utc": 1652857748.0,
                            "replies": [
                                {
                                    "body": "Ok. Well I'm a person who has hair.",
                                    "author": "SSPokaLink",
                                    "id": "i91rwov",
                                    "parent_id": "t1_i91pcji",
                                    "score": 0,
                                    "created_utc": 1652860019.0,
                                    "replies": [
                                        {
                                            "body": "okay? so do most people. that doesn’t mean you understand. \n\nthere has always been a difference, it’s only due to genders switching over on styles that it has become more “same same”. yet when i do a woman’s haircut in my shop, i will still give her the triangular sideburns, a more natural hairline, different volume of layers. a whole plethora of things, unless she asks otherwise. same goes for a man. \n\nmullets are a good example of this, female & male mullets are very different in how they are cut & laid. little details you wouldn’t otherwise notice just because you have hair.",
                                            "author": "Soggy_Newspaper8798",
                                            "id": "i91w3id",
                                            "parent_id": "t1_i91rwov",
                                            "score": 2,
                                            "created_utc": 1652863944.0,
                                            "replies": [
                                                {
                                                    "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
                                                    "author": "SSPokaLink",
                                                    "id": "i91xwph",
                                                    "parent_id": "t1_i91w3id",
                                                    "score": -1,
                                                    "created_utc": 1652865636.0,
                                                    "replies": [
                                                        {
                                                            "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                                                            "author": "Soggy_Newspaper8798",
                                                            "id": "i91y2ps",
                                                            "parent_id": "t1_i91xwph",
                                                            "score": 2,
                                                            "created_utc": 1652865786.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "idk why people are roasting, u said in the best and more respectable possible way",
            "author": "Daniel-adonai",
            "id": "i8zn7le",
            "parent_id": "t1_i8zbmnb",
            "score": 7,
            "created_utc": 1652818978.0,
            "replies": [
                {
                    "body": "Freal it's not like he was being disrespectful or anything and people are getting mad over it",
                    "author": "Erabuokino",
                    "id": "i8zouhi",
                    "parent_id": "t1_i8zn7le",
                    "score": 2,
                    "created_utc": 1652819664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "fair enough i guess, i think it looks good. if you're muscular  you can rock long hair and look masculine af though",
            "author": null,
            "id": "i8zsyx5",
            "parent_id": "t1_i8zbmnb",
            "score": 4,
            "created_utc": 1652821376.0,
            "replies": []
        },
        {
            "body": "You ever think someone is comfortable enough in their masculinity to wear feminine traits? \n\nSorry chief but not all of us are insecure about our gender expression",
            "author": "russsaa",
            "id": "i8zippp",
            "parent_id": "t1_i8zbmnb",
            "score": 5,
            "created_utc": 1652817114.0,
            "replies": [
                {
                    "body": "ok",
                    "author": "-DeadLock",
                    "id": "i8ziswb",
                    "parent_id": "t1_i8zippp",
                    "score": -4,
                    "created_utc": 1652817150.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mad that he's pulling more girls than you huh",
            "author": "MythicExplorer",
            "id": "i8zg845",
            "parent_id": "t1_i8zbmnb",
            "score": 2,
            "created_utc": 1652816090.0,
            "replies": [
                {
                    "body": "I pull exactly 0 bitches my guy",
                    "author": "Thunderingthought",
                    "id": "i8zyj8h",
                    "parent_id": "t1_i8zg845",
                    "score": 15,
                    "created_utc": 1652823756.0,
                    "replies": [
                        {
                            "body": "You're also 16 and probably unsure of yourself around then still, if my senses are accurate\n\nYou have plenty of time to slay\n\nAnd honestly fucking up, learning from it, and being better next time is part of the fun",
                            "author": "mistahARK",
                            "id": "i90251j",
                            "parent_id": "t1_i8zyj8h",
                            "score": 9,
                            "created_utc": 1652825351.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh wow you nailed it. I get 0 bitches",
                    "author": "-DeadLock",
                    "id": "i8zgcl8",
                    "parent_id": "t1_i8zg845",
                    "score": 4,
                    "created_utc": 1652816141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People think I’m a girl when I do that though ):",
            "author": "Thunderingthought",
            "id": "i90l2li",
            "parent_id": "t1_i90c07w",
            "score": 2,
            "created_utc": 1652834298.0,
            "replies": [
                {
                    "body": "People will make that mistake regardless that’s one of the consequences of being a a man with long hair. I can attest from personal experience",
                    "author": "Vulcan_Jedi",
                    "id": "i90sslc",
                    "parent_id": "t1_i90l2li",
                    "score": 2,
                    "created_utc": 1652837934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "16 inches of hair? what else is 16 inches?",
            "author": "lalabaya12",
            "id": "jf5jatz",
            "parent_id": "t1_i91ryjh",
            "score": 1,
            "created_utc": 1680760467.0,
            "replies": []
        },
        {
            "body": "Pretty good looking chick if you ask me",
            "author": "Ok_Song4610",
            "id": "i91g2u3",
            "parent_id": "t1_i8zv9ek",
            "score": 0,
            "created_utc": 1652850549.0,
            "replies": []
        },
        {
            "body": "I’m bisexual so I’m ok with being effeminate",
            "author": "Thunderingthought",
            "id": "i924heh",
            "parent_id": "t1_i90qj7d",
            "score": 1,
            "created_utc": 1652871206.0,
            "replies": []
        },
        {
            "body": "Crossbow 😳",
            "author": "Thunderingthought",
            "id": "i90l15g",
            "parent_id": "t1_i9042mg",
            "score": 4,
            "created_utc": 1652834280.0,
            "replies": []
        },
        {
            "body": "Both my friend",
            "author": "Thunderingthought",
            "id": "i924a6a",
            "parent_id": "t1_i918ax4",
            "score": 1,
            "created_utc": 1652871057.0,
            "replies": []
        },
        {
            "body": "I haven’t cut my hair in over a year lmao, I’m gonna go longer",
            "author": "Thunderingthought",
            "id": "i924cq9",
            "parent_id": "t1_i91deax",
            "score": 2,
            "created_utc": 1652871109.0,
            "replies": []
        },
        {
            "body": "I might switch teams just to have hair on my head",
            "author": "CeleryNo1743",
            "id": "i8zafmg",
            "parent_id": "t1_i8za2k3",
            "score": 44,
            "created_utc": 1652813722.0,
            "replies": [
                {
                    "body": "Probably be getting more bitches too",
                    "author": "x_frame",
                    "id": "i8zapl6",
                    "parent_id": "t1_i8zafmg",
                    "score": 22,
                    "created_utc": 1652813837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You guys are brutal. The kid is 16. Just a freshly cut rose.",
            "author": "MooseleaderMusic",
            "id": "i90docz",
            "parent_id": "t1_i8zqxx4",
            "score": 42,
            "created_utc": 1652830755.0,
            "replies": [
                {
                    "body": "He's gorgeous and needs to know it so he can break hearts and get the best jobs lol.",
                    "author": "8Ariadnesthread8",
                    "id": "i90fgpq",
                    "parent_id": "t1_i90docz",
                    "score": 40,
                    "created_utc": 1652831621.0,
                    "replies": [
                        {
                            "body": "All roses wither",
                            "author": "MooseleaderMusic",
                            "id": "i91bh18",
                            "parent_id": "t1_i90fgpq",
                            "score": 1,
                            "created_utc": 1652847548.0,
                            "replies": [
                                {
                                    "body": "Tell that to Helen mirren.",
                                    "author": "8Ariadnesthread8",
                                    "id": "i92lii3",
                                    "parent_id": "t1_i91bh18",
                                    "score": 5,
                                    "created_utc": 1652880983.0,
                                    "replies": [
                                        {
                                            "body": "I will. I tried to tell it to Betty White the other day.",
                                            "author": "MooseleaderMusic",
                                            "id": "i95obcl",
                                            "parent_id": "t1_i92lii3",
                                            "score": 1,
                                            "created_utc": 1652928875.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He didn’t come here for comments on his sexuality. The boy is a minor",
            "author": "entredeuxeaux",
            "id": "i9283u4",
            "parent_id": "t1_i8zqxx4",
            "score": 19,
            "created_utc": 1652873711.0,
            "replies": []
        },
        {
            "body": "im a bi girl and true",
            "author": "rotten_milk420",
            "id": "id6f2qa",
            "parent_id": "t1_i92r3rc",
            "score": 2,
            "created_utc": 1655817031.0,
            "replies": []
        },
        {
            "body": "Win the genetic lottery basically. You basically have a 60-70% chance to experience some form of hair loss by the time you are 30. \n\nYou will likely have you hairline “settle” and pull back a bit, usually on the sides when you are around 18 to early 20s, this is normal. Most guys will have it stop at that point till they are mid to late 20s/early 30s where thinning(not necessarily balding) can happen. In my case, when my hairline started to settle in college, it didn’t stop and I slowly started to grow an island of skin in the back by the time I was 27. I owned it and shaved my head clean, and honestly it looks good.",
            "author": "CubbyNINJA",
            "id": "i8zhpp9",
            "parent_id": "t1_i8zg7s0",
            "score": 33,
            "created_utc": 1652816702.0,
            "replies": [
                {
                    "body": "Good example of the sucky genes, I’m thinning out significantly at 16. Not much I can do, just the horrid genetics. Luckily I have a nice jawline, I never really got to enjoy my hair.",
                    "author": "somestreamerguy1",
                    "id": "i911ie3",
                    "parent_id": "t1_i8zhpp9",
                    "score": 3,
                    "created_utc": 1652842099.0,
                    "replies": []
                },
                {
                    "body": "Taking supplements and eating a healthy diet won’t help? My daddy is bald not fully but he started balding way before my age and I have a good hairline but kinda wide on the sides",
                    "author": "Visible-Employer-773",
                    "id": "i8zia0z",
                    "parent_id": "t1_i8zhpp9",
                    "score": 6,
                    "created_utc": 1652816935.0,
                    "replies": [
                        {
                            "body": "I mean yeah, it all helps. But if your genes suck, they suck lol \n\nAlso male pattern baldness is often passed along from a gene given to you by your mother",
                            "author": "CubbyNINJA",
                            "id": "i8ziy8z",
                            "parent_id": "t1_i8zia0z",
                            "score": 13,
                            "created_utc": 1652817212.0,
                            "replies": [
                                {
                                    "body": "Yeah I was told the mother part my uncles have great hairlines(expect for one due to stress) and grandpa too and my mom has a great hairline too I hope I don’t go fully bald",
                                    "author": "Visible-Employer-773",
                                    "id": "i8zkqr5",
                                    "parent_id": "t1_i8ziy8z",
                                    "score": 5,
                                    "created_utc": 1652817953.0,
                                    "replies": [
                                        {
                                            "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
                                            "author": "MoreFadesMoreBaes",
                                            "id": "i90rdx8",
                                            "parent_id": "t1_i8zkqr5",
                                            "score": 7,
                                            "created_utc": 1652837273.0,
                                            "replies": [
                                                {
                                                    "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                                                    "author": "MoreFadesMoreBaes",
                                                    "id": "i90rier",
                                                    "parent_id": "t1_i90rdx8",
                                                    "score": 3,
                                                    "created_utc": 1652837331.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                                                    "author": "Visible-Employer-773",
                                                    "id": "i91onkl",
                                                    "parent_id": "t1_i90rdx8",
                                                    "score": 2,
                                                    "created_utc": 1652857167.0,
                                                    "replies": [
                                                        {
                                                            "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                                                            "author": "WillfulMurder",
                                                            "id": "i92btcb",
                                                            "parent_id": "t1_i91onkl",
                                                            "score": 4,
                                                            "created_utc": 1652875980.0,
                                                            "replies": [
                                                                {
                                                                    "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                                                    "author": "Illustrious_Pin_2084",
                                                                    "id": "ib7ob5f",
                                                                    "parent_id": "t1_i92btcb",
                                                                    "score": 2,
                                                                    "created_utc": 1654397932.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                                                            "author": "Supersquigi",
                                                            "id": "i92nnek",
                                                            "parent_id": "t1_i91onkl",
                                                            "score": 1,
                                                            "created_utc": 1652881979.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                                                            "author": "MoreFadesMoreBaes",
                                                            "id": "i931w5x",
                                                            "parent_id": "t1_i91onkl",
                                                            "score": 1,
                                                            "created_utc": 1652888060.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                                                    "author": "Visible-Employer-773",
                                                                    "id": "i93f9lr",
                                                                    "parent_id": "t1_i931w5x",
                                                                    "score": 1,
                                                                    "created_utc": 1652893465.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                                                            "author": "MoreFadesMoreBaes",
                                                                            "id": "i93fm03",
                                                                            "parent_id": "t1_i93f9lr",
                                                                            "score": 2,
                                                                            "created_utc": 1652893603.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
                                            "author": "MoreFadesMoreBaes",
                                            "id": "i92yaob",
                                            "parent_id": "t1_i8zkqr5",
                                            "score": 2,
                                            "created_utc": 1652886584.0,
                                            "replies": [
                                                {
                                                    "body": "Probably",
                                                    "author": "Visible-Employer-773",
                                                    "id": "i93f2zj",
                                                    "parent_id": "t1_i92yaob",
                                                    "score": 1,
                                                    "created_utc": 1652893391.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Finasteride/propecia",
            "author": "Flaffelll",
            "id": "i90oryf",
            "parent_id": "t1_i8zg7s0",
            "score": 2,
            "created_utc": 1652836039.0,
            "replies": []
        },
        {
            "body": "Just search ‘wire headband’ on Amazon and it’s the first option, 7.99 for 3",
            "author": "whaleweaves",
            "id": "ics8c50",
            "parent_id": "t1_ics7xzq",
            "score": 1,
            "created_utc": 1655515389.0,
            "replies": [
                {
                    "body": "The wavy one?",
                    "author": "phazeight",
                    "id": "ics95q6",
                    "parent_id": "t1_ics8c50",
                    "score": 1,
                    "created_utc": 1655515826.0,
                    "replies": [
                        {
                            "body": "Yup, that’s the one",
                            "author": "whaleweaves",
                            "id": "ics97u1",
                            "parent_id": "t1_ics95q6",
                            "score": 1,
                            "created_utc": 1655515857.0,
                            "replies": [
                                {
                                    "body": "Ty",
                                    "author": "phazeight",
                                    "id": "icsc6e0",
                                    "parent_id": "t1_ics97u1",
                                    "score": 1,
                                    "created_utc": 1655517486.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear about dad. Your mom is wrong tho. I think personally youd need to cut maybe an inch or two off to get what you want. Idk tho. Search \"mid length hair men\" (or long length hair men) look for men with similar  shape as you. (Not face, face shape IE contour). Maybe even take an hour two to to go thru pics. Save 5 or 6 and bring it to barber. Good luck man",
            "author": "-DeadLock",
            "id": "i900mes",
            "parent_id": "t1_i8zzj9f",
            "score": 4,
            "created_utc": 1652824675.0,
            "replies": []
        },
        {
            "body": "Idk what the other guy is talking about. People who think hair is feminine or masculine are silly. If your hair is pretty that doesn't make you feminine. Lots of chicks dig pretty boys.\n\nI have long, thick curly hair that forms coils, and from behind I get mistaken as a woman sometimes and nothing is going to change that.\n\nRock what you want my dude.",
            "author": "SSPokaLink",
            "id": "i91lwq5",
            "parent_id": "t1_i8zzj9f",
            "score": 2,
            "created_utc": 1652854900.0,
            "replies": [
                {
                    "body": "i’m a barber, there is 100% a difference.",
                    "author": "Soggy_Newspaper8798",
                    "id": "i91pcji",
                    "parent_id": "t1_i91lwq5",
                    "score": 0,
                    "created_utc": 1652857748.0,
                    "replies": [
                        {
                            "body": "Ok. Well I'm a person who has hair.",
                            "author": "SSPokaLink",
                            "id": "i91rwov",
                            "parent_id": "t1_i91pcji",
                            "score": 0,
                            "created_utc": 1652860019.0,
                            "replies": [
                                {
                                    "body": "okay? so do most people. that doesn’t mean you understand. \n\nthere has always been a difference, it’s only due to genders switching over on styles that it has become more “same same”. yet when i do a woman’s haircut in my shop, i will still give her the triangular sideburns, a more natural hairline, different volume of layers. a whole plethora of things, unless she asks otherwise. same goes for a man. \n\nmullets are a good example of this, female & male mullets are very different in how they are cut & laid. little details you wouldn’t otherwise notice just because you have hair.",
                                    "author": "Soggy_Newspaper8798",
                                    "id": "i91w3id",
                                    "parent_id": "t1_i91rwov",
                                    "score": 2,
                                    "created_utc": 1652863944.0,
                                    "replies": [
                                        {
                                            "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
                                            "author": "SSPokaLink",
                                            "id": "i91xwph",
                                            "parent_id": "t1_i91w3id",
                                            "score": -1,
                                            "created_utc": 1652865636.0,
                                            "replies": [
                                                {
                                                    "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                                                    "author": "Soggy_Newspaper8798",
                                                    "id": "i91y2ps",
                                                    "parent_id": "t1_i91xwph",
                                                    "score": 2,
                                                    "created_utc": 1652865786.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Freal it's not like he was being disrespectful or anything and people are getting mad over it",
            "author": "Erabuokino",
            "id": "i8zouhi",
            "parent_id": "t1_i8zn7le",
            "score": 2,
            "created_utc": 1652819664.0,
            "replies": []
        },
        {
            "body": "ok",
            "author": "-DeadLock",
            "id": "i8ziswb",
            "parent_id": "t1_i8zippp",
            "score": -4,
            "created_utc": 1652817150.0,
            "replies": []
        },
        {
            "body": "I pull exactly 0 bitches my guy",
            "author": "Thunderingthought",
            "id": "i8zyj8h",
            "parent_id": "t1_i8zg845",
            "score": 15,
            "created_utc": 1652823756.0,
            "replies": [
                {
                    "body": "You're also 16 and probably unsure of yourself around then still, if my senses are accurate\n\nYou have plenty of time to slay\n\nAnd honestly fucking up, learning from it, and being better next time is part of the fun",
                    "author": "mistahARK",
                    "id": "i90251j",
                    "parent_id": "t1_i8zyj8h",
                    "score": 9,
                    "created_utc": 1652825351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh wow you nailed it. I get 0 bitches",
            "author": "-DeadLock",
            "id": "i8zgcl8",
            "parent_id": "t1_i8zg845",
            "score": 4,
            "created_utc": 1652816141.0,
            "replies": []
        },
        {
            "body": "People will make that mistake regardless that’s one of the consequences of being a a man with long hair. I can attest from personal experience",
            "author": "Vulcan_Jedi",
            "id": "i90sslc",
            "parent_id": "t1_i90l2li",
            "score": 2,
            "created_utc": 1652837934.0,
            "replies": []
        },
        {
            "body": "Probably be getting more bitches too",
            "author": "x_frame",
            "id": "i8zapl6",
            "parent_id": "t1_i8zafmg",
            "score": 22,
            "created_utc": 1652813837.0,
            "replies": []
        },
        {
            "body": "He's gorgeous and needs to know it so he can break hearts and get the best jobs lol.",
            "author": "8Ariadnesthread8",
            "id": "i90fgpq",
            "parent_id": "t1_i90docz",
            "score": 40,
            "created_utc": 1652831621.0,
            "replies": [
                {
                    "body": "All roses wither",
                    "author": "MooseleaderMusic",
                    "id": "i91bh18",
                    "parent_id": "t1_i90fgpq",
                    "score": 1,
                    "created_utc": 1652847548.0,
                    "replies": [
                        {
                            "body": "Tell that to Helen mirren.",
                            "author": "8Ariadnesthread8",
                            "id": "i92lii3",
                            "parent_id": "t1_i91bh18",
                            "score": 5,
                            "created_utc": 1652880983.0,
                            "replies": [
                                {
                                    "body": "I will. I tried to tell it to Betty White the other day.",
                                    "author": "MooseleaderMusic",
                                    "id": "i95obcl",
                                    "parent_id": "t1_i92lii3",
                                    "score": 1,
                                    "created_utc": 1652928875.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good example of the sucky genes, I’m thinning out significantly at 16. Not much I can do, just the horrid genetics. Luckily I have a nice jawline, I never really got to enjoy my hair.",
            "author": "somestreamerguy1",
            "id": "i911ie3",
            "parent_id": "t1_i8zhpp9",
            "score": 3,
            "created_utc": 1652842099.0,
            "replies": []
        },
        {
            "body": "Taking supplements and eating a healthy diet won’t help? My daddy is bald not fully but he started balding way before my age and I have a good hairline but kinda wide on the sides",
            "author": "Visible-Employer-773",
            "id": "i8zia0z",
            "parent_id": "t1_i8zhpp9",
            "score": 6,
            "created_utc": 1652816935.0,
            "replies": [
                {
                    "body": "I mean yeah, it all helps. But if your genes suck, they suck lol \n\nAlso male pattern baldness is often passed along from a gene given to you by your mother",
                    "author": "CubbyNINJA",
                    "id": "i8ziy8z",
                    "parent_id": "t1_i8zia0z",
                    "score": 13,
                    "created_utc": 1652817212.0,
                    "replies": [
                        {
                            "body": "Yeah I was told the mother part my uncles have great hairlines(expect for one due to stress) and grandpa too and my mom has a great hairline too I hope I don’t go fully bald",
                            "author": "Visible-Employer-773",
                            "id": "i8zkqr5",
                            "parent_id": "t1_i8ziy8z",
                            "score": 5,
                            "created_utc": 1652817953.0,
                            "replies": [
                                {
                                    "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
                                    "author": "MoreFadesMoreBaes",
                                    "id": "i90rdx8",
                                    "parent_id": "t1_i8zkqr5",
                                    "score": 7,
                                    "created_utc": 1652837273.0,
                                    "replies": [
                                        {
                                            "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                                            "author": "MoreFadesMoreBaes",
                                            "id": "i90rier",
                                            "parent_id": "t1_i90rdx8",
                                            "score": 3,
                                            "created_utc": 1652837331.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                                            "author": "Visible-Employer-773",
                                            "id": "i91onkl",
                                            "parent_id": "t1_i90rdx8",
                                            "score": 2,
                                            "created_utc": 1652857167.0,
                                            "replies": [
                                                {
                                                    "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                                                    "author": "WillfulMurder",
                                                    "id": "i92btcb",
                                                    "parent_id": "t1_i91onkl",
                                                    "score": 4,
                                                    "created_utc": 1652875980.0,
                                                    "replies": [
                                                        {
                                                            "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                                            "author": "Illustrious_Pin_2084",
                                                            "id": "ib7ob5f",
                                                            "parent_id": "t1_i92btcb",
                                                            "score": 2,
                                                            "created_utc": 1654397932.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                                                    "author": "Supersquigi",
                                                    "id": "i92nnek",
                                                    "parent_id": "t1_i91onkl",
                                                    "score": 1,
                                                    "created_utc": 1652881979.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                                                    "author": "MoreFadesMoreBaes",
                                                    "id": "i931w5x",
                                                    "parent_id": "t1_i91onkl",
                                                    "score": 1,
                                                    "created_utc": 1652888060.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                                            "author": "Visible-Employer-773",
                                                            "id": "i93f9lr",
                                                            "parent_id": "t1_i931w5x",
                                                            "score": 1,
                                                            "created_utc": 1652893465.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                                                    "author": "MoreFadesMoreBaes",
                                                                    "id": "i93fm03",
                                                                    "parent_id": "t1_i93f9lr",
                                                                    "score": 2,
                                                                    "created_utc": 1652893603.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
                                    "author": "MoreFadesMoreBaes",
                                    "id": "i92yaob",
                                    "parent_id": "t1_i8zkqr5",
                                    "score": 2,
                                    "created_utc": 1652886584.0,
                                    "replies": [
                                        {
                                            "body": "Probably",
                                            "author": "Visible-Employer-773",
                                            "id": "i93f2zj",
                                            "parent_id": "t1_i92yaob",
                                            "score": 1,
                                            "created_utc": 1652893391.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The wavy one?",
            "author": "phazeight",
            "id": "ics95q6",
            "parent_id": "t1_ics8c50",
            "score": 1,
            "created_utc": 1655515826.0,
            "replies": [
                {
                    "body": "Yup, that’s the one",
                    "author": "whaleweaves",
                    "id": "ics97u1",
                    "parent_id": "t1_ics95q6",
                    "score": 1,
                    "created_utc": 1655515857.0,
                    "replies": [
                        {
                            "body": "Ty",
                            "author": "phazeight",
                            "id": "icsc6e0",
                            "parent_id": "t1_ics97u1",
                            "score": 1,
                            "created_utc": 1655517486.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i’m a barber, there is 100% a difference.",
            "author": "Soggy_Newspaper8798",
            "id": "i91pcji",
            "parent_id": "t1_i91lwq5",
            "score": 0,
            "created_utc": 1652857748.0,
            "replies": [
                {
                    "body": "Ok. Well I'm a person who has hair.",
                    "author": "SSPokaLink",
                    "id": "i91rwov",
                    "parent_id": "t1_i91pcji",
                    "score": 0,
                    "created_utc": 1652860019.0,
                    "replies": [
                        {
                            "body": "okay? so do most people. that doesn’t mean you understand. \n\nthere has always been a difference, it’s only due to genders switching over on styles that it has become more “same same”. yet when i do a woman’s haircut in my shop, i will still give her the triangular sideburns, a more natural hairline, different volume of layers. a whole plethora of things, unless she asks otherwise. same goes for a man. \n\nmullets are a good example of this, female & male mullets are very different in how they are cut & laid. little details you wouldn’t otherwise notice just because you have hair.",
                            "author": "Soggy_Newspaper8798",
                            "id": "i91w3id",
                            "parent_id": "t1_i91rwov",
                            "score": 2,
                            "created_utc": 1652863944.0,
                            "replies": [
                                {
                                    "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
                                    "author": "SSPokaLink",
                                    "id": "i91xwph",
                                    "parent_id": "t1_i91w3id",
                                    "score": -1,
                                    "created_utc": 1652865636.0,
                                    "replies": [
                                        {
                                            "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                                            "author": "Soggy_Newspaper8798",
                                            "id": "i91y2ps",
                                            "parent_id": "t1_i91xwph",
                                            "score": 2,
                                            "created_utc": 1652865786.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're also 16 and probably unsure of yourself around then still, if my senses are accurate\n\nYou have plenty of time to slay\n\nAnd honestly fucking up, learning from it, and being better next time is part of the fun",
            "author": "mistahARK",
            "id": "i90251j",
            "parent_id": "t1_i8zyj8h",
            "score": 9,
            "created_utc": 1652825351.0,
            "replies": []
        },
        {
            "body": "All roses wither",
            "author": "MooseleaderMusic",
            "id": "i91bh18",
            "parent_id": "t1_i90fgpq",
            "score": 1,
            "created_utc": 1652847548.0,
            "replies": [
                {
                    "body": "Tell that to Helen mirren.",
                    "author": "8Ariadnesthread8",
                    "id": "i92lii3",
                    "parent_id": "t1_i91bh18",
                    "score": 5,
                    "created_utc": 1652880983.0,
                    "replies": [
                        {
                            "body": "I will. I tried to tell it to Betty White the other day.",
                            "author": "MooseleaderMusic",
                            "id": "i95obcl",
                            "parent_id": "t1_i92lii3",
                            "score": 1,
                            "created_utc": 1652928875.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean yeah, it all helps. But if your genes suck, they suck lol \n\nAlso male pattern baldness is often passed along from a gene given to you by your mother",
            "author": "CubbyNINJA",
            "id": "i8ziy8z",
            "parent_id": "t1_i8zia0z",
            "score": 13,
            "created_utc": 1652817212.0,
            "replies": [
                {
                    "body": "Yeah I was told the mother part my uncles have great hairlines(expect for one due to stress) and grandpa too and my mom has a great hairline too I hope I don’t go fully bald",
                    "author": "Visible-Employer-773",
                    "id": "i8zkqr5",
                    "parent_id": "t1_i8ziy8z",
                    "score": 5,
                    "created_utc": 1652817953.0,
                    "replies": [
                        {
                            "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
                            "author": "MoreFadesMoreBaes",
                            "id": "i90rdx8",
                            "parent_id": "t1_i8zkqr5",
                            "score": 7,
                            "created_utc": 1652837273.0,
                            "replies": [
                                {
                                    "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                                    "author": "MoreFadesMoreBaes",
                                    "id": "i90rier",
                                    "parent_id": "t1_i90rdx8",
                                    "score": 3,
                                    "created_utc": 1652837331.0,
                                    "replies": []
                                },
                                {
                                    "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                                    "author": "Visible-Employer-773",
                                    "id": "i91onkl",
                                    "parent_id": "t1_i90rdx8",
                                    "score": 2,
                                    "created_utc": 1652857167.0,
                                    "replies": [
                                        {
                                            "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                                            "author": "WillfulMurder",
                                            "id": "i92btcb",
                                            "parent_id": "t1_i91onkl",
                                            "score": 4,
                                            "created_utc": 1652875980.0,
                                            "replies": [
                                                {
                                                    "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                                    "author": "Illustrious_Pin_2084",
                                                    "id": "ib7ob5f",
                                                    "parent_id": "t1_i92btcb",
                                                    "score": 2,
                                                    "created_utc": 1654397932.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                                            "author": "Supersquigi",
                                            "id": "i92nnek",
                                            "parent_id": "t1_i91onkl",
                                            "score": 1,
                                            "created_utc": 1652881979.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                                            "author": "MoreFadesMoreBaes",
                                            "id": "i931w5x",
                                            "parent_id": "t1_i91onkl",
                                            "score": 1,
                                            "created_utc": 1652888060.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                                    "author": "Visible-Employer-773",
                                                    "id": "i93f9lr",
                                                    "parent_id": "t1_i931w5x",
                                                    "score": 1,
                                                    "created_utc": 1652893465.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                                            "author": "MoreFadesMoreBaes",
                                                            "id": "i93fm03",
                                                            "parent_id": "t1_i93f9lr",
                                                            "score": 2,
                                                            "created_utc": 1652893603.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
                            "author": "MoreFadesMoreBaes",
                            "id": "i92yaob",
                            "parent_id": "t1_i8zkqr5",
                            "score": 2,
                            "created_utc": 1652886584.0,
                            "replies": [
                                {
                                    "body": "Probably",
                                    "author": "Visible-Employer-773",
                                    "id": "i93f2zj",
                                    "parent_id": "t1_i92yaob",
                                    "score": 1,
                                    "created_utc": 1652893391.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, that’s the one",
            "author": "whaleweaves",
            "id": "ics97u1",
            "parent_id": "t1_ics95q6",
            "score": 1,
            "created_utc": 1655515857.0,
            "replies": [
                {
                    "body": "Ty",
                    "author": "phazeight",
                    "id": "icsc6e0",
                    "parent_id": "t1_ics97u1",
                    "score": 1,
                    "created_utc": 1655517486.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok. Well I'm a person who has hair.",
            "author": "SSPokaLink",
            "id": "i91rwov",
            "parent_id": "t1_i91pcji",
            "score": 0,
            "created_utc": 1652860019.0,
            "replies": [
                {
                    "body": "okay? so do most people. that doesn’t mean you understand. \n\nthere has always been a difference, it’s only due to genders switching over on styles that it has become more “same same”. yet when i do a woman’s haircut in my shop, i will still give her the triangular sideburns, a more natural hairline, different volume of layers. a whole plethora of things, unless she asks otherwise. same goes for a man. \n\nmullets are a good example of this, female & male mullets are very different in how they are cut & laid. little details you wouldn’t otherwise notice just because you have hair.",
                    "author": "Soggy_Newspaper8798",
                    "id": "i91w3id",
                    "parent_id": "t1_i91rwov",
                    "score": 2,
                    "created_utc": 1652863944.0,
                    "replies": [
                        {
                            "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
                            "author": "SSPokaLink",
                            "id": "i91xwph",
                            "parent_id": "t1_i91w3id",
                            "score": -1,
                            "created_utc": 1652865636.0,
                            "replies": [
                                {
                                    "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                                    "author": "Soggy_Newspaper8798",
                                    "id": "i91y2ps",
                                    "parent_id": "t1_i91xwph",
                                    "score": 2,
                                    "created_utc": 1652865786.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tell that to Helen mirren.",
            "author": "8Ariadnesthread8",
            "id": "i92lii3",
            "parent_id": "t1_i91bh18",
            "score": 5,
            "created_utc": 1652880983.0,
            "replies": [
                {
                    "body": "I will. I tried to tell it to Betty White the other day.",
                    "author": "MooseleaderMusic",
                    "id": "i95obcl",
                    "parent_id": "t1_i92lii3",
                    "score": 1,
                    "created_utc": 1652928875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I was told the mother part my uncles have great hairlines(expect for one due to stress) and grandpa too and my mom has a great hairline too I hope I don’t go fully bald",
            "author": "Visible-Employer-773",
            "id": "i8zkqr5",
            "parent_id": "t1_i8ziy8z",
            "score": 5,
            "created_utc": 1652817953.0,
            "replies": [
                {
                    "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
                    "author": "MoreFadesMoreBaes",
                    "id": "i90rdx8",
                    "parent_id": "t1_i8zkqr5",
                    "score": 7,
                    "created_utc": 1652837273.0,
                    "replies": [
                        {
                            "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                            "author": "MoreFadesMoreBaes",
                            "id": "i90rier",
                            "parent_id": "t1_i90rdx8",
                            "score": 3,
                            "created_utc": 1652837331.0,
                            "replies": []
                        },
                        {
                            "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                            "author": "Visible-Employer-773",
                            "id": "i91onkl",
                            "parent_id": "t1_i90rdx8",
                            "score": 2,
                            "created_utc": 1652857167.0,
                            "replies": [
                                {
                                    "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                                    "author": "WillfulMurder",
                                    "id": "i92btcb",
                                    "parent_id": "t1_i91onkl",
                                    "score": 4,
                                    "created_utc": 1652875980.0,
                                    "replies": [
                                        {
                                            "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                            "author": "Illustrious_Pin_2084",
                                            "id": "ib7ob5f",
                                            "parent_id": "t1_i92btcb",
                                            "score": 2,
                                            "created_utc": 1654397932.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                                    "author": "Supersquigi",
                                    "id": "i92nnek",
                                    "parent_id": "t1_i91onkl",
                                    "score": 1,
                                    "created_utc": 1652881979.0,
                                    "replies": []
                                },
                                {
                                    "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                                    "author": "MoreFadesMoreBaes",
                                    "id": "i931w5x",
                                    "parent_id": "t1_i91onkl",
                                    "score": 1,
                                    "created_utc": 1652888060.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                            "author": "Visible-Employer-773",
                                            "id": "i93f9lr",
                                            "parent_id": "t1_i931w5x",
                                            "score": 1,
                                            "created_utc": 1652893465.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                                    "author": "MoreFadesMoreBaes",
                                                    "id": "i93fm03",
                                                    "parent_id": "t1_i93f9lr",
                                                    "score": 2,
                                                    "created_utc": 1652893603.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
                    "author": "MoreFadesMoreBaes",
                    "id": "i92yaob",
                    "parent_id": "t1_i8zkqr5",
                    "score": 2,
                    "created_utc": 1652886584.0,
                    "replies": [
                        {
                            "body": "Probably",
                            "author": "Visible-Employer-773",
                            "id": "i93f2zj",
                            "parent_id": "t1_i92yaob",
                            "score": 1,
                            "created_utc": 1652893391.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ty",
            "author": "phazeight",
            "id": "icsc6e0",
            "parent_id": "t1_ics97u1",
            "score": 1,
            "created_utc": 1655517486.0,
            "replies": []
        },
        {
            "body": "okay? so do most people. that doesn’t mean you understand. \n\nthere has always been a difference, it’s only due to genders switching over on styles that it has become more “same same”. yet when i do a woman’s haircut in my shop, i will still give her the triangular sideburns, a more natural hairline, different volume of layers. a whole plethora of things, unless she asks otherwise. same goes for a man. \n\nmullets are a good example of this, female & male mullets are very different in how they are cut & laid. little details you wouldn’t otherwise notice just because you have hair.",
            "author": "Soggy_Newspaper8798",
            "id": "i91w3id",
            "parent_id": "t1_i91rwov",
            "score": 2,
            "created_utc": 1652863944.0,
            "replies": [
                {
                    "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
                    "author": "SSPokaLink",
                    "id": "i91xwph",
                    "parent_id": "t1_i91w3id",
                    "score": -1,
                    "created_utc": 1652865636.0,
                    "replies": [
                        {
                            "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                            "author": "Soggy_Newspaper8798",
                            "id": "i91y2ps",
                            "parent_id": "t1_i91xwph",
                            "score": 2,
                            "created_utc": 1652865786.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I will. I tried to tell it to Betty White the other day.",
            "author": "MooseleaderMusic",
            "id": "i95obcl",
            "parent_id": "t1_i92lii3",
            "score": 1,
            "created_utc": 1652928875.0,
            "replies": []
        },
        {
            "body": "I am your savior here I am what you are looking for brotha :) you will go bald like them unless you start taking finasteride it is a 5 -Ar inhibitor that decreases your DHT and prevents hair loss and stops it in it’s tracks it’s fda approved too there is a 2-3% chance it could give you erectile dysfunction but in my opinion it’s worth it also the next best thing is minoxidil you don’t even need a prescription for it but that doesn’t stop hair loss it make your follicles thicker and makes it grow faster but it doesn’t prevent any hair loss also don’t take creative or you’ll bald faster because it increases dht stay up king",
            "author": "MoreFadesMoreBaes",
            "id": "i90rdx8",
            "parent_id": "t1_i8zkqr5",
            "score": 7,
            "created_utc": 1652837273.0,
            "replies": [
                {
                    "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
                    "author": "MoreFadesMoreBaes",
                    "id": "i90rier",
                    "parent_id": "t1_i90rdx8",
                    "score": 3,
                    "created_utc": 1652837331.0,
                    "replies": []
                },
                {
                    "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
                    "author": "Visible-Employer-773",
                    "id": "i91onkl",
                    "parent_id": "t1_i90rdx8",
                    "score": 2,
                    "created_utc": 1652857167.0,
                    "replies": [
                        {
                            "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                            "author": "WillfulMurder",
                            "id": "i92btcb",
                            "parent_id": "t1_i91onkl",
                            "score": 4,
                            "created_utc": 1652875980.0,
                            "replies": [
                                {
                                    "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                                    "author": "Illustrious_Pin_2084",
                                    "id": "ib7ob5f",
                                    "parent_id": "t1_i92btcb",
                                    "score": 2,
                                    "created_utc": 1654397932.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                            "author": "Supersquigi",
                            "id": "i92nnek",
                            "parent_id": "t1_i91onkl",
                            "score": 1,
                            "created_utc": 1652881979.0,
                            "replies": []
                        },
                        {
                            "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                            "author": "MoreFadesMoreBaes",
                            "id": "i931w5x",
                            "parent_id": "t1_i91onkl",
                            "score": 1,
                            "created_utc": 1652888060.0,
                            "replies": [
                                {
                                    "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                                    "author": "Visible-Employer-773",
                                    "id": "i93f9lr",
                                    "parent_id": "t1_i931w5x",
                                    "score": 1,
                                    "created_utc": 1652893465.0,
                                    "replies": [
                                        {
                                            "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                            "author": "MoreFadesMoreBaes",
                                            "id": "i93fm03",
                                            "parent_id": "t1_i93f9lr",
                                            "score": 2,
                                            "created_utc": 1652893603.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You could be good because of your uncles so you do have a chance to not go bald for sure but the stress you part isn’t legit if people do have stress related hair loss it grows back in and it’s very rare 99% of the time it’s androgenic alopecia",
            "author": "MoreFadesMoreBaes",
            "id": "i92yaob",
            "parent_id": "t1_i8zkqr5",
            "score": 2,
            "created_utc": 1652886584.0,
            "replies": [
                {
                    "body": "Probably",
                    "author": "Visible-Employer-773",
                    "id": "i93f2zj",
                    "parent_id": "t1_i92yaob",
                    "score": 1,
                    "created_utc": 1652893391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's always been a difference? So if I walked into ancient Rome and told someone their hair was masculine or feminine they wouldn't look at me like I was crazy?\n\nJust because you cut hair doesn't make you the ultimate authority on it lol. Gendered labels on haircuts is the most contrived shit I've heard of and is 100% the product of the weirdass society we live in",
            "author": "SSPokaLink",
            "id": "i91xwph",
            "parent_id": "t1_i91w3id",
            "score": -1,
            "created_utc": 1652865636.0,
            "replies": [
                {
                    "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
                    "author": "Soggy_Newspaper8798",
                    "id": "i91y2ps",
                    "parent_id": "t1_i91xwph",
                    "score": 2,
                    "created_utc": 1652865786.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Disclaimer Not medical advice do your own research just talking to a friend on my knowledge  ^",
            "author": "MoreFadesMoreBaes",
            "id": "i90rier",
            "parent_id": "t1_i90rdx8",
            "score": 3,
            "created_utc": 1652837331.0,
            "replies": []
        },
        {
            "body": "So I can take them even if I’m not balding? Plus woah Ed yikes hope I’m not in the 2%",
            "author": "Visible-Employer-773",
            "id": "i91onkl",
            "parent_id": "t1_i90rdx8",
            "score": 2,
            "created_utc": 1652857167.0,
            "replies": [
                {
                    "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
                    "author": "WillfulMurder",
                    "id": "i92btcb",
                    "parent_id": "t1_i91onkl",
                    "score": 4,
                    "created_utc": 1652875980.0,
                    "replies": [
                        {
                            "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                            "author": "Illustrious_Pin_2084",
                            "id": "ib7ob5f",
                            "parent_id": "t1_i92btcb",
                            "score": 2,
                            "created_utc": 1654397932.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
                    "author": "Supersquigi",
                    "id": "i92nnek",
                    "parent_id": "t1_i91onkl",
                    "score": 1,
                    "created_utc": 1652881979.0,
                    "replies": []
                },
                {
                    "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
                    "author": "MoreFadesMoreBaes",
                    "id": "i931w5x",
                    "parent_id": "t1_i91onkl",
                    "score": 1,
                    "created_utc": 1652888060.0,
                    "replies": [
                        {
                            "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                            "author": "Visible-Employer-773",
                            "id": "i93f9lr",
                            "parent_id": "t1_i931w5x",
                            "score": 1,
                            "created_utc": 1652893465.0,
                            "replies": [
                                {
                                    "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                                    "author": "MoreFadesMoreBaes",
                                    "id": "i93fm03",
                                    "parent_id": "t1_i93f9lr",
                                    "score": 2,
                                    "created_utc": 1652893603.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Probably",
            "author": "Visible-Employer-773",
            "id": "i93f2zj",
            "parent_id": "t1_i92yaob",
            "score": 1,
            "created_utc": 1652893391.0,
            "replies": []
        },
        {
            "body": "google ancient rome hairstyles. there is absolutely a difference. \n\ni cut hair & have experience. i never meant what i say goes, but i have a strong understanding on it.",
            "author": "Soggy_Newspaper8798",
            "id": "i91y2ps",
            "parent_id": "t1_i91xwph",
            "score": 2,
            "created_utc": 1652865786.0,
            "replies": []
        },
        {
            "body": "I would only start finasteride when you begin to see the first signs of hair receding imo. In the rare case you do get side effects, just discontinue taking it and your body will go back to normal (the ED thing is because like 2% of men it lowered free testosterone; as DHT conversion is blocked in some cases it could signal to the body to produce less test since it's not being converted. If you go on it just monitor your test levels via blood draws every few months until you know the medication is working) \n\nMinoxidil is used for recovering/growing hair. It's best used topically, especially if you micro needle it. It's actually pretty cool, if you search around Reddit you can see a bunch of people unable to grow beards that are using it successfully for that.",
            "author": "WillfulMurder",
            "id": "i92btcb",
            "parent_id": "t1_i91onkl",
            "score": 4,
            "created_utc": 1652875980.0,
            "replies": [
                {
                    "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
                    "author": "Illustrious_Pin_2084",
                    "id": "ib7ob5f",
                    "parent_id": "t1_i92btcb",
                    "score": 2,
                    "created_utc": 1654397932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Once the hair follicle dies, that's it, so do it once your start to notice hair loss and it'll preserve what's left. You will have to take it for the rest of your life, though.",
            "author": "Supersquigi",
            "id": "i92nnek",
            "parent_id": "t1_i91onkl",
            "score": 1,
            "created_utc": 1652881979.0,
            "replies": []
        },
        {
            "body": "USUALLY  if you stop it or lower the dose it goes away and isn’t permanent yes you can take it before but it’s hard to get a dermatologist to prescribe it before they see signs I had to switch dermatologist and beg to get it because my hair is pretty good and old looks bad when slicked back and wet. It’s a preventative medication so if you let it go way back there may be no hope to recover you just have to get on top of it if you see yourself going down that road",
            "author": "MoreFadesMoreBaes",
            "id": "i931w5x",
            "parent_id": "t1_i91onkl",
            "score": 1,
            "created_utc": 1652888060.0,
            "replies": [
                {
                    "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
                    "author": "Visible-Employer-773",
                    "id": "i93f9lr",
                    "parent_id": "t1_i931w5x",
                    "score": 1,
                    "created_utc": 1652893465.0,
                    "replies": [
                        {
                            "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                            "author": "MoreFadesMoreBaes",
                            "id": "i93fm03",
                            "parent_id": "t1_i93f9lr",
                            "score": 2,
                            "created_utc": 1652893603.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A lot of people think that a 5 alpha reductase inhibitor like finasteride is going to decrease testosterone. This is simply not true at all , your testosterone does not decline when you’re on the drug, less testosterone is being converted into DHT therefore you actually have a slightly higher free testosterone reading than your normal baseline. Your testosterone does not lower, the reason why some people get erectile dysfunction and other side effects on the drug is because these people already have low testosterone and when they use something like finasteride or dutasteride to block the enzyme their low testosterone can’t pick up the slack. More Plates More Dates on YouTube explains it very thoroughly, so many people and even doctors have told me that it lowers testosterone levels and I can’t get a damn prescription for it. The fact is it DOES NOT lower testosterone, it blocks testosterone from being converted into DHT. If you get bloodwork before taking the drug and after waiting for the drug to take full effect, I guarantee you that your free testosterone levels will read higher than your base before using finasteride.",
            "author": "Illustrious_Pin_2084",
            "id": "ib7ob5f",
            "parent_id": "t1_i92btcb",
            "score": 2,
            "created_utc": 1654397932.0,
            "replies": []
        },
        {
            "body": "Thanks for all the advice man can I send u a pic of my hairline so you can see if I’m balding",
            "author": "Visible-Employer-773",
            "id": "i93f9lr",
            "parent_id": "t1_i931w5x",
            "score": 1,
            "created_utc": 1652893465.0,
            "replies": [
                {
                    "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
                    "author": "MoreFadesMoreBaes",
                    "id": "i93fm03",
                    "parent_id": "t1_i93f9lr",
                    "score": 2,
                    "created_utc": 1652893603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah go for it but if you have an old pic of yourself that would be the best to compare it to because some people just have naturally higher up hairlines but if when you were younger it was further down it’ll be obvious",
            "author": "MoreFadesMoreBaes",
            "id": "i93fm03",
            "parent_id": "t1_i93f9lr",
            "score": 2,
            "created_utc": 1652893603.0,
            "replies": []
        }
    ]
}