{
    "title": "To those who say nothing has changed on Seeking.",
    "post_id": "stvjdq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/stvjdq/to_those_who_say_nothing_has_changed_on_seeking/",
    "author": "Whale_SD",
    "body": "",
    "url": "https://i.imgur.com/e7JIGp7.jpg",
    "score": 109,
    "upvote_ratio": 0.92,
    "created_utc": 1645016995.0,
    "num_comments": 121,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "They've been warning about sharing banking information and have banned people for discussing Pay Per Meet for years.   There is no reason to discuss PPM on the site.  You can simply say that you understand financial support is part of the expectation and only go into more detail once you have moved communications off the site.  I don't use the SA jargon and would never use the term PPM.  I usually describe that I start an arrangement on a per date allowance and that we can discuss transitioning to a periodic allowance after we have been dating a while and built trust.   It's rarely been an issue.\n\nSA has definitetly been declining, but that is mostly due to all of the \"Bad Actors\" that are scaring legitimate SBs and SDs away from the site.",
            "author": "willfromvb",
            "id": "hx63g03",
            "parent_id": "t3_stvjdq",
            "score": 78,
            "created_utc": 1645017492.0,
            "replies": [
                {
                    "body": "“Per date allowance” and “periodic allowance” are great terms!",
                    "author": "Gee_n_tonic",
                    "id": "hx694kd",
                    "parent_id": "t1_hx63g03",
                    "score": 23,
                    "created_utc": 1645020246.0,
                    "replies": [
                        {
                            "body": "Was “allowance” never a controversial word?  What are the women doing to get the “allowance?”\n\nMowing the lawn every Saturday and taking out the trash and the recyclables?  😆",
                            "author": "ThrowawayUserID1501",
                            "id": "hx6jnrv",
                            "parent_id": "t1_hx694kd",
                            "score": 11,
                            "created_utc": 1645024720.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hx6nra3",
                                    "parent_id": "t1_hx6jnrv",
                                    "score": 6,
                                    "created_utc": 1645026329.0,
                                    "replies": [
                                        {
                                            "body": "> And is \"per date allowance\" really any different than PPM? I think not.\n\nIf SA uses an algorithm to detect naughty words, “allowance” would likely be on that list",
                                            "author": "ThrowawayUserID1501",
                                            "id": "hx6pvbb",
                                            "parent_id": "t1_hx6nra3",
                                            "score": 10,
                                            "created_utc": 1645027140.0,
                                            "replies": [
                                                {
                                                    "body": "I never mention anything on the site other than that I understand the financial support expectations. After we move to text, I will describe an arrangement in plain English without using any jargon or acronyms.",
                                                    "author": "willfromvb",
                                                    "id": "hx70qsw",
                                                    "parent_id": "t1_hx6pvbb",
                                                    "score": 5,
                                                    "created_utc": 1645031246.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
                                                            "author": "ThrowawayUserID1501",
                                                            "id": "hx7dmbq",
                                                            "parent_id": "t1_hx70qsw",
                                                            "score": 1,
                                                            "created_utc": 1645036515.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yeah I use ppm all the time and it doesn't get flagged. I think sex did though. Got banned. In the processing of getting it back. Think I get once chance if I play it right",
                                                    "author": "S-ADiap",
                                                    "id": "hx8whs4",
                                                    "parent_id": "t1_hx6pvbb",
                                                    "score": 1,
                                                    "created_utc": 1645058540.0,
                                                    "replies": [
                                                        {
                                                            "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
                                                            "author": "Chill_SD1974",
                                                            "id": "hxchicx",
                                                            "parent_id": "t1_hx8whs4",
                                                            "score": 1,
                                                            "created_utc": 1645125678.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                                                                    "author": "S-ADiap",
                                                                    "id": "hxj9olf",
                                                                    "parent_id": "t1_hxchicx",
                                                                    "score": 1,
                                                                    "created_utc": 1645241023.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No it's not, but I feel it is clearer what I am offering and I would never use an acronym. Even if I used Pay Per Meet, I would never use the abbreviation and assume they know what PPM stands for. It just looks bad and looks too polished.",
                                            "author": "willfromvb",
                                            "id": "hx6zg7v",
                                            "parent_id": "t1_hx6nra3",
                                            "score": 1,
                                            "created_utc": 1645030754.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Still better than “pocket money”, or worse, “salary”….",
                                    "author": "Gee_n_tonic",
                                    "id": "hx6m9ue",
                                    "parent_id": "t1_hx6jnrv",
                                    "score": 2,
                                    "created_utc": 1645025744.0,
                                    "replies": [
                                        {
                                            "body": "Oooof!  Agreed\n\n“Salary!”  Maybe on that new job website schtuprecruiter.com ! 😄",
                                            "author": "ThrowawayUserID1501",
                                            "id": "hx6v0uo",
                                            "parent_id": "t1_hx6m9ue",
                                            "score": 5,
                                            "created_utc": 1645029103.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Allowance has never been a controversial term on SA.",
                                    "author": "willfromvb",
                                    "id": "hx6ysgy",
                                    "parent_id": "t1_hx6jnrv",
                                    "score": 1,
                                    "created_utc": 1645030506.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Agree. Adding this to my repertoire 👌",
                            "author": "SDinChi",
                            "id": "hx7cg0m",
                            "parent_id": "t1_hx694kd",
                            "score": 1,
                            "created_utc": 1645036059.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I wouldn't even mention \"financial support\" and just say you've had a in person traditional SD/SB relationship before and that is what you're looking for to get rid of the \"platonics\" and \"online only\" people.",
                    "author": "vince539839",
                    "id": "hx74gl4",
                    "parent_id": "t1_hx63g03",
                    "score": 5,
                    "created_utc": 1645032648.0,
                    "replies": [
                        {
                            "body": "This. People should already know what it entails, I think.",
                            "author": "oneangstybiscuit",
                            "id": "hx7ngr5",
                            "parent_id": "t1_hx74gl4",
                            "score": 2,
                            "created_utc": 1645040272.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was once offered a PPM however it wasn't even money. He legitimately told me that one night with him would give me the tools I need to achieve my goals in life and some other life coach bull...",
                    "author": "MrsConklin",
                    "id": "hx86tr1",
                    "parent_id": "t1_hx63g03",
                    "score": 4,
                    "created_utc": 1645047769.0,
                    "replies": []
                },
                {
                    "body": ">e.  You can simply say that you understand financial support is part of the expectation and only go into more detail once you have moved communications off the site.  I don't use the SA jargon and wou\n\nI've outrightly used the term ppm, had SD's use the term ppm and discussed expectations on the site actually. I find that I really don't want to give my number out and text with a bunch of potentials just to find out that they're actually only willing to dish out 200 bucks a date for sex/cheap as hell. Haven't been banned ever.",
                    "author": null,
                    "id": "hx8n04f",
                    "parent_id": "t1_hx63g03",
                    "score": 2,
                    "created_utc": 1645054367.0,
                    "replies": [
                        {
                            "body": ">I've outrightly used the term ppm, had SD's use the term ppm and discussed expectations on the site actually.\n\nThis appears to be changing, though.\n\nYou take a risk of losing access going forward.",
                            "author": "Hyceanplanet",
                            "id": "hx9kw75",
                            "parent_id": "t1_hx8n04f",
                            "score": 5,
                            "created_utc": 1645069841.0,
                            "replies": []
                        },
                        {
                            "body": "I don't get why SBs have such low expectations. They put in a lot more time and effort than sex workers do and are not compensated commensurately.",
                            "author": "AShatteredKing",
                            "id": "hxb0z3m",
                            "parent_id": "t1_hx8n04f",
                            "score": 3,
                            "created_utc": 1645105119.0,
                            "replies": [
                                {
                                    "body": "It's definitely not the SBs who have low expectations usually, ime. I was fortunate to have met a few exceptionally generous daddies in the bowl over the last few years in the bowl. But as can be seen in the subs for sugar babies, there's a reason why SBs are encouraging other women to stick to their standards and complaining about fake daddies.",
                                    "author": null,
                                    "id": "hxb850u",
                                    "parent_id": "t1_hxb0z3m",
                                    "score": 2,
                                    "created_utc": 1645108379.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "SBs.... or whatever you will be called now..... always got a pass.\n\n\nAs a SD I was banned, had to email a letter promising to be a good boy and was just recently warned about being nice when I said I had no need for a fat blue haired platonic girl in my life to someone.\nIt was a bad day....she just pushed my buttons.....\nI've learned to just block and move on, actually I knew better then but.....\n\n\nI just say xxx weekly allowance with weekly dates now.\n\n\n Off site I say each meet or ppm.",
                            "author": "inafishbowl17",
                            "id": "hx9agz7",
                            "parent_id": "t1_hx8n04f",
                            "score": 0,
                            "created_utc": 1645064834.0,
                            "replies": [
                                {
                                    "body": "I don't think there's anything wrong with ppm's, not much different than \"weekly allowance\". It's all just terminology and concepts - at the end of the day it's what each individual makes of it. I'm in a happy long term arrangement with one daddy atm for the past year and ongoing for probably many more. Best of luck.",
                                    "author": null,
                                    "id": "hx9i8r9",
                                    "parent_id": "t1_hx9agz7",
                                    "score": 1,
                                    "created_utc": 1645068456.0,
                                    "replies": [
                                        {
                                            "body": "There's absolutely no difference. Saying PPM gets a SD banned the other phrasing   seems to be OK.... so far.",
                                            "author": "inafishbowl17",
                                            "id": "hx9jtav",
                                            "parent_id": "t1_hx9i8r9",
                                            "score": 1,
                                            "created_utc": 1645069271.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah that sucks ass and is indeed a double standard, sympathies about the ban...",
                                                    "author": null,
                                                    "id": "hx9k66l",
                                                    "parent_id": "t1_hx9jtav",
                                                    "score": 1,
                                                    "created_utc": 1645069462.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeking hired tigers woods girlfriend to help legitimize sugar dating. They had a marketing push they had planned to do.\n\nThen in April 2021 Matt Gaetz (R-Florida) was caught in a sex scandal with underage girls. You probably heard about the scandal. You may not have heard that he was using SA to meet girls.\n\nSA immediately changed their marketing strategy and canceled the contract with tiger’s girlfriend. They are rebranding as a dating site, not a sugar site. They are either going through litigation, or they know it’s coming. And it will likely explode before the 2022 elections. I don’t think this has anything to do with Wade’s marriage and outlook on life. It’s all about mitigating legal risk.",
            "author": "TwerkingAvocado",
            "id": "hx64lq7",
            "parent_id": "t3_stvjdq",
            "score": 26,
            "created_utc": 1645018075.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hx6d5hh",
                    "parent_id": "t1_hx64lq7",
                    "score": 9,
                    "created_utc": 1645022026.0,
                    "replies": [
                        {
                            "body": "And I believe they were blocked on the Apple store as well.",
                            "author": "TwerkingAvocado",
                            "id": "hx6doad",
                            "parent_id": "t1_hx6d5hh",
                            "score": 7,
                            "created_utc": 1645022251.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well that’s seeking a fault for not checking girls ages.  Thats a big problem for them",
                    "author": "wb19081908",
                    "id": "hx880s3",
                    "parent_id": "t1_hx64lq7",
                    "score": 4,
                    "created_utc": 1645048232.0,
                    "replies": []
                },
                {
                    "body": "Excellent analysis. You pieced together a couple new elements.",
                    "author": "Hyceanplanet",
                    "id": "hx6kism",
                    "parent_id": "t1_hx64lq7",
                    "score": 3,
                    "created_utc": 1645025060.0,
                    "replies": [
                        {
                            "body": "Here's a NYT's article:\n\n[https://www.nytimes.com/2021/10/21/us/politics/matt-gaetz-justice-department.html](https://www.nytimes.com/2021/10/21/us/politics/matt-gaetz-justice-department.html)\n\nThere's a  minor involved -- hoo boy.\n\nIf SA is the source all of these women......",
                            "author": "Hyceanplanet",
                            "id": "hx70r5d",
                            "parent_id": "t1_hx6kism",
                            "score": 3,
                            "created_utc": 1645031250.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hx7k66e",
                                    "parent_id": "t1_hx70r5d",
                                    "score": 6,
                                    "created_utc": 1645039024.0,
                                    "replies": [
                                        {
                                            "body": "That would be transformative -- a big hurdle and risk for the business with big upside.",
                                            "author": "Hyceanplanet",
                                            "id": "hx7n87z",
                                            "parent_id": "t1_hx7k66e",
                                            "score": 2,
                                            "created_utc": 1645040182.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hx9qu20",
                                                    "parent_id": "t1_hx7n87z",
                                                    "score": 2,
                                                    "created_utc": 1645073276.0,
                                                    "replies": [
                                                        {
                                                            "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
                                                            "author": "Hyceanplanet",
                                                            "id": "hx9sb5e",
                                                            "parent_id": "t1_hx9qu20",
                                                            "score": 1,
                                                            "created_utc": 1645074218.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Haha when I found out the hired her I thought it was a joke. She has a terrible reputation and wasn’t a sugar baby.\n\nNow it’s no PPM, no sex, no hanky panky. SA is actively promoting ONLINE and platonic relationships because they want to cover their asses.",
                    "author": "UnearthlyDinosaur",
                    "id": "hx6i41b",
                    "parent_id": "t1_hx64lq7",
                    "score": 4,
                    "created_utc": 1645024095.0,
                    "replies": []
                },
                {
                    "body": "The why has no impact on the result.",
                    "author": "Whale_SD",
                    "id": "hx6518o",
                    "parent_id": "t1_hx64lq7",
                    "score": -1,
                    "created_utc": 1645018292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I haven't really seen anybody here saying nothing has changed, quite the opposite actually. \n\n\"No ppm\" has been in place for months now.\n\nAre you a SD but an Attractive member? 😂",
            "author": "ufmon",
            "id": "hx632wq",
            "parent_id": "t3_stvjdq",
            "score": 19,
            "created_utc": 1645017307.0,
            "replies": [
                {
                    "body": "I’m offended I can’t be both an SD and Attractive!",
                    "author": null,
                    "id": "hx8xeqf",
                    "parent_id": "t1_hx632wq",
                    "score": 3,
                    "created_utc": 1645058956.0,
                    "replies": []
                },
                {
                    "body": "I saw it posted on another subreddit. I'd have crossposted it, but it didn't allow me to.\n\nEdit: Also if you scroll down in this thread you'll see plenty of comments saying this has no impact.",
                    "author": "Whale_SD",
                    "id": "hx63oo5",
                    "parent_id": "t1_hx632wq",
                    "score": -4,
                    "created_utc": 1645017612.0,
                    "replies": [
                        {
                            "body": "I mean it doesn't really have any impact because what we all do is check the box and acknowledge, then discuss PPMs off the site. This hasn't stopped people from finding arrangements. I joined SA when the no-ppm policy was already in place but I knew what the site was about and had zero problem finding 2 good arrangements. Seeing \"no ppm\" didn't make me think \"oh this is a vanilla dating site\". So yeah it didn't have any impact, at least on me. As people have said in other threads this policy will likely attract more people looking for vanilla, but the ones looking for sugar will still be there. You'll just have to search harder",
                            "author": "ufmon",
                            "id": "hx66fpg",
                            "parent_id": "t1_hx63oo5",
                            "score": 6,
                            "created_utc": 1645018984.0,
                            "replies": [
                                {
                                    "body": "Now they are banning for no reason. And the “friends” tag shows they are openly promoting platonic relationships. The number of platonics has gone through the roof. SA loves platonics cause they don’t get the site into legal trouble.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hx6io59",
                                    "parent_id": "t1_hx66fpg",
                                    "score": 3,
                                    "created_utc": 1645024323.0,
                                    "replies": [
                                        {
                                            "body": "I would disagree. Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream. I agree it helps with their legal issues, but let's not kid ourselves, SA wants no one to use that tag, it doesn't help their business model, but having the tag does.",
                                            "author": "WCSD74",
                                            "id": "hx6uczz",
                                            "parent_id": "t1_hx6io59",
                                            "score": 1,
                                            "created_utc": 1645028851.0,
                                            "replies": [
                                                {
                                                    "body": "Paying SDs want actual sugar which SA now forbids. The front page of the site literally says “don’t sugar”. \n\nThey used to ban women for online only and now they don’t anymore.",
                                                    "author": "UnearthlyDinosaur",
                                                    "id": "hx72bow",
                                                    "parent_id": "t1_hx6uczz",
                                                    "score": 1,
                                                    "created_utc": 1645031843.0,
                                                    "replies": [
                                                        {
                                                            "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
                                                            "author": "WCSD74",
                                                            "id": "hx8w5m5",
                                                            "parent_id": "t1_hx72bow",
                                                            "score": 1,
                                                            "created_utc": 1645058386.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                                                                    "author": "UnearthlyDinosaur",
                                                                    "id": "hx93jr4",
                                                                    "parent_id": "t1_hx8w5m5",
                                                                    "score": 1,
                                                                    "created_utc": 1645061732.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": ">Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream.\n\nGood point.  SA is in legal defence posture and  your excellent words probably show up in their legal memos.",
                                                    "author": "Hyceanplanet",
                                                    "id": "hx9lahv",
                                                    "parent_id": "t1_hx6uczz",
                                                    "score": 1,
                                                    "created_utc": 1645070060.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No thanks? It was annoying enough as it was.",
                                    "author": "Whale_SD",
                                    "id": "hx67w5q",
                                    "parent_id": "t1_hx66fpg",
                                    "score": 2,
                                    "created_utc": 1645019671.0,
                                    "replies": []
                                },
                                {
                                    "body": "I find it significant.\n\nApps bury pages of legalese that no one reads. \n\nHere, SA is taking a very specific element and asking for explicit agreement.\n\nTechnically, the agreement covers more than activity on the site.\n\nIt's asking that users of the app agree that use of Seeking agree to how Seeking is used, broadly.\n\nThis doesn't change behavior, but it is an indication that SA is going to ban more aggressively.\n\nIn the past, if a user contacted SA and said that another person met on SA behaved badly, SA's raction might have been inconsistent.\n\nI trust that SA has excellent lawyers and are reacting to real existential issues. \n\nThese are adjustments, but, in the context of SA's business health, probably necessary.",
                                    "author": "Hyceanplanet",
                                    "id": "hx68n7t",
                                    "parent_id": "t1_hx66fpg",
                                    "score": 3,
                                    "created_utc": 1645020022.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hx6cnby",
                            "parent_id": "t1_hx63oo5",
                            "score": 3,
                            "created_utc": 1645021806.0,
                            "replies": [
                                {
                                    "body": "It is, I wasn't sure if you'd appreciate credit for it, or see it as being called out by username. Credit where credit is due though.\n\nI would have done it as a crosspost, but it didn't allow me.",
                                    "author": "Whale_SD",
                                    "id": "hx6oszh",
                                    "parent_id": "t1_hx6cnby",
                                    "score": 1,
                                    "created_utc": 1645026731.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Who cares what their \"rules\" are????  (Other than to be extremely careful in messages on the SA site!!!!)\n\nMen and women in the know will do what we've always done. \n\nI've always laughed when POT SB's cite the \"SA rules\" as to what 2 adults can or can't do on their own time in private.\n\n*BUT*, yes, this will continue to increase the noise to signal ratio on SA.",
            "author": null,
            "id": "hx66wf8",
            "parent_id": "t3_stvjdq",
            "score": 5,
            "created_utc": 1645019206.0,
            "replies": [
                {
                    "body": "That ratio was already terrible.",
                    "author": "Whale_SD",
                    "id": "hx680pe",
                    "parent_id": "t1_hx66wf8",
                    "score": 2,
                    "created_utc": 1645019731.0,
                    "replies": [
                        {
                            "body": "It's getting more terribler.",
                            "author": null,
                            "id": "hxawtsb",
                            "parent_id": "t1_hx680pe",
                            "score": 1,
                            "created_utc": 1645103010.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All these changes are what amounts to putting warning signs on the front door of a store. And putting slippery floor signs down in the aisle when there is a spill. It's prevention measures.\n\nBut business is STILL going on. Ladies can't say they was scammed when they clicked the box saying don't share bank info. And if they get banned for saying ppm well shit you was warned. Nothing changing but the wrapping. Sugar relationships and ppm meets are still going to happen like always. Use the right words and take that conversation off site.",
            "author": "southernslick",
            "id": "hx65goz",
            "parent_id": "t3_stvjdq",
            "score": 8,
            "created_utc": 1645018509.0,
            "replies": []
        },
        {
            "body": "I think this is just to cover everyone. We always talk PPM outside of seeking.com",
            "author": "peterharris100",
            "id": "hx633f5",
            "parent_id": "t3_stvjdq",
            "score": 8,
            "created_utc": 1645017314.0,
            "replies": []
        },
        {
            "body": "That’s been there.",
            "author": "Economics_Troll",
            "id": "hx66b78",
            "parent_id": "t3_stvjdq",
            "score": 3,
            "created_utc": 1645018923.0,
            "replies": [
                {
                    "body": "yup, for quite some time now",
                    "author": "mraspencer",
                    "id": "hx67qaz",
                    "parent_id": "t1_hx66b78",
                    "score": 5,
                    "created_utc": 1645019596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s a “weekly allowance” not a ppm 🤷‍♂️😂",
            "author": "LotBuilder",
            "id": "hx66puo",
            "parent_id": "t3_stvjdq",
            "score": 4,
            "created_utc": 1645019120.0,
            "replies": []
        },
        {
            "body": "Interesting to see this, either it doesn’t show up for SDs or only for new ones.  I’ve always been one that PPM works best for, as have been my SBs so it just reinforces moving off SA as soon as possible.  You can have wonderful, long term relationships that are PPM",
            "author": "blk-tye",
            "id": "hx6c2a3",
            "parent_id": "t3_stvjdq",
            "score": 3,
            "created_utc": 1645021556.0,
            "replies": [
                {
                    "body": "It must be only new ones. I've not seen it either and I've been on the site since 2017.",
                    "author": "Y_4Z44",
                    "id": "hx6kgnr",
                    "parent_id": "t1_hx6c2a3",
                    "score": 1,
                    "created_utc": 1645025037.0,
                    "replies": []
                },
                {
                    "body": "I just registered as a new member.  Nothin about a change for SDs, no form to agree too.  If they are selling something different to men and women?",
                    "author": "fantastikal19",
                    "id": "hx7jonp",
                    "parent_id": "t1_hx6c2a3",
                    "score": 1,
                    "created_utc": 1645038836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We should just use PDA - Per Date Allowance instead of PPM 😂\n\n- “Are you ok with PDA?”\n\n- “I like PDA”",
            "author": "Numerous-Ad3709",
            "id": "hx6h4l3",
            "parent_id": "t3_stvjdq",
            "score": 3,
            "created_utc": 1645023692.0,
            "replies": []
        },
        {
            "body": "They have had a policy against PPM for years.",
            "author": "UseTheForceRey",
            "id": "hx6m5bn",
            "parent_id": "t3_stvjdq",
            "score": 3,
            "created_utc": 1645025696.0,
            "replies": [
                {
                    "body": "Yes, Seeking has had this policy for years.",
                    "author": "Seeking_Arrangement",
                    "id": "hx7rbmm",
                    "parent_id": "t1_hx6m5bn",
                    "score": 1,
                    "created_utc": 1645041742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There should be a list of alternatives in this subreddit, if there isn't already.",
            "author": "FoxlyKei",
            "id": "hx8lcq3",
            "parent_id": "t3_stvjdq",
            "score": 3,
            "created_utc": 1645053668.0,
            "replies": []
        },
        {
            "body": "Standard CYA notice.  Nothing really new here.  I see this as a legal necessity to get reinstated in Malaysia and an app for the Apple App Store.  A way for Seeking to say, see we're not about SRs.",
            "author": "Daddyg2019",
            "id": "hx64ww1",
            "parent_id": "t3_stvjdq",
            "score": 6,
            "created_utc": 1645018231.0,
            "replies": [
                {
                    "body": "Excellent point.  We usually mention FOSTA-SESTA but neglect to consider how other countries’ legal barriers to entry into their markets can drive decision-making across the site.",
                    "author": "leyapaul",
                    "id": "hx6wtqg",
                    "parent_id": "t1_hx64ww1",
                    "score": 2,
                    "created_utc": 1645029774.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope Sugar Fetch takes off so real sugar gamers can jump ship and leave Seeking to the fakes.",
            "author": "HailToTheQuinn",
            "id": "hx6bdt2",
            "parent_id": "t3_stvjdq",
            "score": 5,
            "created_utc": 1645021262.0,
            "replies": [
                {
                    "body": "Thank you for your comment u/HailToTheQuinn!",
                    "author": "SugarFetch",
                    "id": "hx6ist2",
                    "parent_id": "t1_hx6bdt2",
                    "score": 5,
                    "created_utc": 1645024376.0,
                    "replies": [
                        {
                            "body": "Welcome. I just joined yesterday.",
                            "author": "HailToTheQuinn",
                            "id": "hx6jbo2",
                            "parent_id": "t1_hx6ist2",
                            "score": 5,
                            "created_utc": 1645024585.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "it doesn't matter. seeking can't force their users to not want sugar relationships. everyone who uses that site knows what people go on it for",
            "author": "realsugardaddyz",
            "id": "hx6srue",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645028253.0,
            "replies": [
                {
                    "body": "That's not really true.  When SA came along at first, there was a lifestyle expectations/allowance field. Back then, almost nobody thought platonic was an option.\n\nI think there's a disconnect in the user experience of SDs who started using the site around 2006 vs those that have always had to wade through the platonics, etc.\n\nSeeking is not what is was. That was an era where it's competition was putting up ads like these:  https://www.dailymail.co.uk/femail/article-2318390/Hey-students-need-summer-job-Controversial-billboards-dating-site-promotes-oral-sex-finding-sugar-daddy-aspirational-options.html\n\nI disagree that \"everyone knows\" SBs are not typically SBs forever. The new crowd will be different.\n\nI give it 3 years before the vast majority of SBs are not SBs at all just from user turnover. I give it maybe 1-2 years before SA is totally unuseable for everyone outside vanilla.",
                    "author": "Whale_SD",
                    "id": "hx6yzjg",
                    "parent_id": "t1_hx6srue",
                    "score": 2,
                    "created_utc": 1645030580.0,
                    "replies": [
                        {
                            "body": "I agree with you. I feel that many of the folks here on SLF support and are used to a financially-based relationship, and there are also TikTokkers sending SBs to SA to try to score money. But I agree that it will shift over time, with more and more people coming to SA based on the current site's marketing and messaging and/or to score free dinners/yacht rides/etc. I'm sure there will still be a percentage of folks on the site who get more into intimacy and money, but that will shrink IMO.",
                            "author": "emptyoverflow",
                            "id": "hx814zu",
                            "parent_id": "t1_hx6yzjg",
                            "score": 2,
                            "created_utc": 1645045555.0,
                            "replies": []
                        },
                        {
                            "body": "Bring back those billboards! 🤣",
                            "author": "SDchat",
                            "id": "hx7goq3",
                            "parent_id": "t1_hx6yzjg",
                            "score": 0,
                            "created_utc": 1645037699.0,
                            "replies": []
                        },
                        {
                            "body": "Uhh.. platonics?  Do you honestly think vanilla dating is just platonic?  Tinder is platonic?  [Match.com](https://Match.com) is platonic?  Platonic has nothing to do with it",
                            "author": "Acrobatic_Half_6631",
                            "id": "hx89gjd",
                            "parent_id": "t1_hx6yzjg",
                            "score": 1,
                            "created_utc": 1645048792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeking is about \"real relationships\" with an arrangement",
            "author": null,
            "id": "hx6vocy",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645029346.0,
            "replies": [
                {
                    "body": "LOL. Seeking Arrangement . The “arrangement” part… it’s pronounced silently.",
                    "author": "SDchat",
                    "id": "hx7ykvr",
                    "parent_id": "t1_hx6vocy",
                    "score": 1,
                    "created_utc": 1645044572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I use the term \"reciprocation\" instead. The algorithms haven't caught up with that one yet  :-)\n\nI also take the conversation to Telegram or a burner phone as quickly as possible.",
            "author": "Nomad_Bill",
            "id": "hx6zoc3",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645030839.0,
            "replies": []
        },
        {
            "body": "That has been there for multiple *years*. Pre-pandemic it also used to read \"Online Arrangements are prohibited\". But they started allowing those due to the lockdowns. Big mistake imo.",
            "author": "BobbyTavernerSB",
            "id": "hx73xy9",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645032452.0,
            "replies": [
                {
                    "body": "Shows how old my account is then. It was news to me.",
                    "author": "Whale_SD",
                    "id": "hx75090",
                    "parent_id": "t1_hx73xy9",
                    "score": 1,
                    "created_utc": 1645032856.0,
                    "replies": [
                        {
                            "body": "Yeah, that dialog hasn’t changed in years, other than the removal of online",
                            "author": "Acrobatic_Half_6631",
                            "id": "hx89ppi",
                            "parent_id": "t1_hx75090",
                            "score": 1,
                            "created_utc": 1645048891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's all part of the CYA game, learning the acceptable terminology so they can say they warned you, just at they warned girls at one time that they had to be willing to meet in person. It's the same as escorts asking for a donation, gift, or number of roses, or SA girls using NSA. It's as silly and useless as the girls who put a profile warning in cut-and-pasted pseudo-legal verbiage that nobody can use their photos without consent.  I doubt my inbox will be filled up anytime soon with those looking for a real relationship, and the only profiles I've seen mentioning that are emphasizing what they don't want.",
            "author": null,
            "id": "hx7e8e6",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645036754.0,
            "replies": []
        },
        {
            "body": "They have to say their policy is no PPM because they don't want to get booted from app stores for promoting something that can be viewed as prostitution. It's just CYA.\n\nWe all know the real deal and that ppm is totally standard. Move the conversation somewhere else to discuss details. No worries.",
            "author": "DegenDreamer",
            "id": "hx7r8ez",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645041708.0,
            "replies": []
        },
        {
            "body": "I just don't understand... Is seeking not making enough off of the fees for SDs? Why would someone pay good money to develop a \"real relationship\" when the majority of the girls on there aren't even worthy of a traditional relationship? This move makes no sense to me.",
            "author": "NastySloth",
            "id": "hx95tl8",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645062743.0,
            "replies": [
                {
                    "body": "Seeking seems to have forgotten who their paying client base is.\n\nMen, and a large percentage of those men are married.\n\nTo most women dating up has the intended goal of marriage, which is something 99% of seeking's male users are trying to avoid or can't do.\n\nBut I suspect Wade has always made his target audience himself, and if he is now willing to get married, I suspect he thinks his users can or will do the same.\n\nHe ignores that as a happily married man who'd never cheat, he'd never pay a site like SA/Dating Up for a membership.\n\nWhy would a rich guy need SA to find a gold digger? He can just step outside his house.\n\nThe move makes no sense to you because its a bad move.",
                    "author": "Whale_SD",
                    "id": "hxa3d5o",
                    "parent_id": "t1_hx95tl8",
                    "score": 1,
                    "created_utc": 1645081366.0,
                    "replies": []
                },
                {
                    "body": "Could it be that he just wants What's Your Price to take off? I made one, didn't look at it, and had 33 offers. That means men spent A LOT of money in hopes of getting a \"date\" with me. Probably pretty lucrative for SA owner if it were to take off",
                    "author": "NastySloth",
                    "id": "hx9f9pg",
                    "parent_id": "t1_hx95tl8",
                    "score": 1,
                    "created_utc": 1645066985.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "hx9f9q7",
                            "parent_id": "t1_hx9f9pg",
                            "score": 1,
                            "created_utc": 1645066986.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Personally I don’t like PPM either but I think initially you have to do that to make sure you are both happy with the relationship going further. Ideally it would be a weekly or monthly allowance with spending time together. If we are both free, it could be a whole week and not, it could be just a night. In the end, no one wants to have a super calculated relationship.. that just feels like hookup. My personal preference anyway",
            "author": null,
            "id": "hx9ofuj",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645071835.0,
            "replies": [
                {
                    "body": "> think initially you have to do that\n\nYes you do have to do that, and it's SA's fault.\n\nSeeking's own policies are why PPM have become so common. They've been setting the bar lower and lower, and telling what they see as potential SBs whatever it takes to get them onto the site. As a result you get a lot of women who have no real intention of being a SB. Simultaneously seeking has turned into a giant pool of naive women, which makes them a better target for scammers, PUAs etc.\n\nSo, now, women want cash, soon, up front, asap, to know you're serious, and SDs get burnt giving allowances a few times to people with no desire to be SBs. The only sane solution ends up being a weekly allowance or PPM, unless you have some overwhelming reason/need to avoid PPM at all costs.\n\nThat means the early stages of a sugar relationship can end up looking a lot like escorting even if the intent is a real relationship, which of course brings all the johns and escorts, because they can function in that kind of environment and take advantage of the situation.\n\nWhich is where we had been so far, with SA. Try to filter out the scammers, platonics, PUA. (Cash only, and when intimacy starts). Try to filter out the escorts and johns. (A few platonic dates, that no john or escort would tolerate). Then start the financial support, but not a month at a time.\n\nThe no PPM, at all, ever policy doesn't solve the problems PPM aims to fix. Those problem's are caused by SAs ad policy.",
                    "author": "Whale_SD",
                    "id": "hxa27f8",
                    "parent_id": "t1_hx9ofuj",
                    "score": 1,
                    "created_utc": 1645080529.0,
                    "replies": [
                        {
                            "body": "You get scammers on bumble, and tinder and real life too. It’s just avoidable. 🤔\n\nI am a very inexperienced SB. I only just have got my first SD. So I probably don’t have much to say in that regard. But I don’t answer men who message - I can give you this much per night, what can you do? \n\nI am looking for an older sophisticated gentleman who can take care of me and provide mentorship so PPM definitely doesn’t help me find what I am looking for. I think it’s good seek provides the option that you can choose what you look for. If a guy says he wants emotional connection, mentorship, long term, etc.. I will definitely consider. If a guy says he wants casual fun, no strings attached etc, I will hesitate. \n\nYou just have to trust what they say on SA and arrange a few dates to get to know him then decide if he is the right candidate to be my SD. \n\nI don’t charge guys to meet for dinner or coffee as I am not providing a service. I choose you and I think I might like you so I go on a date with you. If I do like you very much, then I consider your offer. Basically this is how I process candidates on SA. \n\nEvery girl is different so I don’t have problems how others do. Maybe to some girls, sexual compatibility is very important, not personality, so she’d rather have sex on the first date. And that, I can’t see anything wrong either. It’s a free world. As long as you don’t force others, who can judge?",
                            "author": null,
                            "id": "hxc09e4",
                            "parent_id": "t1_hxa27f8",
                            "score": 1,
                            "created_utc": 1645119285.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"weekly allowance\"",
            "author": "techsd00",
            "id": "hxbbxd8",
            "parent_id": "t3_stvjdq",
            "score": 2,
            "created_utc": 1645109968.0,
            "replies": []
        },
        {
            "body": "So you have to click on an acknowledgement box\n\nMeanwhile, you never could talk about PPM without running the risk of a ban.\n\nWow... What a change",
            "author": "Church42",
            "id": "hx635ls",
            "parent_id": "t3_stvjdq",
            "score": 4,
            "created_utc": 1645017345.0,
            "replies": [
                {
                    "body": "Yeah, good luck telling a new SB that PPM is the norm after both tiktok and SA told her PPM isn't a thing.\n\nGet ready for those platonic allowance requests, now you're alongside the scammers in a warning not to share bank info.",
                    "author": "Whale_SD",
                    "id": "hx63wu4",
                    "parent_id": "t1_hx635ls",
                    "score": 4,
                    "created_utc": 1645017726.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi there, Seeking has never allowed PPM. This is just a reminder for those joining the community.",
            "author": "Seeking_Arrangement",
            "id": "hx6zsid",
            "parent_id": "t3_stvjdq",
            "score": 3,
            "created_utc": 1645030882.0,
            "replies": [
                {
                    "body": "You're right, it was lifestyle expectations.",
                    "author": "Whale_SD",
                    "id": "hx70klx",
                    "parent_id": "t1_hx6zsid",
                    "score": 3,
                    "created_utc": 1645031179.0,
                    "replies": []
                },
                {
                    "body": "Right, it was the “Lifestyle Expectation” profile field in *dollar amounts*. Is that kind of what you now mean by “Dating Up”?",
                    "author": "SDchat",
                    "id": "hx7bm11",
                    "parent_id": "t1_hx6zsid",
                    "score": 2,
                    "created_utc": 1645035726.0,
                    "replies": [
                        {
                            "body": "Dating Up is for like-minded individuals looking to forge relationships on their own terms.",
                            "author": "Seeking_Arrangement",
                            "id": "hx7rtcy",
                            "parent_id": "t1_hx7bm11",
                            "score": 2,
                            "created_utc": 1645041933.0,
                            "replies": [
                                {
                                    "body": "Wink wink, nudge nudge, know what I mean? say no more.\n\nhttps://youtu.be/53LRAxeKy2U?t=15",
                                    "author": "Acrobatic_Half_6631",
                                    "id": "hx8al8s",
                                    "parent_id": "t1_hx7rtcy",
                                    "score": 2,
                                    "created_utc": 1645049243.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can't wait until they start banning people for using the word sugar",
            "author": "saltgrindr",
            "id": "hx6fmxf",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645023075.0,
            "replies": [
                {
                    "body": "Sucrose, maltose and dextrose are suitable alternatives.",
                    "author": null,
                    "id": "hx6mnjc",
                    "parent_id": "t1_hx6fmxf",
                    "score": 3,
                    "created_utc": 1645025895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So we are not supposed to use the term PPM in our chats with SB's?  \n\n\nDoes that mean that SA is - and has been READING and/or Scanning all our messages - which should have had some expectation of Privacy...  \n\n\nIf you list PPM on your profile - then yes - that is a ban - but if in 'private chats' - that is quite alarming and will serve to have me get communications off SA Immediately",
            "author": "sd424242",
            "id": "hx6nium",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645026237.0,
            "replies": [
                {
                    "body": "They have been, officially it's at a report, but who knows.",
                    "author": "Whale_SD",
                    "id": "hx6oxkh",
                    "parent_id": "t1_hx6nium",
                    "score": 1,
                    "created_utc": 1645026780.0,
                    "replies": []
                },
                {
                    "body": "I would leave that out of your chats and discuss anything involving finances outside of the site. SA can't really afford to have people on the site talking about exchanging money for stuff.",
                    "author": "emptyoverflow",
                    "id": "hx81ck1",
                    "parent_id": "t1_hx6nium",
                    "score": 1,
                    "created_utc": 1645045639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That has been the case but you cheapos love ppm",
            "author": "WiseRequirement9277",
            "id": "hx74xvm",
            "parent_id": "t3_stvjdq",
            "score": -1,
            "created_utc": 1645032831.0,
            "replies": []
        },
        {
            "body": "As others have pointed out, that's been showing up for quite some time.  And people have been banned for saying PPM for a few years already. In short, no need to make a new thread about something that hasn't changed :)\n\nHowever, even if we pretend this is something new, the real core question: will they be making mostly cosmetic changes, or substantive changes.   Cosmetic changes could be: posting warnings, and bans for the most obvious transactional type discussion.   Substantive changes: any mention of allowance or financial support, even just in profiles, results in a ban.  IOW, are they making changes for appearances' sake in order to get back on the apple store and keep from getting dropped by credit processing companies?  Or are they actually stamping out sugar?\n\nRight now, we haven't seen anything but the fluffiest of cosmetic changes, and there haven't been much of even that.  No reason t panic until those changes really make it impossible for sugar partners to find each other.",
            "author": "Azurecole",
            "id": "hx6gbud",
            "parent_id": "t3_stvjdq",
            "score": 0,
            "created_utc": 1645023364.0,
            "replies": [
                {
                    "body": "Yeah I think that we can only guess at, and I doubt they could tell us either. I could see a case for both directions. If they want to play it safe and align with perhaps where the times are going, then they would aggressively stamp it out (maybe while routing traffic to WYP). But if they stamp it out, will their traffic eventually fall as they become more of a \"elite dating\" clone?",
                    "author": "emptyoverflow",
                    "id": "hx81whd",
                    "parent_id": "t1_hx6gbud",
                    "score": 1,
                    "created_utc": 1645045856.0,
                    "replies": [
                        {
                            "body": ">will their traffic eventually fall as they become more of a \"elite dating\" clone?\n\nThis! I don’t see how a “Dating Up” or “Millionaire Match” site could ever generate the very high membership numbers that SA had with sugar. \n\nAdd to that the dilution of the site into all of these conflicting member type categories, with everyone seeking a different version of whatever (sugar, platonic, online, non-transactional vanilla dating, “I want a millionaire“, etc.)",
                            "author": "SDchat",
                            "id": "hx8spu9",
                            "parent_id": "t1_hx81whd",
                            "score": 1,
                            "created_utc": 1645056852.0,
                            "replies": [
                                {
                                    "body": "Yeah. I mean, I have not tried out the \"meet a millionaire\" type of dating sites, but I wonder what the experience is like for the millionaire members. Are there tons of scammers? Is it a big waste of time? Are OKC or Tinder ultimately better or easier? And why would I pay for it vs other vanilla dating sites?",
                                    "author": "emptyoverflow",
                                    "id": "hxcpiqi",
                                    "parent_id": "t1_hx8spu9",
                                    "score": 1,
                                    "created_utc": 1645128696.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally off topic, but I'm still fascinated by the whale hat on your avatar.",
            "author": "BinghamtonSD",
            "id": "hx6egsz",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645022587.0,
            "replies": [
                {
                    "body": "Thanks!",
                    "author": "Whale_SD",
                    "id": "hx6p5y6",
                    "parent_id": "t1_hx6egsz",
                    "score": 1,
                    "created_utc": 1645026871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Distancing themselves from any hint of escorting.\n\nBut nothing has really changed.",
            "author": null,
            "id": "hx6hxpj",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645024023.0,
            "replies": []
        },
        {
            "body": "It's said \"no ppm\" on that page for months.",
            "author": null,
            "id": "hx6muim",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645025973.0,
            "replies": []
        },
        {
            "body": "Two days ago I re-upped my Seeking Premium membership after a several month hiatus in curiosity of the site's new format, which more closely aligns with how I have traditionally (and very successfully) used the site.  I have observed zero change in listed expectations from SBs, with almost all profiles  referring to \"mutually beneficial\", allowances, traditional sugar arrangements, and financial support.  So it is curious to me that Seeking is taking this hard line stance but that it is certainly not trickling down to its users, at least not yet.\n\nIf a SB sends me an inquiry about my PPM or allowance on the site, and I respond by asking to take our conversation off site, and Seeking sees this conversation, will *I* get banned???",
            "author": "PrinceProsparo",
            "id": "hx6xjjj",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645030042.0,
            "replies": []
        },
        {
            "body": "I find that this is such a false warning and pretense - a lot of people discuss financial expectations and ppm on the site regardless of this and \\^has been there for a while now.",
            "author": null,
            "id": "hx8n4fk",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645054419.0,
            "replies": []
        },
        {
            "body": "interesting!!",
            "author": "vtec__",
            "id": "hx8u63k",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645057493.0,
            "replies": []
        },
        {
            "body": "Until there’s a decent alternative to sa nothing much can be done.  If sa keeps banning established sugar daddies and they join elsewhere that will help though \n\nSa is creating the environment for a sugar only website by doing this \n\nIt’s making sa less enjoyable",
            "author": "wb19081908",
            "id": "hx8u9pp",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645057538.0,
            "replies": []
        },
        {
            "body": "What app is this?",
            "author": null,
            "id": "hx8zvyu",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645060088.0,
            "replies": []
        },
        {
            "body": "As long as you are still able to message someone and get off of SA immediately to discuss details, what’s the problem? Shit I’m on some sites where if you so much as type “text” or “Snapchat” or any other social media name you can get banned because they don’t want you talking off site. Just be glad that isn’t the case with SA. Yet.",
            "author": "Azucarbabby",
            "id": "hx9742a",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645063324.0,
            "replies": [
                {
                    "body": "The problem is the ever growing pool of non sugar dating people on SA. Which I'll admit from a SBs perspective isn't bad yet. But the low quality (as in non SD/SB) users were mostly SBs (as a percentage). Dating up includes everybody, lets see what happens when you have to talk to ten guys offsite for every guy who's okay with an allowance or PPM. Odds are a few of the guys who are not okay with it will be reporting you. Then SA will start banning SBs too based on those reports.",
                    "author": "Whale_SD",
                    "id": "hxa2qpl",
                    "parent_id": "t1_hx9742a",
                    "score": 1,
                    "created_utc": 1645080912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is anyone else irritated by the inconsistent punctuation? \n\nThe first bold title is a sentence and unpunctuated, the second is a clause and is punctuated.",
            "author": "marcosingh",
            "id": "hx9eri1",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645066757.0,
            "replies": []
        },
        {
            "body": "That’s been there for a long time ya dumb dumb",
            "author": "Late_Ad_6293",
            "id": "hx9rmrn",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645073777.0,
            "replies": []
        },
        {
            "body": "As I have been saying for quite a while now, PPM in which sex is required is clear prostitution. You can add dates and other activities to it, but that's what it is. This is not a judgement or condemnation of this activity, it's just that's what it will legally fall under. For seeking to be a legitimate site, it needs to avoid clear legal violations.",
            "author": "AShatteredKing",
            "id": "hxb0khc",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645104922.0,
            "replies": []
        },
        {
            "body": "Ya, that's been a thing for 4 ish years. Just talk about it off the site.",
            "author": "Payingfor",
            "id": "hxplr24",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1645370288.0,
            "replies": []
        },
        {
            "body": "Wake me up when they ban the word allowance",
            "author": "RayDonavanProg",
            "id": "hyxyurc",
            "parent_id": "t3_stvjdq",
            "score": 1,
            "created_utc": 1646159778.0,
            "replies": []
        },
        {
            "body": "“Per date allowance” and “periodic allowance” are great terms!",
            "author": "Gee_n_tonic",
            "id": "hx694kd",
            "parent_id": "t1_hx63g03",
            "score": 23,
            "created_utc": 1645020246.0,
            "replies": [
                {
                    "body": "Was “allowance” never a controversial word?  What are the women doing to get the “allowance?”\n\nMowing the lawn every Saturday and taking out the trash and the recyclables?  😆",
                    "author": "ThrowawayUserID1501",
                    "id": "hx6jnrv",
                    "parent_id": "t1_hx694kd",
                    "score": 11,
                    "created_utc": 1645024720.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hx6nra3",
                            "parent_id": "t1_hx6jnrv",
                            "score": 6,
                            "created_utc": 1645026329.0,
                            "replies": [
                                {
                                    "body": "> And is \"per date allowance\" really any different than PPM? I think not.\n\nIf SA uses an algorithm to detect naughty words, “allowance” would likely be on that list",
                                    "author": "ThrowawayUserID1501",
                                    "id": "hx6pvbb",
                                    "parent_id": "t1_hx6nra3",
                                    "score": 10,
                                    "created_utc": 1645027140.0,
                                    "replies": [
                                        {
                                            "body": "I never mention anything on the site other than that I understand the financial support expectations. After we move to text, I will describe an arrangement in plain English without using any jargon or acronyms.",
                                            "author": "willfromvb",
                                            "id": "hx70qsw",
                                            "parent_id": "t1_hx6pvbb",
                                            "score": 5,
                                            "created_utc": 1645031246.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
                                                    "author": "ThrowawayUserID1501",
                                                    "id": "hx7dmbq",
                                                    "parent_id": "t1_hx70qsw",
                                                    "score": 1,
                                                    "created_utc": 1645036515.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yeah I use ppm all the time and it doesn't get flagged. I think sex did though. Got banned. In the processing of getting it back. Think I get once chance if I play it right",
                                            "author": "S-ADiap",
                                            "id": "hx8whs4",
                                            "parent_id": "t1_hx6pvbb",
                                            "score": 1,
                                            "created_utc": 1645058540.0,
                                            "replies": [
                                                {
                                                    "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
                                                    "author": "Chill_SD1974",
                                                    "id": "hxchicx",
                                                    "parent_id": "t1_hx8whs4",
                                                    "score": 1,
                                                    "created_utc": 1645125678.0,
                                                    "replies": [
                                                        {
                                                            "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                                                            "author": "S-ADiap",
                                                            "id": "hxj9olf",
                                                            "parent_id": "t1_hxchicx",
                                                            "score": 1,
                                                            "created_utc": 1645241023.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No it's not, but I feel it is clearer what I am offering and I would never use an acronym. Even if I used Pay Per Meet, I would never use the abbreviation and assume they know what PPM stands for. It just looks bad and looks too polished.",
                                    "author": "willfromvb",
                                    "id": "hx6zg7v",
                                    "parent_id": "t1_hx6nra3",
                                    "score": 1,
                                    "created_utc": 1645030754.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Still better than “pocket money”, or worse, “salary”….",
                            "author": "Gee_n_tonic",
                            "id": "hx6m9ue",
                            "parent_id": "t1_hx6jnrv",
                            "score": 2,
                            "created_utc": 1645025744.0,
                            "replies": [
                                {
                                    "body": "Oooof!  Agreed\n\n“Salary!”  Maybe on that new job website schtuprecruiter.com ! 😄",
                                    "author": "ThrowawayUserID1501",
                                    "id": "hx6v0uo",
                                    "parent_id": "t1_hx6m9ue",
                                    "score": 5,
                                    "created_utc": 1645029103.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Allowance has never been a controversial term on SA.",
                            "author": "willfromvb",
                            "id": "hx6ysgy",
                            "parent_id": "t1_hx6jnrv",
                            "score": 1,
                            "created_utc": 1645030506.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agree. Adding this to my repertoire 👌",
                    "author": "SDinChi",
                    "id": "hx7cg0m",
                    "parent_id": "t1_hx694kd",
                    "score": 1,
                    "created_utc": 1645036059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn't even mention \"financial support\" and just say you've had a in person traditional SD/SB relationship before and that is what you're looking for to get rid of the \"platonics\" and \"online only\" people.",
            "author": "vince539839",
            "id": "hx74gl4",
            "parent_id": "t1_hx63g03",
            "score": 5,
            "created_utc": 1645032648.0,
            "replies": [
                {
                    "body": "This. People should already know what it entails, I think.",
                    "author": "oneangstybiscuit",
                    "id": "hx7ngr5",
                    "parent_id": "t1_hx74gl4",
                    "score": 2,
                    "created_utc": 1645040272.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was once offered a PPM however it wasn't even money. He legitimately told me that one night with him would give me the tools I need to achieve my goals in life and some other life coach bull...",
            "author": "MrsConklin",
            "id": "hx86tr1",
            "parent_id": "t1_hx63g03",
            "score": 4,
            "created_utc": 1645047769.0,
            "replies": []
        },
        {
            "body": ">e.  You can simply say that you understand financial support is part of the expectation and only go into more detail once you have moved communications off the site.  I don't use the SA jargon and wou\n\nI've outrightly used the term ppm, had SD's use the term ppm and discussed expectations on the site actually. I find that I really don't want to give my number out and text with a bunch of potentials just to find out that they're actually only willing to dish out 200 bucks a date for sex/cheap as hell. Haven't been banned ever.",
            "author": null,
            "id": "hx8n04f",
            "parent_id": "t1_hx63g03",
            "score": 2,
            "created_utc": 1645054367.0,
            "replies": [
                {
                    "body": ">I've outrightly used the term ppm, had SD's use the term ppm and discussed expectations on the site actually.\n\nThis appears to be changing, though.\n\nYou take a risk of losing access going forward.",
                    "author": "Hyceanplanet",
                    "id": "hx9kw75",
                    "parent_id": "t1_hx8n04f",
                    "score": 5,
                    "created_utc": 1645069841.0,
                    "replies": []
                },
                {
                    "body": "I don't get why SBs have such low expectations. They put in a lot more time and effort than sex workers do and are not compensated commensurately.",
                    "author": "AShatteredKing",
                    "id": "hxb0z3m",
                    "parent_id": "t1_hx8n04f",
                    "score": 3,
                    "created_utc": 1645105119.0,
                    "replies": [
                        {
                            "body": "It's definitely not the SBs who have low expectations usually, ime. I was fortunate to have met a few exceptionally generous daddies in the bowl over the last few years in the bowl. But as can be seen in the subs for sugar babies, there's a reason why SBs are encouraging other women to stick to their standards and complaining about fake daddies.",
                            "author": null,
                            "id": "hxb850u",
                            "parent_id": "t1_hxb0z3m",
                            "score": 2,
                            "created_utc": 1645108379.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "SBs.... or whatever you will be called now..... always got a pass.\n\n\nAs a SD I was banned, had to email a letter promising to be a good boy and was just recently warned about being nice when I said I had no need for a fat blue haired platonic girl in my life to someone.\nIt was a bad day....she just pushed my buttons.....\nI've learned to just block and move on, actually I knew better then but.....\n\n\nI just say xxx weekly allowance with weekly dates now.\n\n\n Off site I say each meet or ppm.",
                    "author": "inafishbowl17",
                    "id": "hx9agz7",
                    "parent_id": "t1_hx8n04f",
                    "score": 0,
                    "created_utc": 1645064834.0,
                    "replies": [
                        {
                            "body": "I don't think there's anything wrong with ppm's, not much different than \"weekly allowance\". It's all just terminology and concepts - at the end of the day it's what each individual makes of it. I'm in a happy long term arrangement with one daddy atm for the past year and ongoing for probably many more. Best of luck.",
                            "author": null,
                            "id": "hx9i8r9",
                            "parent_id": "t1_hx9agz7",
                            "score": 1,
                            "created_utc": 1645068456.0,
                            "replies": [
                                {
                                    "body": "There's absolutely no difference. Saying PPM gets a SD banned the other phrasing   seems to be OK.... so far.",
                                    "author": "inafishbowl17",
                                    "id": "hx9jtav",
                                    "parent_id": "t1_hx9i8r9",
                                    "score": 1,
                                    "created_utc": 1645069271.0,
                                    "replies": [
                                        {
                                            "body": "Yeah that sucks ass and is indeed a double standard, sympathies about the ban...",
                                            "author": null,
                                            "id": "hx9k66l",
                                            "parent_id": "t1_hx9jtav",
                                            "score": 1,
                                            "created_utc": 1645069462.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hx6d5hh",
            "parent_id": "t1_hx64lq7",
            "score": 9,
            "created_utc": 1645022026.0,
            "replies": [
                {
                    "body": "And I believe they were blocked on the Apple store as well.",
                    "author": "TwerkingAvocado",
                    "id": "hx6doad",
                    "parent_id": "t1_hx6d5hh",
                    "score": 7,
                    "created_utc": 1645022251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well that’s seeking a fault for not checking girls ages.  Thats a big problem for them",
            "author": "wb19081908",
            "id": "hx880s3",
            "parent_id": "t1_hx64lq7",
            "score": 4,
            "created_utc": 1645048232.0,
            "replies": []
        },
        {
            "body": "Excellent analysis. You pieced together a couple new elements.",
            "author": "Hyceanplanet",
            "id": "hx6kism",
            "parent_id": "t1_hx64lq7",
            "score": 3,
            "created_utc": 1645025060.0,
            "replies": [
                {
                    "body": "Here's a NYT's article:\n\n[https://www.nytimes.com/2021/10/21/us/politics/matt-gaetz-justice-department.html](https://www.nytimes.com/2021/10/21/us/politics/matt-gaetz-justice-department.html)\n\nThere's a  minor involved -- hoo boy.\n\nIf SA is the source all of these women......",
                    "author": "Hyceanplanet",
                    "id": "hx70r5d",
                    "parent_id": "t1_hx6kism",
                    "score": 3,
                    "created_utc": 1645031250.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hx7k66e",
                            "parent_id": "t1_hx70r5d",
                            "score": 6,
                            "created_utc": 1645039024.0,
                            "replies": [
                                {
                                    "body": "That would be transformative -- a big hurdle and risk for the business with big upside.",
                                    "author": "Hyceanplanet",
                                    "id": "hx7n87z",
                                    "parent_id": "t1_hx7k66e",
                                    "score": 2,
                                    "created_utc": 1645040182.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hx9qu20",
                                            "parent_id": "t1_hx7n87z",
                                            "score": 2,
                                            "created_utc": 1645073276.0,
                                            "replies": [
                                                {
                                                    "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
                                                    "author": "Hyceanplanet",
                                                    "id": "hx9sb5e",
                                                    "parent_id": "t1_hx9qu20",
                                                    "score": 1,
                                                    "created_utc": 1645074218.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha when I found out the hired her I thought it was a joke. She has a terrible reputation and wasn’t a sugar baby.\n\nNow it’s no PPM, no sex, no hanky panky. SA is actively promoting ONLINE and platonic relationships because they want to cover their asses.",
            "author": "UnearthlyDinosaur",
            "id": "hx6i41b",
            "parent_id": "t1_hx64lq7",
            "score": 4,
            "created_utc": 1645024095.0,
            "replies": []
        },
        {
            "body": "The why has no impact on the result.",
            "author": "Whale_SD",
            "id": "hx6518o",
            "parent_id": "t1_hx64lq7",
            "score": -1,
            "created_utc": 1645018292.0,
            "replies": []
        },
        {
            "body": "I’m offended I can’t be both an SD and Attractive!",
            "author": null,
            "id": "hx8xeqf",
            "parent_id": "t1_hx632wq",
            "score": 3,
            "created_utc": 1645058956.0,
            "replies": []
        },
        {
            "body": "I saw it posted on another subreddit. I'd have crossposted it, but it didn't allow me to.\n\nEdit: Also if you scroll down in this thread you'll see plenty of comments saying this has no impact.",
            "author": "Whale_SD",
            "id": "hx63oo5",
            "parent_id": "t1_hx632wq",
            "score": -4,
            "created_utc": 1645017612.0,
            "replies": [
                {
                    "body": "I mean it doesn't really have any impact because what we all do is check the box and acknowledge, then discuss PPMs off the site. This hasn't stopped people from finding arrangements. I joined SA when the no-ppm policy was already in place but I knew what the site was about and had zero problem finding 2 good arrangements. Seeing \"no ppm\" didn't make me think \"oh this is a vanilla dating site\". So yeah it didn't have any impact, at least on me. As people have said in other threads this policy will likely attract more people looking for vanilla, but the ones looking for sugar will still be there. You'll just have to search harder",
                    "author": "ufmon",
                    "id": "hx66fpg",
                    "parent_id": "t1_hx63oo5",
                    "score": 6,
                    "created_utc": 1645018984.0,
                    "replies": [
                        {
                            "body": "Now they are banning for no reason. And the “friends” tag shows they are openly promoting platonic relationships. The number of platonics has gone through the roof. SA loves platonics cause they don’t get the site into legal trouble.",
                            "author": "UnearthlyDinosaur",
                            "id": "hx6io59",
                            "parent_id": "t1_hx66fpg",
                            "score": 3,
                            "created_utc": 1645024323.0,
                            "replies": [
                                {
                                    "body": "I would disagree. Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream. I agree it helps with their legal issues, but let's not kid ourselves, SA wants no one to use that tag, it doesn't help their business model, but having the tag does.",
                                    "author": "WCSD74",
                                    "id": "hx6uczz",
                                    "parent_id": "t1_hx6io59",
                                    "score": 1,
                                    "created_utc": 1645028851.0,
                                    "replies": [
                                        {
                                            "body": "Paying SDs want actual sugar which SA now forbids. The front page of the site literally says “don’t sugar”. \n\nThey used to ban women for online only and now they don’t anymore.",
                                            "author": "UnearthlyDinosaur",
                                            "id": "hx72bow",
                                            "parent_id": "t1_hx6uczz",
                                            "score": 1,
                                            "created_utc": 1645031843.0,
                                            "replies": [
                                                {
                                                    "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
                                                    "author": "WCSD74",
                                                    "id": "hx8w5m5",
                                                    "parent_id": "t1_hx72bow",
                                                    "score": 1,
                                                    "created_utc": 1645058386.0,
                                                    "replies": [
                                                        {
                                                            "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                                                            "author": "UnearthlyDinosaur",
                                                            "id": "hx93jr4",
                                                            "parent_id": "t1_hx8w5m5",
                                                            "score": 1,
                                                            "created_utc": 1645061732.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream.\n\nGood point.  SA is in legal defence posture and  your excellent words probably show up in their legal memos.",
                                            "author": "Hyceanplanet",
                                            "id": "hx9lahv",
                                            "parent_id": "t1_hx6uczz",
                                            "score": 1,
                                            "created_utc": 1645070060.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No thanks? It was annoying enough as it was.",
                            "author": "Whale_SD",
                            "id": "hx67w5q",
                            "parent_id": "t1_hx66fpg",
                            "score": 2,
                            "created_utc": 1645019671.0,
                            "replies": []
                        },
                        {
                            "body": "I find it significant.\n\nApps bury pages of legalese that no one reads. \n\nHere, SA is taking a very specific element and asking for explicit agreement.\n\nTechnically, the agreement covers more than activity on the site.\n\nIt's asking that users of the app agree that use of Seeking agree to how Seeking is used, broadly.\n\nThis doesn't change behavior, but it is an indication that SA is going to ban more aggressively.\n\nIn the past, if a user contacted SA and said that another person met on SA behaved badly, SA's raction might have been inconsistent.\n\nI trust that SA has excellent lawyers and are reacting to real existential issues. \n\nThese are adjustments, but, in the context of SA's business health, probably necessary.",
                            "author": "Hyceanplanet",
                            "id": "hx68n7t",
                            "parent_id": "t1_hx66fpg",
                            "score": 3,
                            "created_utc": 1645020022.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hx6cnby",
                    "parent_id": "t1_hx63oo5",
                    "score": 3,
                    "created_utc": 1645021806.0,
                    "replies": [
                        {
                            "body": "It is, I wasn't sure if you'd appreciate credit for it, or see it as being called out by username. Credit where credit is due though.\n\nI would have done it as a crosspost, but it didn't allow me.",
                            "author": "Whale_SD",
                            "id": "hx6oszh",
                            "parent_id": "t1_hx6cnby",
                            "score": 1,
                            "created_utc": 1645026731.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That ratio was already terrible.",
            "author": "Whale_SD",
            "id": "hx680pe",
            "parent_id": "t1_hx66wf8",
            "score": 2,
            "created_utc": 1645019731.0,
            "replies": [
                {
                    "body": "It's getting more terribler.",
                    "author": null,
                    "id": "hxawtsb",
                    "parent_id": "t1_hx680pe",
                    "score": 1,
                    "created_utc": 1645103010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yup, for quite some time now",
            "author": "mraspencer",
            "id": "hx67qaz",
            "parent_id": "t1_hx66b78",
            "score": 5,
            "created_utc": 1645019596.0,
            "replies": []
        },
        {
            "body": "It must be only new ones. I've not seen it either and I've been on the site since 2017.",
            "author": "Y_4Z44",
            "id": "hx6kgnr",
            "parent_id": "t1_hx6c2a3",
            "score": 1,
            "created_utc": 1645025037.0,
            "replies": []
        },
        {
            "body": "I just registered as a new member.  Nothin about a change for SDs, no form to agree too.  If they are selling something different to men and women?",
            "author": "fantastikal19",
            "id": "hx7jonp",
            "parent_id": "t1_hx6c2a3",
            "score": 1,
            "created_utc": 1645038836.0,
            "replies": []
        },
        {
            "body": "Yes, Seeking has had this policy for years.",
            "author": "Seeking_Arrangement",
            "id": "hx7rbmm",
            "parent_id": "t1_hx6m5bn",
            "score": 1,
            "created_utc": 1645041742.0,
            "replies": []
        },
        {
            "body": "Excellent point.  We usually mention FOSTA-SESTA but neglect to consider how other countries’ legal barriers to entry into their markets can drive decision-making across the site.",
            "author": "leyapaul",
            "id": "hx6wtqg",
            "parent_id": "t1_hx64ww1",
            "score": 2,
            "created_utc": 1645029774.0,
            "replies": []
        },
        {
            "body": "Thank you for your comment u/HailToTheQuinn!",
            "author": "SugarFetch",
            "id": "hx6ist2",
            "parent_id": "t1_hx6bdt2",
            "score": 5,
            "created_utc": 1645024376.0,
            "replies": [
                {
                    "body": "Welcome. I just joined yesterday.",
                    "author": "HailToTheQuinn",
                    "id": "hx6jbo2",
                    "parent_id": "t1_hx6ist2",
                    "score": 5,
                    "created_utc": 1645024585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's not really true.  When SA came along at first, there was a lifestyle expectations/allowance field. Back then, almost nobody thought platonic was an option.\n\nI think there's a disconnect in the user experience of SDs who started using the site around 2006 vs those that have always had to wade through the platonics, etc.\n\nSeeking is not what is was. That was an era where it's competition was putting up ads like these:  https://www.dailymail.co.uk/femail/article-2318390/Hey-students-need-summer-job-Controversial-billboards-dating-site-promotes-oral-sex-finding-sugar-daddy-aspirational-options.html\n\nI disagree that \"everyone knows\" SBs are not typically SBs forever. The new crowd will be different.\n\nI give it 3 years before the vast majority of SBs are not SBs at all just from user turnover. I give it maybe 1-2 years before SA is totally unuseable for everyone outside vanilla.",
            "author": "Whale_SD",
            "id": "hx6yzjg",
            "parent_id": "t1_hx6srue",
            "score": 2,
            "created_utc": 1645030580.0,
            "replies": [
                {
                    "body": "I agree with you. I feel that many of the folks here on SLF support and are used to a financially-based relationship, and there are also TikTokkers sending SBs to SA to try to score money. But I agree that it will shift over time, with more and more people coming to SA based on the current site's marketing and messaging and/or to score free dinners/yacht rides/etc. I'm sure there will still be a percentage of folks on the site who get more into intimacy and money, but that will shrink IMO.",
                    "author": "emptyoverflow",
                    "id": "hx814zu",
                    "parent_id": "t1_hx6yzjg",
                    "score": 2,
                    "created_utc": 1645045555.0,
                    "replies": []
                },
                {
                    "body": "Bring back those billboards! 🤣",
                    "author": "SDchat",
                    "id": "hx7goq3",
                    "parent_id": "t1_hx6yzjg",
                    "score": 0,
                    "created_utc": 1645037699.0,
                    "replies": []
                },
                {
                    "body": "Uhh.. platonics?  Do you honestly think vanilla dating is just platonic?  Tinder is platonic?  [Match.com](https://Match.com) is platonic?  Platonic has nothing to do with it",
                    "author": "Acrobatic_Half_6631",
                    "id": "hx89gjd",
                    "parent_id": "t1_hx6yzjg",
                    "score": 1,
                    "created_utc": 1645048792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL. Seeking Arrangement . The “arrangement” part… it’s pronounced silently.",
            "author": "SDchat",
            "id": "hx7ykvr",
            "parent_id": "t1_hx6vocy",
            "score": 1,
            "created_utc": 1645044572.0,
            "replies": []
        },
        {
            "body": "Shows how old my account is then. It was news to me.",
            "author": "Whale_SD",
            "id": "hx75090",
            "parent_id": "t1_hx73xy9",
            "score": 1,
            "created_utc": 1645032856.0,
            "replies": [
                {
                    "body": "Yeah, that dialog hasn’t changed in years, other than the removal of online",
                    "author": "Acrobatic_Half_6631",
                    "id": "hx89ppi",
                    "parent_id": "t1_hx75090",
                    "score": 1,
                    "created_utc": 1645048891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seeking seems to have forgotten who their paying client base is.\n\nMen, and a large percentage of those men are married.\n\nTo most women dating up has the intended goal of marriage, which is something 99% of seeking's male users are trying to avoid or can't do.\n\nBut I suspect Wade has always made his target audience himself, and if he is now willing to get married, I suspect he thinks his users can or will do the same.\n\nHe ignores that as a happily married man who'd never cheat, he'd never pay a site like SA/Dating Up for a membership.\n\nWhy would a rich guy need SA to find a gold digger? He can just step outside his house.\n\nThe move makes no sense to you because its a bad move.",
            "author": "Whale_SD",
            "id": "hxa3d5o",
            "parent_id": "t1_hx95tl8",
            "score": 1,
            "created_utc": 1645081366.0,
            "replies": []
        },
        {
            "body": "Could it be that he just wants What's Your Price to take off? I made one, didn't look at it, and had 33 offers. That means men spent A LOT of money in hopes of getting a \"date\" with me. Probably pretty lucrative for SA owner if it were to take off",
            "author": "NastySloth",
            "id": "hx9f9pg",
            "parent_id": "t1_hx95tl8",
            "score": 1,
            "created_utc": 1645066985.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "hx9f9q7",
                    "parent_id": "t1_hx9f9pg",
                    "score": 1,
                    "created_utc": 1645066986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> think initially you have to do that\n\nYes you do have to do that, and it's SA's fault.\n\nSeeking's own policies are why PPM have become so common. They've been setting the bar lower and lower, and telling what they see as potential SBs whatever it takes to get them onto the site. As a result you get a lot of women who have no real intention of being a SB. Simultaneously seeking has turned into a giant pool of naive women, which makes them a better target for scammers, PUAs etc.\n\nSo, now, women want cash, soon, up front, asap, to know you're serious, and SDs get burnt giving allowances a few times to people with no desire to be SBs. The only sane solution ends up being a weekly allowance or PPM, unless you have some overwhelming reason/need to avoid PPM at all costs.\n\nThat means the early stages of a sugar relationship can end up looking a lot like escorting even if the intent is a real relationship, which of course brings all the johns and escorts, because they can function in that kind of environment and take advantage of the situation.\n\nWhich is where we had been so far, with SA. Try to filter out the scammers, platonics, PUA. (Cash only, and when intimacy starts). Try to filter out the escorts and johns. (A few platonic dates, that no john or escort would tolerate). Then start the financial support, but not a month at a time.\n\nThe no PPM, at all, ever policy doesn't solve the problems PPM aims to fix. Those problem's are caused by SAs ad policy.",
            "author": "Whale_SD",
            "id": "hxa27f8",
            "parent_id": "t1_hx9ofuj",
            "score": 1,
            "created_utc": 1645080529.0,
            "replies": [
                {
                    "body": "You get scammers on bumble, and tinder and real life too. It’s just avoidable. 🤔\n\nI am a very inexperienced SB. I only just have got my first SD. So I probably don’t have much to say in that regard. But I don’t answer men who message - I can give you this much per night, what can you do? \n\nI am looking for an older sophisticated gentleman who can take care of me and provide mentorship so PPM definitely doesn’t help me find what I am looking for. I think it’s good seek provides the option that you can choose what you look for. If a guy says he wants emotional connection, mentorship, long term, etc.. I will definitely consider. If a guy says he wants casual fun, no strings attached etc, I will hesitate. \n\nYou just have to trust what they say on SA and arrange a few dates to get to know him then decide if he is the right candidate to be my SD. \n\nI don’t charge guys to meet for dinner or coffee as I am not providing a service. I choose you and I think I might like you so I go on a date with you. If I do like you very much, then I consider your offer. Basically this is how I process candidates on SA. \n\nEvery girl is different so I don’t have problems how others do. Maybe to some girls, sexual compatibility is very important, not personality, so she’d rather have sex on the first date. And that, I can’t see anything wrong either. It’s a free world. As long as you don’t force others, who can judge?",
                    "author": null,
                    "id": "hxc09e4",
                    "parent_id": "t1_hxa27f8",
                    "score": 1,
                    "created_utc": 1645119285.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, good luck telling a new SB that PPM is the norm after both tiktok and SA told her PPM isn't a thing.\n\nGet ready for those platonic allowance requests, now you're alongside the scammers in a warning not to share bank info.",
            "author": "Whale_SD",
            "id": "hx63wu4",
            "parent_id": "t1_hx635ls",
            "score": 4,
            "created_utc": 1645017726.0,
            "replies": []
        },
        {
            "body": "You're right, it was lifestyle expectations.",
            "author": "Whale_SD",
            "id": "hx70klx",
            "parent_id": "t1_hx6zsid",
            "score": 3,
            "created_utc": 1645031179.0,
            "replies": []
        },
        {
            "body": "Right, it was the “Lifestyle Expectation” profile field in *dollar amounts*. Is that kind of what you now mean by “Dating Up”?",
            "author": "SDchat",
            "id": "hx7bm11",
            "parent_id": "t1_hx6zsid",
            "score": 2,
            "created_utc": 1645035726.0,
            "replies": [
                {
                    "body": "Dating Up is for like-minded individuals looking to forge relationships on their own terms.",
                    "author": "Seeking_Arrangement",
                    "id": "hx7rtcy",
                    "parent_id": "t1_hx7bm11",
                    "score": 2,
                    "created_utc": 1645041933.0,
                    "replies": [
                        {
                            "body": "Wink wink, nudge nudge, know what I mean? say no more.\n\nhttps://youtu.be/53LRAxeKy2U?t=15",
                            "author": "Acrobatic_Half_6631",
                            "id": "hx8al8s",
                            "parent_id": "t1_hx7rtcy",
                            "score": 2,
                            "created_utc": 1645049243.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sucrose, maltose and dextrose are suitable alternatives.",
            "author": null,
            "id": "hx6mnjc",
            "parent_id": "t1_hx6fmxf",
            "score": 3,
            "created_utc": 1645025895.0,
            "replies": []
        },
        {
            "body": "They have been, officially it's at a report, but who knows.",
            "author": "Whale_SD",
            "id": "hx6oxkh",
            "parent_id": "t1_hx6nium",
            "score": 1,
            "created_utc": 1645026780.0,
            "replies": []
        },
        {
            "body": "I would leave that out of your chats and discuss anything involving finances outside of the site. SA can't really afford to have people on the site talking about exchanging money for stuff.",
            "author": "emptyoverflow",
            "id": "hx81ck1",
            "parent_id": "t1_hx6nium",
            "score": 1,
            "created_utc": 1645045639.0,
            "replies": []
        },
        {
            "body": "Yeah I think that we can only guess at, and I doubt they could tell us either. I could see a case for both directions. If they want to play it safe and align with perhaps where the times are going, then they would aggressively stamp it out (maybe while routing traffic to WYP). But if they stamp it out, will their traffic eventually fall as they become more of a \"elite dating\" clone?",
            "author": "emptyoverflow",
            "id": "hx81whd",
            "parent_id": "t1_hx6gbud",
            "score": 1,
            "created_utc": 1645045856.0,
            "replies": [
                {
                    "body": ">will their traffic eventually fall as they become more of a \"elite dating\" clone?\n\nThis! I don’t see how a “Dating Up” or “Millionaire Match” site could ever generate the very high membership numbers that SA had with sugar. \n\nAdd to that the dilution of the site into all of these conflicting member type categories, with everyone seeking a different version of whatever (sugar, platonic, online, non-transactional vanilla dating, “I want a millionaire“, etc.)",
                    "author": "SDchat",
                    "id": "hx8spu9",
                    "parent_id": "t1_hx81whd",
                    "score": 1,
                    "created_utc": 1645056852.0,
                    "replies": [
                        {
                            "body": "Yeah. I mean, I have not tried out the \"meet a millionaire\" type of dating sites, but I wonder what the experience is like for the millionaire members. Are there tons of scammers? Is it a big waste of time? Are OKC or Tinder ultimately better or easier? And why would I pay for it vs other vanilla dating sites?",
                            "author": "emptyoverflow",
                            "id": "hxcpiqi",
                            "parent_id": "t1_hx8spu9",
                            "score": 1,
                            "created_utc": 1645128696.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks!",
            "author": "Whale_SD",
            "id": "hx6p5y6",
            "parent_id": "t1_hx6egsz",
            "score": 1,
            "created_utc": 1645026871.0,
            "replies": []
        },
        {
            "body": "The problem is the ever growing pool of non sugar dating people on SA. Which I'll admit from a SBs perspective isn't bad yet. But the low quality (as in non SD/SB) users were mostly SBs (as a percentage). Dating up includes everybody, lets see what happens when you have to talk to ten guys offsite for every guy who's okay with an allowance or PPM. Odds are a few of the guys who are not okay with it will be reporting you. Then SA will start banning SBs too based on those reports.",
            "author": "Whale_SD",
            "id": "hxa2qpl",
            "parent_id": "t1_hx9742a",
            "score": 1,
            "created_utc": 1645080912.0,
            "replies": []
        },
        {
            "body": "Was “allowance” never a controversial word?  What are the women doing to get the “allowance?”\n\nMowing the lawn every Saturday and taking out the trash and the recyclables?  😆",
            "author": "ThrowawayUserID1501",
            "id": "hx6jnrv",
            "parent_id": "t1_hx694kd",
            "score": 11,
            "created_utc": 1645024720.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hx6nra3",
                    "parent_id": "t1_hx6jnrv",
                    "score": 6,
                    "created_utc": 1645026329.0,
                    "replies": [
                        {
                            "body": "> And is \"per date allowance\" really any different than PPM? I think not.\n\nIf SA uses an algorithm to detect naughty words, “allowance” would likely be on that list",
                            "author": "ThrowawayUserID1501",
                            "id": "hx6pvbb",
                            "parent_id": "t1_hx6nra3",
                            "score": 10,
                            "created_utc": 1645027140.0,
                            "replies": [
                                {
                                    "body": "I never mention anything on the site other than that I understand the financial support expectations. After we move to text, I will describe an arrangement in plain English without using any jargon or acronyms.",
                                    "author": "willfromvb",
                                    "id": "hx70qsw",
                                    "parent_id": "t1_hx6pvbb",
                                    "score": 5,
                                    "created_utc": 1645031246.0,
                                    "replies": [
                                        {
                                            "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
                                            "author": "ThrowawayUserID1501",
                                            "id": "hx7dmbq",
                                            "parent_id": "t1_hx70qsw",
                                            "score": 1,
                                            "created_utc": 1645036515.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah I use ppm all the time and it doesn't get flagged. I think sex did though. Got banned. In the processing of getting it back. Think I get once chance if I play it right",
                                    "author": "S-ADiap",
                                    "id": "hx8whs4",
                                    "parent_id": "t1_hx6pvbb",
                                    "score": 1,
                                    "created_utc": 1645058540.0,
                                    "replies": [
                                        {
                                            "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
                                            "author": "Chill_SD1974",
                                            "id": "hxchicx",
                                            "parent_id": "t1_hx8whs4",
                                            "score": 1,
                                            "created_utc": 1645125678.0,
                                            "replies": [
                                                {
                                                    "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                                                    "author": "S-ADiap",
                                                    "id": "hxj9olf",
                                                    "parent_id": "t1_hxchicx",
                                                    "score": 1,
                                                    "created_utc": 1645241023.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No it's not, but I feel it is clearer what I am offering and I would never use an acronym. Even if I used Pay Per Meet, I would never use the abbreviation and assume they know what PPM stands for. It just looks bad and looks too polished.",
                            "author": "willfromvb",
                            "id": "hx6zg7v",
                            "parent_id": "t1_hx6nra3",
                            "score": 1,
                            "created_utc": 1645030754.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Still better than “pocket money”, or worse, “salary”….",
                    "author": "Gee_n_tonic",
                    "id": "hx6m9ue",
                    "parent_id": "t1_hx6jnrv",
                    "score": 2,
                    "created_utc": 1645025744.0,
                    "replies": [
                        {
                            "body": "Oooof!  Agreed\n\n“Salary!”  Maybe on that new job website schtuprecruiter.com ! 😄",
                            "author": "ThrowawayUserID1501",
                            "id": "hx6v0uo",
                            "parent_id": "t1_hx6m9ue",
                            "score": 5,
                            "created_utc": 1645029103.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Allowance has never been a controversial term on SA.",
                    "author": "willfromvb",
                    "id": "hx6ysgy",
                    "parent_id": "t1_hx6jnrv",
                    "score": 1,
                    "created_utc": 1645030506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree. Adding this to my repertoire 👌",
            "author": "SDinChi",
            "id": "hx7cg0m",
            "parent_id": "t1_hx694kd",
            "score": 1,
            "created_utc": 1645036059.0,
            "replies": []
        },
        {
            "body": "This. People should already know what it entails, I think.",
            "author": "oneangstybiscuit",
            "id": "hx7ngr5",
            "parent_id": "t1_hx74gl4",
            "score": 2,
            "created_utc": 1645040272.0,
            "replies": []
        },
        {
            "body": ">I've outrightly used the term ppm, had SD's use the term ppm and discussed expectations on the site actually.\n\nThis appears to be changing, though.\n\nYou take a risk of losing access going forward.",
            "author": "Hyceanplanet",
            "id": "hx9kw75",
            "parent_id": "t1_hx8n04f",
            "score": 5,
            "created_utc": 1645069841.0,
            "replies": []
        },
        {
            "body": "I don't get why SBs have such low expectations. They put in a lot more time and effort than sex workers do and are not compensated commensurately.",
            "author": "AShatteredKing",
            "id": "hxb0z3m",
            "parent_id": "t1_hx8n04f",
            "score": 3,
            "created_utc": 1645105119.0,
            "replies": [
                {
                    "body": "It's definitely not the SBs who have low expectations usually, ime. I was fortunate to have met a few exceptionally generous daddies in the bowl over the last few years in the bowl. But as can be seen in the subs for sugar babies, there's a reason why SBs are encouraging other women to stick to their standards and complaining about fake daddies.",
                    "author": null,
                    "id": "hxb850u",
                    "parent_id": "t1_hxb0z3m",
                    "score": 2,
                    "created_utc": 1645108379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SBs.... or whatever you will be called now..... always got a pass.\n\n\nAs a SD I was banned, had to email a letter promising to be a good boy and was just recently warned about being nice when I said I had no need for a fat blue haired platonic girl in my life to someone.\nIt was a bad day....she just pushed my buttons.....\nI've learned to just block and move on, actually I knew better then but.....\n\n\nI just say xxx weekly allowance with weekly dates now.\n\n\n Off site I say each meet or ppm.",
            "author": "inafishbowl17",
            "id": "hx9agz7",
            "parent_id": "t1_hx8n04f",
            "score": 0,
            "created_utc": 1645064834.0,
            "replies": [
                {
                    "body": "I don't think there's anything wrong with ppm's, not much different than \"weekly allowance\". It's all just terminology and concepts - at the end of the day it's what each individual makes of it. I'm in a happy long term arrangement with one daddy atm for the past year and ongoing for probably many more. Best of luck.",
                    "author": null,
                    "id": "hx9i8r9",
                    "parent_id": "t1_hx9agz7",
                    "score": 1,
                    "created_utc": 1645068456.0,
                    "replies": [
                        {
                            "body": "There's absolutely no difference. Saying PPM gets a SD banned the other phrasing   seems to be OK.... so far.",
                            "author": "inafishbowl17",
                            "id": "hx9jtav",
                            "parent_id": "t1_hx9i8r9",
                            "score": 1,
                            "created_utc": 1645069271.0,
                            "replies": [
                                {
                                    "body": "Yeah that sucks ass and is indeed a double standard, sympathies about the ban...",
                                    "author": null,
                                    "id": "hx9k66l",
                                    "parent_id": "t1_hx9jtav",
                                    "score": 1,
                                    "created_utc": 1645069462.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And I believe they were blocked on the Apple store as well.",
            "author": "TwerkingAvocado",
            "id": "hx6doad",
            "parent_id": "t1_hx6d5hh",
            "score": 7,
            "created_utc": 1645022251.0,
            "replies": []
        },
        {
            "body": "Here's a NYT's article:\n\n[https://www.nytimes.com/2021/10/21/us/politics/matt-gaetz-justice-department.html](https://www.nytimes.com/2021/10/21/us/politics/matt-gaetz-justice-department.html)\n\nThere's a  minor involved -- hoo boy.\n\nIf SA is the source all of these women......",
            "author": "Hyceanplanet",
            "id": "hx70r5d",
            "parent_id": "t1_hx6kism",
            "score": 3,
            "created_utc": 1645031250.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hx7k66e",
                    "parent_id": "t1_hx70r5d",
                    "score": 6,
                    "created_utc": 1645039024.0,
                    "replies": [
                        {
                            "body": "That would be transformative -- a big hurdle and risk for the business with big upside.",
                            "author": "Hyceanplanet",
                            "id": "hx7n87z",
                            "parent_id": "t1_hx7k66e",
                            "score": 2,
                            "created_utc": 1645040182.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hx9qu20",
                                    "parent_id": "t1_hx7n87z",
                                    "score": 2,
                                    "created_utc": 1645073276.0,
                                    "replies": [
                                        {
                                            "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
                                            "author": "Hyceanplanet",
                                            "id": "hx9sb5e",
                                            "parent_id": "t1_hx9qu20",
                                            "score": 1,
                                            "created_utc": 1645074218.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean it doesn't really have any impact because what we all do is check the box and acknowledge, then discuss PPMs off the site. This hasn't stopped people from finding arrangements. I joined SA when the no-ppm policy was already in place but I knew what the site was about and had zero problem finding 2 good arrangements. Seeing \"no ppm\" didn't make me think \"oh this is a vanilla dating site\". So yeah it didn't have any impact, at least on me. As people have said in other threads this policy will likely attract more people looking for vanilla, but the ones looking for sugar will still be there. You'll just have to search harder",
            "author": "ufmon",
            "id": "hx66fpg",
            "parent_id": "t1_hx63oo5",
            "score": 6,
            "created_utc": 1645018984.0,
            "replies": [
                {
                    "body": "Now they are banning for no reason. And the “friends” tag shows they are openly promoting platonic relationships. The number of platonics has gone through the roof. SA loves platonics cause they don’t get the site into legal trouble.",
                    "author": "UnearthlyDinosaur",
                    "id": "hx6io59",
                    "parent_id": "t1_hx66fpg",
                    "score": 3,
                    "created_utc": 1645024323.0,
                    "replies": [
                        {
                            "body": "I would disagree. Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream. I agree it helps with their legal issues, but let's not kid ourselves, SA wants no one to use that tag, it doesn't help their business model, but having the tag does.",
                            "author": "WCSD74",
                            "id": "hx6uczz",
                            "parent_id": "t1_hx6io59",
                            "score": 1,
                            "created_utc": 1645028851.0,
                            "replies": [
                                {
                                    "body": "Paying SDs want actual sugar which SA now forbids. The front page of the site literally says “don’t sugar”. \n\nThey used to ban women for online only and now they don’t anymore.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hx72bow",
                                    "parent_id": "t1_hx6uczz",
                                    "score": 1,
                                    "created_utc": 1645031843.0,
                                    "replies": [
                                        {
                                            "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
                                            "author": "WCSD74",
                                            "id": "hx8w5m5",
                                            "parent_id": "t1_hx72bow",
                                            "score": 1,
                                            "created_utc": 1645058386.0,
                                            "replies": [
                                                {
                                                    "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                                                    "author": "UnearthlyDinosaur",
                                                    "id": "hx93jr4",
                                                    "parent_id": "t1_hx8w5m5",
                                                    "score": 1,
                                                    "created_utc": 1645061732.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream.\n\nGood point.  SA is in legal defence posture and  your excellent words probably show up in their legal memos.",
                                    "author": "Hyceanplanet",
                                    "id": "hx9lahv",
                                    "parent_id": "t1_hx6uczz",
                                    "score": 1,
                                    "created_utc": 1645070060.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No thanks? It was annoying enough as it was.",
                    "author": "Whale_SD",
                    "id": "hx67w5q",
                    "parent_id": "t1_hx66fpg",
                    "score": 2,
                    "created_utc": 1645019671.0,
                    "replies": []
                },
                {
                    "body": "I find it significant.\n\nApps bury pages of legalese that no one reads. \n\nHere, SA is taking a very specific element and asking for explicit agreement.\n\nTechnically, the agreement covers more than activity on the site.\n\nIt's asking that users of the app agree that use of Seeking agree to how Seeking is used, broadly.\n\nThis doesn't change behavior, but it is an indication that SA is going to ban more aggressively.\n\nIn the past, if a user contacted SA and said that another person met on SA behaved badly, SA's raction might have been inconsistent.\n\nI trust that SA has excellent lawyers and are reacting to real existential issues. \n\nThese are adjustments, but, in the context of SA's business health, probably necessary.",
                    "author": "Hyceanplanet",
                    "id": "hx68n7t",
                    "parent_id": "t1_hx66fpg",
                    "score": 3,
                    "created_utc": 1645020022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hx6cnby",
            "parent_id": "t1_hx63oo5",
            "score": 3,
            "created_utc": 1645021806.0,
            "replies": [
                {
                    "body": "It is, I wasn't sure if you'd appreciate credit for it, or see it as being called out by username. Credit where credit is due though.\n\nI would have done it as a crosspost, but it didn't allow me.",
                    "author": "Whale_SD",
                    "id": "hx6oszh",
                    "parent_id": "t1_hx6cnby",
                    "score": 1,
                    "created_utc": 1645026731.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's getting more terribler.",
            "author": null,
            "id": "hxawtsb",
            "parent_id": "t1_hx680pe",
            "score": 1,
            "created_utc": 1645103010.0,
            "replies": []
        },
        {
            "body": "Welcome. I just joined yesterday.",
            "author": "HailToTheQuinn",
            "id": "hx6jbo2",
            "parent_id": "t1_hx6ist2",
            "score": 5,
            "created_utc": 1645024585.0,
            "replies": []
        },
        {
            "body": "I agree with you. I feel that many of the folks here on SLF support and are used to a financially-based relationship, and there are also TikTokkers sending SBs to SA to try to score money. But I agree that it will shift over time, with more and more people coming to SA based on the current site's marketing and messaging and/or to score free dinners/yacht rides/etc. I'm sure there will still be a percentage of folks on the site who get more into intimacy and money, but that will shrink IMO.",
            "author": "emptyoverflow",
            "id": "hx814zu",
            "parent_id": "t1_hx6yzjg",
            "score": 2,
            "created_utc": 1645045555.0,
            "replies": []
        },
        {
            "body": "Bring back those billboards! 🤣",
            "author": "SDchat",
            "id": "hx7goq3",
            "parent_id": "t1_hx6yzjg",
            "score": 0,
            "created_utc": 1645037699.0,
            "replies": []
        },
        {
            "body": "Uhh.. platonics?  Do you honestly think vanilla dating is just platonic?  Tinder is platonic?  [Match.com](https://Match.com) is platonic?  Platonic has nothing to do with it",
            "author": "Acrobatic_Half_6631",
            "id": "hx89gjd",
            "parent_id": "t1_hx6yzjg",
            "score": 1,
            "created_utc": 1645048792.0,
            "replies": []
        },
        {
            "body": "Yeah, that dialog hasn’t changed in years, other than the removal of online",
            "author": "Acrobatic_Half_6631",
            "id": "hx89ppi",
            "parent_id": "t1_hx75090",
            "score": 1,
            "created_utc": 1645048891.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "hx9f9q7",
            "parent_id": "t1_hx9f9pg",
            "score": 1,
            "created_utc": 1645066986.0,
            "replies": []
        },
        {
            "body": "You get scammers on bumble, and tinder and real life too. It’s just avoidable. 🤔\n\nI am a very inexperienced SB. I only just have got my first SD. So I probably don’t have much to say in that regard. But I don’t answer men who message - I can give you this much per night, what can you do? \n\nI am looking for an older sophisticated gentleman who can take care of me and provide mentorship so PPM definitely doesn’t help me find what I am looking for. I think it’s good seek provides the option that you can choose what you look for. If a guy says he wants emotional connection, mentorship, long term, etc.. I will definitely consider. If a guy says he wants casual fun, no strings attached etc, I will hesitate. \n\nYou just have to trust what they say on SA and arrange a few dates to get to know him then decide if he is the right candidate to be my SD. \n\nI don’t charge guys to meet for dinner or coffee as I am not providing a service. I choose you and I think I might like you so I go on a date with you. If I do like you very much, then I consider your offer. Basically this is how I process candidates on SA. \n\nEvery girl is different so I don’t have problems how others do. Maybe to some girls, sexual compatibility is very important, not personality, so she’d rather have sex on the first date. And that, I can’t see anything wrong either. It’s a free world. As long as you don’t force others, who can judge?",
            "author": null,
            "id": "hxc09e4",
            "parent_id": "t1_hxa27f8",
            "score": 1,
            "created_utc": 1645119285.0,
            "replies": []
        },
        {
            "body": "Dating Up is for like-minded individuals looking to forge relationships on their own terms.",
            "author": "Seeking_Arrangement",
            "id": "hx7rtcy",
            "parent_id": "t1_hx7bm11",
            "score": 2,
            "created_utc": 1645041933.0,
            "replies": [
                {
                    "body": "Wink wink, nudge nudge, know what I mean? say no more.\n\nhttps://youtu.be/53LRAxeKy2U?t=15",
                    "author": "Acrobatic_Half_6631",
                    "id": "hx8al8s",
                    "parent_id": "t1_hx7rtcy",
                    "score": 2,
                    "created_utc": 1645049243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">will their traffic eventually fall as they become more of a \"elite dating\" clone?\n\nThis! I don’t see how a “Dating Up” or “Millionaire Match” site could ever generate the very high membership numbers that SA had with sugar. \n\nAdd to that the dilution of the site into all of these conflicting member type categories, with everyone seeking a different version of whatever (sugar, platonic, online, non-transactional vanilla dating, “I want a millionaire“, etc.)",
            "author": "SDchat",
            "id": "hx8spu9",
            "parent_id": "t1_hx81whd",
            "score": 1,
            "created_utc": 1645056852.0,
            "replies": [
                {
                    "body": "Yeah. I mean, I have not tried out the \"meet a millionaire\" type of dating sites, but I wonder what the experience is like for the millionaire members. Are there tons of scammers? Is it a big waste of time? Are OKC or Tinder ultimately better or easier? And why would I pay for it vs other vanilla dating sites?",
                    "author": "emptyoverflow",
                    "id": "hxcpiqi",
                    "parent_id": "t1_hx8spu9",
                    "score": 1,
                    "created_utc": 1645128696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hx6nra3",
            "parent_id": "t1_hx6jnrv",
            "score": 6,
            "created_utc": 1645026329.0,
            "replies": [
                {
                    "body": "> And is \"per date allowance\" really any different than PPM? I think not.\n\nIf SA uses an algorithm to detect naughty words, “allowance” would likely be on that list",
                    "author": "ThrowawayUserID1501",
                    "id": "hx6pvbb",
                    "parent_id": "t1_hx6nra3",
                    "score": 10,
                    "created_utc": 1645027140.0,
                    "replies": [
                        {
                            "body": "I never mention anything on the site other than that I understand the financial support expectations. After we move to text, I will describe an arrangement in plain English without using any jargon or acronyms.",
                            "author": "willfromvb",
                            "id": "hx70qsw",
                            "parent_id": "t1_hx6pvbb",
                            "score": 5,
                            "created_utc": 1645031246.0,
                            "replies": [
                                {
                                    "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
                                    "author": "ThrowawayUserID1501",
                                    "id": "hx7dmbq",
                                    "parent_id": "t1_hx70qsw",
                                    "score": 1,
                                    "created_utc": 1645036515.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah I use ppm all the time and it doesn't get flagged. I think sex did though. Got banned. In the processing of getting it back. Think I get once chance if I play it right",
                            "author": "S-ADiap",
                            "id": "hx8whs4",
                            "parent_id": "t1_hx6pvbb",
                            "score": 1,
                            "created_utc": 1645058540.0,
                            "replies": [
                                {
                                    "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
                                    "author": "Chill_SD1974",
                                    "id": "hxchicx",
                                    "parent_id": "t1_hx8whs4",
                                    "score": 1,
                                    "created_utc": 1645125678.0,
                                    "replies": [
                                        {
                                            "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                                            "author": "S-ADiap",
                                            "id": "hxj9olf",
                                            "parent_id": "t1_hxchicx",
                                            "score": 1,
                                            "created_utc": 1645241023.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No it's not, but I feel it is clearer what I am offering and I would never use an acronym. Even if I used Pay Per Meet, I would never use the abbreviation and assume they know what PPM stands for. It just looks bad and looks too polished.",
                    "author": "willfromvb",
                    "id": "hx6zg7v",
                    "parent_id": "t1_hx6nra3",
                    "score": 1,
                    "created_utc": 1645030754.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Still better than “pocket money”, or worse, “salary”….",
            "author": "Gee_n_tonic",
            "id": "hx6m9ue",
            "parent_id": "t1_hx6jnrv",
            "score": 2,
            "created_utc": 1645025744.0,
            "replies": [
                {
                    "body": "Oooof!  Agreed\n\n“Salary!”  Maybe on that new job website schtuprecruiter.com ! 😄",
                    "author": "ThrowawayUserID1501",
                    "id": "hx6v0uo",
                    "parent_id": "t1_hx6m9ue",
                    "score": 5,
                    "created_utc": 1645029103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Allowance has never been a controversial term on SA.",
            "author": "willfromvb",
            "id": "hx6ysgy",
            "parent_id": "t1_hx6jnrv",
            "score": 1,
            "created_utc": 1645030506.0,
            "replies": []
        },
        {
            "body": "It's definitely not the SBs who have low expectations usually, ime. I was fortunate to have met a few exceptionally generous daddies in the bowl over the last few years in the bowl. But as can be seen in the subs for sugar babies, there's a reason why SBs are encouraging other women to stick to their standards and complaining about fake daddies.",
            "author": null,
            "id": "hxb850u",
            "parent_id": "t1_hxb0z3m",
            "score": 2,
            "created_utc": 1645108379.0,
            "replies": []
        },
        {
            "body": "I don't think there's anything wrong with ppm's, not much different than \"weekly allowance\". It's all just terminology and concepts - at the end of the day it's what each individual makes of it. I'm in a happy long term arrangement with one daddy atm for the past year and ongoing for probably many more. Best of luck.",
            "author": null,
            "id": "hx9i8r9",
            "parent_id": "t1_hx9agz7",
            "score": 1,
            "created_utc": 1645068456.0,
            "replies": [
                {
                    "body": "There's absolutely no difference. Saying PPM gets a SD banned the other phrasing   seems to be OK.... so far.",
                    "author": "inafishbowl17",
                    "id": "hx9jtav",
                    "parent_id": "t1_hx9i8r9",
                    "score": 1,
                    "created_utc": 1645069271.0,
                    "replies": [
                        {
                            "body": "Yeah that sucks ass and is indeed a double standard, sympathies about the ban...",
                            "author": null,
                            "id": "hx9k66l",
                            "parent_id": "t1_hx9jtav",
                            "score": 1,
                            "created_utc": 1645069462.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hx7k66e",
            "parent_id": "t1_hx70r5d",
            "score": 6,
            "created_utc": 1645039024.0,
            "replies": [
                {
                    "body": "That would be transformative -- a big hurdle and risk for the business with big upside.",
                    "author": "Hyceanplanet",
                    "id": "hx7n87z",
                    "parent_id": "t1_hx7k66e",
                    "score": 2,
                    "created_utc": 1645040182.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hx9qu20",
                            "parent_id": "t1_hx7n87z",
                            "score": 2,
                            "created_utc": 1645073276.0,
                            "replies": [
                                {
                                    "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
                                    "author": "Hyceanplanet",
                                    "id": "hx9sb5e",
                                    "parent_id": "t1_hx9qu20",
                                    "score": 1,
                                    "created_utc": 1645074218.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Now they are banning for no reason. And the “friends” tag shows they are openly promoting platonic relationships. The number of platonics has gone through the roof. SA loves platonics cause they don’t get the site into legal trouble.",
            "author": "UnearthlyDinosaur",
            "id": "hx6io59",
            "parent_id": "t1_hx66fpg",
            "score": 3,
            "created_utc": 1645024323.0,
            "replies": [
                {
                    "body": "I would disagree. Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream. I agree it helps with their legal issues, but let's not kid ourselves, SA wants no one to use that tag, it doesn't help their business model, but having the tag does.",
                    "author": "WCSD74",
                    "id": "hx6uczz",
                    "parent_id": "t1_hx6io59",
                    "score": 1,
                    "created_utc": 1645028851.0,
                    "replies": [
                        {
                            "body": "Paying SDs want actual sugar which SA now forbids. The front page of the site literally says “don’t sugar”. \n\nThey used to ban women for online only and now they don’t anymore.",
                            "author": "UnearthlyDinosaur",
                            "id": "hx72bow",
                            "parent_id": "t1_hx6uczz",
                            "score": 1,
                            "created_utc": 1645031843.0,
                            "replies": [
                                {
                                    "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
                                    "author": "WCSD74",
                                    "id": "hx8w5m5",
                                    "parent_id": "t1_hx72bow",
                                    "score": 1,
                                    "created_utc": 1645058386.0,
                                    "replies": [
                                        {
                                            "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                                            "author": "UnearthlyDinosaur",
                                            "id": "hx93jr4",
                                            "parent_id": "t1_hx8w5m5",
                                            "score": 1,
                                            "created_utc": 1645061732.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream.\n\nGood point.  SA is in legal defence posture and  your excellent words probably show up in their legal memos.",
                            "author": "Hyceanplanet",
                            "id": "hx9lahv",
                            "parent_id": "t1_hx6uczz",
                            "score": 1,
                            "created_utc": 1645070060.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No thanks? It was annoying enough as it was.",
            "author": "Whale_SD",
            "id": "hx67w5q",
            "parent_id": "t1_hx66fpg",
            "score": 2,
            "created_utc": 1645019671.0,
            "replies": []
        },
        {
            "body": "I find it significant.\n\nApps bury pages of legalese that no one reads. \n\nHere, SA is taking a very specific element and asking for explicit agreement.\n\nTechnically, the agreement covers more than activity on the site.\n\nIt's asking that users of the app agree that use of Seeking agree to how Seeking is used, broadly.\n\nThis doesn't change behavior, but it is an indication that SA is going to ban more aggressively.\n\nIn the past, if a user contacted SA and said that another person met on SA behaved badly, SA's raction might have been inconsistent.\n\nI trust that SA has excellent lawyers and are reacting to real existential issues. \n\nThese are adjustments, but, in the context of SA's business health, probably necessary.",
            "author": "Hyceanplanet",
            "id": "hx68n7t",
            "parent_id": "t1_hx66fpg",
            "score": 3,
            "created_utc": 1645020022.0,
            "replies": []
        },
        {
            "body": "It is, I wasn't sure if you'd appreciate credit for it, or see it as being called out by username. Credit where credit is due though.\n\nI would have done it as a crosspost, but it didn't allow me.",
            "author": "Whale_SD",
            "id": "hx6oszh",
            "parent_id": "t1_hx6cnby",
            "score": 1,
            "created_utc": 1645026731.0,
            "replies": []
        },
        {
            "body": "Wink wink, nudge nudge, know what I mean? say no more.\n\nhttps://youtu.be/53LRAxeKy2U?t=15",
            "author": "Acrobatic_Half_6631",
            "id": "hx8al8s",
            "parent_id": "t1_hx7rtcy",
            "score": 2,
            "created_utc": 1645049243.0,
            "replies": []
        },
        {
            "body": "Yeah. I mean, I have not tried out the \"meet a millionaire\" type of dating sites, but I wonder what the experience is like for the millionaire members. Are there tons of scammers? Is it a big waste of time? Are OKC or Tinder ultimately better or easier? And why would I pay for it vs other vanilla dating sites?",
            "author": "emptyoverflow",
            "id": "hxcpiqi",
            "parent_id": "t1_hx8spu9",
            "score": 1,
            "created_utc": 1645128696.0,
            "replies": []
        },
        {
            "body": "> And is \"per date allowance\" really any different than PPM? I think not.\n\nIf SA uses an algorithm to detect naughty words, “allowance” would likely be on that list",
            "author": "ThrowawayUserID1501",
            "id": "hx6pvbb",
            "parent_id": "t1_hx6nra3",
            "score": 10,
            "created_utc": 1645027140.0,
            "replies": [
                {
                    "body": "I never mention anything on the site other than that I understand the financial support expectations. After we move to text, I will describe an arrangement in plain English without using any jargon or acronyms.",
                    "author": "willfromvb",
                    "id": "hx70qsw",
                    "parent_id": "t1_hx6pvbb",
                    "score": 5,
                    "created_utc": 1645031246.0,
                    "replies": [
                        {
                            "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
                            "author": "ThrowawayUserID1501",
                            "id": "hx7dmbq",
                            "parent_id": "t1_hx70qsw",
                            "score": 1,
                            "created_utc": 1645036515.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah I use ppm all the time and it doesn't get flagged. I think sex did though. Got banned. In the processing of getting it back. Think I get once chance if I play it right",
                    "author": "S-ADiap",
                    "id": "hx8whs4",
                    "parent_id": "t1_hx6pvbb",
                    "score": 1,
                    "created_utc": 1645058540.0,
                    "replies": [
                        {
                            "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
                            "author": "Chill_SD1974",
                            "id": "hxchicx",
                            "parent_id": "t1_hx8whs4",
                            "score": 1,
                            "created_utc": 1645125678.0,
                            "replies": [
                                {
                                    "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                                    "author": "S-ADiap",
                                    "id": "hxj9olf",
                                    "parent_id": "t1_hxchicx",
                                    "score": 1,
                                    "created_utc": 1645241023.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No it's not, but I feel it is clearer what I am offering and I would never use an acronym. Even if I used Pay Per Meet, I would never use the abbreviation and assume they know what PPM stands for. It just looks bad and looks too polished.",
            "author": "willfromvb",
            "id": "hx6zg7v",
            "parent_id": "t1_hx6nra3",
            "score": 1,
            "created_utc": 1645030754.0,
            "replies": []
        },
        {
            "body": "Oooof!  Agreed\n\n“Salary!”  Maybe on that new job website schtuprecruiter.com ! 😄",
            "author": "ThrowawayUserID1501",
            "id": "hx6v0uo",
            "parent_id": "t1_hx6m9ue",
            "score": 5,
            "created_utc": 1645029103.0,
            "replies": []
        },
        {
            "body": "There's absolutely no difference. Saying PPM gets a SD banned the other phrasing   seems to be OK.... so far.",
            "author": "inafishbowl17",
            "id": "hx9jtav",
            "parent_id": "t1_hx9i8r9",
            "score": 1,
            "created_utc": 1645069271.0,
            "replies": [
                {
                    "body": "Yeah that sucks ass and is indeed a double standard, sympathies about the ban...",
                    "author": null,
                    "id": "hx9k66l",
                    "parent_id": "t1_hx9jtav",
                    "score": 1,
                    "created_utc": 1645069462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That would be transformative -- a big hurdle and risk for the business with big upside.",
            "author": "Hyceanplanet",
            "id": "hx7n87z",
            "parent_id": "t1_hx7k66e",
            "score": 2,
            "created_utc": 1645040182.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hx9qu20",
                    "parent_id": "t1_hx7n87z",
                    "score": 2,
                    "created_utc": 1645073276.0,
                    "replies": [
                        {
                            "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
                            "author": "Hyceanplanet",
                            "id": "hx9sb5e",
                            "parent_id": "t1_hx9qu20",
                            "score": 1,
                            "created_utc": 1645074218.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would disagree. Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream. I agree it helps with their legal issues, but let's not kid ourselves, SA wants no one to use that tag, it doesn't help their business model, but having the tag does.",
            "author": "WCSD74",
            "id": "hx6uczz",
            "parent_id": "t1_hx6io59",
            "score": 1,
            "created_utc": 1645028851.0,
            "replies": [
                {
                    "body": "Paying SDs want actual sugar which SA now forbids. The front page of the site literally says “don’t sugar”. \n\nThey used to ban women for online only and now they don’t anymore.",
                    "author": "UnearthlyDinosaur",
                    "id": "hx72bow",
                    "parent_id": "t1_hx6uczz",
                    "score": 1,
                    "created_utc": 1645031843.0,
                    "replies": [
                        {
                            "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
                            "author": "WCSD74",
                            "id": "hx8w5m5",
                            "parent_id": "t1_hx72bow",
                            "score": 1,
                            "created_utc": 1645058386.0,
                            "replies": [
                                {
                                    "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                                    "author": "UnearthlyDinosaur",
                                    "id": "hx93jr4",
                                    "parent_id": "t1_hx8w5m5",
                                    "score": 1,
                                    "created_utc": 1645061732.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream.\n\nGood point.  SA is in legal defence posture and  your excellent words probably show up in their legal memos.",
                    "author": "Hyceanplanet",
                    "id": "hx9lahv",
                    "parent_id": "t1_hx6uczz",
                    "score": 1,
                    "created_utc": 1645070060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never mention anything on the site other than that I understand the financial support expectations. After we move to text, I will describe an arrangement in plain English without using any jargon or acronyms.",
            "author": "willfromvb",
            "id": "hx70qsw",
            "parent_id": "t1_hx6pvbb",
            "score": 5,
            "created_utc": 1645031246.0,
            "replies": [
                {
                    "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
                    "author": "ThrowawayUserID1501",
                    "id": "hx7dmbq",
                    "parent_id": "t1_hx70qsw",
                    "score": 1,
                    "created_utc": 1645036515.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I use ppm all the time and it doesn't get flagged. I think sex did though. Got banned. In the processing of getting it back. Think I get once chance if I play it right",
            "author": "S-ADiap",
            "id": "hx8whs4",
            "parent_id": "t1_hx6pvbb",
            "score": 1,
            "created_utc": 1645058540.0,
            "replies": [
                {
                    "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
                    "author": "Chill_SD1974",
                    "id": "hxchicx",
                    "parent_id": "t1_hx8whs4",
                    "score": 1,
                    "created_utc": 1645125678.0,
                    "replies": [
                        {
                            "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                            "author": "S-ADiap",
                            "id": "hxj9olf",
                            "parent_id": "t1_hxchicx",
                            "score": 1,
                            "created_utc": 1645241023.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah that sucks ass and is indeed a double standard, sympathies about the ban...",
            "author": null,
            "id": "hx9k66l",
            "parent_id": "t1_hx9jtav",
            "score": 1,
            "created_utc": 1645069462.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hx9qu20",
            "parent_id": "t1_hx7n87z",
            "score": 2,
            "created_utc": 1645073276.0,
            "replies": [
                {
                    "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
                    "author": "Hyceanplanet",
                    "id": "hx9sb5e",
                    "parent_id": "t1_hx9qu20",
                    "score": 1,
                    "created_utc": 1645074218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Paying SDs want actual sugar which SA now forbids. The front page of the site literally says “don’t sugar”. \n\nThey used to ban women for online only and now they don’t anymore.",
            "author": "UnearthlyDinosaur",
            "id": "hx72bow",
            "parent_id": "t1_hx6uczz",
            "score": 1,
            "created_utc": 1645031843.0,
            "replies": [
                {
                    "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
                    "author": "WCSD74",
                    "id": "hx8w5m5",
                    "parent_id": "t1_hx72bow",
                    "score": 1,
                    "created_utc": 1645058386.0,
                    "replies": [
                        {
                            "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                            "author": "UnearthlyDinosaur",
                            "id": "hx93jr4",
                            "parent_id": "t1_hx8w5m5",
                            "score": 1,
                            "created_utc": 1645061732.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Platonics don't bring in revenue. Their revenue stream is from paying SDs. The site being flooded with platonics can drive away their revenue stream.\n\nGood point.  SA is in legal defence posture and  your excellent words probably show up in their legal memos.",
            "author": "Hyceanplanet",
            "id": "hx9lahv",
            "parent_id": "t1_hx6uczz",
            "score": 1,
            "created_utc": 1645070060.0,
            "replies": []
        },
        {
            "body": "Thank you. I’ve registered an account there but never used it. I’m sure with proper execution it could be successful, if only due to the large user population",
            "author": "ThrowawayUserID1501",
            "id": "hx7dmbq",
            "parent_id": "t1_hx70qsw",
            "score": 1,
            "created_utc": 1645036515.0,
            "replies": []
        },
        {
            "body": "Banning the word “sex” seems extreme. Not saying you’re wrong, but doesn’t “dating up” generally lead to having sex?",
            "author": "Chill_SD1974",
            "id": "hxchicx",
            "parent_id": "t1_hx8whs4",
            "score": 1,
            "created_utc": 1645125678.0,
            "replies": [
                {
                    "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
                    "author": "S-ADiap",
                    "id": "hxj9olf",
                    "parent_id": "t1_hxchicx",
                    "score": 1,
                    "created_utc": 1645241023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Their first search option is by verified. \n\nBut, as you indicate, that won't bring up enough so probably no one searches by that.\n\nHowever they did put it first, which suggests they are thinking in the direction you are.\n\nIt's going to be hard to avoid being banned. I'm paying attention to learn the right words to use, but the people I'm communicating with will not know those things.\n\nBrandon is in a tough spot. It's going to be hard to sell the business for what it's worth, because the risks of it being shut down are always looming.\n\nSo far, he seems like a smart and adaptive business person. \n\nThe rate of banning is going to go to an entirely new level now.",
            "author": "Hyceanplanet",
            "id": "hx9sb5e",
            "parent_id": "t1_hx9qu20",
            "score": 1,
            "created_utc": 1645074218.0,
            "replies": []
        },
        {
            "body": "All I'm saying is there is a difference in what they say, and what they do or what us SD's to do. Saying don't sugar, and wanting their paying base of SDs to leave because we say \"don't sugar\" are two very,  very different things.",
            "author": "WCSD74",
            "id": "hx8w5m5",
            "parent_id": "t1_hx72bow",
            "score": 1,
            "created_utc": 1645058386.0,
            "replies": [
                {
                    "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
                    "author": "UnearthlyDinosaur",
                    "id": "hx93jr4",
                    "parent_id": "t1_hx8w5m5",
                    "score": 1,
                    "created_utc": 1645061732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Flagging, not banning; I think it was the thing that made my convo get flagged for a manual review or something, because I lost the \"intimacy\" euphemism and it immediately got me banned.",
            "author": "S-ADiap",
            "id": "hxj9olf",
            "parent_id": "t1_hxchicx",
            "score": 1,
            "created_utc": 1645241023.0,
            "replies": []
        },
        {
            "body": "But what I’m saying is that if we try to get sugar we get banned. So their stance DOES matter",
            "author": "UnearthlyDinosaur",
            "id": "hx93jr4",
            "parent_id": "t1_hx8w5m5",
            "score": 1,
            "created_utc": 1645061732.0,
            "replies": []
        }
    ]
}