{
    "title": "Gifting your SB is about HER not YOU",
    "post_id": "9aka6e",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9aka6e/gifting_your_sb_is_about_her_not_you/",
    "author": "DelicateDalliances",
    "body": "So I'm talking to someone and we start discussing gifts, reason why is not important. I say I'm avoiding material possessions that I don't need or truly love and don't want someone to waste their money on something I don't want (which is what happens a lot with SDs; I've thrown away a lot of \"gifts\" or just given them away).\n\nI tell this guy I'd love a gift card to a cooking class studio (I love food/cooking and prefer non-material gifts). He says its too much like cash so he doesn't like it. Ok fine, theres a pair of shoes I've wanted for work, thats really the only other thing I want thats in a reasonable price range that isn't a gift card.\n\nHe doesn't like that either and suggests instead nice chocolates we can share or lingerie I can model for him. \\*eyeroll\\*\n\n​\n\n​\n\nThis brings me to my point. **If the \"gift\" is about your enjoyment its not a gift for her its a gift for you.** I don't want a box of chocolates or lingerie (don't really eat sweets much and have enough lingerie for life thanks to these types of SDs).\n\n​\n\nA gift isn't thoughtful if its about what YOU want and not what the person receiving wants.\n\n​\n\n​\n\nEdit: Apparently I am entitled and crazy for not wanting someone to waste money buying me something I don't want. This person asked me what I would want as a gift. I told him and he decided he would rather get me something he wants. It is not entitled to want to prevent people from wasting their money.\n\nThis sub is ridiculous and a lot of you are terrible gift givers. \n\n​\n\n​\n\n​\n\n​",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9aka6e/gifting_your_sb_is_about_her_not_you/",
    "score": 171,
    "upvote_ratio": 0.87,
    "created_utc": 1535328447.0,
    "num_comments": 136,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4w4lxg",
            "parent_id": "t3_9aka6e",
            "score": 99,
            "created_utc": 1535331697.0,
            "replies": [
                {
                    "body": "I love that you took the time to look at her Pinterest account. Smart. Kudos to you! ",
                    "author": "SugarBunnyxo",
                    "id": "e4w5hia",
                    "parent_id": "t1_e4w4lxg",
                    "score": 35,
                    "created_utc": 1535332650.0,
                    "replies": []
                },
                {
                    "body": "Yes indeed, Pinterest is your friend when it comes to gift-giving. Ditto the Victoria Secret wishlist. As much as the SLF SBs are suddenly deciding today that they detest lingerie, every girl needs bras and panties, so why not buy her ones she likes? (Personally, I think women look sexier in their normal underwear than in wild, over-the-top lingerie, but that's a topic for another day lol)\n\n ",
                    "author": null,
                    "id": "e4wws4k",
                    "parent_id": "t1_e4w4lxg",
                    "score": 3,
                    "created_utc": 1535375108.0,
                    "replies": [
                        {
                            "body": "It’s not that I don’t like lingerie, I just have so much it’s wasteful. ",
                            "author": "DelicateDalliances",
                            "id": "e4x7949",
                            "parent_id": "t1_e4wws4k",
                            "score": 20,
                            "created_utc": 1535385330.0,
                            "replies": [
                                {
                                    "body": "I enjoy the sensation of having it ripped off but it is a waste after that one time use lol",
                                    "author": "tinyninjao_0",
                                    "id": "e4yfpch",
                                    "parent_id": "t1_e4x7949",
                                    "score": 3,
                                    "created_utc": 1535427164.0,
                                    "replies": []
                                },
                                {
                                    "body": "I was making a joke, and I get that many SB's closets are filled to overflowing with more corsets, teddies, bustiers and crotchless panties than they'll ever be able (or want) to wear. But, as I said, every woman likes new panties and bras for everyday wear (especially when they match), so I have her set up a wishlist at VS or wherever she gets her undies and select accordingly. ",
                                    "author": null,
                                    "id": "e4xpnim",
                                    "parent_id": "t1_e4x7949",
                                    "score": 5,
                                    "created_utc": 1535401205.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A girl at work (strip club) was sitting with a customer and was admiring another girl’s heels- he opened up amazon on his phone and bought them for her right then and there.\nSimple, easy, and she bragged about it to all the other girls too ; P",
            "author": "saintkatelyn",
            "id": "e4wd5kw",
            "parent_id": "t3_9aka6e",
            "score": 54,
            "created_utc": 1535341117.0,
            "replies": [
                {
                    "body": "Hope he got a lap dance anyway",
                    "author": "GSSD",
                    "id": "e4wu8wo",
                    "parent_id": "t1_e4wd5kw",
                    "score": 11,
                    "created_utc": 1535371885.0,
                    "replies": []
                },
                {
                    "body": "He could always cancel the order. Plus he now knows her address. ",
                    "author": "tannedsb05",
                    "id": "e4wxbtq",
                    "parent_id": "t1_e4wd5kw",
                    "score": 2,
                    "created_utc": 1535375737.0,
                    "replies": [
                        {
                            "body": "I always tell girls about the amazon wishlist scam, I’m sure it still happens but smart strippers get paid upfront. \nThere’s more to life than dances, at the club I’m at now guys do things like that because they’re genuinely nice, not because they’re trying to say “I spent $80 so give me $80 worth of dances”\n\nA good customer of mine was in a few nights ago and just handed me $400 and I checked on him periodically/had fun in between dances with other people all night. He had just finished up his divorce and his only sexual experiences were with his ex so he was really just looking for someone to vent with/talk to\n\nEdit: I assume he purchased it through his amazon account and will bring it to the club at a later date.",
                            "author": "saintkatelyn",
                            "id": "e4xe9wt",
                            "parent_id": "t1_e4wxbtq",
                            "score": 13,
                            "created_utc": 1535391468.0,
                            "replies": [
                                {
                                    "body": "Hopefully that’s the case with the amazon stuff. I’ve lost trust with people these days. \nIt’s cool that you are able to build up clientele with some regulars. Those are the ones you keep around. ",
                                    "author": "tannedsb05",
                                    "id": "e4xp03m",
                                    "parent_id": "t1_e4xe9wt",
                                    "score": 6,
                                    "created_utc": 1535400677.0,
                                    "replies": [
                                        {
                                            "body": "I’m actually really disappointed when I hear about girls who rinse clients, lead them on, etc. I scolded a girl the other day who took $500 from a guy she met outside the club who was expecting sex and drove off. \nI NEVER lie to customers about what I am comfortable with doing. The ones who are worth my time are the ones who are okay with just meeting inside the club and not trying to push boundaries.",
                                            "author": "saintkatelyn",
                                            "id": "e4xto9k",
                                            "parent_id": "t1_e4xp03m",
                                            "score": 8,
                                            "created_utc": 1535404557.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You assume he sent them to her and not himself to bring in to her. Dozens of ways this could play out. ",
                            "author": "mraspencer",
                            "id": "e4wxfdv",
                            "parent_id": "t1_e4wxbtq",
                            "score": 8,
                            "created_utc": 1535375851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4w3gnl",
            "parent_id": "t3_9aka6e",
            "score": 91,
            "created_utc": 1535330448.0,
            "replies": [
                {
                    "body": "This is cute! And the way to do it! This comment just made me happier than heck!!!",
                    "author": "99olives",
                    "id": "e4wblkf",
                    "parent_id": "t1_e4w3gnl",
                    "score": 17,
                    "created_utc": 1535339312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've had some short term SDs in the past who loved to gift but it was almost always shoes not to my taste, mani/pedi with specific colors, candies from his favorite store, perfume of his choosing etc. \n\n\nI accepted it then but I would turn them down now that I'm more experienced and older. It was controlling and those type of guys tend to hold those gifts over your head. It was all about feeding their fantasy and ego and bonus they get to call it generosity. \n\n\nPeople tell me I'm a great gifter and often ask what my secret is and it's literally just actually listening to people and remembering the things they say. You gift someone because you care about them and want to make them happy! \n\n\n\n",
            "author": "adequatelay",
            "id": "e4w3k5x",
            "parent_id": "t3_9aka6e",
            "score": 51,
            "created_utc": 1535330555.0,
            "replies": [
                {
                    "body": "EXACTLY. Gifts are supposed to be selfless not something that benefits you. ",
                    "author": "DelicateDalliances",
                    "id": "e4w3r2s",
                    "parent_id": "t1_e4w3k5x",
                    "score": 29,
                    "created_utc": 1535330771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow I cannot believe the amount of men posting on this thread bashing OP.  The same men complaining about SBs being cold and heartless and looking at everything as a business transaction are the ones who are saying if gifts weren’t “negotiated” into the original “agreement” then they have no say.  God forbid there be anything organic or fluid in a SR! If part of the arrangement includes a dynamic of gifting (unspoken or not) and doesn’t specify 1 gift a week or a price point that doesn’t mean it’s not still understood on both sides as a version of sugar! \n\nOP would probably be a lot less frustrated if her SD wasn’t **specifically asking** what she would like as a gift.  But the whole... asking and then blatantly ignoring what she says is wrong and it’s a control issue.  \n\nAnd for those who are harping on whether “gifts” are negotiated.. it doesn’t matter!  With the power dynamic of an arrangement, most men like this still consider the gift “sugar” (even if it’s outside of regular allowance) and usually expect some sort of extra special treatment for the “gift”.  \n\nThis happens in the vanilla world as well.. example: boyfriend says he wants to take you on vacation as a birthday present.... you say the beach or somewhere warm because you don’t like cold weather... your present ends up being his excuse to go skiing and god forbid you’re not be happy about your “holiday”... this mindset is so ass backwards I can’t even deal with it. \n\nWhy ask someone what they want if it’s just a song and dance for you to feel like what you’re doing is actually for the other person?  It’s one thing to be a clueless gifter it’s another thing to play power games with someone ",
            "author": "alexeySB",
            "id": "e4x54q6",
            "parent_id": "t3_9aka6e",
            "score": 30,
            "created_utc": 1535383435.0,
            "replies": [
                {
                    "body": "The men here are upset because I’m describing them",
                    "author": "DelicateDalliances",
                    "id": "e4x8hjj",
                    "parent_id": "t1_e4x54q6",
                    "score": 33,
                    "created_utc": 1535386433.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree that lots of presents are really not for the recipient at all, lingerie and sex toy 'gifts' being a prime example. It really surprises me when SD's think that these things are really a gift for me, rather than for themselves.\n\nMy birthday is coming up and my SD asked me for my neck size. I know it's a gift but I *really* do not want a necklace I will never wear. So I tactfully redirected him towards a similar type of item - a watch - that I actually want and gave him 9-10 options. He didn't acknowledge that message. Knowing him, I have a feeling that he's going to go for the necklace anyway because he personally wants the romantic fantasy feeling of buying his partner a necklace and lovingly placing it around her neck etc. \n\nThis self-centred form of gift-giving is new to me and something I never experienced before the bowl. \n\nI know technically gifts are for the giver to give so maybe it wasn't right to redirect him to something I actually want but I would feel bad receiving a gift I know I'll never use. I'd rather get nothing, it's a complete waste of money.",
            "author": "Callie-jay",
            "id": "e4w8c9l",
            "parent_id": "t3_9aka6e",
            "score": 38,
            "created_utc": 1535335721.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4wcl0x",
                    "parent_id": "t1_e4w8c9l",
                    "score": 10,
                    "created_utc": 1535340442.0,
                    "replies": [
                        {
                            "body": "I've had a few guys try to gift me jewelry before. Specifically earrings and I don't have my ears pierced. Awkward. :/\n\nI don't like receiving lingerie. Women's bra sizing is complicated enough as is without factoring in the different brands, materials and styles. Going together to pick something out is one thing but receiving something a guy just grabbed because he thinks it's about the right size and looks hot, having it fit horribly or not at all and then dude gets upset because you're annoyed-? Yeah. Stupid. \n\n",
                            "author": "CJ3500",
                            "id": "e4wdt1h",
                            "parent_id": "t1_e4wcl0x",
                            "score": 19,
                            "created_utc": 1535341910.0,
                            "replies": [
                                {
                                    "body": "I used to have lingerie on my wishlist and had a guy ignore all of it and instead buy me lingerie he thought was sexy which did not fit me AT ALL. I just threw it in the trash. What a waste. ",
                                    "author": "DelicateDalliances",
                                    "id": "e4we27g",
                                    "parent_id": "t1_e4wdt1h",
                                    "score": 10,
                                    "created_utc": 1535342227.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I've gotten some lacey frilly bits that are several sizes too small. Annoys the shit out of me especially when a guy insists that I squeeze into the damn thing even though I've told him that my tits aren't going to fit into those goddamn cups and that the band size is off by several inches. Absolute waste, ends up in the garbage and I hate doing that. Bah",
                                            "author": "CJ3500",
                                            "id": "e4weebf",
                                            "parent_id": "t1_e4we27g",
                                            "score": 10,
                                            "created_utc": 1535342659.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Right. Someone can get my some crap I'll throw away but wouldn't they rather not waste their money?",
                    "author": "DelicateDalliances",
                    "id": "e4wc38w",
                    "parent_id": "t1_e4w8c9l",
                    "score": 8,
                    "created_utc": 1535339869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with the principal behind your post. I definitely roll my eyes at guys who sing their own praises because they take their SBs on lingerie shopping trips. Between sugar, vanilla, and camming I have an insane lingerie collection that just gathers dust. I’m never going to turn it down, because that’s rude, but I agree that it’s not something that benefits me. If he wants to buy undergarments that benefit me they’re going to be much less cute and much more comfortable 😂. ",
            "author": "MASugarBaby",
            "id": "e4w2gtv",
            "parent_id": "t3_9aka6e",
            "score": 37,
            "created_utc": 1535329385.0,
            "replies": [
                {
                    "body": "I donated 20 bras last month because I had so many. Its not something I want at all and will have to get rid of. ",
                    "author": "DelicateDalliances",
                    "id": "e4w30lf",
                    "parent_id": "t1_e4w2gtv",
                    "score": 18,
                    "created_utc": 1535329978.0,
                    "replies": [
                        {
                            "body": "Is that called supporting your sisters ",
                            "author": "pinotandsugar",
                            "id": "e4w35j8",
                            "parent_id": "t1_e4w30lf",
                            "score": 36,
                            "created_utc": 1535330125.0,
                            "replies": [
                                {
                                    "body": "I almost spit out my drink when I read this. lol",
                                    "author": "SugeDaddio",
                                    "id": "e4w43g4",
                                    "parent_id": "t1_e4w35j8",
                                    "score": 7,
                                    "created_utc": 1535331143.0,
                                    "replies": []
                                },
                                {
                                    "body": "Wordsmith of the highest order...",
                                    "author": "tankbinding",
                                    "id": "e4x8d4o",
                                    "parent_id": "t1_e4w35j8",
                                    "score": 1,
                                    "created_utc": 1535386325.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Edit: Apparently I am entitled and crazy for not wanting someone to waste money buying me something I don't want. This person asked me what I would want as a gift. I told him and he decided he would rather get me something he wants. It is not entitled to want to prevent people from wasting their money.\n\n>This sub is ridiculous and a lot of you are terrible gift givers. \n\nLove this edit and am with you 100%.",
            "author": null,
            "id": "e4x57jf",
            "parent_id": "t3_9aka6e",
            "score": 22,
            "created_utc": 1535383504.0,
            "replies": []
        },
        {
            "body": "I like walking a SB into a store she likes and just saying \"Your budget is $xxx. If you get any change I want it back\". This way she'll find things she likes and remember where she got them. Allowance if for her to spend as she wants. My intention is to give her something special. \n\nOne SB, a single mother went to the children's section. She showed me outfits for her two boys that she picked.  I just smiled and said let's go ring them up. She rinsed me bad a few weeks later, but I still had some respect for her. I figured it went to the boys not drugs, fun times or drinking.  \n",
            "author": "TooOldForSD",
            "id": "e4xyv4s",
            "parent_id": "t3_9aka6e",
            "score": 10,
            "created_utc": 1535409505.0,
            "replies": []
        },
        {
            "body": "Well there are some SDs that only gift in cash like me. SBs know what they want and need and I don’t like being intrusive. \nI’ve found this works out the best. Neither side wastes a lot of time, neither sides intrudes on each other’s life and everyone gets what they want. ",
            "author": "clicking8",
            "id": "e4w5rtb",
            "parent_id": "t3_9aka6e",
            "score": 25,
            "created_utc": 1535332961.0,
            "replies": [
                {
                    "body": "Cash is always great. But at the same time, it can be really nice being gifted something that you want but wouldn't have bought yourself because there are other things the money could/ should go to.",
                    "author": "blonde-throwaway",
                    "id": "e4wrrg4",
                    "parent_id": "t1_e4w5rtb",
                    "score": 11,
                    "created_utc": 1535368015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had my SB set up a for daddy list on Amazon for the things she needed or wanted. ",
            "author": "Pondguy4you",
            "id": "e4wvclk",
            "parent_id": "t3_9aka6e",
            "score": 8,
            "created_utc": 1535373351.0,
            "replies": [
                {
                    "body": "Awesome! Just curious. What were the items on her list that you bought her? 🎁",
                    "author": "coolchic101",
                    "id": "e5qen20",
                    "parent_id": "t1_e4wvclk",
                    "score": 1,
                    "created_utc": 1536599598.0,
                    "replies": [
                        {
                            "body": "Sent you a PM",
                            "author": "Pondguy4you",
                            "id": "e5qhht4",
                            "parent_id": "t1_e5qen20",
                            "score": 1,
                            "created_utc": 1536602025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4w5gjq",
            "parent_id": "t3_9aka6e",
            "score": 26,
            "created_utc": 1535332621.0,
            "replies": [
                {
                    "body": "Yes that's the general point.",
                    "author": "DelicateDalliances",
                    "id": "e4wc8jo",
                    "parent_id": "t1_e4w5gjq",
                    "score": 8,
                    "created_utc": 1535340041.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hate gifts, personally. If you tell me an exact item you want okay, but if not, id rather just give the money and you buy what you like . ",
            "author": "sug4rdaddy",
            "id": "e4wmheb",
            "parent_id": "t3_9aka6e",
            "score": 6,
            "created_utc": 1535356661.0,
            "replies": [
                {
                    "body": "Yeah you can also put ca$h inside a greeting card and write your own personal message in it too. That’s another way to gift 🎁💰💕",
                    "author": "coolchic101",
                    "id": "e5qej11",
                    "parent_id": "t1_e4wmheb",
                    "score": 3,
                    "created_utc": 1536599503.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tldr: is it really a gift if it isn't something the recipient wants? No.",
            "author": "nini-jay",
            "id": "e4wvg88",
            "parent_id": "t3_9aka6e",
            "score": 12,
            "created_utc": 1535373483.0,
            "replies": [
                {
                    "body": "I totally disagree. My current SB gets me gifts I don't want or use (books i won't ever read; paintings she paints just for me (she's a terrible artist lol); a nice watch (I NEVER wear a watch and never will again; etc.). They're thoughtful in the sense that she clearly put some effort into choosing the gift. But just because she's a lousy gift-giver doesn't mean the sentiment behind the gift wasn't genuine.\n\nOn the other hand, I had a sugar baby a few years back who for Christmas got me a copy of my favorite novel signed by the author. I didn't ask for it, but it may be the best gift I ever got from anybody!",
                    "author": null,
                    "id": "e4x6992",
                    "parent_id": "t1_e4wvg88",
                    "score": 8,
                    "created_utc": 1535384445.0,
                    "replies": [
                        {
                            "body": "But those are surprise gifts. She didn’t ask what you wanted first and then ignore you",
                            "author": "DelicateDalliances",
                            "id": "e4x8mcq",
                            "parent_id": "t1_e4x6992",
                            "score": 16,
                            "created_utc": 1535386550.0,
                            "replies": [
                                {
                                    "body": "Exactly! It becomes this fake song and dance for no reason... surprise gifts, fine! But don’t play games with me when you’re trying to play out a fantasy ",
                                    "author": "alexeySB",
                                    "id": "e4x90qd",
                                    "parent_id": "t1_e4x8mcq",
                                    "score": 13,
                                    "created_utc": 1535386904.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have no problem with the OP being mad that her SD totally ignored her gift choices. I was just responding to u/nini-jay's comment that if *any* gift isn't desired by the recipient, it ceases to be a gift. I take issue with that. It's the thought that counts. OP's SD is clearly thoughtless.",
                                    "author": null,
                                    "id": "e4xpd30",
                                    "parent_id": "t1_e4x8mcq",
                                    "score": 4,
                                    "created_utc": 1535400967.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I think I could have phrased it better 🙃😅",
                                            "author": "nini-jay",
                                            "id": "e4xpid3",
                                            "parent_id": "t1_e4xpd30",
                                            "score": 5,
                                            "created_utc": 1535401085.0,
                                            "replies": [
                                                {
                                                    "body": "No worries. Otherwise you did a very nice job of reducing the OP's lengthy rant to a pithy tl;dr :D",
                                                    "author": null,
                                                    "id": "e4xpsng",
                                                    "parent_id": "t1_e4xpid3",
                                                    "score": 5,
                                                    "created_utc": 1535401323.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
                                                            "author": "nini-jay",
                                                            "id": "e4xpw57",
                                                            "parent_id": "t1_e4xpsng",
                                                            "score": 3,
                                                            "created_utc": 1535401401.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I suppose context is important. Idk...",
                            "author": "nini-jay",
                            "id": "e4x6bv5",
                            "parent_id": "t1_e4x6992",
                            "score": 2,
                            "created_utc": 1535384511.0,
                            "replies": []
                        },
                        {
                            "body": "I think thought and effort can really make up for it yeah...",
                            "author": "nini-jay",
                            "id": "e4x6iei",
                            "parent_id": "t1_e4x6992",
                            "score": 2,
                            "created_utc": 1535384674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": " Little louder for the people in the back. \n\nOne thing to add - I had an exSD once buy me a lower end version of the thing I wanted. \n\nWhy? I don’t know. Because it was cheaper? He wanted to get it sooner? I don’t fucking know. But don’t do that. If we link a certain brand or type, there’s probably a reason. ",
            "author": "seekingsweetsugar",
            "id": "e4w6qmk",
            "parent_id": "t3_9aka6e",
            "score": 27,
            "created_utc": 1535334001.0,
            "replies": [
                {
                    "body": "Could you share what you wanted and what you got, and why what you got wasn't satisfactory?",
                    "author": null,
                    "id": "e4x54jq",
                    "parent_id": "t1_e4w6qmk",
                    "score": 1,
                    "created_utc": 1535383430.0,
                    "replies": [
                        {
                            "body": "I'm genuinely curious, please answer IF you can . 😋😊😊❤️",
                            "author": "absthaw",
                            "id": "e5prd61",
                            "parent_id": "t1_e4x54jq",
                            "score": 1,
                            "created_utc": 1536573574.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4xbqo8",
            "parent_id": "t3_9aka6e",
            "score": 7,
            "created_utc": 1535389260.0,
            "replies": [
                {
                    "body": "Not even a sb (...yet) & this is immediately what I thought of. Makes the most sense.",
                    "author": null,
                    "id": "e50vjph",
                    "parent_id": "t1_e4xbqo8",
                    "score": 2,
                    "created_utc": 1535528893.0,
                    "replies": []
                },
                {
                    "body": "I have one and suggested items from it... ",
                    "author": "DelicateDalliances",
                    "id": "e4xk3dc",
                    "parent_id": "t1_e4xbqo8",
                    "score": 2,
                    "created_utc": 1535396577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Excellent point DD !",
            "author": "GSSD",
            "id": "e4wu6lz",
            "parent_id": "t3_9aka6e",
            "score": 4,
            "created_utc": 1535371795.0,
            "replies": []
        },
        {
            "body": "I’m so with you! Why would I want a sugar daddy that doesn’t care about me when he’s not around? I’d just get married then! Hah!",
            "author": "PizzaBeersTelly",
            "id": "e4wa24c",
            "parent_id": "t3_9aka6e",
            "score": 7,
            "created_utc": 1535337586.0,
            "replies": []
        },
        {
            "body": "He's likely projecting anger about is baby mamma getting court order to receive cash and likes the control of giving things instead of cash.",
            "author": "daniellederek",
            "id": "e4wjqs2",
            "parent_id": "t3_9aka6e",
            "score": 4,
            "created_utc": 1535351044.0,
            "replies": []
        },
        {
            "body": "A POT said she wanted something to keep her warm during the cold Canadian winters. So I bought her a snow shovel.",
            "author": "TooOldForSD",
            "id": "e4xxr18",
            "parent_id": "t3_9aka6e",
            "score": 3,
            "created_utc": 1535408396.0,
            "replies": []
        },
        {
            "body": "If the gift is just a gift, something extra, and not a negotiated part of the SR, then there’s not much you can do. He asked, you replied, and he wanted to do his own thing. You can either let this bother you or not. You can try to steer him towards something you’ll both find a good gift. At the end of the day, it’s his gift and his choice. You don’t have to provide him anything extra in return.\n\nMy approach to gifts: I have always tried to make my gifts useful for my SB. I encourage them to have an Amazon wishlist I can pick things off of and occasionally pick something on my own when I want to give her a true surprise. I think it’s in an SDs interest to provide gifts his SB will enjoy, because she’ll generally show great appreciation for it.\n\nAs far as lingerie, I’ve purchased lingerie for SBs who had interest in it, and have not for SBs who preferred something else. \n\n",
            "author": "midwesternguru",
            "id": "e4w5xit",
            "parent_id": "t3_9aka6e",
            "score": 3,
            "created_utc": 1535333131.0,
            "replies": [
                {
                    "body": "My SRs aren’t so sad that we negotiate gifts. ",
                    "author": "DelicateDalliances",
                    "id": "e4x8la2",
                    "parent_id": "t1_e4w5xit",
                    "score": 9,
                    "created_utc": 1535386526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just preface your opinion with:\n\n*In my opinion*, *IMO*, *IMHO* (Although, I'm guessing that this one **is not accurate**), et el...\n\nIMHO - You should just move on from this guy and wait for the right guy that intuitively gifts you a pair of  Christian Louboutin shoes or a gift card or just a pile of cash or whatever you want (**because it is - all about you**). Bail on these losers that want to shower you with lingerie or chocolate or whatever...\n\nAnd patiently wait for that just right guy to find you...\n\nIf he never reaches out, then just get the best job you can, live within your means and buy yourself the gifts you want if/when you can save up enough money for them...",
            "author": "tankbinding",
            "id": "e4x86t9",
            "parent_id": "t3_9aka6e",
            "score": 0,
            "created_utc": 1535386168.0,
            "replies": [
                {
                    "body": "Um.  Not for nothing.  But gifts are supposed to be about the person you are giving them too???  \n\n\n",
                    "author": "SDstartingOut",
                    "id": "e4yaa61",
                    "parent_id": "t1_e4x86t9",
                    "score": 4,
                    "created_utc": 1535421278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like cash,which works for anyone ,anytime. BUT---my SB uses it for her life necessities, like power bill,etc. I have to buy her a gift that she needs so that she will have a little spoiling.",
            "author": "GSSD",
            "id": "e4wue4b",
            "parent_id": "t3_9aka6e",
            "score": 1,
            "created_utc": 1535372084.0,
            "replies": []
        },
        {
            "body": "&#x200B;\n\n>Gifting your SB is about HER not YOU\n\nSigh, it's always about HER, I get it.\n\n&#x200B;",
            "author": "Red_Baron_17",
            "id": "e4w9h77",
            "parent_id": "t3_9aka6e",
            "score": -5,
            "created_utc": 1535336955.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4wclvy",
                    "parent_id": "t1_e4w9h77",
                    "score": 23,
                    "created_utc": 1535340470.0,
                    "replies": [
                        {
                            "body": "Thank you. Idk why people are disagreeing with me on this concept. ",
                            "author": "DelicateDalliances",
                            "id": "e4wdg4c",
                            "parent_id": "t1_e4wclvy",
                            "score": 18,
                            "created_utc": 1535341471.0,
                            "replies": [
                                {
                                    "body": "I think some people in this thread are the exact type of gift giver you described and are feeling exposed lol.",
                                    "author": "JewelofVA",
                                    "id": "e4wzn62",
                                    "parent_id": "t1_e4wdg4c",
                                    "score": 11,
                                    "created_utc": 1535378206.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I need to disagree with you on this one. I've NEVER had this type of reaction in vanilla life.\n\nMaybe the vanilla folks just don't receive the number of gifts expected by the SB types so they are more appreciative of whatever is gifted?",
                            "author": "SugeDaddio",
                            "id": "e4wrn7p",
                            "parent_id": "t1_e4wclvy",
                            "score": -5,
                            "created_utc": 1535367799.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "e4x0rz6",
                                    "parent_id": "t1_e4wrn7p",
                                    "score": 9,
                                    "created_utc": 1535379343.0,
                                    "replies": [
                                        {
                                            "body": "Another amusing part of this thread is the downvote brigade. They seem to be pretty organized when someone disagrees with them. :)\n\nSo, I'm going to guess gifting a SB flowers is also verboten?",
                                            "author": "SugeDaddio",
                                            "id": "e4x1cpd",
                                            "parent_id": "t1_e4x0rz6",
                                            "score": -2,
                                            "created_utc": 1535379906.0,
                                            "replies": [
                                                {
                                                    "body": "If you ask her what she wants from the store on your way to see her and she says food and you bring her flowers instead because you’d rather her be happy with flowers and it doesn’t fulfill your fantasy to provide her food then yes, that’s rude and weird.  \n\nIf you don’t ask and just show up with them then no of course that’s always welcome, even by people who dont love flowers.\n\nYour posts are all totally missing the major point which is he’s asking her need and then ignoring that need because he wants to stay in his fantasy.  Then don’t ask! It’s degrading to say “no dear, you don’t need that, I have decided after asking you what you need that you can’t decide for yourself so here is this instead! I am such a great man! “",
                                                    "author": "alexeySB",
                                                    "id": "e4x9s4l",
                                                    "parent_id": "t1_e4x1cpd",
                                                    "score": 9,
                                                    "created_utc": 1535387568.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
                                                            "author": "SugeDaddio",
                                                            "id": "e4xl0mz",
                                                            "parent_id": "t1_e4x9s4l",
                                                            "score": 1,
                                                            "created_utc": 1535397381.0,
                                                            "replies": [
                                                                {
                                                                    "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                                                                    "author": "alexeySB",
                                                                    "id": "e4xo1f6",
                                                                    "parent_id": "t1_e4xl0mz",
                                                                    "score": 4,
                                                                    "created_utc": 1535399883.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                                                                            "author": "SugeDaddio",
                                                                            "id": "e4xogek",
                                                                            "parent_id": "t1_e4xo1f6",
                                                                            "score": 1,
                                                                            "created_utc": 1535400233.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                                                                    "author": "alexeySB",
                                                                                    "id": "e4xpbmd",
                                                                                    "parent_id": "t1_e4xogek",
                                                                                    "score": 2,
                                                                                    "created_utc": 1535400935.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                                                                            "author": "SugeDaddio",
                                                                                            "id": "e4xqgqj",
                                                                                            "parent_id": "t1_e4xpbmd",
                                                                                            "score": 0,
                                                                                            "created_utc": 1535401876.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I think that's going to depend on discretion.  If you can do it in a discrete way (for both of you), I think most would be happy with a little surprise of lowers.\n\nOn the other hand, if you have an SB that has a boyfriend/husband, even if it's legitimately an open relationship... do you really think they want to be showing back up with flowers?  Probably not.  ",
                                                    "author": "SDstartingOut",
                                                    "id": "e4x1mvb",
                                                    "parent_id": "t1_e4x1cpd",
                                                    "score": 3,
                                                    "created_utc": 1535380185.0,
                                                    "replies": [
                                                        {
                                                            "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
                                                            "author": "SugeDaddio",
                                                            "id": "e4x1wa8",
                                                            "parent_id": "t1_e4x1mvb",
                                                            "score": 0,
                                                            "created_utc": 1535380438.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                                                                    "author": "alexeySB",
                                                                    "id": "e4x9twu",
                                                                    "parent_id": "t1_e4x1wa8",
                                                                    "score": 3,
                                                                    "created_utc": 1535387612.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Do you usually ask people what they want, ignore them, and tell them you’re getting them something they don’t want?",
                                    "author": "DelicateDalliances",
                                    "id": "e4x8cdj",
                                    "parent_id": "t1_e4wrn7p",
                                    "score": 6,
                                    "created_utc": 1535386306.0,
                                    "replies": [
                                        {
                                            "body": "Since it is a gift, I usually give them things I think they might like which they would never buy for themselves.\n\nI'm learning this won't work on the SBs here.\n\nPerhaps the sugar world needs it's own term, how does \"sugar gift\" sound? Because based on the expectations here, the word gift isn't what is being referred to.",
                                            "author": "SugeDaddio",
                                            "id": "e4x8tga",
                                            "parent_id": "t1_e4x8cdj",
                                            "score": 1,
                                            "created_utc": 1535386729.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Gifting anyone is about that person not you. ",
                    "author": "DelicateDalliances",
                    "id": "e4wcj7v",
                    "parent_id": "t1_e4w9h77",
                    "score": 11,
                    "created_utc": 1535340384.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kinda wondering here:\n\n*Gifts are not part of an arrangement are they? A non-required extra?*\n\nAre Gifts just an annoying inconvenience when the giver (a selfish prick obviously - because he got her what he wanted to buy her with his money vs what she really wanted) gets it wrong?\n\nHave you ever seen a child opening presents at their family Christmas tree and when they don't get exactly what they want - they either tell their family just that or quickly move on to the next gift they won't like?!?\n\nI tell you what - if one of my SBs showed up dressed sexy for me and it wasn't to my specific tastes - I wouldn't say shit - and I would reward her for the effort - but I'm pretty flexible I suppose...\n\nI always bring the tags / receipt so she can return it if she doesn't like it - or I suppose she could sell it on eBay - Lol",
            "author": "tankbinding",
            "id": "e4x9atb",
            "parent_id": "t3_9aka6e",
            "score": 0,
            "created_utc": 1535387147.0,
            "replies": [
                {
                    "body": "On Christmas though your family doesn’t ask what you want, ignore you, then buy something that makes them happy. That analogy just isn’t relevant. ",
                    "author": "DelicateDalliances",
                    "id": "e4xk4yn",
                    "parent_id": "t1_e4x9atb",
                    "score": 6,
                    "created_utc": 1535396617.0,
                    "replies": [
                        {
                            "body": "Wait: \n\nDon't parents ask their kids what they want - and kids tell their parents what they want? \n\nDon't parents often buy their kids something other than what the kids ask for (Lot's of kids ask for ponies right?!?)? \n\nDon't these entitled kids often seem ungrateful when they figure out (half-way through opening their present) that they did not get what they wanted?\n\nIrrelevant Analogy?!? I have to ask - Are you considering my comments or just being defensive? ",
                            "author": "tankbinding",
                            "id": "e4yfwcf",
                            "parent_id": "t1_e4xk4yn",
                            "score": -1,
                            "created_utc": 1535427393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t gift. That’s most efficient. To me the SB gets her allowance or ppm etc. Gifts are for the other awesome women in my life. ",
            "author": null,
            "id": "e4wdu9q",
            "parent_id": "t3_9aka6e",
            "score": -3,
            "created_utc": 1535341953.0,
            "replies": [
                {
                    "body": "I may have to follow your lead on this. ",
                    "author": "SugeDaddio",
                    "id": "e4wrods",
                    "parent_id": "t1_e4wdu9q",
                    "score": -1,
                    "created_utc": 1535367860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4w26qz",
            "parent_id": "t3_9aka6e",
            "score": -6,
            "created_utc": 1535329084.0,
            "replies": [
                {
                    "body": "We discussed gifts because he was going to get me a gift. Why else would we be discussing it. ",
                    "author": "DelicateDalliances",
                    "id": "e4w2zm9",
                    "parent_id": "t1_e4w26qz",
                    "score": 13,
                    "created_utc": 1535329949.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e4w4cmo",
                            "parent_id": "t1_e4w2zm9",
                            "score": -12,
                            "created_utc": 1535331418.0,
                            "replies": [
                                {
                                    "body": "He asked me what I would want for a gift. Why is this hard to understand. ",
                                    "author": "DelicateDalliances",
                                    "id": "e4wcbww",
                                    "parent_id": "t1_e4w4cmo",
                                    "score": 15,
                                    "created_utc": 1535340148.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "so it's not longer the thought that counts?",
            "author": "mraspencer",
            "id": "e4wacko",
            "parent_id": "t3_9aka6e",
            "score": -8,
            "created_utc": 1535337905.0,
            "replies": [
                {
                    "body": "Not if you're only thinking of yourself and someone has explicitly told you they don't want those things. ",
                    "author": "DelicateDalliances",
                    "id": "e4wc1ff",
                    "parent_id": "t1_e4wacko",
                    "score": 25,
                    "created_utc": 1535339811.0,
                    "replies": []
                },
                {
                    "body": "This thread has been a complete shock to me. Everything I'm reading is yelling \"if you want to do something nice for your SB, don't - they only want more cash and don't care how you feel about it\" which is kind of disappointing.\n\nI'm rarely surprised these days but this one has done just that.",
                    "author": "SugeDaddio",
                    "id": "e4wrik8",
                    "parent_id": "t1_e4wacko",
                    "score": -4,
                    "created_utc": 1535367554.0,
                    "replies": [
                        {
                            "body": ">\"if you want to do something nice for your SB, don't - they only want more cash and don't care how you feel about it\" \n\nYou are clearly reading a different thread or just weirdly inventing your own random narrative as not one single person has expressed that sentiment. ",
                            "author": "blonde-throwaway",
                            "id": "e4wscnh",
                            "parent_id": "t1_e4wrik8",
                            "score": 18,
                            "created_utc": 1535369016.0,
                            "replies": [
                                {
                                    "body": "Really? The only thing I added was the word cash but, based on the reactions, that's what they mean when they say buy me what I want not what you want to give me.",
                                    "author": "SugeDaddio",
                                    "id": "e4wszuy",
                                    "parent_id": "t1_e4wscnh",
                                    "score": -6,
                                    "created_utc": 1535370050.0,
                                    "replies": [
                                        {
                                            "body": "Ok so you're acknowledging that you're making things up. Good.",
                                            "author": "blonde-throwaway",
                                            "id": "e4wt8af",
                                            "parent_id": "t1_e4wszuy",
                                            "score": 16,
                                            "created_utc": 1535370401.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">buy me what I want not what you want to give me.\n\nThis is generally the correct approach to gift-giving.",
                                            "author": null,
                                            "id": "e4x5911",
                                            "parent_id": "t1_e4wszuy",
                                            "score": 12,
                                            "created_utc": 1535383540.0,
                                            "replies": [
                                                {
                                                    "body": "SMH.\n\nI'm learning that maybe the sugar world works that way but the real world most assuredly does not.\n\nLike I said in another post, this has been a true eye opener for me so I should thank you for that.\n\nI will also be sure to have this discussion with SBs and I will be walking away at the first sign of this kind of entitled behaviour.\n\nGood luck to you.",
                                                    "author": "SugeDaddio",
                                                    "id": "e4x5o1o",
                                                    "parent_id": "t1_e4x5911",
                                                    "score": -2,
                                                    "created_utc": 1535383911.0,
                                                    "replies": [
                                                        {
                                                            "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
                                                            "author": null,
                                                            "id": "e4xhyyx",
                                                            "parent_id": "t1_e4x5o1o",
                                                            "score": 9,
                                                            "created_utc": 1535394610.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                                                                    "author": "SugeDaddio",
                                                                    "id": "e4xio5j",
                                                                    "parent_id": "t1_e4xhyyx",
                                                                    "score": -1,
                                                                    "created_utc": 1535395311.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
                                                            "author": "alexeySB",
                                                            "id": "e4x9cnq",
                                                            "parent_id": "t1_e4x5o1o",
                                                            "score": 6,
                                                            "created_utc": 1535387192.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No the point is that if you ask someone what they want but ignore them and get what you want you’re a bad gift giver. ",
                            "author": "DelicateDalliances",
                            "id": "e4x8jhi",
                            "parent_id": "t1_e4wrik8",
                            "score": 9,
                            "created_utc": 1535386481.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You don't get to redefine what the word gift is lol.\n\nPlease admit that you are very lucky to complain about gifts, of all things. If you want an Amazon wish list, why don't you start a chaturbate page. A SD is a human being you are interacting with in the real world, so he is allowed to give you what he feels like giving you based on his experience with you (maybe lingerie is all he thinks about when thinking about you ...). If it's enough for you to be offended, please let him have someone who will appreciate his gestures.",
            "author": null,
            "id": "e4wvabl",
            "parent_id": "t3_9aka6e",
            "score": -4,
            "created_utc": 1535373267.0,
            "replies": [
                {
                    "body": "They get to redefine whatever they want apparently. :)",
                    "author": "SugeDaddio",
                    "id": "e4x66xx",
                    "parent_id": "t1_e4wvabl",
                    "score": 0,
                    "created_utc": 1535384390.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">A gift isn't thoughtful if its about what YOU want and not what the person receiving wants.\n\nThen don't accept the gift, no one is entitled to gifts and even less so to thoughtful ones.",
            "author": "Fjfiejenf",
            "id": "e4w317q",
            "parent_id": "t3_9aka6e",
            "score": -17,
            "created_utc": 1535329998.0,
            "replies": [
                {
                    "body": "So instead of communicating what I'd like so that the person doesn't waste their money, I should let them give me something I don't want and reject the gift? Makes sense. ",
                    "author": "DelicateDalliances",
                    "id": "e4w3pvz",
                    "parent_id": "t1_e4w317q",
                    "score": 29,
                    "created_utc": 1535330734.0,
                    "replies": [
                        {
                            "body": ">so that the person doesn't waste their money\n\nYou don't get the point of gifts, it's making ME happy by giving you something I like.\n\nSo maybe you want your rent paid instead of a diamond necklace, good for you but that doesn't do anything for me.",
                            "author": "Fjfiejenf",
                            "id": "e4w43yp",
                            "parent_id": "t1_e4w3pvz",
                            "score": -32,
                            "created_utc": 1535331159.0,
                            "replies": [
                                {
                                    "body": "The point of a gift is not to make yourself happy. If you are buying people you care about gifts to make yourself happy I feel bad for the people in your life. ",
                                    "author": "DelicateDalliances",
                                    "id": "e4wckxc",
                                    "parent_id": "t1_e4w43yp",
                                    "score": 22,
                                    "created_utc": 1535340439.0,
                                    "replies": []
                                },
                                {
                                    "body": "...what? What does a diamond necklace do for you? Meanwhile your SB has nice shiny things but could be late on her rent...",
                                    "author": "summerallya",
                                    "id": "e4w6gkc",
                                    "parent_id": "t1_e4w43yp",
                                    "score": 27,
                                    "created_utc": 1535333702.0,
                                    "replies": [
                                        {
                                            "body": "SDs here would rather their SB be homeless and uneducated wearing lingerie and diamonds in the street apparently. ",
                                            "author": "DelicateDalliances",
                                            "id": "e4wcm0i",
                                            "parent_id": "t1_e4w6gkc",
                                            "score": 30,
                                            "created_utc": 1535340473.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Are you almost done trolling SLF? ",
                                    "author": "tannedsb05",
                                    "id": "e4w77bk",
                                    "parent_id": "t1_e4w43yp",
                                    "score": 19,
                                    "created_utc": 1535334502.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "e4w7fr2",
                                            "parent_id": "t1_e4w77bk",
                                            "score": 21,
                                            "created_utc": 1535334752.0,
                                            "replies": [
                                                {
                                                    "body": "I fucking laughed out loud at this. Thank you. 👏🏻👏🏻❤️",
                                                    "author": "seekingsweetsugar",
                                                    "id": "e4wgjwx",
                                                    "parent_id": "t1_e4w7fr2",
                                                    "score": 11,
                                                    "created_utc": 1535345669.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This post sounds incredibly bratty and entitled. As a practical person, I hate wasting money on gifts that the recipient won’t like, so of course I try to be thoughtful about what I give. However, I wouldn’t expect even a five-year-old to be so demanding about it. Sheesh, even they are taught that it’s the thought that counts. I really don’t understand the point of this post. Who are you trying to help here?",
            "author": "sd_90210",
            "id": "e4w4grs",
            "parent_id": "t3_9aka6e",
            "score": -27,
            "created_utc": 1535331542.0,
            "replies": [
                {
                    "body": "How is it entitled to tell someone you don't want them to waste their money on something you won't ever use?",
                    "author": "DelicateDalliances",
                    "id": "e4wc6fa",
                    "parent_id": "t1_e4w4grs",
                    "score": 21,
                    "created_utc": 1535339973.0,
                    "replies": []
                },
                {
                    "body": "Good thing she’s not a 5 year old. She is telling him what she wants. Why would he rather waste money to go in the trash? ",
                    "author": "tannedsb05",
                    "id": "e4w7as6",
                    "parent_id": "t1_e4w4grs",
                    "score": 31,
                    "created_utc": 1535334606.0,
                    "replies": [
                        {
                            "body": "She gave him two options that he didn’t like.  He can do whatever he wants with his money.  If I were him, I wouldn’t give her anything and would start looking for a new SB. ",
                            "author": "sd_90210",
                            "id": "e4w7k0a",
                            "parent_id": "t1_e4w7as6",
                            "score": -24,
                            "created_utc": 1535334877.0,
                            "replies": [
                                {
                                    "body": "Why bother asking someone what they'd like as a gift if you don't care what they actually want?",
                                    "author": "DelicateDalliances",
                                    "id": "e4wcb9t",
                                    "parent_id": "t1_e4w7k0a",
                                    "score": 22,
                                    "created_utc": 1535340127.0,
                                    "replies": []
                                },
                                {
                                    "body": "That would be your choice ",
                                    "author": "tannedsb05",
                                    "id": "e4w7l7s",
                                    "parent_id": "t1_e4w7k0a",
                                    "score": 14,
                                    "created_utc": 1535334913.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Who are you trying to help here?\n\nHerself. :)",
                    "author": "SugeDaddio",
                    "id": "e4w5ip1",
                    "parent_id": "t1_e4w4grs",
                    "score": -10,
                    "created_utc": 1535332686.0,
                    "replies": [
                        {
                            "body": "Advice for SDs and also venting. ",
                            "author": "DelicateDalliances",
                            "id": "e4wdha4",
                            "parent_id": "t1_e4w5ip1",
                            "score": 15,
                            "created_utc": 1535341511.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you should look up the definition of the word \"gift\", you may have it confused with allowance.\n\nSpoiler; one is freely given and the other is negotiated.",
            "author": "SugeDaddio",
            "id": "e4w267r",
            "parent_id": "t3_9aka6e",
            "score": -23,
            "created_utc": 1535329069.0,
            "replies": [
                {
                    "body": "Right. So when someone asks me what I would like as a gift they should accept what I say I want and not negotiate with me like he did. \n\n&#x200B;\n\nYou're proving my point. ",
                    "author": "DelicateDalliances",
                    "id": "e4w2yjs",
                    "parent_id": "t1_e4w267r",
                    "score": 24,
                    "created_utc": 1535329915.0,
                    "replies": [
                        {
                            "body": "No, I'm not. I'm just showing that what you are calling a gift isn't truly a gift. You called it a gift.\n\n>gift\n>ɡift/\n>noun\n>noun: gift; plural noun: gifts\n>\n>    1.\n>    a thing given willingly to someone without payment; a present.\n>    \"a Christmas gift\"\n>    synonyms:\tpresent, handout, donation, offering, bestowal, bonus, award, endowment; ",
                            "author": "SugeDaddio",
                            "id": "e4w3elp",
                            "parent_id": "t1_e4w2yjs",
                            "score": -12,
                            "created_utc": 1535330389.0,
                            "replies": [
                                {
                                    "body": "Ok so when you get a gift for someone you don't bother to look into what they want, you just get them something you want? That's how you give gifts? \n\n&#x200B;\n\nHe asked me what I wanted and then said no to my suggestion. He said no to my second suggestion. He then suggested things he wanted. Explain how thats a gift?",
                                    "author": "DelicateDalliances",
                                    "id": "e4w3mem",
                                    "parent_id": "t1_e4w3elp",
                                    "score": 24,
                                    "created_utc": 1535330625.0,
                                    "replies": [
                                        {
                                            "body": "When I give a gift, I give something I think they will like and enjoy. I try to be thoughtful.\n\nIf I want to be helpful and I ask what they need, I don't consider that a gift - it's more of a hand up.\n\nStill, it sounds to me like your negotiating over your allowance.",
                                            "author": "SugeDaddio",
                                            "id": "e4w3zxw",
                                            "parent_id": "t1_e4w3mem",
                                            "score": -3,
                                            "created_utc": 1535331039.0,
                                            "replies": [
                                                {
                                                    "body": "How is it negotiating to tell someone what I would like as a gift when they ask me?",
                                                    "author": "DelicateDalliances",
                                                    "id": "e4wcddd",
                                                    "parent_id": "t1_e4w3zxw",
                                                    "score": 14,
                                                    "created_utc": 1535340194.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "First of all, I agree with you.\n\nHowever, perhaps you should be telling him this and not preaching to the rest of us. What is the purpose of this post? I'm struggling to understand how it benefits you resolve your predicament with your SD.",
            "author": "sehns",
            "id": "e4wx1n0",
            "parent_id": "t3_9aka6e",
            "score": -3,
            "created_utc": 1535375416.0,
            "replies": [
                {
                    "body": "I did tell him this, this post doesn’t cover everything that happened. . The point of the post is to talk about a pervasive issue and tell SDs how SBs feel",
                    "author": "DelicateDalliances",
                    "id": "e4x898p",
                    "parent_id": "t1_e4wx1n0",
                    "score": 7,
                    "created_utc": 1535386228.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "e4wxd0y",
                    "parent_id": "t1_e4wx1n0",
                    "score": -4,
                    "created_utc": 1535375775.0,
                    "replies": [
                        {
                            "body": "> harridan\n\nWell I learned a fun new word today (although the internet tells me it also means \"old,\" which I'm assuming OP isn't).\n\nEDIT: Apparently another fun word is \"termagant.\"  There are a lot of interesting words in the English language for cantankerous women, it seems.\n\nI would've gone with virago instead.",
                            "author": null,
                            "id": "e4x5lza",
                            "parent_id": "t1_e4wxd0y",
                            "score": 3,
                            "created_utc": 1535383859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4wq7wu",
            "parent_id": "t3_9aka6e",
            "score": -5,
            "created_utc": 1535365018.0,
            "replies": [
                {
                    "body": "Did you read the post? I know 'Communicate' is the general, cookie cutter answer from lazy people reading a thread but it's particularly useless in this instance. She *did* communicate. The issue here isn't due to a lack of communication.",
                    "author": "sb105",
                    "id": "e4x3h6u",
                    "parent_id": "t1_e4wq7wu",
                    "score": 11,
                    "created_utc": 1535381917.0,
                    "replies": []
                },
                {
                    "body": "I didn’t type out our entire conversation. I told him basically exactly what I said here",
                    "author": "DelicateDalliances",
                    "id": "e4x8asp",
                    "parent_id": "t1_e4wq7wu",
                    "score": 1,
                    "created_utc": 1535386266.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e4xbbgu",
                            "parent_id": "t1_e4x8asp",
                            "score": 0,
                            "created_utc": 1535388897.0,
                            "replies": [
                                {
                                    "body": "I ceased conversation with this person for a number of reasons. ",
                                    "author": "DelicateDalliances",
                                    "id": "e4xkbyk",
                                    "parent_id": "t1_e4xbbgu",
                                    "score": 3,
                                    "created_utc": 1535396788.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4wb6qn",
            "parent_id": "t3_9aka6e",
            "score": -21,
            "created_utc": 1535338843.0,
            "replies": [
                {
                    "body": "Your attitude is not welcome on SLF. You are banned from participating here. Your other post will be removed",
                    "author": "LaSirene23",
                    "id": "e4x24fc",
                    "parent_id": "t1_e4wb6qn",
                    "score": 10,
                    "created_utc": 1535380655.0,
                    "replies": []
                },
                {
                    "body": "I have a full time job. You're just whorephobic and ignorant. ",
                    "author": "DelicateDalliances",
                    "id": "e4wc0lx",
                    "parent_id": "t1_e4wb6qn",
                    "score": 18,
                    "created_utc": 1535339786.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "e4wgwt2",
                            "parent_id": "t1_e4wc0lx",
                            "score": -12,
                            "created_utc": 1535346208.0,
                            "replies": [
                                {
                                    "body": "Words from this poster \"your attitude is ugly\" \n\nAlso from this poster \"SRs are shallow and I cheat on my wife.\" \n\nI got at least 1 Yike. ",
                                    "author": "2catsandacomputer",
                                    "id": "e4wid3u",
                                    "parent_id": "t1_e4wgwt2",
                                    "score": 14,
                                    "created_utc": 1535348580.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "e4wkkza",
                                            "parent_id": "t1_e4wid3u",
                                            "score": -9,
                                            "created_utc": 1535352652.0,
                                            "replies": [
                                                {
                                                    "body": "Enjoy your ban, cheating douchebag :)",
                                                    "author": "2catsandacomputer",
                                                    "id": "e4wkxu6",
                                                    "parent_id": "t1_e4wkkza",
                                                    "score": 10,
                                                    "created_utc": 1535353359.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A company pays me salary and then also does me the favor of offering me benefits. I am cribbing that the benefits are designed to benefit the company and not me. Fact is they benefit me, but are not perfect for all my needs. So I complain.  I got to remember I get this package (salary and benefits) when it’s first hard to get a job that pays as well as this one does and second when most other jobs don’t even mention the word benefit when they hire you. \n\nAm I entitled?",
            "author": null,
            "id": "e4wxkaa",
            "parent_id": "t3_9aka6e",
            "score": -7,
            "created_utc": 1535376002.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4x2s8n",
                    "parent_id": "t1_e4wxkaa",
                    "score": 13,
                    "created_utc": 1535381271.0,
                    "replies": [
                        {
                            "body": "Lol how can you compare lingerie to health care. \nThanks for being a rational person. ",
                            "author": "DelicateDalliances",
                            "id": "e4x8go8",
                            "parent_id": "t1_e4x2s8n",
                            "score": 8,
                            "created_utc": 1535386412.0,
                            "replies": [
                                {
                                    "body": "I'll take things older generations have never had to struggle with for $400, Alex. ",
                                    "author": "2catsandacomputer",
                                    "id": "e4xhmla",
                                    "parent_id": "t1_e4x8go8",
                                    "score": 8,
                                    "created_utc": 1535394316.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4x1dru",
                    "parent_id": "t1_e4wxkaa",
                    "score": 4,
                    "created_utc": 1535379934.0,
                    "replies": [
                        {
                            "body": "> want their employees to be dressed in a certain uniform\n\nWow - Just Wow...",
                            "author": "tankbinding",
                            "id": "e4x9jy7",
                            "parent_id": "t1_e4x1dru",
                            "score": 2,
                            "created_utc": 1535387367.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love that you took the time to look at her Pinterest account. Smart. Kudos to you! ",
            "author": "SugarBunnyxo",
            "id": "e4w5hia",
            "parent_id": "t1_e4w4lxg",
            "score": 35,
            "created_utc": 1535332650.0,
            "replies": []
        },
        {
            "body": "Yes indeed, Pinterest is your friend when it comes to gift-giving. Ditto the Victoria Secret wishlist. As much as the SLF SBs are suddenly deciding today that they detest lingerie, every girl needs bras and panties, so why not buy her ones she likes? (Personally, I think women look sexier in their normal underwear than in wild, over-the-top lingerie, but that's a topic for another day lol)\n\n ",
            "author": null,
            "id": "e4wws4k",
            "parent_id": "t1_e4w4lxg",
            "score": 3,
            "created_utc": 1535375108.0,
            "replies": [
                {
                    "body": "It’s not that I don’t like lingerie, I just have so much it’s wasteful. ",
                    "author": "DelicateDalliances",
                    "id": "e4x7949",
                    "parent_id": "t1_e4wws4k",
                    "score": 20,
                    "created_utc": 1535385330.0,
                    "replies": [
                        {
                            "body": "I enjoy the sensation of having it ripped off but it is a waste after that one time use lol",
                            "author": "tinyninjao_0",
                            "id": "e4yfpch",
                            "parent_id": "t1_e4x7949",
                            "score": 3,
                            "created_utc": 1535427164.0,
                            "replies": []
                        },
                        {
                            "body": "I was making a joke, and I get that many SB's closets are filled to overflowing with more corsets, teddies, bustiers and crotchless panties than they'll ever be able (or want) to wear. But, as I said, every woman likes new panties and bras for everyday wear (especially when they match), so I have her set up a wishlist at VS or wherever she gets her undies and select accordingly. ",
                            "author": null,
                            "id": "e4xpnim",
                            "parent_id": "t1_e4x7949",
                            "score": 5,
                            "created_utc": 1535401205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hope he got a lap dance anyway",
            "author": "GSSD",
            "id": "e4wu8wo",
            "parent_id": "t1_e4wd5kw",
            "score": 11,
            "created_utc": 1535371885.0,
            "replies": []
        },
        {
            "body": "He could always cancel the order. Plus he now knows her address. ",
            "author": "tannedsb05",
            "id": "e4wxbtq",
            "parent_id": "t1_e4wd5kw",
            "score": 2,
            "created_utc": 1535375737.0,
            "replies": [
                {
                    "body": "I always tell girls about the amazon wishlist scam, I’m sure it still happens but smart strippers get paid upfront. \nThere’s more to life than dances, at the club I’m at now guys do things like that because they’re genuinely nice, not because they’re trying to say “I spent $80 so give me $80 worth of dances”\n\nA good customer of mine was in a few nights ago and just handed me $400 and I checked on him periodically/had fun in between dances with other people all night. He had just finished up his divorce and his only sexual experiences were with his ex so he was really just looking for someone to vent with/talk to\n\nEdit: I assume he purchased it through his amazon account and will bring it to the club at a later date.",
                    "author": "saintkatelyn",
                    "id": "e4xe9wt",
                    "parent_id": "t1_e4wxbtq",
                    "score": 13,
                    "created_utc": 1535391468.0,
                    "replies": [
                        {
                            "body": "Hopefully that’s the case with the amazon stuff. I’ve lost trust with people these days. \nIt’s cool that you are able to build up clientele with some regulars. Those are the ones you keep around. ",
                            "author": "tannedsb05",
                            "id": "e4xp03m",
                            "parent_id": "t1_e4xe9wt",
                            "score": 6,
                            "created_utc": 1535400677.0,
                            "replies": [
                                {
                                    "body": "I’m actually really disappointed when I hear about girls who rinse clients, lead them on, etc. I scolded a girl the other day who took $500 from a guy she met outside the club who was expecting sex and drove off. \nI NEVER lie to customers about what I am comfortable with doing. The ones who are worth my time are the ones who are okay with just meeting inside the club and not trying to push boundaries.",
                                    "author": "saintkatelyn",
                                    "id": "e4xto9k",
                                    "parent_id": "t1_e4xp03m",
                                    "score": 8,
                                    "created_utc": 1535404557.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You assume he sent them to her and not himself to bring in to her. Dozens of ways this could play out. ",
                    "author": "mraspencer",
                    "id": "e4wxfdv",
                    "parent_id": "t1_e4wxbtq",
                    "score": 8,
                    "created_utc": 1535375851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is cute! And the way to do it! This comment just made me happier than heck!!!",
            "author": "99olives",
            "id": "e4wblkf",
            "parent_id": "t1_e4w3gnl",
            "score": 17,
            "created_utc": 1535339312.0,
            "replies": []
        },
        {
            "body": "EXACTLY. Gifts are supposed to be selfless not something that benefits you. ",
            "author": "DelicateDalliances",
            "id": "e4w3r2s",
            "parent_id": "t1_e4w3k5x",
            "score": 29,
            "created_utc": 1535330771.0,
            "replies": []
        },
        {
            "body": "The men here are upset because I’m describing them",
            "author": "DelicateDalliances",
            "id": "e4x8hjj",
            "parent_id": "t1_e4x54q6",
            "score": 33,
            "created_utc": 1535386433.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4wcl0x",
            "parent_id": "t1_e4w8c9l",
            "score": 10,
            "created_utc": 1535340442.0,
            "replies": [
                {
                    "body": "I've had a few guys try to gift me jewelry before. Specifically earrings and I don't have my ears pierced. Awkward. :/\n\nI don't like receiving lingerie. Women's bra sizing is complicated enough as is without factoring in the different brands, materials and styles. Going together to pick something out is one thing but receiving something a guy just grabbed because he thinks it's about the right size and looks hot, having it fit horribly or not at all and then dude gets upset because you're annoyed-? Yeah. Stupid. \n\n",
                    "author": "CJ3500",
                    "id": "e4wdt1h",
                    "parent_id": "t1_e4wcl0x",
                    "score": 19,
                    "created_utc": 1535341910.0,
                    "replies": [
                        {
                            "body": "I used to have lingerie on my wishlist and had a guy ignore all of it and instead buy me lingerie he thought was sexy which did not fit me AT ALL. I just threw it in the trash. What a waste. ",
                            "author": "DelicateDalliances",
                            "id": "e4we27g",
                            "parent_id": "t1_e4wdt1h",
                            "score": 10,
                            "created_utc": 1535342227.0,
                            "replies": [
                                {
                                    "body": "Yeah I've gotten some lacey frilly bits that are several sizes too small. Annoys the shit out of me especially when a guy insists that I squeeze into the damn thing even though I've told him that my tits aren't going to fit into those goddamn cups and that the band size is off by several inches. Absolute waste, ends up in the garbage and I hate doing that. Bah",
                                    "author": "CJ3500",
                                    "id": "e4weebf",
                                    "parent_id": "t1_e4we27g",
                                    "score": 10,
                                    "created_utc": 1535342659.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right. Someone can get my some crap I'll throw away but wouldn't they rather not waste their money?",
            "author": "DelicateDalliances",
            "id": "e4wc38w",
            "parent_id": "t1_e4w8c9l",
            "score": 8,
            "created_utc": 1535339869.0,
            "replies": []
        },
        {
            "body": "I donated 20 bras last month because I had so many. Its not something I want at all and will have to get rid of. ",
            "author": "DelicateDalliances",
            "id": "e4w30lf",
            "parent_id": "t1_e4w2gtv",
            "score": 18,
            "created_utc": 1535329978.0,
            "replies": [
                {
                    "body": "Is that called supporting your sisters ",
                    "author": "pinotandsugar",
                    "id": "e4w35j8",
                    "parent_id": "t1_e4w30lf",
                    "score": 36,
                    "created_utc": 1535330125.0,
                    "replies": [
                        {
                            "body": "I almost spit out my drink when I read this. lol",
                            "author": "SugeDaddio",
                            "id": "e4w43g4",
                            "parent_id": "t1_e4w35j8",
                            "score": 7,
                            "created_utc": 1535331143.0,
                            "replies": []
                        },
                        {
                            "body": "Wordsmith of the highest order...",
                            "author": "tankbinding",
                            "id": "e4x8d4o",
                            "parent_id": "t1_e4w35j8",
                            "score": 1,
                            "created_utc": 1535386325.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cash is always great. But at the same time, it can be really nice being gifted something that you want but wouldn't have bought yourself because there are other things the money could/ should go to.",
            "author": "blonde-throwaway",
            "id": "e4wrrg4",
            "parent_id": "t1_e4w5rtb",
            "score": 11,
            "created_utc": 1535368015.0,
            "replies": []
        },
        {
            "body": "Awesome! Just curious. What were the items on her list that you bought her? 🎁",
            "author": "coolchic101",
            "id": "e5qen20",
            "parent_id": "t1_e4wvclk",
            "score": 1,
            "created_utc": 1536599598.0,
            "replies": [
                {
                    "body": "Sent you a PM",
                    "author": "Pondguy4you",
                    "id": "e5qhht4",
                    "parent_id": "t1_e5qen20",
                    "score": 1,
                    "created_utc": 1536602025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes that's the general point.",
            "author": "DelicateDalliances",
            "id": "e4wc8jo",
            "parent_id": "t1_e4w5gjq",
            "score": 8,
            "created_utc": 1535340041.0,
            "replies": []
        },
        {
            "body": "Yeah you can also put ca$h inside a greeting card and write your own personal message in it too. That’s another way to gift 🎁💰💕",
            "author": "coolchic101",
            "id": "e5qej11",
            "parent_id": "t1_e4wmheb",
            "score": 3,
            "created_utc": 1536599503.0,
            "replies": []
        },
        {
            "body": "I totally disagree. My current SB gets me gifts I don't want or use (books i won't ever read; paintings she paints just for me (she's a terrible artist lol); a nice watch (I NEVER wear a watch and never will again; etc.). They're thoughtful in the sense that she clearly put some effort into choosing the gift. But just because she's a lousy gift-giver doesn't mean the sentiment behind the gift wasn't genuine.\n\nOn the other hand, I had a sugar baby a few years back who for Christmas got me a copy of my favorite novel signed by the author. I didn't ask for it, but it may be the best gift I ever got from anybody!",
            "author": null,
            "id": "e4x6992",
            "parent_id": "t1_e4wvg88",
            "score": 8,
            "created_utc": 1535384445.0,
            "replies": [
                {
                    "body": "But those are surprise gifts. She didn’t ask what you wanted first and then ignore you",
                    "author": "DelicateDalliances",
                    "id": "e4x8mcq",
                    "parent_id": "t1_e4x6992",
                    "score": 16,
                    "created_utc": 1535386550.0,
                    "replies": [
                        {
                            "body": "Exactly! It becomes this fake song and dance for no reason... surprise gifts, fine! But don’t play games with me when you’re trying to play out a fantasy ",
                            "author": "alexeySB",
                            "id": "e4x90qd",
                            "parent_id": "t1_e4x8mcq",
                            "score": 13,
                            "created_utc": 1535386904.0,
                            "replies": []
                        },
                        {
                            "body": "I have no problem with the OP being mad that her SD totally ignored her gift choices. I was just responding to u/nini-jay's comment that if *any* gift isn't desired by the recipient, it ceases to be a gift. I take issue with that. It's the thought that counts. OP's SD is clearly thoughtless.",
                            "author": null,
                            "id": "e4xpd30",
                            "parent_id": "t1_e4x8mcq",
                            "score": 4,
                            "created_utc": 1535400967.0,
                            "replies": [
                                {
                                    "body": "Yeah I think I could have phrased it better 🙃😅",
                                    "author": "nini-jay",
                                    "id": "e4xpid3",
                                    "parent_id": "t1_e4xpd30",
                                    "score": 5,
                                    "created_utc": 1535401085.0,
                                    "replies": [
                                        {
                                            "body": "No worries. Otherwise you did a very nice job of reducing the OP's lengthy rant to a pithy tl;dr :D",
                                            "author": null,
                                            "id": "e4xpsng",
                                            "parent_id": "t1_e4xpid3",
                                            "score": 5,
                                            "created_utc": 1535401323.0,
                                            "replies": [
                                                {
                                                    "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
                                                    "author": "nini-jay",
                                                    "id": "e4xpw57",
                                                    "parent_id": "t1_e4xpsng",
                                                    "score": 3,
                                                    "created_utc": 1535401401.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I suppose context is important. Idk...",
                    "author": "nini-jay",
                    "id": "e4x6bv5",
                    "parent_id": "t1_e4x6992",
                    "score": 2,
                    "created_utc": 1535384511.0,
                    "replies": []
                },
                {
                    "body": "I think thought and effort can really make up for it yeah...",
                    "author": "nini-jay",
                    "id": "e4x6iei",
                    "parent_id": "t1_e4x6992",
                    "score": 2,
                    "created_utc": 1535384674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Could you share what you wanted and what you got, and why what you got wasn't satisfactory?",
            "author": null,
            "id": "e4x54jq",
            "parent_id": "t1_e4w6qmk",
            "score": 1,
            "created_utc": 1535383430.0,
            "replies": [
                {
                    "body": "I'm genuinely curious, please answer IF you can . 😋😊😊❤️",
                    "author": "absthaw",
                    "id": "e5prd61",
                    "parent_id": "t1_e4x54jq",
                    "score": 1,
                    "created_utc": 1536573574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not even a sb (...yet) & this is immediately what I thought of. Makes the most sense.",
            "author": null,
            "id": "e50vjph",
            "parent_id": "t1_e4xbqo8",
            "score": 2,
            "created_utc": 1535528893.0,
            "replies": []
        },
        {
            "body": "I have one and suggested items from it... ",
            "author": "DelicateDalliances",
            "id": "e4xk3dc",
            "parent_id": "t1_e4xbqo8",
            "score": 2,
            "created_utc": 1535396577.0,
            "replies": []
        },
        {
            "body": "My SRs aren’t so sad that we negotiate gifts. ",
            "author": "DelicateDalliances",
            "id": "e4x8la2",
            "parent_id": "t1_e4w5xit",
            "score": 9,
            "created_utc": 1535386526.0,
            "replies": []
        },
        {
            "body": "Um.  Not for nothing.  But gifts are supposed to be about the person you are giving them too???  \n\n\n",
            "author": "SDstartingOut",
            "id": "e4yaa61",
            "parent_id": "t1_e4x86t9",
            "score": 4,
            "created_utc": 1535421278.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4wclvy",
            "parent_id": "t1_e4w9h77",
            "score": 23,
            "created_utc": 1535340470.0,
            "replies": [
                {
                    "body": "Thank you. Idk why people are disagreeing with me on this concept. ",
                    "author": "DelicateDalliances",
                    "id": "e4wdg4c",
                    "parent_id": "t1_e4wclvy",
                    "score": 18,
                    "created_utc": 1535341471.0,
                    "replies": [
                        {
                            "body": "I think some people in this thread are the exact type of gift giver you described and are feeling exposed lol.",
                            "author": "JewelofVA",
                            "id": "e4wzn62",
                            "parent_id": "t1_e4wdg4c",
                            "score": 11,
                            "created_utc": 1535378206.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I need to disagree with you on this one. I've NEVER had this type of reaction in vanilla life.\n\nMaybe the vanilla folks just don't receive the number of gifts expected by the SB types so they are more appreciative of whatever is gifted?",
                    "author": "SugeDaddio",
                    "id": "e4wrn7p",
                    "parent_id": "t1_e4wclvy",
                    "score": -5,
                    "created_utc": 1535367799.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e4x0rz6",
                            "parent_id": "t1_e4wrn7p",
                            "score": 9,
                            "created_utc": 1535379343.0,
                            "replies": [
                                {
                                    "body": "Another amusing part of this thread is the downvote brigade. They seem to be pretty organized when someone disagrees with them. :)\n\nSo, I'm going to guess gifting a SB flowers is also verboten?",
                                    "author": "SugeDaddio",
                                    "id": "e4x1cpd",
                                    "parent_id": "t1_e4x0rz6",
                                    "score": -2,
                                    "created_utc": 1535379906.0,
                                    "replies": [
                                        {
                                            "body": "If you ask her what she wants from the store on your way to see her and she says food and you bring her flowers instead because you’d rather her be happy with flowers and it doesn’t fulfill your fantasy to provide her food then yes, that’s rude and weird.  \n\nIf you don’t ask and just show up with them then no of course that’s always welcome, even by people who dont love flowers.\n\nYour posts are all totally missing the major point which is he’s asking her need and then ignoring that need because he wants to stay in his fantasy.  Then don’t ask! It’s degrading to say “no dear, you don’t need that, I have decided after asking you what you need that you can’t decide for yourself so here is this instead! I am such a great man! “",
                                            "author": "alexeySB",
                                            "id": "e4x9s4l",
                                            "parent_id": "t1_e4x1cpd",
                                            "score": 9,
                                            "created_utc": 1535387568.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
                                                    "author": "SugeDaddio",
                                                    "id": "e4xl0mz",
                                                    "parent_id": "t1_e4x9s4l",
                                                    "score": 1,
                                                    "created_utc": 1535397381.0,
                                                    "replies": [
                                                        {
                                                            "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                                                            "author": "alexeySB",
                                                            "id": "e4xo1f6",
                                                            "parent_id": "t1_e4xl0mz",
                                                            "score": 4,
                                                            "created_utc": 1535399883.0,
                                                            "replies": [
                                                                {
                                                                    "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                                                                    "author": "SugeDaddio",
                                                                    "id": "e4xogek",
                                                                    "parent_id": "t1_e4xo1f6",
                                                                    "score": 1,
                                                                    "created_utc": 1535400233.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                                                            "author": "alexeySB",
                                                                            "id": "e4xpbmd",
                                                                            "parent_id": "t1_e4xogek",
                                                                            "score": 2,
                                                                            "created_utc": 1535400935.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                                                                    "author": "SugeDaddio",
                                                                                    "id": "e4xqgqj",
                                                                                    "parent_id": "t1_e4xpbmd",
                                                                                    "score": 0,
                                                                                    "created_utc": 1535401876.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I think that's going to depend on discretion.  If you can do it in a discrete way (for both of you), I think most would be happy with a little surprise of lowers.\n\nOn the other hand, if you have an SB that has a boyfriend/husband, even if it's legitimately an open relationship... do you really think they want to be showing back up with flowers?  Probably not.  ",
                                            "author": "SDstartingOut",
                                            "id": "e4x1mvb",
                                            "parent_id": "t1_e4x1cpd",
                                            "score": 3,
                                            "created_utc": 1535380185.0,
                                            "replies": [
                                                {
                                                    "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
                                                    "author": "SugeDaddio",
                                                    "id": "e4x1wa8",
                                                    "parent_id": "t1_e4x1mvb",
                                                    "score": 0,
                                                    "created_utc": 1535380438.0,
                                                    "replies": [
                                                        {
                                                            "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                                                            "author": "alexeySB",
                                                            "id": "e4x9twu",
                                                            "parent_id": "t1_e4x1wa8",
                                                            "score": 3,
                                                            "created_utc": 1535387612.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Do you usually ask people what they want, ignore them, and tell them you’re getting them something they don’t want?",
                            "author": "DelicateDalliances",
                            "id": "e4x8cdj",
                            "parent_id": "t1_e4wrn7p",
                            "score": 6,
                            "created_utc": 1535386306.0,
                            "replies": [
                                {
                                    "body": "Since it is a gift, I usually give them things I think they might like which they would never buy for themselves.\n\nI'm learning this won't work on the SBs here.\n\nPerhaps the sugar world needs it's own term, how does \"sugar gift\" sound? Because based on the expectations here, the word gift isn't what is being referred to.",
                                    "author": "SugeDaddio",
                                    "id": "e4x8tga",
                                    "parent_id": "t1_e4x8cdj",
                                    "score": 1,
                                    "created_utc": 1535386729.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gifting anyone is about that person not you. ",
            "author": "DelicateDalliances",
            "id": "e4wcj7v",
            "parent_id": "t1_e4w9h77",
            "score": 11,
            "created_utc": 1535340384.0,
            "replies": []
        },
        {
            "body": "On Christmas though your family doesn’t ask what you want, ignore you, then buy something that makes them happy. That analogy just isn’t relevant. ",
            "author": "DelicateDalliances",
            "id": "e4xk4yn",
            "parent_id": "t1_e4x9atb",
            "score": 6,
            "created_utc": 1535396617.0,
            "replies": [
                {
                    "body": "Wait: \n\nDon't parents ask their kids what they want - and kids tell their parents what they want? \n\nDon't parents often buy their kids something other than what the kids ask for (Lot's of kids ask for ponies right?!?)? \n\nDon't these entitled kids often seem ungrateful when they figure out (half-way through opening their present) that they did not get what they wanted?\n\nIrrelevant Analogy?!? I have to ask - Are you considering my comments or just being defensive? ",
                    "author": "tankbinding",
                    "id": "e4yfwcf",
                    "parent_id": "t1_e4xk4yn",
                    "score": -1,
                    "created_utc": 1535427393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I may have to follow your lead on this. ",
            "author": "SugeDaddio",
            "id": "e4wrods",
            "parent_id": "t1_e4wdu9q",
            "score": -1,
            "created_utc": 1535367860.0,
            "replies": []
        },
        {
            "body": "We discussed gifts because he was going to get me a gift. Why else would we be discussing it. ",
            "author": "DelicateDalliances",
            "id": "e4w2zm9",
            "parent_id": "t1_e4w26qz",
            "score": 13,
            "created_utc": 1535329949.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4w4cmo",
                    "parent_id": "t1_e4w2zm9",
                    "score": -12,
                    "created_utc": 1535331418.0,
                    "replies": [
                        {
                            "body": "He asked me what I would want for a gift. Why is this hard to understand. ",
                            "author": "DelicateDalliances",
                            "id": "e4wcbww",
                            "parent_id": "t1_e4w4cmo",
                            "score": 15,
                            "created_utc": 1535340148.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not if you're only thinking of yourself and someone has explicitly told you they don't want those things. ",
            "author": "DelicateDalliances",
            "id": "e4wc1ff",
            "parent_id": "t1_e4wacko",
            "score": 25,
            "created_utc": 1535339811.0,
            "replies": []
        },
        {
            "body": "This thread has been a complete shock to me. Everything I'm reading is yelling \"if you want to do something nice for your SB, don't - they only want more cash and don't care how you feel about it\" which is kind of disappointing.\n\nI'm rarely surprised these days but this one has done just that.",
            "author": "SugeDaddio",
            "id": "e4wrik8",
            "parent_id": "t1_e4wacko",
            "score": -4,
            "created_utc": 1535367554.0,
            "replies": [
                {
                    "body": ">\"if you want to do something nice for your SB, don't - they only want more cash and don't care how you feel about it\" \n\nYou are clearly reading a different thread or just weirdly inventing your own random narrative as not one single person has expressed that sentiment. ",
                    "author": "blonde-throwaway",
                    "id": "e4wscnh",
                    "parent_id": "t1_e4wrik8",
                    "score": 18,
                    "created_utc": 1535369016.0,
                    "replies": [
                        {
                            "body": "Really? The only thing I added was the word cash but, based on the reactions, that's what they mean when they say buy me what I want not what you want to give me.",
                            "author": "SugeDaddio",
                            "id": "e4wszuy",
                            "parent_id": "t1_e4wscnh",
                            "score": -6,
                            "created_utc": 1535370050.0,
                            "replies": [
                                {
                                    "body": "Ok so you're acknowledging that you're making things up. Good.",
                                    "author": "blonde-throwaway",
                                    "id": "e4wt8af",
                                    "parent_id": "t1_e4wszuy",
                                    "score": 16,
                                    "created_utc": 1535370401.0,
                                    "replies": []
                                },
                                {
                                    "body": ">buy me what I want not what you want to give me.\n\nThis is generally the correct approach to gift-giving.",
                                    "author": null,
                                    "id": "e4x5911",
                                    "parent_id": "t1_e4wszuy",
                                    "score": 12,
                                    "created_utc": 1535383540.0,
                                    "replies": [
                                        {
                                            "body": "SMH.\n\nI'm learning that maybe the sugar world works that way but the real world most assuredly does not.\n\nLike I said in another post, this has been a true eye opener for me so I should thank you for that.\n\nI will also be sure to have this discussion with SBs and I will be walking away at the first sign of this kind of entitled behaviour.\n\nGood luck to you.",
                                            "author": "SugeDaddio",
                                            "id": "e4x5o1o",
                                            "parent_id": "t1_e4x5911",
                                            "score": -2,
                                            "created_utc": 1535383911.0,
                                            "replies": [
                                                {
                                                    "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
                                                    "author": null,
                                                    "id": "e4xhyyx",
                                                    "parent_id": "t1_e4x5o1o",
                                                    "score": 9,
                                                    "created_utc": 1535394610.0,
                                                    "replies": [
                                                        {
                                                            "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                                                            "author": "SugeDaddio",
                                                            "id": "e4xio5j",
                                                            "parent_id": "t1_e4xhyyx",
                                                            "score": -1,
                                                            "created_utc": 1535395311.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
                                                    "author": "alexeySB",
                                                    "id": "e4x9cnq",
                                                    "parent_id": "t1_e4x5o1o",
                                                    "score": 6,
                                                    "created_utc": 1535387192.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No the point is that if you ask someone what they want but ignore them and get what you want you’re a bad gift giver. ",
                    "author": "DelicateDalliances",
                    "id": "e4x8jhi",
                    "parent_id": "t1_e4wrik8",
                    "score": 9,
                    "created_utc": 1535386481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They get to redefine whatever they want apparently. :)",
            "author": "SugeDaddio",
            "id": "e4x66xx",
            "parent_id": "t1_e4wvabl",
            "score": 0,
            "created_utc": 1535384390.0,
            "replies": []
        },
        {
            "body": "So instead of communicating what I'd like so that the person doesn't waste their money, I should let them give me something I don't want and reject the gift? Makes sense. ",
            "author": "DelicateDalliances",
            "id": "e4w3pvz",
            "parent_id": "t1_e4w317q",
            "score": 29,
            "created_utc": 1535330734.0,
            "replies": [
                {
                    "body": ">so that the person doesn't waste their money\n\nYou don't get the point of gifts, it's making ME happy by giving you something I like.\n\nSo maybe you want your rent paid instead of a diamond necklace, good for you but that doesn't do anything for me.",
                    "author": "Fjfiejenf",
                    "id": "e4w43yp",
                    "parent_id": "t1_e4w3pvz",
                    "score": -32,
                    "created_utc": 1535331159.0,
                    "replies": [
                        {
                            "body": "The point of a gift is not to make yourself happy. If you are buying people you care about gifts to make yourself happy I feel bad for the people in your life. ",
                            "author": "DelicateDalliances",
                            "id": "e4wckxc",
                            "parent_id": "t1_e4w43yp",
                            "score": 22,
                            "created_utc": 1535340439.0,
                            "replies": []
                        },
                        {
                            "body": "...what? What does a diamond necklace do for you? Meanwhile your SB has nice shiny things but could be late on her rent...",
                            "author": "summerallya",
                            "id": "e4w6gkc",
                            "parent_id": "t1_e4w43yp",
                            "score": 27,
                            "created_utc": 1535333702.0,
                            "replies": [
                                {
                                    "body": "SDs here would rather their SB be homeless and uneducated wearing lingerie and diamonds in the street apparently. ",
                                    "author": "DelicateDalliances",
                                    "id": "e4wcm0i",
                                    "parent_id": "t1_e4w6gkc",
                                    "score": 30,
                                    "created_utc": 1535340473.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Are you almost done trolling SLF? ",
                            "author": "tannedsb05",
                            "id": "e4w77bk",
                            "parent_id": "t1_e4w43yp",
                            "score": 19,
                            "created_utc": 1535334502.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "e4w7fr2",
                                    "parent_id": "t1_e4w77bk",
                                    "score": 21,
                                    "created_utc": 1535334752.0,
                                    "replies": [
                                        {
                                            "body": "I fucking laughed out loud at this. Thank you. 👏🏻👏🏻❤️",
                                            "author": "seekingsweetsugar",
                                            "id": "e4wgjwx",
                                            "parent_id": "t1_e4w7fr2",
                                            "score": 11,
                                            "created_utc": 1535345669.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How is it entitled to tell someone you don't want them to waste their money on something you won't ever use?",
            "author": "DelicateDalliances",
            "id": "e4wc6fa",
            "parent_id": "t1_e4w4grs",
            "score": 21,
            "created_utc": 1535339973.0,
            "replies": []
        },
        {
            "body": "Good thing she’s not a 5 year old. She is telling him what she wants. Why would he rather waste money to go in the trash? ",
            "author": "tannedsb05",
            "id": "e4w7as6",
            "parent_id": "t1_e4w4grs",
            "score": 31,
            "created_utc": 1535334606.0,
            "replies": [
                {
                    "body": "She gave him two options that he didn’t like.  He can do whatever he wants with his money.  If I were him, I wouldn’t give her anything and would start looking for a new SB. ",
                    "author": "sd_90210",
                    "id": "e4w7k0a",
                    "parent_id": "t1_e4w7as6",
                    "score": -24,
                    "created_utc": 1535334877.0,
                    "replies": [
                        {
                            "body": "Why bother asking someone what they'd like as a gift if you don't care what they actually want?",
                            "author": "DelicateDalliances",
                            "id": "e4wcb9t",
                            "parent_id": "t1_e4w7k0a",
                            "score": 22,
                            "created_utc": 1535340127.0,
                            "replies": []
                        },
                        {
                            "body": "That would be your choice ",
                            "author": "tannedsb05",
                            "id": "e4w7l7s",
                            "parent_id": "t1_e4w7k0a",
                            "score": 14,
                            "created_utc": 1535334913.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Who are you trying to help here?\n\nHerself. :)",
            "author": "SugeDaddio",
            "id": "e4w5ip1",
            "parent_id": "t1_e4w4grs",
            "score": -10,
            "created_utc": 1535332686.0,
            "replies": [
                {
                    "body": "Advice for SDs and also venting. ",
                    "author": "DelicateDalliances",
                    "id": "e4wdha4",
                    "parent_id": "t1_e4w5ip1",
                    "score": 15,
                    "created_utc": 1535341511.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right. So when someone asks me what I would like as a gift they should accept what I say I want and not negotiate with me like he did. \n\n&#x200B;\n\nYou're proving my point. ",
            "author": "DelicateDalliances",
            "id": "e4w2yjs",
            "parent_id": "t1_e4w267r",
            "score": 24,
            "created_utc": 1535329915.0,
            "replies": [
                {
                    "body": "No, I'm not. I'm just showing that what you are calling a gift isn't truly a gift. You called it a gift.\n\n>gift\n>ɡift/\n>noun\n>noun: gift; plural noun: gifts\n>\n>    1.\n>    a thing given willingly to someone without payment; a present.\n>    \"a Christmas gift\"\n>    synonyms:\tpresent, handout, donation, offering, bestowal, bonus, award, endowment; ",
                    "author": "SugeDaddio",
                    "id": "e4w3elp",
                    "parent_id": "t1_e4w2yjs",
                    "score": -12,
                    "created_utc": 1535330389.0,
                    "replies": [
                        {
                            "body": "Ok so when you get a gift for someone you don't bother to look into what they want, you just get them something you want? That's how you give gifts? \n\n&#x200B;\n\nHe asked me what I wanted and then said no to my suggestion. He said no to my second suggestion. He then suggested things he wanted. Explain how thats a gift?",
                            "author": "DelicateDalliances",
                            "id": "e4w3mem",
                            "parent_id": "t1_e4w3elp",
                            "score": 24,
                            "created_utc": 1535330625.0,
                            "replies": [
                                {
                                    "body": "When I give a gift, I give something I think they will like and enjoy. I try to be thoughtful.\n\nIf I want to be helpful and I ask what they need, I don't consider that a gift - it's more of a hand up.\n\nStill, it sounds to me like your negotiating over your allowance.",
                                    "author": "SugeDaddio",
                                    "id": "e4w3zxw",
                                    "parent_id": "t1_e4w3mem",
                                    "score": -3,
                                    "created_utc": 1535331039.0,
                                    "replies": [
                                        {
                                            "body": "How is it negotiating to tell someone what I would like as a gift when they ask me?",
                                            "author": "DelicateDalliances",
                                            "id": "e4wcddd",
                                            "parent_id": "t1_e4w3zxw",
                                            "score": 14,
                                            "created_utc": 1535340194.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I did tell him this, this post doesn’t cover everything that happened. . The point of the post is to talk about a pervasive issue and tell SDs how SBs feel",
            "author": "DelicateDalliances",
            "id": "e4x898p",
            "parent_id": "t1_e4wx1n0",
            "score": 7,
            "created_utc": 1535386228.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "e4wxd0y",
            "parent_id": "t1_e4wx1n0",
            "score": -4,
            "created_utc": 1535375775.0,
            "replies": [
                {
                    "body": "> harridan\n\nWell I learned a fun new word today (although the internet tells me it also means \"old,\" which I'm assuming OP isn't).\n\nEDIT: Apparently another fun word is \"termagant.\"  There are a lot of interesting words in the English language for cantankerous women, it seems.\n\nI would've gone with virago instead.",
                    "author": null,
                    "id": "e4x5lza",
                    "parent_id": "t1_e4wxd0y",
                    "score": 3,
                    "created_utc": 1535383859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did you read the post? I know 'Communicate' is the general, cookie cutter answer from lazy people reading a thread but it's particularly useless in this instance. She *did* communicate. The issue here isn't due to a lack of communication.",
            "author": "sb105",
            "id": "e4x3h6u",
            "parent_id": "t1_e4wq7wu",
            "score": 11,
            "created_utc": 1535381917.0,
            "replies": []
        },
        {
            "body": "I didn’t type out our entire conversation. I told him basically exactly what I said here",
            "author": "DelicateDalliances",
            "id": "e4x8asp",
            "parent_id": "t1_e4wq7wu",
            "score": 1,
            "created_utc": 1535386266.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4xbbgu",
                    "parent_id": "t1_e4x8asp",
                    "score": 0,
                    "created_utc": 1535388897.0,
                    "replies": [
                        {
                            "body": "I ceased conversation with this person for a number of reasons. ",
                            "author": "DelicateDalliances",
                            "id": "e4xkbyk",
                            "parent_id": "t1_e4xbbgu",
                            "score": 3,
                            "created_utc": 1535396788.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your attitude is not welcome on SLF. You are banned from participating here. Your other post will be removed",
            "author": "LaSirene23",
            "id": "e4x24fc",
            "parent_id": "t1_e4wb6qn",
            "score": 10,
            "created_utc": 1535380655.0,
            "replies": []
        },
        {
            "body": "I have a full time job. You're just whorephobic and ignorant. ",
            "author": "DelicateDalliances",
            "id": "e4wc0lx",
            "parent_id": "t1_e4wb6qn",
            "score": 18,
            "created_utc": 1535339786.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "e4wgwt2",
                    "parent_id": "t1_e4wc0lx",
                    "score": -12,
                    "created_utc": 1535346208.0,
                    "replies": [
                        {
                            "body": "Words from this poster \"your attitude is ugly\" \n\nAlso from this poster \"SRs are shallow and I cheat on my wife.\" \n\nI got at least 1 Yike. ",
                            "author": "2catsandacomputer",
                            "id": "e4wid3u",
                            "parent_id": "t1_e4wgwt2",
                            "score": 14,
                            "created_utc": 1535348580.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "e4wkkza",
                                    "parent_id": "t1_e4wid3u",
                                    "score": -9,
                                    "created_utc": 1535352652.0,
                                    "replies": [
                                        {
                                            "body": "Enjoy your ban, cheating douchebag :)",
                                            "author": "2catsandacomputer",
                                            "id": "e4wkxu6",
                                            "parent_id": "t1_e4wkkza",
                                            "score": 10,
                                            "created_utc": 1535353359.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4x2s8n",
            "parent_id": "t1_e4wxkaa",
            "score": 13,
            "created_utc": 1535381271.0,
            "replies": [
                {
                    "body": "Lol how can you compare lingerie to health care. \nThanks for being a rational person. ",
                    "author": "DelicateDalliances",
                    "id": "e4x8go8",
                    "parent_id": "t1_e4x2s8n",
                    "score": 8,
                    "created_utc": 1535386412.0,
                    "replies": [
                        {
                            "body": "I'll take things older generations have never had to struggle with for $400, Alex. ",
                            "author": "2catsandacomputer",
                            "id": "e4xhmla",
                            "parent_id": "t1_e4x8go8",
                            "score": 8,
                            "created_utc": 1535394316.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4x1dru",
            "parent_id": "t1_e4wxkaa",
            "score": 4,
            "created_utc": 1535379934.0,
            "replies": [
                {
                    "body": "> want their employees to be dressed in a certain uniform\n\nWow - Just Wow...",
                    "author": "tankbinding",
                    "id": "e4x9jy7",
                    "parent_id": "t1_e4x1dru",
                    "score": 2,
                    "created_utc": 1535387367.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not that I don’t like lingerie, I just have so much it’s wasteful. ",
            "author": "DelicateDalliances",
            "id": "e4x7949",
            "parent_id": "t1_e4wws4k",
            "score": 20,
            "created_utc": 1535385330.0,
            "replies": [
                {
                    "body": "I enjoy the sensation of having it ripped off but it is a waste after that one time use lol",
                    "author": "tinyninjao_0",
                    "id": "e4yfpch",
                    "parent_id": "t1_e4x7949",
                    "score": 3,
                    "created_utc": 1535427164.0,
                    "replies": []
                },
                {
                    "body": "I was making a joke, and I get that many SB's closets are filled to overflowing with more corsets, teddies, bustiers and crotchless panties than they'll ever be able (or want) to wear. But, as I said, every woman likes new panties and bras for everyday wear (especially when they match), so I have her set up a wishlist at VS or wherever she gets her undies and select accordingly. ",
                    "author": null,
                    "id": "e4xpnim",
                    "parent_id": "t1_e4x7949",
                    "score": 5,
                    "created_utc": 1535401205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always tell girls about the amazon wishlist scam, I’m sure it still happens but smart strippers get paid upfront. \nThere’s more to life than dances, at the club I’m at now guys do things like that because they’re genuinely nice, not because they’re trying to say “I spent $80 so give me $80 worth of dances”\n\nA good customer of mine was in a few nights ago and just handed me $400 and I checked on him periodically/had fun in between dances with other people all night. He had just finished up his divorce and his only sexual experiences were with his ex so he was really just looking for someone to vent with/talk to\n\nEdit: I assume he purchased it through his amazon account and will bring it to the club at a later date.",
            "author": "saintkatelyn",
            "id": "e4xe9wt",
            "parent_id": "t1_e4wxbtq",
            "score": 13,
            "created_utc": 1535391468.0,
            "replies": [
                {
                    "body": "Hopefully that’s the case with the amazon stuff. I’ve lost trust with people these days. \nIt’s cool that you are able to build up clientele with some regulars. Those are the ones you keep around. ",
                    "author": "tannedsb05",
                    "id": "e4xp03m",
                    "parent_id": "t1_e4xe9wt",
                    "score": 6,
                    "created_utc": 1535400677.0,
                    "replies": [
                        {
                            "body": "I’m actually really disappointed when I hear about girls who rinse clients, lead them on, etc. I scolded a girl the other day who took $500 from a guy she met outside the club who was expecting sex and drove off. \nI NEVER lie to customers about what I am comfortable with doing. The ones who are worth my time are the ones who are okay with just meeting inside the club and not trying to push boundaries.",
                            "author": "saintkatelyn",
                            "id": "e4xto9k",
                            "parent_id": "t1_e4xp03m",
                            "score": 8,
                            "created_utc": 1535404557.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You assume he sent them to her and not himself to bring in to her. Dozens of ways this could play out. ",
            "author": "mraspencer",
            "id": "e4wxfdv",
            "parent_id": "t1_e4wxbtq",
            "score": 8,
            "created_utc": 1535375851.0,
            "replies": []
        },
        {
            "body": "I've had a few guys try to gift me jewelry before. Specifically earrings and I don't have my ears pierced. Awkward. :/\n\nI don't like receiving lingerie. Women's bra sizing is complicated enough as is without factoring in the different brands, materials and styles. Going together to pick something out is one thing but receiving something a guy just grabbed because he thinks it's about the right size and looks hot, having it fit horribly or not at all and then dude gets upset because you're annoyed-? Yeah. Stupid. \n\n",
            "author": "CJ3500",
            "id": "e4wdt1h",
            "parent_id": "t1_e4wcl0x",
            "score": 19,
            "created_utc": 1535341910.0,
            "replies": [
                {
                    "body": "I used to have lingerie on my wishlist and had a guy ignore all of it and instead buy me lingerie he thought was sexy which did not fit me AT ALL. I just threw it in the trash. What a waste. ",
                    "author": "DelicateDalliances",
                    "id": "e4we27g",
                    "parent_id": "t1_e4wdt1h",
                    "score": 10,
                    "created_utc": 1535342227.0,
                    "replies": [
                        {
                            "body": "Yeah I've gotten some lacey frilly bits that are several sizes too small. Annoys the shit out of me especially when a guy insists that I squeeze into the damn thing even though I've told him that my tits aren't going to fit into those goddamn cups and that the band size is off by several inches. Absolute waste, ends up in the garbage and I hate doing that. Bah",
                            "author": "CJ3500",
                            "id": "e4weebf",
                            "parent_id": "t1_e4we27g",
                            "score": 10,
                            "created_utc": 1535342659.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is that called supporting your sisters ",
            "author": "pinotandsugar",
            "id": "e4w35j8",
            "parent_id": "t1_e4w30lf",
            "score": 36,
            "created_utc": 1535330125.0,
            "replies": [
                {
                    "body": "I almost spit out my drink when I read this. lol",
                    "author": "SugeDaddio",
                    "id": "e4w43g4",
                    "parent_id": "t1_e4w35j8",
                    "score": 7,
                    "created_utc": 1535331143.0,
                    "replies": []
                },
                {
                    "body": "Wordsmith of the highest order...",
                    "author": "tankbinding",
                    "id": "e4x8d4o",
                    "parent_id": "t1_e4w35j8",
                    "score": 1,
                    "created_utc": 1535386325.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sent you a PM",
            "author": "Pondguy4you",
            "id": "e5qhht4",
            "parent_id": "t1_e5qen20",
            "score": 1,
            "created_utc": 1536602025.0,
            "replies": []
        },
        {
            "body": "But those are surprise gifts. She didn’t ask what you wanted first and then ignore you",
            "author": "DelicateDalliances",
            "id": "e4x8mcq",
            "parent_id": "t1_e4x6992",
            "score": 16,
            "created_utc": 1535386550.0,
            "replies": [
                {
                    "body": "Exactly! It becomes this fake song and dance for no reason... surprise gifts, fine! But don’t play games with me when you’re trying to play out a fantasy ",
                    "author": "alexeySB",
                    "id": "e4x90qd",
                    "parent_id": "t1_e4x8mcq",
                    "score": 13,
                    "created_utc": 1535386904.0,
                    "replies": []
                },
                {
                    "body": "I have no problem with the OP being mad that her SD totally ignored her gift choices. I was just responding to u/nini-jay's comment that if *any* gift isn't desired by the recipient, it ceases to be a gift. I take issue with that. It's the thought that counts. OP's SD is clearly thoughtless.",
                    "author": null,
                    "id": "e4xpd30",
                    "parent_id": "t1_e4x8mcq",
                    "score": 4,
                    "created_utc": 1535400967.0,
                    "replies": [
                        {
                            "body": "Yeah I think I could have phrased it better 🙃😅",
                            "author": "nini-jay",
                            "id": "e4xpid3",
                            "parent_id": "t1_e4xpd30",
                            "score": 5,
                            "created_utc": 1535401085.0,
                            "replies": [
                                {
                                    "body": "No worries. Otherwise you did a very nice job of reducing the OP's lengthy rant to a pithy tl;dr :D",
                                    "author": null,
                                    "id": "e4xpsng",
                                    "parent_id": "t1_e4xpid3",
                                    "score": 5,
                                    "created_utc": 1535401323.0,
                                    "replies": [
                                        {
                                            "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
                                            "author": "nini-jay",
                                            "id": "e4xpw57",
                                            "parent_id": "t1_e4xpsng",
                                            "score": 3,
                                            "created_utc": 1535401401.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I suppose context is important. Idk...",
            "author": "nini-jay",
            "id": "e4x6bv5",
            "parent_id": "t1_e4x6992",
            "score": 2,
            "created_utc": 1535384511.0,
            "replies": []
        },
        {
            "body": "I think thought and effort can really make up for it yeah...",
            "author": "nini-jay",
            "id": "e4x6iei",
            "parent_id": "t1_e4x6992",
            "score": 2,
            "created_utc": 1535384674.0,
            "replies": []
        },
        {
            "body": "I'm genuinely curious, please answer IF you can . 😋😊😊❤️",
            "author": "absthaw",
            "id": "e5prd61",
            "parent_id": "t1_e4x54jq",
            "score": 1,
            "created_utc": 1536573574.0,
            "replies": []
        },
        {
            "body": "Thank you. Idk why people are disagreeing with me on this concept. ",
            "author": "DelicateDalliances",
            "id": "e4wdg4c",
            "parent_id": "t1_e4wclvy",
            "score": 18,
            "created_utc": 1535341471.0,
            "replies": [
                {
                    "body": "I think some people in this thread are the exact type of gift giver you described and are feeling exposed lol.",
                    "author": "JewelofVA",
                    "id": "e4wzn62",
                    "parent_id": "t1_e4wdg4c",
                    "score": 11,
                    "created_utc": 1535378206.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I need to disagree with you on this one. I've NEVER had this type of reaction in vanilla life.\n\nMaybe the vanilla folks just don't receive the number of gifts expected by the SB types so they are more appreciative of whatever is gifted?",
            "author": "SugeDaddio",
            "id": "e4wrn7p",
            "parent_id": "t1_e4wclvy",
            "score": -5,
            "created_utc": 1535367799.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4x0rz6",
                    "parent_id": "t1_e4wrn7p",
                    "score": 9,
                    "created_utc": 1535379343.0,
                    "replies": [
                        {
                            "body": "Another amusing part of this thread is the downvote brigade. They seem to be pretty organized when someone disagrees with them. :)\n\nSo, I'm going to guess gifting a SB flowers is also verboten?",
                            "author": "SugeDaddio",
                            "id": "e4x1cpd",
                            "parent_id": "t1_e4x0rz6",
                            "score": -2,
                            "created_utc": 1535379906.0,
                            "replies": [
                                {
                                    "body": "If you ask her what she wants from the store on your way to see her and she says food and you bring her flowers instead because you’d rather her be happy with flowers and it doesn’t fulfill your fantasy to provide her food then yes, that’s rude and weird.  \n\nIf you don’t ask and just show up with them then no of course that’s always welcome, even by people who dont love flowers.\n\nYour posts are all totally missing the major point which is he’s asking her need and then ignoring that need because he wants to stay in his fantasy.  Then don’t ask! It’s degrading to say “no dear, you don’t need that, I have decided after asking you what you need that you can’t decide for yourself so here is this instead! I am such a great man! “",
                                    "author": "alexeySB",
                                    "id": "e4x9s4l",
                                    "parent_id": "t1_e4x1cpd",
                                    "score": 9,
                                    "created_utc": 1535387568.0,
                                    "replies": [
                                        {
                                            "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
                                            "author": "SugeDaddio",
                                            "id": "e4xl0mz",
                                            "parent_id": "t1_e4x9s4l",
                                            "score": 1,
                                            "created_utc": 1535397381.0,
                                            "replies": [
                                                {
                                                    "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                                                    "author": "alexeySB",
                                                    "id": "e4xo1f6",
                                                    "parent_id": "t1_e4xl0mz",
                                                    "score": 4,
                                                    "created_utc": 1535399883.0,
                                                    "replies": [
                                                        {
                                                            "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                                                            "author": "SugeDaddio",
                                                            "id": "e4xogek",
                                                            "parent_id": "t1_e4xo1f6",
                                                            "score": 1,
                                                            "created_utc": 1535400233.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                                                    "author": "alexeySB",
                                                                    "id": "e4xpbmd",
                                                                    "parent_id": "t1_e4xogek",
                                                                    "score": 2,
                                                                    "created_utc": 1535400935.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                                                            "author": "SugeDaddio",
                                                                            "id": "e4xqgqj",
                                                                            "parent_id": "t1_e4xpbmd",
                                                                            "score": 0,
                                                                            "created_utc": 1535401876.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I think that's going to depend on discretion.  If you can do it in a discrete way (for both of you), I think most would be happy with a little surprise of lowers.\n\nOn the other hand, if you have an SB that has a boyfriend/husband, even if it's legitimately an open relationship... do you really think they want to be showing back up with flowers?  Probably not.  ",
                                    "author": "SDstartingOut",
                                    "id": "e4x1mvb",
                                    "parent_id": "t1_e4x1cpd",
                                    "score": 3,
                                    "created_utc": 1535380185.0,
                                    "replies": [
                                        {
                                            "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
                                            "author": "SugeDaddio",
                                            "id": "e4x1wa8",
                                            "parent_id": "t1_e4x1mvb",
                                            "score": 0,
                                            "created_utc": 1535380438.0,
                                            "replies": [
                                                {
                                                    "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                                                    "author": "alexeySB",
                                                    "id": "e4x9twu",
                                                    "parent_id": "t1_e4x1wa8",
                                                    "score": 3,
                                                    "created_utc": 1535387612.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Do you usually ask people what they want, ignore them, and tell them you’re getting them something they don’t want?",
                    "author": "DelicateDalliances",
                    "id": "e4x8cdj",
                    "parent_id": "t1_e4wrn7p",
                    "score": 6,
                    "created_utc": 1535386306.0,
                    "replies": [
                        {
                            "body": "Since it is a gift, I usually give them things I think they might like which they would never buy for themselves.\n\nI'm learning this won't work on the SBs here.\n\nPerhaps the sugar world needs it's own term, how does \"sugar gift\" sound? Because based on the expectations here, the word gift isn't what is being referred to.",
                            "author": "SugeDaddio",
                            "id": "e4x8tga",
                            "parent_id": "t1_e4x8cdj",
                            "score": 1,
                            "created_utc": 1535386729.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wait: \n\nDon't parents ask their kids what they want - and kids tell their parents what they want? \n\nDon't parents often buy their kids something other than what the kids ask for (Lot's of kids ask for ponies right?!?)? \n\nDon't these entitled kids often seem ungrateful when they figure out (half-way through opening their present) that they did not get what they wanted?\n\nIrrelevant Analogy?!? I have to ask - Are you considering my comments or just being defensive? ",
            "author": "tankbinding",
            "id": "e4yfwcf",
            "parent_id": "t1_e4xk4yn",
            "score": -1,
            "created_utc": 1535427393.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4w4cmo",
            "parent_id": "t1_e4w2zm9",
            "score": -12,
            "created_utc": 1535331418.0,
            "replies": [
                {
                    "body": "He asked me what I would want for a gift. Why is this hard to understand. ",
                    "author": "DelicateDalliances",
                    "id": "e4wcbww",
                    "parent_id": "t1_e4w4cmo",
                    "score": 15,
                    "created_utc": 1535340148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">\"if you want to do something nice for your SB, don't - they only want more cash and don't care how you feel about it\" \n\nYou are clearly reading a different thread or just weirdly inventing your own random narrative as not one single person has expressed that sentiment. ",
            "author": "blonde-throwaway",
            "id": "e4wscnh",
            "parent_id": "t1_e4wrik8",
            "score": 18,
            "created_utc": 1535369016.0,
            "replies": [
                {
                    "body": "Really? The only thing I added was the word cash but, based on the reactions, that's what they mean when they say buy me what I want not what you want to give me.",
                    "author": "SugeDaddio",
                    "id": "e4wszuy",
                    "parent_id": "t1_e4wscnh",
                    "score": -6,
                    "created_utc": 1535370050.0,
                    "replies": [
                        {
                            "body": "Ok so you're acknowledging that you're making things up. Good.",
                            "author": "blonde-throwaway",
                            "id": "e4wt8af",
                            "parent_id": "t1_e4wszuy",
                            "score": 16,
                            "created_utc": 1535370401.0,
                            "replies": []
                        },
                        {
                            "body": ">buy me what I want not what you want to give me.\n\nThis is generally the correct approach to gift-giving.",
                            "author": null,
                            "id": "e4x5911",
                            "parent_id": "t1_e4wszuy",
                            "score": 12,
                            "created_utc": 1535383540.0,
                            "replies": [
                                {
                                    "body": "SMH.\n\nI'm learning that maybe the sugar world works that way but the real world most assuredly does not.\n\nLike I said in another post, this has been a true eye opener for me so I should thank you for that.\n\nI will also be sure to have this discussion with SBs and I will be walking away at the first sign of this kind of entitled behaviour.\n\nGood luck to you.",
                                    "author": "SugeDaddio",
                                    "id": "e4x5o1o",
                                    "parent_id": "t1_e4x5911",
                                    "score": -2,
                                    "created_utc": 1535383911.0,
                                    "replies": [
                                        {
                                            "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
                                            "author": null,
                                            "id": "e4xhyyx",
                                            "parent_id": "t1_e4x5o1o",
                                            "score": 9,
                                            "created_utc": 1535394610.0,
                                            "replies": [
                                                {
                                                    "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                                                    "author": "SugeDaddio",
                                                    "id": "e4xio5j",
                                                    "parent_id": "t1_e4xhyyx",
                                                    "score": -1,
                                                    "created_utc": 1535395311.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
                                            "author": "alexeySB",
                                            "id": "e4x9cnq",
                                            "parent_id": "t1_e4x5o1o",
                                            "score": 6,
                                            "created_utc": 1535387192.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No the point is that if you ask someone what they want but ignore them and get what you want you’re a bad gift giver. ",
            "author": "DelicateDalliances",
            "id": "e4x8jhi",
            "parent_id": "t1_e4wrik8",
            "score": 9,
            "created_utc": 1535386481.0,
            "replies": []
        },
        {
            "body": ">so that the person doesn't waste their money\n\nYou don't get the point of gifts, it's making ME happy by giving you something I like.\n\nSo maybe you want your rent paid instead of a diamond necklace, good for you but that doesn't do anything for me.",
            "author": "Fjfiejenf",
            "id": "e4w43yp",
            "parent_id": "t1_e4w3pvz",
            "score": -32,
            "created_utc": 1535331159.0,
            "replies": [
                {
                    "body": "The point of a gift is not to make yourself happy. If you are buying people you care about gifts to make yourself happy I feel bad for the people in your life. ",
                    "author": "DelicateDalliances",
                    "id": "e4wckxc",
                    "parent_id": "t1_e4w43yp",
                    "score": 22,
                    "created_utc": 1535340439.0,
                    "replies": []
                },
                {
                    "body": "...what? What does a diamond necklace do for you? Meanwhile your SB has nice shiny things but could be late on her rent...",
                    "author": "summerallya",
                    "id": "e4w6gkc",
                    "parent_id": "t1_e4w43yp",
                    "score": 27,
                    "created_utc": 1535333702.0,
                    "replies": [
                        {
                            "body": "SDs here would rather their SB be homeless and uneducated wearing lingerie and diamonds in the street apparently. ",
                            "author": "DelicateDalliances",
                            "id": "e4wcm0i",
                            "parent_id": "t1_e4w6gkc",
                            "score": 30,
                            "created_utc": 1535340473.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Are you almost done trolling SLF? ",
                    "author": "tannedsb05",
                    "id": "e4w77bk",
                    "parent_id": "t1_e4w43yp",
                    "score": 19,
                    "created_utc": 1535334502.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e4w7fr2",
                            "parent_id": "t1_e4w77bk",
                            "score": 21,
                            "created_utc": 1535334752.0,
                            "replies": [
                                {
                                    "body": "I fucking laughed out loud at this. Thank you. 👏🏻👏🏻❤️",
                                    "author": "seekingsweetsugar",
                                    "id": "e4wgjwx",
                                    "parent_id": "t1_e4w7fr2",
                                    "score": 11,
                                    "created_utc": 1535345669.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She gave him two options that he didn’t like.  He can do whatever he wants with his money.  If I were him, I wouldn’t give her anything and would start looking for a new SB. ",
            "author": "sd_90210",
            "id": "e4w7k0a",
            "parent_id": "t1_e4w7as6",
            "score": -24,
            "created_utc": 1535334877.0,
            "replies": [
                {
                    "body": "Why bother asking someone what they'd like as a gift if you don't care what they actually want?",
                    "author": "DelicateDalliances",
                    "id": "e4wcb9t",
                    "parent_id": "t1_e4w7k0a",
                    "score": 22,
                    "created_utc": 1535340127.0,
                    "replies": []
                },
                {
                    "body": "That would be your choice ",
                    "author": "tannedsb05",
                    "id": "e4w7l7s",
                    "parent_id": "t1_e4w7k0a",
                    "score": 14,
                    "created_utc": 1535334913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Advice for SDs and also venting. ",
            "author": "DelicateDalliances",
            "id": "e4wdha4",
            "parent_id": "t1_e4w5ip1",
            "score": 15,
            "created_utc": 1535341511.0,
            "replies": []
        },
        {
            "body": "No, I'm not. I'm just showing that what you are calling a gift isn't truly a gift. You called it a gift.\n\n>gift\n>ɡift/\n>noun\n>noun: gift; plural noun: gifts\n>\n>    1.\n>    a thing given willingly to someone without payment; a present.\n>    \"a Christmas gift\"\n>    synonyms:\tpresent, handout, donation, offering, bestowal, bonus, award, endowment; ",
            "author": "SugeDaddio",
            "id": "e4w3elp",
            "parent_id": "t1_e4w2yjs",
            "score": -12,
            "created_utc": 1535330389.0,
            "replies": [
                {
                    "body": "Ok so when you get a gift for someone you don't bother to look into what they want, you just get them something you want? That's how you give gifts? \n\n&#x200B;\n\nHe asked me what I wanted and then said no to my suggestion. He said no to my second suggestion. He then suggested things he wanted. Explain how thats a gift?",
                    "author": "DelicateDalliances",
                    "id": "e4w3mem",
                    "parent_id": "t1_e4w3elp",
                    "score": 24,
                    "created_utc": 1535330625.0,
                    "replies": [
                        {
                            "body": "When I give a gift, I give something I think they will like and enjoy. I try to be thoughtful.\n\nIf I want to be helpful and I ask what they need, I don't consider that a gift - it's more of a hand up.\n\nStill, it sounds to me like your negotiating over your allowance.",
                            "author": "SugeDaddio",
                            "id": "e4w3zxw",
                            "parent_id": "t1_e4w3mem",
                            "score": -3,
                            "created_utc": 1535331039.0,
                            "replies": [
                                {
                                    "body": "How is it negotiating to tell someone what I would like as a gift when they ask me?",
                                    "author": "DelicateDalliances",
                                    "id": "e4wcddd",
                                    "parent_id": "t1_e4w3zxw",
                                    "score": 14,
                                    "created_utc": 1535340194.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> harridan\n\nWell I learned a fun new word today (although the internet tells me it also means \"old,\" which I'm assuming OP isn't).\n\nEDIT: Apparently another fun word is \"termagant.\"  There are a lot of interesting words in the English language for cantankerous women, it seems.\n\nI would've gone with virago instead.",
            "author": null,
            "id": "e4x5lza",
            "parent_id": "t1_e4wxd0y",
            "score": 3,
            "created_utc": 1535383859.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4xbbgu",
            "parent_id": "t1_e4x8asp",
            "score": 0,
            "created_utc": 1535388897.0,
            "replies": [
                {
                    "body": "I ceased conversation with this person for a number of reasons. ",
                    "author": "DelicateDalliances",
                    "id": "e4xkbyk",
                    "parent_id": "t1_e4xbbgu",
                    "score": 3,
                    "created_utc": 1535396788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "e4wgwt2",
            "parent_id": "t1_e4wc0lx",
            "score": -12,
            "created_utc": 1535346208.0,
            "replies": [
                {
                    "body": "Words from this poster \"your attitude is ugly\" \n\nAlso from this poster \"SRs are shallow and I cheat on my wife.\" \n\nI got at least 1 Yike. ",
                    "author": "2catsandacomputer",
                    "id": "e4wid3u",
                    "parent_id": "t1_e4wgwt2",
                    "score": 14,
                    "created_utc": 1535348580.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "e4wkkza",
                            "parent_id": "t1_e4wid3u",
                            "score": -9,
                            "created_utc": 1535352652.0,
                            "replies": [
                                {
                                    "body": "Enjoy your ban, cheating douchebag :)",
                                    "author": "2catsandacomputer",
                                    "id": "e4wkxu6",
                                    "parent_id": "t1_e4wkkza",
                                    "score": 10,
                                    "created_utc": 1535353359.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol how can you compare lingerie to health care. \nThanks for being a rational person. ",
            "author": "DelicateDalliances",
            "id": "e4x8go8",
            "parent_id": "t1_e4x2s8n",
            "score": 8,
            "created_utc": 1535386412.0,
            "replies": [
                {
                    "body": "I'll take things older generations have never had to struggle with for $400, Alex. ",
                    "author": "2catsandacomputer",
                    "id": "e4xhmla",
                    "parent_id": "t1_e4x8go8",
                    "score": 8,
                    "created_utc": 1535394316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> want their employees to be dressed in a certain uniform\n\nWow - Just Wow...",
            "author": "tankbinding",
            "id": "e4x9jy7",
            "parent_id": "t1_e4x1dru",
            "score": 2,
            "created_utc": 1535387367.0,
            "replies": []
        },
        {
            "body": "I enjoy the sensation of having it ripped off but it is a waste after that one time use lol",
            "author": "tinyninjao_0",
            "id": "e4yfpch",
            "parent_id": "t1_e4x7949",
            "score": 3,
            "created_utc": 1535427164.0,
            "replies": []
        },
        {
            "body": "I was making a joke, and I get that many SB's closets are filled to overflowing with more corsets, teddies, bustiers and crotchless panties than they'll ever be able (or want) to wear. But, as I said, every woman likes new panties and bras for everyday wear (especially when they match), so I have her set up a wishlist at VS or wherever she gets her undies and select accordingly. ",
            "author": null,
            "id": "e4xpnim",
            "parent_id": "t1_e4x7949",
            "score": 5,
            "created_utc": 1535401205.0,
            "replies": []
        },
        {
            "body": "Hopefully that’s the case with the amazon stuff. I’ve lost trust with people these days. \nIt’s cool that you are able to build up clientele with some regulars. Those are the ones you keep around. ",
            "author": "tannedsb05",
            "id": "e4xp03m",
            "parent_id": "t1_e4xe9wt",
            "score": 6,
            "created_utc": 1535400677.0,
            "replies": [
                {
                    "body": "I’m actually really disappointed when I hear about girls who rinse clients, lead them on, etc. I scolded a girl the other day who took $500 from a guy she met outside the club who was expecting sex and drove off. \nI NEVER lie to customers about what I am comfortable with doing. The ones who are worth my time are the ones who are okay with just meeting inside the club and not trying to push boundaries.",
                    "author": "saintkatelyn",
                    "id": "e4xto9k",
                    "parent_id": "t1_e4xp03m",
                    "score": 8,
                    "created_utc": 1535404557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I used to have lingerie on my wishlist and had a guy ignore all of it and instead buy me lingerie he thought was sexy which did not fit me AT ALL. I just threw it in the trash. What a waste. ",
            "author": "DelicateDalliances",
            "id": "e4we27g",
            "parent_id": "t1_e4wdt1h",
            "score": 10,
            "created_utc": 1535342227.0,
            "replies": [
                {
                    "body": "Yeah I've gotten some lacey frilly bits that are several sizes too small. Annoys the shit out of me especially when a guy insists that I squeeze into the damn thing even though I've told him that my tits aren't going to fit into those goddamn cups and that the band size is off by several inches. Absolute waste, ends up in the garbage and I hate doing that. Bah",
                    "author": "CJ3500",
                    "id": "e4weebf",
                    "parent_id": "t1_e4we27g",
                    "score": 10,
                    "created_utc": 1535342659.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I almost spit out my drink when I read this. lol",
            "author": "SugeDaddio",
            "id": "e4w43g4",
            "parent_id": "t1_e4w35j8",
            "score": 7,
            "created_utc": 1535331143.0,
            "replies": []
        },
        {
            "body": "Wordsmith of the highest order...",
            "author": "tankbinding",
            "id": "e4x8d4o",
            "parent_id": "t1_e4w35j8",
            "score": 1,
            "created_utc": 1535386325.0,
            "replies": []
        },
        {
            "body": "Exactly! It becomes this fake song and dance for no reason... surprise gifts, fine! But don’t play games with me when you’re trying to play out a fantasy ",
            "author": "alexeySB",
            "id": "e4x90qd",
            "parent_id": "t1_e4x8mcq",
            "score": 13,
            "created_utc": 1535386904.0,
            "replies": []
        },
        {
            "body": "I have no problem with the OP being mad that her SD totally ignored her gift choices. I was just responding to u/nini-jay's comment that if *any* gift isn't desired by the recipient, it ceases to be a gift. I take issue with that. It's the thought that counts. OP's SD is clearly thoughtless.",
            "author": null,
            "id": "e4xpd30",
            "parent_id": "t1_e4x8mcq",
            "score": 4,
            "created_utc": 1535400967.0,
            "replies": [
                {
                    "body": "Yeah I think I could have phrased it better 🙃😅",
                    "author": "nini-jay",
                    "id": "e4xpid3",
                    "parent_id": "t1_e4xpd30",
                    "score": 5,
                    "created_utc": 1535401085.0,
                    "replies": [
                        {
                            "body": "No worries. Otherwise you did a very nice job of reducing the OP's lengthy rant to a pithy tl;dr :D",
                            "author": null,
                            "id": "e4xpsng",
                            "parent_id": "t1_e4xpid3",
                            "score": 5,
                            "created_utc": 1535401323.0,
                            "replies": [
                                {
                                    "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
                                    "author": "nini-jay",
                                    "id": "e4xpw57",
                                    "parent_id": "t1_e4xpsng",
                                    "score": 3,
                                    "created_utc": 1535401401.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think some people in this thread are the exact type of gift giver you described and are feeling exposed lol.",
            "author": "JewelofVA",
            "id": "e4wzn62",
            "parent_id": "t1_e4wdg4c",
            "score": 11,
            "created_utc": 1535378206.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4x0rz6",
            "parent_id": "t1_e4wrn7p",
            "score": 9,
            "created_utc": 1535379343.0,
            "replies": [
                {
                    "body": "Another amusing part of this thread is the downvote brigade. They seem to be pretty organized when someone disagrees with them. :)\n\nSo, I'm going to guess gifting a SB flowers is also verboten?",
                    "author": "SugeDaddio",
                    "id": "e4x1cpd",
                    "parent_id": "t1_e4x0rz6",
                    "score": -2,
                    "created_utc": 1535379906.0,
                    "replies": [
                        {
                            "body": "If you ask her what she wants from the store on your way to see her and she says food and you bring her flowers instead because you’d rather her be happy with flowers and it doesn’t fulfill your fantasy to provide her food then yes, that’s rude and weird.  \n\nIf you don’t ask and just show up with them then no of course that’s always welcome, even by people who dont love flowers.\n\nYour posts are all totally missing the major point which is he’s asking her need and then ignoring that need because he wants to stay in his fantasy.  Then don’t ask! It’s degrading to say “no dear, you don’t need that, I have decided after asking you what you need that you can’t decide for yourself so here is this instead! I am such a great man! “",
                            "author": "alexeySB",
                            "id": "e4x9s4l",
                            "parent_id": "t1_e4x1cpd",
                            "score": 9,
                            "created_utc": 1535387568.0,
                            "replies": [
                                {
                                    "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
                                    "author": "SugeDaddio",
                                    "id": "e4xl0mz",
                                    "parent_id": "t1_e4x9s4l",
                                    "score": 1,
                                    "created_utc": 1535397381.0,
                                    "replies": [
                                        {
                                            "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                                            "author": "alexeySB",
                                            "id": "e4xo1f6",
                                            "parent_id": "t1_e4xl0mz",
                                            "score": 4,
                                            "created_utc": 1535399883.0,
                                            "replies": [
                                                {
                                                    "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                                                    "author": "SugeDaddio",
                                                    "id": "e4xogek",
                                                    "parent_id": "t1_e4xo1f6",
                                                    "score": 1,
                                                    "created_utc": 1535400233.0,
                                                    "replies": [
                                                        {
                                                            "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                                            "author": "alexeySB",
                                                            "id": "e4xpbmd",
                                                            "parent_id": "t1_e4xogek",
                                                            "score": 2,
                                                            "created_utc": 1535400935.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                                                    "author": "SugeDaddio",
                                                                    "id": "e4xqgqj",
                                                                    "parent_id": "t1_e4xpbmd",
                                                                    "score": 0,
                                                                    "created_utc": 1535401876.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think that's going to depend on discretion.  If you can do it in a discrete way (for both of you), I think most would be happy with a little surprise of lowers.\n\nOn the other hand, if you have an SB that has a boyfriend/husband, even if it's legitimately an open relationship... do you really think they want to be showing back up with flowers?  Probably not.  ",
                            "author": "SDstartingOut",
                            "id": "e4x1mvb",
                            "parent_id": "t1_e4x1cpd",
                            "score": 3,
                            "created_utc": 1535380185.0,
                            "replies": [
                                {
                                    "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
                                    "author": "SugeDaddio",
                                    "id": "e4x1wa8",
                                    "parent_id": "t1_e4x1mvb",
                                    "score": 0,
                                    "created_utc": 1535380438.0,
                                    "replies": [
                                        {
                                            "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                                            "author": "alexeySB",
                                            "id": "e4x9twu",
                                            "parent_id": "t1_e4x1wa8",
                                            "score": 3,
                                            "created_utc": 1535387612.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you usually ask people what they want, ignore them, and tell them you’re getting them something they don’t want?",
            "author": "DelicateDalliances",
            "id": "e4x8cdj",
            "parent_id": "t1_e4wrn7p",
            "score": 6,
            "created_utc": 1535386306.0,
            "replies": [
                {
                    "body": "Since it is a gift, I usually give them things I think they might like which they would never buy for themselves.\n\nI'm learning this won't work on the SBs here.\n\nPerhaps the sugar world needs it's own term, how does \"sugar gift\" sound? Because based on the expectations here, the word gift isn't what is being referred to.",
                    "author": "SugeDaddio",
                    "id": "e4x8tga",
                    "parent_id": "t1_e4x8cdj",
                    "score": 1,
                    "created_utc": 1535386729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He asked me what I would want for a gift. Why is this hard to understand. ",
            "author": "DelicateDalliances",
            "id": "e4wcbww",
            "parent_id": "t1_e4w4cmo",
            "score": 15,
            "created_utc": 1535340148.0,
            "replies": []
        },
        {
            "body": "Really? The only thing I added was the word cash but, based on the reactions, that's what they mean when they say buy me what I want not what you want to give me.",
            "author": "SugeDaddio",
            "id": "e4wszuy",
            "parent_id": "t1_e4wscnh",
            "score": -6,
            "created_utc": 1535370050.0,
            "replies": [
                {
                    "body": "Ok so you're acknowledging that you're making things up. Good.",
                    "author": "blonde-throwaway",
                    "id": "e4wt8af",
                    "parent_id": "t1_e4wszuy",
                    "score": 16,
                    "created_utc": 1535370401.0,
                    "replies": []
                },
                {
                    "body": ">buy me what I want not what you want to give me.\n\nThis is generally the correct approach to gift-giving.",
                    "author": null,
                    "id": "e4x5911",
                    "parent_id": "t1_e4wszuy",
                    "score": 12,
                    "created_utc": 1535383540.0,
                    "replies": [
                        {
                            "body": "SMH.\n\nI'm learning that maybe the sugar world works that way but the real world most assuredly does not.\n\nLike I said in another post, this has been a true eye opener for me so I should thank you for that.\n\nI will also be sure to have this discussion with SBs and I will be walking away at the first sign of this kind of entitled behaviour.\n\nGood luck to you.",
                            "author": "SugeDaddio",
                            "id": "e4x5o1o",
                            "parent_id": "t1_e4x5911",
                            "score": -2,
                            "created_utc": 1535383911.0,
                            "replies": [
                                {
                                    "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
                                    "author": null,
                                    "id": "e4xhyyx",
                                    "parent_id": "t1_e4x5o1o",
                                    "score": 9,
                                    "created_utc": 1535394610.0,
                                    "replies": [
                                        {
                                            "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                                            "author": "SugeDaddio",
                                            "id": "e4xio5j",
                                            "parent_id": "t1_e4xhyyx",
                                            "score": -1,
                                            "created_utc": 1535395311.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
                                    "author": "alexeySB",
                                    "id": "e4x9cnq",
                                    "parent_id": "t1_e4x5o1o",
                                    "score": 6,
                                    "created_utc": 1535387192.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The point of a gift is not to make yourself happy. If you are buying people you care about gifts to make yourself happy I feel bad for the people in your life. ",
            "author": "DelicateDalliances",
            "id": "e4wckxc",
            "parent_id": "t1_e4w43yp",
            "score": 22,
            "created_utc": 1535340439.0,
            "replies": []
        },
        {
            "body": "...what? What does a diamond necklace do for you? Meanwhile your SB has nice shiny things but could be late on her rent...",
            "author": "summerallya",
            "id": "e4w6gkc",
            "parent_id": "t1_e4w43yp",
            "score": 27,
            "created_utc": 1535333702.0,
            "replies": [
                {
                    "body": "SDs here would rather their SB be homeless and uneducated wearing lingerie and diamonds in the street apparently. ",
                    "author": "DelicateDalliances",
                    "id": "e4wcm0i",
                    "parent_id": "t1_e4w6gkc",
                    "score": 30,
                    "created_utc": 1535340473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you almost done trolling SLF? ",
            "author": "tannedsb05",
            "id": "e4w77bk",
            "parent_id": "t1_e4w43yp",
            "score": 19,
            "created_utc": 1535334502.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e4w7fr2",
                    "parent_id": "t1_e4w77bk",
                    "score": 21,
                    "created_utc": 1535334752.0,
                    "replies": [
                        {
                            "body": "I fucking laughed out loud at this. Thank you. 👏🏻👏🏻❤️",
                            "author": "seekingsweetsugar",
                            "id": "e4wgjwx",
                            "parent_id": "t1_e4w7fr2",
                            "score": 11,
                            "created_utc": 1535345669.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why bother asking someone what they'd like as a gift if you don't care what they actually want?",
            "author": "DelicateDalliances",
            "id": "e4wcb9t",
            "parent_id": "t1_e4w7k0a",
            "score": 22,
            "created_utc": 1535340127.0,
            "replies": []
        },
        {
            "body": "That would be your choice ",
            "author": "tannedsb05",
            "id": "e4w7l7s",
            "parent_id": "t1_e4w7k0a",
            "score": 14,
            "created_utc": 1535334913.0,
            "replies": []
        },
        {
            "body": "Ok so when you get a gift for someone you don't bother to look into what they want, you just get them something you want? That's how you give gifts? \n\n&#x200B;\n\nHe asked me what I wanted and then said no to my suggestion. He said no to my second suggestion. He then suggested things he wanted. Explain how thats a gift?",
            "author": "DelicateDalliances",
            "id": "e4w3mem",
            "parent_id": "t1_e4w3elp",
            "score": 24,
            "created_utc": 1535330625.0,
            "replies": [
                {
                    "body": "When I give a gift, I give something I think they will like and enjoy. I try to be thoughtful.\n\nIf I want to be helpful and I ask what they need, I don't consider that a gift - it's more of a hand up.\n\nStill, it sounds to me like your negotiating over your allowance.",
                    "author": "SugeDaddio",
                    "id": "e4w3zxw",
                    "parent_id": "t1_e4w3mem",
                    "score": -3,
                    "created_utc": 1535331039.0,
                    "replies": [
                        {
                            "body": "How is it negotiating to tell someone what I would like as a gift when they ask me?",
                            "author": "DelicateDalliances",
                            "id": "e4wcddd",
                            "parent_id": "t1_e4w3zxw",
                            "score": 14,
                            "created_utc": 1535340194.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I ceased conversation with this person for a number of reasons. ",
            "author": "DelicateDalliances",
            "id": "e4xkbyk",
            "parent_id": "t1_e4xbbgu",
            "score": 3,
            "created_utc": 1535396788.0,
            "replies": []
        },
        {
            "body": "Words from this poster \"your attitude is ugly\" \n\nAlso from this poster \"SRs are shallow and I cheat on my wife.\" \n\nI got at least 1 Yike. ",
            "author": "2catsandacomputer",
            "id": "e4wid3u",
            "parent_id": "t1_e4wgwt2",
            "score": 14,
            "created_utc": 1535348580.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "e4wkkza",
                    "parent_id": "t1_e4wid3u",
                    "score": -9,
                    "created_utc": 1535352652.0,
                    "replies": [
                        {
                            "body": "Enjoy your ban, cheating douchebag :)",
                            "author": "2catsandacomputer",
                            "id": "e4wkxu6",
                            "parent_id": "t1_e4wkkza",
                            "score": 10,
                            "created_utc": 1535353359.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'll take things older generations have never had to struggle with for $400, Alex. ",
            "author": "2catsandacomputer",
            "id": "e4xhmla",
            "parent_id": "t1_e4x8go8",
            "score": 8,
            "created_utc": 1535394316.0,
            "replies": []
        },
        {
            "body": "I’m actually really disappointed when I hear about girls who rinse clients, lead them on, etc. I scolded a girl the other day who took $500 from a guy she met outside the club who was expecting sex and drove off. \nI NEVER lie to customers about what I am comfortable with doing. The ones who are worth my time are the ones who are okay with just meeting inside the club and not trying to push boundaries.",
            "author": "saintkatelyn",
            "id": "e4xto9k",
            "parent_id": "t1_e4xp03m",
            "score": 8,
            "created_utc": 1535404557.0,
            "replies": []
        },
        {
            "body": "Yeah I've gotten some lacey frilly bits that are several sizes too small. Annoys the shit out of me especially when a guy insists that I squeeze into the damn thing even though I've told him that my tits aren't going to fit into those goddamn cups and that the band size is off by several inches. Absolute waste, ends up in the garbage and I hate doing that. Bah",
            "author": "CJ3500",
            "id": "e4weebf",
            "parent_id": "t1_e4we27g",
            "score": 10,
            "created_utc": 1535342659.0,
            "replies": []
        },
        {
            "body": "Yeah I think I could have phrased it better 🙃😅",
            "author": "nini-jay",
            "id": "e4xpid3",
            "parent_id": "t1_e4xpd30",
            "score": 5,
            "created_utc": 1535401085.0,
            "replies": [
                {
                    "body": "No worries. Otherwise you did a very nice job of reducing the OP's lengthy rant to a pithy tl;dr :D",
                    "author": null,
                    "id": "e4xpsng",
                    "parent_id": "t1_e4xpid3",
                    "score": 5,
                    "created_utc": 1535401323.0,
                    "replies": [
                        {
                            "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
                            "author": "nini-jay",
                            "id": "e4xpw57",
                            "parent_id": "t1_e4xpsng",
                            "score": 3,
                            "created_utc": 1535401401.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Another amusing part of this thread is the downvote brigade. They seem to be pretty organized when someone disagrees with them. :)\n\nSo, I'm going to guess gifting a SB flowers is also verboten?",
            "author": "SugeDaddio",
            "id": "e4x1cpd",
            "parent_id": "t1_e4x0rz6",
            "score": -2,
            "created_utc": 1535379906.0,
            "replies": [
                {
                    "body": "If you ask her what she wants from the store on your way to see her and she says food and you bring her flowers instead because you’d rather her be happy with flowers and it doesn’t fulfill your fantasy to provide her food then yes, that’s rude and weird.  \n\nIf you don’t ask and just show up with them then no of course that’s always welcome, even by people who dont love flowers.\n\nYour posts are all totally missing the major point which is he’s asking her need and then ignoring that need because he wants to stay in his fantasy.  Then don’t ask! It’s degrading to say “no dear, you don’t need that, I have decided after asking you what you need that you can’t decide for yourself so here is this instead! I am such a great man! “",
                    "author": "alexeySB",
                    "id": "e4x9s4l",
                    "parent_id": "t1_e4x1cpd",
                    "score": 9,
                    "created_utc": 1535387568.0,
                    "replies": [
                        {
                            "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
                            "author": "SugeDaddio",
                            "id": "e4xl0mz",
                            "parent_id": "t1_e4x9s4l",
                            "score": 1,
                            "created_utc": 1535397381.0,
                            "replies": [
                                {
                                    "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                                    "author": "alexeySB",
                                    "id": "e4xo1f6",
                                    "parent_id": "t1_e4xl0mz",
                                    "score": 4,
                                    "created_utc": 1535399883.0,
                                    "replies": [
                                        {
                                            "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                                            "author": "SugeDaddio",
                                            "id": "e4xogek",
                                            "parent_id": "t1_e4xo1f6",
                                            "score": 1,
                                            "created_utc": 1535400233.0,
                                            "replies": [
                                                {
                                                    "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                                    "author": "alexeySB",
                                                    "id": "e4xpbmd",
                                                    "parent_id": "t1_e4xogek",
                                                    "score": 2,
                                                    "created_utc": 1535400935.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                                            "author": "SugeDaddio",
                                                            "id": "e4xqgqj",
                                                            "parent_id": "t1_e4xpbmd",
                                                            "score": 0,
                                                            "created_utc": 1535401876.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think that's going to depend on discretion.  If you can do it in a discrete way (for both of you), I think most would be happy with a little surprise of lowers.\n\nOn the other hand, if you have an SB that has a boyfriend/husband, even if it's legitimately an open relationship... do you really think they want to be showing back up with flowers?  Probably not.  ",
                    "author": "SDstartingOut",
                    "id": "e4x1mvb",
                    "parent_id": "t1_e4x1cpd",
                    "score": 3,
                    "created_utc": 1535380185.0,
                    "replies": [
                        {
                            "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
                            "author": "SugeDaddio",
                            "id": "e4x1wa8",
                            "parent_id": "t1_e4x1mvb",
                            "score": 0,
                            "created_utc": 1535380438.0,
                            "replies": [
                                {
                                    "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                                    "author": "alexeySB",
                                    "id": "e4x9twu",
                                    "parent_id": "t1_e4x1wa8",
                                    "score": 3,
                                    "created_utc": 1535387612.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Since it is a gift, I usually give them things I think they might like which they would never buy for themselves.\n\nI'm learning this won't work on the SBs here.\n\nPerhaps the sugar world needs it's own term, how does \"sugar gift\" sound? Because based on the expectations here, the word gift isn't what is being referred to.",
            "author": "SugeDaddio",
            "id": "e4x8tga",
            "parent_id": "t1_e4x8cdj",
            "score": 1,
            "created_utc": 1535386729.0,
            "replies": []
        },
        {
            "body": "Ok so you're acknowledging that you're making things up. Good.",
            "author": "blonde-throwaway",
            "id": "e4wt8af",
            "parent_id": "t1_e4wszuy",
            "score": 16,
            "created_utc": 1535370401.0,
            "replies": []
        },
        {
            "body": ">buy me what I want not what you want to give me.\n\nThis is generally the correct approach to gift-giving.",
            "author": null,
            "id": "e4x5911",
            "parent_id": "t1_e4wszuy",
            "score": 12,
            "created_utc": 1535383540.0,
            "replies": [
                {
                    "body": "SMH.\n\nI'm learning that maybe the sugar world works that way but the real world most assuredly does not.\n\nLike I said in another post, this has been a true eye opener for me so I should thank you for that.\n\nI will also be sure to have this discussion with SBs and I will be walking away at the first sign of this kind of entitled behaviour.\n\nGood luck to you.",
                    "author": "SugeDaddio",
                    "id": "e4x5o1o",
                    "parent_id": "t1_e4x5911",
                    "score": -2,
                    "created_utc": 1535383911.0,
                    "replies": [
                        {
                            "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
                            "author": null,
                            "id": "e4xhyyx",
                            "parent_id": "t1_e4x5o1o",
                            "score": 9,
                            "created_utc": 1535394610.0,
                            "replies": [
                                {
                                    "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                                    "author": "SugeDaddio",
                                    "id": "e4xio5j",
                                    "parent_id": "t1_e4xhyyx",
                                    "score": -1,
                                    "created_utc": 1535395311.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
                            "author": "alexeySB",
                            "id": "e4x9cnq",
                            "parent_id": "t1_e4x5o1o",
                            "score": 6,
                            "created_utc": 1535387192.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SDs here would rather their SB be homeless and uneducated wearing lingerie and diamonds in the street apparently. ",
            "author": "DelicateDalliances",
            "id": "e4wcm0i",
            "parent_id": "t1_e4w6gkc",
            "score": 30,
            "created_utc": 1535340473.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e4w7fr2",
            "parent_id": "t1_e4w77bk",
            "score": 21,
            "created_utc": 1535334752.0,
            "replies": [
                {
                    "body": "I fucking laughed out loud at this. Thank you. 👏🏻👏🏻❤️",
                    "author": "seekingsweetsugar",
                    "id": "e4wgjwx",
                    "parent_id": "t1_e4w7fr2",
                    "score": 11,
                    "created_utc": 1535345669.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I give a gift, I give something I think they will like and enjoy. I try to be thoughtful.\n\nIf I want to be helpful and I ask what they need, I don't consider that a gift - it's more of a hand up.\n\nStill, it sounds to me like your negotiating over your allowance.",
            "author": "SugeDaddio",
            "id": "e4w3zxw",
            "parent_id": "t1_e4w3mem",
            "score": -3,
            "created_utc": 1535331039.0,
            "replies": [
                {
                    "body": "How is it negotiating to tell someone what I would like as a gift when they ask me?",
                    "author": "DelicateDalliances",
                    "id": "e4wcddd",
                    "parent_id": "t1_e4w3zxw",
                    "score": 14,
                    "created_utc": 1535340194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "e4wkkza",
            "parent_id": "t1_e4wid3u",
            "score": -9,
            "created_utc": 1535352652.0,
            "replies": [
                {
                    "body": "Enjoy your ban, cheating douchebag :)",
                    "author": "2catsandacomputer",
                    "id": "e4wkxu6",
                    "parent_id": "t1_e4wkkza",
                    "score": 10,
                    "created_utc": 1535353359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No worries. Otherwise you did a very nice job of reducing the OP's lengthy rant to a pithy tl;dr :D",
            "author": null,
            "id": "e4xpsng",
            "parent_id": "t1_e4xpid3",
            "score": 5,
            "created_utc": 1535401323.0,
            "replies": [
                {
                    "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
                    "author": "nini-jay",
                    "id": "e4xpw57",
                    "parent_id": "t1_e4xpsng",
                    "score": 3,
                    "created_utc": 1535401401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you ask her what she wants from the store on your way to see her and she says food and you bring her flowers instead because you’d rather her be happy with flowers and it doesn’t fulfill your fantasy to provide her food then yes, that’s rude and weird.  \n\nIf you don’t ask and just show up with them then no of course that’s always welcome, even by people who dont love flowers.\n\nYour posts are all totally missing the major point which is he’s asking her need and then ignoring that need because he wants to stay in his fantasy.  Then don’t ask! It’s degrading to say “no dear, you don’t need that, I have decided after asking you what you need that you can’t decide for yourself so here is this instead! I am such a great man! “",
            "author": "alexeySB",
            "id": "e4x9s4l",
            "parent_id": "t1_e4x1cpd",
            "score": 9,
            "created_utc": 1535387568.0,
            "replies": [
                {
                    "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
                    "author": "SugeDaddio",
                    "id": "e4xl0mz",
                    "parent_id": "t1_e4x9s4l",
                    "score": 1,
                    "created_utc": 1535397381.0,
                    "replies": [
                        {
                            "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                            "author": "alexeySB",
                            "id": "e4xo1f6",
                            "parent_id": "t1_e4xl0mz",
                            "score": 4,
                            "created_utc": 1535399883.0,
                            "replies": [
                                {
                                    "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                                    "author": "SugeDaddio",
                                    "id": "e4xogek",
                                    "parent_id": "t1_e4xo1f6",
                                    "score": 1,
                                    "created_utc": 1535400233.0,
                                    "replies": [
                                        {
                                            "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                            "author": "alexeySB",
                                            "id": "e4xpbmd",
                                            "parent_id": "t1_e4xogek",
                                            "score": 2,
                                            "created_utc": 1535400935.0,
                                            "replies": [
                                                {
                                                    "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                                    "author": "SugeDaddio",
                                                    "id": "e4xqgqj",
                                                    "parent_id": "t1_e4xpbmd",
                                                    "score": 0,
                                                    "created_utc": 1535401876.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that's going to depend on discretion.  If you can do it in a discrete way (for both of you), I think most would be happy with a little surprise of lowers.\n\nOn the other hand, if you have an SB that has a boyfriend/husband, even if it's legitimately an open relationship... do you really think they want to be showing back up with flowers?  Probably not.  ",
            "author": "SDstartingOut",
            "id": "e4x1mvb",
            "parent_id": "t1_e4x1cpd",
            "score": 3,
            "created_utc": 1535380185.0,
            "replies": [
                {
                    "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
                    "author": "SugeDaddio",
                    "id": "e4x1wa8",
                    "parent_id": "t1_e4x1mvb",
                    "score": 0,
                    "created_utc": 1535380438.0,
                    "replies": [
                        {
                            "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                            "author": "alexeySB",
                            "id": "e4x9twu",
                            "parent_id": "t1_e4x1wa8",
                            "score": 3,
                            "created_utc": 1535387612.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SMH.\n\nI'm learning that maybe the sugar world works that way but the real world most assuredly does not.\n\nLike I said in another post, this has been a true eye opener for me so I should thank you for that.\n\nI will also be sure to have this discussion with SBs and I will be walking away at the first sign of this kind of entitled behaviour.\n\nGood luck to you.",
            "author": "SugeDaddio",
            "id": "e4x5o1o",
            "parent_id": "t1_e4x5911",
            "score": -2,
            "created_utc": 1535383911.0,
            "replies": [
                {
                    "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
                    "author": null,
                    "id": "e4xhyyx",
                    "parent_id": "t1_e4x5o1o",
                    "score": 9,
                    "created_utc": 1535394610.0,
                    "replies": [
                        {
                            "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                            "author": "SugeDaddio",
                            "id": "e4xio5j",
                            "parent_id": "t1_e4xhyyx",
                            "score": -1,
                            "created_utc": 1535395311.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
                    "author": "alexeySB",
                    "id": "e4x9cnq",
                    "parent_id": "t1_e4x5o1o",
                    "score": 6,
                    "created_utc": 1535387192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I fucking laughed out loud at this. Thank you. 👏🏻👏🏻❤️",
            "author": "seekingsweetsugar",
            "id": "e4wgjwx",
            "parent_id": "t1_e4w7fr2",
            "score": 11,
            "created_utc": 1535345669.0,
            "replies": []
        },
        {
            "body": "How is it negotiating to tell someone what I would like as a gift when they ask me?",
            "author": "DelicateDalliances",
            "id": "e4wcddd",
            "parent_id": "t1_e4w3zxw",
            "score": 14,
            "created_utc": 1535340194.0,
            "replies": []
        },
        {
            "body": "Enjoy your ban, cheating douchebag :)",
            "author": "2catsandacomputer",
            "id": "e4wkxu6",
            "parent_id": "t1_e4wkkza",
            "score": 10,
            "created_utc": 1535353359.0,
            "replies": []
        },
        {
            "body": "Hahahahahaha 😂 thanks lmao I tried 😅",
            "author": "nini-jay",
            "id": "e4xpw57",
            "parent_id": "t1_e4xpsng",
            "score": 3,
            "created_utc": 1535401401.0,
            "replies": []
        },
        {
            "body": "Sorry but you (and everyone else in the downvote brigade) are missing the point, OP included.\n\nWhat the OP is calling is gift is NOT a gift. Anything requiring discussions or negotiations is NOT a gift. I even included the definition in my original reply but that went over like a lead balloon. \n\nI was also simply trying to point out that these sorts of attitudes towards bonafide gifts are unacceptable from my perspective.\n\nI need to remind myself more often that we are now living in a post-truth world.",
            "author": "SugeDaddio",
            "id": "e4xl0mz",
            "parent_id": "t1_e4x9s4l",
            "score": 1,
            "created_utc": 1535397381.0,
            "replies": [
                {
                    "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
                    "author": "alexeySB",
                    "id": "e4xo1f6",
                    "parent_id": "t1_e4xl0mz",
                    "score": 4,
                    "created_utc": 1535399883.0,
                    "replies": [
                        {
                            "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                            "author": "SugeDaddio",
                            "id": "e4xogek",
                            "parent_id": "t1_e4xo1f6",
                            "score": 1,
                            "created_utc": 1535400233.0,
                            "replies": [
                                {
                                    "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                                    "author": "alexeySB",
                                    "id": "e4xpbmd",
                                    "parent_id": "t1_e4xogek",
                                    "score": 2,
                                    "created_utc": 1535400935.0,
                                    "replies": [
                                        {
                                            "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                            "author": "SugeDaddio",
                                            "id": "e4xqgqj",
                                            "parent_id": "t1_e4xpbmd",
                                            "score": 0,
                                            "created_utc": 1535401876.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For most of my adult life it's been hammered into my head that \"girls love getting flowers\".\n\nI really need to get my head into the this is a 100% business transaction space. Sounds like that will save both myself and my SB some grief. ",
            "author": "SugeDaddio",
            "id": "e4x1wa8",
            "parent_id": "t1_e4x1mvb",
            "score": 0,
            "created_utc": 1535380438.0,
            "replies": [
                {
                    "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
                    "author": "alexeySB",
                    "id": "e4x9twu",
                    "parent_id": "t1_e4x1wa8",
                    "score": 3,
                    "created_utc": 1535387612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I meant it's the correct approach to gift-giving, period.  You should buy people things they want/you think they'd enjoy.  Unless your attitude is that the purpose of gift-giving is to make the giver feel good, and whether the recipient will enjoy what they receive is irrelevant.\n\nI mean, that's how I look at it.  Besides, why would I want to give someone something that they wouldn't like?",
            "author": null,
            "id": "e4xhyyx",
            "parent_id": "t1_e4x5o1o",
            "score": 9,
            "created_utc": 1535394610.0,
            "replies": [
                {
                    "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
                    "author": "SugeDaddio",
                    "id": "e4xio5j",
                    "parent_id": "t1_e4xhyyx",
                    "score": -1,
                    "created_utc": 1535395311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re missing a major point.. if he was just getting her presents to be thoughtful that’s one thing... he’s living in his own self absorbed fantasy of wanting to “dote” on her and forcing her to do a song and dance where she expresses what she likes and when it doesn’t fall into what he wants to provide he blatantly ignores that.  It’s a power issue and it’s not him naively giving her something she doesn’t want, he’s blatantly being inconsiderate.  She’s not demanding certain things, he’s asking her putting her on the spot multiple times for her to express things she would like to have them he pretends she says what he wanted to hear.. it’s a fantasy and it’s quite obnoxious and rude.  Again, I don’t think OP would care if he wasn’t **asking her** beforehand ",
            "author": "alexeySB",
            "id": "e4x9cnq",
            "parent_id": "t1_e4x5o1o",
            "score": 6,
            "created_utc": 1535387192.0,
            "replies": []
        },
        {
            "body": "So when my mom asks me what I want for Christmas that’s not a gift because she asked me what I want? 🤔 I don’t need to reference Merriam -Webster to answer that.  \n\nIt boils down to the fact that her SD is (consciously or subconsciously) is having her list her needs and wants while already knowing he’s not going to consider them.  It’s degrading because instead of the “gift” being considerate, it’s simply an act in his fantasy so that he can feel self-important. \n\nPlease reread this thread once you’ve calmed down. The major issue in OP’s interaction is that the SD asked (to come off as considerate and caring) and then completely went against what she suggested because it didn’t fit into his fantasy (the opposite of considerate, inconsiderate).   If you’ve already decided what to get her, just get it for her and don’t ask.  If you want to get her something you know she wants, ask and then get what is suggested. This is basic logic! ",
            "author": "alexeySB",
            "id": "e4xo1f6",
            "parent_id": "t1_e4xl0mz",
            "score": 4,
            "created_utc": 1535399883.0,
            "replies": [
                {
                    "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
                    "author": "SugeDaddio",
                    "id": "e4xogek",
                    "parent_id": "t1_e4xo1f6",
                    "score": 1,
                    "created_utc": 1535400233.0,
                    "replies": [
                        {
                            "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                            "author": "alexeySB",
                            "id": "e4xpbmd",
                            "parent_id": "t1_e4xogek",
                            "score": 2,
                            "created_utc": 1535400935.0,
                            "replies": [
                                {
                                    "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                                    "author": "SugeDaddio",
                                    "id": "e4xqgqj",
                                    "parent_id": "t1_e4xpbmd",
                                    "score": 0,
                                    "created_utc": 1535401876.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No one has said you can’t bring flowers this is so silly you’re reaching but enjoy your negative  narrative ",
            "author": "alexeySB",
            "id": "e4x9twu",
            "parent_id": "t1_e4x1wa8",
            "score": 3,
            "created_utc": 1535387612.0,
            "replies": []
        },
        {
            "body": "Beyond not buying something the recipient wouldn't like, we obviously have very different approaches to gift giving.\n\nIf I need to ask what \"gift\" a recipient wants - that is not a gift.",
            "author": "SugeDaddio",
            "id": "e4xio5j",
            "parent_id": "t1_e4xhyyx",
            "score": -1,
            "created_utc": 1535395311.0,
            "replies": []
        },
        {
            "body": "How does my writing make you think that I'm not calm? That's funny and couldn't be further from the truth.\n\nIt was clear to me yesterday that my point was being completely missed. I merely tried to re-explain it again to you. Clearly though, it's another strike-out.",
            "author": "SugeDaddio",
            "id": "e4xogek",
            "parent_id": "t1_e4xo1f6",
            "score": 1,
            "created_utc": 1535400233.0,
            "replies": [
                {
                    "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
                    "author": "alexeySB",
                    "id": "e4xpbmd",
                    "parent_id": "t1_e4xogek",
                    "score": 2,
                    "created_utc": 1535400935.0,
                    "replies": [
                        {
                            "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                            "author": "SugeDaddio",
                            "id": "e4xqgqj",
                            "parent_id": "t1_e4xpbmd",
                            "score": 0,
                            "created_utc": 1535401876.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">How does my writing make you think that I'm not calm?\n\nBecause you’re jumping to conclusions and just referred to a random stranger on the internet as a member of the “downvote brigade”... perhaps people are down voting your responses because you’re misinterpreting what people are writing and not taking time to hear the other (majority) perspective.  You’ve inserted a narrative throughout this thread about SBs being entitled and transactional and none of that has anything to do with her SD being inconsiderate and self-centered in how he’s handling gifts.  The overwhelming response should tell you that many women deal with similar interactions, not that every girl is entitled.  I don’t think anyone in this thread feels entitled to extra presents, period! ",
            "author": "alexeySB",
            "id": "e4xpbmd",
            "parent_id": "t1_e4xogek",
            "score": 2,
            "created_utc": 1535400935.0,
            "replies": [
                {
                    "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
                    "author": "SugeDaddio",
                    "id": "e4xqgqj",
                    "parent_id": "t1_e4xpbmd",
                    "score": 0,
                    "created_utc": 1535401876.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nowhere did I say that every girl is entitled. Please, don't put words in my keyboard.\n\nDid you read all of my posts? I simply said that people who aren't happy after receiving a gift (and what the OP is referring to is not a gift) are entitled. And let me add, it is my prerogative to feel that way.\n\nThat said, I didn't say that about SBs in general. Maybe you are generalizing just a little here?\n\nThe overwhelming response here is made up of SBs. I haven't been here long but it's clear that the SBs far outnumber the SDs.\n\nLook, no matter how you slice it, I won't start believing that the sky is green because everybody here says it is.\n\nHopefully my SB will appreciate my gifts. If she doesn't then she will realize I'm not the right SD for her.",
            "author": "SugeDaddio",
            "id": "e4xqgqj",
            "parent_id": "t1_e4xpbmd",
            "score": 0,
            "created_utc": 1535401876.0,
            "replies": []
        }
    ]
}