{
    "title": "Re-watching the 100 vs 100 episode... Man, the variety of people we met and the jokes that came out were insane 😂",
    "post_id": "n58dmv",
    "post_url": "https://www.reddit.com/r/runningman/comments/n58dmv/rewatching_the_100_vs_100_episode_man_the_variety/",
    "author": "moretoachieve",
    "body": "",
    "url": "https://v.redd.it/kph52z5cn8x61",
    "score": 363,
    "upvote_ratio": 0.99,
    "created_utc": 1620192892.0,
    "num_comments": 39,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Poor Uee just wanted to leave",
            "author": "IAmHairyChicken",
            "id": "gwzx88d",
            "parent_id": "t3_n58dmv",
            "score": 69,
            "created_utc": 1620195241.0,
            "replies": [
                {
                    "body": "Didn't she show up just to bring them food or something and then they held her hostage for hours when she had a shoot to go to? lol",
                    "author": "paragonofcynicism",
                    "id": "gx1z76i",
                    "parent_id": "t1_gwzx88d",
                    "score": 10,
                    "created_utc": 1620238261.0,
                    "replies": [
                        {
                            "body": "If my memory serves me right, she went there because she thought she will be a guest for an entire episode. She ended up leaving before the rest tho. Not entirely sure since my brain is rusty.",
                            "author": "puzzle-head5",
                            "id": "gx23egx",
                            "parent_id": "t1_gx1z76i",
                            "score": 7,
                            "created_utc": 1620240058.0,
                            "replies": [
                                {
                                    "body": "I think Kwangsoo called her to come with drinks & food,but i think she thought it was only her who will be the guest.\n\nI notices that some Korea celebs tend to act like this,but i can totally understand Nana reaction,since it will be akward with people whom you have never met,especially Haha 'underground friends' & the boxing legend.",
                                    "author": null,
                                    "id": "gx243t8",
                                    "parent_id": "t1_gx23egx",
                                    "score": 7,
                                    "created_utc": 1620240355.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Uee was so strange here I couldnt quite make her out the first couple times I watched.\n\nIts so strange to watch an idol, especially one they had a connection too, be so outwardly displeased, \nand its like without the idol 'persona' on her, she just froze and couldnt act normal for a good chunk of time, she wasnt leaving though. And despite her being really awkward they didnt keep her to the back, they kept bringing attention to her, And then by the end she was saying how she didnt wanna leave lol.\n\nShe was a highlight of the ep, but also quite strange lol. in a way it was refreshing.",
                    "author": "Denethorsmukbang",
                    "id": "gx2lt6x",
                    "parent_id": "t1_gwzx88d",
                    "score": 6,
                    "created_utc": 1620247758.0,
                    "replies": [
                        {
                            "body": "She was kinda 4d but also kinda shocked because KS didn't explain the situation to her lmao I also like that she invited SVT at the end to help the RM cast meet the numbers",
                            "author": "moretoachieve",
                            "id": "gx3m1fg",
                            "parent_id": "t1_gx2lt6x",
                            "score": 3,
                            "created_utc": 1620264626.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "At first. Then she stated she wish she could stay longer, particularly after the toilet paper game when she looked to be having a blast.",
                    "author": "xander_yi",
                    "id": "gx48t2a",
                    "parent_id": "t1_gwzx88d",
                    "score": 4,
                    "created_utc": 1620277582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Still one of my favorite episodes. Jaesuk definitely proved here that he is the national MC.",
            "author": "arwen_rivendell",
            "id": "gx08ucn",
            "parent_id": "t3_n58dmv",
            "score": 54,
            "created_utc": 1620205353.0,
            "replies": []
        },
        {
            "body": "The cast flexing their connections is always great, usually so random and unexpected.",
            "author": "zaichii",
            "id": "gx06u3s",
            "parent_id": "t3_n58dmv",
            "score": 25,
            "created_utc": 1620203420.0,
            "replies": [
                {
                    "body": "I am not really that shocked with Haha connection since he is i believe came from 'underground scenes',but of course working in the entertainment industry,you are bound to meet a lot of people.\n\nBut i really wonder why Kwangsoo/Jihyo don't call up their fellow actor/actress colleagues?It always 'Jo In Sung/Lee Dong Wook' whom they will try to call 1st.\n\nBut i love that they tried their best to convinces some of the guest to come,especially the boxing legend & Haha reggae fam.",
                    "author": null,
                    "id": "gx24q01",
                    "parent_id": "t1_gx06u3s",
                    "score": 3,
                    "created_utc": 1620240615.0,
                    "replies": [
                        {
                            "body": "Just because they've worked together in the past doesn't mean they're close enough to randomly call up and invite to their show. And you never know if they've discussed not wanting to be on the show, or if they have they're own schedule going on. There's alot of factors that they can't all show in 60-90 minute episodes.",
                            "author": "quietanonn",
                            "id": "gx31ign",
                            "parent_id": "t1_gx24q01",
                            "score": 8,
                            "created_utc": 1620254688.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "my favorite moment in the 100 vs 100 event was the dance battle between Jackson and joon park lmao",
            "author": "mongjes",
            "id": "gx04cbi",
            "parent_id": "t3_n58dmv",
            "score": 22,
            "created_utc": 1620201098.0,
            "replies": [
                {
                    "body": "This is the part where the guests started coming into their own, and GOT7 were really impressive here, not being intimidated as idols.\n\nJackson volunteering to battle the comedian duo was hilarious too, and then joon park and the other bicycle guy who's name I cant remember.",
                    "author": "Denethorsmukbang",
                    "id": "gx2m2j5",
                    "parent_id": "t1_gx04cbi",
                    "score": 8,
                    "created_utc": 1620247865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My most favorite episode. 💕",
            "author": "glassesinglamour",
            "id": "gwzui6i",
            "parent_id": "t3_n58dmv",
            "score": 20,
            "created_utc": 1620193167.0,
            "replies": [
                {
                    "body": "It's one of my tops as well! The trot singer, the comedian sunbaenim, the senior boxer champions, Haha's reggae fam... they were all great. I really enjoy it when the guests are people close to them because the banter is easy going and usually more savage (ep 360-361 were also some good eps)",
                    "author": "moretoachieve",
                    "id": "gwzx2f5",
                    "parent_id": "t1_gwzui6i",
                    "score": 28,
                    "created_utc": 1620195115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "rm flex casting 193 guest",
            "author": "Super_Speed_4460",
            "id": "gx0nbb2",
            "parent_id": "t3_n58dmv",
            "score": 8,
            "created_utc": 1620217015.0,
            "replies": []
        },
        {
            "body": "Oh man. I'm guilty to have watched these episodes more than twice!! It's just touching how their friends came over with just a phone call without a valid explanation. It's touching and surprising. Hihihi I lav it!! Running Man is amaaaaaaaazing",
            "author": "curieusebellafleur",
            "id": "gx0vd51",
            "parent_id": "t3_n58dmv",
            "score": 5,
            "created_utc": 1620221365.0,
            "replies": []
        },
        {
            "body": "It still is on my top 10 episodes, I always come back to it, and it's amazing every time!",
            "author": "MKLOVER72020",
            "id": "gx11mro",
            "parent_id": "t3_n58dmv",
            "score": 5,
            "created_utc": 1620224299.0,
            "replies": []
        },
        {
            "body": "Possibly my favourite ever episodes for casual viewing along with the first park ji sung episodes.\n\nBut this one is really fascinating because theyre just calling up celebs with no prior warning - and the celebs arent given special treatment, just from all walks of life. Some seem a bit disgruntled by that because they could have been the stars of stand alone eps. \nSometimes there were potentially awkward moments, particularly considering HaHas guests couldnt really qualify as celebs. But it just came together so well and it was so heartwarming.\n\nAlso one of the clear key times I really respected Jae Suks skill, where it was clear as day to see.\n\nThe producers gave them a really hard job - essentially made them MAKE the show interesting and also go smoothly, and Jae Suk took control at the helm masterfully, making it organised and giving every guest their due respect, whilst also highlighting the silliness of it all so they didnt take themselves so seriously, whilst also uniting them in teamwork.\n\nSome guests were a highlight - guests like Jackson, a young idol who people probably expected to just smile and sit there looking pretty - actively engaging to make things interesting, you could tell he was a star in the making right then. \n\nGiests from the past we were familiar with and it was great to see, and others completely new to us, and some that were new to entertainment who you could tell it was a big moment for and theyd never get this kind of opportunity again adn they were really excited - Ma Asung and the the theatre guy that especially says 'when would I get a chance to appear on running man again'? (Id have liked to see more actual celebs and not Haha pickups but thats me being mean, just the potential of other guests were so cool).\nBecause this was still when Running Man had this prestige and excitement to it. \n\nAnd their competitors were genuinely cool and impressive in their own right.\n\nurgh such a cool ep. \n\nActually one of my favourite 'bits' they did on RM was when they rang celebs spontaneously, usually through a challenge. And this was that x1000.\n\nThe actual last battle was probably the least intersting thing about it - jong kook being baited like a dumbarse took a lot of interest out of it.\n\nThe GFriend performance was a huge highlight too, Ive watched ti so many times, just because the celebs being genuinely excited for a personal impromptu performance and their reactions were so cool haha.",
            "author": "Denethorsmukbang",
            "id": "gx2la1o",
            "parent_id": "t3_n58dmv",
            "score": 6,
            "created_utc": 1620247546.0,
            "replies": [
                {
                    "body": "I also come back to PJS eps particularly the Dream Cup/Football official games because they're so funny without even trying!\n\nAnd yes, Ma Asung was a great discover, where else would we see a muscular trot singer with such quick variety sense.\n\nBefore the battle, they skipped quite a lot of the guests (understandable bc of the time constraints) but I found it quite a waste lol but still a pretty solid episode so I still come back to it from time to time.",
                    "author": "moretoachieve",
                    "id": "gx3lwyp",
                    "parent_id": "t1_gx2la1o",
                    "score": 6,
                    "created_utc": 1620264565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This fully showcases YJS' ability to manage conversations and putting his 110% ability as the nation's MC",
            "author": "Kuuganism",
            "id": "gx3owww",
            "parent_id": "t3_n58dmv",
            "score": 6,
            "created_utc": 1620266028.0,
            "replies": []
        },
        {
            "body": "Where do you find these old episodes? I'd love to watch these, but I can't find any of them. Thanks in advance for any help.",
            "author": "Glennture",
            "id": "gx1crvk",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620229054.0,
            "replies": [
                {
                    "body": "I usually watch it on myrunningman(.)com as they have little to no ads",
                    "author": "FriendlyKuri",
                    "id": "gx1m1pp",
                    "parent_id": "t1_gx1crvk",
                    "score": 3,
                    "created_utc": 1620232819.0,
                    "replies": [
                        {
                            "body": "Has anyone realised, or has it happened to anyone else, that myrunningman is rapidly losing all its old links?\n\nI used to watch everything on there happily, now most of the old eps, well up to the 200s , seem to be missing - just in the last couple months or so, a huge shame",
                            "author": "Denethorsmukbang",
                            "id": "gx2ma21",
                            "parent_id": "t1_gx1m1pp",
                            "score": 2,
                            "created_utc": 1620247953.0,
                            "replies": [
                                {
                                    "body": "That didn't happen to me but I haven't use the site to watch old eps for a while.\n\nWhat I notice was that lately they are late with their uploads of the recent eps",
                                    "author": "FriendlyKuri",
                                    "id": "gx2ttnx",
                                    "parent_id": "t1_gx2ma21",
                                    "score": 2,
                                    "created_utc": 1620251181.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What episode is this again? Gotta watch it again!",
            "author": "comeandfinishthis",
            "id": "gx1thsl",
            "parent_id": "t3_n58dmv",
            "score": 5,
            "created_utc": 1620235846.0,
            "replies": [
                {
                    "body": "Ep 271-272, enjoy!",
                    "author": "moretoachieve",
                    "id": "gx3ljic",
                    "parent_id": "t1_gx1thsl",
                    "score": 3,
                    "created_utc": 1620264379.0,
                    "replies": [
                        {
                            "body": "Just read this. Thank you so much!!!",
                            "author": "comeandfinishthis",
                            "id": "hcpejm1",
                            "parent_id": "t1_gx3ljic",
                            "score": 2,
                            "created_utc": 1631549284.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha and his very wide range of friends so cool.",
            "author": "zhc207",
            "id": "gx3bun1",
            "parent_id": "t3_n58dmv",
            "score": 4,
            "created_utc": 1620259616.0,
            "replies": [
                {
                    "body": "I love that he brought underground people, which goes to show he cares about his hoobaes",
                    "author": "moretoachieve",
                    "id": "gx3lm9u",
                    "parent_id": "t1_gx3bun1",
                    "score": 2,
                    "created_utc": 1620264416.0,
                    "replies": [
                        {
                            "body": "100%",
                            "author": "zhc207",
                            "id": "gx3p504",
                            "parent_id": "t1_gx3lm9u",
                            "score": 2,
                            "created_utc": 1620266139.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My fave, too! This episode is how I got my girlfriend to like and watch Running Man lol",
            "author": "ouidoSpaghetti",
            "id": "gx05o38",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620202332.0,
            "replies": []
        },
        {
            "body": "my fav episode! soooooo many guests!!!",
            "author": "imSyuk-",
            "id": "gx0c7f4",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620208575.0,
            "replies": []
        },
        {
            "body": "one of the greatest episodes, imagine casting almost 100 celebrities.",
            "author": "iLegacy_8",
            "id": "gx0rq2w",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620219497.0,
            "replies": []
        },
        {
            "body": "Wish they do this again.",
            "author": "Individual-08645",
            "id": "gx0s0zi",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620219662.0,
            "replies": []
        },
        {
            "body": "Yo that guy who sings trot is amazing",
            "author": "looooolmonster",
            "id": "gx1qp0m",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620234685.0,
            "replies": []
        },
        {
            "body": "Loved this episode!",
            "author": "sannysideup1991",
            "id": "gx4qs0l",
            "parent_id": "t3_n58dmv",
            "score": 3,
            "created_utc": 1620293178.0,
            "replies": []
        },
        {
            "body": "Best episode ever, i wished there would be another one like this",
            "author": "SpicyChickenAdobo01",
            "id": "gxpi2x2",
            "parent_id": "t3_n58dmv",
            "score": 2,
            "created_utc": 1620722444.0,
            "replies": []
        },
        {
            "body": "Didn't she show up just to bring them food or something and then they held her hostage for hours when she had a shoot to go to? lol",
            "author": "paragonofcynicism",
            "id": "gx1z76i",
            "parent_id": "t1_gwzx88d",
            "score": 10,
            "created_utc": 1620238261.0,
            "replies": [
                {
                    "body": "If my memory serves me right, she went there because she thought she will be a guest for an entire episode. She ended up leaving before the rest tho. Not entirely sure since my brain is rusty.",
                    "author": "puzzle-head5",
                    "id": "gx23egx",
                    "parent_id": "t1_gx1z76i",
                    "score": 7,
                    "created_utc": 1620240058.0,
                    "replies": [
                        {
                            "body": "I think Kwangsoo called her to come with drinks & food,but i think she thought it was only her who will be the guest.\n\nI notices that some Korea celebs tend to act like this,but i can totally understand Nana reaction,since it will be akward with people whom you have never met,especially Haha 'underground friends' & the boxing legend.",
                            "author": null,
                            "id": "gx243t8",
                            "parent_id": "t1_gx23egx",
                            "score": 7,
                            "created_utc": 1620240355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Uee was so strange here I couldnt quite make her out the first couple times I watched.\n\nIts so strange to watch an idol, especially one they had a connection too, be so outwardly displeased, \nand its like without the idol 'persona' on her, she just froze and couldnt act normal for a good chunk of time, she wasnt leaving though. And despite her being really awkward they didnt keep her to the back, they kept bringing attention to her, And then by the end she was saying how she didnt wanna leave lol.\n\nShe was a highlight of the ep, but also quite strange lol. in a way it was refreshing.",
            "author": "Denethorsmukbang",
            "id": "gx2lt6x",
            "parent_id": "t1_gwzx88d",
            "score": 6,
            "created_utc": 1620247758.0,
            "replies": [
                {
                    "body": "She was kinda 4d but also kinda shocked because KS didn't explain the situation to her lmao I also like that she invited SVT at the end to help the RM cast meet the numbers",
                    "author": "moretoachieve",
                    "id": "gx3m1fg",
                    "parent_id": "t1_gx2lt6x",
                    "score": 3,
                    "created_utc": 1620264626.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At first. Then she stated she wish she could stay longer, particularly after the toilet paper game when she looked to be having a blast.",
            "author": "xander_yi",
            "id": "gx48t2a",
            "parent_id": "t1_gwzx88d",
            "score": 4,
            "created_utc": 1620277582.0,
            "replies": []
        },
        {
            "body": "I am not really that shocked with Haha connection since he is i believe came from 'underground scenes',but of course working in the entertainment industry,you are bound to meet a lot of people.\n\nBut i really wonder why Kwangsoo/Jihyo don't call up their fellow actor/actress colleagues?It always 'Jo In Sung/Lee Dong Wook' whom they will try to call 1st.\n\nBut i love that they tried their best to convinces some of the guest to come,especially the boxing legend & Haha reggae fam.",
            "author": null,
            "id": "gx24q01",
            "parent_id": "t1_gx06u3s",
            "score": 3,
            "created_utc": 1620240615.0,
            "replies": [
                {
                    "body": "Just because they've worked together in the past doesn't mean they're close enough to randomly call up and invite to their show. And you never know if they've discussed not wanting to be on the show, or if they have they're own schedule going on. There's alot of factors that they can't all show in 60-90 minute episodes.",
                    "author": "quietanonn",
                    "id": "gx31ign",
                    "parent_id": "t1_gx24q01",
                    "score": 8,
                    "created_utc": 1620254688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the part where the guests started coming into their own, and GOT7 were really impressive here, not being intimidated as idols.\n\nJackson volunteering to battle the comedian duo was hilarious too, and then joon park and the other bicycle guy who's name I cant remember.",
            "author": "Denethorsmukbang",
            "id": "gx2m2j5",
            "parent_id": "t1_gx04cbi",
            "score": 8,
            "created_utc": 1620247865.0,
            "replies": []
        },
        {
            "body": "It's one of my tops as well! The trot singer, the comedian sunbaenim, the senior boxer champions, Haha's reggae fam... they were all great. I really enjoy it when the guests are people close to them because the banter is easy going and usually more savage (ep 360-361 were also some good eps)",
            "author": "moretoachieve",
            "id": "gwzx2f5",
            "parent_id": "t1_gwzui6i",
            "score": 28,
            "created_utc": 1620195115.0,
            "replies": []
        },
        {
            "body": "I also come back to PJS eps particularly the Dream Cup/Football official games because they're so funny without even trying!\n\nAnd yes, Ma Asung was a great discover, where else would we see a muscular trot singer with such quick variety sense.\n\nBefore the battle, they skipped quite a lot of the guests (understandable bc of the time constraints) but I found it quite a waste lol but still a pretty solid episode so I still come back to it from time to time.",
            "author": "moretoachieve",
            "id": "gx3lwyp",
            "parent_id": "t1_gx2la1o",
            "score": 6,
            "created_utc": 1620264565.0,
            "replies": []
        },
        {
            "body": "I usually watch it on myrunningman(.)com as they have little to no ads",
            "author": "FriendlyKuri",
            "id": "gx1m1pp",
            "parent_id": "t1_gx1crvk",
            "score": 3,
            "created_utc": 1620232819.0,
            "replies": [
                {
                    "body": "Has anyone realised, or has it happened to anyone else, that myrunningman is rapidly losing all its old links?\n\nI used to watch everything on there happily, now most of the old eps, well up to the 200s , seem to be missing - just in the last couple months or so, a huge shame",
                    "author": "Denethorsmukbang",
                    "id": "gx2ma21",
                    "parent_id": "t1_gx1m1pp",
                    "score": 2,
                    "created_utc": 1620247953.0,
                    "replies": [
                        {
                            "body": "That didn't happen to me but I haven't use the site to watch old eps for a while.\n\nWhat I notice was that lately they are late with their uploads of the recent eps",
                            "author": "FriendlyKuri",
                            "id": "gx2ttnx",
                            "parent_id": "t1_gx2ma21",
                            "score": 2,
                            "created_utc": 1620251181.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ep 271-272, enjoy!",
            "author": "moretoachieve",
            "id": "gx3ljic",
            "parent_id": "t1_gx1thsl",
            "score": 3,
            "created_utc": 1620264379.0,
            "replies": [
                {
                    "body": "Just read this. Thank you so much!!!",
                    "author": "comeandfinishthis",
                    "id": "hcpejm1",
                    "parent_id": "t1_gx3ljic",
                    "score": 2,
                    "created_utc": 1631549284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love that he brought underground people, which goes to show he cares about his hoobaes",
            "author": "moretoachieve",
            "id": "gx3lm9u",
            "parent_id": "t1_gx3bun1",
            "score": 2,
            "created_utc": 1620264416.0,
            "replies": [
                {
                    "body": "100%",
                    "author": "zhc207",
                    "id": "gx3p504",
                    "parent_id": "t1_gx3lm9u",
                    "score": 2,
                    "created_utc": 1620266139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If my memory serves me right, she went there because she thought she will be a guest for an entire episode. She ended up leaving before the rest tho. Not entirely sure since my brain is rusty.",
            "author": "puzzle-head5",
            "id": "gx23egx",
            "parent_id": "t1_gx1z76i",
            "score": 7,
            "created_utc": 1620240058.0,
            "replies": [
                {
                    "body": "I think Kwangsoo called her to come with drinks & food,but i think she thought it was only her who will be the guest.\n\nI notices that some Korea celebs tend to act like this,but i can totally understand Nana reaction,since it will be akward with people whom you have never met,especially Haha 'underground friends' & the boxing legend.",
                    "author": null,
                    "id": "gx243t8",
                    "parent_id": "t1_gx23egx",
                    "score": 7,
                    "created_utc": 1620240355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She was kinda 4d but also kinda shocked because KS didn't explain the situation to her lmao I also like that she invited SVT at the end to help the RM cast meet the numbers",
            "author": "moretoachieve",
            "id": "gx3m1fg",
            "parent_id": "t1_gx2lt6x",
            "score": 3,
            "created_utc": 1620264626.0,
            "replies": []
        },
        {
            "body": "Just because they've worked together in the past doesn't mean they're close enough to randomly call up and invite to their show. And you never know if they've discussed not wanting to be on the show, or if they have they're own schedule going on. There's alot of factors that they can't all show in 60-90 minute episodes.",
            "author": "quietanonn",
            "id": "gx31ign",
            "parent_id": "t1_gx24q01",
            "score": 8,
            "created_utc": 1620254688.0,
            "replies": []
        },
        {
            "body": "Has anyone realised, or has it happened to anyone else, that myrunningman is rapidly losing all its old links?\n\nI used to watch everything on there happily, now most of the old eps, well up to the 200s , seem to be missing - just in the last couple months or so, a huge shame",
            "author": "Denethorsmukbang",
            "id": "gx2ma21",
            "parent_id": "t1_gx1m1pp",
            "score": 2,
            "created_utc": 1620247953.0,
            "replies": [
                {
                    "body": "That didn't happen to me but I haven't use the site to watch old eps for a while.\n\nWhat I notice was that lately they are late with their uploads of the recent eps",
                    "author": "FriendlyKuri",
                    "id": "gx2ttnx",
                    "parent_id": "t1_gx2ma21",
                    "score": 2,
                    "created_utc": 1620251181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just read this. Thank you so much!!!",
            "author": "comeandfinishthis",
            "id": "hcpejm1",
            "parent_id": "t1_gx3ljic",
            "score": 2,
            "created_utc": 1631549284.0,
            "replies": []
        },
        {
            "body": "100%",
            "author": "zhc207",
            "id": "gx3p504",
            "parent_id": "t1_gx3lm9u",
            "score": 2,
            "created_utc": 1620266139.0,
            "replies": []
        },
        {
            "body": "I think Kwangsoo called her to come with drinks & food,but i think she thought it was only her who will be the guest.\n\nI notices that some Korea celebs tend to act like this,but i can totally understand Nana reaction,since it will be akward with people whom you have never met,especially Haha 'underground friends' & the boxing legend.",
            "author": null,
            "id": "gx243t8",
            "parent_id": "t1_gx23egx",
            "score": 7,
            "created_utc": 1620240355.0,
            "replies": []
        },
        {
            "body": "That didn't happen to me but I haven't use the site to watch old eps for a while.\n\nWhat I notice was that lately they are late with their uploads of the recent eps",
            "author": "FriendlyKuri",
            "id": "gx2ttnx",
            "parent_id": "t1_gx2ma21",
            "score": 2,
            "created_utc": 1620251181.0,
            "replies": []
        }
    ]
}