{
    "title": "I’ve just had the most humiliating experience with a POT at a M&G and I’m so disillusioned now.",
    "post_id": "ijkxzy",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ijkxzy/ive_just_had_the_most_humiliating_experience_with/",
    "author": "WarriorQueenCeline",
    "body": "I had been communicating with a POT for a while and everything seemed fine with him. He was the first person that I seemed to connect to and I was really excited. So we agreed to do a M&G at an outdoor coffee shop. When we got there after our introductions he then loudly told me,  “Get the F*ck away from me you gold digging sl*t.” There was people around me that turned to stare and I couldn’t get out of there fast enough. I was so embarrassed. \n\nI think I’m going to remove myself from the pool for a while. . . I seem to not have any luck. \n\nIf you made it this far, good luck to you in your search.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ijkxzy/ive_just_had_the_most_humiliating_experience_with/",
    "score": 168,
    "upvote_ratio": 0.98,
    "created_utc": 1598822822.0,
    "num_comments": 78,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "g3eojsg",
            "parent_id": "t3_ijkxzy",
            "score": 140,
            "created_utc": 1598826801.0,
            "replies": [
                {
                    "body": "You’re so right. Especially agree with how it seems that psychopaths (or sociopaths etc) almost always make it a point to move to the front of the line!",
                    "author": "moonjuicediet",
                    "id": "g3f6ucz",
                    "parent_id": "t1_g3eojsg",
                    "score": 14,
                    "created_utc": 1598837182.0,
                    "replies": []
                },
                {
                    "body": "They’re picked first on most occasion solely because of their manipulation which also jus so happens to be a reason to stay away lmao",
                    "author": "ybs_sickboii",
                    "id": "g3fskpx",
                    "parent_id": "t1_g3eojsg",
                    "score": 6,
                    "created_utc": 1598851488.0,
                    "replies": []
                },
                {
                    "body": "A divorce lawyer once told me that there can 200 normal women in a bar yet men will climb over each other to get to the 1 psychopath in the corner. He says he has no explanation for it but he’s seen it time and again. Maybe it’s his profession.",
                    "author": "LaGriffeDuLion",
                    "id": "g3g3klo",
                    "parent_id": "t1_g3eojsg",
                    "score": 8,
                    "created_utc": 1598862047.0,
                    "replies": [
                        {
                            "body": "Probably that it also helps to make him feel better about his career choice if he can vilify his opposition.",
                            "author": "willfromvb",
                            "id": "g3giup7",
                            "parent_id": "t1_g3g3klo",
                            "score": 7,
                            "created_utc": 1598877005.0,
                            "replies": [
                                {
                                    "body": "Exactly",
                                    "author": null,
                                    "id": "g3j58f2",
                                    "parent_id": "t1_g3giup7",
                                    "score": 1,
                                    "created_utc": 1598917775.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Probably because she was more attractive and a freak in the sheets",
                            "author": null,
                            "id": "g3rgmj3",
                            "parent_id": "t1_g3g3klo",
                            "score": 1,
                            "created_utc": 1599077176.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "While I do appreciate the thoughtful nature of this comment...\n\nI got stuck on: “your spider sense will get better” and the ending of “Hang in there”\n\n🤓",
                    "author": "writingsubthings",
                    "id": "g3gpjdp",
                    "parent_id": "t1_g3eojsg",
                    "score": 2,
                    "created_utc": 1598880762.0,
                    "replies": []
                },
                {
                    "body": "If the story she writes is 100% true then she dodged a bullet by finding his ways on an M&G. But it’s not clear what triggered the craziness? Was it a mental illness or something else. What was said and what was heard. Was there no confrontation at all and just a one way barrage of insults from a guy to a gal. We will never know.",
                    "author": null,
                    "id": "g3grjoe",
                    "parent_id": "t1_g3eojsg",
                    "score": 2,
                    "created_utc": 1598881669.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like an asshole who trolls people on SA. But jesus, why pay $90 and bother chatting and arranging m&g's just to do that?\nHe is not playing with a full deck. Other than wasted time, you lost nothing and gained info.",
            "author": "RetdSgrDaddy",
            "id": "g3ey95c",
            "parent_id": "t3_ijkxzy",
            "score": 84,
            "created_utc": 1598832252.0,
            "replies": [
                {
                    "body": "Mgtow tired of pretty woman rejecting him",
                    "author": "Lilipuss25",
                    "id": "g3gv9av",
                    "parent_id": "t1_g3ey95c",
                    "score": 11,
                    "created_utc": 1598883114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. I mean, what a fucktard. \n\nWho the fuck does that sort of shit? You should not have been embarrassed gorgeous girl, he should have been.\n\nI bet he went home to his parents basement and jerked off while telling his red pill and incel mates all about what a big man he is.",
            "author": null,
            "id": "g3ev6cg",
            "parent_id": "t3_ijkxzy",
            "score": 70,
            "created_utc": 1598830510.0,
            "replies": []
        },
        {
            "body": "Take some solace in the fact that no one has ever heard of this happening before.  \n\nAnd, PLEASE report him to Seeking.",
            "author": "ORD-inary",
            "id": "g3fbdls",
            "parent_id": "t3_ijkxzy",
            "score": 26,
            "created_utc": 1598839828.0,
            "replies": [
                {
                    "body": "Already done and will do. I know that he doesn’t represent all of the Men on Seeking so I have a lot of faith that I will find someone.",
                    "author": "WarriorQueenCeline",
                    "id": "g3fc2c8",
                    "parent_id": "t1_g3fbdls",
                    "score": 18,
                    "created_utc": 1598840245.0,
                    "replies": [
                        {
                            "body": "SA is a bit of a cesspool, so better to approach with an abundance of caution if you are the type who is very sensitive. While men are unlikely to go this far out of their way to insult and degrade you, they're definitely willing to do so via message. Eventually you become inured to it. I used to respond with \"I'm sorry you feel that way.\" Now I'm more likely to simply block.\n\nRemember that you are in a position of superiority in every last exchange. Don't let behavior like this get to you; the men who would resort to it are always hard up, the type to hate-masturbate to you. They WISH they could have you. They're sad, pathetic. \n\nKeep your chin up, beautiful.",
                            "author": "lara-xo",
                            "id": "g3fyonn",
                            "parent_id": "t1_g3fc2c8",
                            "score": 8,
                            "created_utc": 1598857006.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some men will never be a good man. The world will be a better place without them.\n\nI feel very sorry for your experience. Take a break and let it go.",
            "author": "littledannyx",
            "id": "g3ezbpg",
            "parent_id": "t3_ijkxzy",
            "score": 24,
            "created_utc": 1598832867.0,
            "replies": []
        },
        {
            "body": "The only thing I can say is he is not the norm. Please give us another chance. My gender is full of shits and I apologize for the assholes among us.",
            "author": "AFSMSgt",
            "id": "g3epu60",
            "parent_id": "t3_ijkxzy",
            "score": 40,
            "created_utc": 1598827471.0,
            "replies": [
                {
                    "body": "He is not only not the norm but he sounds like someone from another planet. It’s so surreal. No one should go through what the OP went through. How can a guy sound so nice on text and blow up within minutes once you meet him in person!!",
                    "author": null,
                    "id": "g3gs9ep",
                    "parent_id": "t1_g3epu60",
                    "score": 2,
                    "created_utc": 1598881904.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to hear you experienced that. It will be on your mind for a while no doubt.\n\nHe set you up. He had a bone to pick, wanted to waste someone's time and humiliate them (probably gets off on it??) And it just happened to be you.\n\nBest way to get past it, is to go on a proper M&G, this incident will linger less once you've had a \"normal\" experience.",
            "author": "Wildebot34",
            "id": "g3esre4",
            "parent_id": "t3_ijkxzy",
            "score": 17,
            "created_utc": 1598829110.0,
            "replies": []
        },
        {
            "body": "I think you just had an encounter with what is known on the web as a “crazy person.” Laugh it off. Carry on.",
            "author": "creepyoldguy99",
            "id": "g3epx6u",
            "parent_id": "t3_ijkxzy",
            "score": 17,
            "created_utc": 1598827516.0,
            "replies": []
        },
        {
            "body": "Wow.... I am SO sorry you experienced such craziness.. Maybe his wife's sister walked into the coffee shop.. That's insane.. \n\nSending positive vibes.. Sounds like one to dodge for real..",
            "author": "NattyLiteSaber",
            "id": "g3fa9ok",
            "parent_id": "t3_ijkxzy",
            "score": 6,
            "created_utc": 1598839157.0,
            "replies": []
        },
        {
            "body": "Honestly, he definitely looked more crazy than you would've. From an outsider's view, it would've looked like everything was polite and cordial until this dude just started yelling. You probably looked taken aback at this older guy yelling at you. Both in actuality and in appearance, he is in the wrong.",
            "author": "LordOkagi",
            "id": "g3flgd4",
            "parent_id": "t3_ijkxzy",
            "score": 8,
            "created_utc": 1598846146.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g3ep5sk",
            "parent_id": "t3_ijkxzy",
            "score": 24,
            "created_utc": 1598827104.0,
            "replies": [
                {
                    "body": "Honestly, I’m new to the bowl, if things had worked out he would have been my first SD. I froze because it was NOT what I was expecting at all.",
                    "author": "WarriorQueenCeline",
                    "id": "g3eztnf",
                    "parent_id": "t1_g3ep5sk",
                    "score": 19,
                    "created_utc": 1598833152.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g3fl7zc",
                            "parent_id": "t1_g3eztnf",
                            "score": 13,
                            "created_utc": 1598845985.0,
                            "replies": [
                                {
                                    "body": "Yes! I tend to be VERY curt until we meet. Polite, but extremely guarded.",
                                    "author": "lara-xo",
                                    "id": "g3fyqo6",
                                    "parent_id": "t1_g3fl7zc",
                                    "score": 4,
                                    "created_utc": 1598857060.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think it’s understandable that you froze up and then got out of there. That was shocking behaviour. Having someone purposefully invite you out to humiliate you is insidious. I disagree that you should have confronted him. Your instincts are valuable, and they told you to get the hell out of there. You may be rightfully upset, but you were not physically harmed. There are seasoned predators on SA who understand how to act and what to say in order to exploit you, and get you where they want you. You learned this lesson early on which bodes well for your future should you decided to return to SA. Sorry this happened to you.",
                            "author": "InnerRadio7",
                            "id": "g3go8gt",
                            "parent_id": "t1_g3eztnf",
                            "score": 6,
                            "created_utc": 1598880266.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She did not allow herself to be treated any way. His behavior was shocking, abusive and abhorrent and no sane person would have been prepared for him to cause such a public scene.",
                    "author": "poofymon",
                    "id": "g3grnyl",
                    "parent_id": "t1_g3ep5sk",
                    "score": 6,
                    "created_utc": 1598881726.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g3gtab9",
                            "parent_id": "t1_g3grnyl",
                            "score": 4,
                            "created_utc": 1598882387.0,
                            "replies": [
                                {
                                    "body": "I understand where you're coming from now, thank you for explaining it to me. I avoid using terms like \"should have\" and \"allow\" because she is a victim and we don't want her to feel responsible for the encounter. Victim blaming can happen even if we don't intend it if we aren't careful with our words. I hope OP takes some time to heal. Something like that would really shake me up if I was in her shoes. It is easy to dwell on such an event and regret not reacting differently, and I do not want to facilitate that type of negative feeling for her because she is probably feeling low from what happened already.",
                                    "author": "poofymon",
                                    "id": "g3gws9j",
                                    "parent_id": "t1_g3gtab9",
                                    "score": 4,
                                    "created_utc": 1598883804.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "By chance did you have a fork to stick through his hand?  And say, \"fork off\"?",
            "author": "TY2022",
            "id": "g3epcxe",
            "parent_id": "t3_ijkxzy",
            "score": 15,
            "created_utc": 1598827211.0,
            "replies": [
                {
                    "body": "That's genius!",
                    "author": "weoweoo",
                    "id": "g3es525",
                    "parent_id": "t1_g3epcxe",
                    "score": 2,
                    "created_utc": 1598828746.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry this happened to you, always carry some kind of protection.",
            "author": "Cwarren1010",
            "id": "g3f23fp",
            "parent_id": "t3_ijkxzy",
            "score": 6,
            "created_utc": 1598834448.0,
            "replies": []
        },
        {
            "body": "Wow thats fucked up :( Im so sorry that happened to you darling.... honestly from the bottom of my heart I just want you to know and anyone else who has been in your shoes that YOU didn't do anything wrong, YOU are not a \"gold digging piece of shit\" you are a honorable lady who knows what she wants or at least is open to exploring new options and sometimes that makes people uncomfortable...\n\nAgain I am so sorry this happened to you, this post really breaks my heart..**sending hugs**",
            "author": "banananinja786",
            "id": "g3fafld",
            "parent_id": "t3_ijkxzy",
            "score": 5,
            "created_utc": 1598839255.0,
            "replies": []
        },
        {
            "body": "I'm so sorry that happened to you. People are awful sometimes. It probably doesn't help to know that their are psycho customers in every profession, though it's particularly painful when you're in an emotionally vulnerable situation like a M&G. \n\nIt's such a terrible thing to happen. It's not a reflection though on you. You didn't do anything wrong. I hope you feel better after taking whatever time you need.",
            "author": "chaz-dd",
            "id": "g3fh838",
            "parent_id": "t3_ijkxzy",
            "score": 4,
            "created_utc": 1598843404.0,
            "replies": []
        },
        {
            "body": "That is so abusive. Oh my god.",
            "author": "blueduck762",
            "id": "g3g1cwj",
            "parent_id": "t3_ijkxzy",
            "score": 3,
            "created_utc": 1598859714.0,
            "replies": []
        },
        {
            "body": "Wtf! I am so sorry for you! If I would guess without any info it would be a pick up asshole that did not manage to get in your pants and got frustrated. First time I'm hearing that one though. Did you already mention allowance or money in chat before meeting?",
            "author": "NewbieDaddy",
            "id": "g3eoi7k",
            "parent_id": "t3_ijkxzy",
            "score": 11,
            "created_utc": 1598826782.0,
            "replies": [
                {
                    "body": "We were supposed to discuss it at the M&G if things had gone well.",
                    "author": "WarriorQueenCeline",
                    "id": "g3ezo3n",
                    "parent_id": "t1_g3eoi7k",
                    "score": 5,
                    "created_utc": 1598833061.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What were your conversations like? I feel like there may have been red flags. \n\nleave the bowl if you want, but never allow another person to remove you from something you decided you wanted for yourself. He’s one asshole. But the right SD could change your life.",
            "author": "sienfiekdsa",
            "id": "g3etm28",
            "parent_id": "t3_ijkxzy",
            "score": 10,
            "created_utc": 1598829601.0,
            "replies": [
                {
                    "body": "Reading back through the texts, there was no red flags. But I guess this is something I just have to get over, it just really shocked me because I did not see it coming one bit.",
                    "author": "WarriorQueenCeline",
                    "id": "g3f04p7",
                    "parent_id": "t1_g3etm28",
                    "score": 15,
                    "created_utc": 1598833323.0,
                    "replies": [
                        {
                            "body": "So everything he said was 100% normal and on par with quality SDs or relationships you’ve had in the past?",
                            "author": "sienfiekdsa",
                            "id": "g3f2mz9",
                            "parent_id": "t1_g3f04p7",
                            "score": 3,
                            "created_utc": 1598834757.0,
                            "replies": [
                                {
                                    "body": "It guess it felt “normal” but yet again I am new to the Sugar Lifestyle. He did sweet talk throughout the texting, which I thought was sweet at the time. But maybe he was playing it up.",
                                    "author": "WarriorQueenCeline",
                                    "id": "g3f3dly",
                                    "parent_id": "t1_g3f2mz9",
                                    "score": 7,
                                    "created_utc": 1598835181.0,
                                    "replies": [
                                        {
                                            "body": "Be extremely weary of the men who do this, please! It's not normal to be saccharine with someone you've never even met, especially for men.",
                                            "author": "lara-xo",
                                            "id": "g3fytkx",
                                            "parent_id": "t1_g3f3dly",
                                            "score": 3,
                                            "created_utc": 1598857143.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Although this is possible, it’s seems so unlikely.",
                            "author": "garret6758",
                            "id": "g3f2vdr",
                            "parent_id": "t1_g3f04p7",
                            "score": 4,
                            "created_utc": 1598834890.0,
                            "replies": [
                                {
                                    "body": "I agree. This is one of those where it would be amazing to hear both sides of the story.",
                                    "author": null,
                                    "id": "g3i6urb",
                                    "parent_id": "t1_g3f2vdr",
                                    "score": 1,
                                    "created_utc": 1598901679.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g3fd1ia",
            "parent_id": "t3_ijkxzy",
            "score": 3,
            "created_utc": 1598840841.0,
            "replies": [
                {
                    "body": "56 according to his texts.",
                    "author": "WarriorQueenCeline",
                    "id": "g3fi71d",
                    "parent_id": "t1_g3fd1ia",
                    "score": 5,
                    "created_utc": 1598843994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like he gets off on humiliating women. Me personally I would have let him have it right back in front of all those people. I've seen videos on YouTube where these fuck boys are literally out on the streets exposing sex workers on video. It's okay to put them in their place girls.",
            "author": "ohitsmarissa2010",
            "id": "g3fm0jb",
            "parent_id": "t3_ijkxzy",
            "score": 3,
            "created_utc": 1598846525.0,
            "replies": []
        },
        {
            "body": "I wish there was a site where we can review SDs hahaha",
            "author": "makafakafo",
            "id": "g3h5hxb",
            "parent_id": "t3_ijkxzy",
            "score": 3,
            "created_utc": 1598887243.0,
            "replies": []
        },
        {
            "body": "What the hell. Did you say something offensive by any chance? Even if someone did, I would never cause a scene like that unless I'm in danger. My bet is that he was never a real SD.",
            "author": "macaroonqueen",
            "id": "g3en1r6",
            "parent_id": "t3_ijkxzy",
            "score": 7,
            "created_utc": 1598826141.0,
            "replies": []
        },
        {
            "body": "sorry you had this experience. I'm sure it is just the jerk you run into. nothing wrong with you",
            "author": "dashu945",
            "id": "g3f5xxo",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598836670.0,
            "replies": []
        },
        {
            "body": "This is horrifying. I am so so sorry.",
            "author": "cherrysplits",
            "id": "g3f9n29",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598838782.0,
            "replies": []
        },
        {
            "body": "I'm sorry this happened to you. You reacted the best way you could and I believe there were no red flags. It's like getting ghosted in vanilla dating. These men are not okay",
            "author": "BisforBands",
            "id": "g3fd4d2",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598840890.0,
            "replies": []
        },
        {
            "body": "I'm sorry this happened to you, but don't give a damn what others think! Keep your chin up. (:",
            "author": null,
            "id": "g3fpama",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598848918.0,
            "replies": []
        },
        {
            "body": "Ugh .. I am so sorry this happened to you.  \n\nImagine how shitty of a life that person must have that they go onto SA or another site, sign up have conversations only to meet people to try to embarrass them, its pretty sad actually.   \n\nYou have nothing to be ashamed of, honestly.  Take your time and when you are ready get back in the bowl.",
            "author": "craa141",
            "id": "g3ft9rn",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598852071.0,
            "replies": []
        },
        {
            "body": "That’s awful. I m sorry it happened to you. Good that you reported him on SA.",
            "author": null,
            "id": "g3fzadg",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598857614.0,
            "replies": []
        },
        {
            "body": "I am so so sorry you had to deal with this scumbag. I’m playing this out in my head and I cannot imagine how humiliating it must have been. I hope this doesn’t ruin the entire lifestyle for you, because the majority of the men I’ve met have been beyond great, but I understand how easy it is for assholes to ruin it for everyone. Just take care of yourself for now and please don’t hesitate to reach out to any of us girls for advice if you need it, no matter how trivial it may seem <3",
            "author": "miuxiu",
            "id": "g3fzk1b",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598857887.0,
            "replies": []
        },
        {
            "body": "He wanted to humiliate you but really this is embarrassing for him. Other than the fact that he spent time and money just to insult a stranger, he must have looked like such a jerk to everyone who witnessed the interaction. Pathetic man.",
            "author": null,
            "id": "g3gjpxu",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598877632.0,
            "replies": []
        },
        {
            "body": "[the Gift of Fear](https://www.reddit.com/r/sugarlifestyleforum/comments/ijp5fm/extraordinary_lecture_on_recognizing_danger/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)This is a link you a post from today on this forum about a lecture from the author of The Gift of Fear, the book is a must read for all SBs it’s about how to recognize your instincts and follow them. This book changed my life. Actually.",
            "author": "InnerRadio7",
            "id": "g3gsjpq",
            "parent_id": "t3_ijkxzy",
            "score": 2,
            "created_utc": 1598882043.0,
            "replies": []
        },
        {
            "body": "That just seems like a RARE thing to have happen. That does not seem like the norm.",
            "author": "ThomasJankins",
            "id": "g3fbhr2",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598839895.0,
            "replies": []
        },
        {
            "body": "How old was this guy? Is his age closer to yours? Sounds like he had a bet/prank to fulfill.",
            "author": "BeautyGr8ce",
            "id": "g3fhlxx",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598843635.0,
            "replies": [
                {
                    "body": "According to his texts he was 56, I’m 27.",
                    "author": "WarriorQueenCeline",
                    "id": "g3fihqz",
                    "parent_id": "t1_g3fhlxx",
                    "score": 3,
                    "created_utc": 1598844181.0,
                    "replies": [
                        {
                            "body": "Oh my! He was off his rockers!",
                            "author": "BeautyGr8ce",
                            "id": "g3grnt7",
                            "parent_id": "t1_g3fihqz",
                            "score": 1,
                            "created_utc": 1598881724.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. I am so, so sorry that happened to you. I hope you'll flag him on whatever website you used to find him, and especially add him to the blacklists.\n\nI hope you feel better after reading a few of these comments, because what happened is in no way a reflection on you. Whomever that man is, he has serious issues and needs psychological help.",
            "author": "lara-xo",
            "id": "g3fye3t",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598856722.0,
            "replies": []
        },
        {
            "body": "At least he made it easy to identify he is a dick.",
            "author": "bradpitt3",
            "id": "g3g6xxv",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598865786.0,
            "replies": []
        },
        {
            "body": "If you already had a cuppa you could have \"tripped\". Nothing like a hot cuppa of joe in the face of a douchebag.",
            "author": "GSSD",
            "id": "g3gl6oh",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598878568.0,
            "replies": []
        },
        {
            "body": "That's terrible. I am so sorry you had to go through this..\nI can't understand why the hell some people are like that",
            "author": "hitonce_1919",
            "id": "g3gpvg8",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598880934.0,
            "replies": []
        },
        {
            "body": "I'm so sorry you experienced this. Some guys are truly just demons roaming the earth. Please don't blame yourself or think for a second that you could have seen this coming, psychopaths are good at what they do. If they weren't, they wouldn't be psychopaths. It's a them problem, not you\n\nIf you want to talk, my DMs are open. Sending you hugs and love.",
            "author": "wild_sensasian",
            "id": "g3gq915",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598881122.0,
            "replies": []
        },
        {
            "body": "Don’t get embarrassed when a man call you a gold digger! Online, face to face or even in your dream. \nAny man who try to shame me calling me a gold digger, I flip to script on him. \n\nI will urge you to actually not removing yourself from seeking! That’s exactly what he want you to do, don’t let him win! 💪🏿",
            "author": "Lilipuss25",
            "id": "g3gvopd",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598883320.0,
            "replies": []
        },
        {
            "body": "This makes me want to throw up--what a completely hurtful thing to do.\n\nI know you were humiliated and wanted to get away but you should have slapped him very hard before walking away.  Even better if you'd said \"it is your baby\" in a loud voice.",
            "author": "daddyxfun",
            "id": "g3he6qv",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598890666.0,
            "replies": []
        },
        {
            "body": "He is a lame.",
            "author": "AsheGuade",
            "id": "g3im6jj",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598908340.0,
            "replies": []
        },
        {
            "body": "Mentally unstable.. . Has nothing to do you unless your allowance request was outragely high.\n\nNormal men do NOT behave like this in public even if they are thinking it.  This dude has mental issues that are not an SB s problem to fix.\n\nLook at it as a success as that was all you invested to learn that there are small penis' out there that need to fluff themselves to got off.\n\nDo not make his problem yours by leaving .....success is its own revenge so go for that",
            "author": "Momopllc",
            "id": "g3it25s",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598911569.0,
            "replies": []
        },
        {
            "body": "I would totally report him on SA",
            "author": null,
            "id": "g3jjz9m",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598925463.0,
            "replies": []
        },
        {
            "body": "What a f---ing a--hole that guy is.\n\nI hope he walks through a puddle of tar and gets stuck on a street somewhere, begging for help and getting none.",
            "author": "marker3000",
            "id": "g3fap2r",
            "parent_id": "t3_ijkxzy",
            "score": 1,
            "created_utc": 1598839414.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you!  \n\nNot going to lie, im laughing, but it's so horrible.",
            "author": null,
            "id": "g3f8l2k",
            "parent_id": "t3_ijkxzy",
            "score": 0,
            "created_utc": 1598838167.0,
            "replies": []
        },
        {
            "body": "There’s gotta be more to this story",
            "author": "SebastianArnault",
            "id": "g3f8r62",
            "parent_id": "t3_ijkxzy",
            "score": -2,
            "created_utc": 1598838266.0,
            "replies": [
                {
                    "body": "Like others before me, I’m so sorry you went through this.  There are many very real gentlemen SD’s among us who would treat you as a lady no matter the circumstances.  Your Pot is definitely a shit / loose cannon for doing this to you \n\nI can think of no reason to do this other than he has a few loose screws.  The only possibly thing I can think of is he possibly Recognized somebody at the m&g and was trying to show off or protect himself in some way. \n\nIn either case - still a dick move.  Hope his little dick falls off.",
                    "author": "jloaz",
                    "id": "g3fkcz3",
                    "parent_id": "t1_g3f8r62",
                    "score": 7,
                    "created_utc": 1598845405.0,
                    "replies": []
                },
                {
                    "body": "Not really, it sounds believable to me. I mean the guy is an odd duck and there’s probably not many of them around, but I can see it happening.\n\nW.Queen, I’m sorry this happened to you. I perfectly understand freezing and not having a come back for anything so rude and shocking. That’s actually what nice people do, we are not always at the ready with a smart ass response to surprise rudeness.",
                    "author": "FauxpasIrisLily",
                    "id": "g3feuux",
                    "parent_id": "t1_g3f8r62",
                    "score": 6,
                    "created_utc": 1598841956.0,
                    "replies": [
                        {
                            "body": "I don’t question the authenticity of the story but I just want to have the blanks filled in.",
                            "author": "SebastianArnault",
                            "id": "g3fhjc2",
                            "parent_id": "t1_g3feuux",
                            "score": 2,
                            "created_utc": 1598843592.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree. As I read the pile on of sympathy on the OP, I simply scrolled down on the thread to see posts that are more balanced. The lady claims she was talking to the POT for a while and had a good connection. I wonder then what triggered the guy to say what he said. Was he just a neurotic mentally diseased man? If so I get it. He went off without provocation. But if he was not, what triggered the confrontation. It is quite rare for guys to go off like this on women unless they are mentally ill.",
                    "author": null,
                    "id": "g3gr3xn",
                    "parent_id": "t1_g3f8r62",
                    "score": -1,
                    "created_utc": 1598881450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What did u say",
            "author": "UnearthlyDinosaur",
            "id": "g3epflj",
            "parent_id": "t3_ijkxzy",
            "score": -2,
            "created_utc": 1598827251.0,
            "replies": [
                {
                    "body": "I froze and couldn’t say anything, when we were chatting through text he was so nice so when he did it I was so caught off guard. I guess I just have to be better prepared next time.",
                    "author": "WarriorQueenCeline",
                    "id": "g3ezz5v",
                    "parent_id": "t1_g3epflj",
                    "score": 5,
                    "created_utc": 1598833239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Life is not easy. I am a successful day trader and even then, I watch my back with the pettiness I encounter. It happens everywhere in life. You elected to date transactionally. There is nothing wrong with that. It is a fair exchange and dont let petty people deter you.",
            "author": null,
            "id": "g3f9f4b",
            "parent_id": "t3_ijkxzy",
            "score": -1,
            "created_utc": 1598838652.0,
            "replies": []
        },
        {
            "body": "You’re so right. Especially agree with how it seems that psychopaths (or sociopaths etc) almost always make it a point to move to the front of the line!",
            "author": "moonjuicediet",
            "id": "g3f6ucz",
            "parent_id": "t1_g3eojsg",
            "score": 14,
            "created_utc": 1598837182.0,
            "replies": []
        },
        {
            "body": "They’re picked first on most occasion solely because of their manipulation which also jus so happens to be a reason to stay away lmao",
            "author": "ybs_sickboii",
            "id": "g3fskpx",
            "parent_id": "t1_g3eojsg",
            "score": 6,
            "created_utc": 1598851488.0,
            "replies": []
        },
        {
            "body": "A divorce lawyer once told me that there can 200 normal women in a bar yet men will climb over each other to get to the 1 psychopath in the corner. He says he has no explanation for it but he’s seen it time and again. Maybe it’s his profession.",
            "author": "LaGriffeDuLion",
            "id": "g3g3klo",
            "parent_id": "t1_g3eojsg",
            "score": 8,
            "created_utc": 1598862047.0,
            "replies": [
                {
                    "body": "Probably that it also helps to make him feel better about his career choice if he can vilify his opposition.",
                    "author": "willfromvb",
                    "id": "g3giup7",
                    "parent_id": "t1_g3g3klo",
                    "score": 7,
                    "created_utc": 1598877005.0,
                    "replies": [
                        {
                            "body": "Exactly",
                            "author": null,
                            "id": "g3j58f2",
                            "parent_id": "t1_g3giup7",
                            "score": 1,
                            "created_utc": 1598917775.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Probably because she was more attractive and a freak in the sheets",
                    "author": null,
                    "id": "g3rgmj3",
                    "parent_id": "t1_g3g3klo",
                    "score": 1,
                    "created_utc": 1599077176.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While I do appreciate the thoughtful nature of this comment...\n\nI got stuck on: “your spider sense will get better” and the ending of “Hang in there”\n\n🤓",
            "author": "writingsubthings",
            "id": "g3gpjdp",
            "parent_id": "t1_g3eojsg",
            "score": 2,
            "created_utc": 1598880762.0,
            "replies": []
        },
        {
            "body": "If the story she writes is 100% true then she dodged a bullet by finding his ways on an M&G. But it’s not clear what triggered the craziness? Was it a mental illness or something else. What was said and what was heard. Was there no confrontation at all and just a one way barrage of insults from a guy to a gal. We will never know.",
            "author": null,
            "id": "g3grjoe",
            "parent_id": "t1_g3eojsg",
            "score": 2,
            "created_utc": 1598881669.0,
            "replies": []
        },
        {
            "body": "Mgtow tired of pretty woman rejecting him",
            "author": "Lilipuss25",
            "id": "g3gv9av",
            "parent_id": "t1_g3ey95c",
            "score": 11,
            "created_utc": 1598883114.0,
            "replies": []
        },
        {
            "body": "Already done and will do. I know that he doesn’t represent all of the Men on Seeking so I have a lot of faith that I will find someone.",
            "author": "WarriorQueenCeline",
            "id": "g3fc2c8",
            "parent_id": "t1_g3fbdls",
            "score": 18,
            "created_utc": 1598840245.0,
            "replies": [
                {
                    "body": "SA is a bit of a cesspool, so better to approach with an abundance of caution if you are the type who is very sensitive. While men are unlikely to go this far out of their way to insult and degrade you, they're definitely willing to do so via message. Eventually you become inured to it. I used to respond with \"I'm sorry you feel that way.\" Now I'm more likely to simply block.\n\nRemember that you are in a position of superiority in every last exchange. Don't let behavior like this get to you; the men who would resort to it are always hard up, the type to hate-masturbate to you. They WISH they could have you. They're sad, pathetic. \n\nKeep your chin up, beautiful.",
                    "author": "lara-xo",
                    "id": "g3fyonn",
                    "parent_id": "t1_g3fc2c8",
                    "score": 8,
                    "created_utc": 1598857006.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He is not only not the norm but he sounds like someone from another planet. It’s so surreal. No one should go through what the OP went through. How can a guy sound so nice on text and blow up within minutes once you meet him in person!!",
            "author": null,
            "id": "g3gs9ep",
            "parent_id": "t1_g3epu60",
            "score": 2,
            "created_utc": 1598881904.0,
            "replies": []
        },
        {
            "body": "Honestly, I’m new to the bowl, if things had worked out he would have been my first SD. I froze because it was NOT what I was expecting at all.",
            "author": "WarriorQueenCeline",
            "id": "g3eztnf",
            "parent_id": "t1_g3ep5sk",
            "score": 19,
            "created_utc": 1598833152.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g3fl7zc",
                    "parent_id": "t1_g3eztnf",
                    "score": 13,
                    "created_utc": 1598845985.0,
                    "replies": [
                        {
                            "body": "Yes! I tend to be VERY curt until we meet. Polite, but extremely guarded.",
                            "author": "lara-xo",
                            "id": "g3fyqo6",
                            "parent_id": "t1_g3fl7zc",
                            "score": 4,
                            "created_utc": 1598857060.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think it’s understandable that you froze up and then got out of there. That was shocking behaviour. Having someone purposefully invite you out to humiliate you is insidious. I disagree that you should have confronted him. Your instincts are valuable, and they told you to get the hell out of there. You may be rightfully upset, but you were not physically harmed. There are seasoned predators on SA who understand how to act and what to say in order to exploit you, and get you where they want you. You learned this lesson early on which bodes well for your future should you decided to return to SA. Sorry this happened to you.",
                    "author": "InnerRadio7",
                    "id": "g3go8gt",
                    "parent_id": "t1_g3eztnf",
                    "score": 6,
                    "created_utc": 1598880266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She did not allow herself to be treated any way. His behavior was shocking, abusive and abhorrent and no sane person would have been prepared for him to cause such a public scene.",
            "author": "poofymon",
            "id": "g3grnyl",
            "parent_id": "t1_g3ep5sk",
            "score": 6,
            "created_utc": 1598881726.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g3gtab9",
                    "parent_id": "t1_g3grnyl",
                    "score": 4,
                    "created_utc": 1598882387.0,
                    "replies": [
                        {
                            "body": "I understand where you're coming from now, thank you for explaining it to me. I avoid using terms like \"should have\" and \"allow\" because she is a victim and we don't want her to feel responsible for the encounter. Victim blaming can happen even if we don't intend it if we aren't careful with our words. I hope OP takes some time to heal. Something like that would really shake me up if I was in her shoes. It is easy to dwell on such an event and regret not reacting differently, and I do not want to facilitate that type of negative feeling for her because she is probably feeling low from what happened already.",
                            "author": "poofymon",
                            "id": "g3gws9j",
                            "parent_id": "t1_g3gtab9",
                            "score": 4,
                            "created_utc": 1598883804.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's genius!",
            "author": "weoweoo",
            "id": "g3es525",
            "parent_id": "t1_g3epcxe",
            "score": 2,
            "created_utc": 1598828746.0,
            "replies": []
        },
        {
            "body": "We were supposed to discuss it at the M&G if things had gone well.",
            "author": "WarriorQueenCeline",
            "id": "g3ezo3n",
            "parent_id": "t1_g3eoi7k",
            "score": 5,
            "created_utc": 1598833061.0,
            "replies": []
        },
        {
            "body": "Reading back through the texts, there was no red flags. But I guess this is something I just have to get over, it just really shocked me because I did not see it coming one bit.",
            "author": "WarriorQueenCeline",
            "id": "g3f04p7",
            "parent_id": "t1_g3etm28",
            "score": 15,
            "created_utc": 1598833323.0,
            "replies": [
                {
                    "body": "So everything he said was 100% normal and on par with quality SDs or relationships you’ve had in the past?",
                    "author": "sienfiekdsa",
                    "id": "g3f2mz9",
                    "parent_id": "t1_g3f04p7",
                    "score": 3,
                    "created_utc": 1598834757.0,
                    "replies": [
                        {
                            "body": "It guess it felt “normal” but yet again I am new to the Sugar Lifestyle. He did sweet talk throughout the texting, which I thought was sweet at the time. But maybe he was playing it up.",
                            "author": "WarriorQueenCeline",
                            "id": "g3f3dly",
                            "parent_id": "t1_g3f2mz9",
                            "score": 7,
                            "created_utc": 1598835181.0,
                            "replies": [
                                {
                                    "body": "Be extremely weary of the men who do this, please! It's not normal to be saccharine with someone you've never even met, especially for men.",
                                    "author": "lara-xo",
                                    "id": "g3fytkx",
                                    "parent_id": "t1_g3f3dly",
                                    "score": 3,
                                    "created_utc": 1598857143.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Although this is possible, it’s seems so unlikely.",
                    "author": "garret6758",
                    "id": "g3f2vdr",
                    "parent_id": "t1_g3f04p7",
                    "score": 4,
                    "created_utc": 1598834890.0,
                    "replies": [
                        {
                            "body": "I agree. This is one of those where it would be amazing to hear both sides of the story.",
                            "author": null,
                            "id": "g3i6urb",
                            "parent_id": "t1_g3f2vdr",
                            "score": 1,
                            "created_utc": 1598901679.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "56 according to his texts.",
            "author": "WarriorQueenCeline",
            "id": "g3fi71d",
            "parent_id": "t1_g3fd1ia",
            "score": 5,
            "created_utc": 1598843994.0,
            "replies": []
        },
        {
            "body": "According to his texts he was 56, I’m 27.",
            "author": "WarriorQueenCeline",
            "id": "g3fihqz",
            "parent_id": "t1_g3fhlxx",
            "score": 3,
            "created_utc": 1598844181.0,
            "replies": [
                {
                    "body": "Oh my! He was off his rockers!",
                    "author": "BeautyGr8ce",
                    "id": "g3grnt7",
                    "parent_id": "t1_g3fihqz",
                    "score": 1,
                    "created_utc": 1598881724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like others before me, I’m so sorry you went through this.  There are many very real gentlemen SD’s among us who would treat you as a lady no matter the circumstances.  Your Pot is definitely a shit / loose cannon for doing this to you \n\nI can think of no reason to do this other than he has a few loose screws.  The only possibly thing I can think of is he possibly Recognized somebody at the m&g and was trying to show off or protect himself in some way. \n\nIn either case - still a dick move.  Hope his little dick falls off.",
            "author": "jloaz",
            "id": "g3fkcz3",
            "parent_id": "t1_g3f8r62",
            "score": 7,
            "created_utc": 1598845405.0,
            "replies": []
        },
        {
            "body": "Not really, it sounds believable to me. I mean the guy is an odd duck and there’s probably not many of them around, but I can see it happening.\n\nW.Queen, I’m sorry this happened to you. I perfectly understand freezing and not having a come back for anything so rude and shocking. That’s actually what nice people do, we are not always at the ready with a smart ass response to surprise rudeness.",
            "author": "FauxpasIrisLily",
            "id": "g3feuux",
            "parent_id": "t1_g3f8r62",
            "score": 6,
            "created_utc": 1598841956.0,
            "replies": [
                {
                    "body": "I don’t question the authenticity of the story but I just want to have the blanks filled in.",
                    "author": "SebastianArnault",
                    "id": "g3fhjc2",
                    "parent_id": "t1_g3feuux",
                    "score": 2,
                    "created_utc": 1598843592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree. As I read the pile on of sympathy on the OP, I simply scrolled down on the thread to see posts that are more balanced. The lady claims she was talking to the POT for a while and had a good connection. I wonder then what triggered the guy to say what he said. Was he just a neurotic mentally diseased man? If so I get it. He went off without provocation. But if he was not, what triggered the confrontation. It is quite rare for guys to go off like this on women unless they are mentally ill.",
            "author": null,
            "id": "g3gr3xn",
            "parent_id": "t1_g3f8r62",
            "score": -1,
            "created_utc": 1598881450.0,
            "replies": []
        },
        {
            "body": "I froze and couldn’t say anything, when we were chatting through text he was so nice so when he did it I was so caught off guard. I guess I just have to be better prepared next time.",
            "author": "WarriorQueenCeline",
            "id": "g3ezz5v",
            "parent_id": "t1_g3epflj",
            "score": 5,
            "created_utc": 1598833239.0,
            "replies": []
        },
        {
            "body": "Probably that it also helps to make him feel better about his career choice if he can vilify his opposition.",
            "author": "willfromvb",
            "id": "g3giup7",
            "parent_id": "t1_g3g3klo",
            "score": 7,
            "created_utc": 1598877005.0,
            "replies": [
                {
                    "body": "Exactly",
                    "author": null,
                    "id": "g3j58f2",
                    "parent_id": "t1_g3giup7",
                    "score": 1,
                    "created_utc": 1598917775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably because she was more attractive and a freak in the sheets",
            "author": null,
            "id": "g3rgmj3",
            "parent_id": "t1_g3g3klo",
            "score": 1,
            "created_utc": 1599077176.0,
            "replies": []
        },
        {
            "body": "SA is a bit of a cesspool, so better to approach with an abundance of caution if you are the type who is very sensitive. While men are unlikely to go this far out of their way to insult and degrade you, they're definitely willing to do so via message. Eventually you become inured to it. I used to respond with \"I'm sorry you feel that way.\" Now I'm more likely to simply block.\n\nRemember that you are in a position of superiority in every last exchange. Don't let behavior like this get to you; the men who would resort to it are always hard up, the type to hate-masturbate to you. They WISH they could have you. They're sad, pathetic. \n\nKeep your chin up, beautiful.",
            "author": "lara-xo",
            "id": "g3fyonn",
            "parent_id": "t1_g3fc2c8",
            "score": 8,
            "created_utc": 1598857006.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g3fl7zc",
            "parent_id": "t1_g3eztnf",
            "score": 13,
            "created_utc": 1598845985.0,
            "replies": [
                {
                    "body": "Yes! I tend to be VERY curt until we meet. Polite, but extremely guarded.",
                    "author": "lara-xo",
                    "id": "g3fyqo6",
                    "parent_id": "t1_g3fl7zc",
                    "score": 4,
                    "created_utc": 1598857060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it’s understandable that you froze up and then got out of there. That was shocking behaviour. Having someone purposefully invite you out to humiliate you is insidious. I disagree that you should have confronted him. Your instincts are valuable, and they told you to get the hell out of there. You may be rightfully upset, but you were not physically harmed. There are seasoned predators on SA who understand how to act and what to say in order to exploit you, and get you where they want you. You learned this lesson early on which bodes well for your future should you decided to return to SA. Sorry this happened to you.",
            "author": "InnerRadio7",
            "id": "g3go8gt",
            "parent_id": "t1_g3eztnf",
            "score": 6,
            "created_utc": 1598880266.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g3gtab9",
            "parent_id": "t1_g3grnyl",
            "score": 4,
            "created_utc": 1598882387.0,
            "replies": [
                {
                    "body": "I understand where you're coming from now, thank you for explaining it to me. I avoid using terms like \"should have\" and \"allow\" because she is a victim and we don't want her to feel responsible for the encounter. Victim blaming can happen even if we don't intend it if we aren't careful with our words. I hope OP takes some time to heal. Something like that would really shake me up if I was in her shoes. It is easy to dwell on such an event and regret not reacting differently, and I do not want to facilitate that type of negative feeling for her because she is probably feeling low from what happened already.",
                    "author": "poofymon",
                    "id": "g3gws9j",
                    "parent_id": "t1_g3gtab9",
                    "score": 4,
                    "created_utc": 1598883804.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So everything he said was 100% normal and on par with quality SDs or relationships you’ve had in the past?",
            "author": "sienfiekdsa",
            "id": "g3f2mz9",
            "parent_id": "t1_g3f04p7",
            "score": 3,
            "created_utc": 1598834757.0,
            "replies": [
                {
                    "body": "It guess it felt “normal” but yet again I am new to the Sugar Lifestyle. He did sweet talk throughout the texting, which I thought was sweet at the time. But maybe he was playing it up.",
                    "author": "WarriorQueenCeline",
                    "id": "g3f3dly",
                    "parent_id": "t1_g3f2mz9",
                    "score": 7,
                    "created_utc": 1598835181.0,
                    "replies": [
                        {
                            "body": "Be extremely weary of the men who do this, please! It's not normal to be saccharine with someone you've never even met, especially for men.",
                            "author": "lara-xo",
                            "id": "g3fytkx",
                            "parent_id": "t1_g3f3dly",
                            "score": 3,
                            "created_utc": 1598857143.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Although this is possible, it’s seems so unlikely.",
            "author": "garret6758",
            "id": "g3f2vdr",
            "parent_id": "t1_g3f04p7",
            "score": 4,
            "created_utc": 1598834890.0,
            "replies": [
                {
                    "body": "I agree. This is one of those where it would be amazing to hear both sides of the story.",
                    "author": null,
                    "id": "g3i6urb",
                    "parent_id": "t1_g3f2vdr",
                    "score": 1,
                    "created_utc": 1598901679.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my! He was off his rockers!",
            "author": "BeautyGr8ce",
            "id": "g3grnt7",
            "parent_id": "t1_g3fihqz",
            "score": 1,
            "created_utc": 1598881724.0,
            "replies": []
        },
        {
            "body": "I don’t question the authenticity of the story but I just want to have the blanks filled in.",
            "author": "SebastianArnault",
            "id": "g3fhjc2",
            "parent_id": "t1_g3feuux",
            "score": 2,
            "created_utc": 1598843592.0,
            "replies": []
        },
        {
            "body": "Exactly",
            "author": null,
            "id": "g3j58f2",
            "parent_id": "t1_g3giup7",
            "score": 1,
            "created_utc": 1598917775.0,
            "replies": []
        },
        {
            "body": "Yes! I tend to be VERY curt until we meet. Polite, but extremely guarded.",
            "author": "lara-xo",
            "id": "g3fyqo6",
            "parent_id": "t1_g3fl7zc",
            "score": 4,
            "created_utc": 1598857060.0,
            "replies": []
        },
        {
            "body": "I understand where you're coming from now, thank you for explaining it to me. I avoid using terms like \"should have\" and \"allow\" because she is a victim and we don't want her to feel responsible for the encounter. Victim blaming can happen even if we don't intend it if we aren't careful with our words. I hope OP takes some time to heal. Something like that would really shake me up if I was in her shoes. It is easy to dwell on such an event and regret not reacting differently, and I do not want to facilitate that type of negative feeling for her because she is probably feeling low from what happened already.",
            "author": "poofymon",
            "id": "g3gws9j",
            "parent_id": "t1_g3gtab9",
            "score": 4,
            "created_utc": 1598883804.0,
            "replies": []
        },
        {
            "body": "It guess it felt “normal” but yet again I am new to the Sugar Lifestyle. He did sweet talk throughout the texting, which I thought was sweet at the time. But maybe he was playing it up.",
            "author": "WarriorQueenCeline",
            "id": "g3f3dly",
            "parent_id": "t1_g3f2mz9",
            "score": 7,
            "created_utc": 1598835181.0,
            "replies": [
                {
                    "body": "Be extremely weary of the men who do this, please! It's not normal to be saccharine with someone you've never even met, especially for men.",
                    "author": "lara-xo",
                    "id": "g3fytkx",
                    "parent_id": "t1_g3f3dly",
                    "score": 3,
                    "created_utc": 1598857143.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree. This is one of those where it would be amazing to hear both sides of the story.",
            "author": null,
            "id": "g3i6urb",
            "parent_id": "t1_g3f2vdr",
            "score": 1,
            "created_utc": 1598901679.0,
            "replies": []
        },
        {
            "body": "Be extremely weary of the men who do this, please! It's not normal to be saccharine with someone you've never even met, especially for men.",
            "author": "lara-xo",
            "id": "g3fytkx",
            "parent_id": "t1_g3f3dly",
            "score": 3,
            "created_utc": 1598857143.0,
            "replies": []
        }
    ]
}