{
    "title": "I met my soulmate on SA",
    "post_id": "ma1r7t",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ma1r7t/i_met_my_soulmate_on_sa/",
    "author": "Throwaway2636-5831",
    "body": "Our 1 year anniversary is tomorrow and the rest of our lives together succeed after that.\n\nThe Impetus:\n\nAfter a lugubrious amount of time spent scrolling through men on SA, I finally came across him.\n\nHim— a well-dressed and incredibly handsome man in his late 50’s with a bio that read like Shakespeare prose. I (25F) was smitten and favorited him immediately.\n\nHe reached out shortly with a clever message referencing something in my bio. We took off to a third-party messaging app and within 10-20 minutes of texting, we realized that a majority of our individual preferences towards music, art, food, and general approach to life had a wide, and ever-growing, overlap. Think Venn Diagram, but with a much larger shared median.\n\nCould this be a made match in heaven?\n\nNeedless to say... it was.\n\nWe had our first date 2 weeks after the initial messaging exchange and we never looked back.\n\nFor the first few dates, I would only stay for the evening; however, that quietly coalesced into staying over for the night... then for two days... then for the weekend... and then eventually for the whole week.\n\nOn the second month of seeing each other, I asked him over lamb chops and roasted vegetables to go exclusive with me— he told me if I hadn't asked it first, he was going to do it that weekend.\n\nMonth 3, he asked me to move in.\n\nMonth 3, I moved in.\n\nMonth 4, he offered me an opportunity to be employed at his firm, which by happenstance is the job of my dreams— I accepted and know make double my previous salary and have an incredible mentor 24/7. He carves out hours of the week to hold \"office hours\" with me, which serves as a window of opportunity to receive private tutoring from him— I can ask him any question or seek any guidance that is needed. He provides anecdotes, suggestions, and constructive lessons to help me transition from a great professional to a world-class professional. He has invested heavily into my career goals, paying for online classes, books, providing capital, and other ancillary resources to help set me up for success.\n\nCareer-wise, I have taken off like a rocket ship.\n\nMonth 5, we begin introducing each other to our inner circle and despite the generous age gap, it has gone incredibly well and our tribes have started to almagamate.\n\nOver the next few months preceding to our one year, we have visibly and intangibly made each other much better humans.\n\nHim, more level-headed, calm, patient, and empathetic.\n\nMe, more organized, well-managed, ambitious, and analytical.\n\nOn a high-level overview, we spend 99% of our time together. Our days are solemn and interspersed with quiet, beautiful but radiant moments of affection. We communicate, we discourse, we learn, we argue but we grow, we travel, we laugh, we go and we love together.\n\nWe just adopted 3 cats and plan for an engagement post-covid19.\n\nToday— I am writing this from a highset balcony in Hawaii overlooking sprawling flora which kisses a blue horizon.\n\nMy legs are on his lap and he doesn't know that I am writing about the moments and his greatness that has coalesced to this zenith.\n\nHappy 1 year anniversary to the love of my life.\n\ntl;dr: It can happen. You can find your life partner on SA.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ma1r7t/i_met_my_soulmate_on_sa/",
    "score": 162,
    "upvote_ratio": 0.85,
    "created_utc": 1616348432.0,
    "num_comments": 60,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "He hired you to work at his company? Not likely. I vote fake on this one.",
            "author": "Birdflare",
            "id": "grs3o1t",
            "parent_id": "t3_ma1r7t",
            "score": 10,
            "created_utc": 1616388608.0,
            "replies": []
        },
        {
            "body": "Can you clone him and send one my way???? Or clone him multiple times and shower us SBs with him like Oprah “you get a car!”\n\nI just need a little love today lol",
            "author": null,
            "id": "grq95va",
            "parent_id": "t3_ma1r7t",
            "score": 43,
            "created_utc": 1616353107.0,
            "replies": [
                {
                    "body": "Forealz.",
                    "author": "Neuxla",
                    "id": "grqc14u",
                    "parent_id": "t1_grq95va",
                    "score": 1,
                    "created_utc": 1616354547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Does not feel like a genuine story... to me at least",
            "author": "chance1829",
            "id": "grraw3l",
            "parent_id": "t3_ma1r7t",
            "score": 28,
            "created_utc": 1616372150.0,
            "replies": []
        },
        {
            "body": "This was hard to read 🙄",
            "author": "Color_Me_Blue",
            "id": "grqx685",
            "parent_id": "t3_ma1r7t",
            "score": 39,
            "created_utc": 1616365182.0,
            "replies": [
                {
                    "body": "Right? No mention of the arrangement and straight to meeting him without allowance and moved in after knowing him just for 3 month?? Plus he is like 50 and OP is like 25. That's just too weird.",
                    "author": "Champagne_bitch",
                    "id": "grr889j",
                    "parent_id": "t1_grqx685",
                    "score": 27,
                    "created_utc": 1616370740.0,
                    "replies": [
                        {
                            "body": "Mostly her use of big words lol\n\nI don’t usually have to bring out my thesaurus when using Reddit.",
                            "author": "Color_Me_Blue",
                            "id": "grr9yhx",
                            "parent_id": "t1_grr889j",
                            "score": 21,
                            "created_utc": 1616371663.0,
                            "replies": [
                                {
                                    "body": "Not just the use of them,  but the inappropriate/incorrect use of them. It's like someone used a dictionary or thesaurus to look up synonyms without understanding proper use of the big words they see listed as a synonym.",
                                    "author": "SLF921019",
                                    "id": "grrb2gd",
                                    "parent_id": "t1_grr9yhx",
                                    "score": 33,
                                    "created_utc": 1616372244.0,
                                    "replies": [
                                        {
                                            "body": "This was bothering me the whole time.  Thank you.",
                                            "author": "sugarintherawr",
                                            "id": "grrjnlc",
                                            "parent_id": "t1_grrb2gd",
                                            "score": 14,
                                            "created_utc": 1616376577.0,
                                            "replies": [
                                                {
                                                    "body": "This stuff always reminds me of Damon Wayans' character \"Oswald Bates\" from \"In Living Color\"\n\nhttps://youtu.be/71xxvp5R9hE",
                                                    "author": "SLF921019",
                                                    "id": "grrq7so",
                                                    "parent_id": "t1_grrjnlc",
                                                    "score": 7,
                                                    "created_utc": 1616380016.0,
                                                    "replies": [
                                                        {
                                                            "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
                                                            "author": "sugarintherawr",
                                                            "id": "grrqmx0",
                                                            "parent_id": "t1_grrq7so",
                                                            "score": 2,
                                                            "created_utc": 1616380245.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Most 25 years old I know, my friend group and some friends at SA doesn't write like that too. Sketchy....",
                                    "author": "Champagne_bitch",
                                    "id": "grra2ir",
                                    "parent_id": "t1_grr9yhx",
                                    "score": 13,
                                    "created_utc": 1616371721.0,
                                    "replies": [
                                        {
                                            "body": "Maybe she really does just need someone way older. A true old soul. Who knows 🤷🏻‍♂️",
                                            "author": "Color_Me_Blue",
                                            "id": "grra8ud",
                                            "parent_id": "t1_grra2ir",
                                            "score": 11,
                                            "created_utc": 1616371811.0,
                                            "replies": [
                                                {
                                                    "body": "Lmao, let's be honest. Do you want to fuck a 50 years old?\nLike, he is 50 years old, managing a firm and doesn't have wife or children?? Like, never married? I bet that 50 years old guy is actually married and will leave her ass. Saw that happen to some SB.",
                                                    "author": "Champagne_bitch",
                                                    "id": "grrcp1b",
                                                    "parent_id": "t1_grra8ud",
                                                    "score": 3,
                                                    "created_utc": 1616373096.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh yeah for sure! Lol",
                                                            "author": "Color_Me_Blue",
                                                            "id": "grtkw84",
                                                            "parent_id": "t1_grrcp1b",
                                                            "score": 2,
                                                            "created_utc": 1616427406.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "\"her\" 🙄😂",
                                    "author": "BlueJayJay82",
                                    "id": "grrli82",
                                    "parent_id": "t1_grr9yhx",
                                    "score": 5,
                                    "created_utc": 1616377522.0,
                                    "replies": [
                                        {
                                            "body": "Why is that funny? lol",
                                            "author": "Color_Me_Blue",
                                            "id": "grrlvxc",
                                            "parent_id": "t1_grrli82",
                                            "score": 2,
                                            "created_utc": 1616377717.0,
                                            "replies": [
                                                {
                                                    "body": "I’d def place my bets on it being some weird SD writing fanfiction lol",
                                                    "author": "Clektr",
                                                    "id": "grrzevi",
                                                    "parent_id": "t1_grrlvxc",
                                                    "score": 6,
                                                    "created_utc": 1616385572.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Consider such things weird and they will remain weird.  Consider them possible and they will be possible.  Please see my comment to the OP.",
                            "author": "Carbonara79",
                            "id": "gsk00nx",
                            "parent_id": "t1_grr889j",
                            "score": 2,
                            "created_utc": 1616909864.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You me until “We just adopted 3 cats”, and think you went to far. Boundaries OP, boundaries.",
            "author": "garret6758",
            "id": "grq6vhk",
            "parent_id": "t3_ma1r7t",
            "score": 34,
            "created_utc": 1616351977.0,
            "replies": [
                {
                    "body": "OP said they \"planned an engagement post covid\" obviously there are no boundaries here. I'm pretty sure the story is fake though lol.",
                    "author": "ColdHeaux",
                    "id": "grr51tf",
                    "parent_id": "t1_grq6vhk",
                    "score": 18,
                    "created_utc": 1616369131.0,
                    "replies": []
                },
                {
                    "body": "Right?  Cats?  WTF?",
                    "author": "Y_4Z44",
                    "id": "grqhqq7",
                    "parent_id": "t1_grq6vhk",
                    "score": 12,
                    "created_utc": 1616357425.0,
                    "replies": []
                },
                {
                    "body": "\\+1",
                    "author": "l8_apex",
                    "id": "grqwll5",
                    "parent_id": "t1_grq6vhk",
                    "score": 3,
                    "created_utc": 1616364892.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">It can happen. You can find your life partner on SA.\n\nAssuming this is a genuine account, the probability of this happening on SA would be???  Sounds much more like a vanilla dating experience from the start than an SR turned vanilla.  SA is not a conventional dating site and I dare suggest that such an experience would have long shot odds at best.\n\nThere is a honeymoon phase in most relationships, while 1 year of bliss is something to celebrate, 10/20 years would be much more significant milestones.  A 25 year age gap may not seem significant at the moment but I assure you that it will be in another 25 years from now. Good luck but I submit that only 1 year together does not qualify for a life partnership declaration.",
            "author": "Jeff_M3",
            "id": "grrzz70",
            "parent_id": "t3_ma1r7t",
            "score": 9,
            "created_utc": 1616385952.0,
            "replies": []
        },
        {
            "body": "You forgot to mention his 12 inch cock!",
            "author": null,
            "id": "grqng61",
            "parent_id": "t3_ma1r7t",
            "score": 31,
            "created_utc": 1616360282.0,
            "replies": [
                {
                    "body": "Kind of agree except that I have this very very strong feeling this was written by a man-   \n also oddly doesn't mention sex or allowance. So, it doesn't actually describe a sugar relationship but just a vanilla one. I have this weird feeling it was written by a guy who wants to be a sugar daddy but not pay, and is hoping this sales pitch will encourage a 25 year old sugar baby to fall in love with him with no sugar lol.",
                    "author": "ColdHeaux",
                    "id": "grqv7h9",
                    "parent_id": "t1_grqng61",
                    "score": 32,
                    "created_utc": 1616364190.0,
                    "replies": [
                        {
                            "body": "I agree 100%. No 25 year old woman says “I was smitten and favored him immediately.”",
                            "author": "Lar5031",
                            "id": "grr6pto",
                            "parent_id": "t1_grqv7h9",
                            "score": 16,
                            "created_utc": 1616369978.0,
                            "replies": [
                                {
                                    "body": "Or is impressed that his bio \"was like Shakespeare prose.\" First of all, what does that actually mean? \"Many of Shakespeare's low-class characters speak in prose to distinguish themselves from the higher-class, verse-speaking characters.\" I'm assuming they didn't mean that. Also, prose itself basically means any writing that uses sentences and paragraphs and not metrical structure. So what is OP saying it was like? Even if it was just supposed to be written well, what was written well about it? I feel like that's a man trying and failing to figure out how to write what would be attractive to an SB about a SD's bio and just keeping it vague enough to fit.\n\nNot to mention OP's account was seemingly created today for this exact post- presumably because their own account would have made it obvious they were not a SB lol. And again, the fact that OP refers to themself as \"more analytical\" due to this one year and three cats of experience with this man, is absolutely hilarious.",
                                    "author": "ColdHeaux",
                                    "id": "grr798t",
                                    "parent_id": "t1_grr6pto",
                                    "score": 19,
                                    "created_utc": 1616370245.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I can see that perspective. I also know I’ve had three separate sb’s request a transition to vanilla. Which has been exactly what I did not want post divorce. I can’t put my finger on any reasoning but for me its maybe 1/3rd the time what happens. I feel like there’s no way for me to type all that without coming off pompous. So there it is. I read this as what it is. Because It does happen.",
                            "author": "JamesGarrison",
                            "id": "grr28oy",
                            "parent_id": "t1_grqv7h9",
                            "score": 3,
                            "created_utc": 1616367712.0,
                            "replies": [
                                {
                                    "body": "I'm not saying the situation is impossible actually- I'm saying the style of writing and what was mentioned/not mentioned seems like a guy writing it. Just a feeling.",
                                    "author": "ColdHeaux",
                                    "id": "grr2m1k",
                                    "parent_id": "t1_grr28oy",
                                    "score": 10,
                                    "created_utc": 1616367898.0,
                                    "replies": [
                                        {
                                            "body": "I felt like it was a woman. Who mentioned she enjoyed his well written bio. I imagine this is her attempting something similar. It wasn’t particularly well worded or to the point. Kind of carried on. Like someone who wanted to write well would and exactly how they’d fail. Words chosen for the amount of syllables than passion. So I took it as more of a post that someone took as a writing challenge more than anything.",
                                            "author": "JamesGarrison",
                                            "id": "grr35qf",
                                            "parent_id": "t1_grr2m1k",
                                            "score": -1,
                                            "created_utc": 1616368172.0,
                                            "replies": [
                                                {
                                                    "body": "Also \"I've spent less than a year with this man I immediately moved in with that I'm madly in love with and now I'm more analytical\" is WAY more male fantasy than female fantasy. Not to mention, any SB or even aspiring SB would at least hint at the fact that their concern for their safety came up. A HUGE theme in SB success stories is us mentioning how this person put us at ease about our safety. It's something not all SDs even have cross their mind. But all women worry about it. It always comes up for us. But it's not romantic enough for a man to include in his story.\n\nLike I said- I just have a very strong feeling.",
                                                    "author": "ColdHeaux",
                                                    "id": "grr67x1",
                                                    "parent_id": "t1_grr35qf",
                                                    "score": 13,
                                                    "created_utc": 1616369729.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Agree to disagree. I feel 100% strongly this was a man on a throwaway account. If it was a woman on the sub who was verifiably a woman, she'd have no reason not to use her own account.",
                                                    "author": "ColdHeaux",
                                                    "id": "grr4qeq",
                                                    "parent_id": "t1_grr35qf",
                                                    "score": 11,
                                                    "created_utc": 1616368968.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Although you are also correct that this person isn't a good writer, it's writing that reads VERY much like a 50 year old man trying to write as a woman and how he thinks we view SDs. Also \"He reached out shortly with a clever message referencing something in my bio\" is so fucking self congratulatory it's painful lol.",
                                                    "author": "ColdHeaux",
                                                    "id": "grr4w3k",
                                                    "parent_id": "t1_grr35qf",
                                                    "score": 8,
                                                    "created_utc": 1616369050.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "💀💀💀💀",
                    "author": "Heartless_Weeknd",
                    "id": "h2ups3v",
                    "parent_id": "t1_grqng61",
                    "score": 1,
                    "created_utc": 1624510412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤢🤮🤮🤮",
            "author": "Whatevenisit2266",
            "id": "grrsrhd",
            "parent_id": "t3_ma1r7t",
            "score": 8,
            "created_utc": 1616381426.0,
            "replies": []
        },
        {
            "body": "Love the use of lugubrious. The SA slog does very much feel like that.",
            "author": "buttery_bees",
            "id": "grq71c5",
            "parent_id": "t3_ma1r7t",
            "score": 4,
            "created_utc": 1616352057.0,
            "replies": [
                {
                    "body": "Except a \"lugubrious amount of time\" makes no sense. A search might be described as lugubrious, an amount of time? Not so much.",
                    "author": "SLF921019",
                    "id": "grrbc00",
                    "parent_id": "t1_grq71c5",
                    "score": 19,
                    "created_utc": 1616372384.0,
                    "replies": [
                        {
                            "body": "Ah, good point.",
                            "author": "buttery_bees",
                            "id": "grrbh9s",
                            "parent_id": "t1_grrbc00",
                            "score": 2,
                            "created_utc": 1616372461.0,
                            "replies": []
                        },
                        {
                            "body": "maybe she meant luxurious but the phone autocorrected? 😂",
                            "author": "annanice",
                            "id": "gs15ya4",
                            "parent_id": "t1_grrbc00",
                            "score": 1,
                            "created_utc": 1616580602.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In the first 10-20 minutes of texting, I’m asking about the ppm; not music, art and food lol \n\nA man definitely wrote this.",
            "author": "JazyZazy",
            "id": "gs033hi",
            "parent_id": "t3_ma1r7t",
            "score": 3,
            "created_utc": 1616550814.0,
            "replies": []
        },
        {
            "body": "He’s manipulating you because your half his age. I give it another year...no shade just constructive criticism...make sure you save when he push you aside for someone younger...have fun!",
            "author": "PhuckYouPayMeTrick",
            "id": "grsleuc",
            "parent_id": "t3_ma1r7t",
            "score": 5,
            "created_utc": 1616405612.0,
            "replies": []
        },
        {
            "body": "I met my wife on SA. She's definitely my soul mate. You can find love in the bowl, if that's what you want to get out of it.",
            "author": null,
            "id": "grtmkec",
            "parent_id": "t3_ma1r7t",
            "score": 2,
            "created_utc": 1616428104.0,
            "replies": []
        },
        {
            "body": "Interesting.  There is clearly *some* possibility that this particular message is fake.  The commenters on the language make compelling points... but they're not completely convincing by any means; I know many women in their twenties who love big words and write in such a style.  But more centrally, I *completely* disagree with the general cynicism expressed in response to it.\n\nCall me an incurable romantic or perhaps an incurable sucker (is there a difference?), but I don't find the potential evolution of SR->successful vanilla to be impossible or even so prohibitively improbable.  I've been reading this subreddit for a while and I believe this to be my first comment of any seriousness.  I have had several SRs that lasted for a year or two, kept their boundaries intact, provided exactly what they were supposed to for both parties, and ended at appropriate times:  with the SB going her own way- in a better place in life- and me going mine.   \n\nIn the midst of those have been two exceptions.  The first (28-year age-gap) took a romantic turn and led to a six-year relationship and an engagement that was only broken at the last moment for the sorts of reasons that could sink any relationship.  \n\nThe second is set in the present.   After an auspicious set of dates beginning nearly a year and a half ago, it was put on hold during the pandemic while we were quarantined in separate places, but since then it has exploded into something truly wonderful.  Who knows exactly where it will go, but I'm an optimist... and why not be?  Could it fall apart?  Sure.  But couldn't a regular vanilla marriage or relationship fall apart?  Could the cynics here describe it all as some sort of \"long con\"?  Again- couldn't many standard marriages or relationship also be described this way, if one really wanted to get that granular?  Personally, I don't really care how it's described.  I'm happy, she's happy, life doesn't last forever, and we're going to give it a big shot.  We're not together 99% of the time (nor would either of us want to be), but it's got to be a good 61%.  This one has a 32-year gap (55/23).  Big deal.  Oh- and both of us are still seeking around at the same time on SA- and we comment on each other's 'POTs' (sorry, but couldn't there be a more elegant acronym?... so clunky!) because we're a little crazy and we love being a little crazy.  \n\nI'm actually quite looking forward to the responses to *this* comment.  There isn't an untrue word in it.  Skeptics... have at it!",
            "author": "Carbonara79",
            "id": "gsjz652",
            "parent_id": "t3_ma1r7t",
            "score": 2,
            "created_utc": 1616909196.0,
            "replies": []
        },
        {
            "body": "That gives hope. That's what I went through. Except the whole soulmate thing was one way and there was no happy ending, just being used badly and lied to a lot. So it's nice to see the other thing can happen. \n\nI can handle being lied to but lied to by someone I love is pretty tough.",
            "author": "wikishart",
            "id": "grq2fmy",
            "parent_id": "t3_ma1r7t",
            "score": 5,
            "created_utc": 1616349821.0,
            "replies": []
        },
        {
            "body": "\"now,\" not \"know\"",
            "author": null,
            "id": "grqa9zp",
            "parent_id": "t3_ma1r7t",
            "score": 7,
            "created_utc": 1616353667.0,
            "replies": []
        },
        {
            "body": "Congrats! Were you seeing each other as PPM at any point? Or did you two just hit it off so well that it wasn’t even relevant ?",
            "author": "lagrangianblunt",
            "id": "grqta39",
            "parent_id": "t3_ma1r7t",
            "score": 4,
            "created_utc": 1616363220.0,
            "replies": []
        },
        {
            "body": "❤️❤️❤️❤️❤️\nAwwwww this is great and gives me some hope for my SB and I. I’d love for it to go the same way!! \nCongrats and thanks for sharing.",
            "author": "thereadinessisall",
            "id": "grq2lt2",
            "parent_id": "t3_ma1r7t",
            "score": 2,
            "created_utc": 1616349905.0,
            "replies": []
        },
        {
            "body": "I think I’m falling in love with mine. 20 years apart, he’s so sexy.. Retired marine, perfect body, funny, smart, cultured, can dance, FUN, sex is bomb, and he shows so much interest and attraction to me. It feels too good to be true which is fine I’m just enjoying everything in the moment. I forget he’s even wealthy to be honest but I could care less I genuinely like him so much.",
            "author": "Babybianca1",
            "id": "grrt7kw",
            "parent_id": "t3_ma1r7t",
            "score": 2,
            "created_utc": 1616381691.0,
            "replies": []
        },
        {
            "body": "Absolutely love your writing and love your story 🥰 Wishing you and your love the best! Don't forget to invite us to the wedding!",
            "author": "galactosegirl",
            "id": "grqg0ha",
            "parent_id": "t3_ma1r7t",
            "score": 2,
            "created_utc": 1616356552.0,
            "replies": []
        },
        {
            "body": "I love all of this--especially the private tutoring sessions, because, well my mind went elsewhere with it 😈 haha",
            "author": "ladylunapluss",
            "id": "grqpp34",
            "parent_id": "t3_ma1r7t",
            "score": 2,
            "created_utc": 1616361410.0,
            "replies": []
        },
        {
            "body": "I do firmly believe this is a real woman and disagree with posters here. Why ? After years in the bowl, I have seen a large percentage of sbs who are in the bowl to network, advance in their career, obtain a mentor(s), and get gainful employment, especially in their fields, to advance and also become independent of a man further support. Not every sb is trying to get the highest ppm and care little for the sd or not try to form real meaningful relationships.",
            "author": "dade_murphy1",
            "id": "grr6hdj",
            "parent_id": "t3_ma1r7t",
            "score": 1,
            "created_utc": 1616369861.0,
            "replies": []
        },
        {
            "body": "Congratulations!  It can definitely happen.  I’ve had two LTRs from SA.  The last one is going to be my last one as well.  But different than yours (tried hiring my last LTR....didn’t work out so well) but we are coming up on a year too, never been happier.",
            "author": "RedHeavyG603",
            "id": "grrdcnx",
            "parent_id": "t3_ma1r7t",
            "score": 1,
            "created_utc": 1616373423.0,
            "replies": []
        },
        {
            "body": "I love the story, the sentiment, and the prose you used to bring it to us. Hopefully this one year of bliss morphs into forever for you two. Happy Anniversary!",
            "author": "Cledaddy23",
            "id": "grrfobt",
            "parent_id": "t3_ma1r7t",
            "score": 1,
            "created_utc": 1616374571.0,
            "replies": []
        },
        {
            "body": "Omg. This is amazing. You give me hope !",
            "author": "CryptoAustinSD",
            "id": "grq56mq",
            "parent_id": "t3_ma1r7t",
            "score": 0,
            "created_utc": 1616351145.0,
            "replies": []
        },
        {
            "body": "Yes! Good for you both! I love SA success stories! I’m living one myself right now.",
            "author": "photo-guy",
            "id": "grqlv0e",
            "parent_id": "t3_ma1r7t",
            "score": 0,
            "created_utc": 1616359501.0,
            "replies": []
        },
        {
            "body": "Dang ya’ll are some haters 😩🤣best of luck to OP and just finding happiness in the current circumstance of unprecedented times.",
            "author": "PrettyFlyForABlasian",
            "id": "grs89al",
            "parent_id": "t3_ma1r7t",
            "score": 0,
            "created_utc": 1616392478.0,
            "replies": []
        },
        {
            "body": "congrats.. dont listen to all the bitter / jealous SLFers",
            "author": "Buckeyechamp21",
            "id": "grt9rmd",
            "parent_id": "t3_ma1r7t",
            "score": 1,
            "created_utc": 1616422441.0,
            "replies": []
        },
        {
            "body": "Way cool! Enjoy it!",
            "author": "ElementShow",
            "id": "gruywj1",
            "parent_id": "t3_ma1r7t",
            "score": 1,
            "created_utc": 1616449743.0,
            "replies": []
        },
        {
            "body": "Forealz.",
            "author": "Neuxla",
            "id": "grqc14u",
            "parent_id": "t1_grq95va",
            "score": 1,
            "created_utc": 1616354547.0,
            "replies": []
        },
        {
            "body": "Right? No mention of the arrangement and straight to meeting him without allowance and moved in after knowing him just for 3 month?? Plus he is like 50 and OP is like 25. That's just too weird.",
            "author": "Champagne_bitch",
            "id": "grr889j",
            "parent_id": "t1_grqx685",
            "score": 27,
            "created_utc": 1616370740.0,
            "replies": [
                {
                    "body": "Mostly her use of big words lol\n\nI don’t usually have to bring out my thesaurus when using Reddit.",
                    "author": "Color_Me_Blue",
                    "id": "grr9yhx",
                    "parent_id": "t1_grr889j",
                    "score": 21,
                    "created_utc": 1616371663.0,
                    "replies": [
                        {
                            "body": "Not just the use of them,  but the inappropriate/incorrect use of them. It's like someone used a dictionary or thesaurus to look up synonyms without understanding proper use of the big words they see listed as a synonym.",
                            "author": "SLF921019",
                            "id": "grrb2gd",
                            "parent_id": "t1_grr9yhx",
                            "score": 33,
                            "created_utc": 1616372244.0,
                            "replies": [
                                {
                                    "body": "This was bothering me the whole time.  Thank you.",
                                    "author": "sugarintherawr",
                                    "id": "grrjnlc",
                                    "parent_id": "t1_grrb2gd",
                                    "score": 14,
                                    "created_utc": 1616376577.0,
                                    "replies": [
                                        {
                                            "body": "This stuff always reminds me of Damon Wayans' character \"Oswald Bates\" from \"In Living Color\"\n\nhttps://youtu.be/71xxvp5R9hE",
                                            "author": "SLF921019",
                                            "id": "grrq7so",
                                            "parent_id": "t1_grrjnlc",
                                            "score": 7,
                                            "created_utc": 1616380016.0,
                                            "replies": [
                                                {
                                                    "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
                                                    "author": "sugarintherawr",
                                                    "id": "grrqmx0",
                                                    "parent_id": "t1_grrq7so",
                                                    "score": 2,
                                                    "created_utc": 1616380245.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Most 25 years old I know, my friend group and some friends at SA doesn't write like that too. Sketchy....",
                            "author": "Champagne_bitch",
                            "id": "grra2ir",
                            "parent_id": "t1_grr9yhx",
                            "score": 13,
                            "created_utc": 1616371721.0,
                            "replies": [
                                {
                                    "body": "Maybe she really does just need someone way older. A true old soul. Who knows 🤷🏻‍♂️",
                                    "author": "Color_Me_Blue",
                                    "id": "grra8ud",
                                    "parent_id": "t1_grra2ir",
                                    "score": 11,
                                    "created_utc": 1616371811.0,
                                    "replies": [
                                        {
                                            "body": "Lmao, let's be honest. Do you want to fuck a 50 years old?\nLike, he is 50 years old, managing a firm and doesn't have wife or children?? Like, never married? I bet that 50 years old guy is actually married and will leave her ass. Saw that happen to some SB.",
                                            "author": "Champagne_bitch",
                                            "id": "grrcp1b",
                                            "parent_id": "t1_grra8ud",
                                            "score": 3,
                                            "created_utc": 1616373096.0,
                                            "replies": [
                                                {
                                                    "body": "Oh yeah for sure! Lol",
                                                    "author": "Color_Me_Blue",
                                                    "id": "grtkw84",
                                                    "parent_id": "t1_grrcp1b",
                                                    "score": 2,
                                                    "created_utc": 1616427406.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "\"her\" 🙄😂",
                            "author": "BlueJayJay82",
                            "id": "grrli82",
                            "parent_id": "t1_grr9yhx",
                            "score": 5,
                            "created_utc": 1616377522.0,
                            "replies": [
                                {
                                    "body": "Why is that funny? lol",
                                    "author": "Color_Me_Blue",
                                    "id": "grrlvxc",
                                    "parent_id": "t1_grrli82",
                                    "score": 2,
                                    "created_utc": 1616377717.0,
                                    "replies": [
                                        {
                                            "body": "I’d def place my bets on it being some weird SD writing fanfiction lol",
                                            "author": "Clektr",
                                            "id": "grrzevi",
                                            "parent_id": "t1_grrlvxc",
                                            "score": 6,
                                            "created_utc": 1616385572.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Consider such things weird and they will remain weird.  Consider them possible and they will be possible.  Please see my comment to the OP.",
                    "author": "Carbonara79",
                    "id": "gsk00nx",
                    "parent_id": "t1_grr889j",
                    "score": 2,
                    "created_utc": 1616909864.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP said they \"planned an engagement post covid\" obviously there are no boundaries here. I'm pretty sure the story is fake though lol.",
            "author": "ColdHeaux",
            "id": "grr51tf",
            "parent_id": "t1_grq6vhk",
            "score": 18,
            "created_utc": 1616369131.0,
            "replies": []
        },
        {
            "body": "Right?  Cats?  WTF?",
            "author": "Y_4Z44",
            "id": "grqhqq7",
            "parent_id": "t1_grq6vhk",
            "score": 12,
            "created_utc": 1616357425.0,
            "replies": []
        },
        {
            "body": "\\+1",
            "author": "l8_apex",
            "id": "grqwll5",
            "parent_id": "t1_grq6vhk",
            "score": 3,
            "created_utc": 1616364892.0,
            "replies": []
        },
        {
            "body": "Kind of agree except that I have this very very strong feeling this was written by a man-   \n also oddly doesn't mention sex or allowance. So, it doesn't actually describe a sugar relationship but just a vanilla one. I have this weird feeling it was written by a guy who wants to be a sugar daddy but not pay, and is hoping this sales pitch will encourage a 25 year old sugar baby to fall in love with him with no sugar lol.",
            "author": "ColdHeaux",
            "id": "grqv7h9",
            "parent_id": "t1_grqng61",
            "score": 32,
            "created_utc": 1616364190.0,
            "replies": [
                {
                    "body": "I agree 100%. No 25 year old woman says “I was smitten and favored him immediately.”",
                    "author": "Lar5031",
                    "id": "grr6pto",
                    "parent_id": "t1_grqv7h9",
                    "score": 16,
                    "created_utc": 1616369978.0,
                    "replies": [
                        {
                            "body": "Or is impressed that his bio \"was like Shakespeare prose.\" First of all, what does that actually mean? \"Many of Shakespeare's low-class characters speak in prose to distinguish themselves from the higher-class, verse-speaking characters.\" I'm assuming they didn't mean that. Also, prose itself basically means any writing that uses sentences and paragraphs and not metrical structure. So what is OP saying it was like? Even if it was just supposed to be written well, what was written well about it? I feel like that's a man trying and failing to figure out how to write what would be attractive to an SB about a SD's bio and just keeping it vague enough to fit.\n\nNot to mention OP's account was seemingly created today for this exact post- presumably because their own account would have made it obvious they were not a SB lol. And again, the fact that OP refers to themself as \"more analytical\" due to this one year and three cats of experience with this man, is absolutely hilarious.",
                            "author": "ColdHeaux",
                            "id": "grr798t",
                            "parent_id": "t1_grr6pto",
                            "score": 19,
                            "created_utc": 1616370245.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I can see that perspective. I also know I’ve had three separate sb’s request a transition to vanilla. Which has been exactly what I did not want post divorce. I can’t put my finger on any reasoning but for me its maybe 1/3rd the time what happens. I feel like there’s no way for me to type all that without coming off pompous. So there it is. I read this as what it is. Because It does happen.",
                    "author": "JamesGarrison",
                    "id": "grr28oy",
                    "parent_id": "t1_grqv7h9",
                    "score": 3,
                    "created_utc": 1616367712.0,
                    "replies": [
                        {
                            "body": "I'm not saying the situation is impossible actually- I'm saying the style of writing and what was mentioned/not mentioned seems like a guy writing it. Just a feeling.",
                            "author": "ColdHeaux",
                            "id": "grr2m1k",
                            "parent_id": "t1_grr28oy",
                            "score": 10,
                            "created_utc": 1616367898.0,
                            "replies": [
                                {
                                    "body": "I felt like it was a woman. Who mentioned she enjoyed his well written bio. I imagine this is her attempting something similar. It wasn’t particularly well worded or to the point. Kind of carried on. Like someone who wanted to write well would and exactly how they’d fail. Words chosen for the amount of syllables than passion. So I took it as more of a post that someone took as a writing challenge more than anything.",
                                    "author": "JamesGarrison",
                                    "id": "grr35qf",
                                    "parent_id": "t1_grr2m1k",
                                    "score": -1,
                                    "created_utc": 1616368172.0,
                                    "replies": [
                                        {
                                            "body": "Also \"I've spent less than a year with this man I immediately moved in with that I'm madly in love with and now I'm more analytical\" is WAY more male fantasy than female fantasy. Not to mention, any SB or even aspiring SB would at least hint at the fact that their concern for their safety came up. A HUGE theme in SB success stories is us mentioning how this person put us at ease about our safety. It's something not all SDs even have cross their mind. But all women worry about it. It always comes up for us. But it's not romantic enough for a man to include in his story.\n\nLike I said- I just have a very strong feeling.",
                                            "author": "ColdHeaux",
                                            "id": "grr67x1",
                                            "parent_id": "t1_grr35qf",
                                            "score": 13,
                                            "created_utc": 1616369729.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Agree to disagree. I feel 100% strongly this was a man on a throwaway account. If it was a woman on the sub who was verifiably a woman, she'd have no reason not to use her own account.",
                                            "author": "ColdHeaux",
                                            "id": "grr4qeq",
                                            "parent_id": "t1_grr35qf",
                                            "score": 11,
                                            "created_utc": 1616368968.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Although you are also correct that this person isn't a good writer, it's writing that reads VERY much like a 50 year old man trying to write as a woman and how he thinks we view SDs. Also \"He reached out shortly with a clever message referencing something in my bio\" is so fucking self congratulatory it's painful lol.",
                                            "author": "ColdHeaux",
                                            "id": "grr4w3k",
                                            "parent_id": "t1_grr35qf",
                                            "score": 8,
                                            "created_utc": 1616369050.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "💀💀💀💀",
            "author": "Heartless_Weeknd",
            "id": "h2ups3v",
            "parent_id": "t1_grqng61",
            "score": 1,
            "created_utc": 1624510412.0,
            "replies": []
        },
        {
            "body": "Except a \"lugubrious amount of time\" makes no sense. A search might be described as lugubrious, an amount of time? Not so much.",
            "author": "SLF921019",
            "id": "grrbc00",
            "parent_id": "t1_grq71c5",
            "score": 19,
            "created_utc": 1616372384.0,
            "replies": [
                {
                    "body": "Ah, good point.",
                    "author": "buttery_bees",
                    "id": "grrbh9s",
                    "parent_id": "t1_grrbc00",
                    "score": 2,
                    "created_utc": 1616372461.0,
                    "replies": []
                },
                {
                    "body": "maybe she meant luxurious but the phone autocorrected? 😂",
                    "author": "annanice",
                    "id": "gs15ya4",
                    "parent_id": "t1_grrbc00",
                    "score": 1,
                    "created_utc": 1616580602.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mostly her use of big words lol\n\nI don’t usually have to bring out my thesaurus when using Reddit.",
            "author": "Color_Me_Blue",
            "id": "grr9yhx",
            "parent_id": "t1_grr889j",
            "score": 21,
            "created_utc": 1616371663.0,
            "replies": [
                {
                    "body": "Not just the use of them,  but the inappropriate/incorrect use of them. It's like someone used a dictionary or thesaurus to look up synonyms without understanding proper use of the big words they see listed as a synonym.",
                    "author": "SLF921019",
                    "id": "grrb2gd",
                    "parent_id": "t1_grr9yhx",
                    "score": 33,
                    "created_utc": 1616372244.0,
                    "replies": [
                        {
                            "body": "This was bothering me the whole time.  Thank you.",
                            "author": "sugarintherawr",
                            "id": "grrjnlc",
                            "parent_id": "t1_grrb2gd",
                            "score": 14,
                            "created_utc": 1616376577.0,
                            "replies": [
                                {
                                    "body": "This stuff always reminds me of Damon Wayans' character \"Oswald Bates\" from \"In Living Color\"\n\nhttps://youtu.be/71xxvp5R9hE",
                                    "author": "SLF921019",
                                    "id": "grrq7so",
                                    "parent_id": "t1_grrjnlc",
                                    "score": 7,
                                    "created_utc": 1616380016.0,
                                    "replies": [
                                        {
                                            "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
                                            "author": "sugarintherawr",
                                            "id": "grrqmx0",
                                            "parent_id": "t1_grrq7so",
                                            "score": 2,
                                            "created_utc": 1616380245.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Most 25 years old I know, my friend group and some friends at SA doesn't write like that too. Sketchy....",
                    "author": "Champagne_bitch",
                    "id": "grra2ir",
                    "parent_id": "t1_grr9yhx",
                    "score": 13,
                    "created_utc": 1616371721.0,
                    "replies": [
                        {
                            "body": "Maybe she really does just need someone way older. A true old soul. Who knows 🤷🏻‍♂️",
                            "author": "Color_Me_Blue",
                            "id": "grra8ud",
                            "parent_id": "t1_grra2ir",
                            "score": 11,
                            "created_utc": 1616371811.0,
                            "replies": [
                                {
                                    "body": "Lmao, let's be honest. Do you want to fuck a 50 years old?\nLike, he is 50 years old, managing a firm and doesn't have wife or children?? Like, never married? I bet that 50 years old guy is actually married and will leave her ass. Saw that happen to some SB.",
                                    "author": "Champagne_bitch",
                                    "id": "grrcp1b",
                                    "parent_id": "t1_grra8ud",
                                    "score": 3,
                                    "created_utc": 1616373096.0,
                                    "replies": [
                                        {
                                            "body": "Oh yeah for sure! Lol",
                                            "author": "Color_Me_Blue",
                                            "id": "grtkw84",
                                            "parent_id": "t1_grrcp1b",
                                            "score": 2,
                                            "created_utc": 1616427406.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"her\" 🙄😂",
                    "author": "BlueJayJay82",
                    "id": "grrli82",
                    "parent_id": "t1_grr9yhx",
                    "score": 5,
                    "created_utc": 1616377522.0,
                    "replies": [
                        {
                            "body": "Why is that funny? lol",
                            "author": "Color_Me_Blue",
                            "id": "grrlvxc",
                            "parent_id": "t1_grrli82",
                            "score": 2,
                            "created_utc": 1616377717.0,
                            "replies": [
                                {
                                    "body": "I’d def place my bets on it being some weird SD writing fanfiction lol",
                                    "author": "Clektr",
                                    "id": "grrzevi",
                                    "parent_id": "t1_grrlvxc",
                                    "score": 6,
                                    "created_utc": 1616385572.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Consider such things weird and they will remain weird.  Consider them possible and they will be possible.  Please see my comment to the OP.",
            "author": "Carbonara79",
            "id": "gsk00nx",
            "parent_id": "t1_grr889j",
            "score": 2,
            "created_utc": 1616909864.0,
            "replies": []
        },
        {
            "body": "I agree 100%. No 25 year old woman says “I was smitten and favored him immediately.”",
            "author": "Lar5031",
            "id": "grr6pto",
            "parent_id": "t1_grqv7h9",
            "score": 16,
            "created_utc": 1616369978.0,
            "replies": [
                {
                    "body": "Or is impressed that his bio \"was like Shakespeare prose.\" First of all, what does that actually mean? \"Many of Shakespeare's low-class characters speak in prose to distinguish themselves from the higher-class, verse-speaking characters.\" I'm assuming they didn't mean that. Also, prose itself basically means any writing that uses sentences and paragraphs and not metrical structure. So what is OP saying it was like? Even if it was just supposed to be written well, what was written well about it? I feel like that's a man trying and failing to figure out how to write what would be attractive to an SB about a SD's bio and just keeping it vague enough to fit.\n\nNot to mention OP's account was seemingly created today for this exact post- presumably because their own account would have made it obvious they were not a SB lol. And again, the fact that OP refers to themself as \"more analytical\" due to this one year and three cats of experience with this man, is absolutely hilarious.",
                    "author": "ColdHeaux",
                    "id": "grr798t",
                    "parent_id": "t1_grr6pto",
                    "score": 19,
                    "created_utc": 1616370245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can see that perspective. I also know I’ve had three separate sb’s request a transition to vanilla. Which has been exactly what I did not want post divorce. I can’t put my finger on any reasoning but for me its maybe 1/3rd the time what happens. I feel like there’s no way for me to type all that without coming off pompous. So there it is. I read this as what it is. Because It does happen.",
            "author": "JamesGarrison",
            "id": "grr28oy",
            "parent_id": "t1_grqv7h9",
            "score": 3,
            "created_utc": 1616367712.0,
            "replies": [
                {
                    "body": "I'm not saying the situation is impossible actually- I'm saying the style of writing and what was mentioned/not mentioned seems like a guy writing it. Just a feeling.",
                    "author": "ColdHeaux",
                    "id": "grr2m1k",
                    "parent_id": "t1_grr28oy",
                    "score": 10,
                    "created_utc": 1616367898.0,
                    "replies": [
                        {
                            "body": "I felt like it was a woman. Who mentioned she enjoyed his well written bio. I imagine this is her attempting something similar. It wasn’t particularly well worded or to the point. Kind of carried on. Like someone who wanted to write well would and exactly how they’d fail. Words chosen for the amount of syllables than passion. So I took it as more of a post that someone took as a writing challenge more than anything.",
                            "author": "JamesGarrison",
                            "id": "grr35qf",
                            "parent_id": "t1_grr2m1k",
                            "score": -1,
                            "created_utc": 1616368172.0,
                            "replies": [
                                {
                                    "body": "Also \"I've spent less than a year with this man I immediately moved in with that I'm madly in love with and now I'm more analytical\" is WAY more male fantasy than female fantasy. Not to mention, any SB or even aspiring SB would at least hint at the fact that their concern for their safety came up. A HUGE theme in SB success stories is us mentioning how this person put us at ease about our safety. It's something not all SDs even have cross their mind. But all women worry about it. It always comes up for us. But it's not romantic enough for a man to include in his story.\n\nLike I said- I just have a very strong feeling.",
                                    "author": "ColdHeaux",
                                    "id": "grr67x1",
                                    "parent_id": "t1_grr35qf",
                                    "score": 13,
                                    "created_utc": 1616369729.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agree to disagree. I feel 100% strongly this was a man on a throwaway account. If it was a woman on the sub who was verifiably a woman, she'd have no reason not to use her own account.",
                                    "author": "ColdHeaux",
                                    "id": "grr4qeq",
                                    "parent_id": "t1_grr35qf",
                                    "score": 11,
                                    "created_utc": 1616368968.0,
                                    "replies": []
                                },
                                {
                                    "body": "Although you are also correct that this person isn't a good writer, it's writing that reads VERY much like a 50 year old man trying to write as a woman and how he thinks we view SDs. Also \"He reached out shortly with a clever message referencing something in my bio\" is so fucking self congratulatory it's painful lol.",
                                    "author": "ColdHeaux",
                                    "id": "grr4w3k",
                                    "parent_id": "t1_grr35qf",
                                    "score": 8,
                                    "created_utc": 1616369050.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah, good point.",
            "author": "buttery_bees",
            "id": "grrbh9s",
            "parent_id": "t1_grrbc00",
            "score": 2,
            "created_utc": 1616372461.0,
            "replies": []
        },
        {
            "body": "maybe she meant luxurious but the phone autocorrected? 😂",
            "author": "annanice",
            "id": "gs15ya4",
            "parent_id": "t1_grrbc00",
            "score": 1,
            "created_utc": 1616580602.0,
            "replies": []
        },
        {
            "body": "Not just the use of them,  but the inappropriate/incorrect use of them. It's like someone used a dictionary or thesaurus to look up synonyms without understanding proper use of the big words they see listed as a synonym.",
            "author": "SLF921019",
            "id": "grrb2gd",
            "parent_id": "t1_grr9yhx",
            "score": 33,
            "created_utc": 1616372244.0,
            "replies": [
                {
                    "body": "This was bothering me the whole time.  Thank you.",
                    "author": "sugarintherawr",
                    "id": "grrjnlc",
                    "parent_id": "t1_grrb2gd",
                    "score": 14,
                    "created_utc": 1616376577.0,
                    "replies": [
                        {
                            "body": "This stuff always reminds me of Damon Wayans' character \"Oswald Bates\" from \"In Living Color\"\n\nhttps://youtu.be/71xxvp5R9hE",
                            "author": "SLF921019",
                            "id": "grrq7so",
                            "parent_id": "t1_grrjnlc",
                            "score": 7,
                            "created_utc": 1616380016.0,
                            "replies": [
                                {
                                    "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
                                    "author": "sugarintherawr",
                                    "id": "grrqmx0",
                                    "parent_id": "t1_grrq7so",
                                    "score": 2,
                                    "created_utc": 1616380245.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Most 25 years old I know, my friend group and some friends at SA doesn't write like that too. Sketchy....",
            "author": "Champagne_bitch",
            "id": "grra2ir",
            "parent_id": "t1_grr9yhx",
            "score": 13,
            "created_utc": 1616371721.0,
            "replies": [
                {
                    "body": "Maybe she really does just need someone way older. A true old soul. Who knows 🤷🏻‍♂️",
                    "author": "Color_Me_Blue",
                    "id": "grra8ud",
                    "parent_id": "t1_grra2ir",
                    "score": 11,
                    "created_utc": 1616371811.0,
                    "replies": [
                        {
                            "body": "Lmao, let's be honest. Do you want to fuck a 50 years old?\nLike, he is 50 years old, managing a firm and doesn't have wife or children?? Like, never married? I bet that 50 years old guy is actually married and will leave her ass. Saw that happen to some SB.",
                            "author": "Champagne_bitch",
                            "id": "grrcp1b",
                            "parent_id": "t1_grra8ud",
                            "score": 3,
                            "created_utc": 1616373096.0,
                            "replies": [
                                {
                                    "body": "Oh yeah for sure! Lol",
                                    "author": "Color_Me_Blue",
                                    "id": "grtkw84",
                                    "parent_id": "t1_grrcp1b",
                                    "score": 2,
                                    "created_utc": 1616427406.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"her\" 🙄😂",
            "author": "BlueJayJay82",
            "id": "grrli82",
            "parent_id": "t1_grr9yhx",
            "score": 5,
            "created_utc": 1616377522.0,
            "replies": [
                {
                    "body": "Why is that funny? lol",
                    "author": "Color_Me_Blue",
                    "id": "grrlvxc",
                    "parent_id": "t1_grrli82",
                    "score": 2,
                    "created_utc": 1616377717.0,
                    "replies": [
                        {
                            "body": "I’d def place my bets on it being some weird SD writing fanfiction lol",
                            "author": "Clektr",
                            "id": "grrzevi",
                            "parent_id": "t1_grrlvxc",
                            "score": 6,
                            "created_utc": 1616385572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or is impressed that his bio \"was like Shakespeare prose.\" First of all, what does that actually mean? \"Many of Shakespeare's low-class characters speak in prose to distinguish themselves from the higher-class, verse-speaking characters.\" I'm assuming they didn't mean that. Also, prose itself basically means any writing that uses sentences and paragraphs and not metrical structure. So what is OP saying it was like? Even if it was just supposed to be written well, what was written well about it? I feel like that's a man trying and failing to figure out how to write what would be attractive to an SB about a SD's bio and just keeping it vague enough to fit.\n\nNot to mention OP's account was seemingly created today for this exact post- presumably because their own account would have made it obvious they were not a SB lol. And again, the fact that OP refers to themself as \"more analytical\" due to this one year and three cats of experience with this man, is absolutely hilarious.",
            "author": "ColdHeaux",
            "id": "grr798t",
            "parent_id": "t1_grr6pto",
            "score": 19,
            "created_utc": 1616370245.0,
            "replies": []
        },
        {
            "body": "I'm not saying the situation is impossible actually- I'm saying the style of writing and what was mentioned/not mentioned seems like a guy writing it. Just a feeling.",
            "author": "ColdHeaux",
            "id": "grr2m1k",
            "parent_id": "t1_grr28oy",
            "score": 10,
            "created_utc": 1616367898.0,
            "replies": [
                {
                    "body": "I felt like it was a woman. Who mentioned she enjoyed his well written bio. I imagine this is her attempting something similar. It wasn’t particularly well worded or to the point. Kind of carried on. Like someone who wanted to write well would and exactly how they’d fail. Words chosen for the amount of syllables than passion. So I took it as more of a post that someone took as a writing challenge more than anything.",
                    "author": "JamesGarrison",
                    "id": "grr35qf",
                    "parent_id": "t1_grr2m1k",
                    "score": -1,
                    "created_utc": 1616368172.0,
                    "replies": [
                        {
                            "body": "Also \"I've spent less than a year with this man I immediately moved in with that I'm madly in love with and now I'm more analytical\" is WAY more male fantasy than female fantasy. Not to mention, any SB or even aspiring SB would at least hint at the fact that their concern for their safety came up. A HUGE theme in SB success stories is us mentioning how this person put us at ease about our safety. It's something not all SDs even have cross their mind. But all women worry about it. It always comes up for us. But it's not romantic enough for a man to include in his story.\n\nLike I said- I just have a very strong feeling.",
                            "author": "ColdHeaux",
                            "id": "grr67x1",
                            "parent_id": "t1_grr35qf",
                            "score": 13,
                            "created_utc": 1616369729.0,
                            "replies": []
                        },
                        {
                            "body": "Agree to disagree. I feel 100% strongly this was a man on a throwaway account. If it was a woman on the sub who was verifiably a woman, she'd have no reason not to use her own account.",
                            "author": "ColdHeaux",
                            "id": "grr4qeq",
                            "parent_id": "t1_grr35qf",
                            "score": 11,
                            "created_utc": 1616368968.0,
                            "replies": []
                        },
                        {
                            "body": "Although you are also correct that this person isn't a good writer, it's writing that reads VERY much like a 50 year old man trying to write as a woman and how he thinks we view SDs. Also \"He reached out shortly with a clever message referencing something in my bio\" is so fucking self congratulatory it's painful lol.",
                            "author": "ColdHeaux",
                            "id": "grr4w3k",
                            "parent_id": "t1_grr35qf",
                            "score": 8,
                            "created_utc": 1616369050.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This was bothering me the whole time.  Thank you.",
            "author": "sugarintherawr",
            "id": "grrjnlc",
            "parent_id": "t1_grrb2gd",
            "score": 14,
            "created_utc": 1616376577.0,
            "replies": [
                {
                    "body": "This stuff always reminds me of Damon Wayans' character \"Oswald Bates\" from \"In Living Color\"\n\nhttps://youtu.be/71xxvp5R9hE",
                    "author": "SLF921019",
                    "id": "grrq7so",
                    "parent_id": "t1_grrjnlc",
                    "score": 7,
                    "created_utc": 1616380016.0,
                    "replies": [
                        {
                            "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
                            "author": "sugarintherawr",
                            "id": "grrqmx0",
                            "parent_id": "t1_grrq7so",
                            "score": 2,
                            "created_utc": 1616380245.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe she really does just need someone way older. A true old soul. Who knows 🤷🏻‍♂️",
            "author": "Color_Me_Blue",
            "id": "grra8ud",
            "parent_id": "t1_grra2ir",
            "score": 11,
            "created_utc": 1616371811.0,
            "replies": [
                {
                    "body": "Lmao, let's be honest. Do you want to fuck a 50 years old?\nLike, he is 50 years old, managing a firm and doesn't have wife or children?? Like, never married? I bet that 50 years old guy is actually married and will leave her ass. Saw that happen to some SB.",
                    "author": "Champagne_bitch",
                    "id": "grrcp1b",
                    "parent_id": "t1_grra8ud",
                    "score": 3,
                    "created_utc": 1616373096.0,
                    "replies": [
                        {
                            "body": "Oh yeah for sure! Lol",
                            "author": "Color_Me_Blue",
                            "id": "grtkw84",
                            "parent_id": "t1_grrcp1b",
                            "score": 2,
                            "created_utc": 1616427406.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why is that funny? lol",
            "author": "Color_Me_Blue",
            "id": "grrlvxc",
            "parent_id": "t1_grrli82",
            "score": 2,
            "created_utc": 1616377717.0,
            "replies": [
                {
                    "body": "I’d def place my bets on it being some weird SD writing fanfiction lol",
                    "author": "Clektr",
                    "id": "grrzevi",
                    "parent_id": "t1_grrlvxc",
                    "score": 6,
                    "created_utc": 1616385572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I felt like it was a woman. Who mentioned she enjoyed his well written bio. I imagine this is her attempting something similar. It wasn’t particularly well worded or to the point. Kind of carried on. Like someone who wanted to write well would and exactly how they’d fail. Words chosen for the amount of syllables than passion. So I took it as more of a post that someone took as a writing challenge more than anything.",
            "author": "JamesGarrison",
            "id": "grr35qf",
            "parent_id": "t1_grr2m1k",
            "score": -1,
            "created_utc": 1616368172.0,
            "replies": [
                {
                    "body": "Also \"I've spent less than a year with this man I immediately moved in with that I'm madly in love with and now I'm more analytical\" is WAY more male fantasy than female fantasy. Not to mention, any SB or even aspiring SB would at least hint at the fact that their concern for their safety came up. A HUGE theme in SB success stories is us mentioning how this person put us at ease about our safety. It's something not all SDs even have cross their mind. But all women worry about it. It always comes up for us. But it's not romantic enough for a man to include in his story.\n\nLike I said- I just have a very strong feeling.",
                    "author": "ColdHeaux",
                    "id": "grr67x1",
                    "parent_id": "t1_grr35qf",
                    "score": 13,
                    "created_utc": 1616369729.0,
                    "replies": []
                },
                {
                    "body": "Agree to disagree. I feel 100% strongly this was a man on a throwaway account. If it was a woman on the sub who was verifiably a woman, she'd have no reason not to use her own account.",
                    "author": "ColdHeaux",
                    "id": "grr4qeq",
                    "parent_id": "t1_grr35qf",
                    "score": 11,
                    "created_utc": 1616368968.0,
                    "replies": []
                },
                {
                    "body": "Although you are also correct that this person isn't a good writer, it's writing that reads VERY much like a 50 year old man trying to write as a woman and how he thinks we view SDs. Also \"He reached out shortly with a clever message referencing something in my bio\" is so fucking self congratulatory it's painful lol.",
                    "author": "ColdHeaux",
                    "id": "grr4w3k",
                    "parent_id": "t1_grr35qf",
                    "score": 8,
                    "created_utc": 1616369050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This stuff always reminds me of Damon Wayans' character \"Oswald Bates\" from \"In Living Color\"\n\nhttps://youtu.be/71xxvp5R9hE",
            "author": "SLF921019",
            "id": "grrq7so",
            "parent_id": "t1_grrjnlc",
            "score": 7,
            "created_utc": 1616380016.0,
            "replies": [
                {
                    "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
                    "author": "sugarintherawr",
                    "id": "grrqmx0",
                    "parent_id": "t1_grrq7so",
                    "score": 2,
                    "created_utc": 1616380245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao, let's be honest. Do you want to fuck a 50 years old?\nLike, he is 50 years old, managing a firm and doesn't have wife or children?? Like, never married? I bet that 50 years old guy is actually married and will leave her ass. Saw that happen to some SB.",
            "author": "Champagne_bitch",
            "id": "grrcp1b",
            "parent_id": "t1_grra8ud",
            "score": 3,
            "created_utc": 1616373096.0,
            "replies": [
                {
                    "body": "Oh yeah for sure! Lol",
                    "author": "Color_Me_Blue",
                    "id": "grtkw84",
                    "parent_id": "t1_grrcp1b",
                    "score": 2,
                    "created_utc": 1616427406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d def place my bets on it being some weird SD writing fanfiction lol",
            "author": "Clektr",
            "id": "grrzevi",
            "parent_id": "t1_grrlvxc",
            "score": 6,
            "created_utc": 1616385572.0,
            "replies": []
        },
        {
            "body": "Also \"I've spent less than a year with this man I immediately moved in with that I'm madly in love with and now I'm more analytical\" is WAY more male fantasy than female fantasy. Not to mention, any SB or even aspiring SB would at least hint at the fact that their concern for their safety came up. A HUGE theme in SB success stories is us mentioning how this person put us at ease about our safety. It's something not all SDs even have cross their mind. But all women worry about it. It always comes up for us. But it's not romantic enough for a man to include in his story.\n\nLike I said- I just have a very strong feeling.",
            "author": "ColdHeaux",
            "id": "grr67x1",
            "parent_id": "t1_grr35qf",
            "score": 13,
            "created_utc": 1616369729.0,
            "replies": []
        },
        {
            "body": "Agree to disagree. I feel 100% strongly this was a man on a throwaway account. If it was a woman on the sub who was verifiably a woman, she'd have no reason not to use her own account.",
            "author": "ColdHeaux",
            "id": "grr4qeq",
            "parent_id": "t1_grr35qf",
            "score": 11,
            "created_utc": 1616368968.0,
            "replies": []
        },
        {
            "body": "Although you are also correct that this person isn't a good writer, it's writing that reads VERY much like a 50 year old man trying to write as a woman and how he thinks we view SDs. Also \"He reached out shortly with a clever message referencing something in my bio\" is so fucking self congratulatory it's painful lol.",
            "author": "ColdHeaux",
            "id": "grr4w3k",
            "parent_id": "t1_grr35qf",
            "score": 8,
            "created_utc": 1616369050.0,
            "replies": []
        },
        {
            "body": "hahahahahahaha 😂\n\n💜 thank you 💛",
            "author": "sugarintherawr",
            "id": "grrqmx0",
            "parent_id": "t1_grrq7so",
            "score": 2,
            "created_utc": 1616380245.0,
            "replies": []
        },
        {
            "body": "Oh yeah for sure! Lol",
            "author": "Color_Me_Blue",
            "id": "grtkw84",
            "parent_id": "t1_grrcp1b",
            "score": 2,
            "created_utc": 1616427406.0,
            "replies": []
        }
    ]
}