{
    "title": "Not so humble brag",
    "post_id": "ozbacr",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ozbacr/not_so_humble_brag/",
    "author": "dutchNfrenchHoe",
    "body": "My birthday was marvellous, all thanks to my SD.\nHe took me to South of France for a few days, biggest suite in a luxury hotel, we went to dinner and along some jewellery and two other gifts, he gave me xx,xxx£ to invest in whatever I want over a few years period. \n\nOur 1-year anniversary is coming soon and I plan to take him horseriding on my dime (he hasn’t been on a horse since he turned 13) with a personalised gift. \n\nToday I told him I may get to study abroad for 6 months and I asked him if he wanted to end it. He said no, we’re in it for the long term. So he’ll come visit me once every month/whenever his job allows him to and there is no change in my allowance despite the huge frequency drop (we see each other 4-8 times a month usually). He isn’t perfect, but our SR pretty much is.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ozbacr/not_so_humble_brag/",
    "score": 183,
    "upvote_ratio": 0.93,
    "created_utc": 1628270746.0,
    "num_comments": 86,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "✨Faith in traditional SR restored✨\nLove this for you!",
            "author": "Throwawy34567",
            "id": "h7yjyot",
            "parent_id": "t3_ozbacr",
            "score": 60,
            "created_utc": 1628271449.0,
            "replies": [
                {
                    "body": "Youre so right, it's rare to see a more traditional SR story on SLF so this is really nice! Congrats to OP, this sounds like a wonderful and fun SR :)",
                    "author": "galactosegirl",
                    "id": "h7zrym2",
                    "parent_id": "t1_h7yjyot",
                    "score": 13,
                    "created_utc": 1628291062.0,
                    "replies": []
                },
                {
                    "body": "I don't see why a relationship has to end just because she moves, which is short-term.  They have a real SD/SB relationship.",
                    "author": "Darknlovely38",
                    "id": "h7yxy0r",
                    "parent_id": "t1_h7yjyot",
                    "score": 10,
                    "created_utc": 1628277428.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you got a whale! Congrats :)",
            "author": null,
            "id": "h7ywuug",
            "parent_id": "t3_ozbacr",
            "score": 20,
            "created_utc": 1628276959.0,
            "replies": [
                {
                    "body": "Don’t think he’s a whale. He has a lower-end 8 figures stock portfolio, a few properties and some shares in his fund, which is obviously a lot but he’s not private jet-wealthy.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7yy81o",
                    "parent_id": "t1_h7ywuug",
                    "score": 6,
                    "created_utc": 1628277548.0,
                    "replies": [
                        {
                            "body": "I would definitely call that a whale! Maybe not in terms of his net worth (which is still in the .01th percentile), but what he is willing to spend on you.",
                            "author": "drleeisinsurgery",
                            "id": "h7z1dob",
                            "parent_id": "t1_h7yy81o",
                            "score": 28,
                            "created_utc": 1628278939.0,
                            "replies": [
                                {
                                    "body": "Agreed and needs repeating for the newbies and  fence sitters reading. SD Guy’s net worth is minimum $10-20 million with earned income of at least $500K. More important is the unearned income from investments. 3% of that is at least $300K. So yes there are whale SDs with more net worth and higher income. But OP’s can easily spend $10K a month on her allowance and add more gifts etc., totaling over $150K a year in value to her. OP might bank significantly more than this. We don’t know how generous her SD chose to be in their negotiations but the theoretical capability is extraordinary even if he’s not worth $50 million or more like a “true whale”. Extraordinary because 90% or more of SBs look at a few thousand a month, or less than $60K a year. And their SDs have a net worth of less than $10 million.   Don’t think I have broken forum rules in speaking so speculatively and generally with dollar numbers about worth and allowance. However seems to me this kind of info is basic to a realistic understanding of what one can expect in the sugar bowl.  Adding that whale-ish SDs don’t (to repeat posters on here) need to, or hardly ever want to, lavish their SBs with all the coin that they “could afford” to drop.",
                                    "author": "jacknjilled",
                                    "id": "h7zm347",
                                    "parent_id": "t1_h7z1dob",
                                    "score": 10,
                                    "created_utc": 1628288235.0,
                                    "replies": []
                                },
                                {
                                    "body": "To be fair, I think what is considered a whale varies depending on your location. 1 million dollars in New York and 1 million in Milan give you two different lifestyles even though both are cosmopolitan cities. Where I live, his salary puts him in the 0.01%. I guess he wouldn’t be hot stuff in LA.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z3kwc",
                                    "parent_id": "t1_h7z1dob",
                                    "score": 2,
                                    "created_utc": 1628279896.0,
                                    "replies": [
                                        {
                                            "body": "I don’t think you realize that most SD’s don’t take their SB’s to the south of France, then gift them jewelry and xx,xxx for their investment account. Read all the stories on here, a lot of girls are lucky if their SD pays their ppm on time or doesn’t want to meet in a creepy basement office lol. \n\nYou’re definitely lucky and you have a whale SD even if you don’t think you do. Whatever he is spending on you is probably more than what 99% of most SB’s get on SA.",
                                            "author": null,
                                            "id": "h7z7vzw",
                                            "parent_id": "t1_h7z3kwc",
                                            "score": 31,
                                            "created_utc": 1628281806.0,
                                            "replies": [
                                                {
                                                    "body": "This is my second successful SR. \nMy ex gave me similar things (the investment gift is huge though, I’ll admit it) and introduced me to the lifestyle. What’s that English expression again.. struck lightning twice? I should try my luck at the lottery!",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7z9dvu",
                                                    "parent_id": "t1_h7z7vzw",
                                                    "score": 6,
                                                    "created_utc": 1628282472.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
                                                            "author": null,
                                                            "id": "h7z9ka6",
                                                            "parent_id": "t1_h7z9dvu",
                                                            "score": 5,
                                                            "created_utc": 1628282552.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Creepy basement office sounds interesting. I might have to up my game. 😁",
                                                    "author": "ChapterRelative",
                                                    "id": "h7zhjr4",
                                                    "parent_id": "t1_h7z7vzw",
                                                    "score": 0,
                                                    "created_utc": 1628286134.0,
                                                    "replies": [
                                                        {
                                                            "body": "Gotta step our creep game up lol.",
                                                            "author": null,
                                                            "id": "h7zkaov",
                                                            "parent_id": "t1_h7zhjr4",
                                                            "score": 1,
                                                            "created_utc": 1628287393.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Hope my SB doesn't read this, she'll be jealous. I rent a house for her in a good neighborhood, paid for a used luxury car plus a few thousand for spending cash, but we've certainly never gone on lavish vacations nor have I gotten her if 5 figure gifts At this point she's more of a second wife after over 10 years.",
                                            "author": "drleeisinsurgery",
                                            "id": "h7zgxii",
                                            "parent_id": "t1_h7z3kwc",
                                            "score": 7,
                                            "created_utc": 1628285853.0,
                                            "replies": [
                                                {
                                                    "body": "That’s sweet. You sound sweet. 10 years is amazing and you both being happy is the most important.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7ziehx",
                                                    "parent_id": "t1_h7zgxii",
                                                    "score": 7,
                                                    "created_utc": 1628286525.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Milan v New York is interesting. I would have thought they were similar in terms of cost. Is Milan much cheaper? Maybe it's time to move.",
                                            "author": "ChapterRelative",
                                            "id": "h7z6gqk",
                                            "parent_id": "t1_h7z3kwc",
                                            "score": 2,
                                            "created_utc": 1628281166.0,
                                            "replies": [
                                                {
                                                    "body": "Milan is the most expensive place in Italy, but it’s cheaper than New York to live in. The most significant expense there is rent, but everything else is alright. 100€/month on groceries, 130€/month for utilities (water, electricity, internet, heating). The South of Europe, along Eastern Europe are pretty cheap to live in.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7z7978",
                                                    "parent_id": "t1_h7z6gqk",
                                                    "score": 3,
                                                    "created_utc": 1628281520.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Agreed. I would think Milan is a pretty expensive City to live in.",
                                                    "author": null,
                                                    "id": "h7z7cc3",
                                                    "parent_id": "t1_h7z6gqk",
                                                    "score": 1,
                                                    "created_utc": 1628281558.0,
                                                    "replies": [
                                                        {
                                                            "body": "Of course, what do we know, we're splenda!",
                                                            "author": "ChapterRelative",
                                                            "id": "h7z7gx7",
                                                            "parent_id": "t1_h7z7cc3",
                                                            "score": 1,
                                                            "created_utc": 1628281617.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Splenda and dumb lol.",
                                                                    "author": null,
                                                                    "id": "h7z80dh",
                                                                    "parent_id": "t1_h7z7gx7",
                                                                    "score": 3,
                                                                    "created_utc": 1628281862.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                                                                            "author": "ChapterRelative",
                                                                            "id": "h7z8huz",
                                                                            "parent_id": "t1_h7z80dh",
                                                                            "score": 1,
                                                                            "created_utc": 1628282076.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                                                                    "author": "dutchNfrenchHoe",
                                                                                    "id": "h7zatf0",
                                                                                    "parent_id": "t1_h7z8huz",
                                                                                    "score": 6,
                                                                                    "created_utc": 1628283103.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                                                                            "author": "ChapterRelative",
                                                                                            "id": "h7zbkq2",
                                                                                            "parent_id": "t1_h7zatf0",
                                                                                            "score": 2,
                                                                                            "created_utc": 1628283437.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "That's not a whale. Reality check.",
                                    "author": "princesspoppy77",
                                    "id": "h7z2up5",
                                    "parent_id": "t1_h7z1dob",
                                    "score": -6,
                                    "created_utc": 1628279576.0,
                                    "replies": [
                                        {
                                            "body": "No need to be rude.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7z3le0",
                                            "parent_id": "t1_h7z2up5",
                                            "score": 8,
                                            "created_utc": 1628279902.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "h7z4mz9",
                                                    "parent_id": "t1_h7z3le0",
                                                    "score": -3,
                                                    "created_utc": 1628280357.0,
                                                    "replies": [
                                                        {
                                                            "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h7z4rt2",
                                                            "parent_id": "t1_h7z4mz9",
                                                            "score": 11,
                                                            "created_utc": 1628280416.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                                                                    "author": "xofcups",
                                                                    "id": "h7z6re0",
                                                                    "parent_id": "t1_h7z4rt2",
                                                                    "score": 6,
                                                                    "created_utc": 1628281300.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "🥺 aw, thank you!!!",
                                                                            "author": "dutchNfrenchHoe",
                                                                            "id": "h7z7cj2",
                                                                            "parent_id": "t1_h7z6re0",
                                                                            "score": 2,
                                                                            "created_utc": 1628281560.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                                                                    "author": "princesspoppy77",
                                                                    "id": "h7z9caz",
                                                                    "parent_id": "t1_h7z4rt2",
                                                                    "score": -5,
                                                                    "created_utc": 1628282452.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No, you really were being condescending. You still are.",
                                                                            "author": "Cdnsugarr",
                                                                            "id": "h7zfrxt",
                                                                            "parent_id": "t1_h7z9caz",
                                                                            "score": 4,
                                                                            "created_utc": 1628285331.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Agreed.",
                                    "author": null,
                                    "id": "h7z7wo3",
                                    "parent_id": "t1_h7z1dob",
                                    "score": 1,
                                    "created_utc": 1628281815.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "there aren't that many men with 8 figure stock portfolios so yes, he's a whale, holy shit.",
                            "author": "Persianx6",
                            "id": "h82nls4",
                            "parent_id": "t1_h7yy81o",
                            "score": 4,
                            "created_utc": 1628355501.0,
                            "replies": []
                        },
                        {
                            "body": "Oh so he is middle class?",
                            "author": null,
                            "id": "h801j4n",
                            "parent_id": "t1_h7yy81o",
                            "score": -1,
                            "created_utc": 1628296031.0,
                            "replies": [
                                {
                                    "body": "Middle class men shouldn’t be trying to be SDs. There’s a huge range between middle class and “whale” and he is on the higher-end of the middle of the spectrum.\n\nI always thought a “whale” was someone extremely wealthy, but maybe I’m wrong.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h803emt",
                                    "parent_id": "t1_h801j4n",
                                    "score": 6,
                                    "created_utc": 1628297134.0,
                                    "replies": [
                                        {
                                            "body": "With the way you talk of him and his wealth here, perhaps you'll soon find out if you think he's not good enough because he's not flying private.",
                                            "author": "Persianx6",
                                            "id": "h82odq8",
                                            "parent_id": "t1_h803emt",
                                            "score": 1,
                                            "created_utc": 1628355862.0,
                                            "replies": [
                                                {
                                                    "body": "I travel with him all the time and we usually fly business, not first-class. He automatically gets an upgrade for flights, trains and hotels. This time he willingly took the most expensive room for my birthday, but it’s not a recurring thing. I’m very happy with him and our relationship and we’ve been together for almost a year.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h82p09l",
                                                    "parent_id": "t1_h82odq8",
                                                    "score": 4,
                                                    "created_utc": 1628356156.0,
                                                    "replies": [
                                                        {
                                                            "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
                                                            "author": "Persianx6",
                                                            "id": "h82r2q3",
                                                            "parent_id": "t1_h82p09l",
                                                            "score": 1,
                                                            "created_utc": 1628357116.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You are projecting.",
                                                                    "author": "dutchNfrenchHoe",
                                                                    "id": "h82r6tf",
                                                                    "parent_id": "t1_h82r2q3",
                                                                    "score": 6,
                                                                    "created_utc": 1628357168.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                                                                            "author": "Persianx6",
                                                                            "id": "h82rufg",
                                                                            "parent_id": "t1_h82r6tf",
                                                                            "score": 0,
                                                                            "created_utc": 1628357469.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                                                                    "author": null,
                                                                                    "id": "h83kp0a",
                                                                                    "parent_id": "t1_h82rufg",
                                                                                    "score": 1,
                                                                                    "created_utc": 1628371289.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "8 figures is still good :)",
                            "author": null,
                            "id": "h7yzqgq",
                            "parent_id": "t1_h7yy81o",
                            "score": 1,
                            "created_utc": 1628278208.0,
                            "replies": []
                        },
                        {
                            "body": "How do you know so much about him?",
                            "author": null,
                            "id": "h81uydj",
                            "parent_id": "t1_h7yy81o",
                            "score": 1,
                            "created_utc": 1628341094.0,
                            "replies": [
                                {
                                    "body": "We talk.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h81ylqp",
                                    "parent_id": "t1_h81uydj",
                                    "score": 4,
                                    "created_utc": 1628343217.0,
                                    "replies": [
                                        {
                                            "body": "Very unusual for truly wealthy guys to go bonkers on their wealth details especially to folks who they are in an obvious transient relationship with.",
                                            "author": null,
                                            "id": "h81zhzj",
                                            "parent_id": "t1_h81ylqp",
                                            "score": 1,
                                            "created_utc": 1628343718.0,
                                            "replies": [
                                                {
                                                    "body": "We are beyond a “transient relationship”. I’ll tell you even more:\n1. I know where he works and have been to his office multiple times. I also travel with him —when I’m not too busy with college,  for work. So he’ll have his meetings, I’ll be chilling at the Champs-Elysées or at the Piazza del Popolo (or wherever he needs to go) and we’ll spend time together in the morning and evening. \n2. He’s “Googleable”.\n3. I’ve seen some of his tax returns. It was actually accidental, we were chilling in bed and I asked him what he was carrying in his backpack. He said some work documents. I asked if I could take a look, he told me to go ahead. I accidentally picked his personal folder, not the work one and only realised when I saw one of his dividends returns, but I put it back immediately.\n4. He eventually wants children with me, which I don’t, but would I say yes, the following would be put in a contract and revised by a lawyer of my choosing —the lawyer fees would indirectly be paid by him:\n* I get a house, although the usufruit, the nue-propriété will go to the child\n* His wealth will be equally divided amongst the children, with a set trust fund, for which I’ll be responsible for until they turn 18. He’ll live off the dividends his portfolio returns, and leave the rest behind to his children. So that’s 8 figures split amongst 1-3 kids.\n5. He has proposed to move me into one of said properties. I refused because I’d rather live close to campus and like the student experience. \n\nFree of you not to believe me!",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h820i2i",
                                                    "parent_id": "t1_h81zhzj",
                                                    "score": 7,
                                                    "created_utc": 1628344261.0,
                                                    "replies": [
                                                        {
                                                            "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
                                                            "author": null,
                                                            "id": "h82an8r",
                                                            "parent_id": "t1_h820i2i",
                                                            "score": 2,
                                                            "created_utc": 1628349403.0,
                                                            "replies": [
                                                                {
                                                                    "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                                                                    "author": "dutchNfrenchHoe",
                                                                    "id": "h82ba9h",
                                                                    "parent_id": "t1_h82an8r",
                                                                    "score": 8,
                                                                    "created_utc": 1628349709.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Pretty accurate.",
                                                                            "author": "BlissfulSB",
                                                                            "id": "h82qrlo",
                                                                            "parent_id": "t1_h82ba9h",
                                                                            "score": 5,
                                                                            "created_utc": 1628356972.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                                                                            "author": null,
                                                                            "id": "h82dh6c",
                                                                            "parent_id": "t1_h82ba9h",
                                                                            "score": -1,
                                                                            "created_utc": 1628350750.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                                                                    "author": "dutchNfrenchHoe",
                                                                                    "id": "h82feu8",
                                                                                    "parent_id": "t1_h82dh6c",
                                                                                    "score": 10,
                                                                                    "created_utc": 1628351666.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "h82r7mf",
                                                                                            "parent_id": "t1_h82feu8",
                                                                                            "score": 8,
                                                                                            "created_utc": 1628357178.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                                                                    "author": "dutchNfrenchHoe",
                                                                                                    "id": "h82rzx2",
                                                                                                    "parent_id": "t1_h82r7mf",
                                                                                                    "score": 6,
                                                                                                    "created_utc": 1628357539.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "h82r0ee",
                                                                                    "parent_id": "t1_h82dh6c",
                                                                                    "score": 7,
                                                                                    "created_utc": 1628357085.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                                                                            "author": null,
                                                                                            "id": "h83jnns",
                                                                                            "parent_id": "t1_h82r0ee",
                                                                                            "score": 0,
                                                                                            "created_utc": 1628370777.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You go, girl, that's an SD!",
            "author": "Darknlovely38",
            "id": "h7yxkva",
            "parent_id": "t3_ozbacr",
            "score": 5,
            "created_utc": 1628277270.0,
            "replies": []
        },
        {
            "body": "Oh my god that is so so so so lucky!! I wish I had that kind of luck :) all the best for you and this man!",
            "author": "lost-wanderess",
            "id": "h824jav",
            "parent_id": "t3_ozbacr",
            "score": 4,
            "created_utc": 1628346376.0,
            "replies": []
        },
        {
            "body": "I love that for you! I hope all sugar babies find a SD like this! We deserve it!!!",
            "author": "whatifitdoescometrue",
            "id": "h81r907",
            "parent_id": "t3_ozbacr",
            "score": 4,
            "created_utc": 1628338783.0,
            "replies": []
        },
        {
            "body": "And I have been searching for a SD without any luck 😪😪😪",
            "author": "AmbitiousValuable7",
            "id": "h82dt0u",
            "parent_id": "t3_ozbacr",
            "score": 3,
            "created_utc": 1628350908.0,
            "replies": []
        },
        {
            "body": "I love that for you! I hope all sugar babies find a SD like this! We deserve it!!!",
            "author": "whatifitdoescometrue",
            "id": "h81r8mc",
            "parent_id": "t3_ozbacr",
            "score": 3,
            "created_utc": 1628338776.0,
            "replies": []
        },
        {
            "body": "Omg :(",
            "author": null,
            "id": "h86gzds",
            "parent_id": "t3_ozbacr",
            "score": 3,
            "created_utc": 1628437403.0,
            "replies": []
        },
        {
            "body": "Beautiful. I love hearing stories like this ❤️",
            "author": "SugaBabyBlue",
            "id": "h7yl6ka",
            "parent_id": "t3_ozbacr",
            "score": 5,
            "created_utc": 1628271960.0,
            "replies": []
        },
        {
            "body": "What’s not perfect about him??!!",
            "author": "sanfran4fun",
            "id": "h7z7qj2",
            "parent_id": "t3_ozbacr",
            "score": 3,
            "created_utc": 1628281737.0,
            "replies": [
                {
                    "body": "Eh... he has his issues trust me 😅",
                    "author": "dutchNfrenchHoe",
                    "id": "h82fkry",
                    "parent_id": "t1_h7z7qj2",
                    "score": 3,
                    "created_utc": 1628351744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s amazing. I can’t wait to get a hold of my own whale.",
            "author": "glitteryandsparkles",
            "id": "h7zctaa",
            "parent_id": "t3_ozbacr",
            "score": 4,
            "created_utc": 1628283992.0,
            "replies": [
                {
                    "body": "(I don’t consider mine a whale but) I wish it to you. I wish it an amazing SR to every single SB in this sub.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7zd9jt",
                    "parent_id": "t1_h7zctaa",
                    "score": 3,
                    "created_utc": 1628284198.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is a proper SD, and you must one hell of sugar baby for him to have chosen you.",
            "author": null,
            "id": "h7zzepr",
            "parent_id": "t3_ozbacr",
            "score": 3,
            "created_utc": 1628294904.0,
            "replies": [
                {
                    "body": "I would love to take that compliment but I’m pretty regular! Thank you though ❤️",
                    "author": "dutchNfrenchHoe",
                    "id": "h803kws",
                    "parent_id": "t1_h7zzepr",
                    "score": 5,
                    "created_utc": 1628297229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very nice!  I had a long-distance SR where I visited every 4-6 weeks for 3-5 days at a time, worked fantastic",
            "author": "Azurecole",
            "id": "h7yl8d0",
            "parent_id": "t3_ozbacr",
            "score": 2,
            "created_utc": 1628271980.0,
            "replies": [
                {
                    "body": "I hope it will work out as well for us. I’d hate for our dynamic to change due to the distance, but it did warm my heart that he wanted to continue.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7ylo3o",
                    "parent_id": "t1_h7yl8d0",
                    "score": 5,
                    "created_utc": 1628272164.0,
                    "replies": [
                        {
                            "body": "This is hard to believe, but our dynamic got stronger -- believe it or don't!  That said, she texted or called every single day.  For both of us, we loved our daily texts or convos, and then when we got together we absolutely cherished the time.  Our time together became even more valuable now that it was more rare... but the communication kept us tight",
                            "author": "Azurecole",
                            "id": "h7ynv56",
                            "parent_id": "t1_h7ylo3o",
                            "score": 1,
                            "created_utc": 1628273097.0,
                            "replies": [
                                {
                                    "body": "I had a long-distance relationship, and it was good because of the daily communication.  He didn't speak English well, so it took a long time over the phone to explain ourselves, which is why I believe our union was strong.  It was the most satisfying relationship I had ever had, and the distance didn't bother me. Unfortunately, I also knew when he cheated on me.  Our relationship was really close.",
                                    "author": "Darknlovely38",
                                    "id": "h7z1x7e",
                                    "parent_id": "t1_h7ynv56",
                                    "score": 1,
                                    "created_utc": 1628279172.0,
                                    "replies": [
                                        {
                                            "body": "I’m sorry girl. How did you know he was cheating?",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7z2q44",
                                            "parent_id": "t1_h7z1x7e",
                                            "score": 3,
                                            "created_utc": 1628279519.0,
                                            "replies": [
                                                {
                                                    "body": "I had a dream, and it disturbed me; when I woke, I sat straight up in my bed, and I and I said to myself, he's cheating.  I knew it in my heart.  So, I got out of bed and called him.  I live in the US; he lived in Germany.  I've only called him twice in our three-year romance because of the expense, but he had a special discount for businesses.  Guess who answered the phone?",
                                                    "author": "Darknlovely38",
                                                    "id": "h7z93s8",
                                                    "parent_id": "t1_h7z2q44",
                                                    "score": 3,
                                                    "created_utc": 1628282347.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m so sorry. Sending you hugs.",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h7zalzi",
                                                            "parent_id": "t1_h7z93s8",
                                                            "score": 3,
                                                            "created_utc": 1628283012.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "How did your arrangement work? Ppm or allowance?",
                    "author": null,
                    "id": "h7yqaxl",
                    "parent_id": "t1_h7yl8d0",
                    "score": 1,
                    "created_utc": 1628274156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please teach me your magic",
            "author": "Sugar-spice85",
            "id": "h7z58ae",
            "parent_id": "t3_ozbacr",
            "score": 2,
            "created_utc": 1628280618.0,
            "replies": [
                {
                    "body": "No magic here, I’m pretty regular.\nI will say, that I have a few things working in my favour in our relationship:\n1. I’m his ideal type physically and intellectually to a T, according to him.\n2. He’s very “fleur bleue”. He wants the long-lasting romance, the passion, the Josephine to his Napoléon. We happen to have amazing chemistry, which he says is rare for him.\n3. This might be controversial and I’m aware the SDs won’t like this but I think an SR is more likely to work if the SD is more into the SB than vice-versa. I really like him, he’s wonderful. But was this relationship to end today, he would take a much harder emotional hit than I would. \n\n\nBut the most important, is probably point 2.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z8hap",
                    "parent_id": "t1_h7z58ae",
                    "score": 13,
                    "created_utc": 1628282070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t tell us, you are in a platonic relationship! That’s what will truly make it a humble brag. Otherwise sounds cool.",
            "author": null,
            "id": "h7yirvh",
            "parent_id": "t3_ozbacr",
            "score": 2,
            "created_utc": 1628270952.0,
            "replies": [
                {
                    "body": "Lol, not at all and I don’t wish for one either. The poor guy kept complaining about an emptied ballsack during the whole trip.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7yj0gi",
                    "parent_id": "t1_h7yirvh",
                    "score": 13,
                    "created_utc": 1628271052.0,
                    "replies": []
                },
                {
                    "body": "That wouldn’t make it a humble brag but a fantasy…",
                    "author": null,
                    "id": "h7yk0g1",
                    "parent_id": "t1_h7yirvh",
                    "score": 4,
                    "created_utc": 1628271469.0,
                    "replies": [
                        {
                            "body": "Yup Tiktok style !! But OPs username is very interesting !!",
                            "author": null,
                            "id": "h7ykgk0",
                            "parent_id": "t1_h7yk0g1",
                            "score": 2,
                            "created_utc": 1628271656.0,
                            "replies": [
                                {
                                    "body": "Yes.  Makes me wonder if she is Belgian.",
                                    "author": null,
                                    "id": "h7ykrqy",
                                    "parent_id": "t1_h7ykgk0",
                                    "score": 3,
                                    "created_utc": 1628271786.0,
                                    "replies": [
                                        {
                                            "body": "Nice catch!",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7ykyci",
                                            "parent_id": "t1_h7ykrqy",
                                            "score": 6,
                                            "created_utc": 1628271865.0,
                                            "replies": [
                                                {
                                                    "body": "Love the Spring Classics and Belgian beers!!",
                                                    "author": null,
                                                    "id": "h7ylj26",
                                                    "parent_id": "t1_h7ykyci",
                                                    "score": 1,
                                                    "created_utc": 1628272105.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "whats his age?",
            "author": "naIamgood",
            "id": "h80rgla",
            "parent_id": "t3_ozbacr",
            "score": 1,
            "created_utc": 1628310436.0,
            "replies": [
                {
                    "body": "He’s 40.",
                    "author": "dutchNfrenchHoe",
                    "id": "h80y9vt",
                    "parent_id": "t1_h80rgla",
                    "score": 5,
                    "created_utc": 1628314962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Youre so right, it's rare to see a more traditional SR story on SLF so this is really nice! Congrats to OP, this sounds like a wonderful and fun SR :)",
            "author": "galactosegirl",
            "id": "h7zrym2",
            "parent_id": "t1_h7yjyot",
            "score": 13,
            "created_utc": 1628291062.0,
            "replies": []
        },
        {
            "body": "I don't see why a relationship has to end just because she moves, which is short-term.  They have a real SD/SB relationship.",
            "author": "Darknlovely38",
            "id": "h7yxy0r",
            "parent_id": "t1_h7yjyot",
            "score": 10,
            "created_utc": 1628277428.0,
            "replies": []
        },
        {
            "body": "Don’t think he’s a whale. He has a lower-end 8 figures stock portfolio, a few properties and some shares in his fund, which is obviously a lot but he’s not private jet-wealthy.",
            "author": "dutchNfrenchHoe",
            "id": "h7yy81o",
            "parent_id": "t1_h7ywuug",
            "score": 6,
            "created_utc": 1628277548.0,
            "replies": [
                {
                    "body": "I would definitely call that a whale! Maybe not in terms of his net worth (which is still in the .01th percentile), but what he is willing to spend on you.",
                    "author": "drleeisinsurgery",
                    "id": "h7z1dob",
                    "parent_id": "t1_h7yy81o",
                    "score": 28,
                    "created_utc": 1628278939.0,
                    "replies": [
                        {
                            "body": "Agreed and needs repeating for the newbies and  fence sitters reading. SD Guy’s net worth is minimum $10-20 million with earned income of at least $500K. More important is the unearned income from investments. 3% of that is at least $300K. So yes there are whale SDs with more net worth and higher income. But OP’s can easily spend $10K a month on her allowance and add more gifts etc., totaling over $150K a year in value to her. OP might bank significantly more than this. We don’t know how generous her SD chose to be in their negotiations but the theoretical capability is extraordinary even if he’s not worth $50 million or more like a “true whale”. Extraordinary because 90% or more of SBs look at a few thousand a month, or less than $60K a year. And their SDs have a net worth of less than $10 million.   Don’t think I have broken forum rules in speaking so speculatively and generally with dollar numbers about worth and allowance. However seems to me this kind of info is basic to a realistic understanding of what one can expect in the sugar bowl.  Adding that whale-ish SDs don’t (to repeat posters on here) need to, or hardly ever want to, lavish their SBs with all the coin that they “could afford” to drop.",
                            "author": "jacknjilled",
                            "id": "h7zm347",
                            "parent_id": "t1_h7z1dob",
                            "score": 10,
                            "created_utc": 1628288235.0,
                            "replies": []
                        },
                        {
                            "body": "To be fair, I think what is considered a whale varies depending on your location. 1 million dollars in New York and 1 million in Milan give you two different lifestyles even though both are cosmopolitan cities. Where I live, his salary puts him in the 0.01%. I guess he wouldn’t be hot stuff in LA.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z3kwc",
                            "parent_id": "t1_h7z1dob",
                            "score": 2,
                            "created_utc": 1628279896.0,
                            "replies": [
                                {
                                    "body": "I don’t think you realize that most SD’s don’t take their SB’s to the south of France, then gift them jewelry and xx,xxx for their investment account. Read all the stories on here, a lot of girls are lucky if their SD pays their ppm on time or doesn’t want to meet in a creepy basement office lol. \n\nYou’re definitely lucky and you have a whale SD even if you don’t think you do. Whatever he is spending on you is probably more than what 99% of most SB’s get on SA.",
                                    "author": null,
                                    "id": "h7z7vzw",
                                    "parent_id": "t1_h7z3kwc",
                                    "score": 31,
                                    "created_utc": 1628281806.0,
                                    "replies": [
                                        {
                                            "body": "This is my second successful SR. \nMy ex gave me similar things (the investment gift is huge though, I’ll admit it) and introduced me to the lifestyle. What’s that English expression again.. struck lightning twice? I should try my luck at the lottery!",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7z9dvu",
                                            "parent_id": "t1_h7z7vzw",
                                            "score": 6,
                                            "created_utc": 1628282472.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
                                                    "author": null,
                                                    "id": "h7z9ka6",
                                                    "parent_id": "t1_h7z9dvu",
                                                    "score": 5,
                                                    "created_utc": 1628282552.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Creepy basement office sounds interesting. I might have to up my game. 😁",
                                            "author": "ChapterRelative",
                                            "id": "h7zhjr4",
                                            "parent_id": "t1_h7z7vzw",
                                            "score": 0,
                                            "created_utc": 1628286134.0,
                                            "replies": [
                                                {
                                                    "body": "Gotta step our creep game up lol.",
                                                    "author": null,
                                                    "id": "h7zkaov",
                                                    "parent_id": "t1_h7zhjr4",
                                                    "score": 1,
                                                    "created_utc": 1628287393.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Hope my SB doesn't read this, she'll be jealous. I rent a house for her in a good neighborhood, paid for a used luxury car plus a few thousand for spending cash, but we've certainly never gone on lavish vacations nor have I gotten her if 5 figure gifts At this point she's more of a second wife after over 10 years.",
                                    "author": "drleeisinsurgery",
                                    "id": "h7zgxii",
                                    "parent_id": "t1_h7z3kwc",
                                    "score": 7,
                                    "created_utc": 1628285853.0,
                                    "replies": [
                                        {
                                            "body": "That’s sweet. You sound sweet. 10 years is amazing and you both being happy is the most important.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7ziehx",
                                            "parent_id": "t1_h7zgxii",
                                            "score": 7,
                                            "created_utc": 1628286525.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Milan v New York is interesting. I would have thought they were similar in terms of cost. Is Milan much cheaper? Maybe it's time to move.",
                                    "author": "ChapterRelative",
                                    "id": "h7z6gqk",
                                    "parent_id": "t1_h7z3kwc",
                                    "score": 2,
                                    "created_utc": 1628281166.0,
                                    "replies": [
                                        {
                                            "body": "Milan is the most expensive place in Italy, but it’s cheaper than New York to live in. The most significant expense there is rent, but everything else is alright. 100€/month on groceries, 130€/month for utilities (water, electricity, internet, heating). The South of Europe, along Eastern Europe are pretty cheap to live in.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7z7978",
                                            "parent_id": "t1_h7z6gqk",
                                            "score": 3,
                                            "created_utc": 1628281520.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Agreed. I would think Milan is a pretty expensive City to live in.",
                                            "author": null,
                                            "id": "h7z7cc3",
                                            "parent_id": "t1_h7z6gqk",
                                            "score": 1,
                                            "created_utc": 1628281558.0,
                                            "replies": [
                                                {
                                                    "body": "Of course, what do we know, we're splenda!",
                                                    "author": "ChapterRelative",
                                                    "id": "h7z7gx7",
                                                    "parent_id": "t1_h7z7cc3",
                                                    "score": 1,
                                                    "created_utc": 1628281617.0,
                                                    "replies": [
                                                        {
                                                            "body": "Splenda and dumb lol.",
                                                            "author": null,
                                                            "id": "h7z80dh",
                                                            "parent_id": "t1_h7z7gx7",
                                                            "score": 3,
                                                            "created_utc": 1628281862.0,
                                                            "replies": [
                                                                {
                                                                    "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                                                                    "author": "ChapterRelative",
                                                                    "id": "h7z8huz",
                                                                    "parent_id": "t1_h7z80dh",
                                                                    "score": 1,
                                                                    "created_utc": 1628282076.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                                                            "author": "dutchNfrenchHoe",
                                                                            "id": "h7zatf0",
                                                                            "parent_id": "t1_h7z8huz",
                                                                            "score": 6,
                                                                            "created_utc": 1628283103.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                                                                    "author": "ChapterRelative",
                                                                                    "id": "h7zbkq2",
                                                                                    "parent_id": "t1_h7zatf0",
                                                                                    "score": 2,
                                                                                    "created_utc": 1628283437.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That's not a whale. Reality check.",
                            "author": "princesspoppy77",
                            "id": "h7z2up5",
                            "parent_id": "t1_h7z1dob",
                            "score": -6,
                            "created_utc": 1628279576.0,
                            "replies": [
                                {
                                    "body": "No need to be rude.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z3le0",
                                    "parent_id": "t1_h7z2up5",
                                    "score": 8,
                                    "created_utc": 1628279902.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h7z4mz9",
                                            "parent_id": "t1_h7z3le0",
                                            "score": -3,
                                            "created_utc": 1628280357.0,
                                            "replies": [
                                                {
                                                    "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7z4rt2",
                                                    "parent_id": "t1_h7z4mz9",
                                                    "score": 11,
                                                    "created_utc": 1628280416.0,
                                                    "replies": [
                                                        {
                                                            "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                                                            "author": "xofcups",
                                                            "id": "h7z6re0",
                                                            "parent_id": "t1_h7z4rt2",
                                                            "score": 6,
                                                            "created_utc": 1628281300.0,
                                                            "replies": [
                                                                {
                                                                    "body": "🥺 aw, thank you!!!",
                                                                    "author": "dutchNfrenchHoe",
                                                                    "id": "h7z7cj2",
                                                                    "parent_id": "t1_h7z6re0",
                                                                    "score": 2,
                                                                    "created_utc": 1628281560.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                                                            "author": "princesspoppy77",
                                                            "id": "h7z9caz",
                                                            "parent_id": "t1_h7z4rt2",
                                                            "score": -5,
                                                            "created_utc": 1628282452.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, you really were being condescending. You still are.",
                                                                    "author": "Cdnsugarr",
                                                                    "id": "h7zfrxt",
                                                                    "parent_id": "t1_h7z9caz",
                                                                    "score": 4,
                                                                    "created_utc": 1628285331.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Agreed.",
                            "author": null,
                            "id": "h7z7wo3",
                            "parent_id": "t1_h7z1dob",
                            "score": 1,
                            "created_utc": 1628281815.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "there aren't that many men with 8 figure stock portfolios so yes, he's a whale, holy shit.",
                    "author": "Persianx6",
                    "id": "h82nls4",
                    "parent_id": "t1_h7yy81o",
                    "score": 4,
                    "created_utc": 1628355501.0,
                    "replies": []
                },
                {
                    "body": "Oh so he is middle class?",
                    "author": null,
                    "id": "h801j4n",
                    "parent_id": "t1_h7yy81o",
                    "score": -1,
                    "created_utc": 1628296031.0,
                    "replies": [
                        {
                            "body": "Middle class men shouldn’t be trying to be SDs. There’s a huge range between middle class and “whale” and he is on the higher-end of the middle of the spectrum.\n\nI always thought a “whale” was someone extremely wealthy, but maybe I’m wrong.",
                            "author": "dutchNfrenchHoe",
                            "id": "h803emt",
                            "parent_id": "t1_h801j4n",
                            "score": 6,
                            "created_utc": 1628297134.0,
                            "replies": [
                                {
                                    "body": "With the way you talk of him and his wealth here, perhaps you'll soon find out if you think he's not good enough because he's not flying private.",
                                    "author": "Persianx6",
                                    "id": "h82odq8",
                                    "parent_id": "t1_h803emt",
                                    "score": 1,
                                    "created_utc": 1628355862.0,
                                    "replies": [
                                        {
                                            "body": "I travel with him all the time and we usually fly business, not first-class. He automatically gets an upgrade for flights, trains and hotels. This time he willingly took the most expensive room for my birthday, but it’s not a recurring thing. I’m very happy with him and our relationship and we’ve been together for almost a year.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h82p09l",
                                            "parent_id": "t1_h82odq8",
                                            "score": 4,
                                            "created_utc": 1628356156.0,
                                            "replies": [
                                                {
                                                    "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
                                                    "author": "Persianx6",
                                                    "id": "h82r2q3",
                                                    "parent_id": "t1_h82p09l",
                                                    "score": 1,
                                                    "created_utc": 1628357116.0,
                                                    "replies": [
                                                        {
                                                            "body": "You are projecting.",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h82r6tf",
                                                            "parent_id": "t1_h82r2q3",
                                                            "score": 6,
                                                            "created_utc": 1628357168.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                                                                    "author": "Persianx6",
                                                                    "id": "h82rufg",
                                                                    "parent_id": "t1_h82r6tf",
                                                                    "score": 0,
                                                                    "created_utc": 1628357469.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                                                            "author": null,
                                                                            "id": "h83kp0a",
                                                                            "parent_id": "t1_h82rufg",
                                                                            "score": 1,
                                                                            "created_utc": 1628371289.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "8 figures is still good :)",
                    "author": null,
                    "id": "h7yzqgq",
                    "parent_id": "t1_h7yy81o",
                    "score": 1,
                    "created_utc": 1628278208.0,
                    "replies": []
                },
                {
                    "body": "How do you know so much about him?",
                    "author": null,
                    "id": "h81uydj",
                    "parent_id": "t1_h7yy81o",
                    "score": 1,
                    "created_utc": 1628341094.0,
                    "replies": [
                        {
                            "body": "We talk.",
                            "author": "dutchNfrenchHoe",
                            "id": "h81ylqp",
                            "parent_id": "t1_h81uydj",
                            "score": 4,
                            "created_utc": 1628343217.0,
                            "replies": [
                                {
                                    "body": "Very unusual for truly wealthy guys to go bonkers on their wealth details especially to folks who they are in an obvious transient relationship with.",
                                    "author": null,
                                    "id": "h81zhzj",
                                    "parent_id": "t1_h81ylqp",
                                    "score": 1,
                                    "created_utc": 1628343718.0,
                                    "replies": [
                                        {
                                            "body": "We are beyond a “transient relationship”. I’ll tell you even more:\n1. I know where he works and have been to his office multiple times. I also travel with him —when I’m not too busy with college,  for work. So he’ll have his meetings, I’ll be chilling at the Champs-Elysées or at the Piazza del Popolo (or wherever he needs to go) and we’ll spend time together in the morning and evening. \n2. He’s “Googleable”.\n3. I’ve seen some of his tax returns. It was actually accidental, we were chilling in bed and I asked him what he was carrying in his backpack. He said some work documents. I asked if I could take a look, he told me to go ahead. I accidentally picked his personal folder, not the work one and only realised when I saw one of his dividends returns, but I put it back immediately.\n4. He eventually wants children with me, which I don’t, but would I say yes, the following would be put in a contract and revised by a lawyer of my choosing —the lawyer fees would indirectly be paid by him:\n* I get a house, although the usufruit, the nue-propriété will go to the child\n* His wealth will be equally divided amongst the children, with a set trust fund, for which I’ll be responsible for until they turn 18. He’ll live off the dividends his portfolio returns, and leave the rest behind to his children. So that’s 8 figures split amongst 1-3 kids.\n5. He has proposed to move me into one of said properties. I refused because I’d rather live close to campus and like the student experience. \n\nFree of you not to believe me!",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h820i2i",
                                            "parent_id": "t1_h81zhzj",
                                            "score": 7,
                                            "created_utc": 1628344261.0,
                                            "replies": [
                                                {
                                                    "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
                                                    "author": null,
                                                    "id": "h82an8r",
                                                    "parent_id": "t1_h820i2i",
                                                    "score": 2,
                                                    "created_utc": 1628349403.0,
                                                    "replies": [
                                                        {
                                                            "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h82ba9h",
                                                            "parent_id": "t1_h82an8r",
                                                            "score": 8,
                                                            "created_utc": 1628349709.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Pretty accurate.",
                                                                    "author": "BlissfulSB",
                                                                    "id": "h82qrlo",
                                                                    "parent_id": "t1_h82ba9h",
                                                                    "score": 5,
                                                                    "created_utc": 1628356972.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                                                                    "author": null,
                                                                    "id": "h82dh6c",
                                                                    "parent_id": "t1_h82ba9h",
                                                                    "score": -1,
                                                                    "created_utc": 1628350750.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                                                            "author": "dutchNfrenchHoe",
                                                                            "id": "h82feu8",
                                                                            "parent_id": "t1_h82dh6c",
                                                                            "score": 10,
                                                                            "created_utc": 1628351666.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "h82r7mf",
                                                                                    "parent_id": "t1_h82feu8",
                                                                                    "score": 8,
                                                                                    "created_utc": 1628357178.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                                                            "author": "dutchNfrenchHoe",
                                                                                            "id": "h82rzx2",
                                                                                            "parent_id": "t1_h82r7mf",
                                                                                            "score": 6,
                                                                                            "created_utc": 1628357539.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "h82r0ee",
                                                                            "parent_id": "t1_h82dh6c",
                                                                            "score": 7,
                                                                            "created_utc": 1628357085.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                                                                    "author": null,
                                                                                    "id": "h83jnns",
                                                                                    "parent_id": "t1_h82r0ee",
                                                                                    "score": 0,
                                                                                    "created_utc": 1628370777.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eh... he has his issues trust me 😅",
            "author": "dutchNfrenchHoe",
            "id": "h82fkry",
            "parent_id": "t1_h7z7qj2",
            "score": 3,
            "created_utc": 1628351744.0,
            "replies": []
        },
        {
            "body": "(I don’t consider mine a whale but) I wish it to you. I wish it an amazing SR to every single SB in this sub.",
            "author": "dutchNfrenchHoe",
            "id": "h7zd9jt",
            "parent_id": "t1_h7zctaa",
            "score": 3,
            "created_utc": 1628284198.0,
            "replies": []
        },
        {
            "body": "I would love to take that compliment but I’m pretty regular! Thank you though ❤️",
            "author": "dutchNfrenchHoe",
            "id": "h803kws",
            "parent_id": "t1_h7zzepr",
            "score": 5,
            "created_utc": 1628297229.0,
            "replies": []
        },
        {
            "body": "I hope it will work out as well for us. I’d hate for our dynamic to change due to the distance, but it did warm my heart that he wanted to continue.",
            "author": "dutchNfrenchHoe",
            "id": "h7ylo3o",
            "parent_id": "t1_h7yl8d0",
            "score": 5,
            "created_utc": 1628272164.0,
            "replies": [
                {
                    "body": "This is hard to believe, but our dynamic got stronger -- believe it or don't!  That said, she texted or called every single day.  For both of us, we loved our daily texts or convos, and then when we got together we absolutely cherished the time.  Our time together became even more valuable now that it was more rare... but the communication kept us tight",
                    "author": "Azurecole",
                    "id": "h7ynv56",
                    "parent_id": "t1_h7ylo3o",
                    "score": 1,
                    "created_utc": 1628273097.0,
                    "replies": [
                        {
                            "body": "I had a long-distance relationship, and it was good because of the daily communication.  He didn't speak English well, so it took a long time over the phone to explain ourselves, which is why I believe our union was strong.  It was the most satisfying relationship I had ever had, and the distance didn't bother me. Unfortunately, I also knew when he cheated on me.  Our relationship was really close.",
                            "author": "Darknlovely38",
                            "id": "h7z1x7e",
                            "parent_id": "t1_h7ynv56",
                            "score": 1,
                            "created_utc": 1628279172.0,
                            "replies": [
                                {
                                    "body": "I’m sorry girl. How did you know he was cheating?",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z2q44",
                                    "parent_id": "t1_h7z1x7e",
                                    "score": 3,
                                    "created_utc": 1628279519.0,
                                    "replies": [
                                        {
                                            "body": "I had a dream, and it disturbed me; when I woke, I sat straight up in my bed, and I and I said to myself, he's cheating.  I knew it in my heart.  So, I got out of bed and called him.  I live in the US; he lived in Germany.  I've only called him twice in our three-year romance because of the expense, but he had a special discount for businesses.  Guess who answered the phone?",
                                            "author": "Darknlovely38",
                                            "id": "h7z93s8",
                                            "parent_id": "t1_h7z2q44",
                                            "score": 3,
                                            "created_utc": 1628282347.0,
                                            "replies": [
                                                {
                                                    "body": "I’m so sorry. Sending you hugs.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7zalzi",
                                                    "parent_id": "t1_h7z93s8",
                                                    "score": 3,
                                                    "created_utc": 1628283012.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How did your arrangement work? Ppm or allowance?",
            "author": null,
            "id": "h7yqaxl",
            "parent_id": "t1_h7yl8d0",
            "score": 1,
            "created_utc": 1628274156.0,
            "replies": []
        },
        {
            "body": "No magic here, I’m pretty regular.\nI will say, that I have a few things working in my favour in our relationship:\n1. I’m his ideal type physically and intellectually to a T, according to him.\n2. He’s very “fleur bleue”. He wants the long-lasting romance, the passion, the Josephine to his Napoléon. We happen to have amazing chemistry, which he says is rare for him.\n3. This might be controversial and I’m aware the SDs won’t like this but I think an SR is more likely to work if the SD is more into the SB than vice-versa. I really like him, he’s wonderful. But was this relationship to end today, he would take a much harder emotional hit than I would. \n\n\nBut the most important, is probably point 2.",
            "author": "dutchNfrenchHoe",
            "id": "h7z8hap",
            "parent_id": "t1_h7z58ae",
            "score": 13,
            "created_utc": 1628282070.0,
            "replies": []
        },
        {
            "body": "Lol, not at all and I don’t wish for one either. The poor guy kept complaining about an emptied ballsack during the whole trip.",
            "author": "dutchNfrenchHoe",
            "id": "h7yj0gi",
            "parent_id": "t1_h7yirvh",
            "score": 13,
            "created_utc": 1628271052.0,
            "replies": []
        },
        {
            "body": "That wouldn’t make it a humble brag but a fantasy…",
            "author": null,
            "id": "h7yk0g1",
            "parent_id": "t1_h7yirvh",
            "score": 4,
            "created_utc": 1628271469.0,
            "replies": [
                {
                    "body": "Yup Tiktok style !! But OPs username is very interesting !!",
                    "author": null,
                    "id": "h7ykgk0",
                    "parent_id": "t1_h7yk0g1",
                    "score": 2,
                    "created_utc": 1628271656.0,
                    "replies": [
                        {
                            "body": "Yes.  Makes me wonder if she is Belgian.",
                            "author": null,
                            "id": "h7ykrqy",
                            "parent_id": "t1_h7ykgk0",
                            "score": 3,
                            "created_utc": 1628271786.0,
                            "replies": [
                                {
                                    "body": "Nice catch!",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7ykyci",
                                    "parent_id": "t1_h7ykrqy",
                                    "score": 6,
                                    "created_utc": 1628271865.0,
                                    "replies": [
                                        {
                                            "body": "Love the Spring Classics and Belgian beers!!",
                                            "author": null,
                                            "id": "h7ylj26",
                                            "parent_id": "t1_h7ykyci",
                                            "score": 1,
                                            "created_utc": 1628272105.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’s 40.",
            "author": "dutchNfrenchHoe",
            "id": "h80y9vt",
            "parent_id": "t1_h80rgla",
            "score": 5,
            "created_utc": 1628314962.0,
            "replies": []
        },
        {
            "body": "I would definitely call that a whale! Maybe not in terms of his net worth (which is still in the .01th percentile), but what he is willing to spend on you.",
            "author": "drleeisinsurgery",
            "id": "h7z1dob",
            "parent_id": "t1_h7yy81o",
            "score": 28,
            "created_utc": 1628278939.0,
            "replies": [
                {
                    "body": "Agreed and needs repeating for the newbies and  fence sitters reading. SD Guy’s net worth is minimum $10-20 million with earned income of at least $500K. More important is the unearned income from investments. 3% of that is at least $300K. So yes there are whale SDs with more net worth and higher income. But OP’s can easily spend $10K a month on her allowance and add more gifts etc., totaling over $150K a year in value to her. OP might bank significantly more than this. We don’t know how generous her SD chose to be in their negotiations but the theoretical capability is extraordinary even if he’s not worth $50 million or more like a “true whale”. Extraordinary because 90% or more of SBs look at a few thousand a month, or less than $60K a year. And their SDs have a net worth of less than $10 million.   Don’t think I have broken forum rules in speaking so speculatively and generally with dollar numbers about worth and allowance. However seems to me this kind of info is basic to a realistic understanding of what one can expect in the sugar bowl.  Adding that whale-ish SDs don’t (to repeat posters on here) need to, or hardly ever want to, lavish their SBs with all the coin that they “could afford” to drop.",
                    "author": "jacknjilled",
                    "id": "h7zm347",
                    "parent_id": "t1_h7z1dob",
                    "score": 10,
                    "created_utc": 1628288235.0,
                    "replies": []
                },
                {
                    "body": "To be fair, I think what is considered a whale varies depending on your location. 1 million dollars in New York and 1 million in Milan give you two different lifestyles even though both are cosmopolitan cities. Where I live, his salary puts him in the 0.01%. I guess he wouldn’t be hot stuff in LA.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z3kwc",
                    "parent_id": "t1_h7z1dob",
                    "score": 2,
                    "created_utc": 1628279896.0,
                    "replies": [
                        {
                            "body": "I don’t think you realize that most SD’s don’t take their SB’s to the south of France, then gift them jewelry and xx,xxx for their investment account. Read all the stories on here, a lot of girls are lucky if their SD pays their ppm on time or doesn’t want to meet in a creepy basement office lol. \n\nYou’re definitely lucky and you have a whale SD even if you don’t think you do. Whatever he is spending on you is probably more than what 99% of most SB’s get on SA.",
                            "author": null,
                            "id": "h7z7vzw",
                            "parent_id": "t1_h7z3kwc",
                            "score": 31,
                            "created_utc": 1628281806.0,
                            "replies": [
                                {
                                    "body": "This is my second successful SR. \nMy ex gave me similar things (the investment gift is huge though, I’ll admit it) and introduced me to the lifestyle. What’s that English expression again.. struck lightning twice? I should try my luck at the lottery!",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z9dvu",
                                    "parent_id": "t1_h7z7vzw",
                                    "score": 6,
                                    "created_utc": 1628282472.0,
                                    "replies": [
                                        {
                                            "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
                                            "author": null,
                                            "id": "h7z9ka6",
                                            "parent_id": "t1_h7z9dvu",
                                            "score": 5,
                                            "created_utc": 1628282552.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Creepy basement office sounds interesting. I might have to up my game. 😁",
                                    "author": "ChapterRelative",
                                    "id": "h7zhjr4",
                                    "parent_id": "t1_h7z7vzw",
                                    "score": 0,
                                    "created_utc": 1628286134.0,
                                    "replies": [
                                        {
                                            "body": "Gotta step our creep game up lol.",
                                            "author": null,
                                            "id": "h7zkaov",
                                            "parent_id": "t1_h7zhjr4",
                                            "score": 1,
                                            "created_utc": 1628287393.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Hope my SB doesn't read this, she'll be jealous. I rent a house for her in a good neighborhood, paid for a used luxury car plus a few thousand for spending cash, but we've certainly never gone on lavish vacations nor have I gotten her if 5 figure gifts At this point she's more of a second wife after over 10 years.",
                            "author": "drleeisinsurgery",
                            "id": "h7zgxii",
                            "parent_id": "t1_h7z3kwc",
                            "score": 7,
                            "created_utc": 1628285853.0,
                            "replies": [
                                {
                                    "body": "That’s sweet. You sound sweet. 10 years is amazing and you both being happy is the most important.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7ziehx",
                                    "parent_id": "t1_h7zgxii",
                                    "score": 7,
                                    "created_utc": 1628286525.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Milan v New York is interesting. I would have thought they were similar in terms of cost. Is Milan much cheaper? Maybe it's time to move.",
                            "author": "ChapterRelative",
                            "id": "h7z6gqk",
                            "parent_id": "t1_h7z3kwc",
                            "score": 2,
                            "created_utc": 1628281166.0,
                            "replies": [
                                {
                                    "body": "Milan is the most expensive place in Italy, but it’s cheaper than New York to live in. The most significant expense there is rent, but everything else is alright. 100€/month on groceries, 130€/month for utilities (water, electricity, internet, heating). The South of Europe, along Eastern Europe are pretty cheap to live in.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z7978",
                                    "parent_id": "t1_h7z6gqk",
                                    "score": 3,
                                    "created_utc": 1628281520.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agreed. I would think Milan is a pretty expensive City to live in.",
                                    "author": null,
                                    "id": "h7z7cc3",
                                    "parent_id": "t1_h7z6gqk",
                                    "score": 1,
                                    "created_utc": 1628281558.0,
                                    "replies": [
                                        {
                                            "body": "Of course, what do we know, we're splenda!",
                                            "author": "ChapterRelative",
                                            "id": "h7z7gx7",
                                            "parent_id": "t1_h7z7cc3",
                                            "score": 1,
                                            "created_utc": 1628281617.0,
                                            "replies": [
                                                {
                                                    "body": "Splenda and dumb lol.",
                                                    "author": null,
                                                    "id": "h7z80dh",
                                                    "parent_id": "t1_h7z7gx7",
                                                    "score": 3,
                                                    "created_utc": 1628281862.0,
                                                    "replies": [
                                                        {
                                                            "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                                                            "author": "ChapterRelative",
                                                            "id": "h7z8huz",
                                                            "parent_id": "t1_h7z80dh",
                                                            "score": 1,
                                                            "created_utc": 1628282076.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                                                    "author": "dutchNfrenchHoe",
                                                                    "id": "h7zatf0",
                                                                    "parent_id": "t1_h7z8huz",
                                                                    "score": 6,
                                                                    "created_utc": 1628283103.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                                                            "author": "ChapterRelative",
                                                                            "id": "h7zbkq2",
                                                                            "parent_id": "t1_h7zatf0",
                                                                            "score": 2,
                                                                            "created_utc": 1628283437.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's not a whale. Reality check.",
                    "author": "princesspoppy77",
                    "id": "h7z2up5",
                    "parent_id": "t1_h7z1dob",
                    "score": -6,
                    "created_utc": 1628279576.0,
                    "replies": [
                        {
                            "body": "No need to be rude.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z3le0",
                            "parent_id": "t1_h7z2up5",
                            "score": 8,
                            "created_utc": 1628279902.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h7z4mz9",
                                    "parent_id": "t1_h7z3le0",
                                    "score": -3,
                                    "created_utc": 1628280357.0,
                                    "replies": [
                                        {
                                            "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7z4rt2",
                                            "parent_id": "t1_h7z4mz9",
                                            "score": 11,
                                            "created_utc": 1628280416.0,
                                            "replies": [
                                                {
                                                    "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                                                    "author": "xofcups",
                                                    "id": "h7z6re0",
                                                    "parent_id": "t1_h7z4rt2",
                                                    "score": 6,
                                                    "created_utc": 1628281300.0,
                                                    "replies": [
                                                        {
                                                            "body": "🥺 aw, thank you!!!",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h7z7cj2",
                                                            "parent_id": "t1_h7z6re0",
                                                            "score": 2,
                                                            "created_utc": 1628281560.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                                                    "author": "princesspoppy77",
                                                    "id": "h7z9caz",
                                                    "parent_id": "t1_h7z4rt2",
                                                    "score": -5,
                                                    "created_utc": 1628282452.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, you really were being condescending. You still are.",
                                                            "author": "Cdnsugarr",
                                                            "id": "h7zfrxt",
                                                            "parent_id": "t1_h7z9caz",
                                                            "score": 4,
                                                            "created_utc": 1628285331.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed.",
                    "author": null,
                    "id": "h7z7wo3",
                    "parent_id": "t1_h7z1dob",
                    "score": 1,
                    "created_utc": 1628281815.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "there aren't that many men with 8 figure stock portfolios so yes, he's a whale, holy shit.",
            "author": "Persianx6",
            "id": "h82nls4",
            "parent_id": "t1_h7yy81o",
            "score": 4,
            "created_utc": 1628355501.0,
            "replies": []
        },
        {
            "body": "Oh so he is middle class?",
            "author": null,
            "id": "h801j4n",
            "parent_id": "t1_h7yy81o",
            "score": -1,
            "created_utc": 1628296031.0,
            "replies": [
                {
                    "body": "Middle class men shouldn’t be trying to be SDs. There’s a huge range between middle class and “whale” and he is on the higher-end of the middle of the spectrum.\n\nI always thought a “whale” was someone extremely wealthy, but maybe I’m wrong.",
                    "author": "dutchNfrenchHoe",
                    "id": "h803emt",
                    "parent_id": "t1_h801j4n",
                    "score": 6,
                    "created_utc": 1628297134.0,
                    "replies": [
                        {
                            "body": "With the way you talk of him and his wealth here, perhaps you'll soon find out if you think he's not good enough because he's not flying private.",
                            "author": "Persianx6",
                            "id": "h82odq8",
                            "parent_id": "t1_h803emt",
                            "score": 1,
                            "created_utc": 1628355862.0,
                            "replies": [
                                {
                                    "body": "I travel with him all the time and we usually fly business, not first-class. He automatically gets an upgrade for flights, trains and hotels. This time he willingly took the most expensive room for my birthday, but it’s not a recurring thing. I’m very happy with him and our relationship and we’ve been together for almost a year.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h82p09l",
                                    "parent_id": "t1_h82odq8",
                                    "score": 4,
                                    "created_utc": 1628356156.0,
                                    "replies": [
                                        {
                                            "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
                                            "author": "Persianx6",
                                            "id": "h82r2q3",
                                            "parent_id": "t1_h82p09l",
                                            "score": 1,
                                            "created_utc": 1628357116.0,
                                            "replies": [
                                                {
                                                    "body": "You are projecting.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h82r6tf",
                                                    "parent_id": "t1_h82r2q3",
                                                    "score": 6,
                                                    "created_utc": 1628357168.0,
                                                    "replies": [
                                                        {
                                                            "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                                                            "author": "Persianx6",
                                                            "id": "h82rufg",
                                                            "parent_id": "t1_h82r6tf",
                                                            "score": 0,
                                                            "created_utc": 1628357469.0,
                                                            "replies": [
                                                                {
                                                                    "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                                                    "author": null,
                                                                    "id": "h83kp0a",
                                                                    "parent_id": "t1_h82rufg",
                                                                    "score": 1,
                                                                    "created_utc": 1628371289.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "8 figures is still good :)",
            "author": null,
            "id": "h7yzqgq",
            "parent_id": "t1_h7yy81o",
            "score": 1,
            "created_utc": 1628278208.0,
            "replies": []
        },
        {
            "body": "How do you know so much about him?",
            "author": null,
            "id": "h81uydj",
            "parent_id": "t1_h7yy81o",
            "score": 1,
            "created_utc": 1628341094.0,
            "replies": [
                {
                    "body": "We talk.",
                    "author": "dutchNfrenchHoe",
                    "id": "h81ylqp",
                    "parent_id": "t1_h81uydj",
                    "score": 4,
                    "created_utc": 1628343217.0,
                    "replies": [
                        {
                            "body": "Very unusual for truly wealthy guys to go bonkers on their wealth details especially to folks who they are in an obvious transient relationship with.",
                            "author": null,
                            "id": "h81zhzj",
                            "parent_id": "t1_h81ylqp",
                            "score": 1,
                            "created_utc": 1628343718.0,
                            "replies": [
                                {
                                    "body": "We are beyond a “transient relationship”. I’ll tell you even more:\n1. I know where he works and have been to his office multiple times. I also travel with him —when I’m not too busy with college,  for work. So he’ll have his meetings, I’ll be chilling at the Champs-Elysées or at the Piazza del Popolo (or wherever he needs to go) and we’ll spend time together in the morning and evening. \n2. He’s “Googleable”.\n3. I’ve seen some of his tax returns. It was actually accidental, we were chilling in bed and I asked him what he was carrying in his backpack. He said some work documents. I asked if I could take a look, he told me to go ahead. I accidentally picked his personal folder, not the work one and only realised when I saw one of his dividends returns, but I put it back immediately.\n4. He eventually wants children with me, which I don’t, but would I say yes, the following would be put in a contract and revised by a lawyer of my choosing —the lawyer fees would indirectly be paid by him:\n* I get a house, although the usufruit, the nue-propriété will go to the child\n* His wealth will be equally divided amongst the children, with a set trust fund, for which I’ll be responsible for until they turn 18. He’ll live off the dividends his portfolio returns, and leave the rest behind to his children. So that’s 8 figures split amongst 1-3 kids.\n5. He has proposed to move me into one of said properties. I refused because I’d rather live close to campus and like the student experience. \n\nFree of you not to believe me!",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h820i2i",
                                    "parent_id": "t1_h81zhzj",
                                    "score": 7,
                                    "created_utc": 1628344261.0,
                                    "replies": [
                                        {
                                            "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
                                            "author": null,
                                            "id": "h82an8r",
                                            "parent_id": "t1_h820i2i",
                                            "score": 2,
                                            "created_utc": 1628349403.0,
                                            "replies": [
                                                {
                                                    "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h82ba9h",
                                                    "parent_id": "t1_h82an8r",
                                                    "score": 8,
                                                    "created_utc": 1628349709.0,
                                                    "replies": [
                                                        {
                                                            "body": "Pretty accurate.",
                                                            "author": "BlissfulSB",
                                                            "id": "h82qrlo",
                                                            "parent_id": "t1_h82ba9h",
                                                            "score": 5,
                                                            "created_utc": 1628356972.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                                                            "author": null,
                                                            "id": "h82dh6c",
                                                            "parent_id": "t1_h82ba9h",
                                                            "score": -1,
                                                            "created_utc": 1628350750.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                                                    "author": "dutchNfrenchHoe",
                                                                    "id": "h82feu8",
                                                                    "parent_id": "t1_h82dh6c",
                                                                    "score": 10,
                                                                    "created_utc": 1628351666.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "h82r7mf",
                                                                            "parent_id": "t1_h82feu8",
                                                                            "score": 8,
                                                                            "created_utc": 1628357178.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                                                    "author": "dutchNfrenchHoe",
                                                                                    "id": "h82rzx2",
                                                                                    "parent_id": "t1_h82r7mf",
                                                                                    "score": 6,
                                                                                    "created_utc": 1628357539.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "h82r0ee",
                                                                    "parent_id": "t1_h82dh6c",
                                                                    "score": 7,
                                                                    "created_utc": 1628357085.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                                                            "author": null,
                                                                            "id": "h83jnns",
                                                                            "parent_id": "t1_h82r0ee",
                                                                            "score": 0,
                                                                            "created_utc": 1628370777.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is hard to believe, but our dynamic got stronger -- believe it or don't!  That said, she texted or called every single day.  For both of us, we loved our daily texts or convos, and then when we got together we absolutely cherished the time.  Our time together became even more valuable now that it was more rare... but the communication kept us tight",
            "author": "Azurecole",
            "id": "h7ynv56",
            "parent_id": "t1_h7ylo3o",
            "score": 1,
            "created_utc": 1628273097.0,
            "replies": [
                {
                    "body": "I had a long-distance relationship, and it was good because of the daily communication.  He didn't speak English well, so it took a long time over the phone to explain ourselves, which is why I believe our union was strong.  It was the most satisfying relationship I had ever had, and the distance didn't bother me. Unfortunately, I also knew when he cheated on me.  Our relationship was really close.",
                    "author": "Darknlovely38",
                    "id": "h7z1x7e",
                    "parent_id": "t1_h7ynv56",
                    "score": 1,
                    "created_utc": 1628279172.0,
                    "replies": [
                        {
                            "body": "I’m sorry girl. How did you know he was cheating?",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z2q44",
                            "parent_id": "t1_h7z1x7e",
                            "score": 3,
                            "created_utc": 1628279519.0,
                            "replies": [
                                {
                                    "body": "I had a dream, and it disturbed me; when I woke, I sat straight up in my bed, and I and I said to myself, he's cheating.  I knew it in my heart.  So, I got out of bed and called him.  I live in the US; he lived in Germany.  I've only called him twice in our three-year romance because of the expense, but he had a special discount for businesses.  Guess who answered the phone?",
                                    "author": "Darknlovely38",
                                    "id": "h7z93s8",
                                    "parent_id": "t1_h7z2q44",
                                    "score": 3,
                                    "created_utc": 1628282347.0,
                                    "replies": [
                                        {
                                            "body": "I’m so sorry. Sending you hugs.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7zalzi",
                                            "parent_id": "t1_h7z93s8",
                                            "score": 3,
                                            "created_utc": 1628283012.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup Tiktok style !! But OPs username is very interesting !!",
            "author": null,
            "id": "h7ykgk0",
            "parent_id": "t1_h7yk0g1",
            "score": 2,
            "created_utc": 1628271656.0,
            "replies": [
                {
                    "body": "Yes.  Makes me wonder if she is Belgian.",
                    "author": null,
                    "id": "h7ykrqy",
                    "parent_id": "t1_h7ykgk0",
                    "score": 3,
                    "created_utc": 1628271786.0,
                    "replies": [
                        {
                            "body": "Nice catch!",
                            "author": "dutchNfrenchHoe",
                            "id": "h7ykyci",
                            "parent_id": "t1_h7ykrqy",
                            "score": 6,
                            "created_utc": 1628271865.0,
                            "replies": [
                                {
                                    "body": "Love the Spring Classics and Belgian beers!!",
                                    "author": null,
                                    "id": "h7ylj26",
                                    "parent_id": "t1_h7ykyci",
                                    "score": 1,
                                    "created_utc": 1628272105.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed and needs repeating for the newbies and  fence sitters reading. SD Guy’s net worth is minimum $10-20 million with earned income of at least $500K. More important is the unearned income from investments. 3% of that is at least $300K. So yes there are whale SDs with more net worth and higher income. But OP’s can easily spend $10K a month on her allowance and add more gifts etc., totaling over $150K a year in value to her. OP might bank significantly more than this. We don’t know how generous her SD chose to be in their negotiations but the theoretical capability is extraordinary even if he’s not worth $50 million or more like a “true whale”. Extraordinary because 90% or more of SBs look at a few thousand a month, or less than $60K a year. And their SDs have a net worth of less than $10 million.   Don’t think I have broken forum rules in speaking so speculatively and generally with dollar numbers about worth and allowance. However seems to me this kind of info is basic to a realistic understanding of what one can expect in the sugar bowl.  Adding that whale-ish SDs don’t (to repeat posters on here) need to, or hardly ever want to, lavish their SBs with all the coin that they “could afford” to drop.",
            "author": "jacknjilled",
            "id": "h7zm347",
            "parent_id": "t1_h7z1dob",
            "score": 10,
            "created_utc": 1628288235.0,
            "replies": []
        },
        {
            "body": "To be fair, I think what is considered a whale varies depending on your location. 1 million dollars in New York and 1 million in Milan give you two different lifestyles even though both are cosmopolitan cities. Where I live, his salary puts him in the 0.01%. I guess he wouldn’t be hot stuff in LA.",
            "author": "dutchNfrenchHoe",
            "id": "h7z3kwc",
            "parent_id": "t1_h7z1dob",
            "score": 2,
            "created_utc": 1628279896.0,
            "replies": [
                {
                    "body": "I don’t think you realize that most SD’s don’t take their SB’s to the south of France, then gift them jewelry and xx,xxx for their investment account. Read all the stories on here, a lot of girls are lucky if their SD pays their ppm on time or doesn’t want to meet in a creepy basement office lol. \n\nYou’re definitely lucky and you have a whale SD even if you don’t think you do. Whatever he is spending on you is probably more than what 99% of most SB’s get on SA.",
                    "author": null,
                    "id": "h7z7vzw",
                    "parent_id": "t1_h7z3kwc",
                    "score": 31,
                    "created_utc": 1628281806.0,
                    "replies": [
                        {
                            "body": "This is my second successful SR. \nMy ex gave me similar things (the investment gift is huge though, I’ll admit it) and introduced me to the lifestyle. What’s that English expression again.. struck lightning twice? I should try my luck at the lottery!",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z9dvu",
                            "parent_id": "t1_h7z7vzw",
                            "score": 6,
                            "created_utc": 1628282472.0,
                            "replies": [
                                {
                                    "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
                                    "author": null,
                                    "id": "h7z9ka6",
                                    "parent_id": "t1_h7z9dvu",
                                    "score": 5,
                                    "created_utc": 1628282552.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Creepy basement office sounds interesting. I might have to up my game. 😁",
                            "author": "ChapterRelative",
                            "id": "h7zhjr4",
                            "parent_id": "t1_h7z7vzw",
                            "score": 0,
                            "created_utc": 1628286134.0,
                            "replies": [
                                {
                                    "body": "Gotta step our creep game up lol.",
                                    "author": null,
                                    "id": "h7zkaov",
                                    "parent_id": "t1_h7zhjr4",
                                    "score": 1,
                                    "created_utc": 1628287393.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hope my SB doesn't read this, she'll be jealous. I rent a house for her in a good neighborhood, paid for a used luxury car plus a few thousand for spending cash, but we've certainly never gone on lavish vacations nor have I gotten her if 5 figure gifts At this point she's more of a second wife after over 10 years.",
                    "author": "drleeisinsurgery",
                    "id": "h7zgxii",
                    "parent_id": "t1_h7z3kwc",
                    "score": 7,
                    "created_utc": 1628285853.0,
                    "replies": [
                        {
                            "body": "That’s sweet. You sound sweet. 10 years is amazing and you both being happy is the most important.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7ziehx",
                            "parent_id": "t1_h7zgxii",
                            "score": 7,
                            "created_utc": 1628286525.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Milan v New York is interesting. I would have thought they were similar in terms of cost. Is Milan much cheaper? Maybe it's time to move.",
                    "author": "ChapterRelative",
                    "id": "h7z6gqk",
                    "parent_id": "t1_h7z3kwc",
                    "score": 2,
                    "created_utc": 1628281166.0,
                    "replies": [
                        {
                            "body": "Milan is the most expensive place in Italy, but it’s cheaper than New York to live in. The most significant expense there is rent, but everything else is alright. 100€/month on groceries, 130€/month for utilities (water, electricity, internet, heating). The South of Europe, along Eastern Europe are pretty cheap to live in.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z7978",
                            "parent_id": "t1_h7z6gqk",
                            "score": 3,
                            "created_utc": 1628281520.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed. I would think Milan is a pretty expensive City to live in.",
                            "author": null,
                            "id": "h7z7cc3",
                            "parent_id": "t1_h7z6gqk",
                            "score": 1,
                            "created_utc": 1628281558.0,
                            "replies": [
                                {
                                    "body": "Of course, what do we know, we're splenda!",
                                    "author": "ChapterRelative",
                                    "id": "h7z7gx7",
                                    "parent_id": "t1_h7z7cc3",
                                    "score": 1,
                                    "created_utc": 1628281617.0,
                                    "replies": [
                                        {
                                            "body": "Splenda and dumb lol.",
                                            "author": null,
                                            "id": "h7z80dh",
                                            "parent_id": "t1_h7z7gx7",
                                            "score": 3,
                                            "created_utc": 1628281862.0,
                                            "replies": [
                                                {
                                                    "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                                                    "author": "ChapterRelative",
                                                    "id": "h7z8huz",
                                                    "parent_id": "t1_h7z80dh",
                                                    "score": 1,
                                                    "created_utc": 1628282076.0,
                                                    "replies": [
                                                        {
                                                            "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h7zatf0",
                                                            "parent_id": "t1_h7z8huz",
                                                            "score": 6,
                                                            "created_utc": 1628283103.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                                                    "author": "ChapterRelative",
                                                                    "id": "h7zbkq2",
                                                                    "parent_id": "t1_h7zatf0",
                                                                    "score": 2,
                                                                    "created_utc": 1628283437.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's not a whale. Reality check.",
            "author": "princesspoppy77",
            "id": "h7z2up5",
            "parent_id": "t1_h7z1dob",
            "score": -6,
            "created_utc": 1628279576.0,
            "replies": [
                {
                    "body": "No need to be rude.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z3le0",
                    "parent_id": "t1_h7z2up5",
                    "score": 8,
                    "created_utc": 1628279902.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h7z4mz9",
                            "parent_id": "t1_h7z3le0",
                            "score": -3,
                            "created_utc": 1628280357.0,
                            "replies": [
                                {
                                    "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z4rt2",
                                    "parent_id": "t1_h7z4mz9",
                                    "score": 11,
                                    "created_utc": 1628280416.0,
                                    "replies": [
                                        {
                                            "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                                            "author": "xofcups",
                                            "id": "h7z6re0",
                                            "parent_id": "t1_h7z4rt2",
                                            "score": 6,
                                            "created_utc": 1628281300.0,
                                            "replies": [
                                                {
                                                    "body": "🥺 aw, thank you!!!",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7z7cj2",
                                                    "parent_id": "t1_h7z6re0",
                                                    "score": 2,
                                                    "created_utc": 1628281560.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                                            "author": "princesspoppy77",
                                            "id": "h7z9caz",
                                            "parent_id": "t1_h7z4rt2",
                                            "score": -5,
                                            "created_utc": 1628282452.0,
                                            "replies": [
                                                {
                                                    "body": "No, you really were being condescending. You still are.",
                                                    "author": "Cdnsugarr",
                                                    "id": "h7zfrxt",
                                                    "parent_id": "t1_h7z9caz",
                                                    "score": 4,
                                                    "created_utc": 1628285331.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed.",
            "author": null,
            "id": "h7z7wo3",
            "parent_id": "t1_h7z1dob",
            "score": 1,
            "created_utc": 1628281815.0,
            "replies": []
        },
        {
            "body": "Middle class men shouldn’t be trying to be SDs. There’s a huge range between middle class and “whale” and he is on the higher-end of the middle of the spectrum.\n\nI always thought a “whale” was someone extremely wealthy, but maybe I’m wrong.",
            "author": "dutchNfrenchHoe",
            "id": "h803emt",
            "parent_id": "t1_h801j4n",
            "score": 6,
            "created_utc": 1628297134.0,
            "replies": [
                {
                    "body": "With the way you talk of him and his wealth here, perhaps you'll soon find out if you think he's not good enough because he's not flying private.",
                    "author": "Persianx6",
                    "id": "h82odq8",
                    "parent_id": "t1_h803emt",
                    "score": 1,
                    "created_utc": 1628355862.0,
                    "replies": [
                        {
                            "body": "I travel with him all the time and we usually fly business, not first-class. He automatically gets an upgrade for flights, trains and hotels. This time he willingly took the most expensive room for my birthday, but it’s not a recurring thing. I’m very happy with him and our relationship and we’ve been together for almost a year.",
                            "author": "dutchNfrenchHoe",
                            "id": "h82p09l",
                            "parent_id": "t1_h82odq8",
                            "score": 4,
                            "created_utc": 1628356156.0,
                            "replies": [
                                {
                                    "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
                                    "author": "Persianx6",
                                    "id": "h82r2q3",
                                    "parent_id": "t1_h82p09l",
                                    "score": 1,
                                    "created_utc": 1628357116.0,
                                    "replies": [
                                        {
                                            "body": "You are projecting.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h82r6tf",
                                            "parent_id": "t1_h82r2q3",
                                            "score": 6,
                                            "created_utc": 1628357168.0,
                                            "replies": [
                                                {
                                                    "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                                                    "author": "Persianx6",
                                                    "id": "h82rufg",
                                                    "parent_id": "t1_h82r6tf",
                                                    "score": 0,
                                                    "created_utc": 1628357469.0,
                                                    "replies": [
                                                        {
                                                            "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                                            "author": null,
                                                            "id": "h83kp0a",
                                                            "parent_id": "t1_h82rufg",
                                                            "score": 1,
                                                            "created_utc": 1628371289.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We talk.",
            "author": "dutchNfrenchHoe",
            "id": "h81ylqp",
            "parent_id": "t1_h81uydj",
            "score": 4,
            "created_utc": 1628343217.0,
            "replies": [
                {
                    "body": "Very unusual for truly wealthy guys to go bonkers on their wealth details especially to folks who they are in an obvious transient relationship with.",
                    "author": null,
                    "id": "h81zhzj",
                    "parent_id": "t1_h81ylqp",
                    "score": 1,
                    "created_utc": 1628343718.0,
                    "replies": [
                        {
                            "body": "We are beyond a “transient relationship”. I’ll tell you even more:\n1. I know where he works and have been to his office multiple times. I also travel with him —when I’m not too busy with college,  for work. So he’ll have his meetings, I’ll be chilling at the Champs-Elysées or at the Piazza del Popolo (or wherever he needs to go) and we’ll spend time together in the morning and evening. \n2. He’s “Googleable”.\n3. I’ve seen some of his tax returns. It was actually accidental, we were chilling in bed and I asked him what he was carrying in his backpack. He said some work documents. I asked if I could take a look, he told me to go ahead. I accidentally picked his personal folder, not the work one and only realised when I saw one of his dividends returns, but I put it back immediately.\n4. He eventually wants children with me, which I don’t, but would I say yes, the following would be put in a contract and revised by a lawyer of my choosing —the lawyer fees would indirectly be paid by him:\n* I get a house, although the usufruit, the nue-propriété will go to the child\n* His wealth will be equally divided amongst the children, with a set trust fund, for which I’ll be responsible for until they turn 18. He’ll live off the dividends his portfolio returns, and leave the rest behind to his children. So that’s 8 figures split amongst 1-3 kids.\n5. He has proposed to move me into one of said properties. I refused because I’d rather live close to campus and like the student experience. \n\nFree of you not to believe me!",
                            "author": "dutchNfrenchHoe",
                            "id": "h820i2i",
                            "parent_id": "t1_h81zhzj",
                            "score": 7,
                            "created_utc": 1628344261.0,
                            "replies": [
                                {
                                    "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
                                    "author": null,
                                    "id": "h82an8r",
                                    "parent_id": "t1_h820i2i",
                                    "score": 2,
                                    "created_utc": 1628349403.0,
                                    "replies": [
                                        {
                                            "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h82ba9h",
                                            "parent_id": "t1_h82an8r",
                                            "score": 8,
                                            "created_utc": 1628349709.0,
                                            "replies": [
                                                {
                                                    "body": "Pretty accurate.",
                                                    "author": "BlissfulSB",
                                                    "id": "h82qrlo",
                                                    "parent_id": "t1_h82ba9h",
                                                    "score": 5,
                                                    "created_utc": 1628356972.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                                                    "author": null,
                                                    "id": "h82dh6c",
                                                    "parent_id": "t1_h82ba9h",
                                                    "score": -1,
                                                    "created_utc": 1628350750.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h82feu8",
                                                            "parent_id": "t1_h82dh6c",
                                                            "score": 10,
                                                            "created_utc": 1628351666.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "h82r7mf",
                                                                    "parent_id": "t1_h82feu8",
                                                                    "score": 8,
                                                                    "created_utc": 1628357178.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                                            "author": "dutchNfrenchHoe",
                                                                            "id": "h82rzx2",
                                                                            "parent_id": "t1_h82r7mf",
                                                                            "score": 6,
                                                                            "created_utc": 1628357539.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "h82r0ee",
                                                            "parent_id": "t1_h82dh6c",
                                                            "score": 7,
                                                            "created_utc": 1628357085.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                                                    "author": null,
                                                                    "id": "h83jnns",
                                                                    "parent_id": "t1_h82r0ee",
                                                                    "score": 0,
                                                                    "created_utc": 1628370777.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a long-distance relationship, and it was good because of the daily communication.  He didn't speak English well, so it took a long time over the phone to explain ourselves, which is why I believe our union was strong.  It was the most satisfying relationship I had ever had, and the distance didn't bother me. Unfortunately, I also knew when he cheated on me.  Our relationship was really close.",
            "author": "Darknlovely38",
            "id": "h7z1x7e",
            "parent_id": "t1_h7ynv56",
            "score": 1,
            "created_utc": 1628279172.0,
            "replies": [
                {
                    "body": "I’m sorry girl. How did you know he was cheating?",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z2q44",
                    "parent_id": "t1_h7z1x7e",
                    "score": 3,
                    "created_utc": 1628279519.0,
                    "replies": [
                        {
                            "body": "I had a dream, and it disturbed me; when I woke, I sat straight up in my bed, and I and I said to myself, he's cheating.  I knew it in my heart.  So, I got out of bed and called him.  I live in the US; he lived in Germany.  I've only called him twice in our three-year romance because of the expense, but he had a special discount for businesses.  Guess who answered the phone?",
                            "author": "Darknlovely38",
                            "id": "h7z93s8",
                            "parent_id": "t1_h7z2q44",
                            "score": 3,
                            "created_utc": 1628282347.0,
                            "replies": [
                                {
                                    "body": "I’m so sorry. Sending you hugs.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7zalzi",
                                    "parent_id": "t1_h7z93s8",
                                    "score": 3,
                                    "created_utc": 1628283012.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes.  Makes me wonder if she is Belgian.",
            "author": null,
            "id": "h7ykrqy",
            "parent_id": "t1_h7ykgk0",
            "score": 3,
            "created_utc": 1628271786.0,
            "replies": [
                {
                    "body": "Nice catch!",
                    "author": "dutchNfrenchHoe",
                    "id": "h7ykyci",
                    "parent_id": "t1_h7ykrqy",
                    "score": 6,
                    "created_utc": 1628271865.0,
                    "replies": [
                        {
                            "body": "Love the Spring Classics and Belgian beers!!",
                            "author": null,
                            "id": "h7ylj26",
                            "parent_id": "t1_h7ykyci",
                            "score": 1,
                            "created_utc": 1628272105.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think you realize that most SD’s don’t take their SB’s to the south of France, then gift them jewelry and xx,xxx for their investment account. Read all the stories on here, a lot of girls are lucky if their SD pays their ppm on time or doesn’t want to meet in a creepy basement office lol. \n\nYou’re definitely lucky and you have a whale SD even if you don’t think you do. Whatever he is spending on you is probably more than what 99% of most SB’s get on SA.",
            "author": null,
            "id": "h7z7vzw",
            "parent_id": "t1_h7z3kwc",
            "score": 31,
            "created_utc": 1628281806.0,
            "replies": [
                {
                    "body": "This is my second successful SR. \nMy ex gave me similar things (the investment gift is huge though, I’ll admit it) and introduced me to the lifestyle. What’s that English expression again.. struck lightning twice? I should try my luck at the lottery!",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z9dvu",
                    "parent_id": "t1_h7z7vzw",
                    "score": 6,
                    "created_utc": 1628282472.0,
                    "replies": [
                        {
                            "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
                            "author": null,
                            "id": "h7z9ka6",
                            "parent_id": "t1_h7z9dvu",
                            "score": 5,
                            "created_utc": 1628282552.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Creepy basement office sounds interesting. I might have to up my game. 😁",
                    "author": "ChapterRelative",
                    "id": "h7zhjr4",
                    "parent_id": "t1_h7z7vzw",
                    "score": 0,
                    "created_utc": 1628286134.0,
                    "replies": [
                        {
                            "body": "Gotta step our creep game up lol.",
                            "author": null,
                            "id": "h7zkaov",
                            "parent_id": "t1_h7zhjr4",
                            "score": 1,
                            "created_utc": 1628287393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hope my SB doesn't read this, she'll be jealous. I rent a house for her in a good neighborhood, paid for a used luxury car plus a few thousand for spending cash, but we've certainly never gone on lavish vacations nor have I gotten her if 5 figure gifts At this point she's more of a second wife after over 10 years.",
            "author": "drleeisinsurgery",
            "id": "h7zgxii",
            "parent_id": "t1_h7z3kwc",
            "score": 7,
            "created_utc": 1628285853.0,
            "replies": [
                {
                    "body": "That’s sweet. You sound sweet. 10 years is amazing and you both being happy is the most important.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7ziehx",
                    "parent_id": "t1_h7zgxii",
                    "score": 7,
                    "created_utc": 1628286525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Milan v New York is interesting. I would have thought they were similar in terms of cost. Is Milan much cheaper? Maybe it's time to move.",
            "author": "ChapterRelative",
            "id": "h7z6gqk",
            "parent_id": "t1_h7z3kwc",
            "score": 2,
            "created_utc": 1628281166.0,
            "replies": [
                {
                    "body": "Milan is the most expensive place in Italy, but it’s cheaper than New York to live in. The most significant expense there is rent, but everything else is alright. 100€/month on groceries, 130€/month for utilities (water, electricity, internet, heating). The South of Europe, along Eastern Europe are pretty cheap to live in.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z7978",
                    "parent_id": "t1_h7z6gqk",
                    "score": 3,
                    "created_utc": 1628281520.0,
                    "replies": []
                },
                {
                    "body": "Agreed. I would think Milan is a pretty expensive City to live in.",
                    "author": null,
                    "id": "h7z7cc3",
                    "parent_id": "t1_h7z6gqk",
                    "score": 1,
                    "created_utc": 1628281558.0,
                    "replies": [
                        {
                            "body": "Of course, what do we know, we're splenda!",
                            "author": "ChapterRelative",
                            "id": "h7z7gx7",
                            "parent_id": "t1_h7z7cc3",
                            "score": 1,
                            "created_utc": 1628281617.0,
                            "replies": [
                                {
                                    "body": "Splenda and dumb lol.",
                                    "author": null,
                                    "id": "h7z80dh",
                                    "parent_id": "t1_h7z7gx7",
                                    "score": 3,
                                    "created_utc": 1628281862.0,
                                    "replies": [
                                        {
                                            "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                                            "author": "ChapterRelative",
                                            "id": "h7z8huz",
                                            "parent_id": "t1_h7z80dh",
                                            "score": 1,
                                            "created_utc": 1628282076.0,
                                            "replies": [
                                                {
                                                    "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h7zatf0",
                                                    "parent_id": "t1_h7z8huz",
                                                    "score": 6,
                                                    "created_utc": 1628283103.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                                            "author": "ChapterRelative",
                                                            "id": "h7zbkq2",
                                                            "parent_id": "t1_h7zatf0",
                                                            "score": 2,
                                                            "created_utc": 1628283437.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No need to be rude.",
            "author": "dutchNfrenchHoe",
            "id": "h7z3le0",
            "parent_id": "t1_h7z2up5",
            "score": 8,
            "created_utc": 1628279902.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h7z4mz9",
                    "parent_id": "t1_h7z3le0",
                    "score": -3,
                    "created_utc": 1628280357.0,
                    "replies": [
                        {
                            "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z4rt2",
                            "parent_id": "t1_h7z4mz9",
                            "score": 11,
                            "created_utc": 1628280416.0,
                            "replies": [
                                {
                                    "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                                    "author": "xofcups",
                                    "id": "h7z6re0",
                                    "parent_id": "t1_h7z4rt2",
                                    "score": 6,
                                    "created_utc": 1628281300.0,
                                    "replies": [
                                        {
                                            "body": "🥺 aw, thank you!!!",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7z7cj2",
                                            "parent_id": "t1_h7z6re0",
                                            "score": 2,
                                            "created_utc": 1628281560.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                                    "author": "princesspoppy77",
                                    "id": "h7z9caz",
                                    "parent_id": "t1_h7z4rt2",
                                    "score": -5,
                                    "created_utc": 1628282452.0,
                                    "replies": [
                                        {
                                            "body": "No, you really were being condescending. You still are.",
                                            "author": "Cdnsugarr",
                                            "id": "h7zfrxt",
                                            "parent_id": "t1_h7z9caz",
                                            "score": 4,
                                            "created_utc": 1628285331.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "With the way you talk of him and his wealth here, perhaps you'll soon find out if you think he's not good enough because he's not flying private.",
            "author": "Persianx6",
            "id": "h82odq8",
            "parent_id": "t1_h803emt",
            "score": 1,
            "created_utc": 1628355862.0,
            "replies": [
                {
                    "body": "I travel with him all the time and we usually fly business, not first-class. He automatically gets an upgrade for flights, trains and hotels. This time he willingly took the most expensive room for my birthday, but it’s not a recurring thing. I’m very happy with him and our relationship and we’ve been together for almost a year.",
                    "author": "dutchNfrenchHoe",
                    "id": "h82p09l",
                    "parent_id": "t1_h82odq8",
                    "score": 4,
                    "created_utc": 1628356156.0,
                    "replies": [
                        {
                            "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
                            "author": "Persianx6",
                            "id": "h82r2q3",
                            "parent_id": "t1_h82p09l",
                            "score": 1,
                            "created_utc": 1628357116.0,
                            "replies": [
                                {
                                    "body": "You are projecting.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h82r6tf",
                                    "parent_id": "t1_h82r2q3",
                                    "score": 6,
                                    "created_utc": 1628357168.0,
                                    "replies": [
                                        {
                                            "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                                            "author": "Persianx6",
                                            "id": "h82rufg",
                                            "parent_id": "t1_h82r6tf",
                                            "score": 0,
                                            "created_utc": 1628357469.0,
                                            "replies": [
                                                {
                                                    "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                                    "author": null,
                                                    "id": "h83kp0a",
                                                    "parent_id": "t1_h82rufg",
                                                    "score": 1,
                                                    "created_utc": 1628371289.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very unusual for truly wealthy guys to go bonkers on their wealth details especially to folks who they are in an obvious transient relationship with.",
            "author": null,
            "id": "h81zhzj",
            "parent_id": "t1_h81ylqp",
            "score": 1,
            "created_utc": 1628343718.0,
            "replies": [
                {
                    "body": "We are beyond a “transient relationship”. I’ll tell you even more:\n1. I know where he works and have been to his office multiple times. I also travel with him —when I’m not too busy with college,  for work. So he’ll have his meetings, I’ll be chilling at the Champs-Elysées or at the Piazza del Popolo (or wherever he needs to go) and we’ll spend time together in the morning and evening. \n2. He’s “Googleable”.\n3. I’ve seen some of his tax returns. It was actually accidental, we were chilling in bed and I asked him what he was carrying in his backpack. He said some work documents. I asked if I could take a look, he told me to go ahead. I accidentally picked his personal folder, not the work one and only realised when I saw one of his dividends returns, but I put it back immediately.\n4. He eventually wants children with me, which I don’t, but would I say yes, the following would be put in a contract and revised by a lawyer of my choosing —the lawyer fees would indirectly be paid by him:\n* I get a house, although the usufruit, the nue-propriété will go to the child\n* His wealth will be equally divided amongst the children, with a set trust fund, for which I’ll be responsible for until they turn 18. He’ll live off the dividends his portfolio returns, and leave the rest behind to his children. So that’s 8 figures split amongst 1-3 kids.\n5. He has proposed to move me into one of said properties. I refused because I’d rather live close to campus and like the student experience. \n\nFree of you not to believe me!",
                    "author": "dutchNfrenchHoe",
                    "id": "h820i2i",
                    "parent_id": "t1_h81zhzj",
                    "score": 7,
                    "created_utc": 1628344261.0,
                    "replies": [
                        {
                            "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
                            "author": null,
                            "id": "h82an8r",
                            "parent_id": "t1_h820i2i",
                            "score": 2,
                            "created_utc": 1628349403.0,
                            "replies": [
                                {
                                    "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h82ba9h",
                                    "parent_id": "t1_h82an8r",
                                    "score": 8,
                                    "created_utc": 1628349709.0,
                                    "replies": [
                                        {
                                            "body": "Pretty accurate.",
                                            "author": "BlissfulSB",
                                            "id": "h82qrlo",
                                            "parent_id": "t1_h82ba9h",
                                            "score": 5,
                                            "created_utc": 1628356972.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                                            "author": null,
                                            "id": "h82dh6c",
                                            "parent_id": "t1_h82ba9h",
                                            "score": -1,
                                            "created_utc": 1628350750.0,
                                            "replies": [
                                                {
                                                    "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h82feu8",
                                                    "parent_id": "t1_h82dh6c",
                                                    "score": 10,
                                                    "created_utc": 1628351666.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "h82r7mf",
                                                            "parent_id": "t1_h82feu8",
                                                            "score": 8,
                                                            "created_utc": 1628357178.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                                    "author": "dutchNfrenchHoe",
                                                                    "id": "h82rzx2",
                                                                    "parent_id": "t1_h82r7mf",
                                                                    "score": 6,
                                                                    "created_utc": 1628357539.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "h82r0ee",
                                                    "parent_id": "t1_h82dh6c",
                                                    "score": 7,
                                                    "created_utc": 1628357085.0,
                                                    "replies": [
                                                        {
                                                            "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                                            "author": null,
                                                            "id": "h83jnns",
                                                            "parent_id": "t1_h82r0ee",
                                                            "score": 0,
                                                            "created_utc": 1628370777.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry girl. How did you know he was cheating?",
            "author": "dutchNfrenchHoe",
            "id": "h7z2q44",
            "parent_id": "t1_h7z1x7e",
            "score": 3,
            "created_utc": 1628279519.0,
            "replies": [
                {
                    "body": "I had a dream, and it disturbed me; when I woke, I sat straight up in my bed, and I and I said to myself, he's cheating.  I knew it in my heart.  So, I got out of bed and called him.  I live in the US; he lived in Germany.  I've only called him twice in our three-year romance because of the expense, but he had a special discount for businesses.  Guess who answered the phone?",
                    "author": "Darknlovely38",
                    "id": "h7z93s8",
                    "parent_id": "t1_h7z2q44",
                    "score": 3,
                    "created_utc": 1628282347.0,
                    "replies": [
                        {
                            "body": "I’m so sorry. Sending you hugs.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7zalzi",
                            "parent_id": "t1_h7z93s8",
                            "score": 3,
                            "created_utc": 1628283012.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nice catch!",
            "author": "dutchNfrenchHoe",
            "id": "h7ykyci",
            "parent_id": "t1_h7ykrqy",
            "score": 6,
            "created_utc": 1628271865.0,
            "replies": [
                {
                    "body": "Love the Spring Classics and Belgian beers!!",
                    "author": null,
                    "id": "h7ylj26",
                    "parent_id": "t1_h7ykyci",
                    "score": 1,
                    "created_utc": 1628272105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is my second successful SR. \nMy ex gave me similar things (the investment gift is huge though, I’ll admit it) and introduced me to the lifestyle. What’s that English expression again.. struck lightning twice? I should try my luck at the lottery!",
            "author": "dutchNfrenchHoe",
            "id": "h7z9dvu",
            "parent_id": "t1_h7z7vzw",
            "score": 6,
            "created_utc": 1628282472.0,
            "replies": [
                {
                    "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
                    "author": null,
                    "id": "h7z9ka6",
                    "parent_id": "t1_h7z9dvu",
                    "score": 5,
                    "created_utc": 1628282552.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Creepy basement office sounds interesting. I might have to up my game. 😁",
            "author": "ChapterRelative",
            "id": "h7zhjr4",
            "parent_id": "t1_h7z7vzw",
            "score": 0,
            "created_utc": 1628286134.0,
            "replies": [
                {
                    "body": "Gotta step our creep game up lol.",
                    "author": null,
                    "id": "h7zkaov",
                    "parent_id": "t1_h7zhjr4",
                    "score": 1,
                    "created_utc": 1628287393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s sweet. You sound sweet. 10 years is amazing and you both being happy is the most important.",
            "author": "dutchNfrenchHoe",
            "id": "h7ziehx",
            "parent_id": "t1_h7zgxii",
            "score": 7,
            "created_utc": 1628286525.0,
            "replies": []
        },
        {
            "body": "Milan is the most expensive place in Italy, but it’s cheaper than New York to live in. The most significant expense there is rent, but everything else is alright. 100€/month on groceries, 130€/month for utilities (water, electricity, internet, heating). The South of Europe, along Eastern Europe are pretty cheap to live in.",
            "author": "dutchNfrenchHoe",
            "id": "h7z7978",
            "parent_id": "t1_h7z6gqk",
            "score": 3,
            "created_utc": 1628281520.0,
            "replies": []
        },
        {
            "body": "Agreed. I would think Milan is a pretty expensive City to live in.",
            "author": null,
            "id": "h7z7cc3",
            "parent_id": "t1_h7z6gqk",
            "score": 1,
            "created_utc": 1628281558.0,
            "replies": [
                {
                    "body": "Of course, what do we know, we're splenda!",
                    "author": "ChapterRelative",
                    "id": "h7z7gx7",
                    "parent_id": "t1_h7z7cc3",
                    "score": 1,
                    "created_utc": 1628281617.0,
                    "replies": [
                        {
                            "body": "Splenda and dumb lol.",
                            "author": null,
                            "id": "h7z80dh",
                            "parent_id": "t1_h7z7gx7",
                            "score": 3,
                            "created_utc": 1628281862.0,
                            "replies": [
                                {
                                    "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                                    "author": "ChapterRelative",
                                    "id": "h7z8huz",
                                    "parent_id": "t1_h7z80dh",
                                    "score": 1,
                                    "created_utc": 1628282076.0,
                                    "replies": [
                                        {
                                            "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h7zatf0",
                                            "parent_id": "t1_h7z8huz",
                                            "score": 6,
                                            "created_utc": 1628283103.0,
                                            "replies": [
                                                {
                                                    "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                                    "author": "ChapterRelative",
                                                    "id": "h7zbkq2",
                                                    "parent_id": "t1_h7zatf0",
                                                    "score": 2,
                                                    "created_utc": 1628283437.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h7z4mz9",
            "parent_id": "t1_h7z3le0",
            "score": -3,
            "created_utc": 1628280357.0,
            "replies": [
                {
                    "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z4rt2",
                    "parent_id": "t1_h7z4mz9",
                    "score": 11,
                    "created_utc": 1628280416.0,
                    "replies": [
                        {
                            "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                            "author": "xofcups",
                            "id": "h7z6re0",
                            "parent_id": "t1_h7z4rt2",
                            "score": 6,
                            "created_utc": 1628281300.0,
                            "replies": [
                                {
                                    "body": "🥺 aw, thank you!!!",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7z7cj2",
                                    "parent_id": "t1_h7z6re0",
                                    "score": 2,
                                    "created_utc": 1628281560.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                            "author": "princesspoppy77",
                            "id": "h7z9caz",
                            "parent_id": "t1_h7z4rt2",
                            "score": -5,
                            "created_utc": 1628282452.0,
                            "replies": [
                                {
                                    "body": "No, you really were being condescending. You still are.",
                                    "author": "Cdnsugarr",
                                    "id": "h7zfrxt",
                                    "parent_id": "t1_h7z9caz",
                                    "score": 4,
                                    "created_utc": 1628285331.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I travel with him all the time and we usually fly business, not first-class. He automatically gets an upgrade for flights, trains and hotels. This time he willingly took the most expensive room for my birthday, but it’s not a recurring thing. I’m very happy with him and our relationship and we’ve been together for almost a year.",
            "author": "dutchNfrenchHoe",
            "id": "h82p09l",
            "parent_id": "t1_h82odq8",
            "score": 4,
            "created_utc": 1628356156.0,
            "replies": [
                {
                    "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
                    "author": "Persianx6",
                    "id": "h82r2q3",
                    "parent_id": "t1_h82p09l",
                    "score": 1,
                    "created_utc": 1628357116.0,
                    "replies": [
                        {
                            "body": "You are projecting.",
                            "author": "dutchNfrenchHoe",
                            "id": "h82r6tf",
                            "parent_id": "t1_h82r2q3",
                            "score": 6,
                            "created_utc": 1628357168.0,
                            "replies": [
                                {
                                    "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                                    "author": "Persianx6",
                                    "id": "h82rufg",
                                    "parent_id": "t1_h82r6tf",
                                    "score": 0,
                                    "created_utc": 1628357469.0,
                                    "replies": [
                                        {
                                            "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                            "author": null,
                                            "id": "h83kp0a",
                                            "parent_id": "t1_h82rufg",
                                            "score": 1,
                                            "created_utc": 1628371289.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We are beyond a “transient relationship”. I’ll tell you even more:\n1. I know where he works and have been to his office multiple times. I also travel with him —when I’m not too busy with college,  for work. So he’ll have his meetings, I’ll be chilling at the Champs-Elysées or at the Piazza del Popolo (or wherever he needs to go) and we’ll spend time together in the morning and evening. \n2. He’s “Googleable”.\n3. I’ve seen some of his tax returns. It was actually accidental, we were chilling in bed and I asked him what he was carrying in his backpack. He said some work documents. I asked if I could take a look, he told me to go ahead. I accidentally picked his personal folder, not the work one and only realised when I saw one of his dividends returns, but I put it back immediately.\n4. He eventually wants children with me, which I don’t, but would I say yes, the following would be put in a contract and revised by a lawyer of my choosing —the lawyer fees would indirectly be paid by him:\n* I get a house, although the usufruit, the nue-propriété will go to the child\n* His wealth will be equally divided amongst the children, with a set trust fund, for which I’ll be responsible for until they turn 18. He’ll live off the dividends his portfolio returns, and leave the rest behind to his children. So that’s 8 figures split amongst 1-3 kids.\n5. He has proposed to move me into one of said properties. I refused because I’d rather live close to campus and like the student experience. \n\nFree of you not to believe me!",
            "author": "dutchNfrenchHoe",
            "id": "h820i2i",
            "parent_id": "t1_h81zhzj",
            "score": 7,
            "created_utc": 1628344261.0,
            "replies": [
                {
                    "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
                    "author": null,
                    "id": "h82an8r",
                    "parent_id": "t1_h820i2i",
                    "score": 2,
                    "created_utc": 1628349403.0,
                    "replies": [
                        {
                            "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                            "author": "dutchNfrenchHoe",
                            "id": "h82ba9h",
                            "parent_id": "t1_h82an8r",
                            "score": 8,
                            "created_utc": 1628349709.0,
                            "replies": [
                                {
                                    "body": "Pretty accurate.",
                                    "author": "BlissfulSB",
                                    "id": "h82qrlo",
                                    "parent_id": "t1_h82ba9h",
                                    "score": 5,
                                    "created_utc": 1628356972.0,
                                    "replies": []
                                },
                                {
                                    "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                                    "author": null,
                                    "id": "h82dh6c",
                                    "parent_id": "t1_h82ba9h",
                                    "score": -1,
                                    "created_utc": 1628350750.0,
                                    "replies": [
                                        {
                                            "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h82feu8",
                                            "parent_id": "t1_h82dh6c",
                                            "score": 10,
                                            "created_utc": 1628351666.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "h82r7mf",
                                                    "parent_id": "t1_h82feu8",
                                                    "score": 8,
                                                    "created_utc": 1628357178.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                            "author": "dutchNfrenchHoe",
                                                            "id": "h82rzx2",
                                                            "parent_id": "t1_h82r7mf",
                                                            "score": 6,
                                                            "created_utc": 1628357539.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h82r0ee",
                                            "parent_id": "t1_h82dh6c",
                                            "score": 7,
                                            "created_utc": 1628357085.0,
                                            "replies": [
                                                {
                                                    "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                                    "author": null,
                                                    "id": "h83jnns",
                                                    "parent_id": "t1_h82r0ee",
                                                    "score": 0,
                                                    "created_utc": 1628370777.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a dream, and it disturbed me; when I woke, I sat straight up in my bed, and I and I said to myself, he's cheating.  I knew it in my heart.  So, I got out of bed and called him.  I live in the US; he lived in Germany.  I've only called him twice in our three-year romance because of the expense, but he had a special discount for businesses.  Guess who answered the phone?",
            "author": "Darknlovely38",
            "id": "h7z93s8",
            "parent_id": "t1_h7z2q44",
            "score": 3,
            "created_utc": 1628282347.0,
            "replies": [
                {
                    "body": "I’m so sorry. Sending you hugs.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7zalzi",
                    "parent_id": "t1_h7z93s8",
                    "score": 3,
                    "created_utc": 1628283012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love the Spring Classics and Belgian beers!!",
            "author": null,
            "id": "h7ylj26",
            "parent_id": "t1_h7ykyci",
            "score": 1,
            "created_utc": 1628272105.0,
            "replies": []
        },
        {
            "body": "Yes, you struck lightning twice. You must be a baddie, as the Americans say lol.",
            "author": null,
            "id": "h7z9ka6",
            "parent_id": "t1_h7z9dvu",
            "score": 5,
            "created_utc": 1628282552.0,
            "replies": []
        },
        {
            "body": "Gotta step our creep game up lol.",
            "author": null,
            "id": "h7zkaov",
            "parent_id": "t1_h7zhjr4",
            "score": 1,
            "created_utc": 1628287393.0,
            "replies": []
        },
        {
            "body": "Of course, what do we know, we're splenda!",
            "author": "ChapterRelative",
            "id": "h7z7gx7",
            "parent_id": "t1_h7z7cc3",
            "score": 1,
            "created_utc": 1628281617.0,
            "replies": [
                {
                    "body": "Splenda and dumb lol.",
                    "author": null,
                    "id": "h7z80dh",
                    "parent_id": "t1_h7z7gx7",
                    "score": 3,
                    "created_utc": 1628281862.0,
                    "replies": [
                        {
                            "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                            "author": "ChapterRelative",
                            "id": "h7z8huz",
                            "parent_id": "t1_h7z80dh",
                            "score": 1,
                            "created_utc": 1628282076.0,
                            "replies": [
                                {
                                    "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h7zatf0",
                                    "parent_id": "t1_h7z8huz",
                                    "score": 6,
                                    "created_utc": 1628283103.0,
                                    "replies": [
                                        {
                                            "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                            "author": "ChapterRelative",
                                            "id": "h7zbkq2",
                                            "parent_id": "t1_h7zatf0",
                                            "score": 2,
                                            "created_utc": 1628283437.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The “reality check” wasn’t necessary. I agree, he’s bo whale, but there’s no need to come off as condescending to someone who disagrees.",
            "author": "dutchNfrenchHoe",
            "id": "h7z4rt2",
            "parent_id": "t1_h7z4mz9",
            "score": 11,
            "created_utc": 1628280416.0,
            "replies": [
                {
                    "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
                    "author": "xofcups",
                    "id": "h7z6re0",
                    "parent_id": "t1_h7z4rt2",
                    "score": 6,
                    "created_utc": 1628281300.0,
                    "replies": [
                        {
                            "body": "🥺 aw, thank you!!!",
                            "author": "dutchNfrenchHoe",
                            "id": "h7z7cj2",
                            "parent_id": "t1_h7z6re0",
                            "score": 2,
                            "created_utc": 1628281560.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
                    "author": "princesspoppy77",
                    "id": "h7z9caz",
                    "parent_id": "t1_h7z4rt2",
                    "score": -5,
                    "created_utc": 1628282452.0,
                    "replies": [
                        {
                            "body": "No, you really were being condescending. You still are.",
                            "author": "Cdnsugarr",
                            "id": "h7zfrxt",
                            "parent_id": "t1_h7z9caz",
                            "score": 4,
                            "created_utc": 1628285331.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you actually happy with him? Because people who are happy in their relationships with people don't usually mention all the material things they're not getting being with someone before making the statement.",
            "author": "Persianx6",
            "id": "h82r2q3",
            "parent_id": "t1_h82p09l",
            "score": 1,
            "created_utc": 1628357116.0,
            "replies": [
                {
                    "body": "You are projecting.",
                    "author": "dutchNfrenchHoe",
                    "id": "h82r6tf",
                    "parent_id": "t1_h82r2q3",
                    "score": 6,
                    "created_utc": 1628357168.0,
                    "replies": [
                        {
                            "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                            "author": "Persianx6",
                            "id": "h82rufg",
                            "parent_id": "t1_h82r6tf",
                            "score": 0,
                            "created_utc": 1628357469.0,
                            "replies": [
                                {
                                    "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                                    "author": null,
                                    "id": "h83kp0a",
                                    "parent_id": "t1_h82rufg",
                                    "score": 1,
                                    "created_utc": 1628371289.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This started and ran super fast into fictional land. Number 3 and 4 especially. That said I am glad you are choosing to stay normal and live the student experience.",
            "author": null,
            "id": "h82an8r",
            "parent_id": "t1_h820i2i",
            "score": 2,
            "created_utc": 1628349403.0,
            "replies": [
                {
                    "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
                    "author": "dutchNfrenchHoe",
                    "id": "h82ba9h",
                    "parent_id": "t1_h82an8r",
                    "score": 8,
                    "created_utc": 1628349709.0,
                    "replies": [
                        {
                            "body": "Pretty accurate.",
                            "author": "BlissfulSB",
                            "id": "h82qrlo",
                            "parent_id": "t1_h82ba9h",
                            "score": 5,
                            "created_utc": 1628356972.0,
                            "replies": []
                        },
                        {
                            "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                            "author": null,
                            "id": "h82dh6c",
                            "parent_id": "t1_h82ba9h",
                            "score": -1,
                            "created_utc": 1628350750.0,
                            "replies": [
                                {
                                    "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h82feu8",
                                    "parent_id": "t1_h82dh6c",
                                    "score": 10,
                                    "created_utc": 1628351666.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h82r7mf",
                                            "parent_id": "t1_h82feu8",
                                            "score": 8,
                                            "created_utc": 1628357178.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                                    "author": "dutchNfrenchHoe",
                                                    "id": "h82rzx2",
                                                    "parent_id": "t1_h82r7mf",
                                                    "score": 6,
                                                    "created_utc": 1628357539.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h82r0ee",
                                    "parent_id": "t1_h82dh6c",
                                    "score": 7,
                                    "created_utc": 1628357085.0,
                                    "replies": [
                                        {
                                            "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                            "author": null,
                                            "id": "h83jnns",
                                            "parent_id": "t1_h82r0ee",
                                            "score": 0,
                                            "created_utc": 1628370777.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry. Sending you hugs.",
            "author": "dutchNfrenchHoe",
            "id": "h7zalzi",
            "parent_id": "t1_h7z93s8",
            "score": 3,
            "created_utc": 1628283012.0,
            "replies": []
        },
        {
            "body": "Splenda and dumb lol.",
            "author": null,
            "id": "h7z80dh",
            "parent_id": "t1_h7z7gx7",
            "score": 3,
            "created_utc": 1628281862.0,
            "replies": [
                {
                    "body": "So true. If I had half a brain I'd be living it up in Portugal.",
                    "author": "ChapterRelative",
                    "id": "h7z8huz",
                    "parent_id": "t1_h7z80dh",
                    "score": 1,
                    "created_utc": 1628282076.0,
                    "replies": [
                        {
                            "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                            "author": "dutchNfrenchHoe",
                            "id": "h7zatf0",
                            "parent_id": "t1_h7z8huz",
                            "score": 6,
                            "created_utc": 1628283103.0,
                            "replies": [
                                {
                                    "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                                    "author": "ChapterRelative",
                                    "id": "h7zbkq2",
                                    "parent_id": "t1_h7zatf0",
                                    "score": 2,
                                    "created_utc": 1628283437.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This type of class is probably why your SD is willing to go the extra mile. Love this for you. xo",
            "author": "xofcups",
            "id": "h7z6re0",
            "parent_id": "t1_h7z4rt2",
            "score": 6,
            "created_utc": 1628281300.0,
            "replies": [
                {
                    "body": "🥺 aw, thank you!!!",
                    "author": "dutchNfrenchHoe",
                    "id": "h7z7cj2",
                    "parent_id": "t1_h7z6re0",
                    "score": 2,
                    "created_utc": 1628281560.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao okay hun. The policing and virtue signaling is off the charts.",
            "author": "princesspoppy77",
            "id": "h7z9caz",
            "parent_id": "t1_h7z4rt2",
            "score": -5,
            "created_utc": 1628282452.0,
            "replies": [
                {
                    "body": "No, you really were being condescending. You still are.",
                    "author": "Cdnsugarr",
                    "id": "h7zfrxt",
                    "parent_id": "t1_h7z9caz",
                    "score": 4,
                    "created_utc": 1628285331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are projecting.",
            "author": "dutchNfrenchHoe",
            "id": "h82r6tf",
            "parent_id": "t1_h82r2q3",
            "score": 6,
            "created_utc": 1628357168.0,
            "replies": [
                {
                    "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
                    "author": "Persianx6",
                    "id": "h82rufg",
                    "parent_id": "t1_h82r6tf",
                    "score": 0,
                    "created_utc": 1628357469.0,
                    "replies": [
                        {
                            "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                            "author": null,
                            "id": "h83kp0a",
                            "parent_id": "t1_h82rufg",
                            "score": 1,
                            "created_utc": 1628371289.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "LOL.\nLike I said, free you are not to believe me. But your post history makes you come off as bitter, not wealthy enough to sustain a SR, and shows you see SBs as a replaceable commodity whose value is based “off the market”. Do not project your wants and experiences onto other people. I have a 50k stock portfolio at 20 thanks to this man, and I’m incredibly grateful for it.",
            "author": "dutchNfrenchHoe",
            "id": "h82ba9h",
            "parent_id": "t1_h82an8r",
            "score": 8,
            "created_utc": 1628349709.0,
            "replies": [
                {
                    "body": "Pretty accurate.",
                    "author": "BlissfulSB",
                    "id": "h82qrlo",
                    "parent_id": "t1_h82ba9h",
                    "score": 5,
                    "created_utc": 1628356972.0,
                    "replies": []
                },
                {
                    "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
                    "author": null,
                    "id": "h82dh6c",
                    "parent_id": "t1_h82ba9h",
                    "score": -1,
                    "created_utc": 1628350750.0,
                    "replies": [
                        {
                            "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                            "author": "dutchNfrenchHoe",
                            "id": "h82feu8",
                            "parent_id": "t1_h82dh6c",
                            "score": 10,
                            "created_utc": 1628351666.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h82r7mf",
                                    "parent_id": "t1_h82feu8",
                                    "score": 8,
                                    "created_utc": 1628357178.0,
                                    "replies": [
                                        {
                                            "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                            "author": "dutchNfrenchHoe",
                                            "id": "h82rzx2",
                                            "parent_id": "t1_h82r7mf",
                                            "score": 6,
                                            "created_utc": 1628357539.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h82r0ee",
                            "parent_id": "t1_h82dh6c",
                            "score": 7,
                            "created_utc": 1628357085.0,
                            "replies": [
                                {
                                    "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                                    "author": null,
                                    "id": "h83jnns",
                                    "parent_id": "t1_h82r0ee",
                                    "score": 0,
                                    "created_utc": 1628370777.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So true. If I had half a brain I'd be living it up in Portugal.",
            "author": "ChapterRelative",
            "id": "h7z8huz",
            "parent_id": "t1_h7z80dh",
            "score": 1,
            "created_utc": 1628282076.0,
            "replies": [
                {
                    "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
                    "author": "dutchNfrenchHoe",
                    "id": "h7zatf0",
                    "parent_id": "t1_h7z8huz",
                    "score": 6,
                    "created_utc": 1628283103.0,
                    "replies": [
                        {
                            "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                            "author": "ChapterRelative",
                            "id": "h7zbkq2",
                            "parent_id": "t1_h7zatf0",
                            "score": 2,
                            "created_utc": 1628283437.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🥺 aw, thank you!!!",
            "author": "dutchNfrenchHoe",
            "id": "h7z7cj2",
            "parent_id": "t1_h7z6re0",
            "score": 2,
            "created_utc": 1628281560.0,
            "replies": []
        },
        {
            "body": "No, you really were being condescending. You still are.",
            "author": "Cdnsugarr",
            "id": "h7zfrxt",
            "parent_id": "t1_h7z9caz",
            "score": 4,
            "created_utc": 1628285331.0,
            "replies": []
        },
        {
            "body": "Of course you would say such, but again, it's not me who writes such words then claims he is happy. \n\nYou don't sound happy.",
            "author": "Persianx6",
            "id": "h82rufg",
            "parent_id": "t1_h82r6tf",
            "score": 0,
            "created_utc": 1628357469.0,
            "replies": [
                {
                    "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
                    "author": null,
                    "id": "h83kp0a",
                    "parent_id": "t1_h82rufg",
                    "score": 1,
                    "created_utc": 1628371289.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pretty accurate.",
            "author": "BlissfulSB",
            "id": "h82qrlo",
            "parent_id": "t1_h82ba9h",
            "score": 5,
            "created_utc": 1628356972.0,
            "replies": []
        },
        {
            "body": "Dead wrong but I will be more kind. I think you ought to explore a career in fiction writing. There might be something there.",
            "author": null,
            "id": "h82dh6c",
            "parent_id": "t1_h82ba9h",
            "score": -1,
            "created_utc": 1628350750.0,
            "replies": [
                {
                    "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
                    "author": "dutchNfrenchHoe",
                    "id": "h82feu8",
                    "parent_id": "t1_h82dh6c",
                    "score": 10,
                    "created_utc": 1628351666.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h82r7mf",
                            "parent_id": "t1_h82feu8",
                            "score": 8,
                            "created_utc": 1628357178.0,
                            "replies": [
                                {
                                    "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                                    "author": "dutchNfrenchHoe",
                                    "id": "h82rzx2",
                                    "parent_id": "t1_h82r7mf",
                                    "score": 6,
                                    "created_utc": 1628357539.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h82r0ee",
                    "parent_id": "t1_h82dh6c",
                    "score": 7,
                    "created_utc": 1628357085.0,
                    "replies": [
                        {
                            "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                            "author": null,
                            "id": "h83jnns",
                            "parent_id": "t1_h82r0ee",
                            "score": 0,
                            "created_utc": 1628370777.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t know if you’re being sarcastic or not but Portugal is REALLY cheap. One of the cheapest vacations I’ve ever paid for when I went with friends.",
            "author": "dutchNfrenchHoe",
            "id": "h7zatf0",
            "parent_id": "t1_h7z8huz",
            "score": 6,
            "created_utc": 1628283103.0,
            "replies": [
                {
                    "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
                    "author": "ChapterRelative",
                    "id": "h7zbkq2",
                    "parent_id": "t1_h7zatf0",
                    "score": 2,
                    "created_utc": 1628283437.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At some point fiction can be very hard to manage and maintain. That’s what is going on with OP.",
            "author": null,
            "id": "h83kp0a",
            "parent_id": "t1_h82rufg",
            "score": 1,
            "created_utc": 1628371289.0,
            "replies": []
        },
        {
            "body": "This is a sugar forum... in which someone is doubting me because my SD is giving me sugar? Lol whut😂",
            "author": "dutchNfrenchHoe",
            "id": "h82feu8",
            "parent_id": "t1_h82dh6c",
            "score": 10,
            "created_utc": 1628351666.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h82r7mf",
                    "parent_id": "t1_h82feu8",
                    "score": 8,
                    "created_utc": 1628357178.0,
                    "replies": [
                        {
                            "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                            "author": "dutchNfrenchHoe",
                            "id": "h82rzx2",
                            "parent_id": "t1_h82r7mf",
                            "score": 6,
                            "created_utc": 1628357539.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h82r0ee",
            "parent_id": "t1_h82dh6c",
            "score": 7,
            "created_utc": 1628357085.0,
            "replies": [
                {
                    "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
                    "author": null,
                    "id": "h83jnns",
                    "parent_id": "t1_h82r0ee",
                    "score": 0,
                    "created_utc": 1628370777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's what I heard too. Never been though. But, hey, a Tuscan villa looks way cheaper than my city apartment in Boston. For what I pay here, I could get two. One for me and one for an SB. :)",
            "author": "ChapterRelative",
            "id": "h7zbkq2",
            "parent_id": "t1_h7zatf0",
            "score": 2,
            "created_utc": 1628283437.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h82r7mf",
            "parent_id": "t1_h82feu8",
            "score": 8,
            "created_utc": 1628357178.0,
            "replies": [
                {
                    "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
                    "author": "dutchNfrenchHoe",
                    "id": "h82rzx2",
                    "parent_id": "t1_h82r7mf",
                    "score": 6,
                    "created_utc": 1628357539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would you take a ppm less than you want ? No I guess is the answer. You know your worth and you stay your ground. Same way I have been super successful in the bowl without overreaching on the allowance side. Yes that number will get stretched once I get older or heavier. Sure it will take nothing else but (desperate) generosity for an 80 yo man to date a 20’yo woman. I am not debating that and the four figure ppm might absolutely be warrranted in that case. For now life is super awesome.",
            "author": null,
            "id": "h83jnns",
            "parent_id": "t1_h82r0ee",
            "score": 0,
            "created_utc": 1628370777.0,
            "replies": []
        },
        {
            "body": "Thank you!! I want this for all the SBs here. It seem like I struck a nerve with some of these SDs. My own SD doesn’t consider himself “a whale”. He’s often around partners, heirs, entrepreneurs who have triple his wealth. Of course, the nature of his job makes it so but I have no doubt the potential SBs of those are getting what I’m getting and much more. I doubt the girl sitting next to me at the bar in the Sofitel Le Faubourg is getting a one bedroom / 4 PPM.",
            "author": "dutchNfrenchHoe",
            "id": "h82rzx2",
            "parent_id": "t1_h82r7mf",
            "score": 6,
            "created_utc": 1628357539.0,
            "replies": []
        }
    ]
}