{
    "title": "Father's Day Fiasco: POT SD Vs Dad",
    "post_id": "vg0r4f",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vg0r4f/fathers_day_fiasco_pot_sd_vs_dad/",
    "author": "DottiesHotSake",
    "body": "It's Father's Day and I made plans with my Dad for the next few days since he's visiting me. I wasn't expecting any POT SDs to reach out to me but one did. He was indirectly making hints to see me, but never planned an actual date.  I told him I would like to see him on my day off so we would have more time together. He was attempting to do a spontaneous m&g with this sense of urgency (most likely wanted sex before he leaves for work). He travels out of state for work from time to time. POT SD's availability was for today and tomorrow. \n\nI asked him *\"If I can squeeze you in tomorrow would you be okay with that? What did you have planned for us?\"*\n\nHe got upset at the small, innocent phrase of *\"squeeze you in.\"* He also got upset at me for me wanting to spend time with my Dad and thought his high PPM could sway me into cancelling plans with my father. These C-suite level men and their tempers...\n\nI tried twice suggesting what days to see him. He shot them both down. It's out of my hands and I'm okay with that. I get to eat steak with my Dad. <3",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vg0r4f/fathers_day_fiasco_pot_sd_vs_dad/",
    "score": 117,
    "upvote_ratio": 0.95,
    "created_utc": 1655661567.0,
    "num_comments": 65,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Family comes first, fuck everyone who doesn’t respect that.",
            "author": null,
            "id": "icywr65",
            "parent_id": "t3_vg0r4f",
            "score": 127,
            "created_utc": 1655662454.0,
            "replies": [
                {
                    "body": "Not only that but this is only a POT .......   \n\nBut yes if someone does not understand that parents and kids  are important ,  the chances of them being a good SD or SB is about the same as that of winning the lottery.",
                    "author": "pinotandsugar",
                    "id": "id0czdi",
                    "parent_id": "t1_icywr65",
                    "score": 21,
                    "created_utc": 1655688235.0,
                    "replies": [
                        {
                            "body": "Beautifully put <3",
                            "author": "DottiesHotSake",
                            "id": "id0kvhg",
                            "parent_id": "t1_id0czdi",
                            "score": 4,
                            "created_utc": 1655692634.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you. <3",
                    "author": "DottiesHotSake",
                    "id": "icz4t2x",
                    "parent_id": "t1_icywr65",
                    "score": 17,
                    "created_utc": 1655666150.0,
                    "replies": []
                },
                {
                    "body": "Definitely this",
                    "author": "mraspencer",
                    "id": "iczcc0k",
                    "parent_id": "t1_icywr65",
                    "score": 8,
                    "created_utc": 1655669607.0,
                    "replies": []
                },
                {
                    "body": "100%",
                    "author": "Scarlettluxxx72",
                    "id": "iczotmn",
                    "parent_id": "t1_icywr65",
                    "score": 3,
                    "created_utc": 1655675528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If an SD cannot respect an SB's family, then they won't respect the SB either.\n\nHonestly it's as simple as that.\n\nNo excuse for his behaviour!",
            "author": null,
            "id": "icz004w",
            "parent_id": "t3_vg0r4f",
            "score": 63,
            "created_utc": 1655663949.0,
            "replies": [
                {
                    "body": "Concept works both ways  too",
                    "author": "pinotandsugar",
                    "id": "id0595n",
                    "parent_id": "t1_icz004w",
                    "score": 1,
                    "created_utc": 1655684015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's Father's Day ffs. He can't ACTUALLY expect you to blow off your dad on Father's Day...",
            "author": "Then-Explanation8567",
            "id": "icz41ui",
            "parent_id": "t3_vg0r4f",
            "score": 30,
            "created_utc": 1655665799.0,
            "replies": [
                {
                    "body": "That's exactly what he was expecting.\n\nHe said \"Our schedules aren't aligning\"\n\nOn a flipping holiday.",
                    "author": "DottiesHotSake",
                    "id": "icz484f",
                    "parent_id": "t1_icz41ui",
                    "score": 9,
                    "created_utc": 1655665879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yikes, some real assholes out in the world",
            "author": "sparky_SD16",
            "id": "icyvdzf",
            "parent_id": "t3_vg0r4f",
            "score": 21,
            "created_utc": 1655661811.0,
            "replies": [
                {
                    "body": "I know\n\nIt truly saddens me.",
                    "author": "DottiesHotSake",
                    "id": "icz5lys",
                    "parent_id": "t1_icyvdzf",
                    "score": 6,
                    "created_utc": 1655666519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Now you know why his kids are not doing anything for him.",
            "author": "LotBuilder",
            "id": "iczfwyo",
            "parent_id": "t3_vg0r4f",
            "score": 21,
            "created_utc": 1655671264.0,
            "replies": [
                {
                    "body": "I feel terrible for laughing, but I'm laughing at the Dad jokes haha.",
                    "author": "DottiesHotSake",
                    "id": "id0l0cz",
                    "parent_id": "t1_iczfwyo",
                    "score": 5,
                    "created_utc": 1655692710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s really a flaming red flag of entitlement.\n\nHave fun with your Dad.",
            "author": "Akavinceblack",
            "id": "iczdp8s",
            "parent_id": "t3_vg0r4f",
            "score": 10,
            "created_utc": 1655670240.0,
            "replies": [
                {
                    "body": "Thank you for the kind comment. I hope you had a great weekend <3.",
                    "author": "DottiesHotSake",
                    "id": "id0n2vu",
                    "parent_id": "t1_iczdp8s",
                    "score": 3,
                    "created_utc": 1655693870.0,
                    "replies": [
                        {
                            "body": "It’s been grand, thank you!",
                            "author": "Akavinceblack",
                            "id": "id0pfx6",
                            "parent_id": "t1_id0n2vu",
                            "score": 3,
                            "created_utc": 1655695234.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That guy is an idiot, stay away from him!",
            "author": "Foreign-Concern436",
            "id": "iczdgi2",
            "parent_id": "t3_vg0r4f",
            "score": 5,
            "created_utc": 1655670128.0,
            "replies": [
                {
                    "body": "He blocked me so I think I'm safe haha. Thank you for the kind words.",
                    "author": "DottiesHotSake",
                    "id": "id0o3p3",
                    "parent_id": "t1_iczdgi2",
                    "score": 2,
                    "created_utc": 1655694450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why would you be ok with squeezing him in at all with his sense of urgency to have sex immediately upon meeting?",
            "author": null,
            "id": "icywq0z",
            "parent_id": "t3_vg0r4f",
            "score": 8,
            "created_utc": 1655662440.0,
            "replies": [
                {
                    "body": "I made the assumption due to his behavior, thinking there's a chance I could be wrong, but I wasn't wrong now seeing how he behaved.\n\nPlus, I was horny. Haha. I wasn't against seeing him, just didn't care for his hissy fit.",
                    "author": "DottiesHotSake",
                    "id": "icyxgrj",
                    "parent_id": "t1_icywq0z",
                    "score": 16,
                    "created_utc": 1655662781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes this guy is unreasonable (and you should next him, of course) but, I hate to say it, so are you.  It’s Father’s Day weekend.  Your father is visiting you, which suggests that you don’t see him all the time.  I can see how you might have a slight dilemma if this were a long-standing SR but this is a POT?!  Someone else said it and I’ll repeat it:  family comes first, period.",
            "author": "leyapaul",
            "id": "id08nbf",
            "parent_id": "t3_vg0r4f",
            "score": 4,
            "created_utc": 1655685859.0,
            "replies": [
                {
                    "body": "I appreciate your response. <3\n\nThe dilemma I was battling was putting aside my skepticism and trying to give someone the benefit of the doubt because I had doubts on my own understanding of his intentions, but surprisingly, my intuition wasn't wrong.\n\n I was trying to understand him conversation wise because he wasn't being outright with his responses,  while he shot down every suggestion I had, so I had to connect the dots due to his cryptic behavior. \n\nHe wanted me to ditch my father for him and when I didn't give him the answer he wanted to hear, he said \"our schedules don't align\" hahaha.",
                    "author": "DottiesHotSake",
                    "id": "id0in0m",
                    "parent_id": "t1_id08nbf",
                    "score": 3,
                    "created_utc": 1655691377.0,
                    "replies": [
                        {
                            "body": "   He’s a control freak.  Most likely, he gets his ya-yas off by ruining happy times and moods of other people, since he’s pretty unsuccessful in having nice relationships himself.",
                            "author": "stocks-mostly-lower",
                            "id": "id0l8x2",
                            "parent_id": "t1_id0in0m",
                            "score": 4,
                            "created_utc": 1655692842.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You told him your dad was in town visiting for Father’s Day and he wanted you to ghost your dad for a few hours to meet him?\n\nDon’t regret not seeing that guy.",
            "author": "NVOkie9018",
            "id": "id0ezl5",
            "parent_id": "t3_vg0r4f",
            "score": 3,
            "created_utc": 1655689358.0,
            "replies": [
                {
                    "body": ">he wanted you to ghost your dad for a few hours to meet him?\n\nQuite exactly. It honestly shocked me with how bold he was thinking a PPM would be a reason for me to not see my own father.",
                    "author": "DottiesHotSake",
                    "id": "id0hnxr",
                    "parent_id": "t1_id0ezl5",
                    "score": 2,
                    "created_utc": 1655690833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shouldn't this guy be spending time with his kids?!",
            "author": "robhudsondfw",
            "id": "id12si8",
            "parent_id": "t3_vg0r4f",
            "score": 3,
            "created_utc": 1655704201.0,
            "replies": []
        },
        {
            "body": "Thank him for letting  him know so quickly that you're not a good fit and move on. Those are not healthy responses from him.",
            "author": "matthewjphillips",
            "id": "iczlxew",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655674138.0,
            "replies": []
        },
        {
            "body": "Great job handling the situation.  The SD should be way more in-tune with the situation, and that you were with your real dad.",
            "author": "PracticePositive69",
            "id": "id0krj0",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655692572.0,
            "replies": []
        },
        {
            "body": "You did everything correct, but id avoid \"squeeze you in\" or anything other phrase that makes it seem like you are doing them a favor or are scheduling an appointment.\n\n\"I can see you Monday\" works fine.",
            "author": "Exit-Velocity",
            "id": "id0qdxi",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655695804.0,
            "replies": [
                {
                    "body": ">\"I can see you Monday\" works fine.\n\nI couldn't say that with honesty because my Dad is with me for a few days. I knew my Dad had things planned. I didn't want to ditch my Dad who travelled 8hrs to see me for some man who didn't respect me enough to plan a date. \n\nPOT SD should have put more effort into planning a date instead of pulling some \"spontaneity\" mess. He made no suggestions on what the date would be like. Just Tinder laziness *\"What's your plan for today?\" \"I want to see you.\"*",
                    "author": "DottiesHotSake",
                    "id": "id297j8",
                    "parent_id": "t1_id0qdxi",
                    "score": 1,
                    "created_utc": 1655735172.0,
                    "replies": [
                        {
                            "body": "I read your post to say that you had Monday free.\n\nBtw, is it possible that the \"mess\" was actually a well planned date that he wanted to surprise you with? Ive kept dates in the dark before to see their reaction when we arrived. 🙂",
                            "author": "Exit-Velocity",
                            "id": "id2dfb2",
                            "parent_id": "t1_id297j8",
                            "score": 1,
                            "created_utc": 1655737115.0,
                            "replies": [
                                {
                                    "body": ">I read your post to say that you had Monday free.\n\n*HE* had Monday free. I did not. My free time was until later at the end of the week. He only had Sunday (yesterday, which we had just started talking) and Monday (which I have plans). I was trying to be considerate to try to see him on Monday, if I could. I don't do same day m&gs and I don't do them during the holidays. \n\nAll of my POTs showed proper initiative and understanding and scheduled dates without being difficult or cryptic. The only surprise he was going to give me was his dick. That's why he was rushing to see me because he was leaving out of state on Tuesday. \n\nHe just wanted to have it his way. I had a great time with my Dad so I'm happy.",
                                    "author": "DottiesHotSake",
                                    "id": "id2hhin",
                                    "parent_id": "t1_id2dfb2",
                                    "score": 1,
                                    "created_utc": 1655738921.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I just misread who had what days available.\n\nIf the only fun he knows how to have is in the bedroom and consistently throws temper tantrums like this, it might be time to keep it pushing. Even with the transactional nature of the sugar relationship, there should still be fun involved. Not just physical.\n\nGlad you enjoyed Fathers day!",
                                            "author": "Exit-Velocity",
                                            "id": "id2r2m2",
                                            "parent_id": "t1_id2hhin",
                                            "score": 1,
                                            "created_utc": 1655743050.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A Pot can be \"squeezed in\" for a coffee shop M&G which will take an hour of your time. I agree that this Pot had an urgency to get laid, which is not the kind of SD you want anyway. If he can't keep it in his pants for a M&G and schedule an intimate date another time then who needs him. Likely he would just be a pump and dump anyway. \n\nP.S. \"Squeeze in\" is not the best \"innocent phrase\" you could use.",
            "author": "GSSD",
            "id": "id1r6h6",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655725031.0,
            "replies": [
                {
                    "body": ">\"Squeeze in\" is not the best \"innocent phrase\" you could use.\n\nI agree m&gs can be squeezed in but there were issues:\n\n*  It was a holiday and my Dad drove 8hrs to see me. I'm not leaving my Dad to see anyone, let alone a POT SD. \n* He wanted a SAME DAY m&g, which now realizing it, he didn't even want a genuine m&g, just wanted to get laid.\n\nI was Candy Crush Sweet to him and suggested several times *\"I want us to meet, but it's a holiday, I'm spending time with my family. Can we choose a later date?\"* \n\nHe dismissed my responses as if I said nothing.\n\nWhen I asked, because I asked, not told him, *\"If I squeezed you in,\"* my question was based on him rejecting EVERY availability I given him, while he offered none. I was showing him interest by trying to make time for him. \n\nHe wanted me to change my life around his. Someone else mentioned, he's a control freak. It's okay. He blocked me and I got to have a good time with my Dad.",
                    "author": "DottiesHotSake",
                    "id": "id2895f",
                    "parent_id": "t1_id1r6h6",
                    "score": 1,
                    "created_utc": 1655734729.0,
                    "replies": [
                        {
                            "body": "> I got to have a good time with my Dad.\n\nGlad it worked out for you and your (real) Dad!",
                            "author": "GSSD",
                            "id": "id28u8x",
                            "parent_id": "t1_id2895f",
                            "score": 1,
                            "created_utc": 1655734999.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dads always come first! Thank you for hanging out with your Father, I'm so happy you made that choice. You are an awesome human being",
            "author": null,
            "id": "id1wpfm",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655728592.0,
            "replies": [
                {
                    "body": "This means a lot to me. Thank you. My Dad appreciates the time I am spending with him, especially since we live in different states.",
                    "author": "DottiesHotSake",
                    "id": "id28eqf",
                    "parent_id": "t1_id1wpfm",
                    "score": 1,
                    "created_utc": 1655734801.0,
                    "replies": [
                        {
                            "body": "Good on you!  👏🏻",
                            "author": "Chill_SD1974",
                            "id": "id2m69i",
                            "parent_id": "t1_id28eqf",
                            "score": 2,
                            "created_utc": 1655740962.0,
                            "replies": []
                        },
                        {
                            "body": ".....and an super awesome Daughter...forgot that part, my mistake.",
                            "author": null,
                            "id": "id2ul5a",
                            "parent_id": "t1_id28eqf",
                            "score": 1,
                            "created_utc": 1655744543.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why isn't he spending time with his kids ?",
            "author": "WiseRequirement9277",
            "id": "id1z1cb",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655729957.0,
            "replies": [
                {
                    "body": "He did not reveal that information, but I am aware that he is divorced.",
                    "author": "DottiesHotSake",
                    "id": "id23lsg",
                    "parent_id": "t1_id1z1cb",
                    "score": 1,
                    "created_utc": 1655732423.0,
                    "replies": [
                        {
                            "body": "Looks like he is so annoying that his kids don't even want to see him for Father's day. Or he is such a bad dad that he'd rather get some sex than spend fathers day with his kids. \n\nEither he sounds trash",
                            "author": "WiseRequirement9277",
                            "id": "id24mhx",
                            "parent_id": "t1_id23lsg",
                            "score": 2,
                            "created_utc": 1655732945.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some discipline is good for the relationship as long it is not another SD.  Just to be sure when you get back together show him a pix of you and your dad.  Folks create all sorts of fantasies when they are told no.......  Big picture ,  I wold respect SB more who prioritized her father .",
            "author": "pinotandsugar",
            "id": "id2mcl8",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655741038.0,
            "replies": [
                {
                    "body": "You know what's the scary/sad part about this....\n\n&#x200B;\n\nTHIS WAS A POT SD. \n\nThank goodness he was angry enough to block me. I'm perfectly fine with not being his choice.",
                    "author": "DottiesHotSake",
                    "id": "id2ruht",
                    "parent_id": "t1_id2mcl8",
                    "score": 1,
                    "created_utc": 1655743382.0,
                    "replies": [
                        {
                            "body": "Sounds like a very happy ending",
                            "author": "pinotandsugar",
                            "id": "id2yq4g",
                            "parent_id": "t1_id2ruht",
                            "score": 1,
                            "created_utc": 1655746331.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "imo, he's showing his true colors. there is no reason to be angry when trying to arrange a m&g. neither of you are under any kind of obligation to the other. you haven't met. if he's getting angry when trying to arrange an initial meeting, what is he going to get angry about during the relationship? i'd run. it sounds to me like he's controlling and manipulative. not to mention not respecting you and your family obligations\n\nenjoy the steak and don't think twice about this jerk",
            "author": "davitech73",
            "id": "id2ob4h",
            "parent_id": "t3_vg0r4f",
            "score": 2,
            "created_utc": 1655741880.0,
            "replies": [
                {
                    "body": "He blocked me because I wanted to be with my own Dad, so it's for the best <3.\n\nMe and my Dad had a good laugh about it.",
                    "author": "DottiesHotSake",
                    "id": "id2rqdz",
                    "parent_id": "t1_id2ob4h",
                    "score": 2,
                    "created_utc": 1655743334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "he probably thinks you're BSing him.  tbf there is a lot of BS in this world but he should be giving you the benefit of the doubt.",
            "author": "yuckyucky",
            "id": "iczw5nt",
            "parent_id": "t3_vg0r4f",
            "score": 1,
            "created_utc": 1655679207.0,
            "replies": [
                {
                    "body": "Which I understand, but he handle that incredibly inappropriately. It's one thing if he didn't believe me, but to hold money over my head to ditch my Dad is gross. \n\nMy other POT SDs were busy today too. Even the single ones, so I was shocked at his response.",
                    "author": "DottiesHotSake",
                    "id": "id0jnqc",
                    "parent_id": "t1_iczw5nt",
                    "score": 3,
                    "created_utc": 1655691943.0,
                    "replies": [
                        {
                            "body": "indeed. \n\nthe silver lining is that you found out that he's a jerk early, you won't waste any more time on him.",
                            "author": "yuckyucky",
                            "id": "id0lt5m",
                            "parent_id": "t1_id0jnqc",
                            "score": 2,
                            "created_utc": 1655693155.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "icywbqu",
            "parent_id": "t3_vg0r4f",
            "score": -4,
            "created_utc": 1655662252.0,
            "replies": [
                {
                    "body": "Interesting.\n\nInnocent it WAS. I said nothing wrong. If he got offended by that, that tells me he's not someone I want to be around due to their hypersensitivity.\n\nGod forbid if I asked him a question without him flipping out. I'm glad I didn't see him. I don't like short tempered attitudes. It makes me feel very on edge.",
                    "author": "DottiesHotSake",
                    "id": "icyyadt",
                    "parent_id": "t1_icywbqu",
                    "score": 11,
                    "created_utc": 1655663165.0,
                    "replies": [
                        {
                            "body": "It's a m&g so \"squeeze you in\" is perfectly acceptable.  Sounds like you dodged a bullet.  Thank him for revealing his true colors before you had to waste your time.",
                            "author": "sapolino5",
                            "id": "icznwwq",
                            "parent_id": "t1_icyyadt",
                            "score": 9,
                            "created_utc": 1655675094.0,
                            "replies": [
                                {
                                    "body": "Violent agreement here! I only need ~15 min for a M&G realistically to do the following:\n\n•Make sure SB is who she says she is (pics match reality)\n•Can be on time to a planned date / isn’t a flake\n•She’s intelligent / has a good personality \n\n1) & 2) are effectively instantaneous assessments. 3) should take 5-15 min to get an 80% solution, if you will.",
                                    "author": "Raven_runner",
                                    "id": "iczuhl0",
                                    "parent_id": "t1_icznwwq",
                                    "score": 6,
                                    "created_utc": 1655678355.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "icyz01h",
                            "parent_id": "t1_icyyadt",
                            "score": 1,
                            "created_utc": 1655663493.0,
                            "replies": [
                                {
                                    "body": "I told him I was willing and wanting to see him, but he wasn't willing to be patient. \n\nI'm shocked someone was offended by my plans to spend time with my father. I never had that happen to me before and I don't know if that's common in the bowl, haha.",
                                    "author": "DottiesHotSake",
                                    "id": "icyzuv9",
                                    "parent_id": "t1_icyz01h",
                                    "score": 4,
                                    "created_utc": 1655663880.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "icz0mam",
                                            "parent_id": "t1_icyzuv9",
                                            "score": 0,
                                            "created_utc": 1655664234.0,
                                            "replies": [
                                                {
                                                    "body": ">I would never, ever tell a sb or anyone I cared about or intended to care about that I could “squeeze them in.\n\nHE wanted to see ME TODAY on FATHER'S DAY. I just started talking to him TODAY. He tried, very poorly, to get me to see him because of his position and his PPM. That's why I used the phrase, because that's literally what he wanted me to do. He wanted me to stop what I was doing to see him. \n\nIt would be different if I used it in a condescending manner, I didn't.",
                                                    "author": "DottiesHotSake",
                                                    "id": "icz3oos",
                                                    "parent_id": "t1_icz0mam",
                                                    "score": 16,
                                                    "created_utc": 1655665636.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
                                                            "author": null,
                                                            "id": "iczb3wk",
                                                            "parent_id": "t1_icz3oos",
                                                            "score": 11,
                                                            "created_utc": 1655669041.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                                                                    "author": "DottiesHotSake",
                                                                    "id": "id0ny2u",
                                                                    "parent_id": "t1_iczb3wk",
                                                                    "score": 1,
                                                                    "created_utc": 1655694359.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’m sorry. \n\nThe OP already explained that she was planning to spend time with her Dad.  This seems to be about a simple M&G. IMO to express a desire to still fit in a time for an M&G with the POT (emphasize **POT**) is an extraordinary gesture of accommodation by the OP.",
                    "author": "Chill_SD1974",
                    "id": "id2nkvj",
                    "parent_id": "t1_icywbqu",
                    "score": 1,
                    "created_utc": 1655741570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do understand how someone could react to the squeeze-me-in wording (especially if POT did not yet know in the convo that she was spending time with family). But once that was clarified, then he should understand because of course both parties should respect each other’s fam and home life. And any pressure for a spontaneous m&g sounds like a flag anyway so no loss!",
            "author": "LaylaSB",
            "id": "iczfg4z",
            "parent_id": "t3_vg0r4f",
            "score": 0,
            "created_utc": 1655671047.0,
            "replies": [
                {
                    "body": "> (especially if POT did not yet know in the convo that she was spending time with family). \n\nOh he knew thrice, but was expecting me to drop my Dad for his money. \n\nHe asked *\"What's your plan for today?\"* I told him I'm spending time with my father, catching up on work and errands. It's Father's Day. \n\nHe asked, \"*What's your schedule to meet up?\"* I told him later during the week since my father is in town. \n\nThen he asked, *\"You working today?\"* pretty much ignoring my previous statements. He was dropping hints for me to see him TODAY and wanted ME to change my schedule instead of him being proper and scheduling a date for us to meet.",
                    "author": "DottiesHotSake",
                    "id": "id0mf53",
                    "parent_id": "t1_iczfg4z",
                    "score": 2,
                    "created_utc": 1655693495.0,
                    "replies": [
                        {
                            "body": "I believe you. I was just recognizing that the phrase could understandably upset anyone, but he does seem like an ass. Glad you dodged a bullet!",
                            "author": "LaylaSB",
                            "id": "id9icwu",
                            "parent_id": "t1_id0mf53",
                            "score": 2,
                            "created_utc": 1655869183.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "icz3nkb",
            "parent_id": "t3_vg0r4f",
            "score": -2,
            "created_utc": 1655665620.0,
            "replies": [
                {
                    "body": "Okay food stamps.",
                    "author": "DottiesHotSake",
                    "id": "icz3w0l",
                    "parent_id": "t1_icz3nkb",
                    "score": 3,
                    "created_utc": 1655665728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HARD PASS. Doesn’t sound like someone you’d want to have a relationship with anyway.",
            "author": "Chill_SD1974",
            "id": "id2m2rg",
            "parent_id": "t3_vg0r4f",
            "score": 1,
            "created_utc": 1655740918.0,
            "replies": []
        },
        {
            "body": "Not only that but this is only a POT .......   \n\nBut yes if someone does not understand that parents and kids  are important ,  the chances of them being a good SD or SB is about the same as that of winning the lottery.",
            "author": "pinotandsugar",
            "id": "id0czdi",
            "parent_id": "t1_icywr65",
            "score": 21,
            "created_utc": 1655688235.0,
            "replies": [
                {
                    "body": "Beautifully put <3",
                    "author": "DottiesHotSake",
                    "id": "id0kvhg",
                    "parent_id": "t1_id0czdi",
                    "score": 4,
                    "created_utc": 1655692634.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you. <3",
            "author": "DottiesHotSake",
            "id": "icz4t2x",
            "parent_id": "t1_icywr65",
            "score": 17,
            "created_utc": 1655666150.0,
            "replies": []
        },
        {
            "body": "Definitely this",
            "author": "mraspencer",
            "id": "iczcc0k",
            "parent_id": "t1_icywr65",
            "score": 8,
            "created_utc": 1655669607.0,
            "replies": []
        },
        {
            "body": "100%",
            "author": "Scarlettluxxx72",
            "id": "iczotmn",
            "parent_id": "t1_icywr65",
            "score": 3,
            "created_utc": 1655675528.0,
            "replies": []
        },
        {
            "body": "Concept works both ways  too",
            "author": "pinotandsugar",
            "id": "id0595n",
            "parent_id": "t1_icz004w",
            "score": 1,
            "created_utc": 1655684015.0,
            "replies": []
        },
        {
            "body": "That's exactly what he was expecting.\n\nHe said \"Our schedules aren't aligning\"\n\nOn a flipping holiday.",
            "author": "DottiesHotSake",
            "id": "icz484f",
            "parent_id": "t1_icz41ui",
            "score": 9,
            "created_utc": 1655665879.0,
            "replies": []
        },
        {
            "body": "I know\n\nIt truly saddens me.",
            "author": "DottiesHotSake",
            "id": "icz5lys",
            "parent_id": "t1_icyvdzf",
            "score": 6,
            "created_utc": 1655666519.0,
            "replies": []
        },
        {
            "body": "I feel terrible for laughing, but I'm laughing at the Dad jokes haha.",
            "author": "DottiesHotSake",
            "id": "id0l0cz",
            "parent_id": "t1_iczfwyo",
            "score": 5,
            "created_utc": 1655692710.0,
            "replies": []
        },
        {
            "body": "Thank you for the kind comment. I hope you had a great weekend <3.",
            "author": "DottiesHotSake",
            "id": "id0n2vu",
            "parent_id": "t1_iczdp8s",
            "score": 3,
            "created_utc": 1655693870.0,
            "replies": [
                {
                    "body": "It’s been grand, thank you!",
                    "author": "Akavinceblack",
                    "id": "id0pfx6",
                    "parent_id": "t1_id0n2vu",
                    "score": 3,
                    "created_utc": 1655695234.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He blocked me so I think I'm safe haha. Thank you for the kind words.",
            "author": "DottiesHotSake",
            "id": "id0o3p3",
            "parent_id": "t1_iczdgi2",
            "score": 2,
            "created_utc": 1655694450.0,
            "replies": []
        },
        {
            "body": "I made the assumption due to his behavior, thinking there's a chance I could be wrong, but I wasn't wrong now seeing how he behaved.\n\nPlus, I was horny. Haha. I wasn't against seeing him, just didn't care for his hissy fit.",
            "author": "DottiesHotSake",
            "id": "icyxgrj",
            "parent_id": "t1_icywq0z",
            "score": 16,
            "created_utc": 1655662781.0,
            "replies": []
        },
        {
            "body": "I appreciate your response. <3\n\nThe dilemma I was battling was putting aside my skepticism and trying to give someone the benefit of the doubt because I had doubts on my own understanding of his intentions, but surprisingly, my intuition wasn't wrong.\n\n I was trying to understand him conversation wise because he wasn't being outright with his responses,  while he shot down every suggestion I had, so I had to connect the dots due to his cryptic behavior. \n\nHe wanted me to ditch my father for him and when I didn't give him the answer he wanted to hear, he said \"our schedules don't align\" hahaha.",
            "author": "DottiesHotSake",
            "id": "id0in0m",
            "parent_id": "t1_id08nbf",
            "score": 3,
            "created_utc": 1655691377.0,
            "replies": [
                {
                    "body": "   He’s a control freak.  Most likely, he gets his ya-yas off by ruining happy times and moods of other people, since he’s pretty unsuccessful in having nice relationships himself.",
                    "author": "stocks-mostly-lower",
                    "id": "id0l8x2",
                    "parent_id": "t1_id0in0m",
                    "score": 4,
                    "created_utc": 1655692842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">he wanted you to ghost your dad for a few hours to meet him?\n\nQuite exactly. It honestly shocked me with how bold he was thinking a PPM would be a reason for me to not see my own father.",
            "author": "DottiesHotSake",
            "id": "id0hnxr",
            "parent_id": "t1_id0ezl5",
            "score": 2,
            "created_utc": 1655690833.0,
            "replies": []
        },
        {
            "body": ">\"I can see you Monday\" works fine.\n\nI couldn't say that with honesty because my Dad is with me for a few days. I knew my Dad had things planned. I didn't want to ditch my Dad who travelled 8hrs to see me for some man who didn't respect me enough to plan a date. \n\nPOT SD should have put more effort into planning a date instead of pulling some \"spontaneity\" mess. He made no suggestions on what the date would be like. Just Tinder laziness *\"What's your plan for today?\" \"I want to see you.\"*",
            "author": "DottiesHotSake",
            "id": "id297j8",
            "parent_id": "t1_id0qdxi",
            "score": 1,
            "created_utc": 1655735172.0,
            "replies": [
                {
                    "body": "I read your post to say that you had Monday free.\n\nBtw, is it possible that the \"mess\" was actually a well planned date that he wanted to surprise you with? Ive kept dates in the dark before to see their reaction when we arrived. 🙂",
                    "author": "Exit-Velocity",
                    "id": "id2dfb2",
                    "parent_id": "t1_id297j8",
                    "score": 1,
                    "created_utc": 1655737115.0,
                    "replies": [
                        {
                            "body": ">I read your post to say that you had Monday free.\n\n*HE* had Monday free. I did not. My free time was until later at the end of the week. He only had Sunday (yesterday, which we had just started talking) and Monday (which I have plans). I was trying to be considerate to try to see him on Monday, if I could. I don't do same day m&gs and I don't do them during the holidays. \n\nAll of my POTs showed proper initiative and understanding and scheduled dates without being difficult or cryptic. The only surprise he was going to give me was his dick. That's why he was rushing to see me because he was leaving out of state on Tuesday. \n\nHe just wanted to have it his way. I had a great time with my Dad so I'm happy.",
                            "author": "DottiesHotSake",
                            "id": "id2hhin",
                            "parent_id": "t1_id2dfb2",
                            "score": 1,
                            "created_utc": 1655738921.0,
                            "replies": [
                                {
                                    "body": "Yeah I just misread who had what days available.\n\nIf the only fun he knows how to have is in the bedroom and consistently throws temper tantrums like this, it might be time to keep it pushing. Even with the transactional nature of the sugar relationship, there should still be fun involved. Not just physical.\n\nGlad you enjoyed Fathers day!",
                                    "author": "Exit-Velocity",
                                    "id": "id2r2m2",
                                    "parent_id": "t1_id2hhin",
                                    "score": 1,
                                    "created_utc": 1655743050.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">\"Squeeze in\" is not the best \"innocent phrase\" you could use.\n\nI agree m&gs can be squeezed in but there were issues:\n\n*  It was a holiday and my Dad drove 8hrs to see me. I'm not leaving my Dad to see anyone, let alone a POT SD. \n* He wanted a SAME DAY m&g, which now realizing it, he didn't even want a genuine m&g, just wanted to get laid.\n\nI was Candy Crush Sweet to him and suggested several times *\"I want us to meet, but it's a holiday, I'm spending time with my family. Can we choose a later date?\"* \n\nHe dismissed my responses as if I said nothing.\n\nWhen I asked, because I asked, not told him, *\"If I squeezed you in,\"* my question was based on him rejecting EVERY availability I given him, while he offered none. I was showing him interest by trying to make time for him. \n\nHe wanted me to change my life around his. Someone else mentioned, he's a control freak. It's okay. He blocked me and I got to have a good time with my Dad.",
            "author": "DottiesHotSake",
            "id": "id2895f",
            "parent_id": "t1_id1r6h6",
            "score": 1,
            "created_utc": 1655734729.0,
            "replies": [
                {
                    "body": "> I got to have a good time with my Dad.\n\nGlad it worked out for you and your (real) Dad!",
                    "author": "GSSD",
                    "id": "id28u8x",
                    "parent_id": "t1_id2895f",
                    "score": 1,
                    "created_utc": 1655734999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This means a lot to me. Thank you. My Dad appreciates the time I am spending with him, especially since we live in different states.",
            "author": "DottiesHotSake",
            "id": "id28eqf",
            "parent_id": "t1_id1wpfm",
            "score": 1,
            "created_utc": 1655734801.0,
            "replies": [
                {
                    "body": "Good on you!  👏🏻",
                    "author": "Chill_SD1974",
                    "id": "id2m69i",
                    "parent_id": "t1_id28eqf",
                    "score": 2,
                    "created_utc": 1655740962.0,
                    "replies": []
                },
                {
                    "body": ".....and an super awesome Daughter...forgot that part, my mistake.",
                    "author": null,
                    "id": "id2ul5a",
                    "parent_id": "t1_id28eqf",
                    "score": 1,
                    "created_utc": 1655744543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He did not reveal that information, but I am aware that he is divorced.",
            "author": "DottiesHotSake",
            "id": "id23lsg",
            "parent_id": "t1_id1z1cb",
            "score": 1,
            "created_utc": 1655732423.0,
            "replies": [
                {
                    "body": "Looks like he is so annoying that his kids don't even want to see him for Father's day. Or he is such a bad dad that he'd rather get some sex than spend fathers day with his kids. \n\nEither he sounds trash",
                    "author": "WiseRequirement9277",
                    "id": "id24mhx",
                    "parent_id": "t1_id23lsg",
                    "score": 2,
                    "created_utc": 1655732945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know what's the scary/sad part about this....\n\n&#x200B;\n\nTHIS WAS A POT SD. \n\nThank goodness he was angry enough to block me. I'm perfectly fine with not being his choice.",
            "author": "DottiesHotSake",
            "id": "id2ruht",
            "parent_id": "t1_id2mcl8",
            "score": 1,
            "created_utc": 1655743382.0,
            "replies": [
                {
                    "body": "Sounds like a very happy ending",
                    "author": "pinotandsugar",
                    "id": "id2yq4g",
                    "parent_id": "t1_id2ruht",
                    "score": 1,
                    "created_utc": 1655746331.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He blocked me because I wanted to be with my own Dad, so it's for the best <3.\n\nMe and my Dad had a good laugh about it.",
            "author": "DottiesHotSake",
            "id": "id2rqdz",
            "parent_id": "t1_id2ob4h",
            "score": 2,
            "created_utc": 1655743334.0,
            "replies": []
        },
        {
            "body": "Which I understand, but he handle that incredibly inappropriately. It's one thing if he didn't believe me, but to hold money over my head to ditch my Dad is gross. \n\nMy other POT SDs were busy today too. Even the single ones, so I was shocked at his response.",
            "author": "DottiesHotSake",
            "id": "id0jnqc",
            "parent_id": "t1_iczw5nt",
            "score": 3,
            "created_utc": 1655691943.0,
            "replies": [
                {
                    "body": "indeed. \n\nthe silver lining is that you found out that he's a jerk early, you won't waste any more time on him.",
                    "author": "yuckyucky",
                    "id": "id0lt5m",
                    "parent_id": "t1_id0jnqc",
                    "score": 2,
                    "created_utc": 1655693155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting.\n\nInnocent it WAS. I said nothing wrong. If he got offended by that, that tells me he's not someone I want to be around due to their hypersensitivity.\n\nGod forbid if I asked him a question without him flipping out. I'm glad I didn't see him. I don't like short tempered attitudes. It makes me feel very on edge.",
            "author": "DottiesHotSake",
            "id": "icyyadt",
            "parent_id": "t1_icywbqu",
            "score": 11,
            "created_utc": 1655663165.0,
            "replies": [
                {
                    "body": "It's a m&g so \"squeeze you in\" is perfectly acceptable.  Sounds like you dodged a bullet.  Thank him for revealing his true colors before you had to waste your time.",
                    "author": "sapolino5",
                    "id": "icznwwq",
                    "parent_id": "t1_icyyadt",
                    "score": 9,
                    "created_utc": 1655675094.0,
                    "replies": [
                        {
                            "body": "Violent agreement here! I only need ~15 min for a M&G realistically to do the following:\n\n•Make sure SB is who she says she is (pics match reality)\n•Can be on time to a planned date / isn’t a flake\n•She’s intelligent / has a good personality \n\n1) & 2) are effectively instantaneous assessments. 3) should take 5-15 min to get an 80% solution, if you will.",
                            "author": "Raven_runner",
                            "id": "iczuhl0",
                            "parent_id": "t1_icznwwq",
                            "score": 6,
                            "created_utc": 1655678355.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "icyz01h",
                    "parent_id": "t1_icyyadt",
                    "score": 1,
                    "created_utc": 1655663493.0,
                    "replies": [
                        {
                            "body": "I told him I was willing and wanting to see him, but he wasn't willing to be patient. \n\nI'm shocked someone was offended by my plans to spend time with my father. I never had that happen to me before and I don't know if that's common in the bowl, haha.",
                            "author": "DottiesHotSake",
                            "id": "icyzuv9",
                            "parent_id": "t1_icyz01h",
                            "score": 4,
                            "created_utc": 1655663880.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "icz0mam",
                                    "parent_id": "t1_icyzuv9",
                                    "score": 0,
                                    "created_utc": 1655664234.0,
                                    "replies": [
                                        {
                                            "body": ">I would never, ever tell a sb or anyone I cared about or intended to care about that I could “squeeze them in.\n\nHE wanted to see ME TODAY on FATHER'S DAY. I just started talking to him TODAY. He tried, very poorly, to get me to see him because of his position and his PPM. That's why I used the phrase, because that's literally what he wanted me to do. He wanted me to stop what I was doing to see him. \n\nIt would be different if I used it in a condescending manner, I didn't.",
                                            "author": "DottiesHotSake",
                                            "id": "icz3oos",
                                            "parent_id": "t1_icz0mam",
                                            "score": 16,
                                            "created_utc": 1655665636.0,
                                            "replies": [
                                                {
                                                    "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
                                                    "author": null,
                                                    "id": "iczb3wk",
                                                    "parent_id": "t1_icz3oos",
                                                    "score": 11,
                                                    "created_utc": 1655669041.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                                                            "author": "DottiesHotSake",
                                                            "id": "id0ny2u",
                                                            "parent_id": "t1_iczb3wk",
                                                            "score": 1,
                                                            "created_utc": 1655694359.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m sorry. \n\nThe OP already explained that she was planning to spend time with her Dad.  This seems to be about a simple M&G. IMO to express a desire to still fit in a time for an M&G with the POT (emphasize **POT**) is an extraordinary gesture of accommodation by the OP.",
            "author": "Chill_SD1974",
            "id": "id2nkvj",
            "parent_id": "t1_icywbqu",
            "score": 1,
            "created_utc": 1655741570.0,
            "replies": []
        },
        {
            "body": "> (especially if POT did not yet know in the convo that she was spending time with family). \n\nOh he knew thrice, but was expecting me to drop my Dad for his money. \n\nHe asked *\"What's your plan for today?\"* I told him I'm spending time with my father, catching up on work and errands. It's Father's Day. \n\nHe asked, \"*What's your schedule to meet up?\"* I told him later during the week since my father is in town. \n\nThen he asked, *\"You working today?\"* pretty much ignoring my previous statements. He was dropping hints for me to see him TODAY and wanted ME to change my schedule instead of him being proper and scheduling a date for us to meet.",
            "author": "DottiesHotSake",
            "id": "id0mf53",
            "parent_id": "t1_iczfg4z",
            "score": 2,
            "created_utc": 1655693495.0,
            "replies": [
                {
                    "body": "I believe you. I was just recognizing that the phrase could understandably upset anyone, but he does seem like an ass. Glad you dodged a bullet!",
                    "author": "LaylaSB",
                    "id": "id9icwu",
                    "parent_id": "t1_id0mf53",
                    "score": 2,
                    "created_utc": 1655869183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Okay food stamps.",
            "author": "DottiesHotSake",
            "id": "icz3w0l",
            "parent_id": "t1_icz3nkb",
            "score": 3,
            "created_utc": 1655665728.0,
            "replies": []
        },
        {
            "body": "Beautifully put <3",
            "author": "DottiesHotSake",
            "id": "id0kvhg",
            "parent_id": "t1_id0czdi",
            "score": 4,
            "created_utc": 1655692634.0,
            "replies": []
        },
        {
            "body": "It’s been grand, thank you!",
            "author": "Akavinceblack",
            "id": "id0pfx6",
            "parent_id": "t1_id0n2vu",
            "score": 3,
            "created_utc": 1655695234.0,
            "replies": []
        },
        {
            "body": "   He’s a control freak.  Most likely, he gets his ya-yas off by ruining happy times and moods of other people, since he’s pretty unsuccessful in having nice relationships himself.",
            "author": "stocks-mostly-lower",
            "id": "id0l8x2",
            "parent_id": "t1_id0in0m",
            "score": 4,
            "created_utc": 1655692842.0,
            "replies": []
        },
        {
            "body": "I read your post to say that you had Monday free.\n\nBtw, is it possible that the \"mess\" was actually a well planned date that he wanted to surprise you with? Ive kept dates in the dark before to see their reaction when we arrived. 🙂",
            "author": "Exit-Velocity",
            "id": "id2dfb2",
            "parent_id": "t1_id297j8",
            "score": 1,
            "created_utc": 1655737115.0,
            "replies": [
                {
                    "body": ">I read your post to say that you had Monday free.\n\n*HE* had Monday free. I did not. My free time was until later at the end of the week. He only had Sunday (yesterday, which we had just started talking) and Monday (which I have plans). I was trying to be considerate to try to see him on Monday, if I could. I don't do same day m&gs and I don't do them during the holidays. \n\nAll of my POTs showed proper initiative and understanding and scheduled dates without being difficult or cryptic. The only surprise he was going to give me was his dick. That's why he was rushing to see me because he was leaving out of state on Tuesday. \n\nHe just wanted to have it his way. I had a great time with my Dad so I'm happy.",
                    "author": "DottiesHotSake",
                    "id": "id2hhin",
                    "parent_id": "t1_id2dfb2",
                    "score": 1,
                    "created_utc": 1655738921.0,
                    "replies": [
                        {
                            "body": "Yeah I just misread who had what days available.\n\nIf the only fun he knows how to have is in the bedroom and consistently throws temper tantrums like this, it might be time to keep it pushing. Even with the transactional nature of the sugar relationship, there should still be fun involved. Not just physical.\n\nGlad you enjoyed Fathers day!",
                            "author": "Exit-Velocity",
                            "id": "id2r2m2",
                            "parent_id": "t1_id2hhin",
                            "score": 1,
                            "created_utc": 1655743050.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I got to have a good time with my Dad.\n\nGlad it worked out for you and your (real) Dad!",
            "author": "GSSD",
            "id": "id28u8x",
            "parent_id": "t1_id2895f",
            "score": 1,
            "created_utc": 1655734999.0,
            "replies": []
        },
        {
            "body": "Good on you!  👏🏻",
            "author": "Chill_SD1974",
            "id": "id2m69i",
            "parent_id": "t1_id28eqf",
            "score": 2,
            "created_utc": 1655740962.0,
            "replies": []
        },
        {
            "body": ".....and an super awesome Daughter...forgot that part, my mistake.",
            "author": null,
            "id": "id2ul5a",
            "parent_id": "t1_id28eqf",
            "score": 1,
            "created_utc": 1655744543.0,
            "replies": []
        },
        {
            "body": "Looks like he is so annoying that his kids don't even want to see him for Father's day. Or he is such a bad dad that he'd rather get some sex than spend fathers day with his kids. \n\nEither he sounds trash",
            "author": "WiseRequirement9277",
            "id": "id24mhx",
            "parent_id": "t1_id23lsg",
            "score": 2,
            "created_utc": 1655732945.0,
            "replies": []
        },
        {
            "body": "Sounds like a very happy ending",
            "author": "pinotandsugar",
            "id": "id2yq4g",
            "parent_id": "t1_id2ruht",
            "score": 1,
            "created_utc": 1655746331.0,
            "replies": []
        },
        {
            "body": "indeed. \n\nthe silver lining is that you found out that he's a jerk early, you won't waste any more time on him.",
            "author": "yuckyucky",
            "id": "id0lt5m",
            "parent_id": "t1_id0jnqc",
            "score": 2,
            "created_utc": 1655693155.0,
            "replies": []
        },
        {
            "body": "It's a m&g so \"squeeze you in\" is perfectly acceptable.  Sounds like you dodged a bullet.  Thank him for revealing his true colors before you had to waste your time.",
            "author": "sapolino5",
            "id": "icznwwq",
            "parent_id": "t1_icyyadt",
            "score": 9,
            "created_utc": 1655675094.0,
            "replies": [
                {
                    "body": "Violent agreement here! I only need ~15 min for a M&G realistically to do the following:\n\n•Make sure SB is who she says she is (pics match reality)\n•Can be on time to a planned date / isn’t a flake\n•She’s intelligent / has a good personality \n\n1) & 2) are effectively instantaneous assessments. 3) should take 5-15 min to get an 80% solution, if you will.",
                    "author": "Raven_runner",
                    "id": "iczuhl0",
                    "parent_id": "t1_icznwwq",
                    "score": 6,
                    "created_utc": 1655678355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "icyz01h",
            "parent_id": "t1_icyyadt",
            "score": 1,
            "created_utc": 1655663493.0,
            "replies": [
                {
                    "body": "I told him I was willing and wanting to see him, but he wasn't willing to be patient. \n\nI'm shocked someone was offended by my plans to spend time with my father. I never had that happen to me before and I don't know if that's common in the bowl, haha.",
                    "author": "DottiesHotSake",
                    "id": "icyzuv9",
                    "parent_id": "t1_icyz01h",
                    "score": 4,
                    "created_utc": 1655663880.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "icz0mam",
                            "parent_id": "t1_icyzuv9",
                            "score": 0,
                            "created_utc": 1655664234.0,
                            "replies": [
                                {
                                    "body": ">I would never, ever tell a sb or anyone I cared about or intended to care about that I could “squeeze them in.\n\nHE wanted to see ME TODAY on FATHER'S DAY. I just started talking to him TODAY. He tried, very poorly, to get me to see him because of his position and his PPM. That's why I used the phrase, because that's literally what he wanted me to do. He wanted me to stop what I was doing to see him. \n\nIt would be different if I used it in a condescending manner, I didn't.",
                                    "author": "DottiesHotSake",
                                    "id": "icz3oos",
                                    "parent_id": "t1_icz0mam",
                                    "score": 16,
                                    "created_utc": 1655665636.0,
                                    "replies": [
                                        {
                                            "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
                                            "author": null,
                                            "id": "iczb3wk",
                                            "parent_id": "t1_icz3oos",
                                            "score": 11,
                                            "created_utc": 1655669041.0,
                                            "replies": [
                                                {
                                                    "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                                                    "author": "DottiesHotSake",
                                                    "id": "id0ny2u",
                                                    "parent_id": "t1_iczb3wk",
                                                    "score": 1,
                                                    "created_utc": 1655694359.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I believe you. I was just recognizing that the phrase could understandably upset anyone, but he does seem like an ass. Glad you dodged a bullet!",
            "author": "LaylaSB",
            "id": "id9icwu",
            "parent_id": "t1_id0mf53",
            "score": 2,
            "created_utc": 1655869183.0,
            "replies": []
        },
        {
            "body": ">I read your post to say that you had Monday free.\n\n*HE* had Monday free. I did not. My free time was until later at the end of the week. He only had Sunday (yesterday, which we had just started talking) and Monday (which I have plans). I was trying to be considerate to try to see him on Monday, if I could. I don't do same day m&gs and I don't do them during the holidays. \n\nAll of my POTs showed proper initiative and understanding and scheduled dates without being difficult or cryptic. The only surprise he was going to give me was his dick. That's why he was rushing to see me because he was leaving out of state on Tuesday. \n\nHe just wanted to have it his way. I had a great time with my Dad so I'm happy.",
            "author": "DottiesHotSake",
            "id": "id2hhin",
            "parent_id": "t1_id2dfb2",
            "score": 1,
            "created_utc": 1655738921.0,
            "replies": [
                {
                    "body": "Yeah I just misread who had what days available.\n\nIf the only fun he knows how to have is in the bedroom and consistently throws temper tantrums like this, it might be time to keep it pushing. Even with the transactional nature of the sugar relationship, there should still be fun involved. Not just physical.\n\nGlad you enjoyed Fathers day!",
                    "author": "Exit-Velocity",
                    "id": "id2r2m2",
                    "parent_id": "t1_id2hhin",
                    "score": 1,
                    "created_utc": 1655743050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Violent agreement here! I only need ~15 min for a M&G realistically to do the following:\n\n•Make sure SB is who she says she is (pics match reality)\n•Can be on time to a planned date / isn’t a flake\n•She’s intelligent / has a good personality \n\n1) & 2) are effectively instantaneous assessments. 3) should take 5-15 min to get an 80% solution, if you will.",
            "author": "Raven_runner",
            "id": "iczuhl0",
            "parent_id": "t1_icznwwq",
            "score": 6,
            "created_utc": 1655678355.0,
            "replies": []
        },
        {
            "body": "I told him I was willing and wanting to see him, but he wasn't willing to be patient. \n\nI'm shocked someone was offended by my plans to spend time with my father. I never had that happen to me before and I don't know if that's common in the bowl, haha.",
            "author": "DottiesHotSake",
            "id": "icyzuv9",
            "parent_id": "t1_icyz01h",
            "score": 4,
            "created_utc": 1655663880.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "icz0mam",
                    "parent_id": "t1_icyzuv9",
                    "score": 0,
                    "created_utc": 1655664234.0,
                    "replies": [
                        {
                            "body": ">I would never, ever tell a sb or anyone I cared about or intended to care about that I could “squeeze them in.\n\nHE wanted to see ME TODAY on FATHER'S DAY. I just started talking to him TODAY. He tried, very poorly, to get me to see him because of his position and his PPM. That's why I used the phrase, because that's literally what he wanted me to do. He wanted me to stop what I was doing to see him. \n\nIt would be different if I used it in a condescending manner, I didn't.",
                            "author": "DottiesHotSake",
                            "id": "icz3oos",
                            "parent_id": "t1_icz0mam",
                            "score": 16,
                            "created_utc": 1655665636.0,
                            "replies": [
                                {
                                    "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
                                    "author": null,
                                    "id": "iczb3wk",
                                    "parent_id": "t1_icz3oos",
                                    "score": 11,
                                    "created_utc": 1655669041.0,
                                    "replies": [
                                        {
                                            "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                                            "author": "DottiesHotSake",
                                            "id": "id0ny2u",
                                            "parent_id": "t1_iczb3wk",
                                            "score": 1,
                                            "created_utc": 1655694359.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I just misread who had what days available.\n\nIf the only fun he knows how to have is in the bedroom and consistently throws temper tantrums like this, it might be time to keep it pushing. Even with the transactional nature of the sugar relationship, there should still be fun involved. Not just physical.\n\nGlad you enjoyed Fathers day!",
            "author": "Exit-Velocity",
            "id": "id2r2m2",
            "parent_id": "t1_id2hhin",
            "score": 1,
            "created_utc": 1655743050.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "icz0mam",
            "parent_id": "t1_icyzuv9",
            "score": 0,
            "created_utc": 1655664234.0,
            "replies": [
                {
                    "body": ">I would never, ever tell a sb or anyone I cared about or intended to care about that I could “squeeze them in.\n\nHE wanted to see ME TODAY on FATHER'S DAY. I just started talking to him TODAY. He tried, very poorly, to get me to see him because of his position and his PPM. That's why I used the phrase, because that's literally what he wanted me to do. He wanted me to stop what I was doing to see him. \n\nIt would be different if I used it in a condescending manner, I didn't.",
                    "author": "DottiesHotSake",
                    "id": "icz3oos",
                    "parent_id": "t1_icz0mam",
                    "score": 16,
                    "created_utc": 1655665636.0,
                    "replies": [
                        {
                            "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
                            "author": null,
                            "id": "iczb3wk",
                            "parent_id": "t1_icz3oos",
                            "score": 11,
                            "created_utc": 1655669041.0,
                            "replies": [
                                {
                                    "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                                    "author": "DottiesHotSake",
                                    "id": "id0ny2u",
                                    "parent_id": "t1_iczb3wk",
                                    "score": 1,
                                    "created_utc": 1655694359.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I would never, ever tell a sb or anyone I cared about or intended to care about that I could “squeeze them in.\n\nHE wanted to see ME TODAY on FATHER'S DAY. I just started talking to him TODAY. He tried, very poorly, to get me to see him because of his position and his PPM. That's why I used the phrase, because that's literally what he wanted me to do. He wanted me to stop what I was doing to see him. \n\nIt would be different if I used it in a condescending manner, I didn't.",
            "author": "DottiesHotSake",
            "id": "icz3oos",
            "parent_id": "t1_icz0mam",
            "score": 16,
            "created_utc": 1655665636.0,
            "replies": [
                {
                    "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
                    "author": null,
                    "id": "iczb3wk",
                    "parent_id": "t1_icz3oos",
                    "score": 11,
                    "created_utc": 1655669041.0,
                    "replies": [
                        {
                            "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                            "author": "DottiesHotSake",
                            "id": "id0ny2u",
                            "parent_id": "t1_iczb3wk",
                            "score": 1,
                            "created_utc": 1655694359.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez. \n\nAnyways; it’s like POTs are extra pushy today. Must be a collective sense of loneliness or something!",
            "author": null,
            "id": "iczb3wk",
            "parent_id": "t1_icz3oos",
            "score": 11,
            "created_utc": 1655669041.0,
            "replies": [
                {
                    "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
                    "author": "DottiesHotSake",
                    "id": "id0ny2u",
                    "parent_id": "t1_iczb3wk",
                    "score": 1,
                    "created_utc": 1655694359.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Wild how ALL of what you just said was very clearly stated in your initial post and yet…folks are still trying to ride you for what was very clearly icky behavior from that POT. Jeez.\n\nSometimes, I deal with this forum in small doses because I swear some people get off on gaslighting others. I appreciate your kind support <3",
            "author": "DottiesHotSake",
            "id": "id0ny2u",
            "parent_id": "t1_iczb3wk",
            "score": 1,
            "created_utc": 1655694359.0,
            "replies": []
        }
    ]
}