{
    "title": "Yet another SD saying condoms are a “deal breaker”.",
    "post_id": "9xcvqf",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9xcvqf/yet_another_sd_saying_condoms_are_a_deal_breaker/",
    "author": "throwaway090789",
    "body": "*insert dramatic eye roll here* \n\nHe said, and I quote, “If I’m going to invest my time, money and effort I want the perfect arrangement without any compromise.” Sigh. I don’t care how much money you spend on me, if you don’t understand why I won’t raw dog you the first time we have a sexual encounter take your money and shove it. If I am okay doing that with one person, why should you believe I would not be okay doing that with anyone? This logic applies not only to me but him as well! Clearly a repeat offender... not a risk I’m willing to take.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9xcvqf/yet_another_sd_saying_condoms_are_a_deal_breaker/",
    "score": 163,
    "upvote_ratio": 0.94,
    "created_utc": 1542300629.0,
    "num_comments": 83,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I truly do not understand the reasoning behind this. Are people not afraid of getting STIs anymore? They are still a thing yes? I'm so careful of my health - this body/life is the only one I got! I couldn't care less if the man is snipped - so am I! Doesn't guarantee I won't get HIV (or worse!)! ",
            "author": "Zephyrus0101",
            "id": "e9ra9df",
            "parent_id": "t3_9xcvqf",
            "score": 72,
            "created_utc": 1542302015.0,
            "replies": [
                {
                    "body": "Exactly! Or even worse (not worse than HIV)... getting a SB pregnant!!!! These guys don’t care because they use fake names and would likely ghost if they were to get a SB pregnant.  And the whole “snipped” BS cracks me up... how/why would I believe you??? ",
                    "author": "alexeySB",
                    "id": "e9rahbe",
                    "parent_id": "t1_e9ra9df",
                    "score": 39,
                    "created_utc": 1542302180.0,
                    "replies": [
                        {
                            "body": "You mean you don't carry the equipment to do a quick spur-of-the-moment sperm count before doing the deed? Amateur. \n\n🙃",
                            "author": "Zephyrus0101",
                            "id": "e9raxb1",
                            "parent_id": "t1_e9rahbe",
                            "score": 18,
                            "created_utc": 1542302517.0,
                            "replies": []
                        },
                        {
                            "body": "It's possible to have a completely anonymous SA account, but a good cyber sleuth could track them down.  Unless the SD is using a VPN, anonymous email, re-loadable visa, & fake photos, then a subpoena by a licensed 1st year attorney will walk through 99% of the issues.\n\nQuite a few of us SD's are snipped & trust me the last thing I want to do is knock up a SB...\n\nThe STI's are the killer currently, wrap it until you are both tested..  ",
                            "author": "mollyflowers",
                            "id": "e9rkw8o",
                            "parent_id": "t1_e9rahbe",
                            "score": 7,
                            "created_utc": 1542309962.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He tried to persuade me with “I am tested”. Yeah well ya girl also gets tested, does that mean I’m willing to compromise that for someone I don’t know very well? Fuck no. Never in a million years would I ever consider it. ",
                    "author": "throwaway090789",
                    "id": "e9rbb4n",
                    "parent_id": "t1_e9ra9df",
                    "score": 16,
                    "created_utc": 1542302820.0,
                    "replies": [
                        {
                            "body": "Dude was probably tested within the last year but who knows how many partners he has had since the test.  Best to wrap it up until their is trust & exclusivity as in a Sugar Girlfriend...\n\n",
                            "author": "mollyflowers",
                            "id": "e9rnsts",
                            "parent_id": "t1_e9rbb4n",
                            "score": 11,
                            "created_utc": 1542312007.0,
                            "replies": [
                                {
                                    "body": "Or what STIs he carries but are dormant. \n\nYou know what, actually how about: if the girl is uncomfortable, don’t guilt her — who wants to force someone into not enjoying something? He should go find someone else (riskier, less safe, and probably a wild card in other areas too...) IMHO. ",
                                    "author": "ilovecookies86",
                                    "id": "e9rujj3",
                                    "parent_id": "t1_e9rnsts",
                                    "score": 10,
                                    "created_utc": 1542316860.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Most STIs are easily curable these days with one or two antibiotic pills, and many others can now be vaccinated against. And the rates of HIV/AIDS transmission are lower than ever! Statistically speaking, there's never been a better time to have unprotected sex.\n\nHere are [some statistics from the WHO](http://www.who.int/news-room/fact-sheets/detail/sexually-transmitted-infections-\\(stis\\)) showing that 357 million of the 360 million STIs contracted each year are curable. I'll save you the math - that's a more than 99% cure rate.\n\nAnd here are some [statistics for the US](https://www.hiv.gov/hiv-basics/overview/data-and-trends/statistics) specifically showing that the rate of new HIV infections dropped 8% between 2010 and 2015.",
                    "author": "therealblaine",
                    "id": "eblx71m",
                    "parent_id": "t1_e9ra9df",
                    "score": 1,
                    "created_utc": 1544584870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Reverse psychology applies here... “That’s fine! I’ve been thinking lately that it’s time to settle down. My biological clock is ticking ever so loudly, and I mean you, you are a great catch with great genes, so what do you say? Want to forgo all caution and have a baby with your sugar baby?” \n\nBut I’ve been known to counter crazy notions with even more crazy. Not everyone appreciates my level of petty. ",
            "author": "LulaGagging34",
            "id": "e9reenm",
            "parent_id": "t3_9xcvqf",
            "score": 38,
            "created_utc": 1542305175.0,
            "replies": [
                {
                    "body": "But what if he's had a vasectomy? Those are the men that push the most for going raw.",
                    "author": null,
                    "id": "e9rfxv2",
                    "parent_id": "t1_e9reenm",
                    "score": 11,
                    "created_utc": 1542306335.0,
                    "replies": [
                        {
                            "body": "Had a vasectomy 12 years ago and never push to go without. ",
                            "author": "want2cokc",
                            "id": "e9rgrfa",
                            "parent_id": "t1_e9rfxv2",
                            "score": 6,
                            "created_utc": 1542306954.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "😂😂😂 I resonate with this level of petty. Fuel for future conversations put in my memory bank. ",
                    "author": "throwaway090789",
                    "id": "e9s4awx",
                    "parent_id": "t1_e9reenm",
                    "score": 4,
                    "created_utc": 1542324134.0,
                    "replies": []
                },
                {
                    "body": "I have to steal this. I may have to ask if his wife minds watching the child while I’m at work 🤷🏻‍♀️",
                    "author": "tannedsb05",
                    "id": "e9s9g6z",
                    "parent_id": "t1_e9reenm",
                    "score": 5,
                    "created_utc": 1542328144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do understand the reasoning behind it coming out of a very very long relationship. \n\n&#x200B;\n\nThe problem is that for me personally 'normal' cheap condoms are awful, they don't feel like anything remotely that has to do with sex. \n\n&#x200B;\n\nBut then I investigated a bit more and tried SKYN Elite as well as Kimono MicroThin and Sagami 0.01 , all three totally changed my view of condoms and now I can not even think about having sex without one. The correct size is also very important. \n\n&#x200B;\n\nSo if he is not willing to invest 50 cents more for a condom that provides 95% of the real feeling, run.",
            "author": "tokenlover99",
            "id": "e9r90kc",
            "parent_id": "t3_9xcvqf",
            "score": 61,
            "created_utc": 1542301055.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e9rg8cv",
                    "parent_id": "t1_e9r90kc",
                    "score": 6,
                    "created_utc": 1542306554.0,
                    "replies": [
                        {
                            "body": "Really depends.  If you're \"girthy\" the Sagami may be too tight.  I like the skyn Elites and Okamoto zero four zero.  The Elites have a better lube and are longer.  The Okamoto feel better but get snug if I'm really aroused and I wish it was a little longer.\n\nHonestly get on Amazon and order small packs of all of them, it's worth the effort of finding one you're happier with.",
                            "author": null,
                            "id": "e9rsaz1",
                            "parent_id": "t1_e9rg8cv",
                            "score": 4,
                            "created_utc": 1542315245.0,
                            "replies": []
                        },
                        {
                            "body": "Agree with the point on it depends on you.\n\nNOTE: the BIGGEST difference between these three and a normal condom isn't the fit, it's the **material**. Latex SUCKS. I can't underscore this enough. It's a terrible material for condoms; I've written about this on the forum before.\n\nI hate latex condoms but actually prefer Skyn Large to bareback, because of the ease of cleanup before the second or third rounds. Unfortunately, agree that the Japanese brands are a little tight and Skyn doesn't make an Elite in a larger size :-(\n\n&#x200B;",
                            "author": "curiousgenerous",
                            "id": "e9rt4ql",
                            "parent_id": "t1_e9rg8cv",
                            "score": 8,
                            "created_utc": 1542315809.0,
                            "replies": [
                                {
                                    "body": "Any suggestions for a large size? He usually uses the gold trogana and even those are tight",
                                    "author": "beanlvr",
                                    "id": "e9sldaf",
                                    "parent_id": "t1_e9rt4ql",
                                    "score": 1,
                                    "created_utc": 1542339015.0,
                                    "replies": [
                                        {
                                            "body": "Skyn Large is I think the best that are readily available. They are physically smaller than Trojan Magnums, but they are made from polyisoprene which stretches and fits differently than latex. They are *definitely* worth a try.",
                                            "author": "curiousgenerous",
                                            "id": "e9tzack",
                                            "parent_id": "t1_e9sldaf",
                                            "score": 1,
                                            "created_utc": 1542395296.0,
                                            "replies": [
                                                {
                                                    "body": "Do you know if you can buy them in stores? ",
                                                    "author": "beanlvr",
                                                    "id": "e9tzqnw",
                                                    "parent_id": "t1_e9tzack",
                                                    "score": 1,
                                                    "created_utc": 1542395632.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
                                                            "author": "curiousgenerous",
                                                            "id": "e9uhlho",
                                                            "parent_id": "t1_e9tzqnw",
                                                            "score": 1,
                                                            "created_utc": 1542409183.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thank you!!!",
                                                                    "author": "beanlvr",
                                                                    "id": "e9uhxed",
                                                                    "parent_id": "t1_e9uhlho",
                                                                    "score": 1,
                                                                    "created_utc": 1542409446.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Skyns are consistently touted as the best. I prefer Trojan Supra non-latex.",
                            "author": "girlz_are_42",
                            "id": "e9rue9t",
                            "parent_id": "t1_e9rg8cv",
                            "score": 4,
                            "created_utc": 1542316743.0,
                            "replies": []
                        },
                        {
                            "body": "Like already proposed, you have to try it for yourself. There are a couple of condom online shops that sell sample packs of different ultrathin brands.\n\n&#x200B;\n\nSo it really is personal, but the Skyn Elite has been the best overall for me. \n\n&#x200B;\n\nThe Sagami condom is fascinating but the problem is that it feels so real that I was constantly checking if I am still wearing it.",
                            "author": "tokenlover99",
                            "id": "e9ruvm0",
                            "parent_id": "t1_e9rg8cv",
                            "score": 2,
                            "created_utc": 1542317119.0,
                            "replies": []
                        },
                        {
                            "body": "I've only used SKYN Elite & it's much better than a trojan but bare back is still better...  \n\nNo idea on the Kimono & Sagami..",
                            "author": "mollyflowers",
                            "id": "e9rkkj4",
                            "parent_id": "t1_e9rg8cv",
                            "score": -1,
                            "created_utc": 1542309721.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hopefully she had this conversation BEFORE the M&G............  \n\nJust a confirmation that \"playing safe is not negotiable\" is so foundational (if it is a requirement of either) that it needs to be confirmed in a manner that puts it ahead of any economic discussions. ",
                    "author": "pinotandsugar",
                    "id": "e9rw13j",
                    "parent_id": "t1_e9r90kc",
                    "score": 2,
                    "created_utc": 1542317974.0,
                    "replies": []
                },
                {
                    "body": "I only have access to the two Japanese brand. By no means I am porn star big. Size large barely fits me and rolling down the last inch or so is hard because is so tight of a fit. As much as they are thin, they do feels like a harder material. That is my 2 cents anyway.",
                    "author": "SD_AU",
                    "id": "e9rs5m3",
                    "parent_id": "t1_e9r90kc",
                    "score": 0,
                    "created_utc": 1542315144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Well, then, you and I are not a match. Good luck!\"",
            "author": "OlderSD",
            "id": "e9rbits",
            "parent_id": "t3_9xcvqf",
            "score": 20,
            "created_utc": 1542302984.0,
            "replies": [
                {
                    "body": "The annoying thing about this is usually they will attempt to shame you after you say this... which is so stupid because it only reinforces that I wouldn’t want to meet the person ",
                    "author": "alexeySB",
                    "id": "e9rmi5o",
                    "parent_id": "t1_e9rbits",
                    "score": 13,
                    "created_utc": 1542311090.0,
                    "replies": [
                        {
                            "body": "Only pros use condoms! /s",
                            "author": "milliondollarkitty",
                            "id": "e9sckwd",
                            "parent_id": "t1_e9rmi5o",
                            "score": 7,
                            "created_utc": 1542330772.0,
                            "replies": []
                        },
                        {
                            "body": "Pffft! He's the one who should feel shame. Water off the back of a duck. Don't worry about it--he has successfully removed himself from further consideration.",
                            "author": "OlderSD",
                            "id": "e9rq63l",
                            "parent_id": "t1_e9rmi5o",
                            "score": 3,
                            "created_utc": 1542313719.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hear this a lot too. It further confirms to me that men think with their dick instead of their brain a lot of the time. They are willing to risk life threatening STD's for a little extra pleasure? STD tests can easily be faked. If someone told me they could show me their \"STD\" tests I would laugh. Unless the doctor faxed it straight to their computer and I could see that, I wouldn't believe a piece of paper sitting in front of me. Also, it doesn't even matter, they would need daily STD tests. They could go out the next day and raw dog someone with an STD.",
            "author": "BellaBaby19",
            "id": "e9rrat6",
            "parent_id": "t3_9xcvqf",
            "score": 12,
            "created_utc": 1542314555.0,
            "replies": [
                {
                    "body": ">They are willing to risk life threatening STD's for a little extra pleasure? \n\nYes, they are. Just like some men do skydiving, motocross and any risky activity you can think of. They have decided the pleasure they get from it is worth the increased risk.\n\nWhy is that a problem to you??? They have every right to ask for no condoms just as you have the right to reject them.\n\nWhy the shaming?",
                    "author": null,
                    "id": "e9sc6rp",
                    "parent_id": "t1_e9rrat6",
                    "score": -7,
                    "created_utc": 1542330412.0,
                    "replies": [
                        {
                            "body": "I can express my opinion however I want this is Reddit, why the shaming about me expressing my opinion? Stop it.",
                            "author": "BellaBaby19",
                            "id": "e9sggeh",
                            "parent_id": "t1_e9sc6rp",
                            "score": 5,
                            "created_utc": 1542334394.0,
                            "replies": [
                                {
                                    "body": ">If someone told me they could show me their \"STD\" tests I would laugh. \n\nHow is that NOT shaming men that don't agree with you?",
                                    "author": null,
                                    "id": "e9shujy",
                                    "parent_id": "t1_e9sggeh",
                                    "score": -6,
                                    "created_utc": 1542335681.0,
                                    "replies": [
                                        {
                                            "body": "Ok then I'm shaming men. I don't care if I am or not. ",
                                            "author": "BellaBaby19",
                                            "id": "e9spg5r",
                                            "parent_id": "t1_e9shujy",
                                            "score": 5,
                                            "created_utc": 1542342893.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It’s not shaming men that don’t agree with her! I’m sorry but you’re wrong.  She’s saying the idea that “an STD test” completely mitigates all risk is laughable.  You yourself agree that it is increasing your risk to have unprotected sex.. if you’re engaging in risky behavior you’re literally acting less responsibly.  \n\nI have no problem with a guy who owns that his behavior is risky as fuck, he could catch an STD at any moment, yet still prefers to go raw.  The problem is with the attempted “negotiation” and convincing these guys do.  They try to minimize concerns... but the concerns are very valid! \n\nI would absolutely and have laughed in someone’s face who attempted to tell me they were STD free and snipped in attempts to have unprotected sex with me.  I’m not shaming them for their desires I’m laughing at how illogical their responses are.  \n\nSo go ahead... if you want to propose no condom sex to me (which will always get a no) I will not shame your desire for the experience of raw sex... but if you start to  insinuate my concerns are irrelevant, or that it’s perfectly safe and fine.... I will totally judge that.  99% of the men in the bowl who want raw sex would never stop to ask a SB for an STD test.  If (and that’s a big if) they don’t have an STD yet, it’s only a matter of time. ",
                                            "author": "alexeySB",
                                            "id": "e9tep91",
                                            "parent_id": "t1_e9shujy",
                                            "score": 6,
                                            "created_utc": 1542379194.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ugg, this is a get up and walk out of the room right then and there.   Some people are just so damn stupid.",
            "author": "frombeee",
            "id": "e9rckv6",
            "parent_id": "t3_9xcvqf",
            "score": 13,
            "created_utc": 1542303796.0,
            "replies": []
        },
        {
            "body": "SB here...\n\nI can’t stand this either.\nIt’s an almost immediate turn off for me.\nEspecially the “I’ve been fixed” line.\n\nI’m disease free and get tested every 6 months but how does he know that what I’m telling him is true? Not one has ever asked if I had my results and if so to show them. \n\nI’m just not comfortable taking someone’s word that they don’t have any diseases! \n\nAnd I don’t raw dog anyone I’m not in a real relationship with. And when that does happen we’re both tested prior. \n\nI’ve had several POT end the convo when I say we’re using condoms, and I haven’t shed 1 tear when they go! \n\nHe could be sleeping with 12 people, raw, and I’m not taking any chances. And the same goes for me. How does he know how many people I’m actually sleeping with?! \n\n\nEdit: I was in a LT SR for 3 years and we used condoms every time! He has no issues, so it is possible. Our sex was very enjoyable and we had a blast!! ",
            "author": "PerfectlyAdorable",
            "id": "e9riz88",
            "parent_id": "t3_9xcvqf",
            "score": 13,
            "created_utc": 1542308537.0,
            "replies": [
                {
                    "body": "I hate the term “fixed” too.  So gross.  It makes them sound like a dog you took to the vet lmao.",
                    "author": "milliondollarkitty",
                    "id": "e9scoj1",
                    "parent_id": "t1_e9riz88",
                    "score": 5,
                    "created_utc": 1542330868.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely insane, to even ask. I'm over 50 and hate condoms but it is an necessary evil. I never would consider going without in an SR. I've been divorced 10 years and haven't gone without one, since.",
            "author": "want2cokc",
            "id": "e9rbvjo",
            "parent_id": "t3_9xcvqf",
            "score": 19,
            "created_utc": 1542303259.0,
            "replies": []
        },
        {
            "body": "Send him a link to the recent newspaper articles on the rise of super drug resistant STIs those alarming figures should wake him up",
            "author": "plussizefairy",
            "id": "e9rsf8t",
            "parent_id": "t3_9xcvqf",
            "score": 9,
            "created_utc": 1542315325.0,
            "replies": []
        },
        {
            "body": "\"Fine with me, I never use condoms anyway, the antibiotics irritate my stomach a little, but it's worth it to feel close to my partner\" ",
            "author": "MASugarBaby",
            "id": "e9s62n9",
            "parent_id": "t3_9xcvqf",
            "score": 7,
            "created_utc": 1542325408.0,
            "replies": []
        },
        {
            "body": "I hate it too! You suggest them get tested before going raw and then they complain about it not being cheap.  Guess what isn't cheap either? Treating an STI! At least you daddies are supposed to have more spare money. I doubt any SD would pay medical treatments for a SB they get infected for insisting in Raw right away.  \n\nUnless we agree to exclusivity and we get tested, we ain't going raw. Also,  we have to keep getting tested frequently enough. \n\n*per ardua ad astra*",
            "author": null,
            "id": "e9rcdb5",
            "parent_id": "t3_9xcvqf",
            "score": 19,
            "created_utc": 1542303639.0,
            "replies": [
                {
                    "body": "per ardua ad astra\n\nOne of my favorite mottos - thanks",
                    "author": null,
                    "id": "e9rfj0a",
                    "parent_id": "t1_e9rcdb5",
                    "score": 3,
                    "created_utc": 1542306027.0,
                    "replies": []
                },
                {
                    "body": "> I hate it too! You suggest them get tested before going raw and then they complain about it not being cheap\n\nI'm an SD that - in a an ongoing, exclusive arrangement - I prefer being able to go raw.  \n\nHowever, I'l never complain about testing.  Maybe if you wanted to get tested every month?  That would probably be a bit extreme.  Every 3-6 months?  (plus the initial?).  I can't see why any sane person would disagree.  ",
                    "author": "SDstartingOut",
                    "id": "e9rnfwz",
                    "parent_id": "t1_e9rcdb5",
                    "score": 5,
                    "created_utc": 1542311757.0,
                    "replies": [
                        {
                            "body": "Absolutely,  only initial STI testing and then follow up every 3-6 months. Requesting to go raw to a new partner just trusting their word that they are clean won't fly. Safety first. ",
                            "author": null,
                            "id": "e9rnoyw",
                            "parent_id": "t1_e9rnfwz",
                            "score": 5,
                            "created_utc": 1542311933.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> and then they complain about it not being cheap.\n\nIf they live in any metro area in the US, there are going to be a billion free options.\n\n> Guess what isn't cheap either? Treating an STI!\n\nDepends on the STD.  Depending on your insurance, gonorrhea/chlamydia will run you around $15.\n\n",
                    "author": null,
                    "id": "e9rlqwi",
                    "parent_id": "t1_e9rcdb5",
                    "score": 1,
                    "created_utc": 1542310565.0,
                    "replies": [
                        {
                            "body": "Bold of you to assume I can afford insurance. Then again,  it's $50 just across the border so it's not a big deal.\n\n\n\n",
                            "author": null,
                            "id": "e9rlyww",
                            "parent_id": "t1_e9rlqwi",
                            "score": 3,
                            "created_utc": 1542310717.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Forget him, immediately. Sorry this happened to you.",
            "author": "chitownguy321",
            "id": "e9siv4g",
            "parent_id": "t3_9xcvqf",
            "score": 5,
            "created_utc": 1542336625.0,
            "replies": []
        },
        {
            "body": "Guy here: Not using condoms is a deal breaker for me. ",
            "author": "cambeiu",
            "id": "e9rfwto",
            "parent_id": "t3_9xcvqf",
            "score": 10,
            "created_utc": 1542306314.0,
            "replies": []
        },
        {
            "body": "Gosh. I hate this. I usually tell them off nicely. They are risking everyone of STIs and more in the community. \nI had one recently saying they get tested often and we would have to shown each others clear tests. Even after I said no. I then informed them that tests only cover over two weeks ago for a few things and you have to wait longer for other results. Then they said they hadn't had sex for a long time anyway.... 🤣 Yeah I believe you. \nI find it really disrespectful and stupid. \nGuys thinking \"Let me meet a stranger and have sex with no condoms, I don't mind risking my health and possible pregnancy\"\nNever trust someone like this. They need to understand it is the norm to wear condoms unless a long exclusive relationship has been formed and condoms can be just as good without. ",
            "author": "BrunetteYlondon",
            "id": "e9s6e3n",
            "parent_id": "t3_9xcvqf",
            "score": 5,
            "created_utc": 1542325653.0,
            "replies": []
        },
        {
            "body": "He doesn’t deserve you ",
            "author": "marcus112",
            "id": "e9sdwos",
            "parent_id": "t3_9xcvqf",
            "score": 3,
            "created_utc": 1542332014.0,
            "replies": []
        },
        {
            "body": "Ive heard \"I got \"fixed\" so you cant get pregnant.\" like that doesn't raise my concern levels a bit higher. Those that ask for things that should never be asked because they have money, like Im not going to compromise my health for your money. And its just overall disgusting and it turns me off lol like forget what you want asshole, I don't want to be anywhere near you now.",
            "author": "hyvon92",
            "id": "e9t26b9",
            "parent_id": "t3_9xcvqf",
            "score": 4,
            "created_utc": 1542361748.0,
            "replies": []
        },
        {
            "body": "Would never ever raw anyone in this lifestyle, even with test results.",
            "author": "vdzz000",
            "id": "e9rpx09",
            "parent_id": "t3_9xcvqf",
            "score": 8,
            "created_utc": 1542313540.0,
            "replies": [
                {
                    "body": "Oh my god- agreed. You can never be too safe",
                    "author": "Cbdtrees",
                    "id": "e9s14c3",
                    "parent_id": "t1_e9rpx09",
                    "score": 1,
                    "created_utc": 1542321810.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HE must have all the STDs there are to get, already. So he’s no longer scared :p\n\n",
            "author": "thesluttypet",
            "id": "e9sdebo",
            "parent_id": "t3_9xcvqf",
            "score": 7,
            "created_utc": 1542331531.0,
            "replies": []
        },
        {
            "body": "It's so messed up isnt it! Its like... Okay I get it, you don't like using condoms. But usually in my case I stop using condoms after we have a long term thing going. But the SDs who insist on no condom use from the beginning are just crazy!",
            "author": "ButterflyTattoo",
            "id": "e9rn2y9",
            "parent_id": "t3_9xcvqf",
            "score": 3,
            "created_utc": 1542311508.0,
            "replies": []
        },
        {
            "body": "Just say No and move on , no need to explain ",
            "author": "doctorcoolpop",
            "id": "e9rv2bj",
            "parent_id": "t3_9xcvqf",
            "score": 3,
            "created_utc": 1542317260.0,
            "replies": []
        },
        {
            "body": "Each of us can choose the SR that we want.  I will use a condom with a new partner until we establish trust. exclusivity, and negative testing.  But long term condoms are a deal breaker. I will also not see a SB who is poly for obvious reasons. There is no exclusivity in that group.",
            "author": "GSSD",
            "id": "e9rc7mp",
            "parent_id": "t3_9xcvqf",
            "score": 12,
            "created_utc": 1542303520.0,
            "replies": [
                {
                    "body": "I understand what you’re saying. That’s where my problem was though, I told him after some time has passed and we establish ourselves/get to know each other we can revisit the topic. Wouldn’t entertain the idea. Said it’s either no condoms or no SR- to which I said “I respect your decision to be firm however I am firm on this as well. Hope you find what you’re looking for.” ",
                    "author": "throwaway090789",
                    "id": "e9rczar",
                    "parent_id": "t1_e9rc7mp",
                    "score": 12,
                    "created_utc": 1542304085.0,
                    "replies": [
                        {
                            "body": "Yes, I totally don't blame you. He sounds like a dik",
                            "author": "GSSD",
                            "id": "e9riwqj",
                            "parent_id": "t1_e9rczar",
                            "score": 4,
                            "created_utc": 1542308488.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You are going to be downvoted as usual for the unpopular opinion. But very well said.\n\nI assume you are up front with what you want before your SR starts.",
                    "author": "girlz_are_42",
                    "id": "e9rutpz",
                    "parent_id": "t1_e9rc7mp",
                    "score": 2,
                    "created_utc": 1542317080.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e9rzg37",
                            "parent_id": "t1_e9rutpz",
                            "score": 2,
                            "created_utc": 1542320571.0,
                            "replies": [
                                {
                                    "body": "Your posts are disgusting and judgmental.  You attempt to tear women and men down in this forum when in reality, you are a married man! The ultimate hypocrite.  I have one SD and don’t really have the time or energy to be seeing other people, so by no means am I riding the “cock carousel” but I’m realistic enough to realize that exclusivity is not a realistic concept when you’re dealing with a man who ends your date to go climb into bed with his wife. \n\nAnd how dare you with your laughable comment about twitchy clits and hormones... what exactly brought you to an alternative lifestyle where you can have unprotected sex with young girls behind your wife’s back? My guess it would be raging hormones and a twitching something\n\nDon’t throw stones from glass houses, dude",
                                    "author": "alexeySB",
                                    "id": "e9tfk33",
                                    "parent_id": "t1_e9rzg37",
                                    "score": 12,
                                    "created_utc": 1542379990.0,
                                    "replies": [
                                        {
                                            "body": "Point taken alexey. It seems like I hit a nerve though. \n\nBTW, is your SD married? If so \"open \" relationship I'm sure. ",
                                            "author": "GSSD",
                                            "id": "e9tgyou",
                                            "parent_id": "t1_e9tfk33",
                                            "score": -1,
                                            "created_utc": 1542381251.0,
                                            "replies": [
                                                {
                                                    "body": "It’s not that you hit a nerve, it’s that I keep seeing your comments over and over again pointing the blame on others when it seems like you may hold deep seated shame revolving monogamy or lack thereof.  You shame people for their honest views and yet your stance is built on a hypocritical and unhealthy view of exclusivity (since you are a married man sleeping with someone other than your wife). \n\nAnd yes, my SD is married.  He does not have another SB and I am not seeing anyone else but it is absolutely an open relationship as he has no intention to leave his wife.  He has even asked me about my love life outside of the SR.  He is in his 50s so he’s by no means a millennial or new aged... he’s just realistic!  Not having exclusivity does not always equate to a cock carousel.  And even if it did for someone, you really have no room to judge!  Perhaps if you had been more sexually liberated and honest about your sexual desires earlier in life you would not have ended up legally bound to a significant other that you felt like you needed to secretly step out on for sexual satisfaction.  \n\nThere is no need to shame women and men who are simply being realistic about this lifestyle.  That is why you are often downvoted — because you’re not adding any value by degrading the entire community you’re participating in.  You should be thankful for the SBs that don’t demand exclusivity because despite what you tell yourself, what you are offering is not an exclusive relationship. ",
                                                    "author": "alexeySB",
                                                    "id": "e9tiy67",
                                                    "parent_id": "t1_e9tgyou",
                                                    "score": 12,
                                                    "created_utc": 1542382958.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
                                                            "author": "GSSD",
                                                            "id": "e9tkudo",
                                                            "parent_id": "t1_e9tiy67",
                                                            "score": -2,
                                                            "created_utc": 1542384513.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                                                                    "author": "alexeySB",
                                                                    "id": "e9tlur4",
                                                                    "parent_id": "t1_e9tkudo",
                                                                    "score": 7,
                                                                    "created_utc": 1542385338.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                                                                            "author": "GSSD",
                                                                            "id": "e9u2po4",
                                                                            "parent_id": "t1_e9tlur4",
                                                                            "score": -1,
                                                                            "created_utc": 1542397736.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                                                                            "author": "lcsugar",
                                                                            "id": "e9wgic1",
                                                                            "parent_id": "t1_e9tlur4",
                                                                            "score": 0,
                                                                            "created_utc": 1542480859.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                                                                    "author": "alexeySB",
                                                                                    "id": "e9wlkyv",
                                                                                    "parent_id": "t1_e9wgic1",
                                                                                    "score": 5,
                                                                                    "created_utc": 1542483972.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                                                                            "author": "lcsugar",
                                                                                            "id": "e9wlwrb",
                                                                                            "parent_id": "t1_e9wlkyv",
                                                                                            "score": 0,
                                                                                            "created_utc": 1542484162.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                                                                    "author": "alexeySB",
                                                                                                    "id": "e9wy7nj",
                                                                                                    "parent_id": "t1_e9wlwrb",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1542491817.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">IRL I think there are plenty of girls who do not have raging hormones and twitchy clits but need a little help in life and do not need to ride the cock carousel. \n\nYou could have done without this sentence.  Shaming others for their views and actions is not welcome here. ",
                                    "author": "texassugarbabe",
                                    "id": "e9uan3z",
                                    "parent_id": "t1_e9rzg37",
                                    "score": 7,
                                    "created_utc": 1542403796.0,
                                    "replies": [
                                        {
                                            "body": "True that-thanks. I took it out.",
                                            "author": "GSSD",
                                            "id": "e9ubjhe",
                                            "parent_id": "t1_e9uan3z",
                                            "score": -1,
                                            "created_utc": 1542404491.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some (many?) men have a preference for sensation over safety or a great connection. I've been surprised over the number of seemingly intelligent, understanding and caring men (vanilla included) who bitched about condoms. I went home crying one night over someone (former coworker) I thought would be different. I don't cry anymore. The majority of men are instinct based and animalistic that's just the harsh reality. But at the same time which gender has any more morals than the other? Men objectify women for physical pleasure and women objectify men for emotional and financial support. I met with a man who was going to put it in raw if I hadn't asked him to put condoms on (he brought condoms mildly redeeming). Then he asked if I'd consider raw if we got tested. I said no (hell no inside my head) I knew it wouldn't last long based on his needs but we had a fun few dates. I knew he'd find someone else who would go bare. Which was kind of crazy to me based on his profession that he'd be so reckless (also he is married). But that's men. Sagami condoms feel amazing. In my one and only experience with them they slid a bit which was concerning but they stayed on. Saw a couple reviews that had the same experience but most had no problems.",
            "author": "MorningStarElyxir",
            "id": "e9sb4a1",
            "parent_id": "t3_9xcvqf",
            "score": 3,
            "created_utc": 1542329479.0,
            "replies": []
        },
        {
            "body": "I’m convinced that men either don’t believe a woman can give them an STD/STI, or they don’t care if they do get one. \n\nI’ve also had a few men bring this up asking  “are you on birth control”, with one responding “we’ll be careful then” when I say I’m not. \n\nAnother one asked the same question, and when I said I wasn’t on BC asked if I would keep the baby. \n\nThose two men were older, but had young children and now I see why! In person they were nice and normal, and had no red flags. I was shocked when they texted these things. \n\nAnother man who I also really liked, told me he just got tested and will show me those results. He never even asked me for mine, though or asked if I was on birth control, just assumed. Which seems odd. He too held a similar mindset, but decided to decline seeing each other instead of trying to “be careful”.\n\n2 were from SA, one was from Bumble. I’ve also met young, vanilla men and know girlfriends who are all about the “pull out” method. It’s ridiculous out here! 🙈",
            "author": null,
            "id": "eakuppi",
            "parent_id": "t3_9xcvqf",
            "score": 1,
            "created_utc": 1543335966.0,
            "replies": []
        },
        {
            "body": "Totally understandable. Never compromise on your safety.",
            "author": null,
            "id": "eihzglh",
            "parent_id": "t3_9xcvqf",
            "score": 1,
            "created_utc": 1552559676.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9s2krk",
            "parent_id": "t3_9xcvqf",
            "score": 0,
            "created_utc": 1542322836.0,
            "replies": [
                {
                    "body": "I don’t know if you read the comments but, I told him that after some time I was willing to revisit the topic. After we build a report and exclusivity. I get tested every few months so I have nothing to hide- although I feel like it’s a red flag to not even consider the thought of condoms during the first encounters. Appreciate the advice either way! ",
                    "author": "throwaway090789",
                    "id": "e9s3jx1",
                    "parent_id": "t1_e9s2krk",
                    "score": 7,
                    "created_utc": 1542323604.0,
                    "replies": [
                        {
                            "body": "If this guy thinks the only difference between SB's and escorts is not having to use condoms, he's probably not someone you should be taking advice from..! Lol don't put anything about condoms in your profile, that's shit advice.",
                            "author": "yourgirlfriday99",
                            "id": "e9srmgl",
                            "parent_id": "t1_e9s3jx1",
                            "score": 12,
                            "created_utc": 1542345403.0,
                            "replies": []
                        },
                        {
                            "body": "This is perfectly reasonable for both sides. As a guy I think\n\n* The SB won't enjoy sex anyway if shes worrying about STD's\n* SD has to be fixed, period.\n* SD AND SB should be exclusive, needs to show trust.\n* Tests every so often, obviously\n* SB should be the one to decide, honestly, when to go no condom, without taking too much time. Maybe around 4 months perhaps?\n* If SB feels comfortable enough to go no condom, SD should absolutely increase sugar as well, so both parties are happy\n\nThats about it?",
                            "author": null,
                            "id": "e9sy6ww",
                            "parent_id": "t1_e9s3jx1",
                            "score": 1,
                            "created_utc": 1542355156.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">If you require condoms, there really isn't any point to giving you an allowance and all that vs just picking up someone hourly off E, AL, YBP, etc.\n\nAre you kidding me? SBs are not the condomless version of an escort. And how about you write it in your profile if it’s that important to you? Really gross comment as clearly all you’re looking for is sex and nothing more.  There is so much wrong with your comment I can’t even take it ",
                    "author": "alexeySB",
                    "id": "e9tftik",
                    "parent_id": "t1_e9s2krk",
                    "score": 2,
                    "created_utc": 1542380222.0,
                    "replies": []
                },
                {
                    "body": "what do all these letters mean?  E, AL, YBP",
                    "author": "lcsugar",
                    "id": "e9wfuco",
                    "parent_id": "t1_e9s2krk",
                    "score": 1,
                    "created_utc": 1542480416.0,
                    "replies": []
                },
                {
                    "body": "If you’ve been together for months exclusively, there is trust, and you are actually giving a monthly allowance, then I could see transitioning into that. \n\nBut I’ve encountered plenty of men wanting to do this from the first encounter. Which is ridiculous, because likely they’re still talking to other woman, and I other men, and of course no trust has been built. ",
                    "author": null,
                    "id": "eakv3sw",
                    "parent_id": "t1_e9s2krk",
                    "score": 1,
                    "created_utc": 1543336269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly! Or even worse (not worse than HIV)... getting a SB pregnant!!!! These guys don’t care because they use fake names and would likely ghost if they were to get a SB pregnant.  And the whole “snipped” BS cracks me up... how/why would I believe you??? ",
            "author": "alexeySB",
            "id": "e9rahbe",
            "parent_id": "t1_e9ra9df",
            "score": 39,
            "created_utc": 1542302180.0,
            "replies": [
                {
                    "body": "You mean you don't carry the equipment to do a quick spur-of-the-moment sperm count before doing the deed? Amateur. \n\n🙃",
                    "author": "Zephyrus0101",
                    "id": "e9raxb1",
                    "parent_id": "t1_e9rahbe",
                    "score": 18,
                    "created_utc": 1542302517.0,
                    "replies": []
                },
                {
                    "body": "It's possible to have a completely anonymous SA account, but a good cyber sleuth could track them down.  Unless the SD is using a VPN, anonymous email, re-loadable visa, & fake photos, then a subpoena by a licensed 1st year attorney will walk through 99% of the issues.\n\nQuite a few of us SD's are snipped & trust me the last thing I want to do is knock up a SB...\n\nThe STI's are the killer currently, wrap it until you are both tested..  ",
                    "author": "mollyflowers",
                    "id": "e9rkw8o",
                    "parent_id": "t1_e9rahbe",
                    "score": 7,
                    "created_utc": 1542309962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He tried to persuade me with “I am tested”. Yeah well ya girl also gets tested, does that mean I’m willing to compromise that for someone I don’t know very well? Fuck no. Never in a million years would I ever consider it. ",
            "author": "throwaway090789",
            "id": "e9rbb4n",
            "parent_id": "t1_e9ra9df",
            "score": 16,
            "created_utc": 1542302820.0,
            "replies": [
                {
                    "body": "Dude was probably tested within the last year but who knows how many partners he has had since the test.  Best to wrap it up until their is trust & exclusivity as in a Sugar Girlfriend...\n\n",
                    "author": "mollyflowers",
                    "id": "e9rnsts",
                    "parent_id": "t1_e9rbb4n",
                    "score": 11,
                    "created_utc": 1542312007.0,
                    "replies": [
                        {
                            "body": "Or what STIs he carries but are dormant. \n\nYou know what, actually how about: if the girl is uncomfortable, don’t guilt her — who wants to force someone into not enjoying something? He should go find someone else (riskier, less safe, and probably a wild card in other areas too...) IMHO. ",
                            "author": "ilovecookies86",
                            "id": "e9rujj3",
                            "parent_id": "t1_e9rnsts",
                            "score": 10,
                            "created_utc": 1542316860.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Most STIs are easily curable these days with one or two antibiotic pills, and many others can now be vaccinated against. And the rates of HIV/AIDS transmission are lower than ever! Statistically speaking, there's never been a better time to have unprotected sex.\n\nHere are [some statistics from the WHO](http://www.who.int/news-room/fact-sheets/detail/sexually-transmitted-infections-\\(stis\\)) showing that 357 million of the 360 million STIs contracted each year are curable. I'll save you the math - that's a more than 99% cure rate.\n\nAnd here are some [statistics for the US](https://www.hiv.gov/hiv-basics/overview/data-and-trends/statistics) specifically showing that the rate of new HIV infections dropped 8% between 2010 and 2015.",
            "author": "therealblaine",
            "id": "eblx71m",
            "parent_id": "t1_e9ra9df",
            "score": 1,
            "created_utc": 1544584870.0,
            "replies": []
        },
        {
            "body": "But what if he's had a vasectomy? Those are the men that push the most for going raw.",
            "author": null,
            "id": "e9rfxv2",
            "parent_id": "t1_e9reenm",
            "score": 11,
            "created_utc": 1542306335.0,
            "replies": [
                {
                    "body": "Had a vasectomy 12 years ago and never push to go without. ",
                    "author": "want2cokc",
                    "id": "e9rgrfa",
                    "parent_id": "t1_e9rfxv2",
                    "score": 6,
                    "created_utc": 1542306954.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂 I resonate with this level of petty. Fuel for future conversations put in my memory bank. ",
            "author": "throwaway090789",
            "id": "e9s4awx",
            "parent_id": "t1_e9reenm",
            "score": 4,
            "created_utc": 1542324134.0,
            "replies": []
        },
        {
            "body": "I have to steal this. I may have to ask if his wife minds watching the child while I’m at work 🤷🏻‍♀️",
            "author": "tannedsb05",
            "id": "e9s9g6z",
            "parent_id": "t1_e9reenm",
            "score": 5,
            "created_utc": 1542328144.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9rg8cv",
            "parent_id": "t1_e9r90kc",
            "score": 6,
            "created_utc": 1542306554.0,
            "replies": [
                {
                    "body": "Really depends.  If you're \"girthy\" the Sagami may be too tight.  I like the skyn Elites and Okamoto zero four zero.  The Elites have a better lube and are longer.  The Okamoto feel better but get snug if I'm really aroused and I wish it was a little longer.\n\nHonestly get on Amazon and order small packs of all of them, it's worth the effort of finding one you're happier with.",
                    "author": null,
                    "id": "e9rsaz1",
                    "parent_id": "t1_e9rg8cv",
                    "score": 4,
                    "created_utc": 1542315245.0,
                    "replies": []
                },
                {
                    "body": "Agree with the point on it depends on you.\n\nNOTE: the BIGGEST difference between these three and a normal condom isn't the fit, it's the **material**. Latex SUCKS. I can't underscore this enough. It's a terrible material for condoms; I've written about this on the forum before.\n\nI hate latex condoms but actually prefer Skyn Large to bareback, because of the ease of cleanup before the second or third rounds. Unfortunately, agree that the Japanese brands are a little tight and Skyn doesn't make an Elite in a larger size :-(\n\n&#x200B;",
                    "author": "curiousgenerous",
                    "id": "e9rt4ql",
                    "parent_id": "t1_e9rg8cv",
                    "score": 8,
                    "created_utc": 1542315809.0,
                    "replies": [
                        {
                            "body": "Any suggestions for a large size? He usually uses the gold trogana and even those are tight",
                            "author": "beanlvr",
                            "id": "e9sldaf",
                            "parent_id": "t1_e9rt4ql",
                            "score": 1,
                            "created_utc": 1542339015.0,
                            "replies": [
                                {
                                    "body": "Skyn Large is I think the best that are readily available. They are physically smaller than Trojan Magnums, but they are made from polyisoprene which stretches and fits differently than latex. They are *definitely* worth a try.",
                                    "author": "curiousgenerous",
                                    "id": "e9tzack",
                                    "parent_id": "t1_e9sldaf",
                                    "score": 1,
                                    "created_utc": 1542395296.0,
                                    "replies": [
                                        {
                                            "body": "Do you know if you can buy them in stores? ",
                                            "author": "beanlvr",
                                            "id": "e9tzqnw",
                                            "parent_id": "t1_e9tzack",
                                            "score": 1,
                                            "created_utc": 1542395632.0,
                                            "replies": [
                                                {
                                                    "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
                                                    "author": "curiousgenerous",
                                                    "id": "e9uhlho",
                                                    "parent_id": "t1_e9tzqnw",
                                                    "score": 1,
                                                    "created_utc": 1542409183.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you!!!",
                                                            "author": "beanlvr",
                                                            "id": "e9uhxed",
                                                            "parent_id": "t1_e9uhlho",
                                                            "score": 1,
                                                            "created_utc": 1542409446.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Skyns are consistently touted as the best. I prefer Trojan Supra non-latex.",
                    "author": "girlz_are_42",
                    "id": "e9rue9t",
                    "parent_id": "t1_e9rg8cv",
                    "score": 4,
                    "created_utc": 1542316743.0,
                    "replies": []
                },
                {
                    "body": "Like already proposed, you have to try it for yourself. There are a couple of condom online shops that sell sample packs of different ultrathin brands.\n\n&#x200B;\n\nSo it really is personal, but the Skyn Elite has been the best overall for me. \n\n&#x200B;\n\nThe Sagami condom is fascinating but the problem is that it feels so real that I was constantly checking if I am still wearing it.",
                    "author": "tokenlover99",
                    "id": "e9ruvm0",
                    "parent_id": "t1_e9rg8cv",
                    "score": 2,
                    "created_utc": 1542317119.0,
                    "replies": []
                },
                {
                    "body": "I've only used SKYN Elite & it's much better than a trojan but bare back is still better...  \n\nNo idea on the Kimono & Sagami..",
                    "author": "mollyflowers",
                    "id": "e9rkkj4",
                    "parent_id": "t1_e9rg8cv",
                    "score": -1,
                    "created_utc": 1542309721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hopefully she had this conversation BEFORE the M&G............  \n\nJust a confirmation that \"playing safe is not negotiable\" is so foundational (if it is a requirement of either) that it needs to be confirmed in a manner that puts it ahead of any economic discussions. ",
            "author": "pinotandsugar",
            "id": "e9rw13j",
            "parent_id": "t1_e9r90kc",
            "score": 2,
            "created_utc": 1542317974.0,
            "replies": []
        },
        {
            "body": "I only have access to the two Japanese brand. By no means I am porn star big. Size large barely fits me and rolling down the last inch or so is hard because is so tight of a fit. As much as they are thin, they do feels like a harder material. That is my 2 cents anyway.",
            "author": "SD_AU",
            "id": "e9rs5m3",
            "parent_id": "t1_e9r90kc",
            "score": 0,
            "created_utc": 1542315144.0,
            "replies": []
        },
        {
            "body": "The annoying thing about this is usually they will attempt to shame you after you say this... which is so stupid because it only reinforces that I wouldn’t want to meet the person ",
            "author": "alexeySB",
            "id": "e9rmi5o",
            "parent_id": "t1_e9rbits",
            "score": 13,
            "created_utc": 1542311090.0,
            "replies": [
                {
                    "body": "Only pros use condoms! /s",
                    "author": "milliondollarkitty",
                    "id": "e9sckwd",
                    "parent_id": "t1_e9rmi5o",
                    "score": 7,
                    "created_utc": 1542330772.0,
                    "replies": []
                },
                {
                    "body": "Pffft! He's the one who should feel shame. Water off the back of a duck. Don't worry about it--he has successfully removed himself from further consideration.",
                    "author": "OlderSD",
                    "id": "e9rq63l",
                    "parent_id": "t1_e9rmi5o",
                    "score": 3,
                    "created_utc": 1542313719.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">They are willing to risk life threatening STD's for a little extra pleasure? \n\nYes, they are. Just like some men do skydiving, motocross and any risky activity you can think of. They have decided the pleasure they get from it is worth the increased risk.\n\nWhy is that a problem to you??? They have every right to ask for no condoms just as you have the right to reject them.\n\nWhy the shaming?",
            "author": null,
            "id": "e9sc6rp",
            "parent_id": "t1_e9rrat6",
            "score": -7,
            "created_utc": 1542330412.0,
            "replies": [
                {
                    "body": "I can express my opinion however I want this is Reddit, why the shaming about me expressing my opinion? Stop it.",
                    "author": "BellaBaby19",
                    "id": "e9sggeh",
                    "parent_id": "t1_e9sc6rp",
                    "score": 5,
                    "created_utc": 1542334394.0,
                    "replies": [
                        {
                            "body": ">If someone told me they could show me their \"STD\" tests I would laugh. \n\nHow is that NOT shaming men that don't agree with you?",
                            "author": null,
                            "id": "e9shujy",
                            "parent_id": "t1_e9sggeh",
                            "score": -6,
                            "created_utc": 1542335681.0,
                            "replies": [
                                {
                                    "body": "Ok then I'm shaming men. I don't care if I am or not. ",
                                    "author": "BellaBaby19",
                                    "id": "e9spg5r",
                                    "parent_id": "t1_e9shujy",
                                    "score": 5,
                                    "created_utc": 1542342893.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s not shaming men that don’t agree with her! I’m sorry but you’re wrong.  She’s saying the idea that “an STD test” completely mitigates all risk is laughable.  You yourself agree that it is increasing your risk to have unprotected sex.. if you’re engaging in risky behavior you’re literally acting less responsibly.  \n\nI have no problem with a guy who owns that his behavior is risky as fuck, he could catch an STD at any moment, yet still prefers to go raw.  The problem is with the attempted “negotiation” and convincing these guys do.  They try to minimize concerns... but the concerns are very valid! \n\nI would absolutely and have laughed in someone’s face who attempted to tell me they were STD free and snipped in attempts to have unprotected sex with me.  I’m not shaming them for their desires I’m laughing at how illogical their responses are.  \n\nSo go ahead... if you want to propose no condom sex to me (which will always get a no) I will not shame your desire for the experience of raw sex... but if you start to  insinuate my concerns are irrelevant, or that it’s perfectly safe and fine.... I will totally judge that.  99% of the men in the bowl who want raw sex would never stop to ask a SB for an STD test.  If (and that’s a big if) they don’t have an STD yet, it’s only a matter of time. ",
                                    "author": "alexeySB",
                                    "id": "e9tep91",
                                    "parent_id": "t1_e9shujy",
                                    "score": 6,
                                    "created_utc": 1542379194.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hate the term “fixed” too.  So gross.  It makes them sound like a dog you took to the vet lmao.",
            "author": "milliondollarkitty",
            "id": "e9scoj1",
            "parent_id": "t1_e9riz88",
            "score": 5,
            "created_utc": 1542330868.0,
            "replies": []
        },
        {
            "body": "per ardua ad astra\n\nOne of my favorite mottos - thanks",
            "author": null,
            "id": "e9rfj0a",
            "parent_id": "t1_e9rcdb5",
            "score": 3,
            "created_utc": 1542306027.0,
            "replies": []
        },
        {
            "body": "> I hate it too! You suggest them get tested before going raw and then they complain about it not being cheap\n\nI'm an SD that - in a an ongoing, exclusive arrangement - I prefer being able to go raw.  \n\nHowever, I'l never complain about testing.  Maybe if you wanted to get tested every month?  That would probably be a bit extreme.  Every 3-6 months?  (plus the initial?).  I can't see why any sane person would disagree.  ",
            "author": "SDstartingOut",
            "id": "e9rnfwz",
            "parent_id": "t1_e9rcdb5",
            "score": 5,
            "created_utc": 1542311757.0,
            "replies": [
                {
                    "body": "Absolutely,  only initial STI testing and then follow up every 3-6 months. Requesting to go raw to a new partner just trusting their word that they are clean won't fly. Safety first. ",
                    "author": null,
                    "id": "e9rnoyw",
                    "parent_id": "t1_e9rnfwz",
                    "score": 5,
                    "created_utc": 1542311933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> and then they complain about it not being cheap.\n\nIf they live in any metro area in the US, there are going to be a billion free options.\n\n> Guess what isn't cheap either? Treating an STI!\n\nDepends on the STD.  Depending on your insurance, gonorrhea/chlamydia will run you around $15.\n\n",
            "author": null,
            "id": "e9rlqwi",
            "parent_id": "t1_e9rcdb5",
            "score": 1,
            "created_utc": 1542310565.0,
            "replies": [
                {
                    "body": "Bold of you to assume I can afford insurance. Then again,  it's $50 just across the border so it's not a big deal.\n\n\n\n",
                    "author": null,
                    "id": "e9rlyww",
                    "parent_id": "t1_e9rlqwi",
                    "score": 3,
                    "created_utc": 1542310717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my god- agreed. You can never be too safe",
            "author": "Cbdtrees",
            "id": "e9s14c3",
            "parent_id": "t1_e9rpx09",
            "score": 1,
            "created_utc": 1542321810.0,
            "replies": []
        },
        {
            "body": "I understand what you’re saying. That’s where my problem was though, I told him after some time has passed and we establish ourselves/get to know each other we can revisit the topic. Wouldn’t entertain the idea. Said it’s either no condoms or no SR- to which I said “I respect your decision to be firm however I am firm on this as well. Hope you find what you’re looking for.” ",
            "author": "throwaway090789",
            "id": "e9rczar",
            "parent_id": "t1_e9rc7mp",
            "score": 12,
            "created_utc": 1542304085.0,
            "replies": [
                {
                    "body": "Yes, I totally don't blame you. He sounds like a dik",
                    "author": "GSSD",
                    "id": "e9riwqj",
                    "parent_id": "t1_e9rczar",
                    "score": 4,
                    "created_utc": 1542308488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are going to be downvoted as usual for the unpopular opinion. But very well said.\n\nI assume you are up front with what you want before your SR starts.",
            "author": "girlz_are_42",
            "id": "e9rutpz",
            "parent_id": "t1_e9rc7mp",
            "score": 2,
            "created_utc": 1542317080.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e9rzg37",
                    "parent_id": "t1_e9rutpz",
                    "score": 2,
                    "created_utc": 1542320571.0,
                    "replies": [
                        {
                            "body": "Your posts are disgusting and judgmental.  You attempt to tear women and men down in this forum when in reality, you are a married man! The ultimate hypocrite.  I have one SD and don’t really have the time or energy to be seeing other people, so by no means am I riding the “cock carousel” but I’m realistic enough to realize that exclusivity is not a realistic concept when you’re dealing with a man who ends your date to go climb into bed with his wife. \n\nAnd how dare you with your laughable comment about twitchy clits and hormones... what exactly brought you to an alternative lifestyle where you can have unprotected sex with young girls behind your wife’s back? My guess it would be raging hormones and a twitching something\n\nDon’t throw stones from glass houses, dude",
                            "author": "alexeySB",
                            "id": "e9tfk33",
                            "parent_id": "t1_e9rzg37",
                            "score": 12,
                            "created_utc": 1542379990.0,
                            "replies": [
                                {
                                    "body": "Point taken alexey. It seems like I hit a nerve though. \n\nBTW, is your SD married? If so \"open \" relationship I'm sure. ",
                                    "author": "GSSD",
                                    "id": "e9tgyou",
                                    "parent_id": "t1_e9tfk33",
                                    "score": -1,
                                    "created_utc": 1542381251.0,
                                    "replies": [
                                        {
                                            "body": "It’s not that you hit a nerve, it’s that I keep seeing your comments over and over again pointing the blame on others when it seems like you may hold deep seated shame revolving monogamy or lack thereof.  You shame people for their honest views and yet your stance is built on a hypocritical and unhealthy view of exclusivity (since you are a married man sleeping with someone other than your wife). \n\nAnd yes, my SD is married.  He does not have another SB and I am not seeing anyone else but it is absolutely an open relationship as he has no intention to leave his wife.  He has even asked me about my love life outside of the SR.  He is in his 50s so he’s by no means a millennial or new aged... he’s just realistic!  Not having exclusivity does not always equate to a cock carousel.  And even if it did for someone, you really have no room to judge!  Perhaps if you had been more sexually liberated and honest about your sexual desires earlier in life you would not have ended up legally bound to a significant other that you felt like you needed to secretly step out on for sexual satisfaction.  \n\nThere is no need to shame women and men who are simply being realistic about this lifestyle.  That is why you are often downvoted — because you’re not adding any value by degrading the entire community you’re participating in.  You should be thankful for the SBs that don’t demand exclusivity because despite what you tell yourself, what you are offering is not an exclusive relationship. ",
                                            "author": "alexeySB",
                                            "id": "e9tiy67",
                                            "parent_id": "t1_e9tgyou",
                                            "score": 12,
                                            "created_utc": 1542382958.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
                                                    "author": "GSSD",
                                                    "id": "e9tkudo",
                                                    "parent_id": "t1_e9tiy67",
                                                    "score": -2,
                                                    "created_utc": 1542384513.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                                                            "author": "alexeySB",
                                                            "id": "e9tlur4",
                                                            "parent_id": "t1_e9tkudo",
                                                            "score": 7,
                                                            "created_utc": 1542385338.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                                                                    "author": "GSSD",
                                                                    "id": "e9u2po4",
                                                                    "parent_id": "t1_e9tlur4",
                                                                    "score": -1,
                                                                    "created_utc": 1542397736.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                                                                    "author": "lcsugar",
                                                                    "id": "e9wgic1",
                                                                    "parent_id": "t1_e9tlur4",
                                                                    "score": 0,
                                                                    "created_utc": 1542480859.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                                                            "author": "alexeySB",
                                                                            "id": "e9wlkyv",
                                                                            "parent_id": "t1_e9wgic1",
                                                                            "score": 5,
                                                                            "created_utc": 1542483972.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                                                                    "author": "lcsugar",
                                                                                    "id": "e9wlwrb",
                                                                                    "parent_id": "t1_e9wlkyv",
                                                                                    "score": 0,
                                                                                    "created_utc": 1542484162.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                                                            "author": "alexeySB",
                                                                                            "id": "e9wy7nj",
                                                                                            "parent_id": "t1_e9wlwrb",
                                                                                            "score": 2,
                                                                                            "created_utc": 1542491817.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">IRL I think there are plenty of girls who do not have raging hormones and twitchy clits but need a little help in life and do not need to ride the cock carousel. \n\nYou could have done without this sentence.  Shaming others for their views and actions is not welcome here. ",
                            "author": "texassugarbabe",
                            "id": "e9uan3z",
                            "parent_id": "t1_e9rzg37",
                            "score": 7,
                            "created_utc": 1542403796.0,
                            "replies": [
                                {
                                    "body": "True that-thanks. I took it out.",
                                    "author": "GSSD",
                                    "id": "e9ubjhe",
                                    "parent_id": "t1_e9uan3z",
                                    "score": -1,
                                    "created_utc": 1542404491.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know if you read the comments but, I told him that after some time I was willing to revisit the topic. After we build a report and exclusivity. I get tested every few months so I have nothing to hide- although I feel like it’s a red flag to not even consider the thought of condoms during the first encounters. Appreciate the advice either way! ",
            "author": "throwaway090789",
            "id": "e9s3jx1",
            "parent_id": "t1_e9s2krk",
            "score": 7,
            "created_utc": 1542323604.0,
            "replies": [
                {
                    "body": "If this guy thinks the only difference between SB's and escorts is not having to use condoms, he's probably not someone you should be taking advice from..! Lol don't put anything about condoms in your profile, that's shit advice.",
                    "author": "yourgirlfriday99",
                    "id": "e9srmgl",
                    "parent_id": "t1_e9s3jx1",
                    "score": 12,
                    "created_utc": 1542345403.0,
                    "replies": []
                },
                {
                    "body": "This is perfectly reasonable for both sides. As a guy I think\n\n* The SB won't enjoy sex anyway if shes worrying about STD's\n* SD has to be fixed, period.\n* SD AND SB should be exclusive, needs to show trust.\n* Tests every so often, obviously\n* SB should be the one to decide, honestly, when to go no condom, without taking too much time. Maybe around 4 months perhaps?\n* If SB feels comfortable enough to go no condom, SD should absolutely increase sugar as well, so both parties are happy\n\nThats about it?",
                    "author": null,
                    "id": "e9sy6ww",
                    "parent_id": "t1_e9s3jx1",
                    "score": 1,
                    "created_utc": 1542355156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">If you require condoms, there really isn't any point to giving you an allowance and all that vs just picking up someone hourly off E, AL, YBP, etc.\n\nAre you kidding me? SBs are not the condomless version of an escort. And how about you write it in your profile if it’s that important to you? Really gross comment as clearly all you’re looking for is sex and nothing more.  There is so much wrong with your comment I can’t even take it ",
            "author": "alexeySB",
            "id": "e9tftik",
            "parent_id": "t1_e9s2krk",
            "score": 2,
            "created_utc": 1542380222.0,
            "replies": []
        },
        {
            "body": "what do all these letters mean?  E, AL, YBP",
            "author": "lcsugar",
            "id": "e9wfuco",
            "parent_id": "t1_e9s2krk",
            "score": 1,
            "created_utc": 1542480416.0,
            "replies": []
        },
        {
            "body": "If you’ve been together for months exclusively, there is trust, and you are actually giving a monthly allowance, then I could see transitioning into that. \n\nBut I’ve encountered plenty of men wanting to do this from the first encounter. Which is ridiculous, because likely they’re still talking to other woman, and I other men, and of course no trust has been built. ",
            "author": null,
            "id": "eakv3sw",
            "parent_id": "t1_e9s2krk",
            "score": 1,
            "created_utc": 1543336269.0,
            "replies": []
        },
        {
            "body": "You mean you don't carry the equipment to do a quick spur-of-the-moment sperm count before doing the deed? Amateur. \n\n🙃",
            "author": "Zephyrus0101",
            "id": "e9raxb1",
            "parent_id": "t1_e9rahbe",
            "score": 18,
            "created_utc": 1542302517.0,
            "replies": []
        },
        {
            "body": "It's possible to have a completely anonymous SA account, but a good cyber sleuth could track them down.  Unless the SD is using a VPN, anonymous email, re-loadable visa, & fake photos, then a subpoena by a licensed 1st year attorney will walk through 99% of the issues.\n\nQuite a few of us SD's are snipped & trust me the last thing I want to do is knock up a SB...\n\nThe STI's are the killer currently, wrap it until you are both tested..  ",
            "author": "mollyflowers",
            "id": "e9rkw8o",
            "parent_id": "t1_e9rahbe",
            "score": 7,
            "created_utc": 1542309962.0,
            "replies": []
        },
        {
            "body": "Dude was probably tested within the last year but who knows how many partners he has had since the test.  Best to wrap it up until their is trust & exclusivity as in a Sugar Girlfriend...\n\n",
            "author": "mollyflowers",
            "id": "e9rnsts",
            "parent_id": "t1_e9rbb4n",
            "score": 11,
            "created_utc": 1542312007.0,
            "replies": [
                {
                    "body": "Or what STIs he carries but are dormant. \n\nYou know what, actually how about: if the girl is uncomfortable, don’t guilt her — who wants to force someone into not enjoying something? He should go find someone else (riskier, less safe, and probably a wild card in other areas too...) IMHO. ",
                    "author": "ilovecookies86",
                    "id": "e9rujj3",
                    "parent_id": "t1_e9rnsts",
                    "score": 10,
                    "created_utc": 1542316860.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Had a vasectomy 12 years ago and never push to go without. ",
            "author": "want2cokc",
            "id": "e9rgrfa",
            "parent_id": "t1_e9rfxv2",
            "score": 6,
            "created_utc": 1542306954.0,
            "replies": []
        },
        {
            "body": "Really depends.  If you're \"girthy\" the Sagami may be too tight.  I like the skyn Elites and Okamoto zero four zero.  The Elites have a better lube and are longer.  The Okamoto feel better but get snug if I'm really aroused and I wish it was a little longer.\n\nHonestly get on Amazon and order small packs of all of them, it's worth the effort of finding one you're happier with.",
            "author": null,
            "id": "e9rsaz1",
            "parent_id": "t1_e9rg8cv",
            "score": 4,
            "created_utc": 1542315245.0,
            "replies": []
        },
        {
            "body": "Agree with the point on it depends on you.\n\nNOTE: the BIGGEST difference between these three and a normal condom isn't the fit, it's the **material**. Latex SUCKS. I can't underscore this enough. It's a terrible material for condoms; I've written about this on the forum before.\n\nI hate latex condoms but actually prefer Skyn Large to bareback, because of the ease of cleanup before the second or third rounds. Unfortunately, agree that the Japanese brands are a little tight and Skyn doesn't make an Elite in a larger size :-(\n\n&#x200B;",
            "author": "curiousgenerous",
            "id": "e9rt4ql",
            "parent_id": "t1_e9rg8cv",
            "score": 8,
            "created_utc": 1542315809.0,
            "replies": [
                {
                    "body": "Any suggestions for a large size? He usually uses the gold trogana and even those are tight",
                    "author": "beanlvr",
                    "id": "e9sldaf",
                    "parent_id": "t1_e9rt4ql",
                    "score": 1,
                    "created_utc": 1542339015.0,
                    "replies": [
                        {
                            "body": "Skyn Large is I think the best that are readily available. They are physically smaller than Trojan Magnums, but they are made from polyisoprene which stretches and fits differently than latex. They are *definitely* worth a try.",
                            "author": "curiousgenerous",
                            "id": "e9tzack",
                            "parent_id": "t1_e9sldaf",
                            "score": 1,
                            "created_utc": 1542395296.0,
                            "replies": [
                                {
                                    "body": "Do you know if you can buy them in stores? ",
                                    "author": "beanlvr",
                                    "id": "e9tzqnw",
                                    "parent_id": "t1_e9tzack",
                                    "score": 1,
                                    "created_utc": 1542395632.0,
                                    "replies": [
                                        {
                                            "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
                                            "author": "curiousgenerous",
                                            "id": "e9uhlho",
                                            "parent_id": "t1_e9tzqnw",
                                            "score": 1,
                                            "created_utc": 1542409183.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you!!!",
                                                    "author": "beanlvr",
                                                    "id": "e9uhxed",
                                                    "parent_id": "t1_e9uhlho",
                                                    "score": 1,
                                                    "created_utc": 1542409446.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Skyns are consistently touted as the best. I prefer Trojan Supra non-latex.",
            "author": "girlz_are_42",
            "id": "e9rue9t",
            "parent_id": "t1_e9rg8cv",
            "score": 4,
            "created_utc": 1542316743.0,
            "replies": []
        },
        {
            "body": "Like already proposed, you have to try it for yourself. There are a couple of condom online shops that sell sample packs of different ultrathin brands.\n\n&#x200B;\n\nSo it really is personal, but the Skyn Elite has been the best overall for me. \n\n&#x200B;\n\nThe Sagami condom is fascinating but the problem is that it feels so real that I was constantly checking if I am still wearing it.",
            "author": "tokenlover99",
            "id": "e9ruvm0",
            "parent_id": "t1_e9rg8cv",
            "score": 2,
            "created_utc": 1542317119.0,
            "replies": []
        },
        {
            "body": "I've only used SKYN Elite & it's much better than a trojan but bare back is still better...  \n\nNo idea on the Kimono & Sagami..",
            "author": "mollyflowers",
            "id": "e9rkkj4",
            "parent_id": "t1_e9rg8cv",
            "score": -1,
            "created_utc": 1542309721.0,
            "replies": []
        },
        {
            "body": "Only pros use condoms! /s",
            "author": "milliondollarkitty",
            "id": "e9sckwd",
            "parent_id": "t1_e9rmi5o",
            "score": 7,
            "created_utc": 1542330772.0,
            "replies": []
        },
        {
            "body": "Pffft! He's the one who should feel shame. Water off the back of a duck. Don't worry about it--he has successfully removed himself from further consideration.",
            "author": "OlderSD",
            "id": "e9rq63l",
            "parent_id": "t1_e9rmi5o",
            "score": 3,
            "created_utc": 1542313719.0,
            "replies": []
        },
        {
            "body": "I can express my opinion however I want this is Reddit, why the shaming about me expressing my opinion? Stop it.",
            "author": "BellaBaby19",
            "id": "e9sggeh",
            "parent_id": "t1_e9sc6rp",
            "score": 5,
            "created_utc": 1542334394.0,
            "replies": [
                {
                    "body": ">If someone told me they could show me their \"STD\" tests I would laugh. \n\nHow is that NOT shaming men that don't agree with you?",
                    "author": null,
                    "id": "e9shujy",
                    "parent_id": "t1_e9sggeh",
                    "score": -6,
                    "created_utc": 1542335681.0,
                    "replies": [
                        {
                            "body": "Ok then I'm shaming men. I don't care if I am or not. ",
                            "author": "BellaBaby19",
                            "id": "e9spg5r",
                            "parent_id": "t1_e9shujy",
                            "score": 5,
                            "created_utc": 1542342893.0,
                            "replies": []
                        },
                        {
                            "body": "It’s not shaming men that don’t agree with her! I’m sorry but you’re wrong.  She’s saying the idea that “an STD test” completely mitigates all risk is laughable.  You yourself agree that it is increasing your risk to have unprotected sex.. if you’re engaging in risky behavior you’re literally acting less responsibly.  \n\nI have no problem with a guy who owns that his behavior is risky as fuck, he could catch an STD at any moment, yet still prefers to go raw.  The problem is with the attempted “negotiation” and convincing these guys do.  They try to minimize concerns... but the concerns are very valid! \n\nI would absolutely and have laughed in someone’s face who attempted to tell me they were STD free and snipped in attempts to have unprotected sex with me.  I’m not shaming them for their desires I’m laughing at how illogical their responses are.  \n\nSo go ahead... if you want to propose no condom sex to me (which will always get a no) I will not shame your desire for the experience of raw sex... but if you start to  insinuate my concerns are irrelevant, or that it’s perfectly safe and fine.... I will totally judge that.  99% of the men in the bowl who want raw sex would never stop to ask a SB for an STD test.  If (and that’s a big if) they don’t have an STD yet, it’s only a matter of time. ",
                            "author": "alexeySB",
                            "id": "e9tep91",
                            "parent_id": "t1_e9shujy",
                            "score": 6,
                            "created_utc": 1542379194.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely,  only initial STI testing and then follow up every 3-6 months. Requesting to go raw to a new partner just trusting their word that they are clean won't fly. Safety first. ",
            "author": null,
            "id": "e9rnoyw",
            "parent_id": "t1_e9rnfwz",
            "score": 5,
            "created_utc": 1542311933.0,
            "replies": []
        },
        {
            "body": "Bold of you to assume I can afford insurance. Then again,  it's $50 just across the border so it's not a big deal.\n\n\n\n",
            "author": null,
            "id": "e9rlyww",
            "parent_id": "t1_e9rlqwi",
            "score": 3,
            "created_utc": 1542310717.0,
            "replies": []
        },
        {
            "body": "Yes, I totally don't blame you. He sounds like a dik",
            "author": "GSSD",
            "id": "e9riwqj",
            "parent_id": "t1_e9rczar",
            "score": 4,
            "created_utc": 1542308488.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e9rzg37",
            "parent_id": "t1_e9rutpz",
            "score": 2,
            "created_utc": 1542320571.0,
            "replies": [
                {
                    "body": "Your posts are disgusting and judgmental.  You attempt to tear women and men down in this forum when in reality, you are a married man! The ultimate hypocrite.  I have one SD and don’t really have the time or energy to be seeing other people, so by no means am I riding the “cock carousel” but I’m realistic enough to realize that exclusivity is not a realistic concept when you’re dealing with a man who ends your date to go climb into bed with his wife. \n\nAnd how dare you with your laughable comment about twitchy clits and hormones... what exactly brought you to an alternative lifestyle where you can have unprotected sex with young girls behind your wife’s back? My guess it would be raging hormones and a twitching something\n\nDon’t throw stones from glass houses, dude",
                    "author": "alexeySB",
                    "id": "e9tfk33",
                    "parent_id": "t1_e9rzg37",
                    "score": 12,
                    "created_utc": 1542379990.0,
                    "replies": [
                        {
                            "body": "Point taken alexey. It seems like I hit a nerve though. \n\nBTW, is your SD married? If so \"open \" relationship I'm sure. ",
                            "author": "GSSD",
                            "id": "e9tgyou",
                            "parent_id": "t1_e9tfk33",
                            "score": -1,
                            "created_utc": 1542381251.0,
                            "replies": [
                                {
                                    "body": "It’s not that you hit a nerve, it’s that I keep seeing your comments over and over again pointing the blame on others when it seems like you may hold deep seated shame revolving monogamy or lack thereof.  You shame people for their honest views and yet your stance is built on a hypocritical and unhealthy view of exclusivity (since you are a married man sleeping with someone other than your wife). \n\nAnd yes, my SD is married.  He does not have another SB and I am not seeing anyone else but it is absolutely an open relationship as he has no intention to leave his wife.  He has even asked me about my love life outside of the SR.  He is in his 50s so he’s by no means a millennial or new aged... he’s just realistic!  Not having exclusivity does not always equate to a cock carousel.  And even if it did for someone, you really have no room to judge!  Perhaps if you had been more sexually liberated and honest about your sexual desires earlier in life you would not have ended up legally bound to a significant other that you felt like you needed to secretly step out on for sexual satisfaction.  \n\nThere is no need to shame women and men who are simply being realistic about this lifestyle.  That is why you are often downvoted — because you’re not adding any value by degrading the entire community you’re participating in.  You should be thankful for the SBs that don’t demand exclusivity because despite what you tell yourself, what you are offering is not an exclusive relationship. ",
                                    "author": "alexeySB",
                                    "id": "e9tiy67",
                                    "parent_id": "t1_e9tgyou",
                                    "score": 12,
                                    "created_utc": 1542382958.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
                                            "author": "GSSD",
                                            "id": "e9tkudo",
                                            "parent_id": "t1_e9tiy67",
                                            "score": -2,
                                            "created_utc": 1542384513.0,
                                            "replies": [
                                                {
                                                    "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                                                    "author": "alexeySB",
                                                    "id": "e9tlur4",
                                                    "parent_id": "t1_e9tkudo",
                                                    "score": 7,
                                                    "created_utc": 1542385338.0,
                                                    "replies": [
                                                        {
                                                            "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                                                            "author": "GSSD",
                                                            "id": "e9u2po4",
                                                            "parent_id": "t1_e9tlur4",
                                                            "score": -1,
                                                            "created_utc": 1542397736.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                                                            "author": "lcsugar",
                                                            "id": "e9wgic1",
                                                            "parent_id": "t1_e9tlur4",
                                                            "score": 0,
                                                            "created_utc": 1542480859.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                                                    "author": "alexeySB",
                                                                    "id": "e9wlkyv",
                                                                    "parent_id": "t1_e9wgic1",
                                                                    "score": 5,
                                                                    "created_utc": 1542483972.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                                                            "author": "lcsugar",
                                                                            "id": "e9wlwrb",
                                                                            "parent_id": "t1_e9wlkyv",
                                                                            "score": 0,
                                                                            "created_utc": 1542484162.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                                                    "author": "alexeySB",
                                                                                    "id": "e9wy7nj",
                                                                                    "parent_id": "t1_e9wlwrb",
                                                                                    "score": 2,
                                                                                    "created_utc": 1542491817.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">IRL I think there are plenty of girls who do not have raging hormones and twitchy clits but need a little help in life and do not need to ride the cock carousel. \n\nYou could have done without this sentence.  Shaming others for their views and actions is not welcome here. ",
                    "author": "texassugarbabe",
                    "id": "e9uan3z",
                    "parent_id": "t1_e9rzg37",
                    "score": 7,
                    "created_utc": 1542403796.0,
                    "replies": [
                        {
                            "body": "True that-thanks. I took it out.",
                            "author": "GSSD",
                            "id": "e9ubjhe",
                            "parent_id": "t1_e9uan3z",
                            "score": -1,
                            "created_utc": 1542404491.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If this guy thinks the only difference between SB's and escorts is not having to use condoms, he's probably not someone you should be taking advice from..! Lol don't put anything about condoms in your profile, that's shit advice.",
            "author": "yourgirlfriday99",
            "id": "e9srmgl",
            "parent_id": "t1_e9s3jx1",
            "score": 12,
            "created_utc": 1542345403.0,
            "replies": []
        },
        {
            "body": "This is perfectly reasonable for both sides. As a guy I think\n\n* The SB won't enjoy sex anyway if shes worrying about STD's\n* SD has to be fixed, period.\n* SD AND SB should be exclusive, needs to show trust.\n* Tests every so often, obviously\n* SB should be the one to decide, honestly, when to go no condom, without taking too much time. Maybe around 4 months perhaps?\n* If SB feels comfortable enough to go no condom, SD should absolutely increase sugar as well, so both parties are happy\n\nThats about it?",
            "author": null,
            "id": "e9sy6ww",
            "parent_id": "t1_e9s3jx1",
            "score": 1,
            "created_utc": 1542355156.0,
            "replies": []
        },
        {
            "body": "Or what STIs he carries but are dormant. \n\nYou know what, actually how about: if the girl is uncomfortable, don’t guilt her — who wants to force someone into not enjoying something? He should go find someone else (riskier, less safe, and probably a wild card in other areas too...) IMHO. ",
            "author": "ilovecookies86",
            "id": "e9rujj3",
            "parent_id": "t1_e9rnsts",
            "score": 10,
            "created_utc": 1542316860.0,
            "replies": []
        },
        {
            "body": "Any suggestions for a large size? He usually uses the gold trogana and even those are tight",
            "author": "beanlvr",
            "id": "e9sldaf",
            "parent_id": "t1_e9rt4ql",
            "score": 1,
            "created_utc": 1542339015.0,
            "replies": [
                {
                    "body": "Skyn Large is I think the best that are readily available. They are physically smaller than Trojan Magnums, but they are made from polyisoprene which stretches and fits differently than latex. They are *definitely* worth a try.",
                    "author": "curiousgenerous",
                    "id": "e9tzack",
                    "parent_id": "t1_e9sldaf",
                    "score": 1,
                    "created_utc": 1542395296.0,
                    "replies": [
                        {
                            "body": "Do you know if you can buy them in stores? ",
                            "author": "beanlvr",
                            "id": "e9tzqnw",
                            "parent_id": "t1_e9tzack",
                            "score": 1,
                            "created_utc": 1542395632.0,
                            "replies": [
                                {
                                    "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
                                    "author": "curiousgenerous",
                                    "id": "e9uhlho",
                                    "parent_id": "t1_e9tzqnw",
                                    "score": 1,
                                    "created_utc": 1542409183.0,
                                    "replies": [
                                        {
                                            "body": "Thank you!!!",
                                            "author": "beanlvr",
                                            "id": "e9uhxed",
                                            "parent_id": "t1_e9uhlho",
                                            "score": 1,
                                            "created_utc": 1542409446.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">If someone told me they could show me their \"STD\" tests I would laugh. \n\nHow is that NOT shaming men that don't agree with you?",
            "author": null,
            "id": "e9shujy",
            "parent_id": "t1_e9sggeh",
            "score": -6,
            "created_utc": 1542335681.0,
            "replies": [
                {
                    "body": "Ok then I'm shaming men. I don't care if I am or not. ",
                    "author": "BellaBaby19",
                    "id": "e9spg5r",
                    "parent_id": "t1_e9shujy",
                    "score": 5,
                    "created_utc": 1542342893.0,
                    "replies": []
                },
                {
                    "body": "It’s not shaming men that don’t agree with her! I’m sorry but you’re wrong.  She’s saying the idea that “an STD test” completely mitigates all risk is laughable.  You yourself agree that it is increasing your risk to have unprotected sex.. if you’re engaging in risky behavior you’re literally acting less responsibly.  \n\nI have no problem with a guy who owns that his behavior is risky as fuck, he could catch an STD at any moment, yet still prefers to go raw.  The problem is with the attempted “negotiation” and convincing these guys do.  They try to minimize concerns... but the concerns are very valid! \n\nI would absolutely and have laughed in someone’s face who attempted to tell me they were STD free and snipped in attempts to have unprotected sex with me.  I’m not shaming them for their desires I’m laughing at how illogical their responses are.  \n\nSo go ahead... if you want to propose no condom sex to me (which will always get a no) I will not shame your desire for the experience of raw sex... but if you start to  insinuate my concerns are irrelevant, or that it’s perfectly safe and fine.... I will totally judge that.  99% of the men in the bowl who want raw sex would never stop to ask a SB for an STD test.  If (and that’s a big if) they don’t have an STD yet, it’s only a matter of time. ",
                    "author": "alexeySB",
                    "id": "e9tep91",
                    "parent_id": "t1_e9shujy",
                    "score": 6,
                    "created_utc": 1542379194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your posts are disgusting and judgmental.  You attempt to tear women and men down in this forum when in reality, you are a married man! The ultimate hypocrite.  I have one SD and don’t really have the time or energy to be seeing other people, so by no means am I riding the “cock carousel” but I’m realistic enough to realize that exclusivity is not a realistic concept when you’re dealing with a man who ends your date to go climb into bed with his wife. \n\nAnd how dare you with your laughable comment about twitchy clits and hormones... what exactly brought you to an alternative lifestyle where you can have unprotected sex with young girls behind your wife’s back? My guess it would be raging hormones and a twitching something\n\nDon’t throw stones from glass houses, dude",
            "author": "alexeySB",
            "id": "e9tfk33",
            "parent_id": "t1_e9rzg37",
            "score": 12,
            "created_utc": 1542379990.0,
            "replies": [
                {
                    "body": "Point taken alexey. It seems like I hit a nerve though. \n\nBTW, is your SD married? If so \"open \" relationship I'm sure. ",
                    "author": "GSSD",
                    "id": "e9tgyou",
                    "parent_id": "t1_e9tfk33",
                    "score": -1,
                    "created_utc": 1542381251.0,
                    "replies": [
                        {
                            "body": "It’s not that you hit a nerve, it’s that I keep seeing your comments over and over again pointing the blame on others when it seems like you may hold deep seated shame revolving monogamy or lack thereof.  You shame people for their honest views and yet your stance is built on a hypocritical and unhealthy view of exclusivity (since you are a married man sleeping with someone other than your wife). \n\nAnd yes, my SD is married.  He does not have another SB and I am not seeing anyone else but it is absolutely an open relationship as he has no intention to leave his wife.  He has even asked me about my love life outside of the SR.  He is in his 50s so he’s by no means a millennial or new aged... he’s just realistic!  Not having exclusivity does not always equate to a cock carousel.  And even if it did for someone, you really have no room to judge!  Perhaps if you had been more sexually liberated and honest about your sexual desires earlier in life you would not have ended up legally bound to a significant other that you felt like you needed to secretly step out on for sexual satisfaction.  \n\nThere is no need to shame women and men who are simply being realistic about this lifestyle.  That is why you are often downvoted — because you’re not adding any value by degrading the entire community you’re participating in.  You should be thankful for the SBs that don’t demand exclusivity because despite what you tell yourself, what you are offering is not an exclusive relationship. ",
                            "author": "alexeySB",
                            "id": "e9tiy67",
                            "parent_id": "t1_e9tgyou",
                            "score": 12,
                            "created_utc": 1542382958.0,
                            "replies": [
                                {
                                    "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
                                    "author": "GSSD",
                                    "id": "e9tkudo",
                                    "parent_id": "t1_e9tiy67",
                                    "score": -2,
                                    "created_utc": 1542384513.0,
                                    "replies": [
                                        {
                                            "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                                            "author": "alexeySB",
                                            "id": "e9tlur4",
                                            "parent_id": "t1_e9tkudo",
                                            "score": 7,
                                            "created_utc": 1542385338.0,
                                            "replies": [
                                                {
                                                    "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                                                    "author": "GSSD",
                                                    "id": "e9u2po4",
                                                    "parent_id": "t1_e9tlur4",
                                                    "score": -1,
                                                    "created_utc": 1542397736.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                                                    "author": "lcsugar",
                                                    "id": "e9wgic1",
                                                    "parent_id": "t1_e9tlur4",
                                                    "score": 0,
                                                    "created_utc": 1542480859.0,
                                                    "replies": [
                                                        {
                                                            "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                                            "author": "alexeySB",
                                                            "id": "e9wlkyv",
                                                            "parent_id": "t1_e9wgic1",
                                                            "score": 5,
                                                            "created_utc": 1542483972.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                                                    "author": "lcsugar",
                                                                    "id": "e9wlwrb",
                                                                    "parent_id": "t1_e9wlkyv",
                                                                    "score": 0,
                                                                    "created_utc": 1542484162.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                                            "author": "alexeySB",
                                                                            "id": "e9wy7nj",
                                                                            "parent_id": "t1_e9wlwrb",
                                                                            "score": 2,
                                                                            "created_utc": 1542491817.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">IRL I think there are plenty of girls who do not have raging hormones and twitchy clits but need a little help in life and do not need to ride the cock carousel. \n\nYou could have done without this sentence.  Shaming others for their views and actions is not welcome here. ",
            "author": "texassugarbabe",
            "id": "e9uan3z",
            "parent_id": "t1_e9rzg37",
            "score": 7,
            "created_utc": 1542403796.0,
            "replies": [
                {
                    "body": "True that-thanks. I took it out.",
                    "author": "GSSD",
                    "id": "e9ubjhe",
                    "parent_id": "t1_e9uan3z",
                    "score": -1,
                    "created_utc": 1542404491.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Skyn Large is I think the best that are readily available. They are physically smaller than Trojan Magnums, but they are made from polyisoprene which stretches and fits differently than latex. They are *definitely* worth a try.",
            "author": "curiousgenerous",
            "id": "e9tzack",
            "parent_id": "t1_e9sldaf",
            "score": 1,
            "created_utc": 1542395296.0,
            "replies": [
                {
                    "body": "Do you know if you can buy them in stores? ",
                    "author": "beanlvr",
                    "id": "e9tzqnw",
                    "parent_id": "t1_e9tzack",
                    "score": 1,
                    "created_utc": 1542395632.0,
                    "replies": [
                        {
                            "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
                            "author": "curiousgenerous",
                            "id": "e9uhlho",
                            "parent_id": "t1_e9tzqnw",
                            "score": 1,
                            "created_utc": 1542409183.0,
                            "replies": [
                                {
                                    "body": "Thank you!!!",
                                    "author": "beanlvr",
                                    "id": "e9uhxed",
                                    "parent_id": "t1_e9uhlho",
                                    "score": 1,
                                    "created_utc": 1542409446.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok then I'm shaming men. I don't care if I am or not. ",
            "author": "BellaBaby19",
            "id": "e9spg5r",
            "parent_id": "t1_e9shujy",
            "score": 5,
            "created_utc": 1542342893.0,
            "replies": []
        },
        {
            "body": "It’s not shaming men that don’t agree with her! I’m sorry but you’re wrong.  She’s saying the idea that “an STD test” completely mitigates all risk is laughable.  You yourself agree that it is increasing your risk to have unprotected sex.. if you’re engaging in risky behavior you’re literally acting less responsibly.  \n\nI have no problem with a guy who owns that his behavior is risky as fuck, he could catch an STD at any moment, yet still prefers to go raw.  The problem is with the attempted “negotiation” and convincing these guys do.  They try to minimize concerns... but the concerns are very valid! \n\nI would absolutely and have laughed in someone’s face who attempted to tell me they were STD free and snipped in attempts to have unprotected sex with me.  I’m not shaming them for their desires I’m laughing at how illogical their responses are.  \n\nSo go ahead... if you want to propose no condom sex to me (which will always get a no) I will not shame your desire for the experience of raw sex... but if you start to  insinuate my concerns are irrelevant, or that it’s perfectly safe and fine.... I will totally judge that.  99% of the men in the bowl who want raw sex would never stop to ask a SB for an STD test.  If (and that’s a big if) they don’t have an STD yet, it’s only a matter of time. ",
            "author": "alexeySB",
            "id": "e9tep91",
            "parent_id": "t1_e9shujy",
            "score": 6,
            "created_utc": 1542379194.0,
            "replies": []
        },
        {
            "body": "Point taken alexey. It seems like I hit a nerve though. \n\nBTW, is your SD married? If so \"open \" relationship I'm sure. ",
            "author": "GSSD",
            "id": "e9tgyou",
            "parent_id": "t1_e9tfk33",
            "score": -1,
            "created_utc": 1542381251.0,
            "replies": [
                {
                    "body": "It’s not that you hit a nerve, it’s that I keep seeing your comments over and over again pointing the blame on others when it seems like you may hold deep seated shame revolving monogamy or lack thereof.  You shame people for their honest views and yet your stance is built on a hypocritical and unhealthy view of exclusivity (since you are a married man sleeping with someone other than your wife). \n\nAnd yes, my SD is married.  He does not have another SB and I am not seeing anyone else but it is absolutely an open relationship as he has no intention to leave his wife.  He has even asked me about my love life outside of the SR.  He is in his 50s so he’s by no means a millennial or new aged... he’s just realistic!  Not having exclusivity does not always equate to a cock carousel.  And even if it did for someone, you really have no room to judge!  Perhaps if you had been more sexually liberated and honest about your sexual desires earlier in life you would not have ended up legally bound to a significant other that you felt like you needed to secretly step out on for sexual satisfaction.  \n\nThere is no need to shame women and men who are simply being realistic about this lifestyle.  That is why you are often downvoted — because you’re not adding any value by degrading the entire community you’re participating in.  You should be thankful for the SBs that don’t demand exclusivity because despite what you tell yourself, what you are offering is not an exclusive relationship. ",
                    "author": "alexeySB",
                    "id": "e9tiy67",
                    "parent_id": "t1_e9tgyou",
                    "score": 12,
                    "created_utc": 1542382958.0,
                    "replies": [
                        {
                            "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
                            "author": "GSSD",
                            "id": "e9tkudo",
                            "parent_id": "t1_e9tiy67",
                            "score": -2,
                            "created_utc": 1542384513.0,
                            "replies": [
                                {
                                    "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                                    "author": "alexeySB",
                                    "id": "e9tlur4",
                                    "parent_id": "t1_e9tkudo",
                                    "score": 7,
                                    "created_utc": 1542385338.0,
                                    "replies": [
                                        {
                                            "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                                            "author": "GSSD",
                                            "id": "e9u2po4",
                                            "parent_id": "t1_e9tlur4",
                                            "score": -1,
                                            "created_utc": 1542397736.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                                            "author": "lcsugar",
                                            "id": "e9wgic1",
                                            "parent_id": "t1_e9tlur4",
                                            "score": 0,
                                            "created_utc": 1542480859.0,
                                            "replies": [
                                                {
                                                    "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                                    "author": "alexeySB",
                                                    "id": "e9wlkyv",
                                                    "parent_id": "t1_e9wgic1",
                                                    "score": 5,
                                                    "created_utc": 1542483972.0,
                                                    "replies": [
                                                        {
                                                            "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                                            "author": "lcsugar",
                                                            "id": "e9wlwrb",
                                                            "parent_id": "t1_e9wlkyv",
                                                            "score": 0,
                                                            "created_utc": 1542484162.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                                    "author": "alexeySB",
                                                                    "id": "e9wy7nj",
                                                                    "parent_id": "t1_e9wlwrb",
                                                                    "score": 2,
                                                                    "created_utc": 1542491817.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "True that-thanks. I took it out.",
            "author": "GSSD",
            "id": "e9ubjhe",
            "parent_id": "t1_e9uan3z",
            "score": -1,
            "created_utc": 1542404491.0,
            "replies": []
        },
        {
            "body": "Do you know if you can buy them in stores? ",
            "author": "beanlvr",
            "id": "e9tzqnw",
            "parent_id": "t1_e9tzack",
            "score": 1,
            "created_utc": 1542395632.0,
            "replies": [
                {
                    "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
                    "author": "curiousgenerous",
                    "id": "e9uhlho",
                    "parent_id": "t1_e9tzqnw",
                    "score": 1,
                    "created_utc": 1542409183.0,
                    "replies": [
                        {
                            "body": "Thank you!!!",
                            "author": "beanlvr",
                            "id": "e9uhxed",
                            "parent_id": "t1_e9uhlho",
                            "score": 1,
                            "created_utc": 1542409446.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not that you hit a nerve, it’s that I keep seeing your comments over and over again pointing the blame on others when it seems like you may hold deep seated shame revolving monogamy or lack thereof.  You shame people for their honest views and yet your stance is built on a hypocritical and unhealthy view of exclusivity (since you are a married man sleeping with someone other than your wife). \n\nAnd yes, my SD is married.  He does not have another SB and I am not seeing anyone else but it is absolutely an open relationship as he has no intention to leave his wife.  He has even asked me about my love life outside of the SR.  He is in his 50s so he’s by no means a millennial or new aged... he’s just realistic!  Not having exclusivity does not always equate to a cock carousel.  And even if it did for someone, you really have no room to judge!  Perhaps if you had been more sexually liberated and honest about your sexual desires earlier in life you would not have ended up legally bound to a significant other that you felt like you needed to secretly step out on for sexual satisfaction.  \n\nThere is no need to shame women and men who are simply being realistic about this lifestyle.  That is why you are often downvoted — because you’re not adding any value by degrading the entire community you’re participating in.  You should be thankful for the SBs that don’t demand exclusivity because despite what you tell yourself, what you are offering is not an exclusive relationship. ",
            "author": "alexeySB",
            "id": "e9tiy67",
            "parent_id": "t1_e9tgyou",
            "score": 12,
            "created_utc": 1542382958.0,
            "replies": [
                {
                    "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
                    "author": "GSSD",
                    "id": "e9tkudo",
                    "parent_id": "t1_e9tiy67",
                    "score": -2,
                    "created_utc": 1542384513.0,
                    "replies": [
                        {
                            "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                            "author": "alexeySB",
                            "id": "e9tlur4",
                            "parent_id": "t1_e9tkudo",
                            "score": 7,
                            "created_utc": 1542385338.0,
                            "replies": [
                                {
                                    "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                                    "author": "GSSD",
                                    "id": "e9u2po4",
                                    "parent_id": "t1_e9tlur4",
                                    "score": -1,
                                    "created_utc": 1542397736.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                                    "author": "lcsugar",
                                    "id": "e9wgic1",
                                    "parent_id": "t1_e9tlur4",
                                    "score": 0,
                                    "created_utc": 1542480859.0,
                                    "replies": [
                                        {
                                            "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                            "author": "alexeySB",
                                            "id": "e9wlkyv",
                                            "parent_id": "t1_e9wgic1",
                                            "score": 5,
                                            "created_utc": 1542483972.0,
                                            "replies": [
                                                {
                                                    "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                                    "author": "lcsugar",
                                                    "id": "e9wlwrb",
                                                    "parent_id": "t1_e9wlkyv",
                                                    "score": 0,
                                                    "created_utc": 1542484162.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                            "author": "alexeySB",
                                                            "id": "e9wy7nj",
                                                            "parent_id": "t1_e9wlwrb",
                                                            "score": 2,
                                                            "created_utc": 1542491817.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! They're sold in most Walgreens (at least in California and NY), that I've visited. Rite-Aid also sells them in some stores, I believe. CVS doesn't, in my experience, neither do a lot of local chains.",
            "author": "curiousgenerous",
            "id": "e9uhlho",
            "parent_id": "t1_e9tzqnw",
            "score": 1,
            "created_utc": 1542409183.0,
            "replies": [
                {
                    "body": "Thank you!!!",
                    "author": "beanlvr",
                    "id": "e9uhxed",
                    "parent_id": "t1_e9uhlho",
                    "score": 1,
                    "created_utc": 1542409446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for your comments!  We are all unique and entitled to our views.  I respect yours.\n\n  Did your SD inform his wife about you? If he told you his marriage is \"open\" how do you know it's true-because he is so honest ?  Many SDs call their marriages open when they are not.  Lying in the bowl-can you imagine?  ",
            "author": "GSSD",
            "id": "e9tkudo",
            "parent_id": "t1_e9tiy67",
            "score": -2,
            "created_utc": 1542384513.0,
            "replies": [
                {
                    "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
                    "author": "alexeySB",
                    "id": "e9tlur4",
                    "parent_id": "t1_e9tkudo",
                    "score": 7,
                    "created_utc": 1542385338.0,
                    "replies": [
                        {
                            "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                            "author": "GSSD",
                            "id": "e9u2po4",
                            "parent_id": "t1_e9tlur4",
                            "score": -1,
                            "created_utc": 1542397736.0,
                            "replies": []
                        },
                        {
                            "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                            "author": "lcsugar",
                            "id": "e9wgic1",
                            "parent_id": "t1_e9tlur4",
                            "score": 0,
                            "created_utc": 1542480859.0,
                            "replies": [
                                {
                                    "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                                    "author": "alexeySB",
                                    "id": "e9wlkyv",
                                    "parent_id": "t1_e9wgic1",
                                    "score": 5,
                                    "created_utc": 1542483972.0,
                                    "replies": [
                                        {
                                            "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                            "author": "lcsugar",
                                            "id": "e9wlwrb",
                                            "parent_id": "t1_e9wlkyv",
                                            "score": 0,
                                            "created_utc": 1542484162.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                                    "author": "alexeySB",
                                                    "id": "e9wy7nj",
                                                    "parent_id": "t1_e9wlwrb",
                                                    "score": 2,
                                                    "created_utc": 1542491817.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!!!",
            "author": "beanlvr",
            "id": "e9uhxed",
            "parent_id": "t1_e9uhlho",
            "score": 1,
            "created_utc": 1542409446.0,
            "replies": []
        },
        {
            "body": "I’m saying that **my** relationship with him is open. Of course he is not honest with his wife.  He is very honest with himself and in application that he is not acting monogamously.  \n\nYou’re missing my point.\n\n99% of married men in the bowl are not in open marriages.... therefore they don’t expect exclusivity because that should be a two way street. He is open with me about the fact that he is married and has no expectation for me to be exclusive because that would not make sense as he is not exclusive with me.  \n\nSo what is your point? He is not exclusive with me nor his wife therefore I should be exclusive to him??? How about just own what it is: you’re stepping out of your marriage with no intention of leaving.  That is not offering an exclusive relationship and again, exclusivity does not go one way\n\nMy point is that even with mine and his “open” relationship status, we are not banging a bunch of other people.  But even as someone who isn’t currently with multiple partners, your comments read as self righteous and delusional.  And I would not enter a SR with a married man who expects exclusivity from me... regardless of if I have intentions of sleeping with someone else.  To me, it comes off as someone who has control issues and likely struggles with guilt about their own actions... both qualities I have no desire to nurture or entertain ",
            "author": "alexeySB",
            "id": "e9tlur4",
            "parent_id": "t1_e9tkudo",
            "score": 7,
            "created_utc": 1542385338.0,
            "replies": [
                {
                    "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
                    "author": "GSSD",
                    "id": "e9u2po4",
                    "parent_id": "t1_e9tlur4",
                    "score": -1,
                    "created_utc": 1542397736.0,
                    "replies": []
                },
                {
                    "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
                    "author": "lcsugar",
                    "id": "e9wgic1",
                    "parent_id": "t1_e9tlur4",
                    "score": 0,
                    "created_utc": 1542480859.0,
                    "replies": [
                        {
                            "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                            "author": "alexeySB",
                            "id": "e9wlkyv",
                            "parent_id": "t1_e9wgic1",
                            "score": 5,
                            "created_utc": 1542483972.0,
                            "replies": [
                                {
                                    "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                                    "author": "lcsugar",
                                    "id": "e9wlwrb",
                                    "parent_id": "t1_e9wlkyv",
                                    "score": 0,
                                    "created_utc": 1542484162.0,
                                    "replies": [
                                        {
                                            "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                            "author": "alexeySB",
                                            "id": "e9wy7nj",
                                            "parent_id": "t1_e9wlwrb",
                                            "score": 2,
                                            "created_utc": 1542491817.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You alexey, are missing my point.   I require exclusivity of my SB.   It is immaterial whether I am intimate with my SO or not . Sugars all have the option to ask for whatever they want . I have no problem finding partners who will accept those parameters. Obviously, I am not a SD you would pick for an arrangement. But you know there are a lot of married SDs who are not sexual with their SO and therefore can offer exclusivity. ",
            "author": "GSSD",
            "id": "e9u2po4",
            "parent_id": "t1_e9tlur4",
            "score": -1,
            "created_utc": 1542397736.0,
            "replies": []
        },
        {
            "body": "Lots of married men do not have sex with their wives.  Exclusivity can specifically refer to sex, which CAN be achieved with a married man.  He is not talking about relationship-exclusivity here.",
            "author": "lcsugar",
            "id": "e9wgic1",
            "parent_id": "t1_e9tlur4",
            "score": 0,
            "created_utc": 1542480859.0,
            "replies": [
                {
                    "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
                    "author": "alexeySB",
                    "id": "e9wlkyv",
                    "parent_id": "t1_e9wgic1",
                    "score": 5,
                    "created_utc": 1542483972.0,
                    "replies": [
                        {
                            "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                            "author": "lcsugar",
                            "id": "e9wlwrb",
                            "parent_id": "t1_e9wlkyv",
                            "score": 0,
                            "created_utc": 1542484162.0,
                            "replies": [
                                {
                                    "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                                    "author": "alexeySB",
                                    "id": "e9wy7nj",
                                    "parent_id": "t1_e9wlwrb",
                                    "score": 2,
                                    "created_utc": 1542491817.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But that is unrealistic.  He has a partner to go home to.  Do you think a 22 year old girl would be able to have a boyfriend to go to dinners with, have that emotional companionship with, without sex involved? That’s why it’s unrealistic.  It doesn’t matter that sex isn’t going on with the wife.  Unless the SB is also married and in a sexless marriage with her husband.  And what happens when wifey starts trying for sex again? (Hot tv series she’s watching gets her going, or maybe she’s suspicious) if it’s not an open marriage I doubt he will have excuses to start turning her down",
            "author": "alexeySB",
            "id": "e9wlkyv",
            "parent_id": "t1_e9wgic1",
            "score": 5,
            "created_utc": 1542483972.0,
            "replies": [
                {
                    "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
                    "author": "lcsugar",
                    "id": "e9wlwrb",
                    "parent_id": "t1_e9wlkyv",
                    "score": 0,
                    "created_utc": 1542484162.0,
                    "replies": [
                        {
                            "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                            "author": "alexeySB",
                            "id": "e9wy7nj",
                            "parent_id": "t1_e9wlwrb",
                            "score": 2,
                            "created_utc": 1542491817.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is possible you don't understand the dynamics of a dead bedroom so it is impossible to explain it to you.  A sexless marriage doesn't just switch the other way like it is a light bulb.  You seem to think it is possible by referring to hot tv series for example.  An SB is free to find a boyfriend but it is fair to let the SD know so they can end things amicably.",
            "author": "lcsugar",
            "id": "e9wlwrb",
            "parent_id": "t1_e9wlkyv",
            "score": 0,
            "created_utc": 1542484162.0,
            "replies": [
                {
                    "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
                    "author": "alexeySB",
                    "id": "e9wy7nj",
                    "parent_id": "t1_e9wlwrb",
                    "score": 2,
                    "created_utc": 1542491817.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t understand the dynamics of a dead bedroom?  Are you kidding me? Literally my point is that marriage is messy, muddy, life changes and people go through their own phases.  If you think that there is certainty of no future sex with your wife (unless there is medical condition preventing) then you are making a really ignorant assumption. I’m not saying the sex will be often or good, but it’s EXTREMELY possible for sex to happen in marriages that have experienced dry spells.  Often in life there are moments and influences that can influence people to try to spice back up their marriage... my example was something that could strike a chord either a steamy book or tv show, or a friend talking about their own divorce and it scaring them into making more of an effort, or perhaps them being worried about the husband having an affair.  I’m also not stupid and have many friends who are in dead bedroom marriages, grew up with tons of friends whose parents had dead bedrooms and eventually led to divorce.  It’s not black and white, it’s messy and fluid.  \n\nIn many dead bedroom marriages a friendship and emotional companionship is still absolutely prevalent (aka why men want to cheat and don’t have plans to leave their wives). My point is a single person doesn’t have that freedom.  Let’s say you see your SB 4 times a month and the rest of the month you’re sharing dinners, conversation, life events with your SO.  It doesn’t matter that you’re not fucking your SO, your SB is (in the exclusive scenario) having to experience her downtime alone.\n\nAnd as a female that has been with married men in dead bedroom relationships I can PROMISE you things can absolutely change for various reasons... in which case why would a SB expect a SD to tell her “oh by the way my wife must have had an extra glass of wine last night and made the moves on me”.  He’s probably not going to, because he writes it off as okay in his mind (just as he writes off his SB).   And if he does tell her... what are we supposed to just sit around and say “ok maybe it was just one time”.... 🙄\n\nAnd a SB is not free to find a boyfriend in an exclusive relationship.  That’s literally the point of the exclusivity... sex is a part of adult relationships so how would she be free to find a boyfriend ????? This is the year 2018... actively going on dates and getting to know people (usually people are “seeing each other” casually for a month+ before boyfriend title) usually involves sex. I personally don’t have the time or desire to dip my feet in both ponds right now but I’m still aware that it’s a lose lose situation for a SB to be in an “exclusive” relationship with a married man.  She has zero control over what happens between he and his wife (or whether he is honest) and zero ability to even at all dip her toes into casual dating without ending the SR.  It’s a double standard and it’s just not fair or realistic.  \n",
            "author": "alexeySB",
            "id": "e9wy7nj",
            "parent_id": "t1_e9wlwrb",
            "score": 2,
            "created_utc": 1542491817.0,
            "replies": []
        }
    ]
}