{
    "title": "SB/SD: 2020 Online Privacy Guide - Protect. Your. Identity.",
    "post_id": "k61n9w",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k61n9w/sbsd_2020_online_privacy_guide_protect_your/",
    "author": "SD-Casual-Fla",
    "body": "# Foreward:\n\nHello SLF SBs and SDs,\n\nFor the past few months, I've been working on a project for a family member to help cleanup their online presence. I won't get into the details to potentially risk exposing my family member, but I will reference certain sites which have activity pertaining to them along with what I've discovered as techniques for removal and/or cleanup.\n\nI will primarily target SBs for this writeup, but I think there may be some SDs that might benefit from this as well. My target audience is for Americans, as many many other countries have laws already to protect your online identity via the EU's \"[Right to be Forgotten](https://en.wikipedia.org/wiki/Right_to_be_forgotten)\".\n\nI am going to try my best to avoid preaching here or sounding judgmental, because at the end of the day we're all (hopefully) adults on this forum and your life and decisions you make are yours alone. You live as you best see fit, for yourself.\n\nJust please remember, we live in a diverse and hyper-connected society where your rights to personal freedom won't always be respected or considered socially acceptable thanks to a couple thousand years of stigma in various cultural forms.\n\n# Trust is earned.\n\nSo who the hell am I? Just your friendly neighborhood Sugar Daddy.\n\nI've been on and off Seeking for multiple years, and yeah I've even seen SWers in the past as well. I've met some truly wonderful people in the bowl, and had some amazing experiences in my time here.\n\nI've also done some things I regret in my time in the lifestyle and made some shitty choices. I'm human. I'm flawed. I can't make amends for everything I regret, but I can try to atone and help others out.\n\nI've thankfully never crossed the line into the being \"outed\" to the public. I suppose I'm also not that interesting, so maybe that helps a bit too? :)\n\nMy career is in Tech (that's all you're gonna get out of me ;>) and a couple decades dabbling in ITSEC.\n\n# How'd we get here? A cautionary tale.\n\nSo it's 2020, and the world is melting down. Maybe you lost your job, have no emergency savings or family support, and you're not sure how you can make rent this month. Maybe you live outside of your means. It doesn't really matter how you got here, but you're in dire financial straits and are trying to exhaust all of your options to get your life back on track.\n\nMaybe you've seen your best friend's homegirl traveling to far off and extravagant vacations, or showcasing the luxurious material things you desire on their social media. You ask yourself, \"What gives? Two months ago she was a broke college student just like me.\"\n\nYou DM her and she tells you about her success on OnlyFans. You do your homework and take the plunge. You create your account, work hard to build an online presence and fanbase, and eventually you start making money, real money. You're working hard to build your fanbase and hustling to make everyone happy and continue subscribing to you...then things start to unravel.\n\nMaybe some asshole doxxes you (leaks your government name and/or work location, home address, etc.).\n\nMaybe some asshole re-shares your content on another site and due to the nature of things it continuously gets re-shared again, and again and again.\n\nMaybe some important family member discovers what you've been up to and disowns you.\n\nMaybe a prospective employer skips your otherwise qualified resume because they spent two minutes in a Google search and they're able to find your entire library of highly personalized and often stigmatized online activity and they ultimately only care about how it would affect their company's image.\n\nIt doesn't really matter how you got here...but either way, the cat's out the bag...\n\nYour worst day or decisions you regret shouldn't be something you have to re-live forever. So how the fuck do we fix this mess?\n\n*Read below, and I'll try to help you.*\n\n# Psychology of Porn/Adult Content Production and Consumers\n\nSo if there's one thing I've learned in the past couple months, its that porn actors or anyone in a public SW-adjacent lifestyle tend to have this ratcheting-up effect with their work. Once your \"fans\" have seen you do one trick, they might want to see another of something more obscene, or extreme.\n\nLike a heroin addict, they're chasing the high of their first time or perhaps some niche/extreme fetish.\n\nUnfortunately, once you've given them one thing they tend to want more and will push you to the limits of your boundaries and sense of self worth.\n\nMaybe they want your nudes at first, but then they want a video of you masturbating, or a sex tape of you, or a \"cashmeet\", or to prostitute you.\n\nYou are not a human to these \"fans\", but instead a fantasy or something to be objectified. Maybe it's fun because you're in control of the situation...until suddenly you are not.\n\n# Should one (bad) socially stigmatized decision haunt you forever?\n\nHere in the United States, particularly this year, the idea of \"cancel culture\" has run amuck. We've seen famous celebrities taken down for insensitive posts written years ago, or otherwise random private citizens lose their careers, social status or even family due to their worst possible day in life being on repeat for the world again, and again and again.\n\nUntil we have some real online privacy laws in this country **with teeth**, the decisions we make can and will likely follow us for a very long time unless we're smart about what we put out there and how we manage things.\n\n*So let's get smarter, eh?*\n\n**OpSec (Operational Security) Guide**\n\nI'm sure the forum already has something for this, but I'm going to just share some basic talking points to make sure I've said this. Will add more here if there's any additional interest in the \"before things get bad\"/opsec part of my spiel.\n\n1. **Always use and share fake number that you own.** Google Voice is my free favorite here. Reverse phone number searches are incredibly easy, and you might be surprised how much information you can find about yourself on the web just by doing a simple phone number search (pro tip: don't forget to include dashes (\"-\") as these change how search engines treat strings versus numbers.\n2. **Use an alias.** Don't give anyone your real name until you've established some real and tangible trust. Nobody has the right to your name, and much like a phone number your name (especially if unique) can reveal a lot of information about you, to the world.\n3. **Don't share your address/Meet in public first.** This obviously won't apply to everything related to online presence, but nobody should know where you live. This is your first line of defense and your home should be your sanctuary. If you ever get your home privacy compromised, there are several legal routes you can take to fix this.\n4. **Snapchat, Pericospe, etc.** are not actually very private...especially for Android users. Screen recording apps are plentiful, and many are free and easy to use. Additionally, can can simply use another device to record any content which you've otherwise \"sworn them to secrecy\" on.\n5. **Nudes/Sex Tapes.** My general advice here is \"just don't do it\". But, if you do go this route, be aware that they may not love or adore you forever...and jaded lovers can cause problems for your livelihood if things go really bad. You do have some legal protections here though, and ultimately what's to stop someone from recording you in secret? Not much.\n6. **Get your money first. SBs:** Get your money at the start of your first real sugar date (especially if you're new to this lifestyle). **SDs:** Don't fucking send money to people you've never met. If the scammers can't get anymore easy mark SDs, they'll move on. Don't reward bad behavior.\n7. **Hide your face?** I'm not sure what to say here, honestly. Facial recognition software and its use in search engines has already been executed. There are other websites (which I will avoid listing here because, do your own fucking homework if you're trying to reverse search someone's pic) which you can plug in a picture of a person and you might be surprised by just how accurate their search results are should you have the image itself, or other related images of you, publicly available on the web. In the context of sugaring, you will want to know what each person looks like prior to meeting. In the context of putting yourself out there with risque content, I would say avoid leaking your face to the web at all costs because it only takes one person to copy and re-share it to make it un-deleteable.\n\n# Cat's already out the bag - how do I clean this shit up? Tools to help you.\n\n**Pre-work:**\n\n1. Make a list of the content, where its located, and any notes about it which you'll reference later on. Refer back to this often to verify removals.\n2. Use incognito searches to verify content is removed. Certain sites will \"hide\" reported content from your view, but it will very much remain on the public web.\n\n**Google Searches:** Google has this free utility called a [Content Removal Tool](https://search.google.com/search-console/remove-outdated-content). This only works if the content no longer exists on the web, or has been changed to remove certain search keywords. Great for use AFTER contacting a webhost/service to get your content removed and then have it no longer appear in Google's cached results. This tool will remove web links, video and image searches from Google.\n\nTake some time to familiarize yourself with Google's [search operators](https://ahrefs.com/blog/google-advanced-search-operators/). Not only does having strong Google-fu make you a generally bad ass human, but it also is helpful for scouring the web for any potential content you'd rather not exist in a public search, and leveraging Google to search specific websites.\n\nPlease note this will not scrub the web for other popular search engines or sites that do Internet Archival, nor will this remove content from the dark web. But hell, if you're looking for a professional job I highly recommend cleaning up Google as it will be the go-to for most prospective HR or hiring managers.\n\n**Other social media (Reddit, Instagram, TikTok, Snapchat, YouTube, Facebook etc):** Each of these sites has their own privacy/DMCA removal tools. General rule of thumb is to contact the content upload first, then if they refuse to remove or are unresponsive in a timely manner (give them three to five business days), then you can report the content to the social media site.\n\nReddit, YouTube and Facebook are great at removing content when you go the legal DMCA/Privacy removal path. Jury's still out on Insta and TikTok, but I will update this section as my journey continues.\n\nIMHO, Snapchat is a dumpster fire. You have been warned.\n\n**Porn/Adult/Escort Websites:** Ladies and Gentleman, you have some MAJOR rights here in the US. Thanks to the advent of [Revenge Porn laws](https://en.wikipedia.org/wiki/Revenge_porn#United_States) (and countless people having their lives ruined or seriously disrupted thanks to it), any site which hosts explicit adult content has an extremely narrow window to respond to requests for content removal in a timely manner.\n\nMost of the major sites have an easy to locate removal option at the bottom of their website. Or, when in doubt, contact their technical support.\n\nIf you hit a third-party site which may or may not be hosted in the US, things can get much trickier since you'll likely need to track down their webhost and file a complaint with them for removal...this could be a months-long endeavor so... consider yourself warned.\n\n**\"Paid\" Online Reputation Cleanup Services:**\n\nThis stuff generally feels like a scam to me. I had one site quote $3xxx **per website** for cleanup. No service warranty, or any idea if they're actually good at their work. My advice: Skip this shit and DIY it until you've exhausted all options.\n\n# A note about the Dark Web and Private Servers\n\nUnless you know where to look and have infinite time at your disposal, it will be next to impossible to ever truly remove content which you do not consent to having others' control, from the web in its entirety.\n\nHowever, if someone uses this content to harass you or otherwise injure your reputation, we have plenty of laws which will work in your favor (and possibly a sizeable monetary civil result) should you need to take that route.\n\nUnderstand that nothing is ever 'truly gone' from the internet, but it can be made much more difficult to find in general. Also note that there are independent agencies out there which will support you in the removal of such content. It is a difficult, and very whack-a-mole-esque process, but it is definitely doable.\n\n# Closing Words\n\nYou are allowed to make mistakes, it is part of the human experience. Don't beat yourself up too much, or berate yourself too much over a bad decision. Grow beyond this, learn from the experience, and be the better for it.\n\nFuck the haters, the narcissists and the self-interested. You have friends and people in this life who will work to help you. Learn the [difference between](https://www.lifehack.org/articles/communication/11-differences-between-real-friends-and-fake-friends.html) a real friend and a fake friend and you will go far in life.\n\nPractice mindfulness and gratitude. Find meaning in the simple.\n\n*Ohm, baby. Ohm.*\n\n[Watch me](https://www.youtube.com/watch?v=S-YsGdjkIgw) if you find this all overwhelming.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k61n9w/sbsd_2020_online_privacy_guide_protect_your/",
    "score": 124,
    "upvote_ratio": 0.97,
    "created_utc": 1607016304.0,
    "num_comments": 26,
    "links": [
        [
            "https://en.wikipedia.org/wiki/Right_to_be_forgotten",
            "https://search.google.com/search-console/remove-outdated-content",
            "https://ahrefs.com/blog/google-advanced-search-operators/",
            "https://en.wikipedia.org/wiki/Revenge_porn#United_States",
            "https://www.lifehack.org/articles/communication/11-differences-between-real-friends-and-fake-friends.html",
            "https://www.youtube.com/watch?v=S-YsGdjkIgw"
        ]
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "geiechl",
            "parent_id": "t3_k61n9w",
            "score": 34,
            "created_utc": 1607020159.0,
            "replies": [
                {
                    "body": "I had the same experience with a POT a few months ago.  It put me off her as she was so careless so I didn't take it any further.  I did tell her the tips about not using her real number, not using the same photos on SA as she had in her public instagram profile, etc.",
                    "author": "frpaulstone",
                    "id": "geih310",
                    "parent_id": "t1_geiechl",
                    "score": 9,
                    "created_utc": 1607021418.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "geimaep",
                            "parent_id": "t1_geih310",
                            "score": 7,
                            "created_utc": 1607023833.0,
                            "replies": [
                                {
                                    "body": "Sure - but this COMPLETELY removes anonymity. Everyone and anyone who can do reverse imaging will find out who you are, even if you aren't ready to disclose/share that info yet, or even ever meet them in person.   \n\n\nTo some, this doesn't matter. But for me, that is definitely NOT okay.",
                                    "author": "ExExpectations",
                                    "id": "gej9hxf",
                                    "parent_id": "t1_geimaep",
                                    "score": 1,
                                    "created_utc": 1607033401.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gejncyp",
                                            "parent_id": "t1_gej9hxf",
                                            "score": 1,
                                            "created_utc": 1607040871.0,
                                            "replies": [
                                                {
                                                    "body": "A lot of people don’t have the right privacy settings on their FB. Plus it’s constantly changing as well. \n\nA friend or family member “liking” your public profile or cover picture, leaving their own profile to be accessible to the person. They can back trace. These are all bread crumbs for someone savvy like me to track and trace, and I’m not even that good at it.\n\nProtecting one’s privacy makes sense, especially how sugar relationships are often 1-6 months, or at the very best 1-2 years (yes there are outliers but extremely rare). These people come and go from our lives. It’s best to be safer than sorry.",
                                                    "author": "ExExpectations",
                                                    "id": "gejo8k4",
                                                    "parent_id": "t1_gejncyp",
                                                    "score": 3,
                                                    "created_utc": 1607041363.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good advice. \n\nNow let's talk about 2nd phone line apps. I'm having a terrible time finding something that actually works well. \n\nI've tried Burner, and just this morning it wasn't functioning properly - everything went straight to voicemail. \n\nIn the past I've seen major delays in texts and images coming through.\n\nAnyone have alternative services they use reliably?",
            "author": "JohnnySixguns",
            "id": "geib9i0",
            "parent_id": "t3_k61n9w",
            "score": 9,
            "created_utc": 1607018718.0,
            "replies": [
                {
                    "body": "Get a Google Voice number. Or any free anonymous number. And then sign up for \"Signal\" - free, allows video calls, phone calls, texts, disappearing texts and images if you set the parameters, etc etc.",
                    "author": "ExExpectations",
                    "id": "geiiwjv",
                    "parent_id": "t1_geib9i0",
                    "score": 4,
                    "created_utc": 1607022256.0,
                    "replies": []
                },
                {
                    "body": "After building rapport, I switch to telegram. I use a handle on telegram and my telephone number is not shared. \n\nBut has an extra layer of security, I have a separate cell phone, on a separate carrier that I use for all sugaring activities. This ensures my SD social media accounts do not cross pollinate with my real ones. \n\nGoogle Fi, Mint and Republic Wireless are all cheap carriers that to mind.  Google Fi costs me $20 bucks a month and $10 a GB.  I almost never use the data.",
                    "author": "sandman200",
                    "id": "geivdu6",
                    "parent_id": "t1_geib9i0",
                    "score": 5,
                    "created_utc": 1607027345.0,
                    "replies": []
                },
                {
                    "body": "Is Google voice not an option for you? I've never had any issues with calls/pictures/etc.",
                    "author": "MASugarBaby",
                    "id": "geibh2o",
                    "parent_id": "t1_geib9i0",
                    "score": 2,
                    "created_utc": 1607018817.0,
                    "replies": [
                        {
                            "body": "Unfortunately i already linked google voice for work stuff and it won’t let me use a burner number to create a second GV account.",
                            "author": "JohnnySixguns",
                            "id": "geirw1i",
                            "parent_id": "t1_geibh2o",
                            "score": 3,
                            "created_utc": 1607026009.0,
                            "replies": [
                                {
                                    "body": "Google voice isn't the only choice. Lots of other apps and platforms that one can sign up for a free phone number.",
                                    "author": "ExExpectations",
                                    "id": "gej9rj8",
                                    "parent_id": "t1_geirw1i",
                                    "score": 1,
                                    "created_utc": 1607033542.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Replying to /u/MASugarBaby but also wanted you to see this...\n\nGoogle Voice aggressively limits text message frequency for new accounts, so if you have a new GVoice number and are using it to...say...troll Seeking for prospective babies...you will find you'll hit a message rate limit fairly quickly on a new number. I think their \"soft\" block is around 60 messages for the first day the account is activated. (Don't ask how I figured this shit out, lol)\n\nAs an alternative, TextNow is decent (but their mobile app kinda stinks). Do pay for for the premium subscription, as their baked-in advertisements can get hella annoying.\n\nI swear by GVoice, and love how easily it can integrate with an existing phone number. I suppose a burner is also another good route, but good luck explaining that rogue phone to your partner/spouse if you're vanilla dabbling in Sugar.",
                    "author": "SD-Casual-Fla",
                    "id": "geicc3n",
                    "parent_id": "t1_geib9i0",
                    "score": 2,
                    "created_utc": 1607019220.0,
                    "replies": [
                        {
                            "body": ">out the Dark\n\nI use textfree and actually I don't even have the app installed on my phone anymore, I just use the web login to check my messages on there.",
                            "author": "frpaulstone",
                            "id": "geigplb",
                            "parent_id": "t1_geicc3n",
                            "score": 2,
                            "created_utc": 1607021248.0,
                            "replies": [
                                {
                                    "body": "Can you do voice calls with that?  I've got a lot of SB's wanting to at least chat by phone before agreeing to a meet.",
                                    "author": "JohnnySixguns",
                                    "id": "geiuaeo",
                                    "parent_id": "t1_geigplb",
                                    "score": 2,
                                    "created_utc": 1607026912.0,
                                    "replies": [
                                        {
                                            "body": "yes",
                                            "author": "frpaulstone",
                                            "id": "gelbdx8",
                                            "parent_id": "t1_geiuaeo",
                                            "score": 2,
                                            "created_utc": 1607087429.0,
                                            "replies": [
                                                {
                                                    "body": "Using it now with great success.  Thanks.",
                                                    "author": "JohnnySixguns",
                                                    "id": "geshhs0",
                                                    "parent_id": "t1_gelbdx8",
                                                    "score": 1,
                                                    "created_utc": 1607238206.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ve never really had an issue with burner! I wonder why that’s happening with you",
                    "author": "Positive_Orange_8412",
                    "id": "gekkbyq",
                    "parent_id": "t1_geib9i0",
                    "score": 1,
                    "created_utc": 1607063873.0,
                    "replies": []
                },
                {
                    "body": "I've had okay luck with TextNow. Free option has worked fine for me so far.",
                    "author": "helios4fun",
                    "id": "gelrwf2",
                    "parent_id": "t1_geib9i0",
                    "score": 1,
                    "created_utc": 1607096746.0,
                    "replies": [
                        {
                            "body": "Same. You can make calls with it, too. Out of all the apps Telegram is probably my favorite though.",
                            "author": "sexywonton",
                            "id": "gen5s87",
                            "parent_id": "t1_gelrwf2",
                            "score": 1,
                            "created_utc": 1607121203.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is GREAT.\n\nI really think one thing that can not be underscored enough is the issue of on-line nudity.  It is just ridiculously risky.  Remember, screen capture technology works up to and including simply video taping your performance on an app that supposedly makes the content short lived.    Honestly you should ask yourself for every picture you send out in the interweb would I be OK with my mother seeing it.  If not, then take a big breath.  Doesn't mean to be afraid of your shadow but you should be ready to consider consequences.",
            "author": null,
            "id": "geiq2xb",
            "parent_id": "t3_k61n9w",
            "score": 4,
            "created_utc": 1607025321.0,
            "replies": []
        },
        {
            "body": "I’m in software and telephony security. This is great and well written. Thank you.",
            "author": "sandman200",
            "id": "geivq2d",
            "parent_id": "t3_k61n9w",
            "score": 4,
            "created_utc": 1607027479.0,
            "replies": []
        },
        {
            "body": "As an SW, and somebody who works in infosec, this is all pretty sound advice. Trust is earned, privacy is important, and it's always a good idea to safely delineate between parts of your life, like SW/SB/SD stuff, that you might not want other aspects of your life to know about.\n\nWell written, and good practical advice. Nice job, [u/SD-Casual-Fla](https://www.reddit.com/user/SD-Casual-Fla/) 👏",
            "author": "allyafterdark",
            "id": "gejp85p",
            "parent_id": "t3_k61n9w",
            "score": 4,
            "created_utc": 1607041912.0,
            "replies": []
        },
        {
            "body": "Thank you very much for this and for the effort it took and it’s level of detail. I never could foresee at the time this part of my life was going on but I held a US government TS clearance in my early 20s so I learned at a young age a lot of things about privacy classification and access but you can never know too much in my opinion. There are great things about the Internet and the World Wide Web but there are also terrible things and we all have to deal with them as best we can. My complements again.",
            "author": "puckhead4",
            "id": "gejt1mo",
            "parent_id": "t3_k61n9w",
            "score": 3,
            "created_utc": 1607044387.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gej1agd",
            "parent_id": "t3_k61n9w",
            "score": 2,
            "created_utc": 1607029745.0,
            "replies": [
                {
                    "body": "There's more to this story than just her sharing a picture and answering the spoof call...",
                    "author": null,
                    "id": "gejh00o",
                    "parent_id": "t1_gej1agd",
                    "score": 2,
                    "created_utc": 1607037369.0,
                    "replies": []
                },
                {
                    "body": "Everything about kik is sketchy. It just screams scam",
                    "author": "Positive_Orange_8412",
                    "id": "gekke7j",
                    "parent_id": "t1_gej1agd",
                    "score": 2,
                    "created_utc": 1607063924.0,
                    "replies": []
                },
                {
                    "body": "Anyone can be spoofed, being SB is the only coincidence here, not being spoofed.\n\nHow did that happen; fake bank representative calls you, offer you new credit card, you like the idea and signup on the phone by voluntarily giving up all your personal information,  in the process the scammer has recorded enough audio sample to regenerate your voice fingerprint. Beside of course your all personal information.\n\nTo protect yourself, never ever give any information on the phone even if you see your bank number on the phone (yes could be fake)\nNever say yes or no or complete sentences to anyone you suspect. \n\nIf the call is legitimate, ask the officer for his name, number and extension. Address and other information \nHang up, google it, then you initiate the call",
                    "author": "NightMasterDom",
                    "id": "gek12j6",
                    "parent_id": "t1_gej1agd",
                    "score": 1,
                    "created_utc": 1607049822.0,
                    "replies": []
                },
                {
                    "body": "The majority of chat applications track who you are using only your cell phone number, no user name and password. WhatsApp and Kik will share that number with any party you chat with. \n\nOnce a hacker gets your number, he can port it away to new phone on another carrier.   Once he has your number, security measures that use texting as verification are easily defeated. (On-line banking, gmail, etc). Hacker can reset all your passwords and take control of your on-line accounts. \n\nDon’t use a IM service that advertises your cell number. I recommend telegram or signal. \n\nCall your cell phone carrier and put a PIN on your account to stop any port outs.",
                    "author": "sandman200",
                    "id": "gekgve1",
                    "parent_id": "t1_gej1agd",
                    "score": 1,
                    "created_utc": 1607061038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is wonderful. Thank you so much for posting. As an SB it feels as though there are never enough known precautions to take. This is illuminating.",
            "author": "InnerRadio7",
            "id": "gek4s1n",
            "parent_id": "t3_k61n9w",
            "score": 2,
            "created_utc": 1607052216.0,
            "replies": []
        },
        {
            "body": "I had the same experience with a POT a few months ago.  It put me off her as she was so careless so I didn't take it any further.  I did tell her the tips about not using her real number, not using the same photos on SA as she had in her public instagram profile, etc.",
            "author": "frpaulstone",
            "id": "geih310",
            "parent_id": "t1_geiechl",
            "score": 9,
            "created_utc": 1607021418.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "geimaep",
                    "parent_id": "t1_geih310",
                    "score": 7,
                    "created_utc": 1607023833.0,
                    "replies": [
                        {
                            "body": "Sure - but this COMPLETELY removes anonymity. Everyone and anyone who can do reverse imaging will find out who you are, even if you aren't ready to disclose/share that info yet, or even ever meet them in person.   \n\n\nTo some, this doesn't matter. But for me, that is definitely NOT okay.",
                            "author": "ExExpectations",
                            "id": "gej9hxf",
                            "parent_id": "t1_geimaep",
                            "score": 1,
                            "created_utc": 1607033401.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gejncyp",
                                    "parent_id": "t1_gej9hxf",
                                    "score": 1,
                                    "created_utc": 1607040871.0,
                                    "replies": [
                                        {
                                            "body": "A lot of people don’t have the right privacy settings on their FB. Plus it’s constantly changing as well. \n\nA friend or family member “liking” your public profile or cover picture, leaving their own profile to be accessible to the person. They can back trace. These are all bread crumbs for someone savvy like me to track and trace, and I’m not even that good at it.\n\nProtecting one’s privacy makes sense, especially how sugar relationships are often 1-6 months, or at the very best 1-2 years (yes there are outliers but extremely rare). These people come and go from our lives. It’s best to be safer than sorry.",
                                            "author": "ExExpectations",
                                            "id": "gejo8k4",
                                            "parent_id": "t1_gejncyp",
                                            "score": 3,
                                            "created_utc": 1607041363.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get a Google Voice number. Or any free anonymous number. And then sign up for \"Signal\" - free, allows video calls, phone calls, texts, disappearing texts and images if you set the parameters, etc etc.",
            "author": "ExExpectations",
            "id": "geiiwjv",
            "parent_id": "t1_geib9i0",
            "score": 4,
            "created_utc": 1607022256.0,
            "replies": []
        },
        {
            "body": "After building rapport, I switch to telegram. I use a handle on telegram and my telephone number is not shared. \n\nBut has an extra layer of security, I have a separate cell phone, on a separate carrier that I use for all sugaring activities. This ensures my SD social media accounts do not cross pollinate with my real ones. \n\nGoogle Fi, Mint and Republic Wireless are all cheap carriers that to mind.  Google Fi costs me $20 bucks a month and $10 a GB.  I almost never use the data.",
            "author": "sandman200",
            "id": "geivdu6",
            "parent_id": "t1_geib9i0",
            "score": 5,
            "created_utc": 1607027345.0,
            "replies": []
        },
        {
            "body": "Is Google voice not an option for you? I've never had any issues with calls/pictures/etc.",
            "author": "MASugarBaby",
            "id": "geibh2o",
            "parent_id": "t1_geib9i0",
            "score": 2,
            "created_utc": 1607018817.0,
            "replies": [
                {
                    "body": "Unfortunately i already linked google voice for work stuff and it won’t let me use a burner number to create a second GV account.",
                    "author": "JohnnySixguns",
                    "id": "geirw1i",
                    "parent_id": "t1_geibh2o",
                    "score": 3,
                    "created_utc": 1607026009.0,
                    "replies": [
                        {
                            "body": "Google voice isn't the only choice. Lots of other apps and platforms that one can sign up for a free phone number.",
                            "author": "ExExpectations",
                            "id": "gej9rj8",
                            "parent_id": "t1_geirw1i",
                            "score": 1,
                            "created_utc": 1607033542.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Replying to /u/MASugarBaby but also wanted you to see this...\n\nGoogle Voice aggressively limits text message frequency for new accounts, so if you have a new GVoice number and are using it to...say...troll Seeking for prospective babies...you will find you'll hit a message rate limit fairly quickly on a new number. I think their \"soft\" block is around 60 messages for the first day the account is activated. (Don't ask how I figured this shit out, lol)\n\nAs an alternative, TextNow is decent (but their mobile app kinda stinks). Do pay for for the premium subscription, as their baked-in advertisements can get hella annoying.\n\nI swear by GVoice, and love how easily it can integrate with an existing phone number. I suppose a burner is also another good route, but good luck explaining that rogue phone to your partner/spouse if you're vanilla dabbling in Sugar.",
            "author": "SD-Casual-Fla",
            "id": "geicc3n",
            "parent_id": "t1_geib9i0",
            "score": 2,
            "created_utc": 1607019220.0,
            "replies": [
                {
                    "body": ">out the Dark\n\nI use textfree and actually I don't even have the app installed on my phone anymore, I just use the web login to check my messages on there.",
                    "author": "frpaulstone",
                    "id": "geigplb",
                    "parent_id": "t1_geicc3n",
                    "score": 2,
                    "created_utc": 1607021248.0,
                    "replies": [
                        {
                            "body": "Can you do voice calls with that?  I've got a lot of SB's wanting to at least chat by phone before agreeing to a meet.",
                            "author": "JohnnySixguns",
                            "id": "geiuaeo",
                            "parent_id": "t1_geigplb",
                            "score": 2,
                            "created_utc": 1607026912.0,
                            "replies": [
                                {
                                    "body": "yes",
                                    "author": "frpaulstone",
                                    "id": "gelbdx8",
                                    "parent_id": "t1_geiuaeo",
                                    "score": 2,
                                    "created_utc": 1607087429.0,
                                    "replies": [
                                        {
                                            "body": "Using it now with great success.  Thanks.",
                                            "author": "JohnnySixguns",
                                            "id": "geshhs0",
                                            "parent_id": "t1_gelbdx8",
                                            "score": 1,
                                            "created_utc": 1607238206.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve never really had an issue with burner! I wonder why that’s happening with you",
            "author": "Positive_Orange_8412",
            "id": "gekkbyq",
            "parent_id": "t1_geib9i0",
            "score": 1,
            "created_utc": 1607063873.0,
            "replies": []
        },
        {
            "body": "I've had okay luck with TextNow. Free option has worked fine for me so far.",
            "author": "helios4fun",
            "id": "gelrwf2",
            "parent_id": "t1_geib9i0",
            "score": 1,
            "created_utc": 1607096746.0,
            "replies": [
                {
                    "body": "Same. You can make calls with it, too. Out of all the apps Telegram is probably my favorite though.",
                    "author": "sexywonton",
                    "id": "gen5s87",
                    "parent_id": "t1_gelrwf2",
                    "score": 1,
                    "created_utc": 1607121203.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's more to this story than just her sharing a picture and answering the spoof call...",
            "author": null,
            "id": "gejh00o",
            "parent_id": "t1_gej1agd",
            "score": 2,
            "created_utc": 1607037369.0,
            "replies": []
        },
        {
            "body": "Everything about kik is sketchy. It just screams scam",
            "author": "Positive_Orange_8412",
            "id": "gekke7j",
            "parent_id": "t1_gej1agd",
            "score": 2,
            "created_utc": 1607063924.0,
            "replies": []
        },
        {
            "body": "Anyone can be spoofed, being SB is the only coincidence here, not being spoofed.\n\nHow did that happen; fake bank representative calls you, offer you new credit card, you like the idea and signup on the phone by voluntarily giving up all your personal information,  in the process the scammer has recorded enough audio sample to regenerate your voice fingerprint. Beside of course your all personal information.\n\nTo protect yourself, never ever give any information on the phone even if you see your bank number on the phone (yes could be fake)\nNever say yes or no or complete sentences to anyone you suspect. \n\nIf the call is legitimate, ask the officer for his name, number and extension. Address and other information \nHang up, google it, then you initiate the call",
            "author": "NightMasterDom",
            "id": "gek12j6",
            "parent_id": "t1_gej1agd",
            "score": 1,
            "created_utc": 1607049822.0,
            "replies": []
        },
        {
            "body": "The majority of chat applications track who you are using only your cell phone number, no user name and password. WhatsApp and Kik will share that number with any party you chat with. \n\nOnce a hacker gets your number, he can port it away to new phone on another carrier.   Once he has your number, security measures that use texting as verification are easily defeated. (On-line banking, gmail, etc). Hacker can reset all your passwords and take control of your on-line accounts. \n\nDon’t use a IM service that advertises your cell number. I recommend telegram or signal. \n\nCall your cell phone carrier and put a PIN on your account to stop any port outs.",
            "author": "sandman200",
            "id": "gekgve1",
            "parent_id": "t1_gej1agd",
            "score": 1,
            "created_utc": 1607061038.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "geimaep",
            "parent_id": "t1_geih310",
            "score": 7,
            "created_utc": 1607023833.0,
            "replies": [
                {
                    "body": "Sure - but this COMPLETELY removes anonymity. Everyone and anyone who can do reverse imaging will find out who you are, even if you aren't ready to disclose/share that info yet, or even ever meet them in person.   \n\n\nTo some, this doesn't matter. But for me, that is definitely NOT okay.",
                    "author": "ExExpectations",
                    "id": "gej9hxf",
                    "parent_id": "t1_geimaep",
                    "score": 1,
                    "created_utc": 1607033401.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gejncyp",
                            "parent_id": "t1_gej9hxf",
                            "score": 1,
                            "created_utc": 1607040871.0,
                            "replies": [
                                {
                                    "body": "A lot of people don’t have the right privacy settings on their FB. Plus it’s constantly changing as well. \n\nA friend or family member “liking” your public profile or cover picture, leaving their own profile to be accessible to the person. They can back trace. These are all bread crumbs for someone savvy like me to track and trace, and I’m not even that good at it.\n\nProtecting one’s privacy makes sense, especially how sugar relationships are often 1-6 months, or at the very best 1-2 years (yes there are outliers but extremely rare). These people come and go from our lives. It’s best to be safer than sorry.",
                                    "author": "ExExpectations",
                                    "id": "gejo8k4",
                                    "parent_id": "t1_gejncyp",
                                    "score": 3,
                                    "created_utc": 1607041363.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unfortunately i already linked google voice for work stuff and it won’t let me use a burner number to create a second GV account.",
            "author": "JohnnySixguns",
            "id": "geirw1i",
            "parent_id": "t1_geibh2o",
            "score": 3,
            "created_utc": 1607026009.0,
            "replies": [
                {
                    "body": "Google voice isn't the only choice. Lots of other apps and platforms that one can sign up for a free phone number.",
                    "author": "ExExpectations",
                    "id": "gej9rj8",
                    "parent_id": "t1_geirw1i",
                    "score": 1,
                    "created_utc": 1607033542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">out the Dark\n\nI use textfree and actually I don't even have the app installed on my phone anymore, I just use the web login to check my messages on there.",
            "author": "frpaulstone",
            "id": "geigplb",
            "parent_id": "t1_geicc3n",
            "score": 2,
            "created_utc": 1607021248.0,
            "replies": [
                {
                    "body": "Can you do voice calls with that?  I've got a lot of SB's wanting to at least chat by phone before agreeing to a meet.",
                    "author": "JohnnySixguns",
                    "id": "geiuaeo",
                    "parent_id": "t1_geigplb",
                    "score": 2,
                    "created_utc": 1607026912.0,
                    "replies": [
                        {
                            "body": "yes",
                            "author": "frpaulstone",
                            "id": "gelbdx8",
                            "parent_id": "t1_geiuaeo",
                            "score": 2,
                            "created_utc": 1607087429.0,
                            "replies": [
                                {
                                    "body": "Using it now with great success.  Thanks.",
                                    "author": "JohnnySixguns",
                                    "id": "geshhs0",
                                    "parent_id": "t1_gelbdx8",
                                    "score": 1,
                                    "created_utc": 1607238206.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same. You can make calls with it, too. Out of all the apps Telegram is probably my favorite though.",
            "author": "sexywonton",
            "id": "gen5s87",
            "parent_id": "t1_gelrwf2",
            "score": 1,
            "created_utc": 1607121203.0,
            "replies": []
        },
        {
            "body": "Sure - but this COMPLETELY removes anonymity. Everyone and anyone who can do reverse imaging will find out who you are, even if you aren't ready to disclose/share that info yet, or even ever meet them in person.   \n\n\nTo some, this doesn't matter. But for me, that is definitely NOT okay.",
            "author": "ExExpectations",
            "id": "gej9hxf",
            "parent_id": "t1_geimaep",
            "score": 1,
            "created_utc": 1607033401.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gejncyp",
                    "parent_id": "t1_gej9hxf",
                    "score": 1,
                    "created_utc": 1607040871.0,
                    "replies": [
                        {
                            "body": "A lot of people don’t have the right privacy settings on their FB. Plus it’s constantly changing as well. \n\nA friend or family member “liking” your public profile or cover picture, leaving their own profile to be accessible to the person. They can back trace. These are all bread crumbs for someone savvy like me to track and trace, and I’m not even that good at it.\n\nProtecting one’s privacy makes sense, especially how sugar relationships are often 1-6 months, or at the very best 1-2 years (yes there are outliers but extremely rare). These people come and go from our lives. It’s best to be safer than sorry.",
                            "author": "ExExpectations",
                            "id": "gejo8k4",
                            "parent_id": "t1_gejncyp",
                            "score": 3,
                            "created_utc": 1607041363.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Google voice isn't the only choice. Lots of other apps and platforms that one can sign up for a free phone number.",
            "author": "ExExpectations",
            "id": "gej9rj8",
            "parent_id": "t1_geirw1i",
            "score": 1,
            "created_utc": 1607033542.0,
            "replies": []
        },
        {
            "body": "Can you do voice calls with that?  I've got a lot of SB's wanting to at least chat by phone before agreeing to a meet.",
            "author": "JohnnySixguns",
            "id": "geiuaeo",
            "parent_id": "t1_geigplb",
            "score": 2,
            "created_utc": 1607026912.0,
            "replies": [
                {
                    "body": "yes",
                    "author": "frpaulstone",
                    "id": "gelbdx8",
                    "parent_id": "t1_geiuaeo",
                    "score": 2,
                    "created_utc": 1607087429.0,
                    "replies": [
                        {
                            "body": "Using it now with great success.  Thanks.",
                            "author": "JohnnySixguns",
                            "id": "geshhs0",
                            "parent_id": "t1_gelbdx8",
                            "score": 1,
                            "created_utc": 1607238206.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gejncyp",
            "parent_id": "t1_gej9hxf",
            "score": 1,
            "created_utc": 1607040871.0,
            "replies": [
                {
                    "body": "A lot of people don’t have the right privacy settings on their FB. Plus it’s constantly changing as well. \n\nA friend or family member “liking” your public profile or cover picture, leaving their own profile to be accessible to the person. They can back trace. These are all bread crumbs for someone savvy like me to track and trace, and I’m not even that good at it.\n\nProtecting one’s privacy makes sense, especially how sugar relationships are often 1-6 months, or at the very best 1-2 years (yes there are outliers but extremely rare). These people come and go from our lives. It’s best to be safer than sorry.",
                    "author": "ExExpectations",
                    "id": "gejo8k4",
                    "parent_id": "t1_gejncyp",
                    "score": 3,
                    "created_utc": 1607041363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yes",
            "author": "frpaulstone",
            "id": "gelbdx8",
            "parent_id": "t1_geiuaeo",
            "score": 2,
            "created_utc": 1607087429.0,
            "replies": [
                {
                    "body": "Using it now with great success.  Thanks.",
                    "author": "JohnnySixguns",
                    "id": "geshhs0",
                    "parent_id": "t1_gelbdx8",
                    "score": 1,
                    "created_utc": 1607238206.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of people don’t have the right privacy settings on their FB. Plus it’s constantly changing as well. \n\nA friend or family member “liking” your public profile or cover picture, leaving their own profile to be accessible to the person. They can back trace. These are all bread crumbs for someone savvy like me to track and trace, and I’m not even that good at it.\n\nProtecting one’s privacy makes sense, especially how sugar relationships are often 1-6 months, or at the very best 1-2 years (yes there are outliers but extremely rare). These people come and go from our lives. It’s best to be safer than sorry.",
            "author": "ExExpectations",
            "id": "gejo8k4",
            "parent_id": "t1_gejncyp",
            "score": 3,
            "created_utc": 1607041363.0,
            "replies": []
        },
        {
            "body": "Using it now with great success.  Thanks.",
            "author": "JohnnySixguns",
            "id": "geshhs0",
            "parent_id": "t1_gelbdx8",
            "score": 1,
            "created_utc": 1607238206.0,
            "replies": []
        }
    ]
}