{
    "title": "SBs, be careful out there",
    "post_id": "9datx0",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9datx0/sbs_be_careful_out_there/",
    "author": null,
    "body": "Just today as I was checking Linked-in, I saw that I had a connect request from someone I had a meet and greet once with years ago. Before I go to block him, I take the opportunity to do some googling, for curiosity's sake. \n\nAnd oh my gosh, all the headlines are as follows:\n\"Husband of Unsolved murder victim arrested for stabbing\"\n\"Husband whose wife was killed in unsolved slaying accused of stabbing\"\n\"Millis man accused in stabbing to be in court\"\n\nAnd so on and so fourth...\n\nHe was a fucking asshole on the meet and greet, including arriving late and not apologizing, ordering for me, and immediately wanting to play a \"question\" game, which of course he tried to turn sexual, in the middle of a fucking PF Chang's. \n\nNeedless to say I noped away from that heart-throb. But damn, it's unnerving how easily he found me... After all these years. \n\nEven if he didn't murder his wife (I think he did), he was abusive to her, and she had a restraining order on him, as well as their multiple kids. \n\nThis shit is just freaky. Always trust your gut, folks. \n\nsorry guys but HOLY SHIT. still processing this all. WHAT THE FUCK.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/9datx0/sbs_be_careful_out_there/",
    "score": 97,
    "upvote_ratio": 0.95,
    "created_utc": 1536180707.0,
    "num_comments": 15,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "That’s so scary!\nI also find it alarming that these social media sites are connecting us to people that we do not want to be connected to (especially when it reveals our real identity). I saw a POT that I never wanted to see again in my “Who you may know” on instagram. That’s extremely dangerous! Like, wth instagram and Facebook. \nAnyways, make sure you delete all numbers connected to potentials from your phone.. I think that’s what these sites are using to match us and stuff. If anyone else has suggestions, let us know. ",
            "author": "winkmeaway",
            "id": "e5gh4q0",
            "parent_id": "t3_9datx0",
            "score": 28,
            "created_utc": 1536181260.0,
            "replies": [
                {
                    "body": "I have seen so many ex SB's and M&G women on my suggested FB and Instagram feeds using my sugar persona ID it's frightening! \n\n",
                    "author": "SDRippington",
                    "id": "e5ijlr2",
                    "parent_id": "t1_e5gh4q0",
                    "score": 4,
                    "created_utc": 1536264630.0,
                    "replies": []
                },
                {
                    "body": "It's definitely phone numbers, so maybe even delete your number from your profile?",
                    "author": null,
                    "id": "e5hag4r",
                    "parent_id": "t1_e5gh4q0",
                    "score": 3,
                    "created_utc": 1536211639.0,
                    "replies": []
                },
                {
                    "body": ">That’s extremely dangerous! Like, wth instagram and Facebook. \n\nAre you complaining that SOCIAL networks are doing the exact thing they were designed for?  No one is forcing you to use fb/ig anyway...",
                    "author": "Fjfiejenf",
                    "id": "e5lhjpw",
                    "parent_id": "t1_e5gh4q0",
                    "score": -1,
                    "created_utc": 1536381400.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh I’m so sorry and I know that feeling. The dread in the pit of your stomach.\n\nI once went on a couple dates with a guy and something seemed off. I stopped seeing him even though he came into my office multiple times to try to convince me otherwise. \n\nI saw him on the news 6 months later being extradited from serving overseas. Why you ask!? He killed his son just before the deployment!!! They had just finished the investigation and figured out it was him!\n\nHe never told me he had a son...AND a 16 year old wife!\n\nWe were in our early 20’s!",
            "author": "MsDReid",
            "id": "e5gi97s",
            "parent_id": "t3_9datx0",
            "score": 7,
            "created_utc": 1536182234.0,
            "replies": [
                {
                    "body": "Holy shiiiit",
                    "author": "Kitoko30",
                    "id": "e5grqqu",
                    "parent_id": "t1_e5gi97s",
                    "score": 2,
                    "created_utc": 1536191013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is extremely extremely unnerving but I am going to try to say something to relieve you a bit, hopefully. Social media platforms like that have very sophisticated ways of linking people together and then recommending them as connections. Sometimes those algorithms don't get it right and they suggest people totally random and sometimes they suggest people you actively don't want to be connected to. That's why people see like their boyfriend's ex-girlfriends step-mom in Find Friends on Facebook. Their priority is getting more connected users so they don't optimism for accuracy.\n\nSo it's probably most likely that you were recommended as a connection (rather than actually tried to hunt you down and reach out to you years later). Hopefully if that happened he added you not because he recognized you but because he was like \"hey a pretty girl why not\". It's also possible he just unthinkingly likes everyone recommended to him. I have probably 1,000 connections on LinkedIn and about 90% of them are people I have never met, who don't live in my city or work in my field, and I just unthinkingly accepted everyone cuz I check it like once a year and just clear them all out quickly.",
            "author": "vshzzd",
            "id": "e5gq4vb",
            "parent_id": "t3_9datx0",
            "score": 8,
            "created_utc": 1536189441.0,
            "replies": []
        },
        {
            "body": "GOD. thank goodness you’re safe. you should post this on r/letsnotmeet tbh damn ",
            "author": "virginiaslimss",
            "id": "e5h2jb7",
            "parent_id": "t3_9datx0",
            "score": 5,
            "created_utc": 1536201874.0,
            "replies": []
        },
        {
            "body": "Jesus....\n\nAny idea how he learned your name?",
            "author": "MASugarBaby",
            "id": "e5ggpfk",
            "parent_id": "t3_9datx0",
            "score": 5,
            "created_utc": 1536180903.0,
            "replies": [
                {
                    "body": "Nope... We met up like 4 years ago when I was still a sugar noob, so maybe I wasn't as careful with privacy. I always had alternate emails and stuff, though. :/",
                    "author": null,
                    "id": "e5ggwvg",
                    "parent_id": "t1_e5ggpfk",
                    "score": 3,
                    "created_utc": 1536181076.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s very scary. I’m glad you’re smart enough to not start an arrangement with that man.",
            "author": "tannedsb05",
            "id": "e5gm2zn",
            "parent_id": "t3_9datx0",
            "score": 2,
            "created_utc": 1536185617.0,
            "replies": []
        },
        {
            "body": "I really like PF Chang's. It bums me out that there isn't one in my area :( ",
            "author": null,
            "id": "e5hnkcj",
            "parent_id": "t3_9datx0",
            "score": 1,
            "created_utc": 1536236052.0,
            "replies": []
        },
        {
            "body": "These types of stories ruin the Sugar world for many.  I am a new potential SD and can't even find SB's in my area to talk with.  I am also in a city that has a high per capita murder rate.  Be safe ladies!",
            "author": "rogerthatonce",
            "id": "e5hpqxz",
            "parent_id": "t3_9datx0",
            "score": 1,
            "created_utc": 1536238736.0,
            "replies": []
        },
        {
            "body": "I'm a new comer to Sugar dating and am curious to understand where and how do you vet Sugar Dadies?? Is there a network, an app or a site. I tried Seeking but it has little to no real filter on who sees me or finds me. ",
            "author": "SavageSteveg1981",
            "id": "e5jlt9d",
            "parent_id": "t3_9datx0",
            "score": 1,
            "created_utc": 1536305121.0,
            "replies": []
        },
        {
            "body": "If I trusted my gut I would have no clients lmao but yes, some people really just give you the heebie jeebies and it's creepy.",
            "author": "bagofchips9999",
            "id": "e5gxr5i",
            "parent_id": "t3_9datx0",
            "score": 0,
            "created_utc": 1536196991.0,
            "replies": []
        },
        {
            "body": "I have seen so many ex SB's and M&G women on my suggested FB and Instagram feeds using my sugar persona ID it's frightening! \n\n",
            "author": "SDRippington",
            "id": "e5ijlr2",
            "parent_id": "t1_e5gh4q0",
            "score": 4,
            "created_utc": 1536264630.0,
            "replies": []
        },
        {
            "body": "It's definitely phone numbers, so maybe even delete your number from your profile?",
            "author": null,
            "id": "e5hag4r",
            "parent_id": "t1_e5gh4q0",
            "score": 3,
            "created_utc": 1536211639.0,
            "replies": []
        },
        {
            "body": ">That’s extremely dangerous! Like, wth instagram and Facebook. \n\nAre you complaining that SOCIAL networks are doing the exact thing they were designed for?  No one is forcing you to use fb/ig anyway...",
            "author": "Fjfiejenf",
            "id": "e5lhjpw",
            "parent_id": "t1_e5gh4q0",
            "score": -1,
            "created_utc": 1536381400.0,
            "replies": []
        },
        {
            "body": "Holy shiiiit",
            "author": "Kitoko30",
            "id": "e5grqqu",
            "parent_id": "t1_e5gi97s",
            "score": 2,
            "created_utc": 1536191013.0,
            "replies": []
        },
        {
            "body": "Nope... We met up like 4 years ago when I was still a sugar noob, so maybe I wasn't as careful with privacy. I always had alternate emails and stuff, though. :/",
            "author": null,
            "id": "e5ggwvg",
            "parent_id": "t1_e5ggpfk",
            "score": 3,
            "created_utc": 1536181076.0,
            "replies": []
        }
    ]
}