{
    "title": "Amazing, and Different Reaction From My SB's",
    "post_id": "flwq3v",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/flwq3v/amazing_and_different_reaction_from_my_sbs/",
    "author": "AFSMSgt",
    "body": "I have three SB's. One locally I pay a monthly allowance and two in nearby cities (2-3 hour drive) I see on PPM when I visit relatives in those cities. Each knows my age and financial situation. And each knows about the other two.\n\nI am in my early 70's, in good shape, run 30-40 miles a week (sub 10 min pace) and do a couple or three marathons a year. That being said, I am still in the age group most likely to succumb to the virus\n\nI have a monthly income and do not need to liquidate assets to live or support my SB's as things currently stand. Of course, things can change, but I am healthy and solvent and my SB's know that.\n\n Given the above, the reaction of my SB's to the current situation vis-a-vis the virus and recession is startling. The local SB with the monthly allowance is really concerned about that allowance continuing and wants me to drop the others to make sure her payments continue. No mention or obvious concern for my health.\n\nSB #2 said we can have platonic dates when I visit her city for half her usual PPM to save me money (her words).  But wants to make sure I am still planning to make regular visits.\n\nSB#3 and the youngest of the three (early 20s) has not mentioned allowance, PPM or visits. Every conversation has been about my health and her concern. She has even offered to stay with me to do shopping and run errands so I don't have to go out and be exposed. She works from home so this is possible for her. This young lady is amazing. \n\nI think I may have to retire a couple SB's.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/flwq3v/amazing_and_different_reaction_from_my_sbs/",
    "score": 347,
    "upvote_ratio": 0.98,
    "created_utc": 1584717552.0,
    "num_comments": 111,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Very interesting!  It either shows who has the most caring heart, or who is playing this game with the best long-term strategy in mind :) :)",
            "author": "Azurecole",
            "id": "fl0zdh4",
            "parent_id": "t3_flwq3v",
            "score": 76,
            "created_utc": 1584718939.0,
            "replies": [
                {
                    "body": "That had occurred to me. I am becoming awfully cynical. But this girl seems so genuine. If it's a long-term strategy she is wise way beyond her years.",
                    "author": "AFSMSgt",
                    "id": "fl1obry",
                    "parent_id": "t1_fl0zdh4",
                    "score": 55,
                    "created_utc": 1584732965.0,
                    "replies": [
                        {
                            "body": "At this point, I really would 100% take this all at face value.  I'd give #3 full credit and reward her for it, I'd hold #1 and #2 accountable for their behavior (in whatever way you think is fair).  Not worth worrying about what-if's that you can't prove either way (yet)",
                            "author": "Azurecole",
                            "id": "fl1otey",
                            "parent_id": "t1_fl1obry",
                            "score": 17,
                            "created_utc": 1584733246.0,
                            "replies": []
                        },
                        {
                            "body": "OP,  I know your emotions are high and you probably think only #3 has your best interest at heart, however I would advice you to take things slow. Game masters are so good that you won't know the hand they're playing. When I read you post, what jumped at me is that you're probably being played using the simplest trick in the book & I'm not normally a cynic.  So unlike others saying to dump the others, my advice is the opposite. Take things slow and keep watching.",
                            "author": "PioneerExperience",
                            "id": "fl2ibcl",
                            "parent_id": "t1_fl1obry",
                            "score": 10,
                            "created_utc": 1584751693.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well, being kind and caring can pay off in the “meta”, even if you don’t have that as your main intention. Most SBs here have yet to learn that from their posts.",
                    "author": "garret6758",
                    "id": "fl1c42v",
                    "parent_id": "t1_fl0zdh4",
                    "score": 6,
                    "created_utc": 1584726069.0,
                    "replies": []
                },
                {
                    "body": "This!!! This is the exact game I would play if I was into that knowing it always works. Men are so easy to trick, I truly wonder why we still live in a Patriarchal society.",
                    "author": "PioneerExperience",
                    "id": "fl2ii21",
                    "parent_id": "t1_fl0zdh4",
                    "score": 6,
                    "created_utc": 1584751820.0,
                    "replies": [
                        {
                            "body": "You really think we do?",
                            "author": "ontherdagn",
                            "id": "fl2kggu",
                            "parent_id": "t1_fl2ii21",
                            "score": -2,
                            "created_utc": 1584753157.0,
                            "replies": [
                                {
                                    "body": "Yes",
                                    "author": "PioneerExperience",
                                    "id": "fl4ocxs",
                                    "parent_id": "t1_fl2kggu",
                                    "score": 1,
                                    "created_utc": 1584817830.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You would think #1 would be smart enough to play the long term strategy and want to do everything in her power to keep her SD in there trying times.",
                    "author": "ruphun",
                    "id": "fl12e0x",
                    "parent_id": "t1_fl0zdh4",
                    "score": 7,
                    "created_utc": 1584720660.0,
                    "replies": [
                        {
                            "body": "\\#1 is playing tic tac toe.  #3 is playing chess -- and she's at least master level :)\n\nI am half-kidding, no reason to think everyone isn't going with their heart.  But only half kidding, since even if #1 feels like she's in a panic over her allowance, she should realize this isn't the right way to show it",
                            "author": "Azurecole",
                            "id": "fl13ccw",
                            "parent_id": "t1_fl12e0x",
                            "score": 15,
                            "created_utc": 1584721197.0,
                            "replies": [
                                {
                                    "body": "Exactly. Most likely all these women spoke from their heart. 1 was looking out for herself and 3 was more concerned with her SD even if she was thinking long term.\n\n\nNumber 1 should be offering help and be looking for ways to make herself be more  beneficial to her SD, not looking for ways for her SD to save money to afford her allowance.",
                                    "author": "ruphun",
                                    "id": "fl1644s",
                                    "parent_id": "t1_fl13ccw",
                                    "score": 9,
                                    "created_utc": 1584722731.0,
                                    "replies": [
                                        {
                                            "body": "Yep, allowance, at least for me, is not just a financial investment in the relationship, it's not something I even remotely consider if there isn't already considerable emotional investment.  And if there is, this the kind of event where being emotionally invested should come out strongly",
                                            "author": "Azurecole",
                                            "id": "fl16gv9",
                                            "parent_id": "t1_fl1644s",
                                            "score": 2,
                                            "created_utc": 1584722929.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly right. SB 2 is not necessarily a total loss (if you aren't willing to focus on #3), but my strong vote is to take SB 1's allowance and start providing it to 3. \n\nEmpathy and humanity is in short supply these days, and is worth a helluva lot more than whatever the monetary cost is.",
            "author": "SDinMD",
            "id": "fl0xvow",
            "parent_id": "t3_flwq3v",
            "score": 66,
            "created_utc": 1584718061.0,
            "replies": []
        },
        {
            "body": "Good for you OP! Choose door number 3!",
            "author": "BigBearSD",
            "id": "fl0xg6p",
            "parent_id": "t3_flwq3v",
            "score": 67,
            "created_utc": 1584717801.0,
            "replies": [
                {
                    "body": "I go with number 3..!  Move her from PPM to a weekly allowance",
                    "author": "ruphun",
                    "id": "fl128ym",
                    "parent_id": "t1_fl0xg6p",
                    "score": 23,
                    "created_utc": 1584720580.0,
                    "replies": [
                        {
                            "body": "Shit OP is old, number 3 seems to be most caring, why not wife the shit out of her and put her in your Will? ;)\n\nKidding\n\nBut I'd go with number 3 for sure!",
                            "author": "BigBearSD",
                            "id": "fl12cwa",
                            "parent_id": "t1_fl128ym",
                            "score": 47,
                            "created_utc": 1584720642.0,
                            "replies": [
                                {
                                    "body": ">Shit OP is old\n\nLMAO",
                                    "author": "pintodinosaur",
                                    "id": "fl1qkhr",
                                    "parent_id": "t1_fl12cwa",
                                    "score": 21,
                                    "created_utc": 1584734251.0,
                                    "replies": []
                                },
                                {
                                    "body": "She’s SGF material for sure!\n\nI would downgrade number 1 from allowance to PPM 😈",
                                    "author": "ruphun",
                                    "id": "fl16a3e",
                                    "parent_id": "t1_fl12cwa",
                                    "score": 10,
                                    "created_utc": 1584722825.0,
                                    "replies": [
                                        {
                                            "body": "PPM? #1 gets downgraded to ex-POT status.",
                                            "author": "SDinMD",
                                            "id": "fl1b0jb",
                                            "parent_id": "t1_fl16a3e",
                                            "score": 11,
                                            "created_utc": 1584725457.0,
                                            "replies": [
                                                {
                                                    "body": "I guess it really depends on how much he likes her company.",
                                                    "author": "ruphun",
                                                    "id": "fl1cq73",
                                                    "parent_id": "t1_fl1b0jb",
                                                    "score": 7,
                                                    "created_utc": 1584726413.0,
                                                    "replies": [
                                                        {
                                                            "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
                                                            "author": "AFSMSgt",
                                                            "id": "fl1o36g",
                                                            "parent_id": "t1_fl1cq73",
                                                            "score": 14,
                                                            "created_utc": 1584732825.0,
                                                            "replies": [
                                                                {
                                                                    "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                                                                    "author": "callmeDonatella",
                                                                    "id": "fl1ujdw",
                                                                    "parent_id": "t1_fl1o36g",
                                                                    "score": 4,
                                                                    "created_utc": 1584736594.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "👍🏻",
                                                                    "author": "ruphun",
                                                                    "id": "fl1pdt0",
                                                                    "parent_id": "t1_fl1o36g",
                                                                    "score": 0,
                                                                    "created_utc": 1584733568.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "A dream",
                                    "author": "omgharper",
                                    "id": "fl27dov",
                                    "parent_id": "t1_fl12cwa",
                                    "score": 0,
                                    "created_utc": 1584744592.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fn6ryvc",
                    "parent_id": "t1_fl0xg6p",
                    "score": 1,
                    "created_utc": 1586706166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Given social distancing I would pause on all 3 for now!",
            "author": null,
            "id": "fl26j7c",
            "parent_id": "t3_flwq3v",
            "score": 15,
            "created_utc": 1584744047.0,
            "replies": [
                {
                    "body": "Facts lol",
                    "author": null,
                    "id": "fl2fm3n",
                    "parent_id": "t1_fl26j7c",
                    "score": 3,
                    "created_utc": 1584749897.0,
                    "replies": []
                },
                {
                    "body": "Sure, crawl in a hole, preserve your life. The only time you have is now, the future is unknown. The statistics of the situation are clear. You are more likely to die in an auto accident.",
                    "author": "ontherdagn",
                    "id": "fl2lrjz",
                    "parent_id": "t1_fl26j7c",
                    "score": -3,
                    "created_utc": 1584754056.0,
                    "replies": [
                        {
                            "body": "It’s not just about yourself you know!",
                            "author": null,
                            "id": "fl2tgv4",
                            "parent_id": "t1_fl2lrjz",
                            "score": 3,
                            "created_utc": 1584759476.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm always confused by the surprise and shock you SD's express when the reality of they are only with you for what you give them becomes blatant. You know this from the start. If you suddenly lost every thing, they would all be gone. The double standard also blows my mind. Flip the coin, if the first two SB's became fat , you'd drop them in a hot minute and be praised because fat girls are unworthy.  But, it's wrong  for them to only care about the money ? Um nope. What's good for you is good for them.  That being said,  the solution is obvious ,drop the other two and keep the 3rd.",
            "author": "nellybelle1984",
            "id": "fl1tmlv",
            "parent_id": "t3_flwq3v",
            "score": 48,
            "created_utc": 1584736045.0,
            "replies": [
                {
                    "body": "Ewe",
                    "author": "FrankyAllDay",
                    "id": "fl38owm",
                    "parent_id": "t1_fl1tmlv",
                    "score": 3,
                    "created_utc": 1584772948.0,
                    "replies": [
                        {
                            "body": "🐑",
                            "author": "lakoreanita",
                            "id": "fl3uhyc",
                            "parent_id": "t1_fl38owm",
                            "score": 6,
                            "created_utc": 1584798638.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Difference is one needs one, more than the other does. Learn to lie or remotely fake it, because people get quite upset when they’re dismissed for being robotic and fake.",
                    "author": "SESD1",
                    "id": "fl3f875",
                    "parent_id": "t1_fl1tmlv",
                    "score": 2,
                    "created_utc": 1584781136.0,
                    "replies": []
                },
                {
                    "body": "That is completely untrue. Sure every SR is different but for most of us our feelings for one another are very much real. And not paid for.\n\nI specifically held out for a real connection because I **didn't** want that kind of arrangement. I wanted an SR with someone that we built a genuine friendship and love for each other. I only wanted someone who was supporting me because they care for me and want to look after me in multiple capacities.\n\nThe love is still there even if the money isn't.",
                    "author": "Dressedtokillxxx",
                    "id": "fl241u0",
                    "parent_id": "t1_fl1tmlv",
                    "score": 7,
                    "created_utc": 1584742459.0,
                    "replies": [
                        {
                            "body": "I disagree that what I said is completely untrue. It may not be like that for you or for me but it doesn't make it untrue.",
                            "author": "nellybelle1984",
                            "id": "fl24cnc",
                            "parent_id": "t1_fl241u0",
                            "score": 10,
                            "created_utc": 1584742652.0,
                            "replies": [
                                {
                                    "body": "NellyB certainly hits some common characteristics of many sugar relationships.",
                                    "author": "pinotandsugar",
                                    "id": "fl2quxa",
                                    "parent_id": "t1_fl24cnc",
                                    "score": 5,
                                    "created_utc": 1584757599.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lol exactly!",
                    "author": "Throwaway9480411",
                    "id": "fmr17s7",
                    "parent_id": "t1_fl1tmlv",
                    "score": 1,
                    "created_utc": 1586311531.0,
                    "replies": []
                },
                {
                    "body": "Is it really blatantly obvious ?\n\nOr do some women actually care about the men they sleep with..?  Not all women that sugar date are using their SD like a ATM. Some actually care and develop real feelings.",
                    "author": "ruphun",
                    "id": "fl1vaky",
                    "parent_id": "t1_fl1tmlv",
                    "score": 0,
                    "created_utc": 1584737041.0,
                    "replies": [
                        {
                            "body": "No shit. I know that, I'm one that happens to care but it doesn't mean I'm blind to the reality of how things work in the bowl. However, starting out, it's based on the looks of the SB and the money the SD has. Never said it was wrong , just pointing it out. Why do most of you become so touchy about it ? And my confusion is valid. It's a good discussion topic. I like to break things down and get deep into the working parts. It's interesting.",
                            "author": "nellybelle1984",
                            "id": "fl1vtfg",
                            "parent_id": "t1_fl1vaky",
                            "score": 15,
                            "created_utc": 1584737353.0,
                            "replies": [
                                {
                                    "body": "You're right, it is interesting, it is the dilemma we find ourselves in. We all want to be wanted for us. We forget that part of us is the resources we can supply (SD) or the beauty, sex appeal, connectedness, and seeming affection we can provide (SB). It really is very like any relationship, including marriage. When we are worth more dead or divorced, we pose a challenge to the recipient of our resources. We remain satisfied only when we think we are desired for the right reasons by those we desire.",
                                    "author": "ontherdagn",
                                    "id": "fl2lhm4",
                                    "parent_id": "t1_fl1vtfg",
                                    "score": 6,
                                    "created_utc": 1584753870.0,
                                    "replies": []
                                },
                                {
                                    "body": "Start another thread nelly. I too would like to discuss this topic in depth. I know why I got into the bowl initially and why I stay in after a couple of disappointing SR's. Now I am not sure why I have even one SB much less three.",
                                    "author": "AFSMSgt",
                                    "id": "fl2l7q0",
                                    "parent_id": "t1_fl1vtfg",
                                    "score": 1,
                                    "created_utc": 1584753682.0,
                                    "replies": []
                                },
                                {
                                    "body": "> it's based on the looks of the SB and the money the SD has.\n\nI was involved in sugar relationships when you were probably focused on your multiplication tables ( just a guess) .  Over about a decade and a half , for me it has become  about the whole SB - appearance, intelligence, character and of course SENSUALITY ... The SB's who hung out with Hugh Hefner and were models or actresses were perhaps the most \"looks generating when we were out\"   but generally intellectually and value  vacuous, not to mention sensually mechanized to run through the satisfaction program before shutting down and looking for the allowance before offering a hasty goodnight . (see you  when the rent's due)\n\nThe SB's whom I still hear from today preferred the Navajo Turquoise from around Taos to  stuff from Beverly Hills,  flyfishing in Oregon over clubbing in Hollywood, to discuss classic lit over today's Hollywood tales or lunch at Catalina's airport to shopping in Beverly Hills. \n\nOne of the greatest mistakes most newer SB's make is not defining whom the are and pursuing SD who match that profile.\n\nResponding to NB , most all of the SB's I have had over well over a decade have been attractive .  However, those selected primarily on the basis of looks and lust have been the shortest relationships",
                                    "author": "pinotandsugar",
                                    "id": "fl2sey6",
                                    "parent_id": "t1_fl1vtfg",
                                    "score": 1,
                                    "created_utc": 1584758702.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have 3 SBs that all know about each other.  Now you are upset that they aren't crossing the line and wanting to act like a wife (I would assume a man with 3 SBs doesn't want a wife).\n\nIf my SD has 2 other SBs I would assume he wants things casual and light (especially of he was 70+ and I was 40 to 50 years younger) without all the feels and emotional baggage.  It seems you are upset that they are giving you exactly what you pay for.\n\nIf one of these women got clingy and started talking long term, how would you react?  It seems you want them emotionally attached to you but you don't want to be as emotionally attached to them.  I don't think your money can buy that.",
            "author": "Volturi6271",
            "id": "fl5otrl",
            "parent_id": "t3_flwq3v",
            "score": 13,
            "created_utc": 1584841938.0,
            "replies": []
        },
        {
            "body": "\\#3 is a kind soul and a keeper.",
            "author": "mraspencer",
            "id": "fl0y4hx",
            "parent_id": "t3_flwq3v",
            "score": 19,
            "created_utc": 1584718206.0,
            "replies": []
        },
        {
            "body": "SBs and SDs are fair weather friends, and that's ok. Especially if you have multiple it's silly to expect a lot of emotional investment. \n\nAs long as she sucks and fucks reliably I see no reason to drop an SB for caring about her end of the bargain.",
            "author": null,
            "id": "fl2fcy5",
            "parent_id": "t3_flwq3v",
            "score": 15,
            "created_utc": 1584749729.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl0z8sr",
            "parent_id": "t3_flwq3v",
            "score": 7,
            "created_utc": 1584718864.0,
            "replies": [
                {
                    "body": ">I would drop the first 2 so fast.\n\nSo fast they'd get vertigo.",
                    "author": "pintodinosaur",
                    "id": "fl1qnk1",
                    "parent_id": "t1_fl0z8sr",
                    "score": 2,
                    "created_utc": 1584734299.0,
                    "replies": [
                        {
                            "body": "HAHHAAA 🤣🤣🤣🤣🤣🤣🤣",
                            "author": "maybeimyourgirl",
                            "id": "fl1xymx",
                            "parent_id": "t1_fl1qnk1",
                            "score": 1,
                            "created_utc": 1584738650.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl27dty",
            "parent_id": "t3_flwq3v",
            "score": 10,
            "created_utc": 1584744594.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fl2iin8",
                    "parent_id": "t1_fl27dty",
                    "score": 9,
                    "created_utc": 1584751831.0,
                    "replies": [
                        {
                            "body": "my feelings for my SB's were not germane.",
                            "author": "AFSMSgt",
                            "id": "fl2lm81",
                            "parent_id": "t1_fl2iin8",
                            "score": -2,
                            "created_utc": 1584753955.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fl2nxs0",
                                    "parent_id": "t1_fl2lm81",
                                    "score": 6,
                                    "created_utc": 1584755548.0,
                                    "replies": [
                                        {
                                            "body": "I don’t get it. So his feelings for them aren’t genuine, but expects their feelings for him to be genuine?",
                                            "author": "RussianAsshole",
                                            "id": "fl3hfx1",
                                            "parent_id": "t1_fl2nxs0",
                                            "score": 7,
                                            "created_utc": 1584784123.0,
                                            "replies": [
                                                {
                                                    "body": "I said germane, didn't matter to the comment. I do genuinely care for each of these women",
                                                    "author": "AFSMSgt",
                                                    "id": "fl3jm9h",
                                                    "parent_id": "t1_fl3hfx1",
                                                    "score": 1,
                                                    "created_utc": 1584787059.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "That's obvious.  Did you ever air your feelings to #1 or #2? Tell them it hurt your feelings that they didn't ask how you-someone safely tucked away with resources-was doing?  It is perfectly natural in a time of crisis for someone who may just barely be treading water to be concerned about their survival.\n\nJust look at you.  No mention or thought to how cutting off #1 or #2 would effect these women but you expect their top concern to be your health...when you led with how healthy you are.\n\nThis forum holds SB's to ridiculous standards.  They are expected to behave like a devoted wife of gf while an SD can act like the worst kind of employer.",
                                    "author": "sugarsenior",
                                    "id": "fl5e89j",
                                    "parent_id": "t1_fl2lm81",
                                    "score": 3,
                                    "created_utc": 1584834664.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i feel this post is unfair to the SB. \n\nYour other SBs are financially concerned as is normal. It is expected that 50% of the US population will be laid off. Not sure if you have ever experienced being unemployed but I have  empathy with people being scared and worried. \n\nThe older SB seem wiser. I personally think it can help to have empathy. The situation is very hard. In a way you are these women's employer. I would be worried about being fired or my company going bankrupt. The SBs are your workers. They are not your GFs. Have empathy with your workers in these hard times. I mean if you want them to pretend to be your GFs and say things like :\" Oh baby how is your health?? You are the only thing on my mind in this global pandemic. Who cares if my grandma died of the virus, or my dad just got laid off. I only think and worry about you...\" then tell them. They are your workers. I think you can ask them to  make you have a greater GF experience. I don't think you should fire your SB. have more empathy. These are hard times for everyone. Well except some senators who knew this would happen and got smart in the stock market :)\n\nAnywho hope you keep safe and healthy. Don;t fire your workers. Be a nice employer :)",
            "author": "LittleSugarBrat",
            "id": "fl2beqm",
            "parent_id": "t3_flwq3v",
            "score": 12,
            "created_utc": 1584747167.0,
            "replies": [
                {
                    "body": "Well if I am their employer then only #3 is looking out for the future of the company, me. If I go tits up i.e. succumb to the virus then they are all out of a job. #3 seems to understand that her livelihood depends on keeping the company healthy.",
                    "author": "AFSMSgt",
                    "id": "fl2ml6y",
                    "parent_id": "t1_fl2beqm",
                    "score": 7,
                    "created_utc": 1584754623.0,
                    "replies": [
                        {
                            "body": "Quick question: did you ask them how they were doing? Did they loose their day job? do they have any family member that went unemployed? Are they sick? \n\nPeople cope with stressful situations in different ways. #1 and #2 might not have asked about your health because they have stressful situations happening in their own life. A normal employer in these circumstances would give their workers with support. The life of many have been turned upside down. A normal employer would not be nagging the workers in these hard times. have empathy for your workers.\n\nTo me it looks like you  want a gf experience without giving a bf experience back or paying extra to get the bf experience. I also think you might be down on cash and are likely just looking on an excuse to dump #1 and 2, while looking cool. \n\ni think we all need to have more empathy. Also if you can't support 3 sugar babies just be upfront about it. No need to find lame excuses.",
                            "author": "LittleSugarBrat",
                            "id": "fl30c04",
                            "parent_id": "t1_fl2ml6y",
                            "score": 7,
                            "created_utc": 1584764835.0,
                            "replies": [
                                {
                                    "body": "I also noticed I wished you were healthy and well. You did not wish me good health in the middl of the pandemia :'(\n\nI bet you likely also did not ask your sugar babies how they were doing.  It is a crisis. We are all living trauma. We need t have empathy with each other.",
                                    "author": "LittleSugarBrat",
                                    "id": "fl30tt0",
                                    "parent_id": "t1_fl30c04",
                                    "score": 5,
                                    "created_utc": 1584765255.0,
                                    "replies": [
                                        {
                                            "body": "in fact, I sent each an extra allowance and asked if they and their family were well and if they needed anything thy should ask.",
                                            "author": "AFSMSgt",
                                            "id": "fl3jub6",
                                            "parent_id": "t1_fl30tt0",
                                            "score": 2,
                                            "created_utc": 1584787357.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A diamond among coal.",
            "author": "bsbdfw",
            "id": "fl12o3x",
            "parent_id": "t3_flwq3v",
            "score": 8,
            "created_utc": 1584720820.0,
            "replies": []
        },
        {
            "body": "It's very easy to berate someone then understand the situation they might be going through. This is crazy times and I would not judge someone off it considering most of them are scared. Can I kill a man during normal times, not really but if I am cornered and scared for my life then most definitely. I know it is an extreme example but I hope you get my gist.  I definitely agree with other posters that SB#3 should be rewarded, how you go about doing it I will leave it to you but we cannot expect empathy when we refuse to give some ourselves.",
            "author": null,
            "id": "fl17m79",
            "parent_id": "t3_flwq3v",
            "score": 14,
            "created_utc": 1584723566.0,
            "replies": [
                {
                    "body": "Of course things are crazy, but in less time than it took to demand that he should \"drop other SBs\" so she can get paid, #1 could have at the _very least_ asked how OP was doing, especially considering he's vulnerable.\n\nIt's not hard, nor unreasonable to expect. There's no excuse for her behavior, \"trying times\" or not.",
                    "author": "SDinMD",
                    "id": "fl1biu6",
                    "parent_id": "t1_fl17m79",
                    "score": 9,
                    "created_utc": 1584725741.0,
                    "replies": [
                        {
                            "body": "I agree with you in principle.",
                            "author": null,
                            "id": "fl1dwq2",
                            "parent_id": "t1_fl1biu6",
                            "score": 1,
                            "created_utc": 1584727071.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How do you reward someone for being a basic, caring human being?. Is money enough?",
                    "author": "AFSMSgt",
                    "id": "fl1orih",
                    "parent_id": "t1_fl17m79",
                    "score": 6,
                    "created_utc": 1584733214.0,
                    "replies": [
                        {
                            "body": "By knowing what they want from life and helping them with those milestones. Positive affirmation, encouragement, enablement, being there when they need you -- money is just an enabler to make these happen.",
                            "author": null,
                            "id": "fl1ra5t",
                            "parent_id": "t1_fl1orih",
                            "score": 8,
                            "created_utc": 1584734658.0,
                            "replies": [
                                {
                                    "body": "Good answer. You are so right.",
                                    "author": "AFSMSgt",
                                    "id": "fl1sq0t",
                                    "parent_id": "t1_fl1ra5t",
                                    "score": 6,
                                    "created_utc": 1584735508.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "cool your jets grandpa. you're doing great",
            "author": "doctorcoolpop",
            "id": "fl1nikw",
            "parent_id": "t3_flwq3v",
            "score": 5,
            "created_utc": 1584732502.0,
            "replies": [
                {
                    "body": "Grandpa!  He is only 70 and runs 30x more than me a week.",
                    "author": null,
                    "id": "fl26pgo",
                    "parent_id": "t1_fl1nikw",
                    "score": 2,
                    "created_utc": 1584744158.0,
                    "replies": [
                        {
                            "body": "73 actually but I lie and say 71 :-)",
                            "author": "AFSMSgt",
                            "id": "fl2lcfj",
                            "parent_id": "t1_fl26pgo",
                            "score": 2,
                            "created_utc": 1584753771.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah 3 is a winner for sure. For the other SB to not care about your health is insane to me and she is seeing you as a piggy bank and nothing else.",
            "author": "sweetnlowhellno",
            "id": "fl1m2dc",
            "parent_id": "t3_flwq3v",
            "score": 5,
            "created_utc": 1584731687.0,
            "replies": []
        },
        {
            "body": "Wow. I think you are right on track. During these difficult and unprecedented times sometimes people will show their true  colors. Have #3 stay with you and help you out to limit your exposure and give her what you were giving the other two. She sounds like a gem and is TRULY concerned about your health and wellbeing. She is a keeper. If we have got to quarantine, you may as well do it with a kind, caring and compassionate SB!",
            "author": "MidwestSB",
            "id": "fl2nsia",
            "parent_id": "t3_flwq3v",
            "score": 4,
            "created_utc": 1584755447.0,
            "replies": [
                {
                    "body": "This is exactly what I was thinking as well",
                    "author": "Cledaddy23",
                    "id": "fl43x4i",
                    "parent_id": "t1_fl2nsia",
                    "score": 1,
                    "created_utc": 1584805339.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow so damn selfish!! During times like this, some people really show their true colors.",
            "author": "brownandsweet",
            "id": "fl10too",
            "parent_id": "t3_flwq3v",
            "score": 5,
            "created_utc": 1584719770.0,
            "replies": []
        },
        {
            "body": "In the last 12 days I have heard from 2 ex-sbs both asking about availability or help. Not one has asked about me or my current relationships. \n\nI can't imagine how others must be handling this. I don't even want to look on SA this week.",
            "author": "KnocDown",
            "id": "fl12jov",
            "parent_id": "t3_flwq3v",
            "score": 5,
            "created_utc": 1584720751.0,
            "replies": []
        },
        {
            "body": "1 and 2 need to go bro. Give #3 everything. And put her in your will.",
            "author": "dade_murphy1",
            "id": "fl1m53t",
            "parent_id": "t3_flwq3v",
            "score": 4,
            "created_utc": 1584731730.0,
            "replies": [
                {
                    "body": "I am leaning in that direction. Maybe not the will, shit I might live another 10 years, but I am thinking trust fund.",
                    "author": "AFSMSgt",
                    "id": "fl1ozyn",
                    "parent_id": "t1_fl1m53t",
                    "score": 10,
                    "created_utc": 1584733349.0,
                    "replies": [
                        {
                            "body": "#3 is the kind of sb we are all looking for. A real good woman. Im serious man. Take care of her.",
                            "author": "dade_murphy1",
                            "id": "fl2tcqx",
                            "parent_id": "t1_fl1ozyn",
                            "score": 2,
                            "created_utc": 1584759393.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Empathy is so valuable!",
            "author": "LikeHoney99",
            "id": "fl1485u",
            "parent_id": "t3_flwq3v",
            "score": 3,
            "created_utc": 1584721693.0,
            "replies": []
        },
        {
            "body": "Looks like SB#3 needs a weekly allowance to me. She obviously has the most legitimate concern for you.",
            "author": "AveryMayvary",
            "id": "fl2tgs3",
            "parent_id": "t3_flwq3v",
            "score": 3,
            "created_utc": 1584759475.0,
            "replies": []
        },
        {
            "body": "You should give all three of them a 25% raise and stfu about it for the rest of the year.",
            "author": "UnkleKrampusKids",
            "id": "fl1sihw",
            "parent_id": "t3_flwq3v",
            "score": 4,
            "created_utc": 1584735384.0,
            "replies": [
                {
                    "body": "Yes😍",
                    "author": null,
                    "id": "fl2foym",
                    "parent_id": "t1_fl1sihw",
                    "score": 5,
                    "created_utc": 1584749950.0,
                    "replies": []
                },
                {
                    "body": "stfu?",
                    "author": "AFSMSgt",
                    "id": "fl1vgop",
                    "parent_id": "t1_fl1sihw",
                    "score": 2,
                    "created_utc": 1584737142.0,
                    "replies": [
                        {
                            "body": "lol yes Senior Master Sergeant! STFU!",
                            "author": "UnkleKrampusKids",
                            "id": "fl1wslg",
                            "parent_id": "t1_fl1vgop",
                            "score": 5,
                            "created_utc": 1584737937.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which one has the biggest tits? I’m kidding! Relax!",
            "author": "FredCouplesBaby",
            "id": "fl1l981",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584731226.0,
            "replies": [
                {
                    "body": "Little tits matter! #littletittiesmattermovement",
                    "author": "artgonelive",
                    "id": "fl1u18g",
                    "parent_id": "t1_fl1l981",
                    "score": 6,
                    "created_utc": 1584736291.0,
                    "replies": [
                        {
                            "body": "Yay little titties!!!!",
                            "author": "Life_b_beautiful",
                            "id": "fl2bags",
                            "parent_id": "t1_fl1u18g",
                            "score": 2,
                            "created_utc": 1584747091.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "\\#1",
                    "author": "AFSMSgt",
                    "id": "fl1oh8r",
                    "parent_id": "t1_fl1l981",
                    "score": 4,
                    "created_utc": 1584733052.0,
                    "replies": [
                        {
                            "body": ">\\#1\n\nCould've figured out that one lol",
                            "author": "pintodinosaur",
                            "id": "fl1qtfn",
                            "parent_id": "t1_fl1oh8r",
                            "score": 5,
                            "created_utc": 1584734395.0,
                            "replies": []
                        },
                        {
                            "body": "There is your answer! LOL",
                            "author": "FredCouplesBaby",
                            "id": "fl1p083",
                            "parent_id": "t1_fl1oh8r",
                            "score": 0,
                            "created_utc": 1584733353.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I think I may have to retire a couple SB's. \n\n&#x200B;\n\nAgreed. #3 is a total keeper.",
            "author": "pintodinosaur",
            "id": "fl1qhi1",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584734203.0,
            "replies": []
        },
        {
            "body": "Choose number 3 M’lord!",
            "author": "Kigichi",
            "id": "fl1t0p5",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584735683.0,
            "replies": []
        },
        {
            "body": "Times like this are very telling, for all of us. My SD of five years put me first in this situation and I will never forget it. The love is real and showed through actions.",
            "author": "artgonelive",
            "id": "fl1tu3o",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584736170.0,
            "replies": [
                {
                    "body": "Exactly. Sure we (SD's) are in a financial arrangement and the money matters to both of us, but I am with my babies because I care about them and their wellbeing and expect some of that in return. It's not just the sex, I can get that anywhere, anytime for a small fraction of what I give my babies. I genuinely like these woman. Or I did.",
                    "author": "AFSMSgt",
                    "id": "fl1vxmb",
                    "parent_id": "t1_fl1tu3o",
                    "score": 3,
                    "created_utc": 1584737423.0,
                    "replies": [
                        {
                            "body": "For sure, I definitely am aware of the fact that this is affecting my SD's health potentially, his business, and his stocks. I'm very sorry for that fact and just trying to be there for him as a friend. He's taking it in stride though like the cool motherfucker he is. :)\n\nHope it works out for you guys.",
                            "author": "artgonelive",
                            "id": "fl1xzlj",
                            "parent_id": "t1_fl1vxmb",
                            "score": 3,
                            "created_utc": 1584738668.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a lady, that third is a gold hearted girl and the other two are vectors for a virus. Let the parasites go and keep that woman! How precious.",
            "author": "Yaodinvolk",
            "id": "fl37ysz",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584772139.0,
            "replies": []
        },
        {
            "body": "\\#3 hasn't mentioned allowance, but definitely deserves to get one if you both decide that's the way to go! Honestly I'd cut it off with #1. Being concerned for her finances is completely understandable, but showing no concern for you just doesn't sit well at all.",
            "author": "roscoe7585",
            "id": "fl486nz",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584808033.0,
            "replies": []
        },
        {
            "body": "Honestly, if I was your SB I'd be more in line with SB 3's response. To be honest, I still live at home and this whole situation has not made me afraid of my health, but my parent's. It terrifies me to know that i may possibly have them contract the disease, so I've been doing my best to avoid going places and such. I also have a mentor who is 80. I usually go visit him every week to bring him groceries and make him lunch (his family isn't around much) but I've been terrified to go there because he is immunosuppressed. \n\nSorry this was a bit tangential, point is... Find people who care about you and your health first. Money isn't everything. You may need to drop those other SBs.",
            "author": "adiverges",
            "id": "fl4be3z",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584809973.0,
            "replies": []
        },
        {
            "body": "Gross. I agree. Sounds like they are employees not sugar babies. \nI’ve been checking on my SD for weeks. He flew to/from France...I even brought him TP when he got back and didn’t have any 😂😂",
            "author": "adesiderio",
            "id": "fl1gqsm",
            "parent_id": "t3_flwq3v",
            "score": 4,
            "created_utc": 1584728672.0,
            "replies": []
        },
        {
            "body": "Sorry let's ALL BE REAL. SOME LADIES HAVE 4 SD\nAND YOU SAID YOU HAD 3!!!!\n\nWHY ISN'T ONE ENOUGH. \nNOT TO OFFEND YOU being I am about 1 guy and a connection but if they knew about each other they did ppm honestly to them it's about the $$ more so.\nA gentleman can tons of SBS and thing everyone actu6 has a deep caring?\nYes number 3.\nBut why are u so shocked about the other 2???\nHunny if I évéñ had a SD.\nWe would need a connection.\nI also am not judging but you are seeing 3 2 for ppm what did u expect?",
            "author": "EastCoastCompanion",
            "id": "fl1cyf7",
            "parent_id": "t3_flwq3v",
            "score": 2,
            "created_utc": 1584726541.0,
            "replies": [
                {
                    "body": "I have a connection with each. But times have been good and I was able to be a financial help to each. But true colors are starting to emerge and I am not liking all that I see. It's easy to be a good SB or SD in good times, it the times like this that make the difference. Just my opinion.",
                    "author": "AFSMSgt",
                    "id": "fl1phih",
                    "parent_id": "t1_fl1cyf7",
                    "score": 3,
                    "created_utc": 1584733628.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "hi. this is weird but, could you give me some advice on this SD situation? i can’t find any real looking posts from SDs on here or any SB posts that look reasonable unless im being taken advantage of by my SD. i think SDs online inflate the reality so I want to get it from a SDs perspective. i met him when i was 18 and now 19 (grew up in a bubble so not experienced w anything for my age) and something just feels off. Hes 60. he’s really genuine and sweet and i enjoy him but he expects to see me at least 3-4 times a week for 1k a month. well he is married and because of that has a weird schedule and i live an hour away and work because i can’t just drop everything. idk what to do. is this normal in ur opinion? is it worth it? i really like him which is why im giving him a break because I rather take a little less for someone I like but idk anymore because it makes me feel bad for never doing enough. also finding a sugar daddy with all the skeezballs out there, the whole process is so hard I don’t think it’s worth it. I live in a city in America, not sure if that makes a diff. Anyways, got off topic, is he asking too much of me and is this normal to u is what I’m wondering",
            "author": "bbbbbbbbbbbbbbhhjaja",
            "id": "fmvkzz1",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1586420817.0,
            "replies": []
        },
        {
            "body": "Thanks my love I was just wondering hey I'll pick up a few myself if I can LOL",
            "author": "EastCoastCompanion",
            "id": "fngjnfe",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1586934359.0,
            "replies": []
        },
        {
            "body": "And that right there shows you everyone’s true colors. SB #3 is the one you want to invest that time and money into.",
            "author": "IndependentClub0",
            "id": "fl1qpl0",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584734332.0,
            "replies": []
        },
        {
            "body": "we have a winner!",
            "author": "sugarthrowSD",
            "id": "fl1vv8l",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584737383.0,
            "replies": []
        },
        {
            "body": "Sarge- you have 2 & 3 play with you at the same time?",
            "author": "FredCouplesBaby",
            "id": "fl1w8qa",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584737608.0,
            "replies": [
                {
                    "body": "God bro, you are such a fucking troll.\n\nSomebody ban this fool already. 🙄\nLike every other sub you troll in has",
                    "author": "Dressedtokillxxx",
                    "id": "fl23jnc",
                    "parent_id": "t1_fl1w8qa",
                    "score": 7,
                    "created_utc": 1584742134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ummmm yea #3 all the way!! It’s nice to know some people have a heart :) Glad to hear you are doing well!",
            "author": "Dont_Cry_Shop_Girl",
            "id": "fl1xw4y",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584738607.0,
            "replies": []
        },
        {
            "body": "I would Next 1 & 2 and move 3 up to SGF.\n\nI certainly can't blame 1 & 2 for being concerned about their financial situations but they went about it all the wrong way.  At least pretend to care even if you really don't.",
            "author": "whatshouldIdonow8907",
            "id": "fl230x3",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584741804.0,
            "replies": []
        },
        {
            "body": "Aww..that is so sweet, love hearing this!\n\nI’ve seen a couple posts of SDs speaking on the very different reactions of their multiple SB’s. Nothing like a pandemic to see someone’s true feelings!\nSounds like you have a keeper there with #3 :) \n\nI’ve already told my SD I will under no circumstance stay away if he gets sick and leave him quarantined, sick, and alone. Absolutely not.",
            "author": "Dressedtokillxxx",
            "id": "fl23ddx",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584742024.0,
            "replies": []
        },
        {
            "body": "Go for number 3 or 2. Anyone who doesn’t care about your health on the most basic human level, you need nothing to do with. You’re not an ATM, and on a strictly personal level they should want you to be ok. Or scrap them all and start anew, though forget what others say id keep #3 around. Remember your own worth and respect you deserve just as a person.",
            "author": "SESD1",
            "id": "fl3f52l",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584781023.0,
            "replies": []
        },
        {
            "body": "Get rid of 1 and 2 if they become toxic...they sound close and I hate to see people used and thrown away in something that should always be a positive arrangement. #3 is however servicing you, it's a responsible thing to do but if it's already not part of the arrangement I would still wonder about all of them. I've been told it's always safe to think of a sugar baby as a contractor and this doesn't seem like my situation currently but that's just my style so in the end it's up to you. Good luck 😊 I hope it works out.",
            "author": "Safety_Cuddles",
            "id": "fl3ghu4",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584782844.0,
            "replies": []
        },
        {
            "body": "Quick! Make sure you add her in your will. She’ll love you forever.",
            "author": null,
            "id": "fl5wgdj",
            "parent_id": "t3_flwq3v",
            "score": 1,
            "created_utc": 1584847506.0,
            "replies": []
        },
        {
            "body": "That's so sweet I admire people like her. They give me hope lol. I think in this state you need to care about people. And seeing people think about money over their neighbor is inhumane. Personaly I find it revolting.\n\n If my father wasn't much older i would definitely be trying to find out how to help in SOME way ya know? But my main focus is my fathers well being.",
            "author": "Nonitfny",
            "id": "fl367sv",
            "parent_id": "t3_flwq3v",
            "score": 0,
            "created_utc": 1584770242.0,
            "replies": []
        },
        {
            "body": "Sounds like 1 and 2 are more towards the sex worker end of the spectrum, but it also sounds like maybe that’s what you want? \n\nI would choose number three 100 percent. There are many people who would prefer 1-2 though. There is nothing wrong with keeping it more business like and many SDs prefer that from what I hear. Choose the one that matches you best. If number three is a caring person, it is pretty shitty of you to not want to reciprocate. Are you prepared to be in that type of SR is the real question.",
            "author": "FrankyAllDay",
            "id": "fl39s94",
            "parent_id": "t3_flwq3v",
            "score": 0,
            "created_utc": 1584774221.0,
            "replies": []
        },
        {
            "body": "That had occurred to me. I am becoming awfully cynical. But this girl seems so genuine. If it's a long-term strategy she is wise way beyond her years.",
            "author": "AFSMSgt",
            "id": "fl1obry",
            "parent_id": "t1_fl0zdh4",
            "score": 55,
            "created_utc": 1584732965.0,
            "replies": [
                {
                    "body": "At this point, I really would 100% take this all at face value.  I'd give #3 full credit and reward her for it, I'd hold #1 and #2 accountable for their behavior (in whatever way you think is fair).  Not worth worrying about what-if's that you can't prove either way (yet)",
                    "author": "Azurecole",
                    "id": "fl1otey",
                    "parent_id": "t1_fl1obry",
                    "score": 17,
                    "created_utc": 1584733246.0,
                    "replies": []
                },
                {
                    "body": "OP,  I know your emotions are high and you probably think only #3 has your best interest at heart, however I would advice you to take things slow. Game masters are so good that you won't know the hand they're playing. When I read you post, what jumped at me is that you're probably being played using the simplest trick in the book & I'm not normally a cynic.  So unlike others saying to dump the others, my advice is the opposite. Take things slow and keep watching.",
                    "author": "PioneerExperience",
                    "id": "fl2ibcl",
                    "parent_id": "t1_fl1obry",
                    "score": 10,
                    "created_utc": 1584751693.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, being kind and caring can pay off in the “meta”, even if you don’t have that as your main intention. Most SBs here have yet to learn that from their posts.",
            "author": "garret6758",
            "id": "fl1c42v",
            "parent_id": "t1_fl0zdh4",
            "score": 6,
            "created_utc": 1584726069.0,
            "replies": []
        },
        {
            "body": "This!!! This is the exact game I would play if I was into that knowing it always works. Men are so easy to trick, I truly wonder why we still live in a Patriarchal society.",
            "author": "PioneerExperience",
            "id": "fl2ii21",
            "parent_id": "t1_fl0zdh4",
            "score": 6,
            "created_utc": 1584751820.0,
            "replies": [
                {
                    "body": "You really think we do?",
                    "author": "ontherdagn",
                    "id": "fl2kggu",
                    "parent_id": "t1_fl2ii21",
                    "score": -2,
                    "created_utc": 1584753157.0,
                    "replies": [
                        {
                            "body": "Yes",
                            "author": "PioneerExperience",
                            "id": "fl4ocxs",
                            "parent_id": "t1_fl2kggu",
                            "score": 1,
                            "created_utc": 1584817830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You would think #1 would be smart enough to play the long term strategy and want to do everything in her power to keep her SD in there trying times.",
            "author": "ruphun",
            "id": "fl12e0x",
            "parent_id": "t1_fl0zdh4",
            "score": 7,
            "created_utc": 1584720660.0,
            "replies": [
                {
                    "body": "\\#1 is playing tic tac toe.  #3 is playing chess -- and she's at least master level :)\n\nI am half-kidding, no reason to think everyone isn't going with their heart.  But only half kidding, since even if #1 feels like she's in a panic over her allowance, she should realize this isn't the right way to show it",
                    "author": "Azurecole",
                    "id": "fl13ccw",
                    "parent_id": "t1_fl12e0x",
                    "score": 15,
                    "created_utc": 1584721197.0,
                    "replies": [
                        {
                            "body": "Exactly. Most likely all these women spoke from their heart. 1 was looking out for herself and 3 was more concerned with her SD even if she was thinking long term.\n\n\nNumber 1 should be offering help and be looking for ways to make herself be more  beneficial to her SD, not looking for ways for her SD to save money to afford her allowance.",
                            "author": "ruphun",
                            "id": "fl1644s",
                            "parent_id": "t1_fl13ccw",
                            "score": 9,
                            "created_utc": 1584722731.0,
                            "replies": [
                                {
                                    "body": "Yep, allowance, at least for me, is not just a financial investment in the relationship, it's not something I even remotely consider if there isn't already considerable emotional investment.  And if there is, this the kind of event where being emotionally invested should come out strongly",
                                    "author": "Azurecole",
                                    "id": "fl16gv9",
                                    "parent_id": "t1_fl1644s",
                                    "score": 2,
                                    "created_utc": 1584722929.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I go with number 3..!  Move her from PPM to a weekly allowance",
            "author": "ruphun",
            "id": "fl128ym",
            "parent_id": "t1_fl0xg6p",
            "score": 23,
            "created_utc": 1584720580.0,
            "replies": [
                {
                    "body": "Shit OP is old, number 3 seems to be most caring, why not wife the shit out of her and put her in your Will? ;)\n\nKidding\n\nBut I'd go with number 3 for sure!",
                    "author": "BigBearSD",
                    "id": "fl12cwa",
                    "parent_id": "t1_fl128ym",
                    "score": 47,
                    "created_utc": 1584720642.0,
                    "replies": [
                        {
                            "body": ">Shit OP is old\n\nLMAO",
                            "author": "pintodinosaur",
                            "id": "fl1qkhr",
                            "parent_id": "t1_fl12cwa",
                            "score": 21,
                            "created_utc": 1584734251.0,
                            "replies": []
                        },
                        {
                            "body": "She’s SGF material for sure!\n\nI would downgrade number 1 from allowance to PPM 😈",
                            "author": "ruphun",
                            "id": "fl16a3e",
                            "parent_id": "t1_fl12cwa",
                            "score": 10,
                            "created_utc": 1584722825.0,
                            "replies": [
                                {
                                    "body": "PPM? #1 gets downgraded to ex-POT status.",
                                    "author": "SDinMD",
                                    "id": "fl1b0jb",
                                    "parent_id": "t1_fl16a3e",
                                    "score": 11,
                                    "created_utc": 1584725457.0,
                                    "replies": [
                                        {
                                            "body": "I guess it really depends on how much he likes her company.",
                                            "author": "ruphun",
                                            "id": "fl1cq73",
                                            "parent_id": "t1_fl1b0jb",
                                            "score": 7,
                                            "created_utc": 1584726413.0,
                                            "replies": [
                                                {
                                                    "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
                                                    "author": "AFSMSgt",
                                                    "id": "fl1o36g",
                                                    "parent_id": "t1_fl1cq73",
                                                    "score": 14,
                                                    "created_utc": 1584732825.0,
                                                    "replies": [
                                                        {
                                                            "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                                                            "author": "callmeDonatella",
                                                            "id": "fl1ujdw",
                                                            "parent_id": "t1_fl1o36g",
                                                            "score": 4,
                                                            "created_utc": 1584736594.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "👍🏻",
                                                            "author": "ruphun",
                                                            "id": "fl1pdt0",
                                                            "parent_id": "t1_fl1o36g",
                                                            "score": 0,
                                                            "created_utc": 1584733568.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "A dream",
                            "author": "omgharper",
                            "id": "fl27dov",
                            "parent_id": "t1_fl12cwa",
                            "score": 0,
                            "created_utc": 1584744592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fn6ryvc",
            "parent_id": "t1_fl0xg6p",
            "score": 1,
            "created_utc": 1586706166.0,
            "replies": []
        },
        {
            "body": "Facts lol",
            "author": null,
            "id": "fl2fm3n",
            "parent_id": "t1_fl26j7c",
            "score": 3,
            "created_utc": 1584749897.0,
            "replies": []
        },
        {
            "body": "Sure, crawl in a hole, preserve your life. The only time you have is now, the future is unknown. The statistics of the situation are clear. You are more likely to die in an auto accident.",
            "author": "ontherdagn",
            "id": "fl2lrjz",
            "parent_id": "t1_fl26j7c",
            "score": -3,
            "created_utc": 1584754056.0,
            "replies": [
                {
                    "body": "It’s not just about yourself you know!",
                    "author": null,
                    "id": "fl2tgv4",
                    "parent_id": "t1_fl2lrjz",
                    "score": 3,
                    "created_utc": 1584759476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ewe",
            "author": "FrankyAllDay",
            "id": "fl38owm",
            "parent_id": "t1_fl1tmlv",
            "score": 3,
            "created_utc": 1584772948.0,
            "replies": [
                {
                    "body": "🐑",
                    "author": "lakoreanita",
                    "id": "fl3uhyc",
                    "parent_id": "t1_fl38owm",
                    "score": 6,
                    "created_utc": 1584798638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Difference is one needs one, more than the other does. Learn to lie or remotely fake it, because people get quite upset when they’re dismissed for being robotic and fake.",
            "author": "SESD1",
            "id": "fl3f875",
            "parent_id": "t1_fl1tmlv",
            "score": 2,
            "created_utc": 1584781136.0,
            "replies": []
        },
        {
            "body": "That is completely untrue. Sure every SR is different but for most of us our feelings for one another are very much real. And not paid for.\n\nI specifically held out for a real connection because I **didn't** want that kind of arrangement. I wanted an SR with someone that we built a genuine friendship and love for each other. I only wanted someone who was supporting me because they care for me and want to look after me in multiple capacities.\n\nThe love is still there even if the money isn't.",
            "author": "Dressedtokillxxx",
            "id": "fl241u0",
            "parent_id": "t1_fl1tmlv",
            "score": 7,
            "created_utc": 1584742459.0,
            "replies": [
                {
                    "body": "I disagree that what I said is completely untrue. It may not be like that for you or for me but it doesn't make it untrue.",
                    "author": "nellybelle1984",
                    "id": "fl24cnc",
                    "parent_id": "t1_fl241u0",
                    "score": 10,
                    "created_utc": 1584742652.0,
                    "replies": [
                        {
                            "body": "NellyB certainly hits some common characteristics of many sugar relationships.",
                            "author": "pinotandsugar",
                            "id": "fl2quxa",
                            "parent_id": "t1_fl24cnc",
                            "score": 5,
                            "created_utc": 1584757599.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol exactly!",
            "author": "Throwaway9480411",
            "id": "fmr17s7",
            "parent_id": "t1_fl1tmlv",
            "score": 1,
            "created_utc": 1586311531.0,
            "replies": []
        },
        {
            "body": "Is it really blatantly obvious ?\n\nOr do some women actually care about the men they sleep with..?  Not all women that sugar date are using their SD like a ATM. Some actually care and develop real feelings.",
            "author": "ruphun",
            "id": "fl1vaky",
            "parent_id": "t1_fl1tmlv",
            "score": 0,
            "created_utc": 1584737041.0,
            "replies": [
                {
                    "body": "No shit. I know that, I'm one that happens to care but it doesn't mean I'm blind to the reality of how things work in the bowl. However, starting out, it's based on the looks of the SB and the money the SD has. Never said it was wrong , just pointing it out. Why do most of you become so touchy about it ? And my confusion is valid. It's a good discussion topic. I like to break things down and get deep into the working parts. It's interesting.",
                    "author": "nellybelle1984",
                    "id": "fl1vtfg",
                    "parent_id": "t1_fl1vaky",
                    "score": 15,
                    "created_utc": 1584737353.0,
                    "replies": [
                        {
                            "body": "You're right, it is interesting, it is the dilemma we find ourselves in. We all want to be wanted for us. We forget that part of us is the resources we can supply (SD) or the beauty, sex appeal, connectedness, and seeming affection we can provide (SB). It really is very like any relationship, including marriage. When we are worth more dead or divorced, we pose a challenge to the recipient of our resources. We remain satisfied only when we think we are desired for the right reasons by those we desire.",
                            "author": "ontherdagn",
                            "id": "fl2lhm4",
                            "parent_id": "t1_fl1vtfg",
                            "score": 6,
                            "created_utc": 1584753870.0,
                            "replies": []
                        },
                        {
                            "body": "Start another thread nelly. I too would like to discuss this topic in depth. I know why I got into the bowl initially and why I stay in after a couple of disappointing SR's. Now I am not sure why I have even one SB much less three.",
                            "author": "AFSMSgt",
                            "id": "fl2l7q0",
                            "parent_id": "t1_fl1vtfg",
                            "score": 1,
                            "created_utc": 1584753682.0,
                            "replies": []
                        },
                        {
                            "body": "> it's based on the looks of the SB and the money the SD has.\n\nI was involved in sugar relationships when you were probably focused on your multiplication tables ( just a guess) .  Over about a decade and a half , for me it has become  about the whole SB - appearance, intelligence, character and of course SENSUALITY ... The SB's who hung out with Hugh Hefner and were models or actresses were perhaps the most \"looks generating when we were out\"   but generally intellectually and value  vacuous, not to mention sensually mechanized to run through the satisfaction program before shutting down and looking for the allowance before offering a hasty goodnight . (see you  when the rent's due)\n\nThe SB's whom I still hear from today preferred the Navajo Turquoise from around Taos to  stuff from Beverly Hills,  flyfishing in Oregon over clubbing in Hollywood, to discuss classic lit over today's Hollywood tales or lunch at Catalina's airport to shopping in Beverly Hills. \n\nOne of the greatest mistakes most newer SB's make is not defining whom the are and pursuing SD who match that profile.\n\nResponding to NB , most all of the SB's I have had over well over a decade have been attractive .  However, those selected primarily on the basis of looks and lust have been the shortest relationships",
                            "author": "pinotandsugar",
                            "id": "fl2sey6",
                            "parent_id": "t1_fl1vtfg",
                            "score": 1,
                            "created_utc": 1584758702.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I would drop the first 2 so fast.\n\nSo fast they'd get vertigo.",
            "author": "pintodinosaur",
            "id": "fl1qnk1",
            "parent_id": "t1_fl0z8sr",
            "score": 2,
            "created_utc": 1584734299.0,
            "replies": [
                {
                    "body": "HAHHAAA 🤣🤣🤣🤣🤣🤣🤣",
                    "author": "maybeimyourgirl",
                    "id": "fl1xymx",
                    "parent_id": "t1_fl1qnk1",
                    "score": 1,
                    "created_utc": 1584738650.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl2iin8",
            "parent_id": "t1_fl27dty",
            "score": 9,
            "created_utc": 1584751831.0,
            "replies": [
                {
                    "body": "my feelings for my SB's were not germane.",
                    "author": "AFSMSgt",
                    "id": "fl2lm81",
                    "parent_id": "t1_fl2iin8",
                    "score": -2,
                    "created_utc": 1584753955.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fl2nxs0",
                            "parent_id": "t1_fl2lm81",
                            "score": 6,
                            "created_utc": 1584755548.0,
                            "replies": [
                                {
                                    "body": "I don’t get it. So his feelings for them aren’t genuine, but expects their feelings for him to be genuine?",
                                    "author": "RussianAsshole",
                                    "id": "fl3hfx1",
                                    "parent_id": "t1_fl2nxs0",
                                    "score": 7,
                                    "created_utc": 1584784123.0,
                                    "replies": [
                                        {
                                            "body": "I said germane, didn't matter to the comment. I do genuinely care for each of these women",
                                            "author": "AFSMSgt",
                                            "id": "fl3jm9h",
                                            "parent_id": "t1_fl3hfx1",
                                            "score": 1,
                                            "created_utc": 1584787059.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That's obvious.  Did you ever air your feelings to #1 or #2? Tell them it hurt your feelings that they didn't ask how you-someone safely tucked away with resources-was doing?  It is perfectly natural in a time of crisis for someone who may just barely be treading water to be concerned about their survival.\n\nJust look at you.  No mention or thought to how cutting off #1 or #2 would effect these women but you expect their top concern to be your health...when you led with how healthy you are.\n\nThis forum holds SB's to ridiculous standards.  They are expected to behave like a devoted wife of gf while an SD can act like the worst kind of employer.",
                            "author": "sugarsenior",
                            "id": "fl5e89j",
                            "parent_id": "t1_fl2lm81",
                            "score": 3,
                            "created_utc": 1584834664.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well if I am their employer then only #3 is looking out for the future of the company, me. If I go tits up i.e. succumb to the virus then they are all out of a job. #3 seems to understand that her livelihood depends on keeping the company healthy.",
            "author": "AFSMSgt",
            "id": "fl2ml6y",
            "parent_id": "t1_fl2beqm",
            "score": 7,
            "created_utc": 1584754623.0,
            "replies": [
                {
                    "body": "Quick question: did you ask them how they were doing? Did they loose their day job? do they have any family member that went unemployed? Are they sick? \n\nPeople cope with stressful situations in different ways. #1 and #2 might not have asked about your health because they have stressful situations happening in their own life. A normal employer in these circumstances would give their workers with support. The life of many have been turned upside down. A normal employer would not be nagging the workers in these hard times. have empathy for your workers.\n\nTo me it looks like you  want a gf experience without giving a bf experience back or paying extra to get the bf experience. I also think you might be down on cash and are likely just looking on an excuse to dump #1 and 2, while looking cool. \n\ni think we all need to have more empathy. Also if you can't support 3 sugar babies just be upfront about it. No need to find lame excuses.",
                    "author": "LittleSugarBrat",
                    "id": "fl30c04",
                    "parent_id": "t1_fl2ml6y",
                    "score": 7,
                    "created_utc": 1584764835.0,
                    "replies": [
                        {
                            "body": "I also noticed I wished you were healthy and well. You did not wish me good health in the middl of the pandemia :'(\n\nI bet you likely also did not ask your sugar babies how they were doing.  It is a crisis. We are all living trauma. We need t have empathy with each other.",
                            "author": "LittleSugarBrat",
                            "id": "fl30tt0",
                            "parent_id": "t1_fl30c04",
                            "score": 5,
                            "created_utc": 1584765255.0,
                            "replies": [
                                {
                                    "body": "in fact, I sent each an extra allowance and asked if they and their family were well and if they needed anything thy should ask.",
                                    "author": "AFSMSgt",
                                    "id": "fl3jub6",
                                    "parent_id": "t1_fl30tt0",
                                    "score": 2,
                                    "created_utc": 1584787357.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course things are crazy, but in less time than it took to demand that he should \"drop other SBs\" so she can get paid, #1 could have at the _very least_ asked how OP was doing, especially considering he's vulnerable.\n\nIt's not hard, nor unreasonable to expect. There's no excuse for her behavior, \"trying times\" or not.",
            "author": "SDinMD",
            "id": "fl1biu6",
            "parent_id": "t1_fl17m79",
            "score": 9,
            "created_utc": 1584725741.0,
            "replies": [
                {
                    "body": "I agree with you in principle.",
                    "author": null,
                    "id": "fl1dwq2",
                    "parent_id": "t1_fl1biu6",
                    "score": 1,
                    "created_utc": 1584727071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How do you reward someone for being a basic, caring human being?. Is money enough?",
            "author": "AFSMSgt",
            "id": "fl1orih",
            "parent_id": "t1_fl17m79",
            "score": 6,
            "created_utc": 1584733214.0,
            "replies": [
                {
                    "body": "By knowing what they want from life and helping them with those milestones. Positive affirmation, encouragement, enablement, being there when they need you -- money is just an enabler to make these happen.",
                    "author": null,
                    "id": "fl1ra5t",
                    "parent_id": "t1_fl1orih",
                    "score": 8,
                    "created_utc": 1584734658.0,
                    "replies": [
                        {
                            "body": "Good answer. You are so right.",
                            "author": "AFSMSgt",
                            "id": "fl1sq0t",
                            "parent_id": "t1_fl1ra5t",
                            "score": 6,
                            "created_utc": 1584735508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Grandpa!  He is only 70 and runs 30x more than me a week.",
            "author": null,
            "id": "fl26pgo",
            "parent_id": "t1_fl1nikw",
            "score": 2,
            "created_utc": 1584744158.0,
            "replies": [
                {
                    "body": "73 actually but I lie and say 71 :-)",
                    "author": "AFSMSgt",
                    "id": "fl2lcfj",
                    "parent_id": "t1_fl26pgo",
                    "score": 2,
                    "created_utc": 1584753771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is exactly what I was thinking as well",
            "author": "Cledaddy23",
            "id": "fl43x4i",
            "parent_id": "t1_fl2nsia",
            "score": 1,
            "created_utc": 1584805339.0,
            "replies": []
        },
        {
            "body": "I am leaning in that direction. Maybe not the will, shit I might live another 10 years, but I am thinking trust fund.",
            "author": "AFSMSgt",
            "id": "fl1ozyn",
            "parent_id": "t1_fl1m53t",
            "score": 10,
            "created_utc": 1584733349.0,
            "replies": [
                {
                    "body": "#3 is the kind of sb we are all looking for. A real good woman. Im serious man. Take care of her.",
                    "author": "dade_murphy1",
                    "id": "fl2tcqx",
                    "parent_id": "t1_fl1ozyn",
                    "score": 2,
                    "created_utc": 1584759393.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes😍",
            "author": null,
            "id": "fl2foym",
            "parent_id": "t1_fl1sihw",
            "score": 5,
            "created_utc": 1584749950.0,
            "replies": []
        },
        {
            "body": "stfu?",
            "author": "AFSMSgt",
            "id": "fl1vgop",
            "parent_id": "t1_fl1sihw",
            "score": 2,
            "created_utc": 1584737142.0,
            "replies": [
                {
                    "body": "lol yes Senior Master Sergeant! STFU!",
                    "author": "UnkleKrampusKids",
                    "id": "fl1wslg",
                    "parent_id": "t1_fl1vgop",
                    "score": 5,
                    "created_utc": 1584737937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Little tits matter! #littletittiesmattermovement",
            "author": "artgonelive",
            "id": "fl1u18g",
            "parent_id": "t1_fl1l981",
            "score": 6,
            "created_utc": 1584736291.0,
            "replies": [
                {
                    "body": "Yay little titties!!!!",
                    "author": "Life_b_beautiful",
                    "id": "fl2bags",
                    "parent_id": "t1_fl1u18g",
                    "score": 2,
                    "created_utc": 1584747091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\#1",
            "author": "AFSMSgt",
            "id": "fl1oh8r",
            "parent_id": "t1_fl1l981",
            "score": 4,
            "created_utc": 1584733052.0,
            "replies": [
                {
                    "body": ">\\#1\n\nCould've figured out that one lol",
                    "author": "pintodinosaur",
                    "id": "fl1qtfn",
                    "parent_id": "t1_fl1oh8r",
                    "score": 5,
                    "created_utc": 1584734395.0,
                    "replies": []
                },
                {
                    "body": "There is your answer! LOL",
                    "author": "FredCouplesBaby",
                    "id": "fl1p083",
                    "parent_id": "t1_fl1oh8r",
                    "score": 0,
                    "created_utc": 1584733353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. Sure we (SD's) are in a financial arrangement and the money matters to both of us, but I am with my babies because I care about them and their wellbeing and expect some of that in return. It's not just the sex, I can get that anywhere, anytime for a small fraction of what I give my babies. I genuinely like these woman. Or I did.",
            "author": "AFSMSgt",
            "id": "fl1vxmb",
            "parent_id": "t1_fl1tu3o",
            "score": 3,
            "created_utc": 1584737423.0,
            "replies": [
                {
                    "body": "For sure, I definitely am aware of the fact that this is affecting my SD's health potentially, his business, and his stocks. I'm very sorry for that fact and just trying to be there for him as a friend. He's taking it in stride though like the cool motherfucker he is. :)\n\nHope it works out for you guys.",
                    "author": "artgonelive",
                    "id": "fl1xzlj",
                    "parent_id": "t1_fl1vxmb",
                    "score": 3,
                    "created_utc": 1584738668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a connection with each. But times have been good and I was able to be a financial help to each. But true colors are starting to emerge and I am not liking all that I see. It's easy to be a good SB or SD in good times, it the times like this that make the difference. Just my opinion.",
            "author": "AFSMSgt",
            "id": "fl1phih",
            "parent_id": "t1_fl1cyf7",
            "score": 3,
            "created_utc": 1584733628.0,
            "replies": []
        },
        {
            "body": "God bro, you are such a fucking troll.\n\nSomebody ban this fool already. 🙄\nLike every other sub you troll in has",
            "author": "Dressedtokillxxx",
            "id": "fl23jnc",
            "parent_id": "t1_fl1w8qa",
            "score": 7,
            "created_utc": 1584742134.0,
            "replies": []
        },
        {
            "body": "At this point, I really would 100% take this all at face value.  I'd give #3 full credit and reward her for it, I'd hold #1 and #2 accountable for their behavior (in whatever way you think is fair).  Not worth worrying about what-if's that you can't prove either way (yet)",
            "author": "Azurecole",
            "id": "fl1otey",
            "parent_id": "t1_fl1obry",
            "score": 17,
            "created_utc": 1584733246.0,
            "replies": []
        },
        {
            "body": "OP,  I know your emotions are high and you probably think only #3 has your best interest at heart, however I would advice you to take things slow. Game masters are so good that you won't know the hand they're playing. When I read you post, what jumped at me is that you're probably being played using the simplest trick in the book & I'm not normally a cynic.  So unlike others saying to dump the others, my advice is the opposite. Take things slow and keep watching.",
            "author": "PioneerExperience",
            "id": "fl2ibcl",
            "parent_id": "t1_fl1obry",
            "score": 10,
            "created_utc": 1584751693.0,
            "replies": []
        },
        {
            "body": "You really think we do?",
            "author": "ontherdagn",
            "id": "fl2kggu",
            "parent_id": "t1_fl2ii21",
            "score": -2,
            "created_utc": 1584753157.0,
            "replies": [
                {
                    "body": "Yes",
                    "author": "PioneerExperience",
                    "id": "fl4ocxs",
                    "parent_id": "t1_fl2kggu",
                    "score": 1,
                    "created_utc": 1584817830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\#1 is playing tic tac toe.  #3 is playing chess -- and she's at least master level :)\n\nI am half-kidding, no reason to think everyone isn't going with their heart.  But only half kidding, since even if #1 feels like she's in a panic over her allowance, she should realize this isn't the right way to show it",
            "author": "Azurecole",
            "id": "fl13ccw",
            "parent_id": "t1_fl12e0x",
            "score": 15,
            "created_utc": 1584721197.0,
            "replies": [
                {
                    "body": "Exactly. Most likely all these women spoke from their heart. 1 was looking out for herself and 3 was more concerned with her SD even if she was thinking long term.\n\n\nNumber 1 should be offering help and be looking for ways to make herself be more  beneficial to her SD, not looking for ways for her SD to save money to afford her allowance.",
                    "author": "ruphun",
                    "id": "fl1644s",
                    "parent_id": "t1_fl13ccw",
                    "score": 9,
                    "created_utc": 1584722731.0,
                    "replies": [
                        {
                            "body": "Yep, allowance, at least for me, is not just a financial investment in the relationship, it's not something I even remotely consider if there isn't already considerable emotional investment.  And if there is, this the kind of event where being emotionally invested should come out strongly",
                            "author": "Azurecole",
                            "id": "fl16gv9",
                            "parent_id": "t1_fl1644s",
                            "score": 2,
                            "created_utc": 1584722929.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Shit OP is old, number 3 seems to be most caring, why not wife the shit out of her and put her in your Will? ;)\n\nKidding\n\nBut I'd go with number 3 for sure!",
            "author": "BigBearSD",
            "id": "fl12cwa",
            "parent_id": "t1_fl128ym",
            "score": 47,
            "created_utc": 1584720642.0,
            "replies": [
                {
                    "body": ">Shit OP is old\n\nLMAO",
                    "author": "pintodinosaur",
                    "id": "fl1qkhr",
                    "parent_id": "t1_fl12cwa",
                    "score": 21,
                    "created_utc": 1584734251.0,
                    "replies": []
                },
                {
                    "body": "She’s SGF material for sure!\n\nI would downgrade number 1 from allowance to PPM 😈",
                    "author": "ruphun",
                    "id": "fl16a3e",
                    "parent_id": "t1_fl12cwa",
                    "score": 10,
                    "created_utc": 1584722825.0,
                    "replies": [
                        {
                            "body": "PPM? #1 gets downgraded to ex-POT status.",
                            "author": "SDinMD",
                            "id": "fl1b0jb",
                            "parent_id": "t1_fl16a3e",
                            "score": 11,
                            "created_utc": 1584725457.0,
                            "replies": [
                                {
                                    "body": "I guess it really depends on how much he likes her company.",
                                    "author": "ruphun",
                                    "id": "fl1cq73",
                                    "parent_id": "t1_fl1b0jb",
                                    "score": 7,
                                    "created_utc": 1584726413.0,
                                    "replies": [
                                        {
                                            "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
                                            "author": "AFSMSgt",
                                            "id": "fl1o36g",
                                            "parent_id": "t1_fl1cq73",
                                            "score": 14,
                                            "created_utc": 1584732825.0,
                                            "replies": [
                                                {
                                                    "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                                                    "author": "callmeDonatella",
                                                    "id": "fl1ujdw",
                                                    "parent_id": "t1_fl1o36g",
                                                    "score": 4,
                                                    "created_utc": 1584736594.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "👍🏻",
                                                    "author": "ruphun",
                                                    "id": "fl1pdt0",
                                                    "parent_id": "t1_fl1o36g",
                                                    "score": 0,
                                                    "created_utc": 1584733568.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A dream",
                    "author": "omgharper",
                    "id": "fl27dov",
                    "parent_id": "t1_fl12cwa",
                    "score": 0,
                    "created_utc": 1584744592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not just about yourself you know!",
            "author": null,
            "id": "fl2tgv4",
            "parent_id": "t1_fl2lrjz",
            "score": 3,
            "created_utc": 1584759476.0,
            "replies": []
        },
        {
            "body": "🐑",
            "author": "lakoreanita",
            "id": "fl3uhyc",
            "parent_id": "t1_fl38owm",
            "score": 6,
            "created_utc": 1584798638.0,
            "replies": []
        },
        {
            "body": "I disagree that what I said is completely untrue. It may not be like that for you or for me but it doesn't make it untrue.",
            "author": "nellybelle1984",
            "id": "fl24cnc",
            "parent_id": "t1_fl241u0",
            "score": 10,
            "created_utc": 1584742652.0,
            "replies": [
                {
                    "body": "NellyB certainly hits some common characteristics of many sugar relationships.",
                    "author": "pinotandsugar",
                    "id": "fl2quxa",
                    "parent_id": "t1_fl24cnc",
                    "score": 5,
                    "created_utc": 1584757599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No shit. I know that, I'm one that happens to care but it doesn't mean I'm blind to the reality of how things work in the bowl. However, starting out, it's based on the looks of the SB and the money the SD has. Never said it was wrong , just pointing it out. Why do most of you become so touchy about it ? And my confusion is valid. It's a good discussion topic. I like to break things down and get deep into the working parts. It's interesting.",
            "author": "nellybelle1984",
            "id": "fl1vtfg",
            "parent_id": "t1_fl1vaky",
            "score": 15,
            "created_utc": 1584737353.0,
            "replies": [
                {
                    "body": "You're right, it is interesting, it is the dilemma we find ourselves in. We all want to be wanted for us. We forget that part of us is the resources we can supply (SD) or the beauty, sex appeal, connectedness, and seeming affection we can provide (SB). It really is very like any relationship, including marriage. When we are worth more dead or divorced, we pose a challenge to the recipient of our resources. We remain satisfied only when we think we are desired for the right reasons by those we desire.",
                    "author": "ontherdagn",
                    "id": "fl2lhm4",
                    "parent_id": "t1_fl1vtfg",
                    "score": 6,
                    "created_utc": 1584753870.0,
                    "replies": []
                },
                {
                    "body": "Start another thread nelly. I too would like to discuss this topic in depth. I know why I got into the bowl initially and why I stay in after a couple of disappointing SR's. Now I am not sure why I have even one SB much less three.",
                    "author": "AFSMSgt",
                    "id": "fl2l7q0",
                    "parent_id": "t1_fl1vtfg",
                    "score": 1,
                    "created_utc": 1584753682.0,
                    "replies": []
                },
                {
                    "body": "> it's based on the looks of the SB and the money the SD has.\n\nI was involved in sugar relationships when you were probably focused on your multiplication tables ( just a guess) .  Over about a decade and a half , for me it has become  about the whole SB - appearance, intelligence, character and of course SENSUALITY ... The SB's who hung out with Hugh Hefner and were models or actresses were perhaps the most \"looks generating when we were out\"   but generally intellectually and value  vacuous, not to mention sensually mechanized to run through the satisfaction program before shutting down and looking for the allowance before offering a hasty goodnight . (see you  when the rent's due)\n\nThe SB's whom I still hear from today preferred the Navajo Turquoise from around Taos to  stuff from Beverly Hills,  flyfishing in Oregon over clubbing in Hollywood, to discuss classic lit over today's Hollywood tales or lunch at Catalina's airport to shopping in Beverly Hills. \n\nOne of the greatest mistakes most newer SB's make is not defining whom the are and pursuing SD who match that profile.\n\nResponding to NB , most all of the SB's I have had over well over a decade have been attractive .  However, those selected primarily on the basis of looks and lust have been the shortest relationships",
                    "author": "pinotandsugar",
                    "id": "fl2sey6",
                    "parent_id": "t1_fl1vtfg",
                    "score": 1,
                    "created_utc": 1584758702.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HAHHAAA 🤣🤣🤣🤣🤣🤣🤣",
            "author": "maybeimyourgirl",
            "id": "fl1xymx",
            "parent_id": "t1_fl1qnk1",
            "score": 1,
            "created_utc": 1584738650.0,
            "replies": []
        },
        {
            "body": "my feelings for my SB's were not germane.",
            "author": "AFSMSgt",
            "id": "fl2lm81",
            "parent_id": "t1_fl2iin8",
            "score": -2,
            "created_utc": 1584753955.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fl2nxs0",
                    "parent_id": "t1_fl2lm81",
                    "score": 6,
                    "created_utc": 1584755548.0,
                    "replies": [
                        {
                            "body": "I don’t get it. So his feelings for them aren’t genuine, but expects their feelings for him to be genuine?",
                            "author": "RussianAsshole",
                            "id": "fl3hfx1",
                            "parent_id": "t1_fl2nxs0",
                            "score": 7,
                            "created_utc": 1584784123.0,
                            "replies": [
                                {
                                    "body": "I said germane, didn't matter to the comment. I do genuinely care for each of these women",
                                    "author": "AFSMSgt",
                                    "id": "fl3jm9h",
                                    "parent_id": "t1_fl3hfx1",
                                    "score": 1,
                                    "created_utc": 1584787059.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's obvious.  Did you ever air your feelings to #1 or #2? Tell them it hurt your feelings that they didn't ask how you-someone safely tucked away with resources-was doing?  It is perfectly natural in a time of crisis for someone who may just barely be treading water to be concerned about their survival.\n\nJust look at you.  No mention or thought to how cutting off #1 or #2 would effect these women but you expect their top concern to be your health...when you led with how healthy you are.\n\nThis forum holds SB's to ridiculous standards.  They are expected to behave like a devoted wife of gf while an SD can act like the worst kind of employer.",
                    "author": "sugarsenior",
                    "id": "fl5e89j",
                    "parent_id": "t1_fl2lm81",
                    "score": 3,
                    "created_utc": 1584834664.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Quick question: did you ask them how they were doing? Did they loose their day job? do they have any family member that went unemployed? Are they sick? \n\nPeople cope with stressful situations in different ways. #1 and #2 might not have asked about your health because they have stressful situations happening in their own life. A normal employer in these circumstances would give their workers with support. The life of many have been turned upside down. A normal employer would not be nagging the workers in these hard times. have empathy for your workers.\n\nTo me it looks like you  want a gf experience without giving a bf experience back or paying extra to get the bf experience. I also think you might be down on cash and are likely just looking on an excuse to dump #1 and 2, while looking cool. \n\ni think we all need to have more empathy. Also if you can't support 3 sugar babies just be upfront about it. No need to find lame excuses.",
            "author": "LittleSugarBrat",
            "id": "fl30c04",
            "parent_id": "t1_fl2ml6y",
            "score": 7,
            "created_utc": 1584764835.0,
            "replies": [
                {
                    "body": "I also noticed I wished you were healthy and well. You did not wish me good health in the middl of the pandemia :'(\n\nI bet you likely also did not ask your sugar babies how they were doing.  It is a crisis. We are all living trauma. We need t have empathy with each other.",
                    "author": "LittleSugarBrat",
                    "id": "fl30tt0",
                    "parent_id": "t1_fl30c04",
                    "score": 5,
                    "created_utc": 1584765255.0,
                    "replies": [
                        {
                            "body": "in fact, I sent each an extra allowance and asked if they and their family were well and if they needed anything thy should ask.",
                            "author": "AFSMSgt",
                            "id": "fl3jub6",
                            "parent_id": "t1_fl30tt0",
                            "score": 2,
                            "created_utc": 1584787357.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with you in principle.",
            "author": null,
            "id": "fl1dwq2",
            "parent_id": "t1_fl1biu6",
            "score": 1,
            "created_utc": 1584727071.0,
            "replies": []
        },
        {
            "body": "By knowing what they want from life and helping them with those milestones. Positive affirmation, encouragement, enablement, being there when they need you -- money is just an enabler to make these happen.",
            "author": null,
            "id": "fl1ra5t",
            "parent_id": "t1_fl1orih",
            "score": 8,
            "created_utc": 1584734658.0,
            "replies": [
                {
                    "body": "Good answer. You are so right.",
                    "author": "AFSMSgt",
                    "id": "fl1sq0t",
                    "parent_id": "t1_fl1ra5t",
                    "score": 6,
                    "created_utc": 1584735508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "73 actually but I lie and say 71 :-)",
            "author": "AFSMSgt",
            "id": "fl2lcfj",
            "parent_id": "t1_fl26pgo",
            "score": 2,
            "created_utc": 1584753771.0,
            "replies": []
        },
        {
            "body": "#3 is the kind of sb we are all looking for. A real good woman. Im serious man. Take care of her.",
            "author": "dade_murphy1",
            "id": "fl2tcqx",
            "parent_id": "t1_fl1ozyn",
            "score": 2,
            "created_utc": 1584759393.0,
            "replies": []
        },
        {
            "body": "lol yes Senior Master Sergeant! STFU!",
            "author": "UnkleKrampusKids",
            "id": "fl1wslg",
            "parent_id": "t1_fl1vgop",
            "score": 5,
            "created_utc": 1584737937.0,
            "replies": []
        },
        {
            "body": "Yay little titties!!!!",
            "author": "Life_b_beautiful",
            "id": "fl2bags",
            "parent_id": "t1_fl1u18g",
            "score": 2,
            "created_utc": 1584747091.0,
            "replies": []
        },
        {
            "body": ">\\#1\n\nCould've figured out that one lol",
            "author": "pintodinosaur",
            "id": "fl1qtfn",
            "parent_id": "t1_fl1oh8r",
            "score": 5,
            "created_utc": 1584734395.0,
            "replies": []
        },
        {
            "body": "There is your answer! LOL",
            "author": "FredCouplesBaby",
            "id": "fl1p083",
            "parent_id": "t1_fl1oh8r",
            "score": 0,
            "created_utc": 1584733353.0,
            "replies": []
        },
        {
            "body": "For sure, I definitely am aware of the fact that this is affecting my SD's health potentially, his business, and his stocks. I'm very sorry for that fact and just trying to be there for him as a friend. He's taking it in stride though like the cool motherfucker he is. :)\n\nHope it works out for you guys.",
            "author": "artgonelive",
            "id": "fl1xzlj",
            "parent_id": "t1_fl1vxmb",
            "score": 3,
            "created_utc": 1584738668.0,
            "replies": []
        },
        {
            "body": "Yes",
            "author": "PioneerExperience",
            "id": "fl4ocxs",
            "parent_id": "t1_fl2kggu",
            "score": 1,
            "created_utc": 1584817830.0,
            "replies": []
        },
        {
            "body": "Exactly. Most likely all these women spoke from their heart. 1 was looking out for herself and 3 was more concerned with her SD even if she was thinking long term.\n\n\nNumber 1 should be offering help and be looking for ways to make herself be more  beneficial to her SD, not looking for ways for her SD to save money to afford her allowance.",
            "author": "ruphun",
            "id": "fl1644s",
            "parent_id": "t1_fl13ccw",
            "score": 9,
            "created_utc": 1584722731.0,
            "replies": [
                {
                    "body": "Yep, allowance, at least for me, is not just a financial investment in the relationship, it's not something I even remotely consider if there isn't already considerable emotional investment.  And if there is, this the kind of event where being emotionally invested should come out strongly",
                    "author": "Azurecole",
                    "id": "fl16gv9",
                    "parent_id": "t1_fl1644s",
                    "score": 2,
                    "created_utc": 1584722929.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Shit OP is old\n\nLMAO",
            "author": "pintodinosaur",
            "id": "fl1qkhr",
            "parent_id": "t1_fl12cwa",
            "score": 21,
            "created_utc": 1584734251.0,
            "replies": []
        },
        {
            "body": "She’s SGF material for sure!\n\nI would downgrade number 1 from allowance to PPM 😈",
            "author": "ruphun",
            "id": "fl16a3e",
            "parent_id": "t1_fl12cwa",
            "score": 10,
            "created_utc": 1584722825.0,
            "replies": [
                {
                    "body": "PPM? #1 gets downgraded to ex-POT status.",
                    "author": "SDinMD",
                    "id": "fl1b0jb",
                    "parent_id": "t1_fl16a3e",
                    "score": 11,
                    "created_utc": 1584725457.0,
                    "replies": [
                        {
                            "body": "I guess it really depends on how much he likes her company.",
                            "author": "ruphun",
                            "id": "fl1cq73",
                            "parent_id": "t1_fl1b0jb",
                            "score": 7,
                            "created_utc": 1584726413.0,
                            "replies": [
                                {
                                    "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
                                    "author": "AFSMSgt",
                                    "id": "fl1o36g",
                                    "parent_id": "t1_fl1cq73",
                                    "score": 14,
                                    "created_utc": 1584732825.0,
                                    "replies": [
                                        {
                                            "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                                            "author": "callmeDonatella",
                                            "id": "fl1ujdw",
                                            "parent_id": "t1_fl1o36g",
                                            "score": 4,
                                            "created_utc": 1584736594.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "👍🏻",
                                            "author": "ruphun",
                                            "id": "fl1pdt0",
                                            "parent_id": "t1_fl1o36g",
                                            "score": 0,
                                            "created_utc": 1584733568.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A dream",
            "author": "omgharper",
            "id": "fl27dov",
            "parent_id": "t1_fl12cwa",
            "score": 0,
            "created_utc": 1584744592.0,
            "replies": []
        },
        {
            "body": "NellyB certainly hits some common characteristics of many sugar relationships.",
            "author": "pinotandsugar",
            "id": "fl2quxa",
            "parent_id": "t1_fl24cnc",
            "score": 5,
            "created_utc": 1584757599.0,
            "replies": []
        },
        {
            "body": "You're right, it is interesting, it is the dilemma we find ourselves in. We all want to be wanted for us. We forget that part of us is the resources we can supply (SD) or the beauty, sex appeal, connectedness, and seeming affection we can provide (SB). It really is very like any relationship, including marriage. When we are worth more dead or divorced, we pose a challenge to the recipient of our resources. We remain satisfied only when we think we are desired for the right reasons by those we desire.",
            "author": "ontherdagn",
            "id": "fl2lhm4",
            "parent_id": "t1_fl1vtfg",
            "score": 6,
            "created_utc": 1584753870.0,
            "replies": []
        },
        {
            "body": "Start another thread nelly. I too would like to discuss this topic in depth. I know why I got into the bowl initially and why I stay in after a couple of disappointing SR's. Now I am not sure why I have even one SB much less three.",
            "author": "AFSMSgt",
            "id": "fl2l7q0",
            "parent_id": "t1_fl1vtfg",
            "score": 1,
            "created_utc": 1584753682.0,
            "replies": []
        },
        {
            "body": "> it's based on the looks of the SB and the money the SD has.\n\nI was involved in sugar relationships when you were probably focused on your multiplication tables ( just a guess) .  Over about a decade and a half , for me it has become  about the whole SB - appearance, intelligence, character and of course SENSUALITY ... The SB's who hung out with Hugh Hefner and were models or actresses were perhaps the most \"looks generating when we were out\"   but generally intellectually and value  vacuous, not to mention sensually mechanized to run through the satisfaction program before shutting down and looking for the allowance before offering a hasty goodnight . (see you  when the rent's due)\n\nThe SB's whom I still hear from today preferred the Navajo Turquoise from around Taos to  stuff from Beverly Hills,  flyfishing in Oregon over clubbing in Hollywood, to discuss classic lit over today's Hollywood tales or lunch at Catalina's airport to shopping in Beverly Hills. \n\nOne of the greatest mistakes most newer SB's make is not defining whom the are and pursuing SD who match that profile.\n\nResponding to NB , most all of the SB's I have had over well over a decade have been attractive .  However, those selected primarily on the basis of looks and lust have been the shortest relationships",
            "author": "pinotandsugar",
            "id": "fl2sey6",
            "parent_id": "t1_fl1vtfg",
            "score": 1,
            "created_utc": 1584758702.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fl2nxs0",
            "parent_id": "t1_fl2lm81",
            "score": 6,
            "created_utc": 1584755548.0,
            "replies": [
                {
                    "body": "I don’t get it. So his feelings for them aren’t genuine, but expects their feelings for him to be genuine?",
                    "author": "RussianAsshole",
                    "id": "fl3hfx1",
                    "parent_id": "t1_fl2nxs0",
                    "score": 7,
                    "created_utc": 1584784123.0,
                    "replies": [
                        {
                            "body": "I said germane, didn't matter to the comment. I do genuinely care for each of these women",
                            "author": "AFSMSgt",
                            "id": "fl3jm9h",
                            "parent_id": "t1_fl3hfx1",
                            "score": 1,
                            "created_utc": 1584787059.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's obvious.  Did you ever air your feelings to #1 or #2? Tell them it hurt your feelings that they didn't ask how you-someone safely tucked away with resources-was doing?  It is perfectly natural in a time of crisis for someone who may just barely be treading water to be concerned about their survival.\n\nJust look at you.  No mention or thought to how cutting off #1 or #2 would effect these women but you expect their top concern to be your health...when you led with how healthy you are.\n\nThis forum holds SB's to ridiculous standards.  They are expected to behave like a devoted wife of gf while an SD can act like the worst kind of employer.",
            "author": "sugarsenior",
            "id": "fl5e89j",
            "parent_id": "t1_fl2lm81",
            "score": 3,
            "created_utc": 1584834664.0,
            "replies": []
        },
        {
            "body": "I also noticed I wished you were healthy and well. You did not wish me good health in the middl of the pandemia :'(\n\nI bet you likely also did not ask your sugar babies how they were doing.  It is a crisis. We are all living trauma. We need t have empathy with each other.",
            "author": "LittleSugarBrat",
            "id": "fl30tt0",
            "parent_id": "t1_fl30c04",
            "score": 5,
            "created_utc": 1584765255.0,
            "replies": [
                {
                    "body": "in fact, I sent each an extra allowance and asked if they and their family were well and if they needed anything thy should ask.",
                    "author": "AFSMSgt",
                    "id": "fl3jub6",
                    "parent_id": "t1_fl30tt0",
                    "score": 2,
                    "created_utc": 1584787357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good answer. You are so right.",
            "author": "AFSMSgt",
            "id": "fl1sq0t",
            "parent_id": "t1_fl1ra5t",
            "score": 6,
            "created_utc": 1584735508.0,
            "replies": []
        },
        {
            "body": "Yep, allowance, at least for me, is not just a financial investment in the relationship, it's not something I even remotely consider if there isn't already considerable emotional investment.  And if there is, this the kind of event where being emotionally invested should come out strongly",
            "author": "Azurecole",
            "id": "fl16gv9",
            "parent_id": "t1_fl1644s",
            "score": 2,
            "created_utc": 1584722929.0,
            "replies": []
        },
        {
            "body": "PPM? #1 gets downgraded to ex-POT status.",
            "author": "SDinMD",
            "id": "fl1b0jb",
            "parent_id": "t1_fl16a3e",
            "score": 11,
            "created_utc": 1584725457.0,
            "replies": [
                {
                    "body": "I guess it really depends on how much he likes her company.",
                    "author": "ruphun",
                    "id": "fl1cq73",
                    "parent_id": "t1_fl1b0jb",
                    "score": 7,
                    "created_utc": 1584726413.0,
                    "replies": [
                        {
                            "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
                            "author": "AFSMSgt",
                            "id": "fl1o36g",
                            "parent_id": "t1_fl1cq73",
                            "score": 14,
                            "created_utc": 1584732825.0,
                            "replies": [
                                {
                                    "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                                    "author": "callmeDonatella",
                                    "id": "fl1ujdw",
                                    "parent_id": "t1_fl1o36g",
                                    "score": 4,
                                    "created_utc": 1584736594.0,
                                    "replies": []
                                },
                                {
                                    "body": "👍🏻",
                                    "author": "ruphun",
                                    "id": "fl1pdt0",
                                    "parent_id": "t1_fl1o36g",
                                    "score": 0,
                                    "created_utc": 1584733568.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t get it. So his feelings for them aren’t genuine, but expects their feelings for him to be genuine?",
            "author": "RussianAsshole",
            "id": "fl3hfx1",
            "parent_id": "t1_fl2nxs0",
            "score": 7,
            "created_utc": 1584784123.0,
            "replies": [
                {
                    "body": "I said germane, didn't matter to the comment. I do genuinely care for each of these women",
                    "author": "AFSMSgt",
                    "id": "fl3jm9h",
                    "parent_id": "t1_fl3hfx1",
                    "score": 1,
                    "created_utc": 1584787059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "in fact, I sent each an extra allowance and asked if they and their family were well and if they needed anything thy should ask.",
            "author": "AFSMSgt",
            "id": "fl3jub6",
            "parent_id": "t1_fl30tt0",
            "score": 2,
            "created_utc": 1584787357.0,
            "replies": []
        },
        {
            "body": "I guess it really depends on how much he likes her company.",
            "author": "ruphun",
            "id": "fl1cq73",
            "parent_id": "t1_fl1b0jb",
            "score": 7,
            "created_utc": 1584726413.0,
            "replies": [
                {
                    "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
                    "author": "AFSMSgt",
                    "id": "fl1o36g",
                    "parent_id": "t1_fl1cq73",
                    "score": 14,
                    "created_utc": 1584732825.0,
                    "replies": [
                        {
                            "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                            "author": "callmeDonatella",
                            "id": "fl1ujdw",
                            "parent_id": "t1_fl1o36g",
                            "score": 4,
                            "created_utc": 1584736594.0,
                            "replies": []
                        },
                        {
                            "body": "👍🏻",
                            "author": "ruphun",
                            "id": "fl1pdt0",
                            "parent_id": "t1_fl1o36g",
                            "score": 0,
                            "created_utc": 1584733568.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I said germane, didn't matter to the comment. I do genuinely care for each of these women",
            "author": "AFSMSgt",
            "id": "fl3jm9h",
            "parent_id": "t1_fl3hfx1",
            "score": 1,
            "created_utc": 1584787059.0,
            "replies": []
        },
        {
            "body": "I used to like her alot. Now, not so much. I changed from a kind old man into a $. Now problem to replace her POTs are coming out of the woodwork",
            "author": "AFSMSgt",
            "id": "fl1o36g",
            "parent_id": "t1_fl1cq73",
            "score": 14,
            "created_utc": 1584732825.0,
            "replies": [
                {
                    "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
                    "author": "callmeDonatella",
                    "id": "fl1ujdw",
                    "parent_id": "t1_fl1o36g",
                    "score": 4,
                    "created_utc": 1584736594.0,
                    "replies": []
                },
                {
                    "body": "👍🏻",
                    "author": "ruphun",
                    "id": "fl1pdt0",
                    "parent_id": "t1_fl1o36g",
                    "score": 0,
                    "created_utc": 1584733568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "#1 has to learn the value in you. Obviously she did something right to show you that she deserves an allowance. \n#3 sounds sweet but always be careful of the ones who are too sweet. Start things slow and she how she reacts, if things go well then I’m sure the two of you can figure out what makes the both of you satisfied. 😌 \n\nBest of luck 💞",
            "author": "callmeDonatella",
            "id": "fl1ujdw",
            "parent_id": "t1_fl1o36g",
            "score": 4,
            "created_utc": 1584736594.0,
            "replies": []
        },
        {
            "body": "👍🏻",
            "author": "ruphun",
            "id": "fl1pdt0",
            "parent_id": "t1_fl1o36g",
            "score": 0,
            "created_utc": 1584733568.0,
            "replies": []
        }
    ]
}