{
    "title": "RIP Dr. Droopy",
    "post_id": "cszq6t",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cszq6t/rip_dr_droopy/",
    "author": "TastySpermDispenser",
    "body": "Back in March, I was playing a game of strip peep jousting on a date with a SB.  For those of you who have never done peep jousting (you really need to live a little), peeps are a marshmallow candy, usually in the form of a bright yellow duck.  You can take two peeps, name them, and then stick toothpicks in them, facing each other like a \"joust\".  Put them in the microwave for 45 seconds, and the marshmallow expands wildly, causing them to \"charge\" each other. The first one to \"stab\" the other with his toothpick wins the joust.  You can bet on your peep, so naturally, a perfect strip-game.\n#\nSo it's late in the night, and I'm down to just my tie and my boxers.  I get this peep with a face that's kinda messed up. Like one eye is kind of down by his nose, so I figure this is a guy who has seen some shit. Surely, he knows how to stab people, and I name him \"Dr. Droopy.\"  Then I go all in - the rest of my clothes and two sake bombs. The joust starts and.... whelp. My boy goes down faster than a priest at a glory hole in an elementary school. Like 3 seconds in, he is on his face, with Sir Pokes-a-lot stabbing him unnecessarily and violently in the back. I admit, in shock, I said a lot of things about Dr. Droopy's family that I didn't mean. I am not going to track down his mom and \"give her the son she always wanted instead of a marshmallow stuffed with disappointment.\"  I would never do that to Dr. Droopy on purpose. \n#\nMy girl, on the other hand, is normally a real sweatheart. She is not, however, a gracious winner. She starts screaming. Four years of sugar dating, and that's the first and only time I've seen a girl actually orgasm. She starts twirling around my kitchen like she's having a dance off with invisible friends. Tbh, I didn't see most of it. I was checking my insurance to see if I was covered for injuries related to \"excessive twerking.\"  (FYI, I'm not covered. A week later, when I called my insurance agent to get me a policy in case I am ever overwhelmed by booty, he hung up on me. So guess which licensed insurance asshole is getting a little baby brother in a few months???)\n#\nI think about Dr. Droopy sometimes. At some level, aren't we all a little bit Droopy?  Don't we all have a moment in the spotlight/microwave bulb where we fall down and need help? Hits me right in the feels folks. \n#\nLast night, my SB and I were chilling at a bar and talking about our past dates.  Mainly trying to figure out why a cool girl like her keeps seeing a nerd like me. She brings up peep jousting and says \"you got so excited about that one peep. What was his name? Mr. Poopy?\"  She knows damn well what his name was, she was just spitting on Dr. Droopy's puffy corpse. So I start sobbing for my fallen brother. I can't let her think I'm crying over a marshmallow, so don't worry, I thought fast. I told her \"whew baby, they made my champagne extra spicy tonight.\" I think she bought it.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/cszq6t/rip_dr_droopy/",
    "score": 156,
    "upvote_ratio": 0.91,
    "created_utc": 1566311198.0,
    "num_comments": 45,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This has so many awesome elements, the story telling, the crazy-stupid, yet fun idea of peep jousting (which I checked on Google, is an actual thing known to at least a dozen nerds out there.  I love me some nerds, btw.)",
            "author": "NCtriadSD",
            "id": "exhsu6m",
            "parent_id": "t3_cszq6t",
            "score": 19,
            "created_utc": 1566313307.0,
            "replies": []
        },
        {
            "body": "You sir are one strange duck, but I like you! \n\nI totally imagined something else when you said peep jousting. I did think peeps were involved, but I thought maybe the most recent SB was male and you had peeps somehow on your penises and ran full tilt at eachother. Either way, whatever floats your boat! :P",
            "author": "BigBearSD",
            "id": "exhq0ds",
            "parent_id": "t3_cszq6t",
            "score": 27,
            "created_utc": 1566311412.0,
            "replies": [
                {
                    "body": "Ha ha, I think it's an east coast thing. Girls out have never heard of it.",
                    "author": "TastySpermDispenser",
                    "id": "exhrk5v",
                    "parent_id": "t1_exhq0ds",
                    "score": 7,
                    "created_utc": 1566312453.0,
                    "replies": [
                        {
                            "body": "I'm from the east coast and have never heard of it. Then again I am not a woman, last I checked! :P",
                            "author": "BigBearSD",
                            "id": "exhrvy6",
                            "parent_id": "t1_exhrk5v",
                            "score": 4,
                            "created_utc": 1566312672.0,
                            "replies": [
                                {
                                    "body": "Really? It was basically my childhood holiday activity. There are YouTube videos showing it, though fyi, my peep jousting soundtrack makes it 100% better than anything you see on the internet.",
                                    "author": "TastySpermDispenser",
                                    "id": "exhv76f",
                                    "parent_id": "t1_exhrvy6",
                                    "score": 5,
                                    "created_utc": 1566314901.0,
                                    "replies": [
                                        {
                                            "body": "Hahaha. Nope never heard of it.",
                                            "author": "BigBearSD",
                                            "id": "exhv8wg",
                                            "parent_id": "t1_exhv76f",
                                            "score": 2,
                                            "created_utc": 1566314933.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I need to meet someone like you.\n\nOur weirdness would be off the charts.",
            "author": "sugarhopeful",
            "id": "exhw8bp",
            "parent_id": "t3_cszq6t",
            "score": 7,
            "created_utc": 1566315600.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "exiztau",
            "parent_id": "t3_cszq6t",
            "score": 3,
            "created_utc": 1566338966.0,
            "replies": [
                {
                    "body": "We have known each other for a long time, so I hope you understand that I am only saying this with respect and love: You live on the wrong fucking continent.",
                    "author": "TastySpermDispenser",
                    "id": "exjcsmm",
                    "parent_id": "t1_exiztau",
                    "score": 5,
                    "created_utc": 1566347190.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "exk3yx0",
                            "parent_id": "t1_exjcsmm",
                            "score": 3,
                            "created_utc": 1566371798.0,
                            "replies": [
                                {
                                    "body": "Again, all due respect, but you guys don't even have good Mexican food. Now, how are you going to compare the vast selection of girly drinks offered in America to a place that doesn't have authentic margaritas?  Girl, if I sent you a prickly pear margarita, the very next day you would try to swim here.",
                                    "author": "TastySpermDispenser",
                                    "id": "exkw2fw",
                                    "parent_id": "t1_exk3yx0",
                                    "score": 3,
                                    "created_utc": 1566400291.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugar Peeps = SP",
            "author": "Xatness",
            "id": "exk9zkx",
            "parent_id": "t3_cszq6t",
            "score": 3,
            "created_utc": 1566380798.0,
            "replies": []
        },
        {
            "body": "You sir should write a book - or the script to a movie.\n\nFabulous. Absolutely hilarious!",
            "author": null,
            "id": "exhw4gc",
            "parent_id": "t3_cszq6t",
            "score": 5,
            "created_utc": 1566315528.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "exhwctn",
            "parent_id": "t3_cszq6t",
            "score": 4,
            "created_utc": 1566315686.0,
            "replies": [
                {
                    "body": "I did the same thing 🤣",
                    "author": "CentralUSGal",
                    "id": "exikh86",
                    "parent_id": "t1_exhwctn",
                    "score": 5,
                    "created_utc": 1566330162.0,
                    "replies": []
                },
                {
                    "body": "That’s too effing funny..!  Because I was thinking the same thing, I started reading this without seeing who posted it and two or three paragraphs in and I was like I got a scroll up and see if this is TSD, and sure enough 😂😂",
                    "author": "ruphun",
                    "id": "exhyspi",
                    "parent_id": "t1_exhwctn",
                    "score": 1,
                    "created_utc": 1566317299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[Bravissimo!](https://giphy.com/gifs/slow-clap-citizen-kane-GQnsaAWZ8ty00)",
            "author": "sdaddy305",
            "id": "exhq54f",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566311501.0,
            "replies": []
        },
        {
            "body": "Love the post! Very original and funny! But, I do have to ask a technical question.  How are there going to be all of these baby bros from anal?",
            "author": "SDforreal",
            "id": "exi1b00",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566318918.0,
            "replies": [
                {
                    "body": "Oh.... oh no!  I made a mistake. I guess \"close enough\" doesn't really work in biology class, huh?",
                    "author": "TastySpermDispenser",
                    "id": "exi35ea",
                    "parent_id": "t1_exi1b00",
                    "score": 3,
                    "created_utc": 1566320083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "and your new nickname is:\n\n&#x200B;\n\nMr Poopy...   Looking online for Peeps now",
            "author": "tankbinding",
            "id": "exibbz8",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566324834.0,
            "replies": [
                {
                    "body": "Yes... yes. My \"new\" nickname is that. Definitely didn't spend several school years answering to that name....",
                    "author": "TastySpermDispenser",
                    "id": "exibtb8",
                    "parent_id": "t1_exibbz8",
                    "score": 3,
                    "created_utc": 1566325113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This really made me appreciate the goody times i’ve had.",
            "author": "shampooi",
            "id": "exis2hj",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566334440.0,
            "replies": []
        },
        {
            "body": "I’m going to have peep jousting with my children now. They will thank you for this next time we find peeps at the store.",
            "author": null,
            "id": "exj27r7",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566340396.0,
            "replies": [
                {
                    "body": "Don't tell them the idea came from a guy named tasty sperm dispenser unless you set up a separate fund for therapy",
                    "author": "Teejaynj",
                    "id": "exjhk9i",
                    "parent_id": "t1_exj27r7",
                    "score": 5,
                    "created_utc": 1566350619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know this is random but did you make that post in r/AskMen about how many kindergartens people think they could take on? I immediately thought of you when I read it",
            "author": "SugarDavina",
            "id": "exj7s3v",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566343855.0,
            "replies": [
                {
                    "body": "That is a question I get a lot. I feel like it was a post here and not on askmen. But either way, I stand by my answer.",
                    "author": "TastySpermDispenser",
                    "id": "exjcodi",
                    "parent_id": "t1_exj7s3v",
                    "score": 1,
                    "created_utc": 1566347103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You, Sir, are a gentleman and an artist. That was so clever and fun. I’ll be over here on the non Peep jousting West Coast giggling to myself.",
            "author": null,
            "id": "exjf60u",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566348904.0,
            "replies": []
        },
        {
            "body": "You are really fucked up...but certainly a genius.",
            "author": "Teejaynj",
            "id": "exjh8nv",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566350390.0,
            "replies": []
        },
        {
            "body": "\"Mr Poppy's Guide To Successful Sugar Dating\"  ??",
            "author": "tankbinding",
            "id": "exjnah9",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566354841.0,
            "replies": []
        },
        {
            "body": "Why do you have to sugar? With your personality, you can get any girl!",
            "author": "SD_AU",
            "id": "exjqty7",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566357652.0,
            "replies": [
                {
                    "body": "We don't pay to get girls...we pay so they will leave in the morning.",
                    "author": "sdphilly",
                    "id": "exkz3p9",
                    "parent_id": "t1_exjqty7",
                    "score": 2,
                    "created_utc": 1566402426.0,
                    "replies": [
                        {
                            "body": "yes Mr. Sheen!",
                            "author": "SD_AU",
                            "id": "exnvmpb",
                            "parent_id": "t1_exkz3p9",
                            "score": 1,
                            "created_utc": 1566464469.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you shitting me TSD ...because you are funny as all hell....chicks dig laughing....so do guys, at least this guy...I am firmly convinced you could do stand up, write and maybe perform for SNL...some people just have a gift...you've got it Sir! pucking eh!?...NHL teams headed for training camp soon...your PSA by the PuckHead...let's go Hawk's let's go Sabres....St. Louis Blues reigning Cup holders...you have to be shitting me!!!",
            "author": "puckhead4",
            "id": "exk0te0",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566367607.0,
            "replies": [
                {
                    "body": "Ha ha ha, I have not figured out how to make peep hockey....yet. as soon as I do, you are getting a call.",
                    "author": "TastySpermDispenser",
                    "id": "exkw85n",
                    "parent_id": "t1_exk0te0",
                    "score": 1,
                    "created_utc": 1566400404.0,
                    "replies": [
                        {
                            "body": "Ya know I remember those things/candies and I use to be addicted to the damn things...but I learned from you Sir how to have fun with them in a very inventive way....Think the Tampa Bay Lightning will be prepared without any kind of \"how did we do so poorly after such a strong regular season...I wonder if that will be in their heads when the puck drops on the regular season...",
                            "author": "puckhead4",
                            "id": "exlho6h",
                            "parent_id": "t1_exkw85n",
                            "score": 2,
                            "created_utc": 1566413191.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am humbled by your kookiness. I once was like that but I became responsible or boring somehow. How do you do it? I bet your SBs love the dates. Very inspiring thank you. I really mean this sans the sarcasm.",
            "author": null,
            "id": "ey7jesj",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566885830.0,
            "replies": [
                {
                    "body": "Ha ha ha, I try to make myself entertaining at least. I am glad someone likes it. :)",
                    "author": "TastySpermDispenser",
                    "id": "ey824w0",
                    "parent_id": "t1_ey7jesj",
                    "score": 1,
                    "created_utc": 1566909123.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "BTW, if anybody is close to Westminster Maryland, there's an annual peep show in April (never been), and the Racine Art Museum (midway between Chicago and Milwaukee)  also has a peep exhibit in April (have been, worth a few minutes).\n\nBig fan of peeps, thanks for sharing TSD",
            "author": "2fast-2curious",
            "id": "exhvmw4",
            "parent_id": "t3_cszq6t",
            "score": 3,
            "created_utc": 1566315195.0,
            "replies": [
                {
                    "body": "It's so fun!!! They create crazy stuff with those guys.",
                    "author": "iwantkitties",
                    "id": "exjk9an",
                    "parent_id": "t1_exhvmw4",
                    "score": 1,
                    "created_utc": 1566352574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " I love you.  (no homo)",
            "author": null,
            "id": "exig70y",
            "parent_id": "t3_cszq6t",
            "score": 4,
            "created_utc": 1566327662.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "exi239v",
            "parent_id": "t3_cszq6t",
            "score": 2,
            "created_utc": 1566319422.0,
            "replies": [
                {
                    "body": "Uh oh. I didn't mean to imply that I regularly lose at peep jousting. Seriously, this is like my first loss in years. I've been so dominant at this, that one time, I had a woman use my safe word while my peep was next level murdering her peep. I stopped the microwave and then I was like. \"Wait... holy shit, how did my mom learn my safe word?\"",
                    "author": "TastySpermDispenser",
                    "id": "exi3k1m",
                    "parent_id": "t1_exi239v",
                    "score": 6,
                    "created_utc": 1566320334.0,
                    "replies": [
                        {
                            "body": "Lol’d for reals",
                            "author": "GulfCoastFlamingo",
                            "id": "exi5x90",
                            "parent_id": "t1_exi3k1m",
                            "score": 1,
                            "created_utc": 1566321715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the best thing I've ever read.",
            "author": "sugarintherawr",
            "id": "f2h8fwr",
            "parent_id": "t3_cszq6t",
            "score": 1,
            "created_utc": 1570240688.0,
            "replies": []
        },
        {
            "body": "Definitely taking some edibles and peep jousting with my bae this weekend at the cabin.",
            "author": "LotBuilder",
            "id": "exi4c01",
            "parent_id": "t3_cszq6t",
            "score": 1,
            "created_utc": 1566320803.0,
            "replies": []
        },
        {
            "body": "That was funny AF. Thank you for the read sir",
            "author": "TheMistressMan",
            "id": "exi6joy",
            "parent_id": "t3_cszq6t",
            "score": 1,
            "created_utc": 1566322073.0,
            "replies": []
        },
        {
            "body": "Ha ha, I think it's an east coast thing. Girls out have never heard of it.",
            "author": "TastySpermDispenser",
            "id": "exhrk5v",
            "parent_id": "t1_exhq0ds",
            "score": 7,
            "created_utc": 1566312453.0,
            "replies": [
                {
                    "body": "I'm from the east coast and have never heard of it. Then again I am not a woman, last I checked! :P",
                    "author": "BigBearSD",
                    "id": "exhrvy6",
                    "parent_id": "t1_exhrk5v",
                    "score": 4,
                    "created_utc": 1566312672.0,
                    "replies": [
                        {
                            "body": "Really? It was basically my childhood holiday activity. There are YouTube videos showing it, though fyi, my peep jousting soundtrack makes it 100% better than anything you see on the internet.",
                            "author": "TastySpermDispenser",
                            "id": "exhv76f",
                            "parent_id": "t1_exhrvy6",
                            "score": 5,
                            "created_utc": 1566314901.0,
                            "replies": [
                                {
                                    "body": "Hahaha. Nope never heard of it.",
                                    "author": "BigBearSD",
                                    "id": "exhv8wg",
                                    "parent_id": "t1_exhv76f",
                                    "score": 2,
                                    "created_utc": 1566314933.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We have known each other for a long time, so I hope you understand that I am only saying this with respect and love: You live on the wrong fucking continent.",
            "author": "TastySpermDispenser",
            "id": "exjcsmm",
            "parent_id": "t1_exiztau",
            "score": 5,
            "created_utc": 1566347190.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "exk3yx0",
                    "parent_id": "t1_exjcsmm",
                    "score": 3,
                    "created_utc": 1566371798.0,
                    "replies": [
                        {
                            "body": "Again, all due respect, but you guys don't even have good Mexican food. Now, how are you going to compare the vast selection of girly drinks offered in America to a place that doesn't have authentic margaritas?  Girl, if I sent you a prickly pear margarita, the very next day you would try to swim here.",
                            "author": "TastySpermDispenser",
                            "id": "exkw2fw",
                            "parent_id": "t1_exk3yx0",
                            "score": 3,
                            "created_utc": 1566400291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I did the same thing 🤣",
            "author": "CentralUSGal",
            "id": "exikh86",
            "parent_id": "t1_exhwctn",
            "score": 5,
            "created_utc": 1566330162.0,
            "replies": []
        },
        {
            "body": "That’s too effing funny..!  Because I was thinking the same thing, I started reading this without seeing who posted it and two or three paragraphs in and I was like I got a scroll up and see if this is TSD, and sure enough 😂😂",
            "author": "ruphun",
            "id": "exhyspi",
            "parent_id": "t1_exhwctn",
            "score": 1,
            "created_utc": 1566317299.0,
            "replies": []
        },
        {
            "body": "Oh.... oh no!  I made a mistake. I guess \"close enough\" doesn't really work in biology class, huh?",
            "author": "TastySpermDispenser",
            "id": "exi35ea",
            "parent_id": "t1_exi1b00",
            "score": 3,
            "created_utc": 1566320083.0,
            "replies": []
        },
        {
            "body": "Yes... yes. My \"new\" nickname is that. Definitely didn't spend several school years answering to that name....",
            "author": "TastySpermDispenser",
            "id": "exibtb8",
            "parent_id": "t1_exibbz8",
            "score": 3,
            "created_utc": 1566325113.0,
            "replies": []
        },
        {
            "body": "Don't tell them the idea came from a guy named tasty sperm dispenser unless you set up a separate fund for therapy",
            "author": "Teejaynj",
            "id": "exjhk9i",
            "parent_id": "t1_exj27r7",
            "score": 5,
            "created_utc": 1566350619.0,
            "replies": []
        },
        {
            "body": "That is a question I get a lot. I feel like it was a post here and not on askmen. But either way, I stand by my answer.",
            "author": "TastySpermDispenser",
            "id": "exjcodi",
            "parent_id": "t1_exj7s3v",
            "score": 1,
            "created_utc": 1566347103.0,
            "replies": []
        },
        {
            "body": "We don't pay to get girls...we pay so they will leave in the morning.",
            "author": "sdphilly",
            "id": "exkz3p9",
            "parent_id": "t1_exjqty7",
            "score": 2,
            "created_utc": 1566402426.0,
            "replies": [
                {
                    "body": "yes Mr. Sheen!",
                    "author": "SD_AU",
                    "id": "exnvmpb",
                    "parent_id": "t1_exkz3p9",
                    "score": 1,
                    "created_utc": 1566464469.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ha ha ha, I have not figured out how to make peep hockey....yet. as soon as I do, you are getting a call.",
            "author": "TastySpermDispenser",
            "id": "exkw85n",
            "parent_id": "t1_exk0te0",
            "score": 1,
            "created_utc": 1566400404.0,
            "replies": [
                {
                    "body": "Ya know I remember those things/candies and I use to be addicted to the damn things...but I learned from you Sir how to have fun with them in a very inventive way....Think the Tampa Bay Lightning will be prepared without any kind of \"how did we do so poorly after such a strong regular season...I wonder if that will be in their heads when the puck drops on the regular season...",
                    "author": "puckhead4",
                    "id": "exlho6h",
                    "parent_id": "t1_exkw85n",
                    "score": 2,
                    "created_utc": 1566413191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ha ha ha, I try to make myself entertaining at least. I am glad someone likes it. :)",
            "author": "TastySpermDispenser",
            "id": "ey824w0",
            "parent_id": "t1_ey7jesj",
            "score": 1,
            "created_utc": 1566909123.0,
            "replies": []
        },
        {
            "body": "It's so fun!!! They create crazy stuff with those guys.",
            "author": "iwantkitties",
            "id": "exjk9an",
            "parent_id": "t1_exhvmw4",
            "score": 1,
            "created_utc": 1566352574.0,
            "replies": []
        },
        {
            "body": "Uh oh. I didn't mean to imply that I regularly lose at peep jousting. Seriously, this is like my first loss in years. I've been so dominant at this, that one time, I had a woman use my safe word while my peep was next level murdering her peep. I stopped the microwave and then I was like. \"Wait... holy shit, how did my mom learn my safe word?\"",
            "author": "TastySpermDispenser",
            "id": "exi3k1m",
            "parent_id": "t1_exi239v",
            "score": 6,
            "created_utc": 1566320334.0,
            "replies": [
                {
                    "body": "Lol’d for reals",
                    "author": "GulfCoastFlamingo",
                    "id": "exi5x90",
                    "parent_id": "t1_exi3k1m",
                    "score": 1,
                    "created_utc": 1566321715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm from the east coast and have never heard of it. Then again I am not a woman, last I checked! :P",
            "author": "BigBearSD",
            "id": "exhrvy6",
            "parent_id": "t1_exhrk5v",
            "score": 4,
            "created_utc": 1566312672.0,
            "replies": [
                {
                    "body": "Really? It was basically my childhood holiday activity. There are YouTube videos showing it, though fyi, my peep jousting soundtrack makes it 100% better than anything you see on the internet.",
                    "author": "TastySpermDispenser",
                    "id": "exhv76f",
                    "parent_id": "t1_exhrvy6",
                    "score": 5,
                    "created_utc": 1566314901.0,
                    "replies": [
                        {
                            "body": "Hahaha. Nope never heard of it.",
                            "author": "BigBearSD",
                            "id": "exhv8wg",
                            "parent_id": "t1_exhv76f",
                            "score": 2,
                            "created_utc": 1566314933.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "exk3yx0",
            "parent_id": "t1_exjcsmm",
            "score": 3,
            "created_utc": 1566371798.0,
            "replies": [
                {
                    "body": "Again, all due respect, but you guys don't even have good Mexican food. Now, how are you going to compare the vast selection of girly drinks offered in America to a place that doesn't have authentic margaritas?  Girl, if I sent you a prickly pear margarita, the very next day you would try to swim here.",
                    "author": "TastySpermDispenser",
                    "id": "exkw2fw",
                    "parent_id": "t1_exk3yx0",
                    "score": 3,
                    "created_utc": 1566400291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yes Mr. Sheen!",
            "author": "SD_AU",
            "id": "exnvmpb",
            "parent_id": "t1_exkz3p9",
            "score": 1,
            "created_utc": 1566464469.0,
            "replies": []
        },
        {
            "body": "Ya know I remember those things/candies and I use to be addicted to the damn things...but I learned from you Sir how to have fun with them in a very inventive way....Think the Tampa Bay Lightning will be prepared without any kind of \"how did we do so poorly after such a strong regular season...I wonder if that will be in their heads when the puck drops on the regular season...",
            "author": "puckhead4",
            "id": "exlho6h",
            "parent_id": "t1_exkw85n",
            "score": 2,
            "created_utc": 1566413191.0,
            "replies": []
        },
        {
            "body": "Lol’d for reals",
            "author": "GulfCoastFlamingo",
            "id": "exi5x90",
            "parent_id": "t1_exi3k1m",
            "score": 1,
            "created_utc": 1566321715.0,
            "replies": []
        },
        {
            "body": "Really? It was basically my childhood holiday activity. There are YouTube videos showing it, though fyi, my peep jousting soundtrack makes it 100% better than anything you see on the internet.",
            "author": "TastySpermDispenser",
            "id": "exhv76f",
            "parent_id": "t1_exhrvy6",
            "score": 5,
            "created_utc": 1566314901.0,
            "replies": [
                {
                    "body": "Hahaha. Nope never heard of it.",
                    "author": "BigBearSD",
                    "id": "exhv8wg",
                    "parent_id": "t1_exhv76f",
                    "score": 2,
                    "created_utc": 1566314933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, all due respect, but you guys don't even have good Mexican food. Now, how are you going to compare the vast selection of girly drinks offered in America to a place that doesn't have authentic margaritas?  Girl, if I sent you a prickly pear margarita, the very next day you would try to swim here.",
            "author": "TastySpermDispenser",
            "id": "exkw2fw",
            "parent_id": "t1_exk3yx0",
            "score": 3,
            "created_utc": 1566400291.0,
            "replies": []
        },
        {
            "body": "Hahaha. Nope never heard of it.",
            "author": "BigBearSD",
            "id": "exhv8wg",
            "parent_id": "t1_exhv76f",
            "score": 2,
            "created_utc": 1566314933.0,
            "replies": []
        }
    ]
}