{
    "title": "Surprised at M&G",
    "post_id": "11xxsb6",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11xxsb6/surprised_at_mg/",
    "author": "Majestic_Hamster5953",
    "body": "I recently had a MG with a very young SB. She is only 19. We had chatted on Seeking, exchanged numbers, and had been texting for a week.\nThe meet was just for coffee and a conversation. It went well and ran almost 3 hours. And yes, I did compensate her for her time. That's just something I do with anyone I meet in this fashion.\n\nAs she was leaving, she handed me a small gift box, and asked that I didn't open it until she was gone.\nWhen I eventually looked inside there was a very nice pair of panties, and a note which read \"I hope to give you another pair before I turn 20\". Wow lol. A drop the mike moment.\nThat's as surprised  I have been at any MG.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11xxsb6/surprised_at_mg/",
    "score": 110,
    "upvote_ratio": 0.9,
    "created_utc": 1679439046.0,
    "num_comments": 75,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Love her.  Would definitely hire her for a sales role.  Very creative way to get the deal closed!\n\nAn SB I met through seeking asked me before the meet and greet to tell her exactly what to wear to the meet and greet.  She added that I should buy her a pair of panties and bring them to the M&G in a perfectly wrapped gift box inside a nice bag.  She said when you first see me and walk to the table, give me a kiss, and hand me the bag.  I will be wearing what you've asked for and no panties.  I'll go to the bathroom, open them, put them on and come back to the table.  Choose well.  And if you impress me at the M&G, you will get to see them on me that night.    \n\n\nThat all happened and I got to see them.  Turned out she was very wealthy, and this was just a fantasy of hers.  Five years later, living on different continents, we still text almost every day and I may see her in April again.",
            "author": "Adventurer2006",
            "id": "jd5krdr",
            "parent_id": "t3_11xxsb6",
            "score": 97,
            "created_utc": 1679443399.0,
            "replies": []
        },
        {
            "body": "Wow! I had a 19 year old SB and it was a fucking nightmare. \n\nGood luck though!",
            "author": "Significant-Fun-2146",
            "id": "jd5klpq",
            "parent_id": "t3_11xxsb6",
            "score": 41,
            "created_utc": 1679443328.0,
            "replies": [
                {
                    "body": "19 year olds are either the best or the worst SBs you’ve ever had",
                    "author": "RealisticSD",
                    "id": "jd5lzjk",
                    "parent_id": "t1_jd5klpq",
                    "score": 30,
                    "created_utc": 1679443940.0,
                    "replies": [
                        {
                            "body": ">19 year olds are either the best or the worst SBs you’ve ever had\n\nthis..! Ive primary sugar dated women 21 to 29, but my 19 year old SB was one of my best and favorite SB. Very emotionally mature, like a 30 year old, very intelligent and could converse for hours, yet so playful and fun still like someone her age. What we had was very genuine, sometimes spending whole weekends together. It was hard to believe there was over 25q+ years between us. The funny thing is, I never search on SA for under 21, I just happened to see her profile on SA main page as a new profile in my area. I was the 1st person she met off SA. Our meet and greet lasted 5 hours and was just platonic..! One of the best parts was, she initiated the 1st time we had sex on our 3rd date, and practically pushed me onto the bed ;)",
                            "author": "NickPfromYuma",
                            "id": "jd7mh68",
                            "parent_id": "t1_jd5lzjk",
                            "score": 12,
                            "created_utc": 1679489280.0,
                            "replies": [
                                {
                                    "body": "(burst into tears of envyness :-D)",
                                    "author": "SeekingInSydney",
                                    "id": "jdao45u",
                                    "parent_id": "t1_jd7mh68",
                                    "score": 3,
                                    "created_utc": 1679532966.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> As she was leaving, she handed me a small gift box, and asked that I didn't open it until she was gone. When I eventually looked inside there was a very nice pair of panties, and a note which read \"I hope to give you another pair before I turn 20\".\n\nThat is a bold and aggressive (and, IMO, impressive) move on her part. I'd date her just for her courage. lol",
            "author": "FLRAdvocate",
            "id": "jd5bc03",
            "parent_id": "t3_11xxsb6",
            "score": 34,
            "created_utc": 1679439450.0,
            "replies": [
                {
                    "body": "Hmmm. When I have gifted a pair of my boxers to a POT SB with a note \"I hope to give you another pair before I turn 50\" it never turned out so well. Hmmm.",
                    "author": "BinghamtonSD",
                    "id": "jd5ws2l",
                    "parent_id": "t1_jd5bc03",
                    "score": 53,
                    "created_utc": 1679448694.0,
                    "replies": [
                        {
                            "body": "Might have been the skid marks that did you in",
                            "author": "tc65681",
                            "id": "jd66ery",
                            "parent_id": "t1_jd5ws2l",
                            "score": 24,
                            "created_utc": 1679453128.0,
                            "replies": []
                        },
                        {
                            "body": "You definitely need to and report back /s",
                            "author": "superbad4life01",
                            "id": "jd61mco",
                            "parent_id": "t1_jd5ws2l",
                            "score": 2,
                            "created_utc": 1679450874.0,
                            "replies": []
                        },
                        {
                            "body": "😂 eeeeuuu creepy",
                            "author": "obenjab",
                            "id": "jd6e09v",
                            "parent_id": "t1_jd5ws2l",
                            "score": 0,
                            "created_utc": 1679457107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "SD Here.  I love the move.  Since most SRs turn sexual by date #2, I think it’s super hot and appropriate for the context of what a SR is.  IMO… this is even better than having sex on the first date.  The anticipation would be amazing!  Jealous!",
            "author": "ohheytherewest",
            "id": "jd85fi7",
            "parent_id": "t3_11xxsb6",
            "score": 3,
            "created_utc": 1679497418.0,
            "replies": [
                {
                    "body": "Date 2? Most of my M&G end in my place, not lying. Unless I’m not sure of the vibe and get a bad feeling. Maybe I should be more careful?",
                    "author": "stuartrene",
                    "id": "jdakg4n",
                    "parent_id": "t1_jd85fi7",
                    "score": 1,
                    "created_utc": 1679531413.0,
                    "replies": [
                        {
                            "body": "I’ve had both.  I prefer date 2.  It’s takes so much pressure off of her and she can relax and be herself and focus on getting to know me and sharing more about herself.  I like to be upfront with my no sex expectations for date 1.  It’s served me well.  I like a little mystery as well!",
                            "author": "ohheytherewest",
                            "id": "jdaxt5y",
                            "parent_id": "t1_jdakg4n",
                            "score": 1,
                            "created_utc": 1679537264.0,
                            "replies": [
                                {
                                    "body": "I respect your game, however, I love the thrill of sex on the first date. Like, strangers a few hours ago, and in bed the next",
                                    "author": "stuartrene",
                                    "id": "jdbh2wq",
                                    "parent_id": "t1_jdaxt5y",
                                    "score": 1,
                                    "created_utc": 1679547355.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's awesome! She put some thought into that, which reflects super-well on you. She could have decided not to give it. :)",
            "author": "FromHyakToNorthBend",
            "id": "jd5baav",
            "parent_id": "t3_11xxsb6",
            "score": 9,
            "created_utc": 1679439431.0,
            "replies": [
                {
                    "body": "Yep",
                    "author": "AdventurousAd9911",
                    "id": "jd64uoq",
                    "parent_id": "t1_jd5baav",
                    "score": 1,
                    "created_utc": 1679452386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bold move there Cotton, how's that going to play out?\n\nI think back to when my G.O.A.T. SB brought her roommate into our relationship.\n\nThey went to the restroom together after dinner, before dessert.  Came out all giggly, she asked me to hold her hand under the table.  When I reached under there, there were two thongs in her hand for me.\n\nMessage was received and understood.\n\nMy vote is to call her bluff, and have a second date.",
            "author": "YourBadDecision",
            "id": "jd5ht4m",
            "parent_id": "t3_11xxsb6",
            "score": 17,
            "created_utc": 1679442150.0,
            "replies": []
        },
        {
            "body": "I’m glad you gave her a m&g gift tho . I always appreciate those",
            "author": "AdventurousAd9911",
            "id": "jd64phe",
            "parent_id": "t3_11xxsb6",
            "score": 9,
            "created_utc": 1679452317.0,
            "replies": []
        },
        {
            "body": "I’m a girl but this gives me MAJOR bad vibes… like something someone would do to act like they’re prepared to get sexual, without showing genuine interest. Like a quick, easy, cheap gesture.",
            "author": "alyxdiary",
            "id": "jd5mu09",
            "parent_id": "t3_11xxsb6",
            "score": 26,
            "created_utc": 1679444315.0,
            "replies": [
                {
                    "body": "Way too strong, way too early on in my opinion. Also the fact that she planned it beforehand instead of after knowing him for a bit makes it a bit disingenuous. She essentially prepared that gift for a stranger, it wasn’t a personalized gift at all. \n\nFunny thing is, my vanilla ex bf went on a first date with a girl who did the exact same thing (left them in his mailbox though). He found it super creepy and off putting, never had a second date with her. As someone else said, different strokes for different folks I guess.",
                    "author": "sagerose_xo",
                    "id": "jd5zowb",
                    "parent_id": "t1_jd5mu09",
                    "score": 15,
                    "created_utc": 1679449996.0,
                    "replies": [
                        {
                            "body": "Different panties for different Daddies.",
                            "author": "iamrosieriley",
                            "id": "jd8nh74",
                            "parent_id": "t1_jd5zowb",
                            "score": 6,
                            "created_utc": 1679504242.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree, it’s way over personal. Like pantie collecting is a kink so I assume they have previously discussed his like for it? Otherwise it’s a huge risk. \n\nI’d be completely turned off by the gift. It’s just way too much in a direction I don’t want to go in. And it would feel like she is purposing a sexual agenda regardless of my preferences, sexual or otherwise. \n\nIt’s just weird.",
                    "author": "Neither-Ad-2833",
                    "id": "jd5uuzg",
                    "parent_id": "t1_jd5mu09",
                    "score": 13,
                    "created_utc": 1679447848.0,
                    "replies": [
                        {
                            "body": ">I’d be completely turned off by the gift\n\nSame!",
                            "author": "Quasimodo1974",
                            "id": "jd7dfoj",
                            "parent_id": "t1_jd5uuzg",
                            "score": 4,
                            "created_utc": 1679484266.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "*Oooooh, sorreeee. Wrong answer.*\n\nThey were texting back and forth for a week prior. \n\nThe M&G lasted three hours. \n\nShe offered the gift as they were departing. If the vibe and chemistry wasn’t there, she may have just as easily simply smiled and said, “It was lovely meeting you.”\n\nShe was brilliant. Don’t be throwing shade on a sister just because you didn’t think of it first. 🤣",
                    "author": "Chill_SD1974",
                    "id": "jd7dysr",
                    "parent_id": "t1_jd5mu09",
                    "score": 11,
                    "created_utc": 1679484604.0,
                    "replies": [
                        {
                            "body": ">She was brilliant. Don’t be throwing shade on a sister just because you didn’t think of it first. \n\nwomen love to be haters when it comes to other women playing the game well. She's just upset because the OP's SB has raised the bar for all other SB. SB should take notes of this woman, what she did was very well played. This would definitely help close the deal if the OP was choosing between a couple options. I know it would for me.",
                            "author": "NickPfromYuma",
                            "id": "jd7ll9m",
                            "parent_id": "t1_jd7dysr",
                            "score": 4,
                            "created_utc": 1679488837.0,
                            "replies": [
                                {
                                    "body": "Yes! I like to play a game in my mind where I could write the dialogue for the SB and what would that sound like. This was 100% a baller move and I don't think I'd have been able to come up with it.\n\nSome women, very very very few, just understand men and the art of the seduction. It's so few it's depressing.",
                                    "author": null,
                                    "id": "jd9dg3s",
                                    "parent_id": "t1_jd7ll9m",
                                    "score": 3,
                                    "created_utc": 1679514022.0,
                                    "replies": []
                                },
                                {
                                    "body": "As you can see by other comments, many SDs also find it gross. So no, it doesn’t “close the deal” unless the guy is into it.",
                                    "author": "alyxdiary",
                                    "id": "jdci9ms",
                                    "parent_id": "t1_jd7ll9m",
                                    "score": 2,
                                    "created_utc": 1679575353.0,
                                    "replies": [
                                        {
                                            "body": "> many ~~SDs~~ also find it gross\n\nway to many ass kissers on this forum, hoping to suck up to SB to win their favor. Men are more open and honest behind closed doors.\n\nMost hetero men would love this from a women that they're attracted to.",
                                            "author": "NickPfromYuma",
                                            "id": "jdcl6x6",
                                            "parent_id": "t1_jdci9ms",
                                            "score": 1,
                                            "created_utc": 1679576788.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Word!",
                                    "author": "Chill_SD1974",
                                    "id": "jd7mni4",
                                    "parent_id": "t1_jd7ll9m",
                                    "score": 3,
                                    "created_utc": 1679489366.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ve had nice text/chat chemistry with POTs and then met IRL and had zero physical chemistry/attraction…. For me this is where it’s a weird gesture. Super hot concept and no shade to the girl… just imagining how uncomfortable I would be if I said that to someone I never met and then IRL he had bad breath or BO or talked with his mouth full or who knows!",
                    "author": "anonymousmilfslut",
                    "id": "jd7za42",
                    "parent_id": "t1_jd5mu09",
                    "score": 2,
                    "created_utc": 1679494965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have mixed feelings about this. Wow indeed in a mostly good way, but ... She prepared it before meeting you (would feel more personal if it happened after meeting already), in actuality I would probably be scared that the note is somehow a trap because it's like a paper trail that I'm dating a teenager (thankfully I don't date teenagers, so wouldn't happen to me anyway), and what am I supposed to do with it? Sniff it? (Not my thing) Frame it? Store it? I don't want that around for my kids to find or I'll forget it's there and have a new SB find it sometime later. No thanks. I would have to trash it right away.\n\nWhat are you doing with it OP?",
            "author": "whatever-tata",
            "id": "jd5g35e",
            "parent_id": "t3_11xxsb6",
            "score": 9,
            "created_utc": 1679441417.0,
            "replies": [
                {
                    "body": "Maybe some people need more context.\nI'm a very experienced SD. Of course she wants my money lol. That's what arrangements are about.\nI have had arrangements that lasted 1.5 years and 2.5 years. A few shorter ones as well.\nOur prior texts had become somewhat sexual. I do not have a panty fetish of any sort lol. \nThe agreement was coffee only. Assured her I would not even try to hold her hand. As it turns out, there was absolutely no physical contact.\n\nThe gift was a clear signal that she enjoyed my company, felt safe, and wanted to see me again.\n2 days later I sent a text asking what type of meeting did she prefer next time. \"Intimate\" was her choice. So we will set something up in the next 10 days.\n\nThank you all for your feedback, positive and negative.",
                    "author": "Majestic_Hamster5953",
                    "id": "jd7hwu0",
                    "parent_id": "t1_jd5g35e",
                    "score": 4,
                    "created_utc": 1679486904.0,
                    "replies": []
                },
                {
                    "body": "I'd hang it off of my rear view mirror.",
                    "author": "GordonGuapo",
                    "id": "jd67ztr",
                    "parent_id": "t1_jd5g35e",
                    "score": 3,
                    "created_utc": 1679453894.0,
                    "replies": []
                },
                {
                    "body": "She gave the gift after a three hour M&G. Plan B? She could have easily withheld it and said, “Nice to met you” if the chemistry wasn’t there.",
                    "author": "Chill_SD1974",
                    "id": "jd7erhj",
                    "parent_id": "t1_jd5g35e",
                    "score": 4,
                    "created_utc": 1679485096.0,
                    "replies": []
                },
                {
                    "body": "My single SD keeps my shirt and panties under his pillow, have at it dude!\n\nMy married SD keeps the panties in his work bag, spicy! 😻 I expected him to toss em.",
                    "author": "Tanlookinggal",
                    "id": "jd5xscf",
                    "parent_id": "t1_jd5g35e",
                    "score": 3,
                    "created_utc": 1679449144.0,
                    "replies": [
                        {
                            "body": "All good, different strokes for different folks.",
                            "author": "whatever-tata",
                            "id": "jd5ya7o",
                            "parent_id": "t1_jd5xscf",
                            "score": 2,
                            "created_utc": 1679449360.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nice.  This girl has style.  What a great way to say “I’m interested”.",
            "author": "MrBuzzard",
            "id": "jd5g9sf",
            "parent_id": "t3_11xxsb6",
            "score": 6,
            "created_utc": 1679441496.0,
            "replies": []
        },
        {
            "body": "I’d hire her to do sales for my company!",
            "author": null,
            "id": "jd5tyxg",
            "parent_id": "t3_11xxsb6",
            "score": 5,
            "created_utc": 1679447451.0,
            "replies": []
        },
        {
            "body": "😬😬😬",
            "author": "WarmPosession",
            "id": "jd6l17d",
            "parent_id": "t3_11xxsb6",
            "score": 5,
            "created_utc": 1679461543.0,
            "replies": [
                {
                    "body": "Same",
                    "author": "moonjuicediet",
                    "id": "jd76kog",
                    "parent_id": "t1_jd6l17d",
                    "score": 3,
                    "created_utc": 1679479287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seems a little too perfect. Like it was designed to string him along. If she’s willing to get physical than great, but my spidery sense is going off here and something is afoot.",
            "author": "atxsuda",
            "id": "jd5i0jd",
            "parent_id": "t3_11xxsb6",
            "score": 9,
            "created_utc": 1679442236.0,
            "replies": [
                {
                    "body": "Relax, my dear. This is a thoughtful SB coming with her best moves. Hope OP enjoys the ride.",
                    "author": "Gracefuldelicate",
                    "id": "jd5q4ae",
                    "parent_id": "t1_jd5i0jd",
                    "score": 7,
                    "created_utc": 1679445748.0,
                    "replies": [
                        {
                            "body": "No thanks, dear.",
                            "author": "atxsuda",
                            "id": "jd5s0g8",
                            "parent_id": "t1_jd5q4ae",
                            "score": 6,
                            "created_utc": 1679446586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Were the worn / her size, or was she hoping you'd wear 'em and spice things up a little bit?\n\nThat's a bold move on her part. \n\nSo when's the second date?",
            "author": "BigBearSD",
            "id": "jd5et58",
            "parent_id": "t3_11xxsb6",
            "score": 6,
            "created_utc": 1679440871.0,
            "replies": []
        },
        {
            "body": "That is so sweet and thoughtful, if a girl did that to me I would be SWEATING 😅 I’m jealous lmao!",
            "author": "xoalienbabe",
            "id": "jd6fsug",
            "parent_id": "t3_11xxsb6",
            "score": 2,
            "created_utc": 1679458162.0,
            "replies": []
        },
        {
            "body": ">As she was leaving, she handed me a small gift box, and asked that I didn't open it until she was gone. When I eventually looked inside there was a very nice pair of panties, and a note which read \"I hope to give you another pair before I turn 20\"\n\nI must confess I do have a pantie kink so this type of gift would not bother me.",
            "author": "2020Traveller",
            "id": "jd74ydb",
            "parent_id": "t3_11xxsb6",
            "score": 2,
            "created_utc": 1679477947.0,
            "replies": []
        },
        {
            "body": "That’s gross. 19 is a teenager. Try 22.",
            "author": "thegoddessofgloom",
            "id": "jdbs5mq",
            "parent_id": "t3_11xxsb6",
            "score": 2,
            "created_utc": 1679555905.0,
            "replies": [
                {
                    "body": "Last SB was 30 if ur so concerned with my \"style\".\nI gauge potential on the person,not her age. But thanks for your concern.",
                    "author": "Majestic_Hamster5953",
                    "id": "jdcho4r",
                    "parent_id": "t1_jdbs5mq",
                    "score": 2,
                    "created_utc": 1679575055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s pressure 😍",
            "author": "Downtown_Astronauts",
            "id": "jd5attb",
            "parent_id": "t3_11xxsb6",
            "score": 4,
            "created_utc": 1679439254.0,
            "replies": []
        },
        {
            "body": "That’s what we call a keeper!",
            "author": "NewYorkSD",
            "id": "jd5iuhk",
            "parent_id": "t3_11xxsb6",
            "score": 2,
            "created_utc": 1679442586.0,
            "replies": []
        },
        {
            "body": "That's a first. Well played young lady. My wheels would be spinning. Not just for planning the next date but again for her 20th birthday. She sound like a lot of fun.",
            "author": "GordonGuapo",
            "id": "jd68jye",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679454176.0,
            "replies": []
        },
        {
            "body": "You’ll probably find out she’s been selling them off her onlyfans for years 😂.  Seriously though, probably worth pursuing just based on her self confidence.  One of the most amazing m&g’s I’ve ever had (didn’t get any panties however) was with a 19yo, she was super mature and intelligent.  It’s a dice roll at that age, it’s either a surprise or pretty much what you’d expect.  Glad it worked out for you! Give us updates please.",
            "author": "RedHeavyG603",
            "id": "jd7g7hk",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679485945.0,
            "replies": []
        },
        {
            "body": "First \"encounter\" set for this evening. She seems pretty nervous. Asked me if there is any particular dress code. What time do I want her to arrive.\nSays she has never had an orgasm.\nThis will be interesting.....and fun.",
            "author": "Majestic_Hamster5953",
            "id": "jdvtb10",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679932307.0,
            "replies": []
        },
        {
            "body": "So we had our first intimate meeting. Like most, it was a bit of an awkward start. But from there things progressed smoothly.\nAll in all it was a nice encounter. The only drawback being a tiny bit of blood, as she had not been sexually active for some time, and was used to younger guys who were done in 3 minutes with little to no foreplay. \nHeard from her today. Says she had a great time ( yes, I know I paid her) and is looking forward to our next meeting.",
            "author": "Majestic_Hamster5953",
            "id": "je00612",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1680008875.0,
            "replies": []
        },
        {
            "body": "Well, I'd say that this is a done deal. She knows how to get things done!",
            "author": "Norma_Guy_2618",
            "id": "jd5ezrr",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679440944.0,
            "replies": []
        },
        {
            "body": "Congratulations looks like you found a keeper",
            "author": "obenjab",
            "id": "jd6dq56",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679456947.0,
            "replies": []
        },
        {
            "body": "She literally just wants your money, friend.",
            "author": "ronitabonita",
            "id": "jd5z32s",
            "parent_id": "t3_11xxsb6",
            "score": 0,
            "created_utc": 1679449726.0,
            "replies": [
                {
                    "body": "Lol I mean that too ofc",
                    "author": "AdventurousAd9911",
                    "id": "jd64zs5",
                    "parent_id": "t1_jd5z32s",
                    "score": 0,
                    "created_utc": 1679452454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bravo young lady 👏  Bravo 👏",
            "author": "andrew_david",
            "id": "jd5iqt0",
            "parent_id": "t3_11xxsb6",
            "score": 0,
            "created_utc": 1679442541.0,
            "replies": []
        },
        {
            "body": "She wins.  Just wow. Brilliant.",
            "author": "playing416",
            "id": "jd5wkgu",
            "parent_id": "t3_11xxsb6",
            "score": 0,
            "created_utc": 1679448599.0,
            "replies": []
        },
        {
            "body": "Damn dude !!!  👍👍👍👍👍👍",
            "author": "Lefty354",
            "id": "jd622xs",
            "parent_id": "t3_11xxsb6",
            "score": 0,
            "created_utc": 1679451088.0,
            "replies": []
        },
        {
            "body": "Wowww",
            "author": "AdventurousAd9911",
            "id": "jd64no3",
            "parent_id": "t3_11xxsb6",
            "score": 0,
            "created_utc": 1679452293.0,
            "replies": []
        },
        {
            "body": "wow. that's just ... wow. bold move. she certainly knows how to get a man's attention",
            "author": "davitech73",
            "id": "jd66ck4",
            "parent_id": "t3_11xxsb6",
            "score": 0,
            "created_utc": 1679453101.0,
            "replies": []
        },
        {
            "body": "As long as there were no skid marks in the fabric…",
            "author": "Regular_Lettuce_9064",
            "id": "jd5fmkt",
            "parent_id": "t3_11xxsb6",
            "score": -1,
            "created_utc": 1679441218.0,
            "replies": []
        },
        {
            "body": "So what are you doing to follow up with her?  She's thrown you a challenge.  Do you accept?  The next time you meet her, before she turns 20, will that be a public M&G or a private encounter?",
            "author": "No_Selection453",
            "id": "jd5gsqh",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679441723.0,
            "replies": []
        },
        {
            "body": "Bravo to her!",
            "author": "mraspencer",
            "id": "jd6p5fp",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679464590.0,
            "replies": []
        },
        {
            "body": "Impressive and very professional sales technique!",
            "author": "A-touchofreality",
            "id": "jd6zlk7",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679473294.0,
            "replies": []
        },
        {
            "body": "J\n\nNm?ed at M",
            "author": "petiteangelxs",
            "id": "jd6zt8s",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679473476.0,
            "replies": []
        },
        {
            "body": "a very nice pair of panties\n\nLightly used I hope?  She sounds like a keeper-and experienced.",
            "author": "GSSD",
            "id": "jd7kocr",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679488370.0,
            "replies": [
                {
                    "body": "She's never been in an arrangement .",
                    "author": "Majestic_Hamster5953",
                    "id": "jd7r5rz",
                    "parent_id": "t1_jd7kocr",
                    "score": 1,
                    "created_utc": 1679491485.0,
                    "replies": [
                        {
                            "body": "So she says. That move sounds a little too advanced to think this up in her own 19 year old brain. But no shade on her. She appears to be sex forward which works out for a SR.",
                            "author": "GSSD",
                            "id": "jd7rf0y",
                            "parent_id": "t1_jd7r5rz",
                            "score": 5,
                            "created_utc": 1679491601.0,
                            "replies": [
                                {
                                    "body": "If she is advanced, I'm wondering why the topic of money has not even been mentioned yet.\n\nI get it though. I'm a skeptic as well for the most part. And that is based on experience. Time will tell.",
                                    "author": "Majestic_Hamster5953",
                                    "id": "jd7sxvt",
                                    "parent_id": "t1_jd7rf0y",
                                    "score": 2,
                                    "created_utc": 1679492293.0,
                                    "replies": [
                                        {
                                            "body": "> Time will tell\n\nYes-good luck.",
                                            "author": "GSSD",
                                            "id": "jd853ov",
                                            "parent_id": "t1_jd7sxvt",
                                            "score": 2,
                                            "created_utc": 1679497286.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A Keeper.",
            "author": null,
            "id": "jd7qogh",
            "parent_id": "t3_11xxsb6",
            "score": 1,
            "created_utc": 1679491267.0,
            "replies": []
        },
        {
            "body": "19 year olds are either the best or the worst SBs you’ve ever had",
            "author": "RealisticSD",
            "id": "jd5lzjk",
            "parent_id": "t1_jd5klpq",
            "score": 30,
            "created_utc": 1679443940.0,
            "replies": [
                {
                    "body": ">19 year olds are either the best or the worst SBs you’ve ever had\n\nthis..! Ive primary sugar dated women 21 to 29, but my 19 year old SB was one of my best and favorite SB. Very emotionally mature, like a 30 year old, very intelligent and could converse for hours, yet so playful and fun still like someone her age. What we had was very genuine, sometimes spending whole weekends together. It was hard to believe there was over 25q+ years between us. The funny thing is, I never search on SA for under 21, I just happened to see her profile on SA main page as a new profile in my area. I was the 1st person she met off SA. Our meet and greet lasted 5 hours and was just platonic..! One of the best parts was, she initiated the 1st time we had sex on our 3rd date, and practically pushed me onto the bed ;)",
                    "author": "NickPfromYuma",
                    "id": "jd7mh68",
                    "parent_id": "t1_jd5lzjk",
                    "score": 12,
                    "created_utc": 1679489280.0,
                    "replies": [
                        {
                            "body": "(burst into tears of envyness :-D)",
                            "author": "SeekingInSydney",
                            "id": "jdao45u",
                            "parent_id": "t1_jd7mh68",
                            "score": 3,
                            "created_utc": 1679532966.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmmm. When I have gifted a pair of my boxers to a POT SB with a note \"I hope to give you another pair before I turn 50\" it never turned out so well. Hmmm.",
            "author": "BinghamtonSD",
            "id": "jd5ws2l",
            "parent_id": "t1_jd5bc03",
            "score": 53,
            "created_utc": 1679448694.0,
            "replies": [
                {
                    "body": "Might have been the skid marks that did you in",
                    "author": "tc65681",
                    "id": "jd66ery",
                    "parent_id": "t1_jd5ws2l",
                    "score": 24,
                    "created_utc": 1679453128.0,
                    "replies": []
                },
                {
                    "body": "You definitely need to and report back /s",
                    "author": "superbad4life01",
                    "id": "jd61mco",
                    "parent_id": "t1_jd5ws2l",
                    "score": 2,
                    "created_utc": 1679450874.0,
                    "replies": []
                },
                {
                    "body": "😂 eeeeuuu creepy",
                    "author": "obenjab",
                    "id": "jd6e09v",
                    "parent_id": "t1_jd5ws2l",
                    "score": 0,
                    "created_utc": 1679457107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Date 2? Most of my M&G end in my place, not lying. Unless I’m not sure of the vibe and get a bad feeling. Maybe I should be more careful?",
            "author": "stuartrene",
            "id": "jdakg4n",
            "parent_id": "t1_jd85fi7",
            "score": 1,
            "created_utc": 1679531413.0,
            "replies": [
                {
                    "body": "I’ve had both.  I prefer date 2.  It’s takes so much pressure off of her and she can relax and be herself and focus on getting to know me and sharing more about herself.  I like to be upfront with my no sex expectations for date 1.  It’s served me well.  I like a little mystery as well!",
                    "author": "ohheytherewest",
                    "id": "jdaxt5y",
                    "parent_id": "t1_jdakg4n",
                    "score": 1,
                    "created_utc": 1679537264.0,
                    "replies": [
                        {
                            "body": "I respect your game, however, I love the thrill of sex on the first date. Like, strangers a few hours ago, and in bed the next",
                            "author": "stuartrene",
                            "id": "jdbh2wq",
                            "parent_id": "t1_jdaxt5y",
                            "score": 1,
                            "created_utc": 1679547355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep",
            "author": "AdventurousAd9911",
            "id": "jd64uoq",
            "parent_id": "t1_jd5baav",
            "score": 1,
            "created_utc": 1679452386.0,
            "replies": []
        },
        {
            "body": "Way too strong, way too early on in my opinion. Also the fact that she planned it beforehand instead of after knowing him for a bit makes it a bit disingenuous. She essentially prepared that gift for a stranger, it wasn’t a personalized gift at all. \n\nFunny thing is, my vanilla ex bf went on a first date with a girl who did the exact same thing (left them in his mailbox though). He found it super creepy and off putting, never had a second date with her. As someone else said, different strokes for different folks I guess.",
            "author": "sagerose_xo",
            "id": "jd5zowb",
            "parent_id": "t1_jd5mu09",
            "score": 15,
            "created_utc": 1679449996.0,
            "replies": [
                {
                    "body": "Different panties for different Daddies.",
                    "author": "iamrosieriley",
                    "id": "jd8nh74",
                    "parent_id": "t1_jd5zowb",
                    "score": 6,
                    "created_utc": 1679504242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, it’s way over personal. Like pantie collecting is a kink so I assume they have previously discussed his like for it? Otherwise it’s a huge risk. \n\nI’d be completely turned off by the gift. It’s just way too much in a direction I don’t want to go in. And it would feel like she is purposing a sexual agenda regardless of my preferences, sexual or otherwise. \n\nIt’s just weird.",
            "author": "Neither-Ad-2833",
            "id": "jd5uuzg",
            "parent_id": "t1_jd5mu09",
            "score": 13,
            "created_utc": 1679447848.0,
            "replies": [
                {
                    "body": ">I’d be completely turned off by the gift\n\nSame!",
                    "author": "Quasimodo1974",
                    "id": "jd7dfoj",
                    "parent_id": "t1_jd5uuzg",
                    "score": 4,
                    "created_utc": 1679484266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*Oooooh, sorreeee. Wrong answer.*\n\nThey were texting back and forth for a week prior. \n\nThe M&G lasted three hours. \n\nShe offered the gift as they were departing. If the vibe and chemistry wasn’t there, she may have just as easily simply smiled and said, “It was lovely meeting you.”\n\nShe was brilliant. Don’t be throwing shade on a sister just because you didn’t think of it first. 🤣",
            "author": "Chill_SD1974",
            "id": "jd7dysr",
            "parent_id": "t1_jd5mu09",
            "score": 11,
            "created_utc": 1679484604.0,
            "replies": [
                {
                    "body": ">She was brilliant. Don’t be throwing shade on a sister just because you didn’t think of it first. \n\nwomen love to be haters when it comes to other women playing the game well. She's just upset because the OP's SB has raised the bar for all other SB. SB should take notes of this woman, what she did was very well played. This would definitely help close the deal if the OP was choosing between a couple options. I know it would for me.",
                    "author": "NickPfromYuma",
                    "id": "jd7ll9m",
                    "parent_id": "t1_jd7dysr",
                    "score": 4,
                    "created_utc": 1679488837.0,
                    "replies": [
                        {
                            "body": "Yes! I like to play a game in my mind where I could write the dialogue for the SB and what would that sound like. This was 100% a baller move and I don't think I'd have been able to come up with it.\n\nSome women, very very very few, just understand men and the art of the seduction. It's so few it's depressing.",
                            "author": null,
                            "id": "jd9dg3s",
                            "parent_id": "t1_jd7ll9m",
                            "score": 3,
                            "created_utc": 1679514022.0,
                            "replies": []
                        },
                        {
                            "body": "As you can see by other comments, many SDs also find it gross. So no, it doesn’t “close the deal” unless the guy is into it.",
                            "author": "alyxdiary",
                            "id": "jdci9ms",
                            "parent_id": "t1_jd7ll9m",
                            "score": 2,
                            "created_utc": 1679575353.0,
                            "replies": [
                                {
                                    "body": "> many ~~SDs~~ also find it gross\n\nway to many ass kissers on this forum, hoping to suck up to SB to win their favor. Men are more open and honest behind closed doors.\n\nMost hetero men would love this from a women that they're attracted to.",
                                    "author": "NickPfromYuma",
                                    "id": "jdcl6x6",
                                    "parent_id": "t1_jdci9ms",
                                    "score": 1,
                                    "created_utc": 1679576788.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Word!",
                            "author": "Chill_SD1974",
                            "id": "jd7mni4",
                            "parent_id": "t1_jd7ll9m",
                            "score": 3,
                            "created_utc": 1679489366.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had nice text/chat chemistry with POTs and then met IRL and had zero physical chemistry/attraction…. For me this is where it’s a weird gesture. Super hot concept and no shade to the girl… just imagining how uncomfortable I would be if I said that to someone I never met and then IRL he had bad breath or BO or talked with his mouth full or who knows!",
            "author": "anonymousmilfslut",
            "id": "jd7za42",
            "parent_id": "t1_jd5mu09",
            "score": 2,
            "created_utc": 1679494965.0,
            "replies": []
        },
        {
            "body": "Maybe some people need more context.\nI'm a very experienced SD. Of course she wants my money lol. That's what arrangements are about.\nI have had arrangements that lasted 1.5 years and 2.5 years. A few shorter ones as well.\nOur prior texts had become somewhat sexual. I do not have a panty fetish of any sort lol. \nThe agreement was coffee only. Assured her I would not even try to hold her hand. As it turns out, there was absolutely no physical contact.\n\nThe gift was a clear signal that she enjoyed my company, felt safe, and wanted to see me again.\n2 days later I sent a text asking what type of meeting did she prefer next time. \"Intimate\" was her choice. So we will set something up in the next 10 days.\n\nThank you all for your feedback, positive and negative.",
            "author": "Majestic_Hamster5953",
            "id": "jd7hwu0",
            "parent_id": "t1_jd5g35e",
            "score": 4,
            "created_utc": 1679486904.0,
            "replies": []
        },
        {
            "body": "I'd hang it off of my rear view mirror.",
            "author": "GordonGuapo",
            "id": "jd67ztr",
            "parent_id": "t1_jd5g35e",
            "score": 3,
            "created_utc": 1679453894.0,
            "replies": []
        },
        {
            "body": "She gave the gift after a three hour M&G. Plan B? She could have easily withheld it and said, “Nice to met you” if the chemistry wasn’t there.",
            "author": "Chill_SD1974",
            "id": "jd7erhj",
            "parent_id": "t1_jd5g35e",
            "score": 4,
            "created_utc": 1679485096.0,
            "replies": []
        },
        {
            "body": "My single SD keeps my shirt and panties under his pillow, have at it dude!\n\nMy married SD keeps the panties in his work bag, spicy! 😻 I expected him to toss em.",
            "author": "Tanlookinggal",
            "id": "jd5xscf",
            "parent_id": "t1_jd5g35e",
            "score": 3,
            "created_utc": 1679449144.0,
            "replies": [
                {
                    "body": "All good, different strokes for different folks.",
                    "author": "whatever-tata",
                    "id": "jd5ya7o",
                    "parent_id": "t1_jd5xscf",
                    "score": 2,
                    "created_utc": 1679449360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same",
            "author": "moonjuicediet",
            "id": "jd76kog",
            "parent_id": "t1_jd6l17d",
            "score": 3,
            "created_utc": 1679479287.0,
            "replies": []
        },
        {
            "body": "Relax, my dear. This is a thoughtful SB coming with her best moves. Hope OP enjoys the ride.",
            "author": "Gracefuldelicate",
            "id": "jd5q4ae",
            "parent_id": "t1_jd5i0jd",
            "score": 7,
            "created_utc": 1679445748.0,
            "replies": [
                {
                    "body": "No thanks, dear.",
                    "author": "atxsuda",
                    "id": "jd5s0g8",
                    "parent_id": "t1_jd5q4ae",
                    "score": 6,
                    "created_utc": 1679446586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Last SB was 30 if ur so concerned with my \"style\".\nI gauge potential on the person,not her age. But thanks for your concern.",
            "author": "Majestic_Hamster5953",
            "id": "jdcho4r",
            "parent_id": "t1_jdbs5mq",
            "score": 2,
            "created_utc": 1679575055.0,
            "replies": []
        },
        {
            "body": "Lol I mean that too ofc",
            "author": "AdventurousAd9911",
            "id": "jd64zs5",
            "parent_id": "t1_jd5z32s",
            "score": 0,
            "created_utc": 1679452454.0,
            "replies": []
        },
        {
            "body": "She's never been in an arrangement .",
            "author": "Majestic_Hamster5953",
            "id": "jd7r5rz",
            "parent_id": "t1_jd7kocr",
            "score": 1,
            "created_utc": 1679491485.0,
            "replies": [
                {
                    "body": "So she says. That move sounds a little too advanced to think this up in her own 19 year old brain. But no shade on her. She appears to be sex forward which works out for a SR.",
                    "author": "GSSD",
                    "id": "jd7rf0y",
                    "parent_id": "t1_jd7r5rz",
                    "score": 5,
                    "created_utc": 1679491601.0,
                    "replies": [
                        {
                            "body": "If she is advanced, I'm wondering why the topic of money has not even been mentioned yet.\n\nI get it though. I'm a skeptic as well for the most part. And that is based on experience. Time will tell.",
                            "author": "Majestic_Hamster5953",
                            "id": "jd7sxvt",
                            "parent_id": "t1_jd7rf0y",
                            "score": 2,
                            "created_utc": 1679492293.0,
                            "replies": [
                                {
                                    "body": "> Time will tell\n\nYes-good luck.",
                                    "author": "GSSD",
                                    "id": "jd853ov",
                                    "parent_id": "t1_jd7sxvt",
                                    "score": 2,
                                    "created_utc": 1679497286.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">19 year olds are either the best or the worst SBs you’ve ever had\n\nthis..! Ive primary sugar dated women 21 to 29, but my 19 year old SB was one of my best and favorite SB. Very emotionally mature, like a 30 year old, very intelligent and could converse for hours, yet so playful and fun still like someone her age. What we had was very genuine, sometimes spending whole weekends together. It was hard to believe there was over 25q+ years between us. The funny thing is, I never search on SA for under 21, I just happened to see her profile on SA main page as a new profile in my area. I was the 1st person she met off SA. Our meet and greet lasted 5 hours and was just platonic..! One of the best parts was, she initiated the 1st time we had sex on our 3rd date, and practically pushed me onto the bed ;)",
            "author": "NickPfromYuma",
            "id": "jd7mh68",
            "parent_id": "t1_jd5lzjk",
            "score": 12,
            "created_utc": 1679489280.0,
            "replies": [
                {
                    "body": "(burst into tears of envyness :-D)",
                    "author": "SeekingInSydney",
                    "id": "jdao45u",
                    "parent_id": "t1_jd7mh68",
                    "score": 3,
                    "created_utc": 1679532966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Might have been the skid marks that did you in",
            "author": "tc65681",
            "id": "jd66ery",
            "parent_id": "t1_jd5ws2l",
            "score": 24,
            "created_utc": 1679453128.0,
            "replies": []
        },
        {
            "body": "You definitely need to and report back /s",
            "author": "superbad4life01",
            "id": "jd61mco",
            "parent_id": "t1_jd5ws2l",
            "score": 2,
            "created_utc": 1679450874.0,
            "replies": []
        },
        {
            "body": "😂 eeeeuuu creepy",
            "author": "obenjab",
            "id": "jd6e09v",
            "parent_id": "t1_jd5ws2l",
            "score": 0,
            "created_utc": 1679457107.0,
            "replies": []
        },
        {
            "body": "I’ve had both.  I prefer date 2.  It’s takes so much pressure off of her and she can relax and be herself and focus on getting to know me and sharing more about herself.  I like to be upfront with my no sex expectations for date 1.  It’s served me well.  I like a little mystery as well!",
            "author": "ohheytherewest",
            "id": "jdaxt5y",
            "parent_id": "t1_jdakg4n",
            "score": 1,
            "created_utc": 1679537264.0,
            "replies": [
                {
                    "body": "I respect your game, however, I love the thrill of sex on the first date. Like, strangers a few hours ago, and in bed the next",
                    "author": "stuartrene",
                    "id": "jdbh2wq",
                    "parent_id": "t1_jdaxt5y",
                    "score": 1,
                    "created_utc": 1679547355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Different panties for different Daddies.",
            "author": "iamrosieriley",
            "id": "jd8nh74",
            "parent_id": "t1_jd5zowb",
            "score": 6,
            "created_utc": 1679504242.0,
            "replies": []
        },
        {
            "body": ">I’d be completely turned off by the gift\n\nSame!",
            "author": "Quasimodo1974",
            "id": "jd7dfoj",
            "parent_id": "t1_jd5uuzg",
            "score": 4,
            "created_utc": 1679484266.0,
            "replies": []
        },
        {
            "body": ">She was brilliant. Don’t be throwing shade on a sister just because you didn’t think of it first. \n\nwomen love to be haters when it comes to other women playing the game well. She's just upset because the OP's SB has raised the bar for all other SB. SB should take notes of this woman, what she did was very well played. This would definitely help close the deal if the OP was choosing between a couple options. I know it would for me.",
            "author": "NickPfromYuma",
            "id": "jd7ll9m",
            "parent_id": "t1_jd7dysr",
            "score": 4,
            "created_utc": 1679488837.0,
            "replies": [
                {
                    "body": "Yes! I like to play a game in my mind where I could write the dialogue for the SB and what would that sound like. This was 100% a baller move and I don't think I'd have been able to come up with it.\n\nSome women, very very very few, just understand men and the art of the seduction. It's so few it's depressing.",
                    "author": null,
                    "id": "jd9dg3s",
                    "parent_id": "t1_jd7ll9m",
                    "score": 3,
                    "created_utc": 1679514022.0,
                    "replies": []
                },
                {
                    "body": "As you can see by other comments, many SDs also find it gross. So no, it doesn’t “close the deal” unless the guy is into it.",
                    "author": "alyxdiary",
                    "id": "jdci9ms",
                    "parent_id": "t1_jd7ll9m",
                    "score": 2,
                    "created_utc": 1679575353.0,
                    "replies": [
                        {
                            "body": "> many ~~SDs~~ also find it gross\n\nway to many ass kissers on this forum, hoping to suck up to SB to win their favor. Men are more open and honest behind closed doors.\n\nMost hetero men would love this from a women that they're attracted to.",
                            "author": "NickPfromYuma",
                            "id": "jdcl6x6",
                            "parent_id": "t1_jdci9ms",
                            "score": 1,
                            "created_utc": 1679576788.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Word!",
                    "author": "Chill_SD1974",
                    "id": "jd7mni4",
                    "parent_id": "t1_jd7ll9m",
                    "score": 3,
                    "created_utc": 1679489366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All good, different strokes for different folks.",
            "author": "whatever-tata",
            "id": "jd5ya7o",
            "parent_id": "t1_jd5xscf",
            "score": 2,
            "created_utc": 1679449360.0,
            "replies": []
        },
        {
            "body": "No thanks, dear.",
            "author": "atxsuda",
            "id": "jd5s0g8",
            "parent_id": "t1_jd5q4ae",
            "score": 6,
            "created_utc": 1679446586.0,
            "replies": []
        },
        {
            "body": "So she says. That move sounds a little too advanced to think this up in her own 19 year old brain. But no shade on her. She appears to be sex forward which works out for a SR.",
            "author": "GSSD",
            "id": "jd7rf0y",
            "parent_id": "t1_jd7r5rz",
            "score": 5,
            "created_utc": 1679491601.0,
            "replies": [
                {
                    "body": "If she is advanced, I'm wondering why the topic of money has not even been mentioned yet.\n\nI get it though. I'm a skeptic as well for the most part. And that is based on experience. Time will tell.",
                    "author": "Majestic_Hamster5953",
                    "id": "jd7sxvt",
                    "parent_id": "t1_jd7rf0y",
                    "score": 2,
                    "created_utc": 1679492293.0,
                    "replies": [
                        {
                            "body": "> Time will tell\n\nYes-good luck.",
                            "author": "GSSD",
                            "id": "jd853ov",
                            "parent_id": "t1_jd7sxvt",
                            "score": 2,
                            "created_utc": 1679497286.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "(burst into tears of envyness :-D)",
            "author": "SeekingInSydney",
            "id": "jdao45u",
            "parent_id": "t1_jd7mh68",
            "score": 3,
            "created_utc": 1679532966.0,
            "replies": []
        },
        {
            "body": "I respect your game, however, I love the thrill of sex on the first date. Like, strangers a few hours ago, and in bed the next",
            "author": "stuartrene",
            "id": "jdbh2wq",
            "parent_id": "t1_jdaxt5y",
            "score": 1,
            "created_utc": 1679547355.0,
            "replies": []
        },
        {
            "body": "Yes! I like to play a game in my mind where I could write the dialogue for the SB and what would that sound like. This was 100% a baller move and I don't think I'd have been able to come up with it.\n\nSome women, very very very few, just understand men and the art of the seduction. It's so few it's depressing.",
            "author": null,
            "id": "jd9dg3s",
            "parent_id": "t1_jd7ll9m",
            "score": 3,
            "created_utc": 1679514022.0,
            "replies": []
        },
        {
            "body": "As you can see by other comments, many SDs also find it gross. So no, it doesn’t “close the deal” unless the guy is into it.",
            "author": "alyxdiary",
            "id": "jdci9ms",
            "parent_id": "t1_jd7ll9m",
            "score": 2,
            "created_utc": 1679575353.0,
            "replies": [
                {
                    "body": "> many ~~SDs~~ also find it gross\n\nway to many ass kissers on this forum, hoping to suck up to SB to win their favor. Men are more open and honest behind closed doors.\n\nMost hetero men would love this from a women that they're attracted to.",
                    "author": "NickPfromYuma",
                    "id": "jdcl6x6",
                    "parent_id": "t1_jdci9ms",
                    "score": 1,
                    "created_utc": 1679576788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Word!",
            "author": "Chill_SD1974",
            "id": "jd7mni4",
            "parent_id": "t1_jd7ll9m",
            "score": 3,
            "created_utc": 1679489366.0,
            "replies": []
        },
        {
            "body": "If she is advanced, I'm wondering why the topic of money has not even been mentioned yet.\n\nI get it though. I'm a skeptic as well for the most part. And that is based on experience. Time will tell.",
            "author": "Majestic_Hamster5953",
            "id": "jd7sxvt",
            "parent_id": "t1_jd7rf0y",
            "score": 2,
            "created_utc": 1679492293.0,
            "replies": [
                {
                    "body": "> Time will tell\n\nYes-good luck.",
                    "author": "GSSD",
                    "id": "jd853ov",
                    "parent_id": "t1_jd7sxvt",
                    "score": 2,
                    "created_utc": 1679497286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> many ~~SDs~~ also find it gross\n\nway to many ass kissers on this forum, hoping to suck up to SB to win their favor. Men are more open and honest behind closed doors.\n\nMost hetero men would love this from a women that they're attracted to.",
            "author": "NickPfromYuma",
            "id": "jdcl6x6",
            "parent_id": "t1_jdci9ms",
            "score": 1,
            "created_utc": 1679576788.0,
            "replies": []
        },
        {
            "body": "> Time will tell\n\nYes-good luck.",
            "author": "GSSD",
            "id": "jd853ov",
            "parent_id": "t1_jd7sxvt",
            "score": 2,
            "created_utc": 1679497286.0,
            "replies": []
        }
    ]
}