{
    "title": "SBs this is why you shouldn’t tell your family and friends about what you do",
    "post_id": "wkbatm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wkbatm/sbs_this_is_why_you_shouldnt_tell_your_family_and/",
    "author": null,
    "body": "I made the mistake of trusting my brother with this secret. It’s not something I’m too proud of doing, but I’m not morally opposed to living this lifestyle either. Now any time we get into an argument, he calls me a “prostie” and threatens to put me on blast. He thinks he has the moral high ground because he’ll be making money “the honest way”. This is coming from the man who has no moral opposition to bombing civilian occupied villages in the Middle East because “they were already going to blow themselves up so I might as well do it for them”. Fml",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wkbatm/sbs_this_is_why_you_shouldnt_tell_your_family_and/",
    "score": 104,
    "upvote_ratio": 0.91,
    "created_utc": 1660070921.0,
    "num_comments": 83,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I know you are young and think it is important what others, even family, think of you, but it really isn't. I learned rather late in life not to give a flying fuck what anyone thought of me or my lifestyle. I wish I had learned that when I was your age. My life would have been much simpler.",
            "author": "AFSMSgt",
            "id": "ijmg9l9",
            "parent_id": "t3_wkbatm",
            "score": 61,
            "created_utc": 1660074619.0,
            "replies": [
                {
                    "body": "As the smart guy i believe you to be from other threads, my guess would be that your manner of not giving a fuck is actually extremely finely tuned in subtle ways.\n\nHaving a dgaf attitude isnt something to just toss into a young person’s life - its actually very refined and a specific and powerful tool.  Like all power tools, mishandling it is bad unless you got the skills.",
                    "author": "JDMultralight",
                    "id": "ijnbcnj",
                    "parent_id": "t1_ijmg9l9",
                    "score": 16,
                    "created_utc": 1660087063.0,
                    "replies": [
                        {
                            "body": "Agreed. There are certain people whose opinions you don’t need to give a fuck about, but some of those you’d do best to still pretend to. It’s draining, but you get more out of life. Still though, everyone cares what someone thinks. I don’t think it’s unreasonable to want to open up to one’s sibling, if they think they’ll understand. Judging by this guy’s seemingly shoddy moral compass, however, I’m not sure I would’ve trusted his judgement like OP did…",
                            "author": "Im3Rhythmus3bleiben",
                            "id": "ijor5d1",
                            "parent_id": "t1_ijnbcnj",
                            "score": 6,
                            "created_utc": 1660113214.0,
                            "replies": []
                        },
                        {
                            "body": "Sorry, but I do not have a single clue what you just said. Could you possibly translate int understand English please",
                            "author": "AFSMSgt",
                            "id": "ijnjwbx",
                            "parent_id": "t1_ijnbcnj",
                            "score": 2,
                            "created_utc": 1660090814.0,
                            "replies": [
                                {
                                    "body": "Oh just that there is an art to not giving a fuck - and you’re probably good at it.  But not everyone is one and probably shouldnt try it - especially young people whose general life skills arent well-developed",
                                    "author": "JDMultralight",
                                    "id": "ijo7ocb",
                                    "parent_id": "t1_ijnjwbx",
                                    "score": 3,
                                    "created_utc": 1660101654.0,
                                    "replies": [
                                        {
                                            "body": "How good at it is he if didn’t understand what you said in the first place? But what you said is gold.",
                                            "author": "Arjansavenije99",
                                            "id": "ijodcum",
                                            "parent_id": "t1_ijo7ocb",
                                            "score": 5,
                                            "created_utc": 1660104595.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I respectfully disagree. Not giving a fuck takes no skill. It is the result of self confidence. It is knowing that their opinion means nothing to you because you are better than them.",
                            "author": "Blueexpression",
                            "id": "ijqn2s9",
                            "parent_id": "t1_ijnbcnj",
                            "score": 1,
                            "created_utc": 1660150230.0,
                            "replies": [
                                {
                                    "body": "Yes confidence is essential to not giving a fuck. For me at least it was a learning process tho - especially because most of the only people who I might have cared about had my respect so I wasn’t better than them. \n\nOn the confidence tip it was more that I had to confident about the fact that I was thriving or else Id worry that they were right, know that I might benefit from advice, then Id start to drift toward thinking more about image.",
                                    "author": "JDMultralight",
                                    "id": "ijr0mkz",
                                    "parent_id": "t1_ijqn2s9",
                                    "score": 1,
                                    "created_utc": 1660155219.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Saaaaame! I like to say that what someone else thinks of me is none of my business",
                    "author": "BaddB1tch",
                    "id": "ijn7h4v",
                    "parent_id": "t1_ijmg9l9",
                    "score": 1,
                    "created_utc": 1660085401.0,
                    "replies": []
                },
                {
                    "body": "Though this advice might be right it's not possible I think. We need validation from other people to feel good. This is one of the main reasons people in the bowl hang out in this subreddit. A life without validation is like a plant without water.",
                    "author": "krama0torsk",
                    "id": "ijo8o72",
                    "parent_id": "t1_ijmg9l9",
                    "score": 1,
                    "created_utc": 1660102153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Safer to trust randoms on the internet",
            "author": "Delicious-Ad6771",
            "id": "ijmb51r",
            "parent_id": "t3_wkbatm",
            "score": 24,
            "created_utc": 1660072689.0,
            "replies": [
                {
                    "body": "Their opinion don't hurt",
                    "author": "DoodleRoodle",
                    "id": "ijmebji",
                    "parent_id": "t1_ijmb51r",
                    "score": 9,
                    "created_utc": 1660073891.0,
                    "replies": [
                        {
                            "body": "…. As much",
                            "author": "YakiMe",
                            "id": "ijnf1li",
                            "parent_id": "t1_ijmebji",
                            "score": 6,
                            "created_utc": 1660088667.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "At least they are randoms that are in the same lifestyle you have chosen.",
                    "author": "willfromvb",
                    "id": "ijnzaqg",
                    "parent_id": "t1_ijmb51r",
                    "score": 1,
                    "created_utc": 1660097703.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Name checks out",
            "author": "timrid",
            "id": "ijm7cp8",
            "parent_id": "t3_wkbatm",
            "score": 46,
            "created_utc": 1660071238.0,
            "replies": []
        },
        {
            "body": "Anything you say can and will be held against you.  \n\nThis applies in all walks of life.",
            "author": "jeffend1981",
            "id": "ijmby0u",
            "parent_id": "t3_wkbatm",
            "score": 20,
            "created_utc": 1660072990.0,
            "replies": [
                {
                    "body": "Yesss",
                    "author": "Konradwolf",
                    "id": "ijpemfm",
                    "parent_id": "t1_ijmby0u",
                    "score": 1,
                    "created_utc": 1660131134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Men (and women) who aren’t in the lifestyle would likely judge the participants very harshly.",
            "author": "LadyoftheFlow4rs",
            "id": "ijma9ij",
            "parent_id": "t3_wkbatm",
            "score": 41,
            "created_utc": 1660072354.0,
            "replies": [
                {
                    "body": "That's why we should ignore posts on this forum from people, not in the lifestyle, casting shame on the lifestyle.",
                    "author": "willfromvb",
                    "id": "ijnz5e1",
                    "parent_id": "t1_ijma9ij",
                    "score": 4,
                    "created_utc": 1660097636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijmhh5e",
            "parent_id": "t3_wkbatm",
            "score": 47,
            "created_utc": 1660075076.0,
            "replies": [
                {
                    "body": "Someone give this man a beer please 🙏⭐⭐",
                    "author": "FructoseLady",
                    "id": "ijmk1n3",
                    "parent_id": "t1_ijmhh5e",
                    "score": 6,
                    "created_utc": 1660076063.0,
                    "replies": []
                },
                {
                    "body": "Was with you until the 35 / 15 dynamic. That’s f*cking disgusting no matter what. Everyone please leave 15 years olds alone. But I get your point, and yes it’s a backward world.",
                    "author": "Orchidinflight",
                    "id": "ijpdgtt",
                    "parent_id": "t1_ijmhh5e",
                    "score": 6,
                    "created_utc": 1660130425.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ijpko9p",
                            "parent_id": "t1_ijpdgtt",
                            "score": 1,
                            "created_utc": 1660134526.0,
                            "replies": [
                                {
                                    "body": "I do get your point, but is there an example of a 15 year old boy with an older woman in media that’s glorified? I can’t think of one, because that’s horrifying to everyone. \n\n(I do of course see that cougars in media are celebrated in a way that older men/younger women are not.)",
                                    "author": "Orchidinflight",
                                    "id": "ijpnfgq",
                                    "parent_id": "t1_ijpko9p",
                                    "score": 1,
                                    "created_utc": 1660135892.0,
                                    "replies": [
                                        {
                                            "body": "It's awful and it's real. Go back 15+ years and see how the m student, f teacher dynamic was discussed in pop culture.",
                                            "author": "Eastern_Ad5817",
                                            "id": "ijq0kru",
                                            "parent_id": "t1_ijpnfgq",
                                            "score": 1,
                                            "created_utc": 1660141623.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe amongst young men (?), but women by and large thought that was horrifying. And it was crucified in the media. I was certainly horrified, as well as all the women I knew. Granted that’s anecdotal but it seems that’s where you’re coming from as well. No one in the media thought that was ok.",
                                                    "author": "Orchidinflight",
                                                    "id": "ijq7a45",
                                                    "parent_id": "t1_ijq0kru",
                                                    "score": 1,
                                                    "created_utc": 1660144285.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
                                                            "author": "Eastern_Ad5817",
                                                            "id": "ike231i",
                                                            "parent_id": "t1_ijq7a45",
                                                            "score": 1,
                                                            "created_utc": 1660575659.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                                                                    "author": "Orchidinflight",
                                                                    "id": "ike867m",
                                                                    "parent_id": "t1_ike231i",
                                                                    "score": 1,
                                                                    "created_utc": 1660578121.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Society also thinks wife as a noble human being in a marriage however SBF as a paid escort. Can’t change that mind set.",
                    "author": "macz786",
                    "id": "ijn62bz",
                    "parent_id": "t1_ijmhh5e",
                    "score": 2,
                    "created_utc": 1660084808.0,
                    "replies": [
                        {
                            "body": "That and its fine for wife to withhold sex and emotional connection,she isn't obligated, which she isn't, but looks down on husband wanting it elsewhere.",
                            "author": null,
                            "id": "ijn9fc1",
                            "parent_id": "t1_ijn62bz",
                            "score": 6,
                            "created_utc": 1660086232.0,
                            "replies": [
                                {
                                    "body": "This is the craziest part. Men will put up with an asinine amount of attitude, bitchy borderline behavior  in exchange for sex once or twice a week and the vast majority of women into a long term committed relationship can’t even give them that. Put he’s a piece of shit who owes her half of everything and alimony going forward if he gets it elsewhere. Insane",
                                    "author": "mypenisis6incircum",
                                    "id": "ijpna2t",
                                    "parent_id": "t1_ijn9fc1",
                                    "score": 2,
                                    "created_utc": 1660135819.0,
                                    "replies": [
                                        {
                                            "body": "I know the double standard is out of control.  Equality except when it doesn't suit you is how it seems.",
                                            "author": null,
                                            "id": "ijpojm9",
                                            "parent_id": "t1_ijpna2t",
                                            "score": 0,
                                            "created_utc": 1660136422.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Men should stop getting married. There’s really no up sides.",
                    "author": "gigsome",
                    "id": "ijr1gg8",
                    "parent_id": "t1_ijmhh5e",
                    "score": 1,
                    "created_utc": 1660155530.0,
                    "replies": []
                },
                {
                    "body": "Ah a dead bedroom. I came to this realization as well last year, treated her to a five star experience in our city only for her to make a back handed comment about how I picked it out of convenience. Then it happened again this summer while we vacationed how she felt she was too good for some of the places we’ve visited. This is someone who grew up in trailer parks and hasn’t contributed a dime to our net worth.",
                    "author": null,
                    "id": "ijsyi9s",
                    "parent_id": "t1_ijmhh5e",
                    "score": 1,
                    "created_utc": 1660183322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tell him he’s selling his body to the America gov to be used as fodder. Who’s the real prostie ?",
            "author": "Prosoander",
            "id": "ijmvn7d",
            "parent_id": "t3_wkbatm",
            "score": 9,
            "created_utc": 1660080577.0,
            "replies": []
        },
        {
            "body": "[Operational Security](https://en.wikipedia.org/wiki/Operations_security) is paramount in these relationship. Do not tell anyone anything that you wouldn't want used against you.",
            "author": "gnips56",
            "id": "ijmn293",
            "parent_id": "t3_wkbatm",
            "score": 5,
            "created_utc": 1660077234.0,
            "replies": []
        },
        {
            "body": "Best to tell no one except who is also in this lifestyle or who you need to in order to stay safe.",
            "author": null,
            "id": "ijmgpxt",
            "parent_id": "t3_wkbatm",
            "score": 5,
            "created_utc": 1660074788.0,
            "replies": []
        },
        {
            "body": "I literally just told a stranger online that I'm paranoid of my irls finding my reddit account.",
            "author": null,
            "id": "ijmf3uk",
            "parent_id": "t3_wkbatm",
            "score": 4,
            "created_utc": 1660074184.0,
            "replies": []
        },
        {
            "body": "This is why I have never told anyone in my life about this. Absolutely no one. Even blood can turn on you.\n\nI also never let SD know my real name, age, address, phone number, etc. \n\nTo any SD reading this, if you push your SBs boundaries on wanting to be discreet if she’s mentioned that it’s very important to her - go eff yourself. I’ve dropped so many SDs for this. So disrespectful. \n\nI’m sorry this happened though, never trust anyone.",
            "author": "spicycookie26",
            "id": "ijniech",
            "parent_id": "t3_wkbatm",
            "score": 4,
            "created_utc": 1660090147.0,
            "replies": []
        },
        {
            "body": "Double fuck you to your brother, firstly for this and later for that comment.",
            "author": null,
            "id": "ijmbl7s",
            "parent_id": "t3_wkbatm",
            "score": 7,
            "created_utc": 1660072857.0,
            "replies": []
        },
        {
            "body": "Love a woman that is critical of the military industrial complex. Call him a terrorist and a bootlicker the next time he calls you a prostie.",
            "author": null,
            "id": "ijnswn7",
            "parent_id": "t3_wkbatm",
            "score": 5,
            "created_utc": 1660094834.0,
            "replies": []
        },
        {
            "body": "There a stigma against women being promiscuous in most (all?) societies throughout history",
            "author": "Blade4Hoover",
            "id": "ijnga3r",
            "parent_id": "t3_wkbatm",
            "score": 3,
            "created_utc": 1660089210.0,
            "replies": []
        },
        {
            "body": "My brother would never do this. I think you just have a shitty family",
            "author": "nuitbelle",
            "id": "ijmw2qd",
            "parent_id": "t3_wkbatm",
            "score": 7,
            "created_utc": 1660080748.0,
            "replies": [
                {
                    "body": "*My brother would never*\n\n*Do this. I think you just have*\n\n*A shitty family*\n\n\\- nuitbelle\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "author": "haikusbot",
                    "id": "ijmw3vv",
                    "parent_id": "t1_ijmw2qd",
                    "score": 12,
                    "created_utc": 1660080761.0,
                    "replies": [
                        {
                            "body": "Yay 😂",
                            "author": "nuitbelle",
                            "id": "ijmw6lj",
                            "parent_id": "t1_ijmw3vv",
                            "score": 5,
                            "created_utc": 1660080792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Confide your mother that your brother is gay. That he opened himself to you, but that now he changed his mind and has gone crazy and  threatened to tell big lies about you because he thinks you may betray him.",
            "author": "gapaf",
            "id": "ijmru0h",
            "parent_id": "t3_wkbatm",
            "score": 6,
            "created_utc": 1660079069.0,
            "replies": []
        },
        {
            "body": "Life's not fair, bro.",
            "author": "SDinAsia",
            "id": "ijm6wxl",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660071075.0,
            "replies": [
                {
                    "body": "I know I’m just frustrated with myself because I thought I could trust him when he’s pulled shit like this in the past",
                    "author": null,
                    "id": "ijm8h2z",
                    "parent_id": "t1_ijm6wxl",
                    "score": 1,
                    "created_utc": 1660071665.0,
                    "replies": [
                        {
                            "body": "That doesn’t sound very smart.",
                            "author": "UseTheForceRey",
                            "id": "ijm8r30",
                            "parent_id": "t1_ijm8h2z",
                            "score": 5,
                            "created_utc": 1660071771.0,
                            "replies": [
                                {
                                    "body": "I’m hindsight it wasn’t and I’m well aware of that",
                                    "author": null,
                                    "id": "ijm8zqv",
                                    "parent_id": "t1_ijm8r30",
                                    "score": 5,
                                    "created_utc": 1660071863.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "People don’t understand. Fuck them lmao. It doesn’t matter what they think. Live your life your way and be unapologetic about it. If he wants the privilege (yea, the privilege) of being a part of your life he needs to respect you. He obviously has some issues if he has to put you down like that. Doesn’t matter what you do or who you are, you deserve respect. You could be an escort, an exotic dancer, a stay at home mom, a doctor.. and all of these lifestyles/life choices deserve the same amount of respect",
            "author": null,
            "id": "ijn4fe1",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660084134.0,
            "replies": [
                {
                    "body": "Ideally yes it should be like that but in our societies an escort and an exotic dancer does not/will not garner same respect as a stay home mom or a doctor . That’s the reality, you like it or not.",
                    "author": "macz786",
                    "id": "ijn6qx2",
                    "parent_id": "t1_ijn4fe1",
                    "score": 1,
                    "created_utc": 1660085092.0,
                    "replies": [
                        {
                            "body": "My point is if people aren’t showing you the respect you deserve you don’t have to have them in your life",
                            "author": null,
                            "id": "ijnpz27",
                            "parent_id": "t1_ijn6qx2",
                            "score": 1,
                            "created_utc": 1660093528.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "ya, def dont tell anyone you do this if you're a chick. maybe a friend tht you trust for safety issues",
            "author": "__vtec",
            "id": "ijo02nu",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660098057.0,
            "replies": []
        },
        {
            "body": "Girl, I guess take it as a lesson. \n\nYou’re young and you’re still in a stage where you’re feeling a lot of people out right?…well, you just learned today how your brother feels about this sort of thing and it’s not good. \n\nBrothers are often pretty intolerant and so are dads….this is something that you MAYBE tell a sister or even a mom but even that is still risky business. \n\nPeople don’t like women getting paid for this sort of stuff. Women ARE meant to receive though (literally our bodies are set up that way and men historically have provided for us since the dawn of time so….there’s that). \n\nSugaring can obviously take an emotional toll on you though and skew your perspective on men though so there is legitimate concern to wanting women close to a person to stay away from that too. \n\nBut yeah girl. Men often get jealous of this female receiving thing…even if you are like, a waitress making tons of tips a lot of men will get upset for how “easy” it is for you. In general, I’ve learned to keep money matters as secret as I can from men. Like, I’ve had men act out and get nasty with me when they’ve found out how much I make DOING “legitimate” work…like, the legitimacy thing is bullshit.",
            "author": "law05004",
            "id": "ijpdvq8",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660130683.0,
            "replies": []
        },
        {
            "body": "Lesson learned. IMO it is better to keep your sugar life to yourself.",
            "author": "GSSD",
            "id": "ijpoeno",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660136357.0,
            "replies": []
        },
        {
            "body": "Just act like you date a lot that’s what I do 😂 I date rich men because I live in a rich area that’s how I play it off.",
            "author": "1princesss",
            "id": "ijq22cm",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660142228.0,
            "replies": []
        },
        {
            "body": "Okay with all do respect, fuck what your brother says. He obviously doesn’t have the same morals as you so try not to let his comments bother you. Good for you for trying to confide in him and share about your personal life and I’m sorry he didn’t respond well. Fuck what anyone thinks. You do you boo 🤣🤣🤣 sending hugs 💓",
            "author": "whatsupmynameisSofia",
            "id": "ijqps0o",
            "parent_id": "t3_wkbatm",
            "score": 2,
            "created_utc": 1660151223.0,
            "replies": []
        },
        {
            "body": "Sounds fake.",
            "author": "YourSugarFather",
            "id": "ijn7tlm",
            "parent_id": "t3_wkbatm",
            "score": 0,
            "created_utc": 1660085549.0,
            "replies": [
                {
                    "body": "My post?",
                    "author": null,
                    "id": "ijn813o",
                    "parent_id": "t1_ijn7tlm",
                    "score": 1,
                    "created_utc": 1660085637.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea sad enough better not to tell fam or people who don’t understand",
            "author": "goddessbellamadisyn",
            "id": "ijmr2gj",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660078776.0,
            "replies": []
        },
        {
            "body": "Will people u care abt believe ur brother if he ever expose you?",
            "author": "sqroot123",
            "id": "ijn0zvj",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660082723.0,
            "replies": [
                {
                    "body": "Some people, yes. My mutual friends I have with him and my parents would probably be the first to find out if he ever were to put my secret out there. I have more to lose if my parents find out; I can always find new friends",
                    "author": null,
                    "id": "ijn1f4p",
                    "parent_id": "t1_ijn0zvj",
                    "score": 2,
                    "created_utc": 1660082897.0,
                    "replies": [
                        {
                            "body": "If u r in the same city as they are, then think about if u wanna continue and risk of a humiliation.  If u r not, who cares?   Just go with the flow.  Personally, I see sugar as two ppl having mutual benefits, be it sexual favorites or financial gains or emotional support.",
                            "author": "sqroot123",
                            "id": "ijn4cwu",
                            "parent_id": "t1_ijn1f4p",
                            "score": 2,
                            "created_utc": 1660084106.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never discuss my business with anyone who is not doing the exact same thing.  They just won’t get it",
            "author": "LotBuilder",
            "id": "ijn29o6",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660083244.0,
            "replies": [
                {
                    "body": "Even my therapist doesnt get it - the one person I can expect total secrecy and minimized judgement still doesn’t understand",
                    "author": "JDMultralight",
                    "id": "ijnepne",
                    "parent_id": "t1_ijn29o6",
                    "score": 4,
                    "created_utc": 1660088520.0,
                    "replies": []
                },
                {
                    "body": "Just a lurker. So do people in the lifestyle keep their lifestyle a secret from close friends and family?",
                    "author": "BigCandyMush",
                    "id": "ijoc4ac",
                    "parent_id": "t1_ijn29o6",
                    "score": 1,
                    "created_utc": 1660103929.0,
                    "replies": [
                        {
                            "body": "Yes. Including the friend who is open about being into the lifestyle and who told me about SA more than a decade ago. Need to know is a thing.",
                            "author": "SeaSDOptimist",
                            "id": "ijolcth",
                            "parent_id": "t1_ijoc4ac",
                            "score": 1,
                            "created_utc": 1660109280.0,
                            "replies": [
                                {
                                    "body": "So if you're with your sugar partner in public and run into your family/friends, what do you tell them? Especially if there's a 20+ year age gap",
                                    "author": "BigCandyMush",
                                    "id": "ijqvgno",
                                    "parent_id": "t1_ijolcth",
                                    "score": 1,
                                    "created_utc": 1660153314.0,
                                    "replies": [
                                        {
                                            "body": "Will burn that bridge when I get there. So far it has not happened. I don't think I'd bother with explaining much, but I am single, so it does not really matter that much to me.",
                                            "author": "SeaSDOptimist",
                                            "id": "ijqxzk2",
                                            "parent_id": "t1_ijqvgno",
                                            "score": 1,
                                            "created_utc": 1660154239.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Typicall yes.  It’s best to treat the sugar bowl like Fight Club.",
                            "author": "LotBuilder",
                            "id": "ijononv",
                            "parent_id": "t1_ijoc4ac",
                            "score": 1,
                            "created_utc": 1660110792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How much does he know?",
            "author": "NVOkie9018",
            "id": "ijn2z8o",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660083536.0,
            "replies": [
                {
                    "body": "He knows what the lifestyle entails and he knows that I’m planning on pursuing it for a while. That’s about it. He puts it on the same level as escorting and prostitution so it shows how much he actually knows",
                    "author": null,
                    "id": "ijn3ka1",
                    "parent_id": "t1_ijn2z8o",
                    "score": 2,
                    "created_utc": 1660083773.0,
                    "replies": [
                        {
                            "body": "Tell your brother that he’s doing the same thing if he EVER pays for anything when he’s dating.",
                            "author": "ExpertPerformance",
                            "id": "ijnb3w9",
                            "parent_id": "t1_ijn3ka1",
                            "score": 6,
                            "created_utc": 1660086956.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Brother or no, when people show psychopathic beliefs like he does you cant tell them shit unless its absolutely necessary.",
            "author": "JDMultralight",
            "id": "ijnau27",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660086840.0,
            "replies": []
        },
        {
            "body": "It's your life. Stop worrying and trying to impress your family or live by someone else's standards.\n\nMaybe if you did well on Onlyfans they'd be be more ok with it?",
            "author": "hartfordclub",
            "id": "ijnmdzc",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660091921.0,
            "replies": []
        },
        {
            "body": "Ehata dick",
            "author": "SD1070",
            "id": "ijnoi3b",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660092869.0,
            "replies": []
        },
        {
            "body": "He won't betray you.  Empty threats.  Ultimately, he loves his sister.",
            "author": null,
            "id": "ijnpkk1",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660093347.0,
            "replies": []
        },
        {
            "body": "He might be in it too and be worried that you will figure it out.",
            "author": "759CPF8auK",
            "id": "ijnrhta",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660094210.0,
            "replies": [
                {
                    "body": "Pfft that would hypocrisy at its finest",
                    "author": null,
                    "id": "ijnrwpi",
                    "parent_id": "t1_ijnrhta",
                    "score": 2,
                    "created_utc": 1660094392.0,
                    "replies": [
                        {
                            "body": "How old is ur bro and what is ur age?",
                            "author": "759CPF8auK",
                            "id": "ijns30q",
                            "parent_id": "t1_ijnrwpi",
                            "score": 1,
                            "created_utc": 1660094468.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It hurts to hear that from someone so close to you, even if you don’t like each other. I recommend the book “living successfully with screwed up people”. It might help you navigate situations such as this.",
            "author": "who-is-that-",
            "id": "ijot8wi",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660114808.0,
            "replies": []
        },
        {
            "body": "It really depends upon your situation and end goal.\n\nIf this is just a phase of life while you get through college or a financial rough patch or whatever, yeah for sure just keep it to yourself or be super careful and only share what you must with a fellow SB etc.\n\nIf you are likely to continue dating older men and it is more of a connection/relationship then getting to a place of not caring what others think is very helpful.  Come at it from of a place of self validation of your own life choices and you don’t need specific approval to feel like a successful person.  Some people will never ever validate your choices if they disagree with your opinion or choice.  Let that be their issue.\n\nYou will likely have people disconnect from you.  What emerges will be true friends that appreciate the real authentic you.  Anyone that uses personal attacks is not worthy of your attention or love, blood relation or not.\n\n(My >4yr SGF and I now full time cohabitate and some people I thought were friends are gone but the ones we have now are even better)",
            "author": "TXPolyDaddy",
            "id": "ijpk6eo",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660134264.0,
            "replies": []
        },
        {
            "body": "Tell him you're a prostie he can't afford and tell him he can put you on blast. \n\nThe thing with threat, once you show you don't care, they become powerless. \n\nIf you don't have texto confessing it and he put you on blast lie. Say he got mad at you for whatever and blablabla.",
            "author": "WiseRequirement9277",
            "id": "ijsfa26",
            "parent_id": "t3_wkbatm",
            "score": 1,
            "created_utc": 1660174873.0,
            "replies": []
        },
        {
            "body": "As the smart guy i believe you to be from other threads, my guess would be that your manner of not giving a fuck is actually extremely finely tuned in subtle ways.\n\nHaving a dgaf attitude isnt something to just toss into a young person’s life - its actually very refined and a specific and powerful tool.  Like all power tools, mishandling it is bad unless you got the skills.",
            "author": "JDMultralight",
            "id": "ijnbcnj",
            "parent_id": "t1_ijmg9l9",
            "score": 16,
            "created_utc": 1660087063.0,
            "replies": [
                {
                    "body": "Agreed. There are certain people whose opinions you don’t need to give a fuck about, but some of those you’d do best to still pretend to. It’s draining, but you get more out of life. Still though, everyone cares what someone thinks. I don’t think it’s unreasonable to want to open up to one’s sibling, if they think they’ll understand. Judging by this guy’s seemingly shoddy moral compass, however, I’m not sure I would’ve trusted his judgement like OP did…",
                    "author": "Im3Rhythmus3bleiben",
                    "id": "ijor5d1",
                    "parent_id": "t1_ijnbcnj",
                    "score": 6,
                    "created_utc": 1660113214.0,
                    "replies": []
                },
                {
                    "body": "Sorry, but I do not have a single clue what you just said. Could you possibly translate int understand English please",
                    "author": "AFSMSgt",
                    "id": "ijnjwbx",
                    "parent_id": "t1_ijnbcnj",
                    "score": 2,
                    "created_utc": 1660090814.0,
                    "replies": [
                        {
                            "body": "Oh just that there is an art to not giving a fuck - and you’re probably good at it.  But not everyone is one and probably shouldnt try it - especially young people whose general life skills arent well-developed",
                            "author": "JDMultralight",
                            "id": "ijo7ocb",
                            "parent_id": "t1_ijnjwbx",
                            "score": 3,
                            "created_utc": 1660101654.0,
                            "replies": [
                                {
                                    "body": "How good at it is he if didn’t understand what you said in the first place? But what you said is gold.",
                                    "author": "Arjansavenije99",
                                    "id": "ijodcum",
                                    "parent_id": "t1_ijo7ocb",
                                    "score": 5,
                                    "created_utc": 1660104595.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I respectfully disagree. Not giving a fuck takes no skill. It is the result of self confidence. It is knowing that their opinion means nothing to you because you are better than them.",
                    "author": "Blueexpression",
                    "id": "ijqn2s9",
                    "parent_id": "t1_ijnbcnj",
                    "score": 1,
                    "created_utc": 1660150230.0,
                    "replies": [
                        {
                            "body": "Yes confidence is essential to not giving a fuck. For me at least it was a learning process tho - especially because most of the only people who I might have cared about had my respect so I wasn’t better than them. \n\nOn the confidence tip it was more that I had to confident about the fact that I was thriving or else Id worry that they were right, know that I might benefit from advice, then Id start to drift toward thinking more about image.",
                            "author": "JDMultralight",
                            "id": "ijr0mkz",
                            "parent_id": "t1_ijqn2s9",
                            "score": 1,
                            "created_utc": 1660155219.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saaaaame! I like to say that what someone else thinks of me is none of my business",
            "author": "BaddB1tch",
            "id": "ijn7h4v",
            "parent_id": "t1_ijmg9l9",
            "score": 1,
            "created_utc": 1660085401.0,
            "replies": []
        },
        {
            "body": "Though this advice might be right it's not possible I think. We need validation from other people to feel good. This is one of the main reasons people in the bowl hang out in this subreddit. A life without validation is like a plant without water.",
            "author": "krama0torsk",
            "id": "ijo8o72",
            "parent_id": "t1_ijmg9l9",
            "score": 1,
            "created_utc": 1660102153.0,
            "replies": []
        },
        {
            "body": "Their opinion don't hurt",
            "author": "DoodleRoodle",
            "id": "ijmebji",
            "parent_id": "t1_ijmb51r",
            "score": 9,
            "created_utc": 1660073891.0,
            "replies": [
                {
                    "body": "…. As much",
                    "author": "YakiMe",
                    "id": "ijnf1li",
                    "parent_id": "t1_ijmebji",
                    "score": 6,
                    "created_utc": 1660088667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At least they are randoms that are in the same lifestyle you have chosen.",
            "author": "willfromvb",
            "id": "ijnzaqg",
            "parent_id": "t1_ijmb51r",
            "score": 1,
            "created_utc": 1660097703.0,
            "replies": []
        },
        {
            "body": "Yesss",
            "author": "Konradwolf",
            "id": "ijpemfm",
            "parent_id": "t1_ijmby0u",
            "score": 1,
            "created_utc": 1660131134.0,
            "replies": []
        },
        {
            "body": "That's why we should ignore posts on this forum from people, not in the lifestyle, casting shame on the lifestyle.",
            "author": "willfromvb",
            "id": "ijnz5e1",
            "parent_id": "t1_ijma9ij",
            "score": 4,
            "created_utc": 1660097636.0,
            "replies": []
        },
        {
            "body": "Someone give this man a beer please 🙏⭐⭐",
            "author": "FructoseLady",
            "id": "ijmk1n3",
            "parent_id": "t1_ijmhh5e",
            "score": 6,
            "created_utc": 1660076063.0,
            "replies": []
        },
        {
            "body": "Was with you until the 35 / 15 dynamic. That’s f*cking disgusting no matter what. Everyone please leave 15 years olds alone. But I get your point, and yes it’s a backward world.",
            "author": "Orchidinflight",
            "id": "ijpdgtt",
            "parent_id": "t1_ijmhh5e",
            "score": 6,
            "created_utc": 1660130425.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ijpko9p",
                    "parent_id": "t1_ijpdgtt",
                    "score": 1,
                    "created_utc": 1660134526.0,
                    "replies": [
                        {
                            "body": "I do get your point, but is there an example of a 15 year old boy with an older woman in media that’s glorified? I can’t think of one, because that’s horrifying to everyone. \n\n(I do of course see that cougars in media are celebrated in a way that older men/younger women are not.)",
                            "author": "Orchidinflight",
                            "id": "ijpnfgq",
                            "parent_id": "t1_ijpko9p",
                            "score": 1,
                            "created_utc": 1660135892.0,
                            "replies": [
                                {
                                    "body": "It's awful and it's real. Go back 15+ years and see how the m student, f teacher dynamic was discussed in pop culture.",
                                    "author": "Eastern_Ad5817",
                                    "id": "ijq0kru",
                                    "parent_id": "t1_ijpnfgq",
                                    "score": 1,
                                    "created_utc": 1660141623.0,
                                    "replies": [
                                        {
                                            "body": "Maybe amongst young men (?), but women by and large thought that was horrifying. And it was crucified in the media. I was certainly horrified, as well as all the women I knew. Granted that’s anecdotal but it seems that’s where you’re coming from as well. No one in the media thought that was ok.",
                                            "author": "Orchidinflight",
                                            "id": "ijq7a45",
                                            "parent_id": "t1_ijq0kru",
                                            "score": 1,
                                            "created_utc": 1660144285.0,
                                            "replies": [
                                                {
                                                    "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
                                                    "author": "Eastern_Ad5817",
                                                    "id": "ike231i",
                                                    "parent_id": "t1_ijq7a45",
                                                    "score": 1,
                                                    "created_utc": 1660575659.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                                                            "author": "Orchidinflight",
                                                            "id": "ike867m",
                                                            "parent_id": "t1_ike231i",
                                                            "score": 1,
                                                            "created_utc": 1660578121.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Society also thinks wife as a noble human being in a marriage however SBF as a paid escort. Can’t change that mind set.",
            "author": "macz786",
            "id": "ijn62bz",
            "parent_id": "t1_ijmhh5e",
            "score": 2,
            "created_utc": 1660084808.0,
            "replies": [
                {
                    "body": "That and its fine for wife to withhold sex and emotional connection,she isn't obligated, which she isn't, but looks down on husband wanting it elsewhere.",
                    "author": null,
                    "id": "ijn9fc1",
                    "parent_id": "t1_ijn62bz",
                    "score": 6,
                    "created_utc": 1660086232.0,
                    "replies": [
                        {
                            "body": "This is the craziest part. Men will put up with an asinine amount of attitude, bitchy borderline behavior  in exchange for sex once or twice a week and the vast majority of women into a long term committed relationship can’t even give them that. Put he’s a piece of shit who owes her half of everything and alimony going forward if he gets it elsewhere. Insane",
                            "author": "mypenisis6incircum",
                            "id": "ijpna2t",
                            "parent_id": "t1_ijn9fc1",
                            "score": 2,
                            "created_utc": 1660135819.0,
                            "replies": [
                                {
                                    "body": "I know the double standard is out of control.  Equality except when it doesn't suit you is how it seems.",
                                    "author": null,
                                    "id": "ijpojm9",
                                    "parent_id": "t1_ijpna2t",
                                    "score": 0,
                                    "created_utc": 1660136422.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Men should stop getting married. There’s really no up sides.",
            "author": "gigsome",
            "id": "ijr1gg8",
            "parent_id": "t1_ijmhh5e",
            "score": 1,
            "created_utc": 1660155530.0,
            "replies": []
        },
        {
            "body": "Ah a dead bedroom. I came to this realization as well last year, treated her to a five star experience in our city only for her to make a back handed comment about how I picked it out of convenience. Then it happened again this summer while we vacationed how she felt she was too good for some of the places we’ve visited. This is someone who grew up in trailer parks and hasn’t contributed a dime to our net worth.",
            "author": null,
            "id": "ijsyi9s",
            "parent_id": "t1_ijmhh5e",
            "score": 1,
            "created_utc": 1660183322.0,
            "replies": []
        },
        {
            "body": "*My brother would never*\n\n*Do this. I think you just have*\n\n*A shitty family*\n\n\\- nuitbelle\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "author": "haikusbot",
            "id": "ijmw3vv",
            "parent_id": "t1_ijmw2qd",
            "score": 12,
            "created_utc": 1660080761.0,
            "replies": [
                {
                    "body": "Yay 😂",
                    "author": "nuitbelle",
                    "id": "ijmw6lj",
                    "parent_id": "t1_ijmw3vv",
                    "score": 5,
                    "created_utc": 1660080792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know I’m just frustrated with myself because I thought I could trust him when he’s pulled shit like this in the past",
            "author": null,
            "id": "ijm8h2z",
            "parent_id": "t1_ijm6wxl",
            "score": 1,
            "created_utc": 1660071665.0,
            "replies": [
                {
                    "body": "That doesn’t sound very smart.",
                    "author": "UseTheForceRey",
                    "id": "ijm8r30",
                    "parent_id": "t1_ijm8h2z",
                    "score": 5,
                    "created_utc": 1660071771.0,
                    "replies": [
                        {
                            "body": "I’m hindsight it wasn’t and I’m well aware of that",
                            "author": null,
                            "id": "ijm8zqv",
                            "parent_id": "t1_ijm8r30",
                            "score": 5,
                            "created_utc": 1660071863.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ideally yes it should be like that but in our societies an escort and an exotic dancer does not/will not garner same respect as a stay home mom or a doctor . That’s the reality, you like it or not.",
            "author": "macz786",
            "id": "ijn6qx2",
            "parent_id": "t1_ijn4fe1",
            "score": 1,
            "created_utc": 1660085092.0,
            "replies": [
                {
                    "body": "My point is if people aren’t showing you the respect you deserve you don’t have to have them in your life",
                    "author": null,
                    "id": "ijnpz27",
                    "parent_id": "t1_ijn6qx2",
                    "score": 1,
                    "created_utc": 1660093528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My post?",
            "author": null,
            "id": "ijn813o",
            "parent_id": "t1_ijn7tlm",
            "score": 1,
            "created_utc": 1660085637.0,
            "replies": []
        },
        {
            "body": "Some people, yes. My mutual friends I have with him and my parents would probably be the first to find out if he ever were to put my secret out there. I have more to lose if my parents find out; I can always find new friends",
            "author": null,
            "id": "ijn1f4p",
            "parent_id": "t1_ijn0zvj",
            "score": 2,
            "created_utc": 1660082897.0,
            "replies": [
                {
                    "body": "If u r in the same city as they are, then think about if u wanna continue and risk of a humiliation.  If u r not, who cares?   Just go with the flow.  Personally, I see sugar as two ppl having mutual benefits, be it sexual favorites or financial gains or emotional support.",
                    "author": "sqroot123",
                    "id": "ijn4cwu",
                    "parent_id": "t1_ijn1f4p",
                    "score": 2,
                    "created_utc": 1660084106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even my therapist doesnt get it - the one person I can expect total secrecy and minimized judgement still doesn’t understand",
            "author": "JDMultralight",
            "id": "ijnepne",
            "parent_id": "t1_ijn29o6",
            "score": 4,
            "created_utc": 1660088520.0,
            "replies": []
        },
        {
            "body": "Just a lurker. So do people in the lifestyle keep their lifestyle a secret from close friends and family?",
            "author": "BigCandyMush",
            "id": "ijoc4ac",
            "parent_id": "t1_ijn29o6",
            "score": 1,
            "created_utc": 1660103929.0,
            "replies": [
                {
                    "body": "Yes. Including the friend who is open about being into the lifestyle and who told me about SA more than a decade ago. Need to know is a thing.",
                    "author": "SeaSDOptimist",
                    "id": "ijolcth",
                    "parent_id": "t1_ijoc4ac",
                    "score": 1,
                    "created_utc": 1660109280.0,
                    "replies": [
                        {
                            "body": "So if you're with your sugar partner in public and run into your family/friends, what do you tell them? Especially if there's a 20+ year age gap",
                            "author": "BigCandyMush",
                            "id": "ijqvgno",
                            "parent_id": "t1_ijolcth",
                            "score": 1,
                            "created_utc": 1660153314.0,
                            "replies": [
                                {
                                    "body": "Will burn that bridge when I get there. So far it has not happened. I don't think I'd bother with explaining much, but I am single, so it does not really matter that much to me.",
                                    "author": "SeaSDOptimist",
                                    "id": "ijqxzk2",
                                    "parent_id": "t1_ijqvgno",
                                    "score": 1,
                                    "created_utc": 1660154239.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Typicall yes.  It’s best to treat the sugar bowl like Fight Club.",
                    "author": "LotBuilder",
                    "id": "ijononv",
                    "parent_id": "t1_ijoc4ac",
                    "score": 1,
                    "created_utc": 1660110792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He knows what the lifestyle entails and he knows that I’m planning on pursuing it for a while. That’s about it. He puts it on the same level as escorting and prostitution so it shows how much he actually knows",
            "author": null,
            "id": "ijn3ka1",
            "parent_id": "t1_ijn2z8o",
            "score": 2,
            "created_utc": 1660083773.0,
            "replies": [
                {
                    "body": "Tell your brother that he’s doing the same thing if he EVER pays for anything when he’s dating.",
                    "author": "ExpertPerformance",
                    "id": "ijnb3w9",
                    "parent_id": "t1_ijn3ka1",
                    "score": 6,
                    "created_utc": 1660086956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pfft that would hypocrisy at its finest",
            "author": null,
            "id": "ijnrwpi",
            "parent_id": "t1_ijnrhta",
            "score": 2,
            "created_utc": 1660094392.0,
            "replies": [
                {
                    "body": "How old is ur bro and what is ur age?",
                    "author": "759CPF8auK",
                    "id": "ijns30q",
                    "parent_id": "t1_ijnrwpi",
                    "score": 1,
                    "created_utc": 1660094468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. There are certain people whose opinions you don’t need to give a fuck about, but some of those you’d do best to still pretend to. It’s draining, but you get more out of life. Still though, everyone cares what someone thinks. I don’t think it’s unreasonable to want to open up to one’s sibling, if they think they’ll understand. Judging by this guy’s seemingly shoddy moral compass, however, I’m not sure I would’ve trusted his judgement like OP did…",
            "author": "Im3Rhythmus3bleiben",
            "id": "ijor5d1",
            "parent_id": "t1_ijnbcnj",
            "score": 6,
            "created_utc": 1660113214.0,
            "replies": []
        },
        {
            "body": "Sorry, but I do not have a single clue what you just said. Could you possibly translate int understand English please",
            "author": "AFSMSgt",
            "id": "ijnjwbx",
            "parent_id": "t1_ijnbcnj",
            "score": 2,
            "created_utc": 1660090814.0,
            "replies": [
                {
                    "body": "Oh just that there is an art to not giving a fuck - and you’re probably good at it.  But not everyone is one and probably shouldnt try it - especially young people whose general life skills arent well-developed",
                    "author": "JDMultralight",
                    "id": "ijo7ocb",
                    "parent_id": "t1_ijnjwbx",
                    "score": 3,
                    "created_utc": 1660101654.0,
                    "replies": [
                        {
                            "body": "How good at it is he if didn’t understand what you said in the first place? But what you said is gold.",
                            "author": "Arjansavenije99",
                            "id": "ijodcum",
                            "parent_id": "t1_ijo7ocb",
                            "score": 5,
                            "created_utc": 1660104595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I respectfully disagree. Not giving a fuck takes no skill. It is the result of self confidence. It is knowing that their opinion means nothing to you because you are better than them.",
            "author": "Blueexpression",
            "id": "ijqn2s9",
            "parent_id": "t1_ijnbcnj",
            "score": 1,
            "created_utc": 1660150230.0,
            "replies": [
                {
                    "body": "Yes confidence is essential to not giving a fuck. For me at least it was a learning process tho - especially because most of the only people who I might have cared about had my respect so I wasn’t better than them. \n\nOn the confidence tip it was more that I had to confident about the fact that I was thriving or else Id worry that they were right, know that I might benefit from advice, then Id start to drift toward thinking more about image.",
                    "author": "JDMultralight",
                    "id": "ijr0mkz",
                    "parent_id": "t1_ijqn2s9",
                    "score": 1,
                    "created_utc": 1660155219.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "…. As much",
            "author": "YakiMe",
            "id": "ijnf1li",
            "parent_id": "t1_ijmebji",
            "score": 6,
            "created_utc": 1660088667.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijpko9p",
            "parent_id": "t1_ijpdgtt",
            "score": 1,
            "created_utc": 1660134526.0,
            "replies": [
                {
                    "body": "I do get your point, but is there an example of a 15 year old boy with an older woman in media that’s glorified? I can’t think of one, because that’s horrifying to everyone. \n\n(I do of course see that cougars in media are celebrated in a way that older men/younger women are not.)",
                    "author": "Orchidinflight",
                    "id": "ijpnfgq",
                    "parent_id": "t1_ijpko9p",
                    "score": 1,
                    "created_utc": 1660135892.0,
                    "replies": [
                        {
                            "body": "It's awful and it's real. Go back 15+ years and see how the m student, f teacher dynamic was discussed in pop culture.",
                            "author": "Eastern_Ad5817",
                            "id": "ijq0kru",
                            "parent_id": "t1_ijpnfgq",
                            "score": 1,
                            "created_utc": 1660141623.0,
                            "replies": [
                                {
                                    "body": "Maybe amongst young men (?), but women by and large thought that was horrifying. And it was crucified in the media. I was certainly horrified, as well as all the women I knew. Granted that’s anecdotal but it seems that’s where you’re coming from as well. No one in the media thought that was ok.",
                                    "author": "Orchidinflight",
                                    "id": "ijq7a45",
                                    "parent_id": "t1_ijq0kru",
                                    "score": 1,
                                    "created_utc": 1660144285.0,
                                    "replies": [
                                        {
                                            "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
                                            "author": "Eastern_Ad5817",
                                            "id": "ike231i",
                                            "parent_id": "t1_ijq7a45",
                                            "score": 1,
                                            "created_utc": 1660575659.0,
                                            "replies": [
                                                {
                                                    "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                                                    "author": "Orchidinflight",
                                                    "id": "ike867m",
                                                    "parent_id": "t1_ike231i",
                                                    "score": 1,
                                                    "created_utc": 1660578121.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That and its fine for wife to withhold sex and emotional connection,she isn't obligated, which she isn't, but looks down on husband wanting it elsewhere.",
            "author": null,
            "id": "ijn9fc1",
            "parent_id": "t1_ijn62bz",
            "score": 6,
            "created_utc": 1660086232.0,
            "replies": [
                {
                    "body": "This is the craziest part. Men will put up with an asinine amount of attitude, bitchy borderline behavior  in exchange for sex once or twice a week and the vast majority of women into a long term committed relationship can’t even give them that. Put he’s a piece of shit who owes her half of everything and alimony going forward if he gets it elsewhere. Insane",
                    "author": "mypenisis6incircum",
                    "id": "ijpna2t",
                    "parent_id": "t1_ijn9fc1",
                    "score": 2,
                    "created_utc": 1660135819.0,
                    "replies": [
                        {
                            "body": "I know the double standard is out of control.  Equality except when it doesn't suit you is how it seems.",
                            "author": null,
                            "id": "ijpojm9",
                            "parent_id": "t1_ijpna2t",
                            "score": 0,
                            "created_utc": 1660136422.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yay 😂",
            "author": "nuitbelle",
            "id": "ijmw6lj",
            "parent_id": "t1_ijmw3vv",
            "score": 5,
            "created_utc": 1660080792.0,
            "replies": []
        },
        {
            "body": "That doesn’t sound very smart.",
            "author": "UseTheForceRey",
            "id": "ijm8r30",
            "parent_id": "t1_ijm8h2z",
            "score": 5,
            "created_utc": 1660071771.0,
            "replies": [
                {
                    "body": "I’m hindsight it wasn’t and I’m well aware of that",
                    "author": null,
                    "id": "ijm8zqv",
                    "parent_id": "t1_ijm8r30",
                    "score": 5,
                    "created_utc": 1660071863.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My point is if people aren’t showing you the respect you deserve you don’t have to have them in your life",
            "author": null,
            "id": "ijnpz27",
            "parent_id": "t1_ijn6qx2",
            "score": 1,
            "created_utc": 1660093528.0,
            "replies": []
        },
        {
            "body": "If u r in the same city as they are, then think about if u wanna continue and risk of a humiliation.  If u r not, who cares?   Just go with the flow.  Personally, I see sugar as two ppl having mutual benefits, be it sexual favorites or financial gains or emotional support.",
            "author": "sqroot123",
            "id": "ijn4cwu",
            "parent_id": "t1_ijn1f4p",
            "score": 2,
            "created_utc": 1660084106.0,
            "replies": []
        },
        {
            "body": "Yes. Including the friend who is open about being into the lifestyle and who told me about SA more than a decade ago. Need to know is a thing.",
            "author": "SeaSDOptimist",
            "id": "ijolcth",
            "parent_id": "t1_ijoc4ac",
            "score": 1,
            "created_utc": 1660109280.0,
            "replies": [
                {
                    "body": "So if you're with your sugar partner in public and run into your family/friends, what do you tell them? Especially if there's a 20+ year age gap",
                    "author": "BigCandyMush",
                    "id": "ijqvgno",
                    "parent_id": "t1_ijolcth",
                    "score": 1,
                    "created_utc": 1660153314.0,
                    "replies": [
                        {
                            "body": "Will burn that bridge when I get there. So far it has not happened. I don't think I'd bother with explaining much, but I am single, so it does not really matter that much to me.",
                            "author": "SeaSDOptimist",
                            "id": "ijqxzk2",
                            "parent_id": "t1_ijqvgno",
                            "score": 1,
                            "created_utc": 1660154239.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Typicall yes.  It’s best to treat the sugar bowl like Fight Club.",
            "author": "LotBuilder",
            "id": "ijononv",
            "parent_id": "t1_ijoc4ac",
            "score": 1,
            "created_utc": 1660110792.0,
            "replies": []
        },
        {
            "body": "Tell your brother that he’s doing the same thing if he EVER pays for anything when he’s dating.",
            "author": "ExpertPerformance",
            "id": "ijnb3w9",
            "parent_id": "t1_ijn3ka1",
            "score": 6,
            "created_utc": 1660086956.0,
            "replies": []
        },
        {
            "body": "How old is ur bro and what is ur age?",
            "author": "759CPF8auK",
            "id": "ijns30q",
            "parent_id": "t1_ijnrwpi",
            "score": 1,
            "created_utc": 1660094468.0,
            "replies": []
        },
        {
            "body": "Oh just that there is an art to not giving a fuck - and you’re probably good at it.  But not everyone is one and probably shouldnt try it - especially young people whose general life skills arent well-developed",
            "author": "JDMultralight",
            "id": "ijo7ocb",
            "parent_id": "t1_ijnjwbx",
            "score": 3,
            "created_utc": 1660101654.0,
            "replies": [
                {
                    "body": "How good at it is he if didn’t understand what you said in the first place? But what you said is gold.",
                    "author": "Arjansavenije99",
                    "id": "ijodcum",
                    "parent_id": "t1_ijo7ocb",
                    "score": 5,
                    "created_utc": 1660104595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes confidence is essential to not giving a fuck. For me at least it was a learning process tho - especially because most of the only people who I might have cared about had my respect so I wasn’t better than them. \n\nOn the confidence tip it was more that I had to confident about the fact that I was thriving or else Id worry that they were right, know that I might benefit from advice, then Id start to drift toward thinking more about image.",
            "author": "JDMultralight",
            "id": "ijr0mkz",
            "parent_id": "t1_ijqn2s9",
            "score": 1,
            "created_utc": 1660155219.0,
            "replies": []
        },
        {
            "body": "I do get your point, but is there an example of a 15 year old boy with an older woman in media that’s glorified? I can’t think of one, because that’s horrifying to everyone. \n\n(I do of course see that cougars in media are celebrated in a way that older men/younger women are not.)",
            "author": "Orchidinflight",
            "id": "ijpnfgq",
            "parent_id": "t1_ijpko9p",
            "score": 1,
            "created_utc": 1660135892.0,
            "replies": [
                {
                    "body": "It's awful and it's real. Go back 15+ years and see how the m student, f teacher dynamic was discussed in pop culture.",
                    "author": "Eastern_Ad5817",
                    "id": "ijq0kru",
                    "parent_id": "t1_ijpnfgq",
                    "score": 1,
                    "created_utc": 1660141623.0,
                    "replies": [
                        {
                            "body": "Maybe amongst young men (?), but women by and large thought that was horrifying. And it was crucified in the media. I was certainly horrified, as well as all the women I knew. Granted that’s anecdotal but it seems that’s where you’re coming from as well. No one in the media thought that was ok.",
                            "author": "Orchidinflight",
                            "id": "ijq7a45",
                            "parent_id": "t1_ijq0kru",
                            "score": 1,
                            "created_utc": 1660144285.0,
                            "replies": [
                                {
                                    "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
                                    "author": "Eastern_Ad5817",
                                    "id": "ike231i",
                                    "parent_id": "t1_ijq7a45",
                                    "score": 1,
                                    "created_utc": 1660575659.0,
                                    "replies": [
                                        {
                                            "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                                            "author": "Orchidinflight",
                                            "id": "ike867m",
                                            "parent_id": "t1_ike231i",
                                            "score": 1,
                                            "created_utc": 1660578121.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the craziest part. Men will put up with an asinine amount of attitude, bitchy borderline behavior  in exchange for sex once or twice a week and the vast majority of women into a long term committed relationship can’t even give them that. Put he’s a piece of shit who owes her half of everything and alimony going forward if he gets it elsewhere. Insane",
            "author": "mypenisis6incircum",
            "id": "ijpna2t",
            "parent_id": "t1_ijn9fc1",
            "score": 2,
            "created_utc": 1660135819.0,
            "replies": [
                {
                    "body": "I know the double standard is out of control.  Equality except when it doesn't suit you is how it seems.",
                    "author": null,
                    "id": "ijpojm9",
                    "parent_id": "t1_ijpna2t",
                    "score": 0,
                    "created_utc": 1660136422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m hindsight it wasn’t and I’m well aware of that",
            "author": null,
            "id": "ijm8zqv",
            "parent_id": "t1_ijm8r30",
            "score": 5,
            "created_utc": 1660071863.0,
            "replies": []
        },
        {
            "body": "So if you're with your sugar partner in public and run into your family/friends, what do you tell them? Especially if there's a 20+ year age gap",
            "author": "BigCandyMush",
            "id": "ijqvgno",
            "parent_id": "t1_ijolcth",
            "score": 1,
            "created_utc": 1660153314.0,
            "replies": [
                {
                    "body": "Will burn that bridge when I get there. So far it has not happened. I don't think I'd bother with explaining much, but I am single, so it does not really matter that much to me.",
                    "author": "SeaSDOptimist",
                    "id": "ijqxzk2",
                    "parent_id": "t1_ijqvgno",
                    "score": 1,
                    "created_utc": 1660154239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How good at it is he if didn’t understand what you said in the first place? But what you said is gold.",
            "author": "Arjansavenije99",
            "id": "ijodcum",
            "parent_id": "t1_ijo7ocb",
            "score": 5,
            "created_utc": 1660104595.0,
            "replies": []
        },
        {
            "body": "It's awful and it's real. Go back 15+ years and see how the m student, f teacher dynamic was discussed in pop culture.",
            "author": "Eastern_Ad5817",
            "id": "ijq0kru",
            "parent_id": "t1_ijpnfgq",
            "score": 1,
            "created_utc": 1660141623.0,
            "replies": [
                {
                    "body": "Maybe amongst young men (?), but women by and large thought that was horrifying. And it was crucified in the media. I was certainly horrified, as well as all the women I knew. Granted that’s anecdotal but it seems that’s where you’re coming from as well. No one in the media thought that was ok.",
                    "author": "Orchidinflight",
                    "id": "ijq7a45",
                    "parent_id": "t1_ijq0kru",
                    "score": 1,
                    "created_utc": 1660144285.0,
                    "replies": [
                        {
                            "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
                            "author": "Eastern_Ad5817",
                            "id": "ike231i",
                            "parent_id": "t1_ijq7a45",
                            "score": 1,
                            "created_utc": 1660575659.0,
                            "replies": [
                                {
                                    "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                                    "author": "Orchidinflight",
                                    "id": "ike867m",
                                    "parent_id": "t1_ike231i",
                                    "score": 1,
                                    "created_utc": 1660578121.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know the double standard is out of control.  Equality except when it doesn't suit you is how it seems.",
            "author": null,
            "id": "ijpojm9",
            "parent_id": "t1_ijpna2t",
            "score": 0,
            "created_utc": 1660136422.0,
            "replies": []
        },
        {
            "body": "Will burn that bridge when I get there. So far it has not happened. I don't think I'd bother with explaining much, but I am single, so it does not really matter that much to me.",
            "author": "SeaSDOptimist",
            "id": "ijqxzk2",
            "parent_id": "t1_ijqvgno",
            "score": 1,
            "created_utc": 1660154239.0,
            "replies": []
        },
        {
            "body": "Maybe amongst young men (?), but women by and large thought that was horrifying. And it was crucified in the media. I was certainly horrified, as well as all the women I knew. Granted that’s anecdotal but it seems that’s where you’re coming from as well. No one in the media thought that was ok.",
            "author": "Orchidinflight",
            "id": "ijq7a45",
            "parent_id": "t1_ijq0kru",
            "score": 1,
            "created_utc": 1660144285.0,
            "replies": [
                {
                    "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
                    "author": "Eastern_Ad5817",
                    "id": "ike231i",
                    "parent_id": "t1_ijq7a45",
                    "score": 1,
                    "created_utc": 1660575659.0,
                    "replies": [
                        {
                            "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                            "author": "Orchidinflight",
                            "id": "ike867m",
                            "parent_id": "t1_ike231i",
                            "score": 1,
                            "created_utc": 1660578121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am a woman, but I might be a different generation than you.  It seemed like teacher/student things were taboo but seen more as naughty and a part of secret sexuality rather than dangerous and abusive. \n\nFrom popular songs to TV subplots to movies, the media isn't exactly shy with it. \n\nhttps://www.imdb.com/search/keyword/?keywords=female-teacher-male-student-relationship",
            "author": "Eastern_Ad5817",
            "id": "ike231i",
            "parent_id": "t1_ijq7a45",
            "score": 1,
            "created_utc": 1660575659.0,
            "replies": [
                {
                    "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
                    "author": "Orchidinflight",
                    "id": "ike867m",
                    "parent_id": "t1_ike231i",
                    "score": 1,
                    "created_utc": 1660578121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m 41, I remember the scandal quite well. Examples of movies on IMDb do not represent what the news media thought of what was going on. I remember well how everyone spoke about it, which was complete disgust. That woman, any woman like her, was a predator, 15 years ago. En masse public opinion. There’s also numerous tv shows glamorizing serial killers, that doesn’t mean the average Joe thinks it’s cool to be a serial killer. But they’ll enjoy the show. So will I. An ex of mine liked step-daughter porn, that doesn’t mean he wouldn’t condemn that kind of relationship in real life. Fantasy or storytelling media, and what any of us would stand for in the real world and the news are quite different.",
            "author": "Orchidinflight",
            "id": "ike867m",
            "parent_id": "t1_ike231i",
            "score": 1,
            "created_utc": 1660578121.0,
            "replies": []
        }
    ]
}