{
    "title": "Feeling loved today",
    "post_id": "zlkmja",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zlkmja/feeling_loved_today/",
    "author": "LotBuilder",
    "body": "I got into a fairly bad car accident this morning.  Fractured sternum,  7 ribs and a fractured hand.  A dozen staples in my head.  I’m in pain but ok.  \n\nMy girls came through for me in such a big way.  I have 3 long term (3+ years) SB’s.  Two local (SF) and one in LA.  One dropped everything,  dropped off an iPad and charger, picked up my kids from school. Took care of my dog. She took so much stress off me.  Another came to visit and brought me a Jamba Juice as soon as I was cleared to eat.  I was starving with insane cotton mouth.   She sat with me for 3 hours.   My SB from LA jumped in her car and got here as soon as she could.  I told her not to but she did anyway.  She’s in Nursing school, was a EMT and a scribe she knows how to get attention from the Nurses.  I’m getting treated like a vip.   The nurses were joking and asked if I’m Own a modeling agency or am I Dan Blazarian.😂     I am drugged up,  sappy and grateful so I couldn’t wait for rants and raves on Friday,  my girls came through for me in a huge way.  I love and appreciate them so much.  I am grateful that we have been able to build close relationships.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zlkmja/feeling_loved_today/",
    "score": 95,
    "upvote_ratio": 0.95,
    "created_utc": 1671002641.0,
    "num_comments": 33,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "That is scary brother. I hope you take some time to rest and heal up. Terrible accident but glad you are okay.\n\nYour SBs are not the only ones rooting for you fam. If you need anything at all, you just DM me.  I will help you friend, no doubt.\n\nHOWEVER, I will also send you an unsolicited case of peach martinis, delivered by three male strippers. Those peach martinis will be banana hammock flavored.  Also, I will literally go around hitting on the nurses at your hospital, likely unsuccessfully.\n\nJoking about the male strippers but serious if you need anything.",
            "author": "TastySpermDevice",
            "id": "j05wskp",
            "parent_id": "t3_zlkmja",
            "score": 24,
            "created_utc": 1671005284.0,
            "replies": [
                {
                    "body": "> Those peach martinis will be banana hammock flavored.\n\nI don't *even* want to know what that tastes like.",
                    "author": "FLRAdvocate",
                    "id": "j07i0op",
                    "parent_id": "t1_j05wskp",
                    "score": 4,
                    "created_utc": 1671037539.0,
                    "replies": [
                        {
                            "body": "*Your loss.*  :)",
                            "author": "TastySpermDevice",
                            "id": "j07iac1",
                            "parent_id": "t1_j07i0op",
                            "score": 6,
                            "created_utc": 1671037640.0,
                            "replies": [
                                {
                                    "body": "There are some losses I am just willing to accept, sir. lol",
                                    "author": "FLRAdvocate",
                                    "id": "j07immy",
                                    "parent_id": "t1_j07iac1",
                                    "score": 3,
                                    "created_utc": 1671037769.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Appreciate it 🙏.  I’m in good hands",
                    "author": "LotBuilder",
                    "id": "j05wzzr",
                    "parent_id": "t1_j05wskp",
                    "score": 4,
                    "created_utc": 1671005448.0,
                    "replies": [
                        {
                            "body": "Going to interpret that as a happy ending and you cannot stop me. Muhahahah.\n\nSeriously brother, if you need anything project managed remotely, I can step up. Anytime.",
                            "author": "TastySpermDevice",
                            "id": "j05x9er",
                            "parent_id": "t1_j05wzzr",
                            "score": 5,
                            "created_utc": 1671005663.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get well. But this is a good example of how deep and valuable these relationships can be",
            "author": "jwmain22",
            "id": "j0637xg",
            "parent_id": "t3_zlkmja",
            "score": 14,
            "created_utc": 1671010676.0,
            "replies": []
        },
        {
            "body": "Congrats. Glad you are ok. What’s your monthly bill for these 3 ladies that take such good care of you ? Asking for a friend..",
            "author": "lcastill1",
            "id": "j06kxx1",
            "parent_id": "t3_zlkmja",
            "score": 9,
            "created_utc": 1671023485.0,
            "replies": [
                {
                    "body": "Thousand a week each and gifts.  Helped one buy a business.",
                    "author": "LotBuilder",
                    "id": "j076oex",
                    "parent_id": "t1_j06kxx1",
                    "score": 12,
                    "created_utc": 1671033109.0,
                    "replies": [
                        {
                            "body": "No wonder they made you feel like a VIP! 😅",
                            "author": "Pulsar000",
                            "id": "j09lhpe",
                            "parent_id": "t1_j076oex",
                            "score": 5,
                            "created_utc": 1671067654.0,
                            "replies": [
                                {
                                    "body": "I’m in San Francisco.  That’s pretty average.",
                                    "author": "LotBuilder",
                                    "id": "j09mmsh",
                                    "parent_id": "t1_j09lhpe",
                                    "score": 3,
                                    "created_utc": 1671068173.0,
                                    "replies": [
                                        {
                                            "body": "Dang, didn't know. A stack per week would be crazy over here in Houston.\n\nIt sounds like you're making really good money though.",
                                            "author": "Pulsar000",
                                            "id": "j09n85t",
                                            "parent_id": "t1_j09mmsh",
                                            "score": 5,
                                            "created_utc": 1671068436.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "12 k a month ??!! 🫠",
                            "author": "lcastill1",
                            "id": "j0c19ap",
                            "parent_id": "t1_j076oex",
                            "score": 1,
                            "created_utc": 1671118807.0,
                            "replies": [
                                {
                                    "body": "I’ll Clarify… the two local are a g a week on our date nights and the girl in LA is whenever she visits or I go down there",
                                    "author": "LotBuilder",
                                    "id": "j0c26mx",
                                    "parent_id": "t1_j0c19ap",
                                    "score": 2,
                                    "created_utc": 1671119173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As bad as this is for OP with the accident,  it's ALWAYS great to hear positive stories about this lifestyle. It angers me that the majority of stories we hear on here are horror stories about either scum bag men hurting women or trashy thieves robbing men. It's a crying shame that there has to be so many safety protocols in place on both sides nowadays. \n\nI'm in a recently new arrangement, and for the last month and a half, we have both been spoon feeding trust to each other. It can be frustrating at times, but unfortunately, it's the road we walk that has been paved by others. \n\nHope you heal up quickly with no issues. I'm sure you take care of those young women tremendously, but remember how good this feels how they are stepping up on their own when you spoil them next.",
            "author": "woody0690",
            "id": "j0727oh",
            "parent_id": "t3_zlkmja",
            "score": 5,
            "created_utc": 1671031337.0,
            "replies": []
        },
        {
            "body": "I think your SBs are a reflection of how good you have been to them as well. It's that mutual love and admiration. So thanks for being good to them. These are the deep connections I seek out and I love to see it for for others.\n\nI'm sorry you went through such a scary experience.  Wishing you a speedy recovery, OP. It sounds like you are in GREAT hands, but my DMs are open to you if you need to talk.",
            "author": "theghostspider",
            "id": "j06rqdi",
            "parent_id": "t3_zlkmja",
            "score": 8,
            "created_utc": 1671026820.0,
            "replies": []
        },
        {
            "body": "❤️❤️❤️ \n\nGreat job SD! That is awesome 👏 \nYou obviously deserve it 🫶",
            "author": "P0sitiveViibes777",
            "id": "j05wucp",
            "parent_id": "t3_zlkmja",
            "score": 3,
            "created_utc": 1671005324.0,
            "replies": []
        },
        {
            "body": "Sorry you had this accident! Glad to hear you're (relatively) ok!\n\nBut the positive side is that you experience now how 'the girls' genuinely care for you!\n\n I hope you get well soon. :)",
            "author": "A-touchofreality",
            "id": "j065ms5",
            "parent_id": "t3_zlkmja",
            "score": 4,
            "created_utc": 1671012763.0,
            "replies": []
        },
        {
            "body": "Glad you made it. Sounds like you have ample support.",
            "author": "GSSD",
            "id": "j06p8m2",
            "parent_id": "t3_zlkmja",
            "score": 2,
            "created_utc": 1671025661.0,
            "replies": []
        },
        {
            "body": "Get better soon! Glad you are not alone in this. I imagine it must've been really traumatic for you and there's really nothing like people who truly care for you to help you get back in gear, at least psychologically speaking. ✨",
            "author": "panty_raider69_",
            "id": "j0849wc",
            "parent_id": "t3_zlkmja",
            "score": 2,
            "created_utc": 1671046029.0,
            "replies": []
        },
        {
            "body": "How do you explain to your kids that your sugar baby is picking them up ? Lol.\n\nHope you have an uncomplicated recovery !",
            "author": "Hope_for_tendies",
            "id": "j07kiwm",
            "parent_id": "t3_zlkmja",
            "score": 2,
            "created_utc": 1671038491.0,
            "replies": [
                {
                    "body": "They have known her for 2 years.  We both have 8 yo boys that are friends.",
                    "author": "LotBuilder",
                    "id": "j07pd6y",
                    "parent_id": "t1_j07kiwm",
                    "score": 7,
                    "created_utc": 1671040329.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What happened?",
            "author": "superbex98",
            "id": "j06jb7z",
            "parent_id": "t3_zlkmja",
            "score": 1,
            "created_utc": 1671022569.0,
            "replies": []
        },
        {
            "body": "So sorry this happened to you! ): I wish I could find a loyal daddy like this. I’m happy you’re okay. I would have dropped everything for my SD too☹️💕",
            "author": "First_Bumblebee_4761",
            "id": "j08smqx",
            "parent_id": "t3_zlkmja",
            "score": 1,
            "created_utc": 1671055155.0,
            "replies": []
        },
        {
            "body": "It's value in relationships like these that keep the faith alive for me. Sending all the best to you to recover quickly, you are clearly very well loved 🙏🏼",
            "author": "virgonatrix",
            "id": "j09bnok",
            "parent_id": "t3_zlkmja",
            "score": 1,
            "created_utc": 1671063217.0,
            "replies": []
        },
        {
            "body": "How's the SB who was in the car with you doing?",
            "author": "akbbgtc",
            "id": "j06egun",
            "parent_id": "t3_zlkmja",
            "score": 0,
            "created_utc": 1671019571.0,
            "replies": [
                {
                    "body": "Sorry if unclear,   I was alone thankfully",
                    "author": "LotBuilder",
                    "id": "j06ej67",
                    "parent_id": "t1_j06egun",
                    "score": 3,
                    "created_utc": 1671019615.0,
                    "replies": [
                        {
                            "body": "My sad attempt at humor. I was implying an SB in your lap caused the crash. Wishing you a speedy recovery! Btw very impressive work with 3 SBs.",
                            "author": "akbbgtc",
                            "id": "j06fr6n",
                            "parent_id": "t1_j06ej67",
                            "score": 0,
                            "created_utc": 1671020417.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "With those injuries I highly doubt you would be writing this a few hours after",
            "author": "Humble_Insurance_247",
            "id": "j08dxmt",
            "parent_id": "t3_zlkmja",
            "score": 0,
            "created_utc": 1671049599.0,
            "replies": [
                {
                    "body": "I walked away from the accident in shock.  Day 2 has been worse than Day 1 but they are managing my pain well.  Coughing is the worst.",
                    "author": "LotBuilder",
                    "id": "j08fk8f",
                    "parent_id": "t1_j08dxmt",
                    "score": 1,
                    "created_utc": 1671050213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy shit - Im sorry to hear this and happy to hear you’re supported.\n\nSomething I always say to accident victims because its kinda my mission:  If you find yourself addicted to pain medication try kratom.",
            "author": "JDMultralight",
            "id": "j087dhl",
            "parent_id": "t3_zlkmja",
            "score": 1,
            "created_utc": 1671047181.0,
            "replies": [
                {
                    "body": "That was actually one of my concerns.   I’ll be on pain meds for 6+ months and do not want to become dependent",
                    "author": "LotBuilder",
                    "id": "j08ep92",
                    "parent_id": "t1_j087dhl",
                    "score": 1,
                    "created_utc": 1671049888.0,
                    "replies": [
                        {
                            "body": "Kratom is less addictive than traditional opioids in the short term (such as 6 months).  The problem is that you’d be self-administering and monitoring it which is a risk factor for addiction.  \n\nI would let doctors handle the pain and have someone around so that you’re explicitly discussing your feelings about the meds just so your thoughts are organized (for instance it’s best to say “I look forward to my doses because they make me feel less ruminative and more relaxed.  Gotta watch out for that” out loud than have it be part of a vague inner monologue). SB could be good for that.  Counselor if the worry gets strong.\n\nThat said, a six month dependency on something like oxycodone shouldn’t be terribly hard to taper and break in terms of non-pain issues. If it is, a week of kratom can make the transition to no pain meds far easier - certainly tell your doc you’re doing it.  Its also a fallback, as I said, if you’re in full-blown pharm addiction to normalize life while making a plan to live without any opioids.  If its not short, though, you’re trading addictions. \n\nFinally, everyone who has to take any opioids consistently should know this:  dependencies measured in months usually only result in acute withdrawal.  You’ll have nasty flu, sleep, mood stuff for a week.  Kinda easy. Go longer term and a fair amount of the time you’ll have months of depression, amotivation, sleeplessness, inability to feel much pleasure when you stop - it’s very hard to endure that when you can resolve it with a snap of your fingers by taking some plant powder or a pill.  That’s addiction that a reasonable, modest, and relatively competent person can get trapped in.  So don’t go there unless you absolutely have to.\n\nHope this helps and that your recovery goes smoothly.",
                            "author": "JDMultralight",
                            "id": "j08unh2",
                            "parent_id": "t1_j08ep92",
                            "score": 3,
                            "created_utc": 1671055975.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Those peach martinis will be banana hammock flavored.\n\nI don't *even* want to know what that tastes like.",
            "author": "FLRAdvocate",
            "id": "j07i0op",
            "parent_id": "t1_j05wskp",
            "score": 4,
            "created_utc": 1671037539.0,
            "replies": [
                {
                    "body": "*Your loss.*  :)",
                    "author": "TastySpermDevice",
                    "id": "j07iac1",
                    "parent_id": "t1_j07i0op",
                    "score": 6,
                    "created_utc": 1671037640.0,
                    "replies": [
                        {
                            "body": "There are some losses I am just willing to accept, sir. lol",
                            "author": "FLRAdvocate",
                            "id": "j07immy",
                            "parent_id": "t1_j07iac1",
                            "score": 3,
                            "created_utc": 1671037769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Appreciate it 🙏.  I’m in good hands",
            "author": "LotBuilder",
            "id": "j05wzzr",
            "parent_id": "t1_j05wskp",
            "score": 4,
            "created_utc": 1671005448.0,
            "replies": [
                {
                    "body": "Going to interpret that as a happy ending and you cannot stop me. Muhahahah.\n\nSeriously brother, if you need anything project managed remotely, I can step up. Anytime.",
                    "author": "TastySpermDevice",
                    "id": "j05x9er",
                    "parent_id": "t1_j05wzzr",
                    "score": 5,
                    "created_utc": 1671005663.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thousand a week each and gifts.  Helped one buy a business.",
            "author": "LotBuilder",
            "id": "j076oex",
            "parent_id": "t1_j06kxx1",
            "score": 12,
            "created_utc": 1671033109.0,
            "replies": [
                {
                    "body": "No wonder they made you feel like a VIP! 😅",
                    "author": "Pulsar000",
                    "id": "j09lhpe",
                    "parent_id": "t1_j076oex",
                    "score": 5,
                    "created_utc": 1671067654.0,
                    "replies": [
                        {
                            "body": "I’m in San Francisco.  That’s pretty average.",
                            "author": "LotBuilder",
                            "id": "j09mmsh",
                            "parent_id": "t1_j09lhpe",
                            "score": 3,
                            "created_utc": 1671068173.0,
                            "replies": [
                                {
                                    "body": "Dang, didn't know. A stack per week would be crazy over here in Houston.\n\nIt sounds like you're making really good money though.",
                                    "author": "Pulsar000",
                                    "id": "j09n85t",
                                    "parent_id": "t1_j09mmsh",
                                    "score": 5,
                                    "created_utc": 1671068436.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "12 k a month ??!! 🫠",
                    "author": "lcastill1",
                    "id": "j0c19ap",
                    "parent_id": "t1_j076oex",
                    "score": 1,
                    "created_utc": 1671118807.0,
                    "replies": [
                        {
                            "body": "I’ll Clarify… the two local are a g a week on our date nights and the girl in LA is whenever she visits or I go down there",
                            "author": "LotBuilder",
                            "id": "j0c26mx",
                            "parent_id": "t1_j0c19ap",
                            "score": 2,
                            "created_utc": 1671119173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They have known her for 2 years.  We both have 8 yo boys that are friends.",
            "author": "LotBuilder",
            "id": "j07pd6y",
            "parent_id": "t1_j07kiwm",
            "score": 7,
            "created_utc": 1671040329.0,
            "replies": []
        },
        {
            "body": "Sorry if unclear,   I was alone thankfully",
            "author": "LotBuilder",
            "id": "j06ej67",
            "parent_id": "t1_j06egun",
            "score": 3,
            "created_utc": 1671019615.0,
            "replies": [
                {
                    "body": "My sad attempt at humor. I was implying an SB in your lap caused the crash. Wishing you a speedy recovery! Btw very impressive work with 3 SBs.",
                    "author": "akbbgtc",
                    "id": "j06fr6n",
                    "parent_id": "t1_j06ej67",
                    "score": 0,
                    "created_utc": 1671020417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I walked away from the accident in shock.  Day 2 has been worse than Day 1 but they are managing my pain well.  Coughing is the worst.",
            "author": "LotBuilder",
            "id": "j08fk8f",
            "parent_id": "t1_j08dxmt",
            "score": 1,
            "created_utc": 1671050213.0,
            "replies": []
        },
        {
            "body": "That was actually one of my concerns.   I’ll be on pain meds for 6+ months and do not want to become dependent",
            "author": "LotBuilder",
            "id": "j08ep92",
            "parent_id": "t1_j087dhl",
            "score": 1,
            "created_utc": 1671049888.0,
            "replies": [
                {
                    "body": "Kratom is less addictive than traditional opioids in the short term (such as 6 months).  The problem is that you’d be self-administering and monitoring it which is a risk factor for addiction.  \n\nI would let doctors handle the pain and have someone around so that you’re explicitly discussing your feelings about the meds just so your thoughts are organized (for instance it’s best to say “I look forward to my doses because they make me feel less ruminative and more relaxed.  Gotta watch out for that” out loud than have it be part of a vague inner monologue). SB could be good for that.  Counselor if the worry gets strong.\n\nThat said, a six month dependency on something like oxycodone shouldn’t be terribly hard to taper and break in terms of non-pain issues. If it is, a week of kratom can make the transition to no pain meds far easier - certainly tell your doc you’re doing it.  Its also a fallback, as I said, if you’re in full-blown pharm addiction to normalize life while making a plan to live without any opioids.  If its not short, though, you’re trading addictions. \n\nFinally, everyone who has to take any opioids consistently should know this:  dependencies measured in months usually only result in acute withdrawal.  You’ll have nasty flu, sleep, mood stuff for a week.  Kinda easy. Go longer term and a fair amount of the time you’ll have months of depression, amotivation, sleeplessness, inability to feel much pleasure when you stop - it’s very hard to endure that when you can resolve it with a snap of your fingers by taking some plant powder or a pill.  That’s addiction that a reasonable, modest, and relatively competent person can get trapped in.  So don’t go there unless you absolutely have to.\n\nHope this helps and that your recovery goes smoothly.",
                    "author": "JDMultralight",
                    "id": "j08unh2",
                    "parent_id": "t1_j08ep92",
                    "score": 3,
                    "created_utc": 1671055975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*Your loss.*  :)",
            "author": "TastySpermDevice",
            "id": "j07iac1",
            "parent_id": "t1_j07i0op",
            "score": 6,
            "created_utc": 1671037640.0,
            "replies": [
                {
                    "body": "There are some losses I am just willing to accept, sir. lol",
                    "author": "FLRAdvocate",
                    "id": "j07immy",
                    "parent_id": "t1_j07iac1",
                    "score": 3,
                    "created_utc": 1671037769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Going to interpret that as a happy ending and you cannot stop me. Muhahahah.\n\nSeriously brother, if you need anything project managed remotely, I can step up. Anytime.",
            "author": "TastySpermDevice",
            "id": "j05x9er",
            "parent_id": "t1_j05wzzr",
            "score": 5,
            "created_utc": 1671005663.0,
            "replies": []
        },
        {
            "body": "No wonder they made you feel like a VIP! 😅",
            "author": "Pulsar000",
            "id": "j09lhpe",
            "parent_id": "t1_j076oex",
            "score": 5,
            "created_utc": 1671067654.0,
            "replies": [
                {
                    "body": "I’m in San Francisco.  That’s pretty average.",
                    "author": "LotBuilder",
                    "id": "j09mmsh",
                    "parent_id": "t1_j09lhpe",
                    "score": 3,
                    "created_utc": 1671068173.0,
                    "replies": [
                        {
                            "body": "Dang, didn't know. A stack per week would be crazy over here in Houston.\n\nIt sounds like you're making really good money though.",
                            "author": "Pulsar000",
                            "id": "j09n85t",
                            "parent_id": "t1_j09mmsh",
                            "score": 5,
                            "created_utc": 1671068436.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "12 k a month ??!! 🫠",
            "author": "lcastill1",
            "id": "j0c19ap",
            "parent_id": "t1_j076oex",
            "score": 1,
            "created_utc": 1671118807.0,
            "replies": [
                {
                    "body": "I’ll Clarify… the two local are a g a week on our date nights and the girl in LA is whenever she visits or I go down there",
                    "author": "LotBuilder",
                    "id": "j0c26mx",
                    "parent_id": "t1_j0c19ap",
                    "score": 2,
                    "created_utc": 1671119173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My sad attempt at humor. I was implying an SB in your lap caused the crash. Wishing you a speedy recovery! Btw very impressive work with 3 SBs.",
            "author": "akbbgtc",
            "id": "j06fr6n",
            "parent_id": "t1_j06ej67",
            "score": 0,
            "created_utc": 1671020417.0,
            "replies": []
        },
        {
            "body": "Kratom is less addictive than traditional opioids in the short term (such as 6 months).  The problem is that you’d be self-administering and monitoring it which is a risk factor for addiction.  \n\nI would let doctors handle the pain and have someone around so that you’re explicitly discussing your feelings about the meds just so your thoughts are organized (for instance it’s best to say “I look forward to my doses because they make me feel less ruminative and more relaxed.  Gotta watch out for that” out loud than have it be part of a vague inner monologue). SB could be good for that.  Counselor if the worry gets strong.\n\nThat said, a six month dependency on something like oxycodone shouldn’t be terribly hard to taper and break in terms of non-pain issues. If it is, a week of kratom can make the transition to no pain meds far easier - certainly tell your doc you’re doing it.  Its also a fallback, as I said, if you’re in full-blown pharm addiction to normalize life while making a plan to live without any opioids.  If its not short, though, you’re trading addictions. \n\nFinally, everyone who has to take any opioids consistently should know this:  dependencies measured in months usually only result in acute withdrawal.  You’ll have nasty flu, sleep, mood stuff for a week.  Kinda easy. Go longer term and a fair amount of the time you’ll have months of depression, amotivation, sleeplessness, inability to feel much pleasure when you stop - it’s very hard to endure that when you can resolve it with a snap of your fingers by taking some plant powder or a pill.  That’s addiction that a reasonable, modest, and relatively competent person can get trapped in.  So don’t go there unless you absolutely have to.\n\nHope this helps and that your recovery goes smoothly.",
            "author": "JDMultralight",
            "id": "j08unh2",
            "parent_id": "t1_j08ep92",
            "score": 3,
            "created_utc": 1671055975.0,
            "replies": []
        },
        {
            "body": "There are some losses I am just willing to accept, sir. lol",
            "author": "FLRAdvocate",
            "id": "j07immy",
            "parent_id": "t1_j07iac1",
            "score": 3,
            "created_utc": 1671037769.0,
            "replies": []
        },
        {
            "body": "I’m in San Francisco.  That’s pretty average.",
            "author": "LotBuilder",
            "id": "j09mmsh",
            "parent_id": "t1_j09lhpe",
            "score": 3,
            "created_utc": 1671068173.0,
            "replies": [
                {
                    "body": "Dang, didn't know. A stack per week would be crazy over here in Houston.\n\nIt sounds like you're making really good money though.",
                    "author": "Pulsar000",
                    "id": "j09n85t",
                    "parent_id": "t1_j09mmsh",
                    "score": 5,
                    "created_utc": 1671068436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll Clarify… the two local are a g a week on our date nights and the girl in LA is whenever she visits or I go down there",
            "author": "LotBuilder",
            "id": "j0c26mx",
            "parent_id": "t1_j0c19ap",
            "score": 2,
            "created_utc": 1671119173.0,
            "replies": []
        },
        {
            "body": "Dang, didn't know. A stack per week would be crazy over here in Houston.\n\nIt sounds like you're making really good money though.",
            "author": "Pulsar000",
            "id": "j09n85t",
            "parent_id": "t1_j09mmsh",
            "score": 5,
            "created_utc": 1671068436.0,
            "replies": []
        }
    ]
}