{
    "title": "Free at last",
    "post_id": "okxxfe",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/okxxfe/free_at_last/",
    "author": null,
    "body": "Hello everyone, Emily here. I’m so pleased to tell people here my story. It’s been nearly 2yrs and 3months since I’ve been in the bowl and I used to not understand why I was so attracted to sugar relationships or why the discretion of the relationship/arrangements made me feel safe. I met/spoken to a lot of bad men in sugar, vanilla dating, and else where. However, in sugar dating it was the perfect situation for me to practice boundaries and to put up boundaries against men who wanted to use controlling tactics to make me subservient to them. (Aside from submissive kink, which I love.) I recognized a trauma that I’ve chosen to cast aside was the sexual, mental, and emotional abuse my brother placed on me for many many years. (Later on it became physical abuse.) He was 4yrs older than me and groomed my parents and friends to never believe anything I said while I was kept very very mentally ill. The sugar money helped me pay for some of the best therapy and helped me gain mental strength, awareness, and the boundaries to feel safe in the world. I finally told my parents about the abuse a couple days ago and I’m just in disbelief that my parents believe me. (I feel in disbelief because my brother isolated me for so long that I almost lost hope.) My parents were very apologetic & horrified of the sexual abuse along with the manipulating tactics I brother had used to harm me. I feel slightly unsafe after telling them because I sometimes have nightmares that he’ll come after me but he lives like 6hrs away. Lol. I know my parents want to honor my decision on how I want to handle this and I’m feeling a lot better after confronting over 15yrs of abuse. A lot of my life feels like it makes sense now & I just want to tell people on this forum that there can be a lot of good from being in the bowl if done correctly. There can be a lot of good that can come from regular dating too. I recognize that I didn’t know what a healthy relationship looked like and all I ever known in my life was the abuse. So naturally I was only attracted to abusive partners. I stopped vanilla dating while doing sugar and focused on my mental health. The therapy helped me remember the abuse and my suffering. (I was basically in denial & minimized my trauma.) My sd’s emotionally supported me through everything & I feel on top of the world. I feel finally free and ready to live my life exactly how I was always meant to be. Thank you to everyone on here that has reached out to me personally & made the bowl a pleasant & safe experience. I am free at last!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/okxxfe/free_at_last/",
    "score": 97,
    "upvote_ratio": 0.96,
    "created_utc": 1626371120.0,
    "num_comments": 16,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Holy crap, congratulations! You have displayed incredible strength in the face of adversity. \n\nI wish you success on your road to healing. You deserve respectful, quality relationships. You deserve kindness. You deserve safety. You deserve love. \n\nPlease feel free to reach out to me if you ever need to talk.",
            "author": "SeriouslyWhoIsShe",
            "id": "h5azuu3",
            "parent_id": "t3_okxxfe",
            "score": 6,
            "created_utc": 1626373920.0,
            "replies": []
        },
        {
            "body": "Amazing!!! Im so happy for you :)",
            "author": "c0rnstarr",
            "id": "h5aybp1",
            "parent_id": "t3_okxxfe",
            "score": 3,
            "created_utc": 1626373263.0,
            "replies": []
        },
        {
            "body": "Wow well done to you. I can’t imagine how difficult it must have been telling your parents about it all but I hope that this gets you even closer to taking control & moving towards recovery. And also it’s really nice to hear the positive outcomes that SUgar dating has had for you-obviously not nice to hear what you’ve been through however. All the best to you xxx",
            "author": "Infinite-Ad-912",
            "id": "h5b4khw",
            "parent_id": "t3_okxxfe",
            "score": 3,
            "created_utc": 1626375953.0,
            "replies": []
        },
        {
            "body": "Congratulations! You sounds like a strong and resilient person. I agree that the bowl is an excellent place to fine-tune your boundaries and communication skills, especially with the guidance of a good therapist. I'm so glad your family believes and supports you.",
            "author": "TX_Madam",
            "id": "h5bvnio",
            "parent_id": "t3_okxxfe",
            "score": 3,
            "created_utc": 1626388173.0,
            "replies": []
        },
        {
            "body": "Im so sorry of the traumas you’ve endure in early years. I’m very proud of you for taking charge and telling your parents, and are on the way to happier days. 💜💚❤️",
            "author": "ExExpectations",
            "id": "h5cau1w",
            "parent_id": "t3_okxxfe",
            "score": 3,
            "created_utc": 1626395856.0,
            "replies": []
        },
        {
            "body": "Happy for you!!",
            "author": "Short-Try-1111",
            "id": "h5atsu7",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626371370.0,
            "replies": [
                {
                    "body": "If she's going to write this stuff she has to be ready with the kleenex \n\nIn all seriousness, what a great story and thanks for her sharing.  \n\nYes,  arrangements can be a bridge over troubled waters, for both.",
                    "author": "pinotandsugar",
                    "id": "h5c5hc4",
                    "parent_id": "t1_h5atsu7",
                    "score": 5,
                    "created_utc": 1626393078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am happy that you are in a place of healing.",
            "author": "MrBiscotti_75",
            "id": "h5aywuv",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626373514.0,
            "replies": []
        },
        {
            "body": "So happy for you! Sending you lots of love",
            "author": null,
            "id": "h5b05s6",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626374051.0,
            "replies": []
        },
        {
            "body": "Wonderful story, glad you made it",
            "author": null,
            "id": "h5bkmvm",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626383052.0,
            "replies": []
        },
        {
            "body": "I am proud of you.",
            "author": "TW1ST3DM1ND1",
            "id": "h5bmcp7",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626383819.0,
            "replies": []
        },
        {
            "body": "Awesome!",
            "author": null,
            "id": "h5bs81e",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626386528.0,
            "replies": []
        },
        {
            "body": "So happy for you",
            "author": "new2bSuga",
            "id": "h5c6u3z",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626393772.0,
            "replies": []
        },
        {
            "body": "Amazing!",
            "author": "stupid_smart_ape",
            "id": "h5e2yoi",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626439243.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing this!",
            "author": "SwimmingInSugar",
            "id": "h5e93vq",
            "parent_id": "t3_okxxfe",
            "score": 2,
            "created_utc": 1626442548.0,
            "replies": []
        },
        {
            "body": "I love the way you phrase it! Submissive kinks. I feel so fucking self conscious about asking regarding that stuff. Some SBs/girls kink shame :)",
            "author": "401kisfun",
            "id": "h5catdr",
            "parent_id": "t3_okxxfe",
            "score": 1,
            "created_utc": 1626395846.0,
            "replies": []
        },
        {
            "body": "If she's going to write this stuff she has to be ready with the kleenex \n\nIn all seriousness, what a great story and thanks for her sharing.  \n\nYes,  arrangements can be a bridge over troubled waters, for both.",
            "author": "pinotandsugar",
            "id": "h5c5hc4",
            "parent_id": "t1_h5atsu7",
            "score": 5,
            "created_utc": 1626393078.0,
            "replies": []
        }
    ]
}