{
    "title": "Would you like an AMA from a licensed barber?",
    "post_id": "8lph9w",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/8lph9w/would_you_like_an_ama_from_a_licensed_barber/",
    "author": "mitchellsnyder",
    "body": "I’ve been a barber for a little while and might be able to answer some questions if the mod team is alright with it.",
    "url": "https://www.reddit.com/r/malehairadvice/comments/8lph9w/would_you_like_an_ama_from_a_licensed_barber/",
    "score": 289,
    "upvote_ratio": 0.97,
    "created_utc": 1527131513.0,
    "num_comments": 72,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Yes!\n\nThis sounds like a way to get more interesting content, feedback, and *advice* than sHoRT sIdES LOng ToP",
            "author": "bsd_kylar",
            "id": "dzhgt2l",
            "parent_id": "t3_8lph9w",
            "score": 84,
            "created_utc": 1527133302.0,
            "replies": [
                {
                    "body": "Man, longtop/shortsides already sounds stupid to me too but its everything people that post here should try first. Often people post hair with long sides etc and if they’d just cut the sides short, It’d be 100% different and better.",
                    "author": "ImQuitingPorn",
                    "id": "dzhidsn",
                    "parent_id": "t1_dzhgt2l",
                    "score": 27,
                    "created_utc": 1527135279.0,
                    "replies": []
                },
                {
                    "body": "It’s funny. You’re obviously trying to parody the default sub response, but you didn’t say “American Crew Fiber.”",
                    "author": "PlatonicTroglodyte",
                    "id": "dzj5sr4",
                    "parent_id": "t1_dzhgt2l",
                    "score": 2,
                    "created_utc": 1527206956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes.",
            "author": "nathanpaulyoung",
            "id": "dzhgztu",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527133524.0,
            "replies": []
        },
        {
            "body": "What do you think of people with dandruff that go to get their hair cut? ",
            "author": "BryanBlitz",
            "id": "dzhjg9g",
            "parent_id": "t3_8lph9w",
            "score": 26,
            "created_utc": 1527136717.0,
            "replies": [
                {
                    "body": "It’s totally normal. Plus what most people think is dandruff is actually just dry scalp. Dandruff is a fungal infection, and unless diagnosed it’s probably just dry scalp. Using dandruff shampoo actually dries the scalp out more.",
                    "author": "mitchellsnyder",
                    "id": "dzi0ejx",
                    "parent_id": "t1_dzhjg9g",
                    "score": 40,
                    "created_utc": 1527167206.0,
                    "replies": [
                        {
                            "body": "that's how they keep you hooked into buying their dandruff shampoo",
                            "author": "GlockWan",
                            "id": "dziq5cy",
                            "parent_id": "t1_dzi0ejx",
                            "score": 13,
                            "created_utc": 1527191124.0,
                            "replies": []
                        },
                        {
                            "body": "So how would you moisturize your scalp? Less shampoo etc...?",
                            "author": "BushidoBrowne",
                            "id": "dzqe8wz",
                            "parent_id": "t1_dzi0ejx",
                            "score": 1,
                            "created_utc": 1527549479.0,
                            "replies": [
                                {
                                    "body": "It’s kinda hard to say since it varies person to person. For some people cutting out shampoo altogether helps or trying different types of shampoo. Sorry I can’t help more with this one... maybe someone else has some recommendations too.",
                                    "author": "mitchellsnyder",
                                    "id": "dzqrwe0",
                                    "parent_id": "t1_dzqe8wz",
                                    "score": 3,
                                    "created_utc": 1527562889.0,
                                    "replies": [
                                        {
                                            "body": "I always had dandruff untill I used a hairconditioner and then suddenly it stopped. I guess the hairconditioner smoothes and oils my scalp preventing it from drying hence the dandruff",
                                            "author": "selo1087",
                                            "id": "dzsphmu",
                                            "parent_id": "t1_dzqrwe0",
                                            "score": 1,
                                            "created_utc": 1527642468.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For us longer hair gents: are split ends as big a deal as women make them out to be? I've been growing my hair for over 2 years with only a couple small trims in that time, should I be more worried about that?",
            "author": "BebopFlow",
            "id": "dzhgy3w",
            "parent_id": "t3_8lph9w",
            "score": 23,
            "created_utc": 1527133468.0,
            "replies": [
                {
                    "body": "Yes and no. Split ends aren’t great. The main thing I notice is that split ends allow the hair to tangle more easily and break. Breakage is one reason hair seems to stop growing. Your hair will grow out if you don’t get trims often, but it may take some more time. Although a cosmetologist may have more to say on this since I’m not as familiar with long hair.",
                    "author": "mitchellsnyder",
                    "id": "dzhi0e2",
                    "parent_id": "t1_dzhgy3w",
                    "score": 25,
                    "created_utc": 1527134791.0,
                    "replies": []
                },
                {
                    "body": "Cosmo/Barber here. Split ends become breakage which thins out the density of your hair and causes it to tangle more severely. Regular trims are the only way to prevent it. By regular, we generally recommend every 6-8 weeks but you can stretch it depending on the health of your hair. I wouldn’t go longer than three months. Because you haven’t been getting regular trims I would get on a regular schedule of 6-8 weeks like clock work and over the next year, stretch it out and go by feel. By feel I mean when it starts to tangle more frequently and become more unruly, you need a trim. \n\nEdit: grammar",
                    "author": "ToastedMarshmellow",
                    "id": "dzhjsmt",
                    "parent_id": "t1_dzhgy3w",
                    "score": 14,
                    "created_utc": 1527137194.0,
                    "replies": [
                        {
                            "body": "as someone with very thick and coarse hair, my length is about 6-7 inches, my hair does not tangle easily and normally maintains a middle part even with no product, should I be concerned with trimming the ends regularly? I don’t believe I have split ends but I do struggle a lot with frizz (TX gets humid) and just  overall volume control of having very thick  hair. ",
                            "author": "notdavidg",
                            "id": "dzhmmuk",
                            "parent_id": "t1_dzhjsmt",
                            "score": 2,
                            "created_utc": 1527141662.0,
                            "replies": [
                                {
                                    "body": "Everyone could use a trim now and again. The point is to refresh the ends. Imagine a piece of string. The older and beat up the end of the string or rope is, the more frayed it becomes. If you want to thread that string through the eye of a needle, you have to cut it to get a nice fresh end to work with. Hair does the same thing. Different types of hair will do it at a different rate. I go by my rule of thumb because dead ends snag together like Velcro causing tangles. If you generally don’t ever get tangled, ever, I would stick to some where between every 3 to 4 months to make sure you’re getting them so they don’t get bad. \n\nLet’s talk about the humidity. That could have a lot of causes. Usually the number one cause is it could be dry from over washing. If you’re washing everyday with a really drying product, leaving your hair starving for moisture then walk out in to the Texas humidity, your hair reacts and is drawing in the moisture from the air and it’s not good moisture. What’s your routine? What are you washing and styling with? Have you have any chemical treatments done to your hair like color, perms, or relaxer? Would you have a budget to incorporate new products? ",
                                    "author": "ToastedMarshmellow",
                                    "id": "dzi5eh5",
                                    "parent_id": "t1_dzhmmuk",
                                    "score": 5,
                                    "created_utc": 1527172371.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are some need to know terms to describe hair styles and cuts? Usually when I get my haircut I just tell them \"shorter here, kinda longer there, really short over here\". ",
            "author": "Koore9",
            "id": "dzhjqoc",
            "parent_id": "t3_8lph9w",
            "score": 16,
            "created_utc": 1527137116.0,
            "replies": [
                {
                    "body": "Taper- taking longer hair to shorter, usually in the nape area. The recommended style for the back of a hair cut because it will make the cut last longer and grow out better.\n\nDisconnected- think undercut. You take the short hair to an abrupt stop with longer hair on top. There is usually no blend.\n\nFade- a more extreme type of taper, usually around the whole head.\n\nHard part- shaved in part line\n\nFinger length- the width of the barbers finger, usually just enough to lay down and play with.\n\nSide part- parting the hair with the part above the center of the eye on either side.\n\nUnder cut- think 90s skater bad boy. Long hair on top, buzzed short on sides and back. Currently worn with the top combed to one side.\n\nKeep in mind that most Barber terms are not universal. A mid fade to one barber may be a low or high fade to another. ",
                    "author": "mitchellsnyder",
                    "id": "dzi9geo",
                    "parent_id": "t1_dzhjqoc",
                    "score": 25,
                    "created_utc": 1527176115.0,
                    "replies": []
                },
                {
                    "body": "Give me a second, I’m doing a head shave, but this is a great question.",
                    "author": "mitchellsnyder",
                    "id": "dzi5zjh",
                    "parent_id": "t1_dzhjqoc",
                    "score": 9,
                    "created_utc": 1527172924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "dzhkuiv",
            "parent_id": "t3_8lph9w",
            "score": 15,
            "created_utc": 1527138754.0,
            "replies": [
                {
                    "body": " I personally was never taught to use thinning shears. They were called cheater shears at my school. All thinning was done by point cutting, slicing, chunking, or slithering. I think a lot of hair professionals get caught up with them being called thinning shears instead of blending shears and end up going overboard with them.",
                    "author": "mitchellsnyder",
                    "id": "dzi0vv9",
                    "parent_id": "t1_dzhkuiv",
                    "score": 17,
                    "created_utc": 1527167760.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Backstory: whenever I go get a haircut, the barber always makes it lopsided. A barber long ago gave me a disconnected cut on the side but went way too far up on the right side, and then gave me a combover pushing all the hair on the top to the left. Now it looks like there's a lot of hair on the left side of my head and no hair on the right side of my head. I thought it was just a bad barber but I went to 3 other barbers, trying to specifically tell them to balance it out because I don't want it lopsided-disconnected, but they don't ever do it right and tend to follow the disconnection every damn time.\n\nQuestion: How do you fix a bad disconnected haircut? Do you just buzz it all and start over? What do you suggest? I can PM you pics if you'd like\n\nEdit: it kinda looks [like this](https://i.ytimg.com/vi/KvCtzxpH6EM/maxresdefault.jpg) but much more on the left side and much less on the right side (my head is also much rounder than his)",
            "author": "someoneinsignificant",
            "id": "dzhmrk2",
            "parent_id": "t3_8lph9w",
            "score": 10,
            "created_utc": 1527141894.0,
            "replies": [
                {
                    "body": "Yo! I think this is my biggest problem when I get MY hair cut too. I think the best thing to tell your barber is that you want some over hang on the top of the short side. Bringing in a picture helps with this as well. Say you get a 2 on the sides, tell them not to take it all the way up to the part.",
                    "author": "mitchellsnyder",
                    "id": "dzi12a3",
                    "parent_id": "t1_dzhmrk2",
                    "score": 7,
                    "created_utc": 1527167962.0,
                    "replies": []
                },
                {
                    "body": "I would like to know this aswell. Currently rocking a grown out undercut. I told him I want it to be able to style both ways. There is way more on the right side and if unstyled it looks terrible.\n\n\nSeems as if alot of barbers try to cover this up by using a shit ton of product. The only thing that does is weigh  my fine wavy hair down.",
                    "author": "Savedlinkforlater",
                    "id": "dzhn5i7",
                    "parent_id": "t1_dzhmrk2",
                    "score": 3,
                    "created_utc": 1527142593.0,
                    "replies": []
                },
                {
                    "body": "I had this problem a lot too. Barbers generally tend to follow the pattern your hair will naturally fall into. If you’ve had it lopsided for a while, your hair is trained to fall like that so the barber follows suit. \n\nThere’s only two ways to fix this. Grow it out kinda long and have the barber cut it like that. If you ask for a slick back or something like that, they tend to even it out, especially with longer hair. Or buzz it and start over. ",
                    "author": "-Unnamed-",
                    "id": "dzign83",
                    "parent_id": "t1_dzhmrk2",
                    "score": 1,
                    "created_utc": 1527182555.0,
                    "replies": []
                },
                {
                    "body": "Grow it out so they can’t follow the old cut and bring them a new photo. Your texture could also be the type that sticks out when it’s super short so the could be compensating by taking it up so you don’t look like a porcupine. \n\nEdit: reread your post and delete irrelevant information.",
                    "author": "ToastedMarshmellow",
                    "id": "dzi5xos",
                    "parent_id": "t1_dzhmrk2",
                    "score": 0,
                    "created_utc": 1527172877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1.\tWhat advice would you give to talking to your barber to get the cut you want? I always feel like I do a bad job of explaining how I want my hair cut \n2.\twhat, in your opinion, are  your the best styling products\n3.\tis using a straight razor stressful ",
            "author": null,
            "id": "dzhvxmw",
            "parent_id": "t3_8lph9w",
            "score": 8,
            "created_utc": 1527161085.0,
            "replies": [
                {
                    "body": "1. Be open an honest. Tell them what you liked and disliked about your last cut. When you show a picture say what you like about it.\n2. It depends on the type of hair. But I think the clubman heavy hold water based pomade is amazing, and cheap as fuck. I also like bonafide matte.\n3. It’s not too bad. It was worse when I first started.",
                    "author": "mitchellsnyder",
                    "id": "dzi2c42",
                    "parent_id": "t1_dzhvxmw",
                    "score": 4,
                    "created_utc": 1527169347.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What was your path to getting a license? I’m a senior graduating and cut hair on the side already but I think I can make a career of being a licensed barber full time. ",
            "author": "Tacool",
            "id": "dzhn0s8",
            "parent_id": "t3_8lph9w",
            "score": 5,
            "created_utc": 1527142348.0,
            "replies": [
                {
                    "body": "I went to regular college first. I got my degree and a decent job but had always wanted to be a barber. Once I got married, my wife told me I could go back to school if I like. So I went and talked to the barbers I knew and asked for advice on a school. Then I signed up, worked part time at my old job, and part time student for 1500 hours.",
                    "author": "mitchellsnyder",
                    "id": "dzi16rd",
                    "parent_id": "t1_dzhn0s8",
                    "score": 5,
                    "created_utc": 1527168102.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What’s the easiest way to describe an amount to cute off? inches, finger lengths, cm,etc...?\nIk it’s weird but sometimes barbers look at me like I’m speaking another language when I use finger lengths or inches...",
            "author": "RamenMinMin",
            "id": "dzhsxxm",
            "parent_id": "t3_8lph9w",
            "score": 3,
            "created_utc": 1527155175.0,
            "replies": [
                {
                    "body": "It’s not weird! We have a joke that an inch is different to every person who comes in. The best way, if you aren’t getting a blade length is to have them spin you around to look in the mirror and you show them how much you want off",
                    "author": "mitchellsnyder",
                    "id": "dzi5pmq",
                    "parent_id": "t1_dzhsxxm",
                    "score": 3,
                    "created_utc": 1527172663.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always wondered who cuts the Barbers hair or do y'all cut your own?",
            "author": "daves_not__here",
            "id": "dzi2vab",
            "parent_id": "t3_8lph9w",
            "score": 4,
            "created_utc": 1527169899.0,
            "replies": [
                {
                    "body": "My shop does cut for cut, so I cut one barber then they will cut mine. Or I’ll go see friends, or sometimes back to the barber school.",
                    "author": "mitchellsnyder",
                    "id": "dzi5re1",
                    "parent_id": "t1_dzi2vab",
                    "score": 10,
                    "created_utc": 1527172711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m about halfway through barber school now. How was the job hunt after you were done?",
            "author": "nudebeachpatrol",
            "id": "dzi22en",
            "parent_id": "t3_8lph9w",
            "score": 3,
            "created_utc": 1527169060.0,
            "replies": [
                {
                    "body": "I had a couple shops lined up before I got out. Ask your instructors if they know any shops that need a barber, I’m sure they could help you. Other than that i would say go to shops you like and ask them if they’ll be hiring when you get out",
                    "author": "mitchellsnyder",
                    "id": "dzi5y96",
                    "parent_id": "t1_dzi22en",
                    "score": 3,
                    "created_utc": 1527172892.0,
                    "replies": [
                        {
                            "body": "I’m sure I’ll have something lined up by the end. I just hit 600 hours so I’m not even halfway done yet ",
                            "author": "nudebeachpatrol",
                            "id": "dzi6fdm",
                            "parent_id": "t1_dzi5y96",
                            "score": 2,
                            "created_utc": 1527173340.0,
                            "replies": [
                                {
                                    "body": "Oh yeah, you’ll have something. I started getting offers around 1000 hours",
                                    "author": "mitchellsnyder",
                                    "id": "dzi8yuw",
                                    "parent_id": "t1_dzi6fdm",
                                    "score": 2,
                                    "created_utc": 1527175677.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely\n\nWhat’s the appropriate way to tell your barber what hair cut you want? What is the lingo? I don’t want to resort to showing a barber a picture and look like a fool. \n\nThat would be most helpful as I currently don’t see anything like that in the community info.\n\n",
            "author": "EREYE212",
            "id": "dzixl85",
            "parent_id": "t3_8lph9w",
            "score": 3,
            "created_utc": 1527198183.0,
            "replies": [
                {
                    "body": "We’re pretty used to people not knowing how to describe styles to us. The best way is knowing the number of guard or blade that you get and where you get it.\n\n[edit] Showing a picture doesn’t make you look like a fool at all! Also if you get a haircut you like, ask the barber what they did so if you don’t get in with them next time you can say something like “I get a two on the sides faded down to a one, tapered to zero in the back, and finger length on top”",
                    "author": "mitchellsnyder",
                    "id": "dzj38ow",
                    "parent_id": "t1_dzixl85",
                    "score": 3,
                    "created_utc": 1527204143.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually didnt know that there's a license for barber.. ",
            "author": "jinda002",
            "id": "dzhqbwm",
            "parent_id": "t3_8lph9w",
            "score": 2,
            "created_utc": 1527149009.0,
            "replies": [
                {
                    "body": "Yup! Alabama was the last state to require one I think. That was 2 years ago or so.",
                    "author": "mitchellsnyder",
                    "id": "dzi17vx",
                    "parent_id": "t1_dzhqbwm",
                    "score": 4,
                    "created_utc": 1527168137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeah!",
            "author": "myhomeworkatethedog1",
            "id": "dzhwtuw",
            "parent_id": "t3_8lph9w",
            "score": 2,
            "created_utc": 1527162503.0,
            "replies": []
        },
        {
            "body": "If I have long hair, should I still go to a barber? Lol",
            "author": "NoNameWalrus",
            "id": "dzijeuo",
            "parent_id": "t3_8lph9w",
            "score": 2,
            "created_utc": 1527185017.0,
            "replies": [
                {
                    "body": "It depends how long and how you get it cut. The rule at my shop is that we’ll cut anything as long as it’s above the shoulders. But even then I’ll only do one length cuts or cuts with long layers since I wasn’t taught much about longer hairstyles.",
                    "author": "mitchellsnyder",
                    "id": "dzilhuv",
                    "parent_id": "t1_dzijeuo",
                    "score": 3,
                    "created_utc": 1527186885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How to deal with cowlicks? When I wake up, my hair \\(especially on the sides\\) is all over the place and I cannot do anything to tame it. I tried every possible product \\+ blow dryer but it doesn't work. \n\nOne other question. My mustaches are growing forward. Hairs are not falling down as they grow, they go forward, so it's like I have a toothbrush on my upper lip. Any ideas on how to fix this?",
            "author": "Elaol",
            "id": "dzinqci",
            "parent_id": "t3_8lph9w",
            "score": 2,
            "created_utc": 1527188912.0,
            "replies": [
                {
                    "body": "There are only two easy ways to deal with cowlicks- keep em long or cut em short. Depending on where they are on your head, you may be able to use them to your advantage with styling. The other way to deal with them is getting a chemical relaxer service. But that only lasts until the hair grows out.\n\nFor the mustache, it sounds like you need some more length in the ‘stache so that it will begin to lay down.",
                    "author": "mitchellsnyder",
                    "id": "dzipffl",
                    "parent_id": "t1_dzinqci",
                    "score": 2,
                    "created_utc": 1527190462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sometimes i shape my hair with a double-sided straight/safety razor. It works really well since I can style my hair then \"scrape\" away the parts I dont want. \n\nHave you found any non-typical tools useful?",
            "author": "madlax18",
            "id": "dziomcj",
            "parent_id": "t3_8lph9w",
            "score": 2,
            "created_utc": 1527189724.0,
            "replies": [
                {
                    "body": "When I had long scene kid hair I always would cut my bangs with a bic razor. Now I just use a straight razor. It’s a technique called razor cutting, and I love it. \n\nI guess the most non-typical tool I use would be a toothbrush for edges, or shaving lather to get a flat top to stand up.",
                    "author": "mitchellsnyder",
                    "id": "dzipq71",
                    "parent_id": "t1_dziomcj",
                    "score": 2,
                    "created_utc": 1527190736.0,
                    "replies": [
                        {
                            "body": "Interesting. How does the effects of cutting with razor differ from shears?",
                            "author": "madlax18",
                            "id": "dzj861f",
                            "parent_id": "t1_dzipq71",
                            "score": 1,
                            "created_utc": 1527209639.0,
                            "replies": [
                                {
                                    "body": "Razor cutting cuts the hair at an angle while shears cut straight across. The angled hair shaft will blend into longer hair more and create a softer overall look. It’s good for when people don’t want to look like they just got a haircut and make the style looked loved in. Razor cutting is more of a high end technique because it is really easy to cut too much at a time. ",
                                    "author": "mitchellsnyder",
                                    "id": "dzj916c",
                                    "parent_id": "t1_dzj861f",
                                    "score": 1,
                                    "created_utc": 1527210618.0,
                                    "replies": [
                                        {
                                            "body": ">Razor cutting is more of a high end technique because it is really easy to cut too much at a time.\n\nas an untrained hair cutter i know this well",
                                            "author": "madlax18",
                                            "id": "dzjidkr",
                                            "parent_id": "t1_dzj916c",
                                            "score": 1,
                                            "created_utc": 1527220982.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you find it more difficult to work on people of mixed race? I'm mixed race and I have a combination of thick, coarse hair and afro. I've never had a good haircut but it doesn't seem I'm alone amongst my mixed race friends. Do you think training or contact with different hair types will help this going forward or do I need to specifically find someone used to working with different types of hair like mine? How do I go about requesting someone like that?",
            "author": "ampersand355",
            "id": "dzipoce",
            "parent_id": "t3_8lph9w",
            "score": 2,
            "created_utc": 1527190689.0,
            "replies": [
                {
                    "body": "It can definitely be tricky, mainly if it is dark hair on lighter skin. The hair texture shouldn’t be too much of an issue unless the barber has only cut straight hair. My advice would be to find more of a racially mixed area, where barbers get exposed to different types of hair daily. I can’t speak for every barber, but my schooling was a good racial mix of practice clients, so I feel more comfortable with different hair types.",
                    "author": "mitchellsnyder",
                    "id": "dzir9dp",
                    "parent_id": "t1_dzipoce",
                    "score": 2,
                    "created_utc": 1527192149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yessss",
            "author": "OdiPhobia",
            "id": "dzhpjfx",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527147258.0,
            "replies": []
        },
        {
            "body": "Can I get some styling advise? https://www.reddit.com/r/malehairadvice/comments/8lpd2g/_/",
            "author": "dawsnow",
            "id": "dzht9ye",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527155943.0,
            "replies": [
                {
                    "body": "Do you part it or just push it to the side?",
                    "author": "mitchellsnyder",
                    "id": "dzi1ono",
                    "parent_id": "t1_dzht9ye",
                    "score": 1,
                    "created_utc": 1527168649.0,
                    "replies": [
                        {
                            "body": "Usually just push it to side",
                            "author": "dawsnow",
                            "id": "dzjb1co",
                            "parent_id": "t1_dzi1ono",
                            "score": 1,
                            "created_utc": 1527212770.0,
                            "replies": [
                                {
                                    "body": "Try a couple different products for your hair. Don’t give up if American crew fiber doesn’t work for you( its honestly one of my least favorite products for myself). Grooming creams seem to work well with your type of hair, they give nice healthy shine and a mild amount of hold so that you can keep pushing it around throughout the day. Try raking the product through with your finger tips from the front to the back and twisting a couple pieces here and there to add more texture.",
                                    "author": "mitchellsnyder",
                                    "id": "dzjc765",
                                    "parent_id": "t1_dzjb1co",
                                    "score": 1,
                                    "created_utc": 1527214052.0,
                                    "replies": [
                                        {
                                            "body": "Thanks!",
                                            "author": "dawsnow",
                                            "id": "dzjegwu",
                                            "parent_id": "t1_dzjc765",
                                            "score": 1,
                                            "created_utc": 1527216594.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes!",
            "author": "dazzle41",
            "id": "dzimpok",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527187977.0,
            "replies": []
        },
        {
            "body": "How much do you make and do you think it's possible to open your own shop in the next few years?",
            "author": "cant-feel_my-face",
            "id": "dziu2qi",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527194752.0,
            "replies": [
                {
                    "body": "I make on average $200 a day. Some days are better than others though. I think I could open a shop if I wanted to in a couple of years, but the shop I’m in now is pretty great, so as of now I don’t plan on opening one.",
                    "author": "mitchellsnyder",
                    "id": "dzixhms",
                    "parent_id": "t1_dziu2qi",
                    "score": 2,
                    "created_utc": 1527198085.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Any suggestions on how to deal with a very obvious cowlick in the front besides lots and lots of product? For reference I usually get a pretty short buzz cut so once it grows out for 2+ weeks it becomes very obvious, like I have a part in the front of my hairline only,",
            "author": "Fa1c0n1",
            "id": "dzj0xnk",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527201650.0,
            "replies": [
                {
                    "body": "Don’t fight it. If you like having short hair, keep it short. But if you start growing it out, try finding a style that works with the cowlick.",
                    "author": "mitchellsnyder",
                    "id": "dzj2o9q",
                    "parent_id": "t1_dzj0xnk",
                    "score": 3,
                    "created_utc": 1527203535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do I actually need as license to cut hair? I used to give haircuts for $5, but I have no formal training. Do I have to worry about getting fined? Is there a barber's union?",
            "author": "Merakel",
            "id": "dzj4o34",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527205697.0,
            "replies": [
                {
                    "body": "Yes. You need a license. In every state. Each state has a board of barbers that will issue fines. I’m not sure about international laws.",
                    "author": "mitchellsnyder",
                    "id": "dzj5fxr",
                    "parent_id": "t1_dzj4o34",
                    "score": 2,
                    "created_utc": 1527206555.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please. ",
            "author": "itskylemeyer",
            "id": "dzxj9tv",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527844654.0,
            "replies": []
        },
        {
            "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/amaaggregator] [Would you like an AMA from a licensed barber?](https://www.reddit.com/r/AMAAggregator/comments/8lphvx/would_you_like_an_ama_from_a_licensed_barber/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "author": "TotesMessenger",
            "id": "dzhfkka",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527131892.0,
            "replies": []
        },
        {
            "body": "What I would like to see is advice from somebody who is developing styles for celebrities, e.g. not just trying to copy paste the same top-10 hair cuts on every head like most barbers/hairdressers/etc do. \nBut truly trying to find something unique for a person. I would easily pay $100-200 for something like that.",
            "author": "WithMyHoodieOn",
            "id": "dzi76ma",
            "parent_id": "t3_8lph9w",
            "score": 1,
            "created_utc": 1527174047.0,
            "replies": []
        },
        {
            "body": "Nah",
            "author": "Lion-Slicer",
            "id": "dzifinj",
            "parent_id": "t3_8lph9w",
            "score": 0,
            "created_utc": 1527181542.0,
            "replies": [
                {
                    "body": "Sick",
                    "author": "mitchellsnyder",
                    "id": "dzii410",
                    "parent_id": "t1_dzifinj",
                    "score": 3,
                    "created_utc": 1527183851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man, longtop/shortsides already sounds stupid to me too but its everything people that post here should try first. Often people post hair with long sides etc and if they’d just cut the sides short, It’d be 100% different and better.",
            "author": "ImQuitingPorn",
            "id": "dzhidsn",
            "parent_id": "t1_dzhgt2l",
            "score": 27,
            "created_utc": 1527135279.0,
            "replies": []
        },
        {
            "body": "It’s funny. You’re obviously trying to parody the default sub response, but you didn’t say “American Crew Fiber.”",
            "author": "PlatonicTroglodyte",
            "id": "dzj5sr4",
            "parent_id": "t1_dzhgt2l",
            "score": 2,
            "created_utc": 1527206956.0,
            "replies": []
        },
        {
            "body": "It’s totally normal. Plus what most people think is dandruff is actually just dry scalp. Dandruff is a fungal infection, and unless diagnosed it’s probably just dry scalp. Using dandruff shampoo actually dries the scalp out more.",
            "author": "mitchellsnyder",
            "id": "dzi0ejx",
            "parent_id": "t1_dzhjg9g",
            "score": 40,
            "created_utc": 1527167206.0,
            "replies": [
                {
                    "body": "that's how they keep you hooked into buying their dandruff shampoo",
                    "author": "GlockWan",
                    "id": "dziq5cy",
                    "parent_id": "t1_dzi0ejx",
                    "score": 13,
                    "created_utc": 1527191124.0,
                    "replies": []
                },
                {
                    "body": "So how would you moisturize your scalp? Less shampoo etc...?",
                    "author": "BushidoBrowne",
                    "id": "dzqe8wz",
                    "parent_id": "t1_dzi0ejx",
                    "score": 1,
                    "created_utc": 1527549479.0,
                    "replies": [
                        {
                            "body": "It’s kinda hard to say since it varies person to person. For some people cutting out shampoo altogether helps or trying different types of shampoo. Sorry I can’t help more with this one... maybe someone else has some recommendations too.",
                            "author": "mitchellsnyder",
                            "id": "dzqrwe0",
                            "parent_id": "t1_dzqe8wz",
                            "score": 3,
                            "created_utc": 1527562889.0,
                            "replies": [
                                {
                                    "body": "I always had dandruff untill I used a hairconditioner and then suddenly it stopped. I guess the hairconditioner smoothes and oils my scalp preventing it from drying hence the dandruff",
                                    "author": "selo1087",
                                    "id": "dzsphmu",
                                    "parent_id": "t1_dzqrwe0",
                                    "score": 1,
                                    "created_utc": 1527642468.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes and no. Split ends aren’t great. The main thing I notice is that split ends allow the hair to tangle more easily and break. Breakage is one reason hair seems to stop growing. Your hair will grow out if you don’t get trims often, but it may take some more time. Although a cosmetologist may have more to say on this since I’m not as familiar with long hair.",
            "author": "mitchellsnyder",
            "id": "dzhi0e2",
            "parent_id": "t1_dzhgy3w",
            "score": 25,
            "created_utc": 1527134791.0,
            "replies": []
        },
        {
            "body": "Cosmo/Barber here. Split ends become breakage which thins out the density of your hair and causes it to tangle more severely. Regular trims are the only way to prevent it. By regular, we generally recommend every 6-8 weeks but you can stretch it depending on the health of your hair. I wouldn’t go longer than three months. Because you haven’t been getting regular trims I would get on a regular schedule of 6-8 weeks like clock work and over the next year, stretch it out and go by feel. By feel I mean when it starts to tangle more frequently and become more unruly, you need a trim. \n\nEdit: grammar",
            "author": "ToastedMarshmellow",
            "id": "dzhjsmt",
            "parent_id": "t1_dzhgy3w",
            "score": 14,
            "created_utc": 1527137194.0,
            "replies": [
                {
                    "body": "as someone with very thick and coarse hair, my length is about 6-7 inches, my hair does not tangle easily and normally maintains a middle part even with no product, should I be concerned with trimming the ends regularly? I don’t believe I have split ends but I do struggle a lot with frizz (TX gets humid) and just  overall volume control of having very thick  hair. ",
                    "author": "notdavidg",
                    "id": "dzhmmuk",
                    "parent_id": "t1_dzhjsmt",
                    "score": 2,
                    "created_utc": 1527141662.0,
                    "replies": [
                        {
                            "body": "Everyone could use a trim now and again. The point is to refresh the ends. Imagine a piece of string. The older and beat up the end of the string or rope is, the more frayed it becomes. If you want to thread that string through the eye of a needle, you have to cut it to get a nice fresh end to work with. Hair does the same thing. Different types of hair will do it at a different rate. I go by my rule of thumb because dead ends snag together like Velcro causing tangles. If you generally don’t ever get tangled, ever, I would stick to some where between every 3 to 4 months to make sure you’re getting them so they don’t get bad. \n\nLet’s talk about the humidity. That could have a lot of causes. Usually the number one cause is it could be dry from over washing. If you’re washing everyday with a really drying product, leaving your hair starving for moisture then walk out in to the Texas humidity, your hair reacts and is drawing in the moisture from the air and it’s not good moisture. What’s your routine? What are you washing and styling with? Have you have any chemical treatments done to your hair like color, perms, or relaxer? Would you have a budget to incorporate new products? ",
                            "author": "ToastedMarshmellow",
                            "id": "dzi5eh5",
                            "parent_id": "t1_dzhmmuk",
                            "score": 5,
                            "created_utc": 1527172371.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Taper- taking longer hair to shorter, usually in the nape area. The recommended style for the back of a hair cut because it will make the cut last longer and grow out better.\n\nDisconnected- think undercut. You take the short hair to an abrupt stop with longer hair on top. There is usually no blend.\n\nFade- a more extreme type of taper, usually around the whole head.\n\nHard part- shaved in part line\n\nFinger length- the width of the barbers finger, usually just enough to lay down and play with.\n\nSide part- parting the hair with the part above the center of the eye on either side.\n\nUnder cut- think 90s skater bad boy. Long hair on top, buzzed short on sides and back. Currently worn with the top combed to one side.\n\nKeep in mind that most Barber terms are not universal. A mid fade to one barber may be a low or high fade to another. ",
            "author": "mitchellsnyder",
            "id": "dzi9geo",
            "parent_id": "t1_dzhjqoc",
            "score": 25,
            "created_utc": 1527176115.0,
            "replies": []
        },
        {
            "body": "Give me a second, I’m doing a head shave, but this is a great question.",
            "author": "mitchellsnyder",
            "id": "dzi5zjh",
            "parent_id": "t1_dzhjqoc",
            "score": 9,
            "created_utc": 1527172924.0,
            "replies": []
        },
        {
            "body": " I personally was never taught to use thinning shears. They were called cheater shears at my school. All thinning was done by point cutting, slicing, chunking, or slithering. I think a lot of hair professionals get caught up with them being called thinning shears instead of blending shears and end up going overboard with them.",
            "author": "mitchellsnyder",
            "id": "dzi0vv9",
            "parent_id": "t1_dzhkuiv",
            "score": 17,
            "created_utc": 1527167760.0,
            "replies": []
        },
        {
            "body": "Yo! I think this is my biggest problem when I get MY hair cut too. I think the best thing to tell your barber is that you want some over hang on the top of the short side. Bringing in a picture helps with this as well. Say you get a 2 on the sides, tell them not to take it all the way up to the part.",
            "author": "mitchellsnyder",
            "id": "dzi12a3",
            "parent_id": "t1_dzhmrk2",
            "score": 7,
            "created_utc": 1527167962.0,
            "replies": []
        },
        {
            "body": "I would like to know this aswell. Currently rocking a grown out undercut. I told him I want it to be able to style both ways. There is way more on the right side and if unstyled it looks terrible.\n\n\nSeems as if alot of barbers try to cover this up by using a shit ton of product. The only thing that does is weigh  my fine wavy hair down.",
            "author": "Savedlinkforlater",
            "id": "dzhn5i7",
            "parent_id": "t1_dzhmrk2",
            "score": 3,
            "created_utc": 1527142593.0,
            "replies": []
        },
        {
            "body": "I had this problem a lot too. Barbers generally tend to follow the pattern your hair will naturally fall into. If you’ve had it lopsided for a while, your hair is trained to fall like that so the barber follows suit. \n\nThere’s only two ways to fix this. Grow it out kinda long and have the barber cut it like that. If you ask for a slick back or something like that, they tend to even it out, especially with longer hair. Or buzz it and start over. ",
            "author": "-Unnamed-",
            "id": "dzign83",
            "parent_id": "t1_dzhmrk2",
            "score": 1,
            "created_utc": 1527182555.0,
            "replies": []
        },
        {
            "body": "Grow it out so they can’t follow the old cut and bring them a new photo. Your texture could also be the type that sticks out when it’s super short so the could be compensating by taking it up so you don’t look like a porcupine. \n\nEdit: reread your post and delete irrelevant information.",
            "author": "ToastedMarshmellow",
            "id": "dzi5xos",
            "parent_id": "t1_dzhmrk2",
            "score": 0,
            "created_utc": 1527172877.0,
            "replies": []
        },
        {
            "body": "1. Be open an honest. Tell them what you liked and disliked about your last cut. When you show a picture say what you like about it.\n2. It depends on the type of hair. But I think the clubman heavy hold water based pomade is amazing, and cheap as fuck. I also like bonafide matte.\n3. It’s not too bad. It was worse when I first started.",
            "author": "mitchellsnyder",
            "id": "dzi2c42",
            "parent_id": "t1_dzhvxmw",
            "score": 4,
            "created_utc": 1527169347.0,
            "replies": []
        },
        {
            "body": "I went to regular college first. I got my degree and a decent job but had always wanted to be a barber. Once I got married, my wife told me I could go back to school if I like. So I went and talked to the barbers I knew and asked for advice on a school. Then I signed up, worked part time at my old job, and part time student for 1500 hours.",
            "author": "mitchellsnyder",
            "id": "dzi16rd",
            "parent_id": "t1_dzhn0s8",
            "score": 5,
            "created_utc": 1527168102.0,
            "replies": []
        },
        {
            "body": "It’s not weird! We have a joke that an inch is different to every person who comes in. The best way, if you aren’t getting a blade length is to have them spin you around to look in the mirror and you show them how much you want off",
            "author": "mitchellsnyder",
            "id": "dzi5pmq",
            "parent_id": "t1_dzhsxxm",
            "score": 3,
            "created_utc": 1527172663.0,
            "replies": []
        },
        {
            "body": "My shop does cut for cut, so I cut one barber then they will cut mine. Or I’ll go see friends, or sometimes back to the barber school.",
            "author": "mitchellsnyder",
            "id": "dzi5re1",
            "parent_id": "t1_dzi2vab",
            "score": 10,
            "created_utc": 1527172711.0,
            "replies": []
        },
        {
            "body": "I had a couple shops lined up before I got out. Ask your instructors if they know any shops that need a barber, I’m sure they could help you. Other than that i would say go to shops you like and ask them if they’ll be hiring when you get out",
            "author": "mitchellsnyder",
            "id": "dzi5y96",
            "parent_id": "t1_dzi22en",
            "score": 3,
            "created_utc": 1527172892.0,
            "replies": [
                {
                    "body": "I’m sure I’ll have something lined up by the end. I just hit 600 hours so I’m not even halfway done yet ",
                    "author": "nudebeachpatrol",
                    "id": "dzi6fdm",
                    "parent_id": "t1_dzi5y96",
                    "score": 2,
                    "created_utc": 1527173340.0,
                    "replies": [
                        {
                            "body": "Oh yeah, you’ll have something. I started getting offers around 1000 hours",
                            "author": "mitchellsnyder",
                            "id": "dzi8yuw",
                            "parent_id": "t1_dzi6fdm",
                            "score": 2,
                            "created_utc": 1527175677.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We’re pretty used to people not knowing how to describe styles to us. The best way is knowing the number of guard or blade that you get and where you get it.\n\n[edit] Showing a picture doesn’t make you look like a fool at all! Also if you get a haircut you like, ask the barber what they did so if you don’t get in with them next time you can say something like “I get a two on the sides faded down to a one, tapered to zero in the back, and finger length on top”",
            "author": "mitchellsnyder",
            "id": "dzj38ow",
            "parent_id": "t1_dzixl85",
            "score": 3,
            "created_utc": 1527204143.0,
            "replies": []
        },
        {
            "body": "Yup! Alabama was the last state to require one I think. That was 2 years ago or so.",
            "author": "mitchellsnyder",
            "id": "dzi17vx",
            "parent_id": "t1_dzhqbwm",
            "score": 4,
            "created_utc": 1527168137.0,
            "replies": []
        },
        {
            "body": "It depends how long and how you get it cut. The rule at my shop is that we’ll cut anything as long as it’s above the shoulders. But even then I’ll only do one length cuts or cuts with long layers since I wasn’t taught much about longer hairstyles.",
            "author": "mitchellsnyder",
            "id": "dzilhuv",
            "parent_id": "t1_dzijeuo",
            "score": 3,
            "created_utc": 1527186885.0,
            "replies": []
        },
        {
            "body": "There are only two easy ways to deal with cowlicks- keep em long or cut em short. Depending on where they are on your head, you may be able to use them to your advantage with styling. The other way to deal with them is getting a chemical relaxer service. But that only lasts until the hair grows out.\n\nFor the mustache, it sounds like you need some more length in the ‘stache so that it will begin to lay down.",
            "author": "mitchellsnyder",
            "id": "dzipffl",
            "parent_id": "t1_dzinqci",
            "score": 2,
            "created_utc": 1527190462.0,
            "replies": []
        },
        {
            "body": "When I had long scene kid hair I always would cut my bangs with a bic razor. Now I just use a straight razor. It’s a technique called razor cutting, and I love it. \n\nI guess the most non-typical tool I use would be a toothbrush for edges, or shaving lather to get a flat top to stand up.",
            "author": "mitchellsnyder",
            "id": "dzipq71",
            "parent_id": "t1_dziomcj",
            "score": 2,
            "created_utc": 1527190736.0,
            "replies": [
                {
                    "body": "Interesting. How does the effects of cutting with razor differ from shears?",
                    "author": "madlax18",
                    "id": "dzj861f",
                    "parent_id": "t1_dzipq71",
                    "score": 1,
                    "created_utc": 1527209639.0,
                    "replies": [
                        {
                            "body": "Razor cutting cuts the hair at an angle while shears cut straight across. The angled hair shaft will blend into longer hair more and create a softer overall look. It’s good for when people don’t want to look like they just got a haircut and make the style looked loved in. Razor cutting is more of a high end technique because it is really easy to cut too much at a time. ",
                            "author": "mitchellsnyder",
                            "id": "dzj916c",
                            "parent_id": "t1_dzj861f",
                            "score": 1,
                            "created_utc": 1527210618.0,
                            "replies": [
                                {
                                    "body": ">Razor cutting is more of a high end technique because it is really easy to cut too much at a time.\n\nas an untrained hair cutter i know this well",
                                    "author": "madlax18",
                                    "id": "dzjidkr",
                                    "parent_id": "t1_dzj916c",
                                    "score": 1,
                                    "created_utc": 1527220982.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It can definitely be tricky, mainly if it is dark hair on lighter skin. The hair texture shouldn’t be too much of an issue unless the barber has only cut straight hair. My advice would be to find more of a racially mixed area, where barbers get exposed to different types of hair daily. I can’t speak for every barber, but my schooling was a good racial mix of practice clients, so I feel more comfortable with different hair types.",
            "author": "mitchellsnyder",
            "id": "dzir9dp",
            "parent_id": "t1_dzipoce",
            "score": 2,
            "created_utc": 1527192149.0,
            "replies": []
        },
        {
            "body": "Do you part it or just push it to the side?",
            "author": "mitchellsnyder",
            "id": "dzi1ono",
            "parent_id": "t1_dzht9ye",
            "score": 1,
            "created_utc": 1527168649.0,
            "replies": [
                {
                    "body": "Usually just push it to side",
                    "author": "dawsnow",
                    "id": "dzjb1co",
                    "parent_id": "t1_dzi1ono",
                    "score": 1,
                    "created_utc": 1527212770.0,
                    "replies": [
                        {
                            "body": "Try a couple different products for your hair. Don’t give up if American crew fiber doesn’t work for you( its honestly one of my least favorite products for myself). Grooming creams seem to work well with your type of hair, they give nice healthy shine and a mild amount of hold so that you can keep pushing it around throughout the day. Try raking the product through with your finger tips from the front to the back and twisting a couple pieces here and there to add more texture.",
                            "author": "mitchellsnyder",
                            "id": "dzjc765",
                            "parent_id": "t1_dzjb1co",
                            "score": 1,
                            "created_utc": 1527214052.0,
                            "replies": [
                                {
                                    "body": "Thanks!",
                                    "author": "dawsnow",
                                    "id": "dzjegwu",
                                    "parent_id": "t1_dzjc765",
                                    "score": 1,
                                    "created_utc": 1527216594.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I make on average $200 a day. Some days are better than others though. I think I could open a shop if I wanted to in a couple of years, but the shop I’m in now is pretty great, so as of now I don’t plan on opening one.",
            "author": "mitchellsnyder",
            "id": "dzixhms",
            "parent_id": "t1_dziu2qi",
            "score": 2,
            "created_utc": 1527198085.0,
            "replies": []
        },
        {
            "body": "Don’t fight it. If you like having short hair, keep it short. But if you start growing it out, try finding a style that works with the cowlick.",
            "author": "mitchellsnyder",
            "id": "dzj2o9q",
            "parent_id": "t1_dzj0xnk",
            "score": 3,
            "created_utc": 1527203535.0,
            "replies": []
        },
        {
            "body": "Yes. You need a license. In every state. Each state has a board of barbers that will issue fines. I’m not sure about international laws.",
            "author": "mitchellsnyder",
            "id": "dzj5fxr",
            "parent_id": "t1_dzj4o34",
            "score": 2,
            "created_utc": 1527206555.0,
            "replies": []
        },
        {
            "body": "Sick",
            "author": "mitchellsnyder",
            "id": "dzii410",
            "parent_id": "t1_dzifinj",
            "score": 3,
            "created_utc": 1527183851.0,
            "replies": []
        },
        {
            "body": "that's how they keep you hooked into buying their dandruff shampoo",
            "author": "GlockWan",
            "id": "dziq5cy",
            "parent_id": "t1_dzi0ejx",
            "score": 13,
            "created_utc": 1527191124.0,
            "replies": []
        },
        {
            "body": "So how would you moisturize your scalp? Less shampoo etc...?",
            "author": "BushidoBrowne",
            "id": "dzqe8wz",
            "parent_id": "t1_dzi0ejx",
            "score": 1,
            "created_utc": 1527549479.0,
            "replies": [
                {
                    "body": "It’s kinda hard to say since it varies person to person. For some people cutting out shampoo altogether helps or trying different types of shampoo. Sorry I can’t help more with this one... maybe someone else has some recommendations too.",
                    "author": "mitchellsnyder",
                    "id": "dzqrwe0",
                    "parent_id": "t1_dzqe8wz",
                    "score": 3,
                    "created_utc": 1527562889.0,
                    "replies": [
                        {
                            "body": "I always had dandruff untill I used a hairconditioner and then suddenly it stopped. I guess the hairconditioner smoothes and oils my scalp preventing it from drying hence the dandruff",
                            "author": "selo1087",
                            "id": "dzsphmu",
                            "parent_id": "t1_dzqrwe0",
                            "score": 1,
                            "created_utc": 1527642468.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "as someone with very thick and coarse hair, my length is about 6-7 inches, my hair does not tangle easily and normally maintains a middle part even with no product, should I be concerned with trimming the ends regularly? I don’t believe I have split ends but I do struggle a lot with frizz (TX gets humid) and just  overall volume control of having very thick  hair. ",
            "author": "notdavidg",
            "id": "dzhmmuk",
            "parent_id": "t1_dzhjsmt",
            "score": 2,
            "created_utc": 1527141662.0,
            "replies": [
                {
                    "body": "Everyone could use a trim now and again. The point is to refresh the ends. Imagine a piece of string. The older and beat up the end of the string or rope is, the more frayed it becomes. If you want to thread that string through the eye of a needle, you have to cut it to get a nice fresh end to work with. Hair does the same thing. Different types of hair will do it at a different rate. I go by my rule of thumb because dead ends snag together like Velcro causing tangles. If you generally don’t ever get tangled, ever, I would stick to some where between every 3 to 4 months to make sure you’re getting them so they don’t get bad. \n\nLet’s talk about the humidity. That could have a lot of causes. Usually the number one cause is it could be dry from over washing. If you’re washing everyday with a really drying product, leaving your hair starving for moisture then walk out in to the Texas humidity, your hair reacts and is drawing in the moisture from the air and it’s not good moisture. What’s your routine? What are you washing and styling with? Have you have any chemical treatments done to your hair like color, perms, or relaxer? Would you have a budget to incorporate new products? ",
                    "author": "ToastedMarshmellow",
                    "id": "dzi5eh5",
                    "parent_id": "t1_dzhmmuk",
                    "score": 5,
                    "created_utc": 1527172371.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sure I’ll have something lined up by the end. I just hit 600 hours so I’m not even halfway done yet ",
            "author": "nudebeachpatrol",
            "id": "dzi6fdm",
            "parent_id": "t1_dzi5y96",
            "score": 2,
            "created_utc": 1527173340.0,
            "replies": [
                {
                    "body": "Oh yeah, you’ll have something. I started getting offers around 1000 hours",
                    "author": "mitchellsnyder",
                    "id": "dzi8yuw",
                    "parent_id": "t1_dzi6fdm",
                    "score": 2,
                    "created_utc": 1527175677.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting. How does the effects of cutting with razor differ from shears?",
            "author": "madlax18",
            "id": "dzj861f",
            "parent_id": "t1_dzipq71",
            "score": 1,
            "created_utc": 1527209639.0,
            "replies": [
                {
                    "body": "Razor cutting cuts the hair at an angle while shears cut straight across. The angled hair shaft will blend into longer hair more and create a softer overall look. It’s good for when people don’t want to look like they just got a haircut and make the style looked loved in. Razor cutting is more of a high end technique because it is really easy to cut too much at a time. ",
                    "author": "mitchellsnyder",
                    "id": "dzj916c",
                    "parent_id": "t1_dzj861f",
                    "score": 1,
                    "created_utc": 1527210618.0,
                    "replies": [
                        {
                            "body": ">Razor cutting is more of a high end technique because it is really easy to cut too much at a time.\n\nas an untrained hair cutter i know this well",
                            "author": "madlax18",
                            "id": "dzjidkr",
                            "parent_id": "t1_dzj916c",
                            "score": 1,
                            "created_utc": 1527220982.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Usually just push it to side",
            "author": "dawsnow",
            "id": "dzjb1co",
            "parent_id": "t1_dzi1ono",
            "score": 1,
            "created_utc": 1527212770.0,
            "replies": [
                {
                    "body": "Try a couple different products for your hair. Don’t give up if American crew fiber doesn’t work for you( its honestly one of my least favorite products for myself). Grooming creams seem to work well with your type of hair, they give nice healthy shine and a mild amount of hold so that you can keep pushing it around throughout the day. Try raking the product through with your finger tips from the front to the back and twisting a couple pieces here and there to add more texture.",
                    "author": "mitchellsnyder",
                    "id": "dzjc765",
                    "parent_id": "t1_dzjb1co",
                    "score": 1,
                    "created_utc": 1527214052.0,
                    "replies": [
                        {
                            "body": "Thanks!",
                            "author": "dawsnow",
                            "id": "dzjegwu",
                            "parent_id": "t1_dzjc765",
                            "score": 1,
                            "created_utc": 1527216594.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s kinda hard to say since it varies person to person. For some people cutting out shampoo altogether helps or trying different types of shampoo. Sorry I can’t help more with this one... maybe someone else has some recommendations too.",
            "author": "mitchellsnyder",
            "id": "dzqrwe0",
            "parent_id": "t1_dzqe8wz",
            "score": 3,
            "created_utc": 1527562889.0,
            "replies": [
                {
                    "body": "I always had dandruff untill I used a hairconditioner and then suddenly it stopped. I guess the hairconditioner smoothes and oils my scalp preventing it from drying hence the dandruff",
                    "author": "selo1087",
                    "id": "dzsphmu",
                    "parent_id": "t1_dzqrwe0",
                    "score": 1,
                    "created_utc": 1527642468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone could use a trim now and again. The point is to refresh the ends. Imagine a piece of string. The older and beat up the end of the string or rope is, the more frayed it becomes. If you want to thread that string through the eye of a needle, you have to cut it to get a nice fresh end to work with. Hair does the same thing. Different types of hair will do it at a different rate. I go by my rule of thumb because dead ends snag together like Velcro causing tangles. If you generally don’t ever get tangled, ever, I would stick to some where between every 3 to 4 months to make sure you’re getting them so they don’t get bad. \n\nLet’s talk about the humidity. That could have a lot of causes. Usually the number one cause is it could be dry from over washing. If you’re washing everyday with a really drying product, leaving your hair starving for moisture then walk out in to the Texas humidity, your hair reacts and is drawing in the moisture from the air and it’s not good moisture. What’s your routine? What are you washing and styling with? Have you have any chemical treatments done to your hair like color, perms, or relaxer? Would you have a budget to incorporate new products? ",
            "author": "ToastedMarshmellow",
            "id": "dzi5eh5",
            "parent_id": "t1_dzhmmuk",
            "score": 5,
            "created_utc": 1527172371.0,
            "replies": []
        },
        {
            "body": "Oh yeah, you’ll have something. I started getting offers around 1000 hours",
            "author": "mitchellsnyder",
            "id": "dzi8yuw",
            "parent_id": "t1_dzi6fdm",
            "score": 2,
            "created_utc": 1527175677.0,
            "replies": []
        },
        {
            "body": "Razor cutting cuts the hair at an angle while shears cut straight across. The angled hair shaft will blend into longer hair more and create a softer overall look. It’s good for when people don’t want to look like they just got a haircut and make the style looked loved in. Razor cutting is more of a high end technique because it is really easy to cut too much at a time. ",
            "author": "mitchellsnyder",
            "id": "dzj916c",
            "parent_id": "t1_dzj861f",
            "score": 1,
            "created_utc": 1527210618.0,
            "replies": [
                {
                    "body": ">Razor cutting is more of a high end technique because it is really easy to cut too much at a time.\n\nas an untrained hair cutter i know this well",
                    "author": "madlax18",
                    "id": "dzjidkr",
                    "parent_id": "t1_dzj916c",
                    "score": 1,
                    "created_utc": 1527220982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Try a couple different products for your hair. Don’t give up if American crew fiber doesn’t work for you( its honestly one of my least favorite products for myself). Grooming creams seem to work well with your type of hair, they give nice healthy shine and a mild amount of hold so that you can keep pushing it around throughout the day. Try raking the product through with your finger tips from the front to the back and twisting a couple pieces here and there to add more texture.",
            "author": "mitchellsnyder",
            "id": "dzjc765",
            "parent_id": "t1_dzjb1co",
            "score": 1,
            "created_utc": 1527214052.0,
            "replies": [
                {
                    "body": "Thanks!",
                    "author": "dawsnow",
                    "id": "dzjegwu",
                    "parent_id": "t1_dzjc765",
                    "score": 1,
                    "created_utc": 1527216594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always had dandruff untill I used a hairconditioner and then suddenly it stopped. I guess the hairconditioner smoothes and oils my scalp preventing it from drying hence the dandruff",
            "author": "selo1087",
            "id": "dzsphmu",
            "parent_id": "t1_dzqrwe0",
            "score": 1,
            "created_utc": 1527642468.0,
            "replies": []
        },
        {
            "body": ">Razor cutting is more of a high end technique because it is really easy to cut too much at a time.\n\nas an untrained hair cutter i know this well",
            "author": "madlax18",
            "id": "dzjidkr",
            "parent_id": "t1_dzj916c",
            "score": 1,
            "created_utc": 1527220982.0,
            "replies": []
        },
        {
            "body": "Thanks!",
            "author": "dawsnow",
            "id": "dzjegwu",
            "parent_id": "t1_dzjc765",
            "score": 1,
            "created_utc": 1527216594.0,
            "replies": []
        }
    ]
}