{
    "title": "Before/after a keratin treatment, nothing i did could fix it and the curly hair methods were no help",
    "post_id": "cbiva4",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/cbiva4/beforeafter_a_keratin_treatment_nothing_i_did/",
    "author": "titaniumsack",
    "body": "",
    "url": "https://i.redd.it/hfcrbxuw5i931.jpg",
    "score": 449,
    "upvote_ratio": 0.99,
    "created_utc": 1562776015.0,
    "num_comments": 38,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I don't know too much about keratin treatments but I do have the same natural hair type as you and I've solved this frizzy, course hair \"problem\" ages ago based on a tip from a hair dresser friend. I use a chemical relaxer treatment called Dark n Lovely. It's in the \"ethnic\" hair care section, but it basically gives you these exact same results you just had with the keratin treatment. It's about $7 a box (one treatment) and only takes about 10 minutes. It says to leave it in for 12-15 minutes but remember that this product is intended for very course African American hair. My hair is more Middle Eastern, course, but not *that* course. It's similar to yours. so I go very conservative on timing based on this understanding. It's a powerful chemical so every minute matters, but it's  safe if you follow the instructions. The results are permanent but obviously don't apply to new growth so I end up relaxing my hair about once a month to keep up. Just a tip to save you some time and money. Happy to provide more details if you'd like.",
            "author": "electrickeyez",
            "id": "etgjx8q",
            "parent_id": "t3_cbiva4",
            "score": 125,
            "created_utc": 1562792613.0,
            "replies": [
                {
                    "body": "What are the  things that you do? In which order? Shampoo etc",
                    "author": "Mads319",
                    "id": "etgmuqq",
                    "parent_id": "t1_etgjx8q",
                    "score": 24,
                    "created_utc": 1562794494.0,
                    "replies": [
                        {
                            "body": "I used to follow the instructions pretty strictly, and when it comes to the precautionary stuff I definitely still do by routine. But I've modified a few things over the years based on my needs and experiences.\n\nI try to make sure my hair is natural with no product in it when I decide to relax. I apply vaseline to my forehead, ears, and the back of my neck -- this creates a barrier which prevents chemical burns/redness should the relaxer make contact with your exposed skin. I mix the relaxer ingredients and then work the relaxer through my hair. I then take a comb and comb it back when my hair style is longer or forward when my hair style is shorter. The relaxer is very thick so it keeps the hair nice and straight for the time it's in. I've been told that it's basically a \"perm\" like the kind women used to get but instead of perming curls, it's perming \"straight\".\n\nThe relaxer product is designed for African American hair and says to leave it in for 12-15 minutes. My hair is more Middle Eastern, course but not that course, so I like to play things a bit more on the conservative side and just do 10 minutes.\n\nThen you rinse, apply this deactivator stuff it comes with, rinse that, then shampoo with the  shampoo stuff that it comes with. It's a pink color coded shampoo. Basically, you shampoo and rinse until the shampoo foam that washes up is white and no longer pink. This usually takes 2-3 shampoos for me. Once the pink is gone, I always give it one extra shampoo just to be sure I got it all.\n\nThen you use the conditioner it comes with and rinse.\n\nOnce you're done with the rinse, give it a towel dry and enjoy your gorgeous new relaxed hair. They give you a leave in conditioner treatment which they suggest you use for a couple days, but I just do it once and toss it. It's nice after the treatment, but the stuff is greasy and I've come to find more than one leave-in application unnecessary over the years. But that might just be me.\n\nFor the first day or so, your scalp might be a bit sensitive. Especially after your first couple times, but it should be very mild. If it's overly sensitive, you're probably leaving the relaxer in too long or you're letting it get too close to the scalp.  It's all about timing and contact, you learn after your first couple times. You don't have to cover every last mm of every single hair strand. Just work it in casually and comb straight.",
                            "author": "electrickeyez",
                            "id": "etheuv8",
                            "parent_id": "t1_etgmuqq",
                            "score": 16,
                            "created_utc": 1562813552.0,
                            "replies": [
                                {
                                    "body": "Just wanted to thank you for posting this. Gonna buy this and give it a shot, my hair is pretty similar to the pic above. I'm Brazilian and it gets pretty frizzy/curly.\n\n https://imgur.com/1VlcRw2.jpg \n\nHope it works",
                                    "author": "WhereTruthLies",
                                    "id": "ethohk2",
                                    "parent_id": "t1_etheuv8",
                                    "score": 4,
                                    "created_utc": 1562821905.0,
                                    "replies": [
                                        {
                                            "body": "It's going to look great, you've got great hair for it. You might be surprised that it'll give you a bit more length! Remember to be conservative all around (quantity and time) and protect your exposed skin with vaseline before applying! Post updates!",
                                            "author": "electrickeyez",
                                            "id": "etjhn2e",
                                            "parent_id": "t1_ethohk2",
                                            "score": 2,
                                            "created_utc": 1562873800.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Seconded!",
                            "author": "dihydrogen__monoxide",
                            "id": "etgpf8j",
                            "parent_id": "t1_etgmuqq",
                            "score": 1,
                            "created_utc": 1562796054.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Also could you share a picture of your hair pls (before & after)",
                    "author": "LeDinosaur",
                    "id": "etgpds4",
                    "parent_id": "t1_etgjx8q",
                    "score": 11,
                    "created_utc": 1562796030.0,
                    "replies": [
                        {
                            "body": "Okay, so it's been probably 10+ years that I've been relaxing, so finding a before is quite challenging. But my natural hair is very middle eastern, course, wavy, and thick -- very similar to OP. However, I've gone through varying states of laziness over the years and have definitely gone through phases where I might pass on relaxing for a couple months. I created this album showing the varying degrees of relaxing over the years:  [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
                            "author": "electrickeyez",
                            "id": "ethceip",
                            "parent_id": "t1_etgpds4",
                            "score": 3,
                            "created_utc": 1562811668.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Optimum is a better brand if you haven’t tried it! Results last a little bit longer and cause less damage. I’ve tried all the products been using it for ~10 years",
                    "author": "t-a808",
                    "id": "etgu1w5",
                    "parent_id": "t1_etgjx8q",
                    "score": 9,
                    "created_utc": 1562798865.0,
                    "replies": [
                        {
                            "body": "What optimum specifically?",
                            "author": null,
                            "id": "eth0q0d",
                            "parent_id": "t1_etgu1w5",
                            "score": 3,
                            "created_utc": 1562803069.0,
                            "replies": [
                                {
                                    "body": "https://www.amazon.com/Optimum-Breakage-Relaxer-Regular-Strength/dp/B005IUGYFC\n\nGo with the regular strength",
                                    "author": "t-a808",
                                    "id": "etxav32",
                                    "parent_id": "t1_eth0q0d",
                                    "score": 3,
                                    "created_utc": 1563295354.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "When I feel rich I spring for the Optimum! It's a couple bucks more and probably is better but for whatever reason it's never impressed enough over Dark N Lovely to make it my standard. I think it's made by the same company.",
                            "author": "electrickeyez",
                            "id": "ethdgrb",
                            "parent_id": "t1_etgu1w5",
                            "score": 3,
                            "created_utc": 1562812481.0,
                            "replies": []
                        },
                        {
                            "body": "Okay, so as a pale white guy, I can just do this? I have wavy and annoying hair.",
                            "author": "AscentToZenith",
                            "id": "ethdp1b",
                            "parent_id": "t1_etgu1w5",
                            "score": 3,
                            "created_utc": 1562812658.0,
                            "replies": [
                                {
                                    "body": "Definitely. I've been doing it for years. [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
                                    "author": "electrickeyez",
                                    "id": "ethfepl",
                                    "parent_id": "t1_ethdp1b",
                                    "score": 2,
                                    "created_utc": 1562813985.0,
                                    "replies": []
                                },
                                {
                                    "body": "Is your hair thick or fine? I have thick hair with really tight curls, so this thins the hair shaft a little bit and straightens it at the same time. If your hair is already thin, then it might be prone to breakage. \n\nI don’t have an imgur account, so here’s a google image example of my hair type:\nhttps://images.app.goo.gl/dUFcNkSyQPrcJohs7",
                                    "author": "t-a808",
                                    "id": "etxb66g",
                                    "parent_id": "t1_ethdp1b",
                                    "score": 1,
                                    "created_utc": 1563295545.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's funny, i actually do this regularly my hair is mixed coarse silky (i'm jamaican, irish, English, chinese mixed but i guess jamaican dominant traits) and its just part of what i do idk. I've been meaning to make a post about it myself but waaaaaaay too nervous\nEdit: was nervous af typing this out",
                    "author": "LieutenantHaven",
                    "id": "ethwm7f",
                    "parent_id": "t1_etgjx8q",
                    "score": 3,
                    "created_utc": 1562829670.0,
                    "replies": []
                },
                {
                    "body": "Do you have any hair loss or thinning? I’m curious to try this because I have the same hair type as you but I have some thinning and am kinda worried about damage or further hair loss.",
                    "author": "O-Prime",
                    "id": "ethls2g",
                    "parent_id": "t1_etgjx8q",
                    "score": 1,
                    "created_utc": 1562819359.0,
                    "replies": [
                        {
                            "body": "I've been blessed with a full thick head of hair. I'm 35, I've been relaxing since about age 21 and thus far, I'm showing no signs of hair loss at all. At this point, if or when I ever do start losing my hair, I don't think I'll be able to ever reasonably argue relaxing had anything to do with it.",
                            "author": "electrickeyez",
                            "id": "etjhf3j",
                            "parent_id": "t1_ethls2g",
                            "score": 3,
                            "created_utc": 1562873667.0,
                            "replies": []
                        },
                        {
                            "body": "did you end up doing it? if so, did it affect your hair loss/thinning?",
                            "author": "issathroawaybro",
                            "id": "jhfbjb0",
                            "parent_id": "t1_ethls2g",
                            "score": 1,
                            "created_utc": 1682275865.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whoa. I always wanted to do it but never trusted it. How much did it cost",
            "author": "LeDinosaur",
            "id": "etgpft7",
            "parent_id": "t3_cbiva4",
            "score": 20,
            "created_utc": 1562796064.0,
            "replies": [
                {
                    "body": "my grandma is a hair stylist so nothing on my end",
                    "author": "titaniumsack",
                    "id": "etgpjmk",
                    "parent_id": "t1_etgpft7",
                    "score": 15,
                    "created_utc": 1562796129.0,
                    "replies": [
                        {
                            "body": "Lucky! Do you have thin hair (not thinning but generally thinner)",
                            "author": "LeDinosaur",
                            "id": "etgywzb",
                            "parent_id": "t1_etgpjmk",
                            "score": 10,
                            "created_utc": 1562801897.0,
                            "replies": [
                                {
                                    "body": "Fine hair, yea, not thinning",
                                    "author": "titaniumsack",
                                    "id": "eth0dxa",
                                    "parent_id": "t1_etgywzb",
                                    "score": 6,
                                    "created_utc": 1562802835.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gotcha. Well it looks a lot better bro 👍🏽",
            "author": "og_jag",
            "id": "etgd1wk",
            "parent_id": "t3_cbiva4",
            "score": 15,
            "created_utc": 1562788411.0,
            "replies": [
                {
                    "body": "Thank u fam 👌🏻",
                    "author": "titaniumsack",
                    "id": "etie55d",
                    "parent_id": "t1_etgd1wk",
                    "score": 1,
                    "created_utc": 1562847416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why’s your natural hair like that?",
            "author": "og_jag",
            "id": "etgcxnw",
            "parent_id": "t3_cbiva4",
            "score": 55,
            "created_utc": 1562788343.0,
            "replies": [
                {
                    "body": "humidity/genetics",
                    "author": "titaniumsack",
                    "id": "etgczt9",
                    "parent_id": "t1_etgcxnw",
                    "score": 66,
                    "created_utc": 1562788377.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "etgsdi2",
                    "parent_id": "t1_etgcxnw",
                    "score": 4,
                    "created_utc": 1562797842.0,
                    "replies": [
                        {
                            "body": "I had best results with cold water, but even then it looked like up above, dry, frizzy",
                            "author": "titaniumsack",
                            "id": "etie4so",
                            "parent_id": "t1_etgsdi2",
                            "score": 1,
                            "created_utc": 1562847408.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "that is what I need exactly right now. I have notoriously thick, straight, forward pointing hair which does not part to any side properly and ends up looking fuzzy. I might look into this treatment!",
            "author": "retrodoakes",
            "id": "etgqkg3",
            "parent_id": "t3_cbiva4",
            "score": 6,
            "created_utc": 1562796750.0,
            "replies": []
        },
        {
            "body": "Hey your hair kind of looks similar to mine in the first picture. My hair is ultra rough and thick, and for some reason it’s coarse, it’s also slightly curly too.  Is this how you kind of can get it to a sleek texture? I don’t really know anything about hair.",
            "author": "moonkie888",
            "id": "etgqtqb",
            "parent_id": "t3_cbiva4",
            "score": 5,
            "created_utc": 1562796907.0,
            "replies": [
                {
                    "body": "Yea, this will do it, i have fine hair, check out jason makki youtube videos",
                    "author": "titaniumsack",
                    "id": "etgt4ej",
                    "parent_id": "t1_etgqtqb",
                    "score": 3,
                    "created_utc": 1562798297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy hell. This thread may have saved my hair. My hair is exactly like OP’s and I hate it! It’s so fucking hard to style. I use pomade but it doesn’t last. My hair is thick, stupid coarse and just puffs up with no product in it. Great grand father was Portuguese and Senegalese so that’s probably where I get it from. Thank you so much for these suggestions! Can’t wait to try them. Which keratin treatment did you use OP?",
            "author": "changeover21",
            "id": "ethje12",
            "parent_id": "t3_cbiva4",
            "score": 3,
            "created_utc": 1562817233.0,
            "replies": [
                {
                    "body": "https://youtu.be/ioKwPvLRn_M\nPretty much this but i think she used a slight different cream on my hair",
                    "author": "titaniumsack",
                    "id": "etie2pp",
                    "parent_id": "t1_ethje12",
                    "score": 2,
                    "created_utc": 1562847359.0,
                    "replies": [
                        {
                            "body": "Thanks man!",
                            "author": "changeover21",
                            "id": "etiz77w",
                            "parent_id": "t1_etie2pp",
                            "score": 1,
                            "created_utc": 1562863009.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "is it some kind of perm?",
            "author": "Jhon-Weak",
            "id": "eti84c5",
            "parent_id": "t3_cbiva4",
            "score": 1,
            "created_utc": 1562841916.0,
            "replies": [
                {
                    "body": "https://youtu.be/ioKwPvLRn_M\nPretty much this but i think she used a slight different cream on my hair",
                    "author": "titaniumsack",
                    "id": "etie1x0",
                    "parent_id": "t1_eti84c5",
                    "score": 2,
                    "created_utc": 1562847340.0,
                    "replies": [
                        {
                            "body": "thanks alot!",
                            "author": "Jhon-Weak",
                            "id": "etimpmx",
                            "parent_id": "t1_etie1x0",
                            "score": 1,
                            "created_utc": 1562854752.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are the  things that you do? In which order? Shampoo etc",
            "author": "Mads319",
            "id": "etgmuqq",
            "parent_id": "t1_etgjx8q",
            "score": 24,
            "created_utc": 1562794494.0,
            "replies": [
                {
                    "body": "I used to follow the instructions pretty strictly, and when it comes to the precautionary stuff I definitely still do by routine. But I've modified a few things over the years based on my needs and experiences.\n\nI try to make sure my hair is natural with no product in it when I decide to relax. I apply vaseline to my forehead, ears, and the back of my neck -- this creates a barrier which prevents chemical burns/redness should the relaxer make contact with your exposed skin. I mix the relaxer ingredients and then work the relaxer through my hair. I then take a comb and comb it back when my hair style is longer or forward when my hair style is shorter. The relaxer is very thick so it keeps the hair nice and straight for the time it's in. I've been told that it's basically a \"perm\" like the kind women used to get but instead of perming curls, it's perming \"straight\".\n\nThe relaxer product is designed for African American hair and says to leave it in for 12-15 minutes. My hair is more Middle Eastern, course but not that course, so I like to play things a bit more on the conservative side and just do 10 minutes.\n\nThen you rinse, apply this deactivator stuff it comes with, rinse that, then shampoo with the  shampoo stuff that it comes with. It's a pink color coded shampoo. Basically, you shampoo and rinse until the shampoo foam that washes up is white and no longer pink. This usually takes 2-3 shampoos for me. Once the pink is gone, I always give it one extra shampoo just to be sure I got it all.\n\nThen you use the conditioner it comes with and rinse.\n\nOnce you're done with the rinse, give it a towel dry and enjoy your gorgeous new relaxed hair. They give you a leave in conditioner treatment which they suggest you use for a couple days, but I just do it once and toss it. It's nice after the treatment, but the stuff is greasy and I've come to find more than one leave-in application unnecessary over the years. But that might just be me.\n\nFor the first day or so, your scalp might be a bit sensitive. Especially after your first couple times, but it should be very mild. If it's overly sensitive, you're probably leaving the relaxer in too long or you're letting it get too close to the scalp.  It's all about timing and contact, you learn after your first couple times. You don't have to cover every last mm of every single hair strand. Just work it in casually and comb straight.",
                    "author": "electrickeyez",
                    "id": "etheuv8",
                    "parent_id": "t1_etgmuqq",
                    "score": 16,
                    "created_utc": 1562813552.0,
                    "replies": [
                        {
                            "body": "Just wanted to thank you for posting this. Gonna buy this and give it a shot, my hair is pretty similar to the pic above. I'm Brazilian and it gets pretty frizzy/curly.\n\n https://imgur.com/1VlcRw2.jpg \n\nHope it works",
                            "author": "WhereTruthLies",
                            "id": "ethohk2",
                            "parent_id": "t1_etheuv8",
                            "score": 4,
                            "created_utc": 1562821905.0,
                            "replies": [
                                {
                                    "body": "It's going to look great, you've got great hair for it. You might be surprised that it'll give you a bit more length! Remember to be conservative all around (quantity and time) and protect your exposed skin with vaseline before applying! Post updates!",
                                    "author": "electrickeyez",
                                    "id": "etjhn2e",
                                    "parent_id": "t1_ethohk2",
                                    "score": 2,
                                    "created_utc": 1562873800.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Seconded!",
                    "author": "dihydrogen__monoxide",
                    "id": "etgpf8j",
                    "parent_id": "t1_etgmuqq",
                    "score": 1,
                    "created_utc": 1562796054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also could you share a picture of your hair pls (before & after)",
            "author": "LeDinosaur",
            "id": "etgpds4",
            "parent_id": "t1_etgjx8q",
            "score": 11,
            "created_utc": 1562796030.0,
            "replies": [
                {
                    "body": "Okay, so it's been probably 10+ years that I've been relaxing, so finding a before is quite challenging. But my natural hair is very middle eastern, course, wavy, and thick -- very similar to OP. However, I've gone through varying states of laziness over the years and have definitely gone through phases where I might pass on relaxing for a couple months. I created this album showing the varying degrees of relaxing over the years:  [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
                    "author": "electrickeyez",
                    "id": "ethceip",
                    "parent_id": "t1_etgpds4",
                    "score": 3,
                    "created_utc": 1562811668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Optimum is a better brand if you haven’t tried it! Results last a little bit longer and cause less damage. I’ve tried all the products been using it for ~10 years",
            "author": "t-a808",
            "id": "etgu1w5",
            "parent_id": "t1_etgjx8q",
            "score": 9,
            "created_utc": 1562798865.0,
            "replies": [
                {
                    "body": "What optimum specifically?",
                    "author": null,
                    "id": "eth0q0d",
                    "parent_id": "t1_etgu1w5",
                    "score": 3,
                    "created_utc": 1562803069.0,
                    "replies": [
                        {
                            "body": "https://www.amazon.com/Optimum-Breakage-Relaxer-Regular-Strength/dp/B005IUGYFC\n\nGo with the regular strength",
                            "author": "t-a808",
                            "id": "etxav32",
                            "parent_id": "t1_eth0q0d",
                            "score": 3,
                            "created_utc": 1563295354.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "When I feel rich I spring for the Optimum! It's a couple bucks more and probably is better but for whatever reason it's never impressed enough over Dark N Lovely to make it my standard. I think it's made by the same company.",
                    "author": "electrickeyez",
                    "id": "ethdgrb",
                    "parent_id": "t1_etgu1w5",
                    "score": 3,
                    "created_utc": 1562812481.0,
                    "replies": []
                },
                {
                    "body": "Okay, so as a pale white guy, I can just do this? I have wavy and annoying hair.",
                    "author": "AscentToZenith",
                    "id": "ethdp1b",
                    "parent_id": "t1_etgu1w5",
                    "score": 3,
                    "created_utc": 1562812658.0,
                    "replies": [
                        {
                            "body": "Definitely. I've been doing it for years. [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
                            "author": "electrickeyez",
                            "id": "ethfepl",
                            "parent_id": "t1_ethdp1b",
                            "score": 2,
                            "created_utc": 1562813985.0,
                            "replies": []
                        },
                        {
                            "body": "Is your hair thick or fine? I have thick hair with really tight curls, so this thins the hair shaft a little bit and straightens it at the same time. If your hair is already thin, then it might be prone to breakage. \n\nI don’t have an imgur account, so here’s a google image example of my hair type:\nhttps://images.app.goo.gl/dUFcNkSyQPrcJohs7",
                            "author": "t-a808",
                            "id": "etxb66g",
                            "parent_id": "t1_ethdp1b",
                            "score": 1,
                            "created_utc": 1563295545.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's funny, i actually do this regularly my hair is mixed coarse silky (i'm jamaican, irish, English, chinese mixed but i guess jamaican dominant traits) and its just part of what i do idk. I've been meaning to make a post about it myself but waaaaaaay too nervous\nEdit: was nervous af typing this out",
            "author": "LieutenantHaven",
            "id": "ethwm7f",
            "parent_id": "t1_etgjx8q",
            "score": 3,
            "created_utc": 1562829670.0,
            "replies": []
        },
        {
            "body": "Do you have any hair loss or thinning? I’m curious to try this because I have the same hair type as you but I have some thinning and am kinda worried about damage or further hair loss.",
            "author": "O-Prime",
            "id": "ethls2g",
            "parent_id": "t1_etgjx8q",
            "score": 1,
            "created_utc": 1562819359.0,
            "replies": [
                {
                    "body": "I've been blessed with a full thick head of hair. I'm 35, I've been relaxing since about age 21 and thus far, I'm showing no signs of hair loss at all. At this point, if or when I ever do start losing my hair, I don't think I'll be able to ever reasonably argue relaxing had anything to do with it.",
                    "author": "electrickeyez",
                    "id": "etjhf3j",
                    "parent_id": "t1_ethls2g",
                    "score": 3,
                    "created_utc": 1562873667.0,
                    "replies": []
                },
                {
                    "body": "did you end up doing it? if so, did it affect your hair loss/thinning?",
                    "author": "issathroawaybro",
                    "id": "jhfbjb0",
                    "parent_id": "t1_ethls2g",
                    "score": 1,
                    "created_utc": 1682275865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "my grandma is a hair stylist so nothing on my end",
            "author": "titaniumsack",
            "id": "etgpjmk",
            "parent_id": "t1_etgpft7",
            "score": 15,
            "created_utc": 1562796129.0,
            "replies": [
                {
                    "body": "Lucky! Do you have thin hair (not thinning but generally thinner)",
                    "author": "LeDinosaur",
                    "id": "etgywzb",
                    "parent_id": "t1_etgpjmk",
                    "score": 10,
                    "created_utc": 1562801897.0,
                    "replies": [
                        {
                            "body": "Fine hair, yea, not thinning",
                            "author": "titaniumsack",
                            "id": "eth0dxa",
                            "parent_id": "t1_etgywzb",
                            "score": 6,
                            "created_utc": 1562802835.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank u fam 👌🏻",
            "author": "titaniumsack",
            "id": "etie55d",
            "parent_id": "t1_etgd1wk",
            "score": 1,
            "created_utc": 1562847416.0,
            "replies": []
        },
        {
            "body": "humidity/genetics",
            "author": "titaniumsack",
            "id": "etgczt9",
            "parent_id": "t1_etgcxnw",
            "score": 66,
            "created_utc": 1562788377.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "etgsdi2",
            "parent_id": "t1_etgcxnw",
            "score": 4,
            "created_utc": 1562797842.0,
            "replies": [
                {
                    "body": "I had best results with cold water, but even then it looked like up above, dry, frizzy",
                    "author": "titaniumsack",
                    "id": "etie4so",
                    "parent_id": "t1_etgsdi2",
                    "score": 1,
                    "created_utc": 1562847408.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea, this will do it, i have fine hair, check out jason makki youtube videos",
            "author": "titaniumsack",
            "id": "etgt4ej",
            "parent_id": "t1_etgqtqb",
            "score": 3,
            "created_utc": 1562798297.0,
            "replies": []
        },
        {
            "body": "https://youtu.be/ioKwPvLRn_M\nPretty much this but i think she used a slight different cream on my hair",
            "author": "titaniumsack",
            "id": "etie2pp",
            "parent_id": "t1_ethje12",
            "score": 2,
            "created_utc": 1562847359.0,
            "replies": [
                {
                    "body": "Thanks man!",
                    "author": "changeover21",
                    "id": "etiz77w",
                    "parent_id": "t1_etie2pp",
                    "score": 1,
                    "created_utc": 1562863009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "https://youtu.be/ioKwPvLRn_M\nPretty much this but i think she used a slight different cream on my hair",
            "author": "titaniumsack",
            "id": "etie1x0",
            "parent_id": "t1_eti84c5",
            "score": 2,
            "created_utc": 1562847340.0,
            "replies": [
                {
                    "body": "thanks alot!",
                    "author": "Jhon-Weak",
                    "id": "etimpmx",
                    "parent_id": "t1_etie1x0",
                    "score": 1,
                    "created_utc": 1562854752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I used to follow the instructions pretty strictly, and when it comes to the precautionary stuff I definitely still do by routine. But I've modified a few things over the years based on my needs and experiences.\n\nI try to make sure my hair is natural with no product in it when I decide to relax. I apply vaseline to my forehead, ears, and the back of my neck -- this creates a barrier which prevents chemical burns/redness should the relaxer make contact with your exposed skin. I mix the relaxer ingredients and then work the relaxer through my hair. I then take a comb and comb it back when my hair style is longer or forward when my hair style is shorter. The relaxer is very thick so it keeps the hair nice and straight for the time it's in. I've been told that it's basically a \"perm\" like the kind women used to get but instead of perming curls, it's perming \"straight\".\n\nThe relaxer product is designed for African American hair and says to leave it in for 12-15 minutes. My hair is more Middle Eastern, course but not that course, so I like to play things a bit more on the conservative side and just do 10 minutes.\n\nThen you rinse, apply this deactivator stuff it comes with, rinse that, then shampoo with the  shampoo stuff that it comes with. It's a pink color coded shampoo. Basically, you shampoo and rinse until the shampoo foam that washes up is white and no longer pink. This usually takes 2-3 shampoos for me. Once the pink is gone, I always give it one extra shampoo just to be sure I got it all.\n\nThen you use the conditioner it comes with and rinse.\n\nOnce you're done with the rinse, give it a towel dry and enjoy your gorgeous new relaxed hair. They give you a leave in conditioner treatment which they suggest you use for a couple days, but I just do it once and toss it. It's nice after the treatment, but the stuff is greasy and I've come to find more than one leave-in application unnecessary over the years. But that might just be me.\n\nFor the first day or so, your scalp might be a bit sensitive. Especially after your first couple times, but it should be very mild. If it's overly sensitive, you're probably leaving the relaxer in too long or you're letting it get too close to the scalp.  It's all about timing and contact, you learn after your first couple times. You don't have to cover every last mm of every single hair strand. Just work it in casually and comb straight.",
            "author": "electrickeyez",
            "id": "etheuv8",
            "parent_id": "t1_etgmuqq",
            "score": 16,
            "created_utc": 1562813552.0,
            "replies": [
                {
                    "body": "Just wanted to thank you for posting this. Gonna buy this and give it a shot, my hair is pretty similar to the pic above. I'm Brazilian and it gets pretty frizzy/curly.\n\n https://imgur.com/1VlcRw2.jpg \n\nHope it works",
                    "author": "WhereTruthLies",
                    "id": "ethohk2",
                    "parent_id": "t1_etheuv8",
                    "score": 4,
                    "created_utc": 1562821905.0,
                    "replies": [
                        {
                            "body": "It's going to look great, you've got great hair for it. You might be surprised that it'll give you a bit more length! Remember to be conservative all around (quantity and time) and protect your exposed skin with vaseline before applying! Post updates!",
                            "author": "electrickeyez",
                            "id": "etjhn2e",
                            "parent_id": "t1_ethohk2",
                            "score": 2,
                            "created_utc": 1562873800.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seconded!",
            "author": "dihydrogen__monoxide",
            "id": "etgpf8j",
            "parent_id": "t1_etgmuqq",
            "score": 1,
            "created_utc": 1562796054.0,
            "replies": []
        },
        {
            "body": "Okay, so it's been probably 10+ years that I've been relaxing, so finding a before is quite challenging. But my natural hair is very middle eastern, course, wavy, and thick -- very similar to OP. However, I've gone through varying states of laziness over the years and have definitely gone through phases where I might pass on relaxing for a couple months. I created this album showing the varying degrees of relaxing over the years:  [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
            "author": "electrickeyez",
            "id": "ethceip",
            "parent_id": "t1_etgpds4",
            "score": 3,
            "created_utc": 1562811668.0,
            "replies": []
        },
        {
            "body": "What optimum specifically?",
            "author": null,
            "id": "eth0q0d",
            "parent_id": "t1_etgu1w5",
            "score": 3,
            "created_utc": 1562803069.0,
            "replies": [
                {
                    "body": "https://www.amazon.com/Optimum-Breakage-Relaxer-Regular-Strength/dp/B005IUGYFC\n\nGo with the regular strength",
                    "author": "t-a808",
                    "id": "etxav32",
                    "parent_id": "t1_eth0q0d",
                    "score": 3,
                    "created_utc": 1563295354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I feel rich I spring for the Optimum! It's a couple bucks more and probably is better but for whatever reason it's never impressed enough over Dark N Lovely to make it my standard. I think it's made by the same company.",
            "author": "electrickeyez",
            "id": "ethdgrb",
            "parent_id": "t1_etgu1w5",
            "score": 3,
            "created_utc": 1562812481.0,
            "replies": []
        },
        {
            "body": "Okay, so as a pale white guy, I can just do this? I have wavy and annoying hair.",
            "author": "AscentToZenith",
            "id": "ethdp1b",
            "parent_id": "t1_etgu1w5",
            "score": 3,
            "created_utc": 1562812658.0,
            "replies": [
                {
                    "body": "Definitely. I've been doing it for years. [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
                    "author": "electrickeyez",
                    "id": "ethfepl",
                    "parent_id": "t1_ethdp1b",
                    "score": 2,
                    "created_utc": 1562813985.0,
                    "replies": []
                },
                {
                    "body": "Is your hair thick or fine? I have thick hair with really tight curls, so this thins the hair shaft a little bit and straightens it at the same time. If your hair is already thin, then it might be prone to breakage. \n\nI don’t have an imgur account, so here’s a google image example of my hair type:\nhttps://images.app.goo.gl/dUFcNkSyQPrcJohs7",
                    "author": "t-a808",
                    "id": "etxb66g",
                    "parent_id": "t1_ethdp1b",
                    "score": 1,
                    "created_utc": 1563295545.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been blessed with a full thick head of hair. I'm 35, I've been relaxing since about age 21 and thus far, I'm showing no signs of hair loss at all. At this point, if or when I ever do start losing my hair, I don't think I'll be able to ever reasonably argue relaxing had anything to do with it.",
            "author": "electrickeyez",
            "id": "etjhf3j",
            "parent_id": "t1_ethls2g",
            "score": 3,
            "created_utc": 1562873667.0,
            "replies": []
        },
        {
            "body": "did you end up doing it? if so, did it affect your hair loss/thinning?",
            "author": "issathroawaybro",
            "id": "jhfbjb0",
            "parent_id": "t1_ethls2g",
            "score": 1,
            "created_utc": 1682275865.0,
            "replies": []
        },
        {
            "body": "Lucky! Do you have thin hair (not thinning but generally thinner)",
            "author": "LeDinosaur",
            "id": "etgywzb",
            "parent_id": "t1_etgpjmk",
            "score": 10,
            "created_utc": 1562801897.0,
            "replies": [
                {
                    "body": "Fine hair, yea, not thinning",
                    "author": "titaniumsack",
                    "id": "eth0dxa",
                    "parent_id": "t1_etgywzb",
                    "score": 6,
                    "created_utc": 1562802835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had best results with cold water, but even then it looked like up above, dry, frizzy",
            "author": "titaniumsack",
            "id": "etie4so",
            "parent_id": "t1_etgsdi2",
            "score": 1,
            "created_utc": 1562847408.0,
            "replies": []
        },
        {
            "body": "Thanks man!",
            "author": "changeover21",
            "id": "etiz77w",
            "parent_id": "t1_etie2pp",
            "score": 1,
            "created_utc": 1562863009.0,
            "replies": []
        },
        {
            "body": "thanks alot!",
            "author": "Jhon-Weak",
            "id": "etimpmx",
            "parent_id": "t1_etie1x0",
            "score": 1,
            "created_utc": 1562854752.0,
            "replies": []
        },
        {
            "body": "Just wanted to thank you for posting this. Gonna buy this and give it a shot, my hair is pretty similar to the pic above. I'm Brazilian and it gets pretty frizzy/curly.\n\n https://imgur.com/1VlcRw2.jpg \n\nHope it works",
            "author": "WhereTruthLies",
            "id": "ethohk2",
            "parent_id": "t1_etheuv8",
            "score": 4,
            "created_utc": 1562821905.0,
            "replies": [
                {
                    "body": "It's going to look great, you've got great hair for it. You might be surprised that it'll give you a bit more length! Remember to be conservative all around (quantity and time) and protect your exposed skin with vaseline before applying! Post updates!",
                    "author": "electrickeyez",
                    "id": "etjhn2e",
                    "parent_id": "t1_ethohk2",
                    "score": 2,
                    "created_utc": 1562873800.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "https://www.amazon.com/Optimum-Breakage-Relaxer-Regular-Strength/dp/B005IUGYFC\n\nGo with the regular strength",
            "author": "t-a808",
            "id": "etxav32",
            "parent_id": "t1_eth0q0d",
            "score": 3,
            "created_utc": 1563295354.0,
            "replies": []
        },
        {
            "body": "Definitely. I've been doing it for years. [https://imgur.com/a/9hgefL3](https://imgur.com/a/9hgefL3)",
            "author": "electrickeyez",
            "id": "ethfepl",
            "parent_id": "t1_ethdp1b",
            "score": 2,
            "created_utc": 1562813985.0,
            "replies": []
        },
        {
            "body": "Is your hair thick or fine? I have thick hair with really tight curls, so this thins the hair shaft a little bit and straightens it at the same time. If your hair is already thin, then it might be prone to breakage. \n\nI don’t have an imgur account, so here’s a google image example of my hair type:\nhttps://images.app.goo.gl/dUFcNkSyQPrcJohs7",
            "author": "t-a808",
            "id": "etxb66g",
            "parent_id": "t1_ethdp1b",
            "score": 1,
            "created_utc": 1563295545.0,
            "replies": []
        },
        {
            "body": "Fine hair, yea, not thinning",
            "author": "titaniumsack",
            "id": "eth0dxa",
            "parent_id": "t1_etgywzb",
            "score": 6,
            "created_utc": 1562802835.0,
            "replies": []
        },
        {
            "body": "It's going to look great, you've got great hair for it. You might be surprised that it'll give you a bit more length! Remember to be conservative all around (quantity and time) and protect your exposed skin with vaseline before applying! Post updates!",
            "author": "electrickeyez",
            "id": "etjhn2e",
            "parent_id": "t1_ethohk2",
            "score": 2,
            "created_utc": 1562873800.0,
            "replies": []
        }
    ]
}