{
    "title": "Ashley Madison: What the fuck was I thinking!!",
    "post_id": "n0x4j7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n0x4j7/ashley_madison_what_the_fuck_was_i_thinking/",
    "author": "Eerk76",
    "body": "So I thought it would be interesting to try an alternative to SA for my SB search.  Within a few hours of setting up a profile and sending out some messages, I was contacted by many \"ladies\" who are located on the other side of the country based on their profiles, but just so happen to be \"visiting\" my city (lucky me, right?).  I started speaking with one who was local and everything seemed to be going well and we had a plan to meet at a park nearby the next day, but then as our conversation was closing she informed me that for her safety I needed to go to some site called [certifiedmatchingagreements.com](https://certifiedmatchingagreements.com) to prove who I was.  Only requires a credit card number (convenient, isn't it?).  Once I expressed my hesitance to provide this  information, \"she\" proceeded to inform my how safe it was since they used various techniques on the site to keep my info safe.  Amazing how she all of a sudden became an expert on this particular site and then proceeded to guilt trip me into using it since apparently I didn't trust her, of course I stated the irony that she doesn't trust me, hence the site.  Crickets after that.   \n\nMy fun wasn't over yet!!  Lo and behold, another person interested in meeting wanted to get together, but wanted to video chat first.  I thought, why not, so we chatted and I explained what I was looking for with her quickly moving to a more detailed conversation about intimate desires.  After the conversation, I received an email with part of the conversation recorded and a friendly request for compensation so that this video doesn't make it out on social media (weird since I didn't give her my name and used a burner number to contact her).  I unfortunately had to disappoint her with stating the fact that I am a divorced, successful day-trader, living in a gated community, thus making the whole attempt to damage my life futile.\n\nWell, that was enough fun for me and I deleted the account.  6 hours with an account on Ashley Madison, must be a record.   Also, is it just me or is this site some sort of minor league for scammers?  Thanks for reading my rant.  You have been warned.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n0x4j7/ashley_madison_what_the_fuck_was_i_thinking/",
    "score": 109,
    "upvote_ratio": 0.97,
    "created_utc": 1619671978.0,
    "num_comments": 73,
    "links": [
        [
            "https://certifiedmatchingagreements.com"
        ]
    ],
    "comments": [
        {
            "body": "I like your sense of adventure though 😂",
            "author": "Cdnsugarr",
            "id": "gw9k3wc",
            "parent_id": "t3_n0x4j7",
            "score": 22,
            "created_utc": 1619674714.0,
            "replies": [
                {
                    "body": "Next week: vacationing in Syria.  The adventure continues...",
                    "author": "Eerk76",
                    "id": "gw9kc9g",
                    "parent_id": "t1_gw9k3wc",
                    "score": 39,
                    "created_utc": 1619674890.0,
                    "replies": []
                },
                {
                    "body": "Nothing like a den of thieves to make the journey interesting. Onward and ehhem...I hope upward. 😙",
                    "author": "InternInteresting924",
                    "id": "gwaqjjt",
                    "parent_id": "t1_gw9k3wc",
                    "score": 4,
                    "created_utc": 1619705500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They banned me the day after I created my profile for trying to find an SD. I was sneaky about it but some men on there reported me I guess? Waste of time.",
            "author": "brattysubsandwich",
            "id": "gw9h5zu",
            "parent_id": "t3_n0x4j7",
            "score": 29,
            "created_utc": 1619672536.0,
            "replies": [
                {
                    "body": "Complete waste of time.  I did notice that many of the profiles and emails in my inbox vanished within a hour or two.  Noticed that most of them were people who contacted me first.  They seem to be trying and failing miserably to make it a legit site.",
                    "author": "Eerk76",
                    "id": "gw9hlik",
                    "parent_id": "t1_gw9h5zu",
                    "score": 14,
                    "created_utc": 1619672842.0,
                    "replies": [
                        {
                            "body": "Ugh yeah I’m just gonna stick to SA! Although I did get an offer on WYP today! Planning a M&G next week. Hope you have some better luck elsewhere!",
                            "author": "brattysubsandwich",
                            "id": "gw9i7nz",
                            "parent_id": "t1_gw9hlik",
                            "score": 7,
                            "created_utc": 1619673300.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Your username is *chefs kiss*",
                    "author": "Lolita823",
                    "id": "gw9hxy9",
                    "parent_id": "t1_gw9h5zu",
                    "score": 1,
                    "created_utc": 1619673098.0,
                    "replies": [
                        {
                            "body": "Thank you 🥳",
                            "author": "brattysubsandwich",
                            "id": "gw9i87z",
                            "parent_id": "t1_gw9hxy9",
                            "score": 2,
                            "created_utc": 1619673311.0,
                            "replies": [
                                {
                                    "body": "Does SA work better that SB? Thank you in advance! 😙",
                                    "author": "InternInteresting924",
                                    "id": "gwaoxbm",
                                    "parent_id": "t1_gw9i87z",
                                    "score": 2,
                                    "created_utc": 1619704754.0,
                                    "replies": [
                                        {
                                            "body": "I actually reconnected with an old POT from years ago on SB this week! I just made an account and he was one of the first to connect with me on there. Worth a shot!",
                                            "author": "brattysubsandwich",
                                            "id": "gwbd0u4",
                                            "parent_id": "t1_gwaoxbm",
                                            "score": 2,
                                            "created_utc": 1619714931.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you!! :)",
                                                    "author": "InternInteresting924",
                                                    "id": "gwbewww",
                                                    "parent_id": "t1_gwbd0u4",
                                                    "score": 1,
                                                    "created_utc": 1619715706.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hate to say it but you really should get the police involved on the last one. Extortion is no joke, you brushed it off but there absolutely are people who would kill themselves over the message you got.",
            "author": "Sugarbeggar",
            "id": "gwabv02",
            "parent_id": "t3_n0x4j7",
            "score": 13,
            "created_utc": 1619697855.0,
            "replies": [
                {
                    "body": "The (local) police don't have the resources to investigate tuff like this, really, though. The FBI or USSS could, but s single instance isn't likely to generate much interest on their part, either.",
                    "author": "Y_4Z44",
                    "id": "gwaizve",
                    "parent_id": "t1_gwabv02",
                    "score": 10,
                    "created_utc": 1619701878.0,
                    "replies": [
                        {
                            "body": "Many sites do this. All the phone numbers you get are well away from your area code. They ALL want a credit card upfront. Then they re-bill constantly. \n\nIs there a truly legit site? SA? SB? Thank you!",
                            "author": "InternInteresting924",
                            "id": "gwapfnw",
                            "parent_id": "t1_gwaizve",
                            "score": 3,
                            "created_utc": 1619704989.0,
                            "replies": [
                                {
                                    "body": "Oh no, not the scam verification site, the extortion. No one cares about stopping the scammers in india or russia who are going to rack up big credit card bills.",
                                    "author": "Sugarbeggar",
                                    "id": "gwaq4tk",
                                    "parent_id": "t1_gwapfnw",
                                    "score": 3,
                                    "created_utc": 1619705309.0,
                                    "replies": [
                                        {
                                            "body": "Lots of luck on stopping a scammer 8 states away. The extortion might be actionable. IF you can get the Feds on it. Some agent out there might be bored...Just sayin’...🙏🏻",
                                            "author": "InternInteresting924",
                                            "id": "gwarpy3",
                                            "parent_id": "t1_gwaq4tk",
                                            "score": 2,
                                            "created_utc": 1619706028.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss. But it's a serious crime (with innocent victims who are badly hurt) that prosecutors enjoy prosecuting. The victims are often the most wealthy and well connected people in town. It's not terribly unpleasant or risky for officers to address (in law enforcement terms it's basically the opposite of clearing homeless encampments from the shitty part of town). And maybe it just goes into a file until a few more people report it and then there are enough cases to draw attention.",
                            "author": "Sugarbeggar",
                            "id": "gwapuxr",
                            "parent_id": "t1_gwaizve",
                            "score": 1,
                            "created_utc": 1619705183.0,
                            "replies": [
                                {
                                    "body": "> It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss.\n\nTrue for the first part. But the fact that the perpetrator is almost assuredly in another jurisdiction and the fact that they're using the Internet to perpetrate the fraud makes it outside the jurisdiction of local police agencies (unless one has a joint financial crimes task force they're operating out of). A department such a LAPD or NYPD *might* have the capability of investigating something like this, but these departments don't even investigate minor home burglaries these days. Something like this will get filed. Permanently.\n\nThat leaves the FBI and/or the US Secret Service. And they just have bigger fish to fry than an individual being defrauded out of a few dollars. IF (and that's a BIG IF) a collection of victims came forward and filed complaints, then they might open a case and try do something about it. Given the nature of the activity being undertaken in which the fraud is perpetrated, however, that's not likely.\n\nThe most effective way to have it dealt with is through complaints to the credit card companies and/or chargebacks. Once enough of those are launched, the CC company itself will suspend the ability of the fraudster to do business (at which point they'll just open up a new account, etc.). Until and unless it gets to the point where it's costing the CC companies some serious money, they're not going to worry about, either. It's a cost of doing business for them. \n\nIn other words, it is almost assuredly a waste of time to get your local PD involved in it.",
                                    "author": "Y_4Z44",
                                    "id": "gwar8x2",
                                    "parent_id": "t1_gwapuxr",
                                    "score": 2,
                                    "created_utc": 1619705819.0,
                                    "replies": [
                                        {
                                            "body": "Extortion is not fraud though. As I said, there are people who in OP's position would pull a gun from their desk drawer and shoot themselves in the head. I know one of my fathers friends did that (well he hung himself in the garage). Extortion is an ongoing threat, and unlike a petty burglary it's usually not terribly hard to follow whatever path the extortionist left to get paid. Even a small local DA in a rural area can get a warrant and serve it to Paypal/Venmo/the ISP.",
                                            "author": "Sugarbeggar",
                                            "id": "gwas6xk",
                                            "parent_id": "t1_gwar8x2",
                                            "score": 2,
                                            "created_utc": 1619706233.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I would tend to agree, but do to the nature and misunderstandings some have of sugar dating, some members of law enforcement may perceive what I was doing as a crime as well.  I am keeping my evidence and if I hear back from them I might do it, but the ball is in their court at the moment.",
                    "author": "Eerk76",
                    "id": "gwas2gm",
                    "parent_id": "t1_gwabv02",
                    "score": 4,
                    "created_utc": 1619706178.0,
                    "replies": []
                },
                {
                    "body": "Not knowing his name or information would make it hard to weaponize social media.  It's just a scam to get the guy to send money.",
                    "author": "Aaronm989",
                    "id": "gwfr33m",
                    "parent_id": "t1_gwabv02",
                    "score": 1,
                    "created_utc": 1619797549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gw9vyxq",
            "parent_id": "t3_n0x4j7",
            "score": 6,
            "created_utc": 1619684705.0,
            "replies": [
                {
                    "body": "Greedo still shoots first, so it's a crappy revised version.",
                    "author": "Eerk76",
                    "id": "gwarir0",
                    "parent_id": "t1_gw9vyxq",
                    "score": 5,
                    "created_utc": 1619705941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Also, is it just me or is this site some sort of minor league for scammers?\n\nThat pretty much describes *every* dating site these days.",
            "author": "Y_4Z44",
            "id": "gwaj2p6",
            "parent_id": "t3_n0x4j7",
            "score": 3,
            "created_utc": 1619701918.0,
            "replies": []
        },
        {
            "body": "thats horrible 😞 sorry that you had to experience that!  its really fucked up what that second girl did.. I truly hope she and the other scammy ass bitches get caught up and banned forever. there's countless scammers here on reddit as well, how sad and quite the annoyance!!",
            "author": "chanelscarlett92",
            "id": "gwa4cps",
            "parent_id": "t3_n0x4j7",
            "score": 3,
            "created_utc": 1619692464.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gwa4d9g",
                    "parent_id": "t1_gwa4cps",
                    "score": 1,
                    "created_utc": 1619692476.0,
                    "replies": [
                        {
                            "body": "Bad bot, should be scammy-ass bitches",
                            "author": "LucidDion",
                            "id": "gwescql",
                            "parent_id": "t1_gwa4d9g",
                            "score": 1,
                            "created_utc": 1619779613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you did very well in the first episode. In the second one, it’s a cautionary tale for all SDs who blindly get on video calls which they don’t know are being monitored or recorded.",
            "author": null,
            "id": "gwamo9i",
            "parent_id": "t3_n0x4j7",
            "score": 3,
            "created_utc": 1619703707.0,
            "replies": [
                {
                    "body": "Lesson learned.",
                    "author": "Eerk76",
                    "id": "gwauc0y",
                    "parent_id": "t1_gwamo9i",
                    "score": 1,
                    "created_utc": 1619707168.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Remember when Ashley Madison got hacked like 7 years ago? Truth came out most of their “female profiles” are just chat bots meant to waste your time",
            "author": "KnocDown",
            "id": "gwaplfg",
            "parent_id": "t3_n0x4j7",
            "score": 3,
            "created_utc": 1619705064.0,
            "replies": []
        },
        {
            "body": "🤯🤯🤯",
            "author": "paodequeijodoce",
            "id": "gw9gqqt",
            "parent_id": "t3_n0x4j7",
            "score": 2,
            "created_utc": 1619672228.0,
            "replies": []
        },
        {
            "body": "It was reported that they has something of like 12K of real women out of the millions of users and only like 5K actually send messages.",
            "author": "peterharris100",
            "id": "gw9yhaj",
            "parent_id": "t3_n0x4j7",
            "score": 2,
            "created_utc": 1619687093.0,
            "replies": []
        },
        {
            "body": "This is why I just don’t trust those sites anymore, you get better luck on discord ☺️",
            "author": "LittleGoddessBunny",
            "id": "gwap1mj",
            "parent_id": "t3_n0x4j7",
            "score": 2,
            "created_utc": 1619704810.0,
            "replies": [
                {
                    "body": "discord for dating or to meet sugar babes?",
                    "author": "MiLocavida",
                    "id": "gwcjv21",
                    "parent_id": "t1_gwap1mj",
                    "score": 1,
                    "created_utc": 1619731712.0,
                    "replies": [
                        {
                            "body": "For finding sugar daddies and sugar babies there are a few discord servers it’s good because they make you verify to prevent scams etc.",
                            "author": "LittleGoddessBunny",
                            "id": "gwcs8bp",
                            "parent_id": "t1_gwcjv21",
                            "score": 1,
                            "created_utc": 1619735419.0,
                            "replies": [
                                {
                                    "body": "funny, on discord for many other things, never occurred to me to check for that; i remember running into a dating one but there were too many teens on there so got the hell out of that server!  😵",
                                    "author": "MiLocavida",
                                    "id": "gwd5wee",
                                    "parent_id": "t1_gwcs8bp",
                                    "score": 1,
                                    "created_utc": 1619741988.0,
                                    "replies": [
                                        {
                                            "body": "There’s a few teens still but they’re only allowed to do sfw and you need to be verified to sell nsfw etc tbh I don’t think they should be doing it until they’re 18 really",
                                            "author": "LittleGoddessBunny",
                                            "id": "gwd7na5",
                                            "parent_id": "t1_gwd5wee",
                                            "score": 1,
                                            "created_utc": 1619742835.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I gotta admit thats a good scam for them to record then blackmail you.",
            "author": "UseRound7488",
            "id": "gwasozl",
            "parent_id": "t3_n0x4j7",
            "score": 2,
            "created_utc": 1619706455.0,
            "replies": []
        },
        {
            "body": "Ashley Madison is straight trash.",
            "author": null,
            "id": "gwb2flo",
            "parent_id": "t3_n0x4j7",
            "score": 2,
            "created_utc": 1619710585.0,
            "replies": []
        },
        {
            "body": "Virtually all of the women on Ashley Madison were fake/scammers, many likely created by Ashley Madison itself.",
            "author": "HappyBear1952",
            "id": "gwbn9wu",
            "parent_id": "t3_n0x4j7",
            "score": 2,
            "created_utc": 1619718596.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwa2103",
            "parent_id": "t3_n0x4j7",
            "score": 3,
            "created_utc": 1619690433.0,
            "replies": [
                {
                    "body": "Good point.  Got to be some skin in the game to keep people fair.",
                    "author": "ChameleoSquid",
                    "id": "gwawoku",
                    "parent_id": "t1_gwa2103",
                    "score": 1,
                    "created_utc": 1619708166.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😀😀😀😀",
            "author": "wb19081908",
            "id": "gw9u30r",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619682935.0,
            "replies": []
        },
        {
            "body": "Dude, what were you thinking?  I hope you used a disposable credit card on that site, your fun isn’t over yet if you didn’t.  Did you not hear about their famous data breach that exposed everyone’s real name, address, password and credit card numbers?  I got got up in that one after I bailed on the site a few years prior.  As you found AM is filled mainly with bots.  Any remaining “real” women on there are worse than the bots so you actually lucked out with the bots.  All the bitter old hags from all the other dating sites that didn’t get any action there end up on AM.  I connected with one of them, trust me you had more fun with the bots 😂.",
            "author": "RedHeavyG603",
            "id": "gwa6za7",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619694528.0,
            "replies": [
                {
                    "body": "How true!",
                    "author": "InternInteresting924",
                    "id": "gwapp2f",
                    "parent_id": "t1_gwa6za7",
                    "score": 3,
                    "created_utc": 1619705108.0,
                    "replies": []
                },
                {
                    "body": "I'm happy to say I used PayPal with a one time login option that required a two way verification, so I feel pretty safe.  I remembered the breach, so I did what I could to keep my exposure down.",
                    "author": "Eerk76",
                    "id": "gwasclo",
                    "parent_id": "t1_gwa6za7",
                    "score": 2,
                    "created_utc": 1619706304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Must have been a slow day in the Market to put yourself through that torture",
            "author": "GSSD",
            "id": "gwaje0u",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619702075.0,
            "replies": [
                {
                    "body": "I only trade for an hour a day.  What else am I supposed to do.  lol",
                    "author": "Eerk76",
                    "id": "gwashwm",
                    "parent_id": "t1_gwaje0u",
                    "score": 3,
                    "created_utc": 1619706368.0,
                    "replies": [
                        {
                            "body": "if you day trade, why aren't you traveling the world getting the ladies? My friend is also a day trader...down in south america, you know, doing technical analysis of the ladies, and the few charts to scalp!",
                            "author": "MiLocavida",
                            "id": "gwck3v7",
                            "parent_id": "t1_gwashwm",
                            "score": 1,
                            "created_utc": 1619731820.0,
                            "replies": [
                                {
                                    "body": "Is he also trying to get between the Bollinger Bands too?  lol",
                                    "author": "Eerk76",
                                    "id": "gwckkzy",
                                    "parent_id": "t1_gwck3v7",
                                    "score": 1,
                                    "created_utc": 1619732028.0,
                                    "replies": [
                                        {
                                            "body": "My man, he ain't trying. Supposedly he is been nailing the bollinger bands upwards and downwards! 😂  I'm definitely in the wrong profession!",
                                            "author": "MiLocavida",
                                            "id": "gwcl9gk",
                                            "parent_id": "t1_gwckkzy",
                                            "score": 1,
                                            "created_utc": 1619732327.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwa26qt",
            "parent_id": "t3_n0x4j7",
            "score": -1,
            "created_utc": 1619690578.0,
            "replies": [
                {
                    "body": "Buy low; sell high.",
                    "author": null,
                    "id": "gwa3dvi",
                    "parent_id": "t1_gwa26qt",
                    "score": 10,
                    "created_utc": 1619691641.0,
                    "replies": [
                        {
                            "body": "damn, I did it the other way round! why didn't you tell me earlier???",
                            "author": "dontcallmechristian",
                            "id": "gwaucez",
                            "parent_id": "t1_gwa3dvi",
                            "score": 1,
                            "created_utc": 1619707173.0,
                            "replies": [
                                {
                                    "body": "Well hopefully you can make it up in volume. Double down!!",
                                    "author": null,
                                    "id": "gwbc8rh",
                                    "parent_id": "t1_gwaucez",
                                    "score": 1,
                                    "created_utc": 1619714609.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well I keep my trading simple and hold long positions in stocks only.  So probably best to stay away from options.  Always use a stop loss.   I pretty much trade around the time the market opens with most of the stocks I watch coming from large premarket gaps; however, understanding how prices respond from the transition to premarket to the opening bell takes time to get comfortable with so start with paper trades until you feel comfortable.",
                    "author": "Eerk76",
                    "id": "gwatpso",
                    "parent_id": "t1_gwa26qt",
                    "score": 2,
                    "created_utc": 1619706902.0,
                    "replies": [
                        {
                            "body": "> . So probably best to stay away from options.\n\nOptions are like crack.  Sure you can leverage your money, but, like all things in the market, it works in reverse too.\n\nYou get addicted while the market is going up and it seems like there's no risk--but when, not if, the market turns you can easily be caught and get skinned.\n\nremember:  everyone's a genius in an up market.",
                            "author": "sexytimeinseattle",
                            "id": "gwb1je5",
                            "parent_id": "t1_gwatpso",
                            "score": 3,
                            "created_utc": 1619710211.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gwb29kf",
                                    "parent_id": "t1_gwb1je5",
                                    "score": 2,
                                    "created_utc": 1619710515.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Almost forget.  No margins.  This takes time.",
                            "author": "Eerk76",
                            "id": "gwattg5",
                            "parent_id": "t1_gwatpso",
                            "score": 2,
                            "created_utc": 1619706945.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hodl the dip",
                    "author": "No-Reveal8042",
                    "id": "gwajj91",
                    "parent_id": "t1_gwa26qt",
                    "score": 2,
                    "created_utc": 1619702149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. That was extremely low of them to try and blackmail you. Scammers are getting ruthless nowadays. I used AM and didn't really like it at all. So I stick to SA and the actual SD ratio there are close to zilch. There were quite a few scammers that have gotten ahold of me. The whole \"Am good how are you?\" I automatically blocked. But not once was I blackmailed like that which blows my mind!",
            "author": null,
            "id": "gwa7xkx",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619695223.0,
            "replies": [
                {
                    "body": "I kinda feel sorry for anyone who watches the video actually.  I'm pretty boring in that area and I didn't say anything that I wouldn't want someone else to hear.  Someone might even think I'm Amish after watching that.  lol",
                    "author": "Eerk76",
                    "id": "gwasrby",
                    "parent_id": "t1_gwa7xkx",
                    "score": 3,
                    "created_utc": 1619706484.0,
                    "replies": [
                        {
                            "body": "Lmfao well I know a few Amish people and they are low-key freaky (😉) lmfao but it's still the fact that they recorded without your knowledge then used it to blackmail you. Like how f'ed up is that??? Luckily they weren't real sb's so hopefully you'll find the right one.",
                            "author": null,
                            "id": "gwat06r",
                            "parent_id": "t1_gwasrby",
                            "score": 2,
                            "created_utc": 1619706592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All i found on the site was pic sellers.",
            "author": "PotatoSquisher",
            "id": "gwas0qr",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619706158.0,
            "replies": []
        },
        {
            "body": "AM is not a sugar site, and I don't know how many women are trying to use it as SBs. I have not been on there since the breach, but prior to the breach, it was a disaster and full of fake profiles. I doubt it's gotten much better. \n\nThe amount of work it took to meet someone real on AM (and I did manager to meet a few) was just not worth the time. And once I was ready to sugar, it was a no brainer to go that direction.",
            "author": "midwesternguru",
            "id": "gwb1v9h",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619710349.0,
            "replies": []
        },
        {
            "body": "I love day trading! I thought I was the only one that gets horny every day after stressing over trades for 12 straight hours! 😂🤣💰",
            "author": "Available_Holiday_41",
            "id": "gwb28nb",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619710505.0,
            "replies": []
        },
        {
            "body": "And aren’t like 95% of the women on there bots and you have to pay $35 to remove your account? I know my neighbors wife was actually a real woman on there because he snooped through her laptop and found her profile on it. This was years ago when it was all over the news and hackers were threatening to expose all the personal info.",
            "author": "Bryancreates",
            "id": "gwb8120",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619712903.0,
            "replies": []
        },
        {
            "body": "I am Sheila and I am interested with you… I am a girl…. Click my profile and sign up for an app… then we can meet and get to know each other… wink wink",
            "author": "White_beard777",
            "id": "gwb8tpx",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619713227.0,
            "replies": [
                {
                    "body": "Haha.  Good one.",
                    "author": "Eerk76",
                    "id": "gwc4cu6",
                    "parent_id": "t1_gwb8tpx",
                    "score": 2,
                    "created_utc": 1619725354.0,
                    "replies": [
                        {
                            "body": "Glad you got it",
                            "author": "White_beard777",
                            "id": "gwcd4jz",
                            "parent_id": "t1_gwc4cu6",
                            "score": 1,
                            "created_utc": 1619728883.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is wild",
            "author": "Annual_Echo9355",
            "id": "gwbal8k",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619713936.0,
            "replies": []
        },
        {
            "body": "I signed up two days ago and it’s nothing but dick pics!",
            "author": "orangeyaglad",
            "id": "gwbaqxo",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619714001.0,
            "replies": []
        },
        {
            "body": "This kind of thing is much more common than you would ever expect, sadly.",
            "author": "baronessblockage",
            "id": "gwdtpsb",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619753456.0,
            "replies": []
        },
        {
            "body": "You aren't the only one wondering if there maybe other sites better than SA.   Thank you for saving me the time on that one!  Wish there were other sites.",
            "author": "SDSFBA",
            "id": "gwedfli",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619767650.0,
            "replies": []
        },
        {
            "body": "I'm surprised AM still exists. They had the worst possible data breach imaginable for a website.  It both exposed them as a wanton fraud and literally destroyed lives and killed people.  Amazing it didn't go out of business after that.",
            "author": "Aaronm989",
            "id": "gwfsewy",
            "parent_id": "t3_n0x4j7",
            "score": 1,
            "created_utc": 1619798109.0,
            "replies": []
        },
        {
            "body": "Next week: vacationing in Syria.  The adventure continues...",
            "author": "Eerk76",
            "id": "gw9kc9g",
            "parent_id": "t1_gw9k3wc",
            "score": 39,
            "created_utc": 1619674890.0,
            "replies": []
        },
        {
            "body": "Nothing like a den of thieves to make the journey interesting. Onward and ehhem...I hope upward. 😙",
            "author": "InternInteresting924",
            "id": "gwaqjjt",
            "parent_id": "t1_gw9k3wc",
            "score": 4,
            "created_utc": 1619705500.0,
            "replies": []
        },
        {
            "body": "Complete waste of time.  I did notice that many of the profiles and emails in my inbox vanished within a hour or two.  Noticed that most of them were people who contacted me first.  They seem to be trying and failing miserably to make it a legit site.",
            "author": "Eerk76",
            "id": "gw9hlik",
            "parent_id": "t1_gw9h5zu",
            "score": 14,
            "created_utc": 1619672842.0,
            "replies": [
                {
                    "body": "Ugh yeah I’m just gonna stick to SA! Although I did get an offer on WYP today! Planning a M&G next week. Hope you have some better luck elsewhere!",
                    "author": "brattysubsandwich",
                    "id": "gw9i7nz",
                    "parent_id": "t1_gw9hlik",
                    "score": 7,
                    "created_utc": 1619673300.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your username is *chefs kiss*",
            "author": "Lolita823",
            "id": "gw9hxy9",
            "parent_id": "t1_gw9h5zu",
            "score": 1,
            "created_utc": 1619673098.0,
            "replies": [
                {
                    "body": "Thank you 🥳",
                    "author": "brattysubsandwich",
                    "id": "gw9i87z",
                    "parent_id": "t1_gw9hxy9",
                    "score": 2,
                    "created_utc": 1619673311.0,
                    "replies": [
                        {
                            "body": "Does SA work better that SB? Thank you in advance! 😙",
                            "author": "InternInteresting924",
                            "id": "gwaoxbm",
                            "parent_id": "t1_gw9i87z",
                            "score": 2,
                            "created_utc": 1619704754.0,
                            "replies": [
                                {
                                    "body": "I actually reconnected with an old POT from years ago on SB this week! I just made an account and he was one of the first to connect with me on there. Worth a shot!",
                                    "author": "brattysubsandwich",
                                    "id": "gwbd0u4",
                                    "parent_id": "t1_gwaoxbm",
                                    "score": 2,
                                    "created_utc": 1619714931.0,
                                    "replies": [
                                        {
                                            "body": "Thank you!! :)",
                                            "author": "InternInteresting924",
                                            "id": "gwbewww",
                                            "parent_id": "t1_gwbd0u4",
                                            "score": 1,
                                            "created_utc": 1619715706.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The (local) police don't have the resources to investigate tuff like this, really, though. The FBI or USSS could, but s single instance isn't likely to generate much interest on their part, either.",
            "author": "Y_4Z44",
            "id": "gwaizve",
            "parent_id": "t1_gwabv02",
            "score": 10,
            "created_utc": 1619701878.0,
            "replies": [
                {
                    "body": "Many sites do this. All the phone numbers you get are well away from your area code. They ALL want a credit card upfront. Then they re-bill constantly. \n\nIs there a truly legit site? SA? SB? Thank you!",
                    "author": "InternInteresting924",
                    "id": "gwapfnw",
                    "parent_id": "t1_gwaizve",
                    "score": 3,
                    "created_utc": 1619704989.0,
                    "replies": [
                        {
                            "body": "Oh no, not the scam verification site, the extortion. No one cares about stopping the scammers in india or russia who are going to rack up big credit card bills.",
                            "author": "Sugarbeggar",
                            "id": "gwaq4tk",
                            "parent_id": "t1_gwapfnw",
                            "score": 3,
                            "created_utc": 1619705309.0,
                            "replies": [
                                {
                                    "body": "Lots of luck on stopping a scammer 8 states away. The extortion might be actionable. IF you can get the Feds on it. Some agent out there might be bored...Just sayin’...🙏🏻",
                                    "author": "InternInteresting924",
                                    "id": "gwarpy3",
                                    "parent_id": "t1_gwaq4tk",
                                    "score": 2,
                                    "created_utc": 1619706028.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss. But it's a serious crime (with innocent victims who are badly hurt) that prosecutors enjoy prosecuting. The victims are often the most wealthy and well connected people in town. It's not terribly unpleasant or risky for officers to address (in law enforcement terms it's basically the opposite of clearing homeless encampments from the shitty part of town). And maybe it just goes into a file until a few more people report it and then there are enough cases to draw attention.",
                    "author": "Sugarbeggar",
                    "id": "gwapuxr",
                    "parent_id": "t1_gwaizve",
                    "score": 1,
                    "created_utc": 1619705183.0,
                    "replies": [
                        {
                            "body": "> It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss.\n\nTrue for the first part. But the fact that the perpetrator is almost assuredly in another jurisdiction and the fact that they're using the Internet to perpetrate the fraud makes it outside the jurisdiction of local police agencies (unless one has a joint financial crimes task force they're operating out of). A department such a LAPD or NYPD *might* have the capability of investigating something like this, but these departments don't even investigate minor home burglaries these days. Something like this will get filed. Permanently.\n\nThat leaves the FBI and/or the US Secret Service. And they just have bigger fish to fry than an individual being defrauded out of a few dollars. IF (and that's a BIG IF) a collection of victims came forward and filed complaints, then they might open a case and try do something about it. Given the nature of the activity being undertaken in which the fraud is perpetrated, however, that's not likely.\n\nThe most effective way to have it dealt with is through complaints to the credit card companies and/or chargebacks. Once enough of those are launched, the CC company itself will suspend the ability of the fraudster to do business (at which point they'll just open up a new account, etc.). Until and unless it gets to the point where it's costing the CC companies some serious money, they're not going to worry about, either. It's a cost of doing business for them. \n\nIn other words, it is almost assuredly a waste of time to get your local PD involved in it.",
                            "author": "Y_4Z44",
                            "id": "gwar8x2",
                            "parent_id": "t1_gwapuxr",
                            "score": 2,
                            "created_utc": 1619705819.0,
                            "replies": [
                                {
                                    "body": "Extortion is not fraud though. As I said, there are people who in OP's position would pull a gun from their desk drawer and shoot themselves in the head. I know one of my fathers friends did that (well he hung himself in the garage). Extortion is an ongoing threat, and unlike a petty burglary it's usually not terribly hard to follow whatever path the extortionist left to get paid. Even a small local DA in a rural area can get a warrant and serve it to Paypal/Venmo/the ISP.",
                                    "author": "Sugarbeggar",
                                    "id": "gwas6xk",
                                    "parent_id": "t1_gwar8x2",
                                    "score": 2,
                                    "created_utc": 1619706233.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would tend to agree, but do to the nature and misunderstandings some have of sugar dating, some members of law enforcement may perceive what I was doing as a crime as well.  I am keeping my evidence and if I hear back from them I might do it, but the ball is in their court at the moment.",
            "author": "Eerk76",
            "id": "gwas2gm",
            "parent_id": "t1_gwabv02",
            "score": 4,
            "created_utc": 1619706178.0,
            "replies": []
        },
        {
            "body": "Not knowing his name or information would make it hard to weaponize social media.  It's just a scam to get the guy to send money.",
            "author": "Aaronm989",
            "id": "gwfr33m",
            "parent_id": "t1_gwabv02",
            "score": 1,
            "created_utc": 1619797549.0,
            "replies": []
        },
        {
            "body": "Greedo still shoots first, so it's a crappy revised version.",
            "author": "Eerk76",
            "id": "gwarir0",
            "parent_id": "t1_gw9vyxq",
            "score": 5,
            "created_utc": 1619705941.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gwa4d9g",
            "parent_id": "t1_gwa4cps",
            "score": 1,
            "created_utc": 1619692476.0,
            "replies": [
                {
                    "body": "Bad bot, should be scammy-ass bitches",
                    "author": "LucidDion",
                    "id": "gwescql",
                    "parent_id": "t1_gwa4d9g",
                    "score": 1,
                    "created_utc": 1619779613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lesson learned.",
            "author": "Eerk76",
            "id": "gwauc0y",
            "parent_id": "t1_gwamo9i",
            "score": 1,
            "created_utc": 1619707168.0,
            "replies": []
        },
        {
            "body": "discord for dating or to meet sugar babes?",
            "author": "MiLocavida",
            "id": "gwcjv21",
            "parent_id": "t1_gwap1mj",
            "score": 1,
            "created_utc": 1619731712.0,
            "replies": [
                {
                    "body": "For finding sugar daddies and sugar babies there are a few discord servers it’s good because they make you verify to prevent scams etc.",
                    "author": "LittleGoddessBunny",
                    "id": "gwcs8bp",
                    "parent_id": "t1_gwcjv21",
                    "score": 1,
                    "created_utc": 1619735419.0,
                    "replies": [
                        {
                            "body": "funny, on discord for many other things, never occurred to me to check for that; i remember running into a dating one but there were too many teens on there so got the hell out of that server!  😵",
                            "author": "MiLocavida",
                            "id": "gwd5wee",
                            "parent_id": "t1_gwcs8bp",
                            "score": 1,
                            "created_utc": 1619741988.0,
                            "replies": [
                                {
                                    "body": "There’s a few teens still but they’re only allowed to do sfw and you need to be verified to sell nsfw etc tbh I don’t think they should be doing it until they’re 18 really",
                                    "author": "LittleGoddessBunny",
                                    "id": "gwd7na5",
                                    "parent_id": "t1_gwd5wee",
                                    "score": 1,
                                    "created_utc": 1619742835.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good point.  Got to be some skin in the game to keep people fair.",
            "author": "ChameleoSquid",
            "id": "gwawoku",
            "parent_id": "t1_gwa2103",
            "score": 1,
            "created_utc": 1619708166.0,
            "replies": []
        },
        {
            "body": "How true!",
            "author": "InternInteresting924",
            "id": "gwapp2f",
            "parent_id": "t1_gwa6za7",
            "score": 3,
            "created_utc": 1619705108.0,
            "replies": []
        },
        {
            "body": "I'm happy to say I used PayPal with a one time login option that required a two way verification, so I feel pretty safe.  I remembered the breach, so I did what I could to keep my exposure down.",
            "author": "Eerk76",
            "id": "gwasclo",
            "parent_id": "t1_gwa6za7",
            "score": 2,
            "created_utc": 1619706304.0,
            "replies": []
        },
        {
            "body": "I only trade for an hour a day.  What else am I supposed to do.  lol",
            "author": "Eerk76",
            "id": "gwashwm",
            "parent_id": "t1_gwaje0u",
            "score": 3,
            "created_utc": 1619706368.0,
            "replies": [
                {
                    "body": "if you day trade, why aren't you traveling the world getting the ladies? My friend is also a day trader...down in south america, you know, doing technical analysis of the ladies, and the few charts to scalp!",
                    "author": "MiLocavida",
                    "id": "gwck3v7",
                    "parent_id": "t1_gwashwm",
                    "score": 1,
                    "created_utc": 1619731820.0,
                    "replies": [
                        {
                            "body": "Is he also trying to get between the Bollinger Bands too?  lol",
                            "author": "Eerk76",
                            "id": "gwckkzy",
                            "parent_id": "t1_gwck3v7",
                            "score": 1,
                            "created_utc": 1619732028.0,
                            "replies": [
                                {
                                    "body": "My man, he ain't trying. Supposedly he is been nailing the bollinger bands upwards and downwards! 😂  I'm definitely in the wrong profession!",
                                    "author": "MiLocavida",
                                    "id": "gwcl9gk",
                                    "parent_id": "t1_gwckkzy",
                                    "score": 1,
                                    "created_utc": 1619732327.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Buy low; sell high.",
            "author": null,
            "id": "gwa3dvi",
            "parent_id": "t1_gwa26qt",
            "score": 10,
            "created_utc": 1619691641.0,
            "replies": [
                {
                    "body": "damn, I did it the other way round! why didn't you tell me earlier???",
                    "author": "dontcallmechristian",
                    "id": "gwaucez",
                    "parent_id": "t1_gwa3dvi",
                    "score": 1,
                    "created_utc": 1619707173.0,
                    "replies": [
                        {
                            "body": "Well hopefully you can make it up in volume. Double down!!",
                            "author": null,
                            "id": "gwbc8rh",
                            "parent_id": "t1_gwaucez",
                            "score": 1,
                            "created_utc": 1619714609.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I keep my trading simple and hold long positions in stocks only.  So probably best to stay away from options.  Always use a stop loss.   I pretty much trade around the time the market opens with most of the stocks I watch coming from large premarket gaps; however, understanding how prices respond from the transition to premarket to the opening bell takes time to get comfortable with so start with paper trades until you feel comfortable.",
            "author": "Eerk76",
            "id": "gwatpso",
            "parent_id": "t1_gwa26qt",
            "score": 2,
            "created_utc": 1619706902.0,
            "replies": [
                {
                    "body": "> . So probably best to stay away from options.\n\nOptions are like crack.  Sure you can leverage your money, but, like all things in the market, it works in reverse too.\n\nYou get addicted while the market is going up and it seems like there's no risk--but when, not if, the market turns you can easily be caught and get skinned.\n\nremember:  everyone's a genius in an up market.",
                    "author": "sexytimeinseattle",
                    "id": "gwb1je5",
                    "parent_id": "t1_gwatpso",
                    "score": 3,
                    "created_utc": 1619710211.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gwb29kf",
                            "parent_id": "t1_gwb1je5",
                            "score": 2,
                            "created_utc": 1619710515.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Almost forget.  No margins.  This takes time.",
                    "author": "Eerk76",
                    "id": "gwattg5",
                    "parent_id": "t1_gwatpso",
                    "score": 2,
                    "created_utc": 1619706945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hodl the dip",
            "author": "No-Reveal8042",
            "id": "gwajj91",
            "parent_id": "t1_gwa26qt",
            "score": 2,
            "created_utc": 1619702149.0,
            "replies": []
        },
        {
            "body": "I kinda feel sorry for anyone who watches the video actually.  I'm pretty boring in that area and I didn't say anything that I wouldn't want someone else to hear.  Someone might even think I'm Amish after watching that.  lol",
            "author": "Eerk76",
            "id": "gwasrby",
            "parent_id": "t1_gwa7xkx",
            "score": 3,
            "created_utc": 1619706484.0,
            "replies": [
                {
                    "body": "Lmfao well I know a few Amish people and they are low-key freaky (😉) lmfao but it's still the fact that they recorded without your knowledge then used it to blackmail you. Like how f'ed up is that??? Luckily they weren't real sb's so hopefully you'll find the right one.",
                    "author": null,
                    "id": "gwat06r",
                    "parent_id": "t1_gwasrby",
                    "score": 2,
                    "created_utc": 1619706592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha.  Good one.",
            "author": "Eerk76",
            "id": "gwc4cu6",
            "parent_id": "t1_gwb8tpx",
            "score": 2,
            "created_utc": 1619725354.0,
            "replies": [
                {
                    "body": "Glad you got it",
                    "author": "White_beard777",
                    "id": "gwcd4jz",
                    "parent_id": "t1_gwc4cu6",
                    "score": 1,
                    "created_utc": 1619728883.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh yeah I’m just gonna stick to SA! Although I did get an offer on WYP today! Planning a M&G next week. Hope you have some better luck elsewhere!",
            "author": "brattysubsandwich",
            "id": "gw9i7nz",
            "parent_id": "t1_gw9hlik",
            "score": 7,
            "created_utc": 1619673300.0,
            "replies": []
        },
        {
            "body": "Thank you 🥳",
            "author": "brattysubsandwich",
            "id": "gw9i87z",
            "parent_id": "t1_gw9hxy9",
            "score": 2,
            "created_utc": 1619673311.0,
            "replies": [
                {
                    "body": "Does SA work better that SB? Thank you in advance! 😙",
                    "author": "InternInteresting924",
                    "id": "gwaoxbm",
                    "parent_id": "t1_gw9i87z",
                    "score": 2,
                    "created_utc": 1619704754.0,
                    "replies": [
                        {
                            "body": "I actually reconnected with an old POT from years ago on SB this week! I just made an account and he was one of the first to connect with me on there. Worth a shot!",
                            "author": "brattysubsandwich",
                            "id": "gwbd0u4",
                            "parent_id": "t1_gwaoxbm",
                            "score": 2,
                            "created_utc": 1619714931.0,
                            "replies": [
                                {
                                    "body": "Thank you!! :)",
                                    "author": "InternInteresting924",
                                    "id": "gwbewww",
                                    "parent_id": "t1_gwbd0u4",
                                    "score": 1,
                                    "created_utc": 1619715706.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Many sites do this. All the phone numbers you get are well away from your area code. They ALL want a credit card upfront. Then they re-bill constantly. \n\nIs there a truly legit site? SA? SB? Thank you!",
            "author": "InternInteresting924",
            "id": "gwapfnw",
            "parent_id": "t1_gwaizve",
            "score": 3,
            "created_utc": 1619704989.0,
            "replies": [
                {
                    "body": "Oh no, not the scam verification site, the extortion. No one cares about stopping the scammers in india or russia who are going to rack up big credit card bills.",
                    "author": "Sugarbeggar",
                    "id": "gwaq4tk",
                    "parent_id": "t1_gwapfnw",
                    "score": 3,
                    "created_utc": 1619705309.0,
                    "replies": [
                        {
                            "body": "Lots of luck on stopping a scammer 8 states away. The extortion might be actionable. IF you can get the Feds on it. Some agent out there might be bored...Just sayin’...🙏🏻",
                            "author": "InternInteresting924",
                            "id": "gwarpy3",
                            "parent_id": "t1_gwaq4tk",
                            "score": 2,
                            "created_utc": 1619706028.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss. But it's a serious crime (with innocent victims who are badly hurt) that prosecutors enjoy prosecuting. The victims are often the most wealthy and well connected people in town. It's not terribly unpleasant or risky for officers to address (in law enforcement terms it's basically the opposite of clearing homeless encampments from the shitty part of town). And maybe it just goes into a file until a few more people report it and then there are enough cases to draw attention.",
            "author": "Sugarbeggar",
            "id": "gwapuxr",
            "parent_id": "t1_gwaizve",
            "score": 1,
            "created_utc": 1619705183.0,
            "replies": [
                {
                    "body": "> It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss.\n\nTrue for the first part. But the fact that the perpetrator is almost assuredly in another jurisdiction and the fact that they're using the Internet to perpetrate the fraud makes it outside the jurisdiction of local police agencies (unless one has a joint financial crimes task force they're operating out of). A department such a LAPD or NYPD *might* have the capability of investigating something like this, but these departments don't even investigate minor home burglaries these days. Something like this will get filed. Permanently.\n\nThat leaves the FBI and/or the US Secret Service. And they just have bigger fish to fry than an individual being defrauded out of a few dollars. IF (and that's a BIG IF) a collection of victims came forward and filed complaints, then they might open a case and try do something about it. Given the nature of the activity being undertaken in which the fraud is perpetrated, however, that's not likely.\n\nThe most effective way to have it dealt with is through complaints to the credit card companies and/or chargebacks. Once enough of those are launched, the CC company itself will suspend the ability of the fraudster to do business (at which point they'll just open up a new account, etc.). Until and unless it gets to the point where it's costing the CC companies some serious money, they're not going to worry about, either. It's a cost of doing business for them. \n\nIn other words, it is almost assuredly a waste of time to get your local PD involved in it.",
                    "author": "Y_4Z44",
                    "id": "gwar8x2",
                    "parent_id": "t1_gwapuxr",
                    "score": 2,
                    "created_utc": 1619705819.0,
                    "replies": [
                        {
                            "body": "Extortion is not fraud though. As I said, there are people who in OP's position would pull a gun from their desk drawer and shoot themselves in the head. I know one of my fathers friends did that (well he hung himself in the garage). Extortion is an ongoing threat, and unlike a petty burglary it's usually not terribly hard to follow whatever path the extortionist left to get paid. Even a small local DA in a rural area can get a warrant and serve it to Paypal/Venmo/the ISP.",
                            "author": "Sugarbeggar",
                            "id": "gwas6xk",
                            "parent_id": "t1_gwar8x2",
                            "score": 2,
                            "created_utc": 1619706233.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bad bot, should be scammy-ass bitches",
            "author": "LucidDion",
            "id": "gwescql",
            "parent_id": "t1_gwa4d9g",
            "score": 1,
            "created_utc": 1619779613.0,
            "replies": []
        },
        {
            "body": "For finding sugar daddies and sugar babies there are a few discord servers it’s good because they make you verify to prevent scams etc.",
            "author": "LittleGoddessBunny",
            "id": "gwcs8bp",
            "parent_id": "t1_gwcjv21",
            "score": 1,
            "created_utc": 1619735419.0,
            "replies": [
                {
                    "body": "funny, on discord for many other things, never occurred to me to check for that; i remember running into a dating one but there were too many teens on there so got the hell out of that server!  😵",
                    "author": "MiLocavida",
                    "id": "gwd5wee",
                    "parent_id": "t1_gwcs8bp",
                    "score": 1,
                    "created_utc": 1619741988.0,
                    "replies": [
                        {
                            "body": "There’s a few teens still but they’re only allowed to do sfw and you need to be verified to sell nsfw etc tbh I don’t think they should be doing it until they’re 18 really",
                            "author": "LittleGoddessBunny",
                            "id": "gwd7na5",
                            "parent_id": "t1_gwd5wee",
                            "score": 1,
                            "created_utc": 1619742835.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "if you day trade, why aren't you traveling the world getting the ladies? My friend is also a day trader...down in south america, you know, doing technical analysis of the ladies, and the few charts to scalp!",
            "author": "MiLocavida",
            "id": "gwck3v7",
            "parent_id": "t1_gwashwm",
            "score": 1,
            "created_utc": 1619731820.0,
            "replies": [
                {
                    "body": "Is he also trying to get between the Bollinger Bands too?  lol",
                    "author": "Eerk76",
                    "id": "gwckkzy",
                    "parent_id": "t1_gwck3v7",
                    "score": 1,
                    "created_utc": 1619732028.0,
                    "replies": [
                        {
                            "body": "My man, he ain't trying. Supposedly he is been nailing the bollinger bands upwards and downwards! 😂  I'm definitely in the wrong profession!",
                            "author": "MiLocavida",
                            "id": "gwcl9gk",
                            "parent_id": "t1_gwckkzy",
                            "score": 1,
                            "created_utc": 1619732327.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "damn, I did it the other way round! why didn't you tell me earlier???",
            "author": "dontcallmechristian",
            "id": "gwaucez",
            "parent_id": "t1_gwa3dvi",
            "score": 1,
            "created_utc": 1619707173.0,
            "replies": [
                {
                    "body": "Well hopefully you can make it up in volume. Double down!!",
                    "author": null,
                    "id": "gwbc8rh",
                    "parent_id": "t1_gwaucez",
                    "score": 1,
                    "created_utc": 1619714609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> . So probably best to stay away from options.\n\nOptions are like crack.  Sure you can leverage your money, but, like all things in the market, it works in reverse too.\n\nYou get addicted while the market is going up and it seems like there's no risk--but when, not if, the market turns you can easily be caught and get skinned.\n\nremember:  everyone's a genius in an up market.",
            "author": "sexytimeinseattle",
            "id": "gwb1je5",
            "parent_id": "t1_gwatpso",
            "score": 3,
            "created_utc": 1619710211.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gwb29kf",
                    "parent_id": "t1_gwb1je5",
                    "score": 2,
                    "created_utc": 1619710515.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Almost forget.  No margins.  This takes time.",
            "author": "Eerk76",
            "id": "gwattg5",
            "parent_id": "t1_gwatpso",
            "score": 2,
            "created_utc": 1619706945.0,
            "replies": []
        },
        {
            "body": "Lmfao well I know a few Amish people and they are low-key freaky (😉) lmfao but it's still the fact that they recorded without your knowledge then used it to blackmail you. Like how f'ed up is that??? Luckily they weren't real sb's so hopefully you'll find the right one.",
            "author": null,
            "id": "gwat06r",
            "parent_id": "t1_gwasrby",
            "score": 2,
            "created_utc": 1619706592.0,
            "replies": []
        },
        {
            "body": "Glad you got it",
            "author": "White_beard777",
            "id": "gwcd4jz",
            "parent_id": "t1_gwc4cu6",
            "score": 1,
            "created_utc": 1619728883.0,
            "replies": []
        },
        {
            "body": "Does SA work better that SB? Thank you in advance! 😙",
            "author": "InternInteresting924",
            "id": "gwaoxbm",
            "parent_id": "t1_gw9i87z",
            "score": 2,
            "created_utc": 1619704754.0,
            "replies": [
                {
                    "body": "I actually reconnected with an old POT from years ago on SB this week! I just made an account and he was one of the first to connect with me on there. Worth a shot!",
                    "author": "brattysubsandwich",
                    "id": "gwbd0u4",
                    "parent_id": "t1_gwaoxbm",
                    "score": 2,
                    "created_utc": 1619714931.0,
                    "replies": [
                        {
                            "body": "Thank you!! :)",
                            "author": "InternInteresting924",
                            "id": "gwbewww",
                            "parent_id": "t1_gwbd0u4",
                            "score": 1,
                            "created_utc": 1619715706.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh no, not the scam verification site, the extortion. No one cares about stopping the scammers in india or russia who are going to rack up big credit card bills.",
            "author": "Sugarbeggar",
            "id": "gwaq4tk",
            "parent_id": "t1_gwapfnw",
            "score": 3,
            "created_utc": 1619705309.0,
            "replies": [
                {
                    "body": "Lots of luck on stopping a scammer 8 states away. The extortion might be actionable. IF you can get the Feds on it. Some agent out there might be bored...Just sayin’...🙏🏻",
                    "author": "InternInteresting924",
                    "id": "gwarpy3",
                    "parent_id": "t1_gwaq4tk",
                    "score": 2,
                    "created_utc": 1619706028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> It's unlikely that he is their only mark ever, and local police having the resources is pretty hit or miss.\n\nTrue for the first part. But the fact that the perpetrator is almost assuredly in another jurisdiction and the fact that they're using the Internet to perpetrate the fraud makes it outside the jurisdiction of local police agencies (unless one has a joint financial crimes task force they're operating out of). A department such a LAPD or NYPD *might* have the capability of investigating something like this, but these departments don't even investigate minor home burglaries these days. Something like this will get filed. Permanently.\n\nThat leaves the FBI and/or the US Secret Service. And they just have bigger fish to fry than an individual being defrauded out of a few dollars. IF (and that's a BIG IF) a collection of victims came forward and filed complaints, then they might open a case and try do something about it. Given the nature of the activity being undertaken in which the fraud is perpetrated, however, that's not likely.\n\nThe most effective way to have it dealt with is through complaints to the credit card companies and/or chargebacks. Once enough of those are launched, the CC company itself will suspend the ability of the fraudster to do business (at which point they'll just open up a new account, etc.). Until and unless it gets to the point where it's costing the CC companies some serious money, they're not going to worry about, either. It's a cost of doing business for them. \n\nIn other words, it is almost assuredly a waste of time to get your local PD involved in it.",
            "author": "Y_4Z44",
            "id": "gwar8x2",
            "parent_id": "t1_gwapuxr",
            "score": 2,
            "created_utc": 1619705819.0,
            "replies": [
                {
                    "body": "Extortion is not fraud though. As I said, there are people who in OP's position would pull a gun from their desk drawer and shoot themselves in the head. I know one of my fathers friends did that (well he hung himself in the garage). Extortion is an ongoing threat, and unlike a petty burglary it's usually not terribly hard to follow whatever path the extortionist left to get paid. Even a small local DA in a rural area can get a warrant and serve it to Paypal/Venmo/the ISP.",
                    "author": "Sugarbeggar",
                    "id": "gwas6xk",
                    "parent_id": "t1_gwar8x2",
                    "score": 2,
                    "created_utc": 1619706233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "funny, on discord for many other things, never occurred to me to check for that; i remember running into a dating one but there were too many teens on there so got the hell out of that server!  😵",
            "author": "MiLocavida",
            "id": "gwd5wee",
            "parent_id": "t1_gwcs8bp",
            "score": 1,
            "created_utc": 1619741988.0,
            "replies": [
                {
                    "body": "There’s a few teens still but they’re only allowed to do sfw and you need to be verified to sell nsfw etc tbh I don’t think they should be doing it until they’re 18 really",
                    "author": "LittleGoddessBunny",
                    "id": "gwd7na5",
                    "parent_id": "t1_gwd5wee",
                    "score": 1,
                    "created_utc": 1619742835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is he also trying to get between the Bollinger Bands too?  lol",
            "author": "Eerk76",
            "id": "gwckkzy",
            "parent_id": "t1_gwck3v7",
            "score": 1,
            "created_utc": 1619732028.0,
            "replies": [
                {
                    "body": "My man, he ain't trying. Supposedly he is been nailing the bollinger bands upwards and downwards! 😂  I'm definitely in the wrong profession!",
                    "author": "MiLocavida",
                    "id": "gwcl9gk",
                    "parent_id": "t1_gwckkzy",
                    "score": 1,
                    "created_utc": 1619732327.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well hopefully you can make it up in volume. Double down!!",
            "author": null,
            "id": "gwbc8rh",
            "parent_id": "t1_gwaucez",
            "score": 1,
            "created_utc": 1619714609.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwb29kf",
            "parent_id": "t1_gwb1je5",
            "score": 2,
            "created_utc": 1619710515.0,
            "replies": []
        },
        {
            "body": "I actually reconnected with an old POT from years ago on SB this week! I just made an account and he was one of the first to connect with me on there. Worth a shot!",
            "author": "brattysubsandwich",
            "id": "gwbd0u4",
            "parent_id": "t1_gwaoxbm",
            "score": 2,
            "created_utc": 1619714931.0,
            "replies": [
                {
                    "body": "Thank you!! :)",
                    "author": "InternInteresting924",
                    "id": "gwbewww",
                    "parent_id": "t1_gwbd0u4",
                    "score": 1,
                    "created_utc": 1619715706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lots of luck on stopping a scammer 8 states away. The extortion might be actionable. IF you can get the Feds on it. Some agent out there might be bored...Just sayin’...🙏🏻",
            "author": "InternInteresting924",
            "id": "gwarpy3",
            "parent_id": "t1_gwaq4tk",
            "score": 2,
            "created_utc": 1619706028.0,
            "replies": []
        },
        {
            "body": "Extortion is not fraud though. As I said, there are people who in OP's position would pull a gun from their desk drawer and shoot themselves in the head. I know one of my fathers friends did that (well he hung himself in the garage). Extortion is an ongoing threat, and unlike a petty burglary it's usually not terribly hard to follow whatever path the extortionist left to get paid. Even a small local DA in a rural area can get a warrant and serve it to Paypal/Venmo/the ISP.",
            "author": "Sugarbeggar",
            "id": "gwas6xk",
            "parent_id": "t1_gwar8x2",
            "score": 2,
            "created_utc": 1619706233.0,
            "replies": []
        },
        {
            "body": "There’s a few teens still but they’re only allowed to do sfw and you need to be verified to sell nsfw etc tbh I don’t think they should be doing it until they’re 18 really",
            "author": "LittleGoddessBunny",
            "id": "gwd7na5",
            "parent_id": "t1_gwd5wee",
            "score": 1,
            "created_utc": 1619742835.0,
            "replies": []
        },
        {
            "body": "My man, he ain't trying. Supposedly he is been nailing the bollinger bands upwards and downwards! 😂  I'm definitely in the wrong profession!",
            "author": "MiLocavida",
            "id": "gwcl9gk",
            "parent_id": "t1_gwckkzy",
            "score": 1,
            "created_utc": 1619732327.0,
            "replies": []
        },
        {
            "body": "Thank you!! :)",
            "author": "InternInteresting924",
            "id": "gwbewww",
            "parent_id": "t1_gwbd0u4",
            "score": 1,
            "created_utc": 1619715706.0,
            "replies": []
        }
    ]
}