{
    "title": "Naruto’s Swing has much better character development",
    "post_id": "ng3f3b",
    "post_url": "https://www.reddit.com/r/dankruto/comments/ng3f3b/narutos_swing_has_much_better_character/",
    "author": "SpitFire1220",
    "body": "",
    "url": "https://i.redd.it/it9sll91d2071.jpg",
    "score": 6204,
    "upvote_ratio": 0.99,
    "created_utc": 1621424180.0,
    "num_comments": 101,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This applies to almost every irrelevant character lol, Tenten is a victim",
            "author": "Ramiplease",
            "id": "gyp4wcc",
            "parent_id": "t3_ng3f3b",
            "score": 206,
            "created_utc": 1621433045.0,
            "replies": [
                {
                    "body": "Tenten is a loser",
                    "author": "Sonicmaster06",
                    "id": "gypc7tl",
                    "parent_id": "t1_gyp4wcc",
                    "score": -124,
                    "created_utc": 1621436142.0,
                    "replies": [
                        {
                            "body": "The writing made her so, she didn't have any character development in my opinion.",
                            "author": "Ramiplease",
                            "id": "gyppqe3",
                            "parent_id": "t1_gypc7tl",
                            "score": 59,
                            "created_utc": 1621441710.0,
                            "replies": [
                                {
                                    "body": "Imagine if in tenten vs temari she had chakra strings attached to all of her ninja tools resulting in tenten's win. Tenten would be OP and a \"real\" ninja.",
                                    "author": "Clickbaiting_4_u",
                                    "id": "gyqs7ps",
                                    "parent_id": "t1_gyppqe3",
                                    "score": 20,
                                    "created_utc": 1621457783.0,
                                    "replies": [
                                        {
                                            "body": "I think Tenten's character was too limited, that's why she never developed like the rest, which lead to her being sacrificed in order to focus on more important characters, that's how I see it.",
                                            "author": "Ramiplease",
                                            "id": "gyqx4sd",
                                            "parent_id": "t1_gyqs7ps",
                                            "score": 9,
                                            "created_utc": 1621459595.0,
                                            "replies": [
                                                {
                                                    "body": "\"You need to have a traumatic childhood to become an important character in anime\"",
                                                    "author": "Clickbaiting_4_u",
                                                    "id": "gyzkug7",
                                                    "parent_id": "t1_gyqx4sd",
                                                    "score": 1,
                                                    "created_utc": 1621631780.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
                                                            "author": "Ramiplease",
                                                            "id": "gyzobpm",
                                                            "parent_id": "t1_gyzkug7",
                                                            "score": 1,
                                                            "created_utc": 1621633418.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "... I mean yeah. She's a character the only exists in art and writing.",
                                    "author": "Ghostkill221",
                                    "id": "gypuh8r",
                                    "parent_id": "t1_gyppqe3",
                                    "score": 14,
                                    "created_utc": 1621443696.0,
                                    "replies": []
                                },
                                {
                                    "body": "And this is exactly why",
                                    "author": "Sonicmaster06",
                                    "id": "gyppsqb",
                                    "parent_id": "t1_gyppqe3",
                                    "score": -27,
                                    "created_utc": 1621441737.0,
                                    "replies": [
                                        {
                                            "body": "So you should be blaming the writer. Not the character 🤣",
                                            "author": "regalfuzz",
                                            "id": "gyqpa2k",
                                            "parent_id": "t1_gyppsqb",
                                            "score": 9,
                                            "created_utc": 1621456678.0,
                                            "replies": [
                                                {
                                                    "body": "Tenten is a loser though. He didn't say anything about blame, this man is getting the hivemind treatment for saying something that is true. Not a polite thing to say about a character plenty of people here seem to like, sure, but still not untrue.",
                                                    "author": "MonsterStunter",
                                                    "id": "gyqs7hu",
                                                    "parent_id": "t1_gyqpa2k",
                                                    "score": 0,
                                                    "created_utc": 1621457781.0,
                                                    "replies": [
                                                        {
                                                            "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
                                                            "author": "regalfuzz",
                                                            "id": "gyqx12j",
                                                            "parent_id": "t1_gyqs7hu",
                                                            "score": 0,
                                                            "created_utc": 1621459549.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                                                                    "author": "MonsterStunter",
                                                                    "id": "gyrcqi8",
                                                                    "parent_id": "t1_gyqx12j",
                                                                    "score": 1,
                                                                    "created_utc": 1621467149.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lmao",
                                                                            "author": "regalfuzz",
                                                                            "id": "gyrhncr",
                                                                            "parent_id": "t1_gyrcqi8",
                                                                            "score": 1,
                                                                            "created_utc": 1621469652.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                                                                    "author": "MonsterStunter",
                                                                                    "id": "gysy2u9",
                                                                                    "parent_id": "t1_gyrhncr",
                                                                                    "score": 1,
                                                                                    "created_utc": 1621503699.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lmao",
                                                                                            "author": "regalfuzz",
                                                                                            "id": "gyt3801",
                                                                                            "parent_id": "t1_gysy2u9",
                                                                                            "score": 1,
                                                                                            "created_utc": 1621508109.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "What... dude",
                                                    "author": "Sonicmaster06",
                                                    "id": "gyqpeaa",
                                                    "parent_id": "t1_gyqpa2k",
                                                    "score": 2,
                                                    "created_utc": 1621456727.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Your brain is small",
                                                    "author": "Hermes_YSL",
                                                    "id": "gyv7ayq",
                                                    "parent_id": "t1_gyqpa2k",
                                                    "score": 1,
                                                    "created_utc": 1621542877.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm sure it is",
                                                            "author": "regalfuzz",
                                                            "id": "gyvyy08",
                                                            "parent_id": "t1_gyv7ayq",
                                                            "score": 1,
                                                            "created_utc": 1621556134.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Bruh",
                            "author": "Exploded_hinge",
                            "id": "gypoypg",
                            "parent_id": "t1_gypc7tl",
                            "score": 37,
                            "created_utc": 1621441395.0,
                            "replies": [
                                {
                                    "body": "Why are you booing me? I’m right",
                                    "author": "Sonicmaster06",
                                    "id": "gypp6ea",
                                    "parent_id": "t1_gypoypg",
                                    "score": -51,
                                    "created_utc": 1621441482.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tenten gets increasingly nerfed in screentime and actual power level.\n\nRemember in the first few episodes of Naruto where kunai, shuriken, and other weapons are actually dangerous? Well, that goes away real quick along with Tenten's usefulness.\nAt least she doesn't have a ton of screentime to display her low power level.\n\nThen there is Shino, he has bugs that would be too OP so just throw him out of the series too lol",
            "author": "tpklus",
            "id": "gypchty",
            "parent_id": "t3_ng3f3b",
            "score": 165,
            "created_utc": 1621436257.0,
            "replies": [
                {
                    "body": "Shino pre shippuden: one of the strongest and smartest genin. Period.\n\nShino in Shippuden: still smart as a whip, takes on his clans strongest ninja and wins. \n\nShino in Boruto: gets bodied by some genin. Shitty teacher.",
                    "author": "150crawfish",
                    "id": "gypipj4",
                    "parent_id": "t1_gypchty",
                    "score": 139,
                    "created_utc": 1621438806.0,
                    "replies": [
                        {
                            "body": "Lol, haven't seen Boruto but honestly how do you continue a story like Naruto?? I think they should have tried to do a prequel with one of the former Hokage's or Jiraiya or something.",
                            "author": "tpklus",
                            "id": "gypjsmj",
                            "parent_id": "t1_gypipj4",
                            "score": 43,
                            "created_utc": 1621439252.0,
                            "replies": [
                                {
                                    "body": "You couldn't, that's why I've never wanted Boruto. Naruto's conclusion was very definitive, and put everything into place as to make it clear that the world is supposed to be at peace and the cycles that were keeping it at war were no more and the greatest threats were dealt with. There's just nothing else to continue, the only way would be repeating themselves and undermining everything that came before which is exactly what Boruto has done. It's exactly the same cycle that Dragon Ball fell into the moment they set up frieza as the most powerful being in the entire UNIVERSE - At that point what do you? Pretty much the same thing over and over again except with a new guy who it turns out is the REAL most powerful super awesome enemy in the universe every single new arc.",
                                    "author": null,
                                    "id": "gyqkpbl",
                                    "parent_id": "t1_gypjsmj",
                                    "score": 36,
                                    "created_utc": 1621454737.0,
                                    "replies": [
                                        {
                                            "body": "Boruto would be successful too if it had plot from the beginning instead of horseshit 160+ episodes. Like literally the other MC Kawaki was introduced after 190+ episodes!",
                                            "author": "Clickbaiting_4_u",
                                            "id": "gyqsv1c",
                                            "parent_id": "t1_gyqkpbl",
                                            "score": 15,
                                            "created_utc": 1621458005.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "You can continue it. But you can't continue it in the same genre.\n\nShonen anime is about some charming kid that becomes amazing, but the real victory is about the friends they make along the way. And how over-powered they become along the way.\n\nBoruto shouldn't be a shonen, it's too stupid at this point. It should a Seinen. Dealing with more mature themes in darker manners, dropping much of the comedy and wakiness. Maybe Naruto dealing with the the death of Ninja's Way as the world grows peaceful, the same way Samurai had to redefine themselves--and many failing to do so in a proper way. \n\nMaybe dealing with father hood honestly, the work it takes to sustain a marriage in a busy life, and so on. \n\nMaybe not everyone of our Naruto heroes can have kids, or maybe not all of their kids are interested in Ninja destinies. One of Naruto kids doesn't want to do it at all--and then Hinata has a fight with Naruto about how she never wanted to follow her dad's family crap just because she was born into the wrong family--that could take a whole arc, leading to Naruto realizing his destiny is not the one meant for his kids. \n\nYou know...dealing with them growing, in new ways.",
                                            "author": "i_Got_Rocks",
                                            "id": "gyrncwr",
                                            "parent_id": "t1_gyqkpbl",
                                            "score": 14,
                                            "created_utc": 1621472523.0,
                                            "replies": [
                                                {
                                                    "body": "I agree actually I think switching the genre of the show would've been the only way it could have made sense along with scaling down some of the craziness, but that's too much of a risk for these giant corporations.",
                                                    "author": null,
                                                    "id": "gyrz4pm",
                                                    "parent_id": "t1_gyrncwr",
                                                    "score": 9,
                                                    "created_utc": 1621478470.0,
                                                    "replies": [
                                                        {
                                                            "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
                                                            "author": "HazyMirror",
                                                            "id": "gys91vs",
                                                            "parent_id": "t1_gyrz4pm",
                                                            "score": 5,
                                                            "created_utc": 1621483885.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                                                                    "author": null,
                                                                    "id": "gysdtya",
                                                                    "parent_id": "t1_gys91vs",
                                                                    "score": 3,
                                                                    "created_utc": 1621486702.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                                                                            "author": "HazyMirror",
                                                                            "id": "gysvkai",
                                                                            "parent_id": "t1_gysdtya",
                                                                            "score": 1,
                                                                            "created_utc": 1621501313.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I recently started watching it again and caught up. Out of the 199 episodes so far, maybe like 100 is filler and is very skippable, but just considering the actual story stuff it's not that bad. It's not really a continuation rather than a new story in the same setting with returning characters. The recent arcs have been pretty interesting too, but I wouldn't call it anywhere near as good as naruto yet.",
                                    "author": "Rohit624",
                                    "id": "gyqlur0",
                                    "parent_id": "t1_gypjsmj",
                                    "score": 7,
                                    "created_utc": 1621455229.0,
                                    "replies": [
                                        {
                                            "body": "If you don't want filler just reas boruto Manga, the anime is intentionally more filler than the Manga.",
                                            "author": "locknloadstack",
                                            "id": "gyqor44",
                                            "parent_id": "t1_gyqlur0",
                                            "score": 2,
                                            "created_utc": 1621456454.0,
                                            "replies": [
                                                {
                                                    "body": "Don't you have to pay for reading the mangas?",
                                                    "author": "darknioss",
                                                    "id": "gyqqo7g",
                                                    "parent_id": "t1_gyqor44",
                                                    "score": 2,
                                                    "created_utc": 1621457260.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol",
                                                            "author": "locknloadstack",
                                                            "id": "gyqrvw1",
                                                            "parent_id": "t1_gyqqo7g",
                                                            "score": 9,
                                                            "created_utc": 1621457672.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
                                                            "author": "banishedpaladin",
                                                            "id": "gysktuk",
                                                            "parent_id": "t1_gyqqo7g",
                                                            "score": 2,
                                                            "created_utc": 1621491737.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
                                                            "author": "tamunti02",
                                                            "id": "gyrie81",
                                                            "parent_id": "t1_gyqqo7g",
                                                            "score": 1,
                                                            "created_utc": 1621470024.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Did he get real bodied? He never used a powerful attack and seemed to be holding back",
                            "author": "Darkdragon3110525",
                            "id": "gypn7yy",
                            "parent_id": "t1_gypipj4",
                            "score": 7,
                            "created_utc": 1621440668.0,
                            "replies": [
                                {
                                    "body": "He was possesed by Nue. Shikadai, Boruto, and Mitsuki handled him.",
                                    "author": "150crawfish",
                                    "id": "gyppygb",
                                    "parent_id": "t1_gypn7yy",
                                    "score": 6,
                                    "created_utc": 1621441805.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Tenten gets increasingly nerfed in screentime and actual power level.\n\nScreentime sure, but idk about power wise. It's kinda hard to assess her since the only on-screen canon fight she took part in she got severely manhandled by Temari and took a huge L",
                    "author": "KingofTrollenheim",
                    "id": "gyplvfn",
                    "parent_id": "t1_gypchty",
                    "score": 11,
                    "created_utc": 1621440105.0,
                    "replies": [
                        {
                            "body": "What about the war arc when she has a one of the Six Path's ninja tools",
                            "author": "NoobyOverlord",
                            "id": "gyq2pee",
                            "parent_id": "t1_gyplvfn",
                            "score": 4,
                            "created_utc": 1621447091.0,
                            "replies": [
                                {
                                    "body": "She takes on kakuzu at that point doesnt she? I remember when the manga was still releasing and we saw tenten get back her tools (madara spat them out) and ppl were afraid she was gonna be the one to save the day and beat madara with the items.",
                                    "author": "LikeRealityDislike",
                                    "id": "gyq88a1",
                                    "parent_id": "t1_gyq2pee",
                                    "score": 9,
                                    "created_utc": 1621449396.0,
                                    "replies": []
                                },
                                {
                                    "body": "That was more focused on in the anime, from what I recall in the manga it was kinda mentioned but not much emphasis was made about it",
                                    "author": "KingofTrollenheim",
                                    "id": "gyq9ssd",
                                    "parent_id": "t1_gyq2pee",
                                    "score": 1,
                                    "created_utc": 1621450054.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "She wasn’t nerfed, she just got power scaled into the abyss",
                            "author": "poop_ahaha",
                            "id": "gyq7qfx",
                            "parent_id": "t1_gyplvfn",
                            "score": 4,
                            "created_utc": 1621449191.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Would a been sick to see tenten just insta arm an entire regiment with bows or other ranged weapons then reequip them with swords soon after.\n\nOr mess with storing Legendary swords.\n\n\nHonestly Tenten could have basically leveled up onto Gilgamesh from Fate really easily.",
                    "author": "Ghostkill221",
                    "id": "gypupx4",
                    "parent_id": "t1_gypchty",
                    "score": 6,
                    "created_utc": 1621443799.0,
                    "replies": []
                },
                {
                    "body": "I mean she’s not a super powerful ninja didn’t,  see a lot of drive from her to be more powerful (at least not like Rock lee, Kiba, or really anyone else). She doesn’t come from a super powerful clan. There were other Ninja who were strong but didn’t have powerful jutsu, mostly filler enemies or the guards of the village (lol), or random people who get beaten by narutos shadow clones. Idk maybe there’s a reason, and she just didn’t have the drive to become a hokage, or didn’t have a rival like the others?",
                    "author": "Bups34",
                    "id": "gyq97ok",
                    "parent_id": "t1_gypchty",
                    "score": 3,
                    "created_utc": 1621449809.0,
                    "replies": [
                        {
                            "body": "You forgot to mention that Kishimoto doesn't know how to write women characters.\n\nThat's not a joke, it's something he's admitted. Hence why Naruto females get shit on and never fully develop into full characters.",
                            "author": "i_Got_Rocks",
                            "id": "gyrnxj1",
                            "parent_id": "t1_gyq97ok",
                            "score": 2,
                            "created_utc": 1621472815.0,
                            "replies": [
                                {
                                    "body": "Yeah I guess I’m just talking about what I saw in the show",
                                    "author": "Bups34",
                                    "id": "gyro10p",
                                    "parent_id": "t1_gyrnxj1",
                                    "score": 1,
                                    "created_utc": 1621472866.0,
                                    "replies": [
                                        {
                                            "body": "The show follows the manga (no including the filler), so it's about the same thing. RIP Ten Ten character development.",
                                            "author": "i_Got_Rocks",
                                            "id": "gyrrdcf",
                                            "parent_id": "t1_gyro10p",
                                            "score": 1,
                                            "created_utc": 1621474556.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Tbf tenten does become pretty powerful once she gets the six paths weapons. I remember people being afraid she was gonna be the one to save the day and beat juubi madara.",
                    "author": "LikeRealityDislike",
                    "id": "gyq7zen",
                    "parent_id": "t1_gypchty",
                    "score": 1,
                    "created_utc": 1621449295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dont forget that riverside scene where naruto sees sasuke sitting alone\n\nAlso that kid naruto vs sasuke fight where sasuke beats him and stares down at him in anger",
            "author": "Blackbeard567",
            "id": "gyp03sn",
            "parent_id": "t3_ng3f3b",
            "score": 142,
            "created_utc": 1621430925.0,
            "replies": [
                {
                    "body": "These and obito flashbacks are burned in my retina",
                    "author": "medson25",
                    "id": "gypzq7k",
                    "parent_id": "t1_gyp03sn",
                    "score": 26,
                    "created_utc": 1621445865.0,
                    "replies": [
                        {
                            "body": "the amount of times I watched obito give kakashi his eye😂will deff be the last thing i see in my brain before i die. not complaining too much tho cause obito is my favorite character lmaoo",
                            "author": "leakawa17",
                            "id": "gyqn0eu",
                            "parent_id": "t1_gypzq7k",
                            "score": 15,
                            "created_utc": 1621455718.0,
                            "replies": [
                                {
                                    "body": "Jokes apart. We need Naruto: Brotherhood",
                                    "author": "Clickbaiting_4_u",
                                    "id": "gyqro7b",
                                    "parent_id": "t1_gyqn0eu",
                                    "score": 5,
                                    "created_utc": 1621457600.0,
                                    "replies": [
                                        {
                                            "body": "Go to r/Naruto. \n\nLook in the permanent tabs.\n\nlook at \"Naruto Kai\"\n\nFan made, but damn good job.",
                                            "author": "i_Got_Rocks",
                                            "id": "gyrmg42",
                                            "parent_id": "t1_gyqro7b",
                                            "score": 4,
                                            "created_utc": 1621472066.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Lets remember that a lot of repeated flashbacks are actually filler and weren't in the manga. I hope to make a repeated flashback filler list someday...",
                    "author": "LikeRealityDislike",
                    "id": "gyq8g45",
                    "parent_id": "t1_gyp03sn",
                    "score": 11,
                    "created_utc": 1621449487.0,
                    "replies": [
                        {
                            "body": "At least 20% of the show is the hallway chidori scene with itachi",
                            "author": "MyFingerPointeth",
                            "id": "gyq9x5u",
                            "parent_id": "t1_gyq8g45",
                            "score": 10,
                            "created_utc": 1621450105.0,
                            "replies": [
                                {
                                    "body": "I’d say it’s the scene where Itachi massacres the Uchicha, I just rewatched the show and that scene must have replayed over 20 times",
                                    "author": "Nymphadorena",
                                    "id": "gyr4rm0",
                                    "parent_id": "t1_gyq9x5u",
                                    "score": 8,
                                    "created_utc": 1621463129.0,
                                    "replies": [
                                        {
                                            "body": "Promise me one thing, look after sasuke, our suffering will be short compared to yours, youre truly a kind child 🙄🤮",
                                            "author": "MyFingerPointeth",
                                            "id": "gyrno60",
                                            "parent_id": "t1_gyr4rm0",
                                            "score": 1,
                                            "created_utc": 1621472683.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Naruto: No one ever acknowledged me.\n\nHis Past: *Shikamaru, Choji, Sasuke, Kids laughing at his terrible transformations*\n\nHis past: Am I a joke to you??",
                    "author": "i_Got_Rocks",
                    "id": "gyrmcg7",
                    "parent_id": "t1_gyp03sn",
                    "score": 2,
                    "created_utc": 1621472015.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You just gotta watch rock Lee and his ninja pals",
            "author": "Jacklinks69",
            "id": "gyow8t5",
            "parent_id": "t3_ng3f3b",
            "score": 77,
            "created_utc": 1621429124.0,
            "replies": [
                {
                    "body": "YEZ",
                    "author": "Huge_Flying_Lizard",
                    "id": "gyp6065",
                    "parent_id": "t1_gyow8t5",
                    "score": 14,
                    "created_utc": 1621433522.0,
                    "replies": []
                },
                {
                    "body": "Or watch filler episodes",
                    "author": "smyth101-",
                    "id": "gyp6qxh",
                    "parent_id": "t1_gyow8t5",
                    "score": 12,
                    "created_utc": 1621433840.0,
                    "replies": []
                },
                {
                    "body": "Yez she gets even more screentime than Naruto gets in Sasuke shippuden",
                    "author": "LikeRealityDislike",
                    "id": "gyq8is4",
                    "parent_id": "t1_gyow8t5",
                    "score": 5,
                    "created_utc": 1621449518.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gyq807b",
                    "parent_id": "t1_gyow8t5",
                    "score": -5,
                    "created_utc": 1621449304.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kishimoto needs to learn how to make girls useful. I think that Tenten is underrated and she has some potential. Konan also didn't get much screentime. I wanted to see more from her. (SHE NEARLY DEFEATED OBITO IF IT WEREN'T THAT DARN JUTSU IZANAGI!) Sakura, well, she's kinda useless but she could have done better if Kishimoto made gave her better character development.",
            "author": "PlausibleSplendor15",
            "id": "gypf4mn",
            "parent_id": "t3_ng3f3b",
            "score": 29,
            "created_utc": 1621437343.0,
            "replies": [
                {
                    "body": "Konan got destroyed by Uchiha bullshit.",
                    "author": "TyrionGoldenLion",
                    "id": "gypr2qh",
                    "parent_id": "t1_gypf4mn",
                    "score": 24,
                    "created_utc": 1621442277.0,
                    "replies": []
                },
                {
                    "body": "Lets not forget tsunade especially in the very last arc against madara, she was doing so good and was so persistent, had muktiple blades through her gut and kept beating and breaking madara's susanoo! \n\nAlso let's not forget the meager yet significant contribution by sakura at the very end where she is the one who beats kaguya down into naruto's and sasuke's sealing. She's also the one who makes obito get sasuke back from the other dimension.",
                    "author": "LikeRealityDislike",
                    "id": "gyq8wpy",
                    "parent_id": "t1_gypf4mn",
                    "score": 11,
                    "created_utc": 1621449682.0,
                    "replies": [
                        {
                            "body": "Kishimoto did well with Hinata and Tsunade. Because of Tsunade, Sakura and Ino did much better in Shippuden, and without Tsunade's help, many people would have died and there would have been a new Hokage.",
                            "author": "PlausibleSplendor15",
                            "id": "gytlpcc",
                            "parent_id": "t1_gyq8wpy",
                            "score": 2,
                            "created_utc": 1621518557.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel like there's competition for screen time between Naruto's swing and Naruto's toad wallet.",
            "author": "DagitabPH",
            "id": "gyp2tk1",
            "parent_id": "t3_ng3f3b",
            "score": 39,
            "created_utc": 1621432138.0,
            "replies": [
                {
                    "body": "And arguably his toad wallet has the best character development.",
                    "author": "PissBottleFromTF2",
                    "id": "gyq1wvo",
                    "parent_id": "t1_gyp2tk1",
                    "score": 8,
                    "created_utc": 1621446763.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "replace it with ton ton the pig, it will still make sense lmao",
            "author": "SladeNation9000",
            "id": "gyp7yz5",
            "parent_id": "t3_ng3f3b",
            "score": 17,
            "created_utc": 1621434354.0,
            "replies": []
        },
        {
            "body": "Tenten shippuden?",
            "author": "ThiagobCarvalho",
            "id": "gyp76ea",
            "parent_id": "t3_ng3f3b",
            "score": 17,
            "created_utc": 1621434021.0,
            "replies": []
        },
        {
            "body": "The swing is the real main character of the show. The full title is actually Swing: Narutos Best Friend but it was lost in translation",
            "author": "MikeLanglois",
            "id": "gyph2j6",
            "parent_id": "t3_ng3f3b",
            "score": 16,
            "created_utc": 1621438135.0,
            "replies": [
                {
                    "body": "Sub Title: \"Don't Cry Cause You're So Right Chronicles\"",
                    "author": "i_Got_Rocks",
                    "id": "gyro689",
                    "parent_id": "t1_gyph2j6",
                    "score": 1,
                    "created_utc": 1621472940.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sakura's tears get more screentime than tenten",
            "author": "yeetguy52",
            "id": "gyqailf",
            "parent_id": "t3_ng3f3b",
            "score": 5,
            "created_utc": 1621450354.0,
            "replies": [
                {
                    "body": "Sakura screaming Naruto's name has more character development.",
                    "author": "i_Got_Rocks",
                    "id": "gyro85s",
                    "parent_id": "t1_gyqailf",
                    "score": 5,
                    "created_utc": 1621472967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Reading the manga now: Ten Ten's first fight in the Chuunin Exams against Temari last one single pane.\n\nAnd it's Tenten being held on her arched back over Temari's fan...defeated. I couldn't stop laughing at the lack of respekt.",
            "author": "i_Got_Rocks",
            "id": "gyrm4en",
            "parent_id": "t3_ng3f3b",
            "score": 5,
            "created_utc": 1621471903.0,
            "replies": [
                {
                    "body": "That's straight up Tenten's most iconic moment.",
                    "author": "Mexus51",
                    "id": "gyrvai1",
                    "parent_id": "t1_gyrm4en",
                    "score": 5,
                    "created_utc": 1621476535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ಠ_ʖಠ\n\nಠ ͜ʖ ಠ",
            "author": "MediumNew2590",
            "id": "gyovtez",
            "parent_id": "t3_ng3f3b",
            "score": 10,
            "created_utc": 1621428911.0,
            "replies": []
        },
        {
            "body": "But man she sure is cool in ED 15.",
            "author": null,
            "id": "gyq08h4",
            "parent_id": "t3_ng3f3b",
            "score": 3,
            "created_utc": 1621446074.0,
            "replies": []
        },
        {
            "body": "Did you guys know that the English actors for sasuke and tenten are married irl?",
            "author": "itsRobbie_",
            "id": "gys3d3s",
            "parent_id": "t3_ng3f3b",
            "score": 3,
            "created_utc": 1621480665.0,
            "replies": [
                {
                    "body": "Actually it’s Temari’s va Yuri Lowenthal is married to. I can see how it’s easily confusable since they both start with T (Tenten and Temari).",
                    "author": "MilesYoungblood",
                    "id": "gzdomjw",
                    "parent_id": "t1_gys3d3s",
                    "score": 1,
                    "created_utc": 1621942161.0,
                    "replies": [
                        {
                            "body": "Yep, that’s what I meant lol 🤦🏻‍♂️",
                            "author": "itsRobbie_",
                            "id": "gzgn3fs",
                            "parent_id": "t1_gzdomjw",
                            "score": 2,
                            "created_utc": 1621992396.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tenten could've been the Black Widow or Tucker's Kobolds or Joseph Joestar of *Naruto*. Instead all her development went to the Uchihas.",
            "author": "This_Pizza3257",
            "id": "gyq2nss",
            "parent_id": "t3_ng3f3b",
            "score": 2,
            "created_utc": 1621447073.0,
            "replies": []
        },
        {
            "body": "That one pig had more screen time then tenten",
            "author": "ComfortableEar6",
            "id": "gyqhi1c",
            "parent_id": "t3_ng3f3b",
            "score": 2,
            "created_utc": 1621453380.0,
            "replies": [
                {
                    "body": "Don't they have the same name?",
                    "author": "Connorthecyborg",
                    "id": "gyrklul",
                    "parent_id": "t1_gyqhi1c",
                    "score": 2,
                    "created_utc": 1621471144.0,
                    "replies": [
                        {
                            "body": "oof",
                            "author": "i_Got_Rocks",
                            "id": "gyro93b",
                            "parent_id": "t1_gyrklul",
                            "score": 3,
                            "created_utc": 1621472981.0,
                            "replies": []
                        },
                        {
                            "body": "I think the pigs name is tonton",
                            "author": "ComfortableEar6",
                            "id": "gyv9lk3",
                            "parent_id": "t1_gyrklul",
                            "score": 1,
                            "created_utc": 1621543881.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "instead of naruto's swing put the rasengan",
            "author": "International_Gift32",
            "id": "gypy4tw",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621445204.0,
            "replies": []
        },
        {
            "body": "That’s why you watch filler episodes even though they aren’t “manga canon”, they still exist in some form of official media. So I’d just say anime canon where we get to see characters have more screen time and have incredible character moments on top of that.",
            "author": "The-dark-lightskin",
            "id": "gyq0k2f",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621446209.0,
            "replies": []
        },
        {
            "body": "Bruh borutos rasengan has more screen time",
            "author": "Odd_isee",
            "id": "gyrcup6",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621467210.0,
            "replies": [
                {
                    "body": "Naruto's fart in Akamaru's face has more screen time lmao",
                    "author": "i_Got_Rocks",
                    "id": "gyroc8c",
                    "parent_id": "t1_gyrcup6",
                    "score": 1,
                    "created_utc": 1621473025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "trade you give me like i give you like start a karma chain ????",
            "author": "Aggressive-Amoeba-37",
            "id": "gyskm8c",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621491571.0,
            "replies": []
        },
        {
            "body": "My brother and I were *literally* just discussing this *exact* thing earlier today! LMAO!",
            "author": "twinkletoes-rp",
            "id": "gyslnrb",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621492396.0,
            "replies": []
        },
        {
            "body": "thats because you skip filler",
            "author": "Square-Entrepreneur3",
            "id": "gyss7ny",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621498069.0,
            "replies": []
        },
        {
            "body": "Underated character",
            "author": "GetThatM",
            "id": "gyvryii",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621552541.0,
            "replies": []
        },
        {
            "body": "COOL",
            "author": "Prince_Vegeta2001",
            "id": "gzc73pf",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621903949.0,
            "replies": []
        },
        {
            "body": "Nobody cares about Tenten.",
            "author": "MilesYoungblood",
            "id": "gzdohvn",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1621942070.0,
            "replies": []
        },
        {
            "body": "Disrespected my girl",
            "author": "LiIPito",
            "id": "gzmv74i",
            "parent_id": "t3_ng3f3b",
            "score": 1,
            "created_utc": 1622122562.0,
            "replies": []
        },
        {
            "body": "Tenten is a loser",
            "author": "Sonicmaster06",
            "id": "gypc7tl",
            "parent_id": "t1_gyp4wcc",
            "score": -124,
            "created_utc": 1621436142.0,
            "replies": [
                {
                    "body": "The writing made her so, she didn't have any character development in my opinion.",
                    "author": "Ramiplease",
                    "id": "gyppqe3",
                    "parent_id": "t1_gypc7tl",
                    "score": 59,
                    "created_utc": 1621441710.0,
                    "replies": [
                        {
                            "body": "Imagine if in tenten vs temari she had chakra strings attached to all of her ninja tools resulting in tenten's win. Tenten would be OP and a \"real\" ninja.",
                            "author": "Clickbaiting_4_u",
                            "id": "gyqs7ps",
                            "parent_id": "t1_gyppqe3",
                            "score": 20,
                            "created_utc": 1621457783.0,
                            "replies": [
                                {
                                    "body": "I think Tenten's character was too limited, that's why she never developed like the rest, which lead to her being sacrificed in order to focus on more important characters, that's how I see it.",
                                    "author": "Ramiplease",
                                    "id": "gyqx4sd",
                                    "parent_id": "t1_gyqs7ps",
                                    "score": 9,
                                    "created_utc": 1621459595.0,
                                    "replies": [
                                        {
                                            "body": "\"You need to have a traumatic childhood to become an important character in anime\"",
                                            "author": "Clickbaiting_4_u",
                                            "id": "gyzkug7",
                                            "parent_id": "t1_gyqx4sd",
                                            "score": 1,
                                            "created_utc": 1621631780.0,
                                            "replies": [
                                                {
                                                    "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
                                                    "author": "Ramiplease",
                                                    "id": "gyzobpm",
                                                    "parent_id": "t1_gyzkug7",
                                                    "score": 1,
                                                    "created_utc": 1621633418.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "... I mean yeah. She's a character the only exists in art and writing.",
                            "author": "Ghostkill221",
                            "id": "gypuh8r",
                            "parent_id": "t1_gyppqe3",
                            "score": 14,
                            "created_utc": 1621443696.0,
                            "replies": []
                        },
                        {
                            "body": "And this is exactly why",
                            "author": "Sonicmaster06",
                            "id": "gyppsqb",
                            "parent_id": "t1_gyppqe3",
                            "score": -27,
                            "created_utc": 1621441737.0,
                            "replies": [
                                {
                                    "body": "So you should be blaming the writer. Not the character 🤣",
                                    "author": "regalfuzz",
                                    "id": "gyqpa2k",
                                    "parent_id": "t1_gyppsqb",
                                    "score": 9,
                                    "created_utc": 1621456678.0,
                                    "replies": [
                                        {
                                            "body": "Tenten is a loser though. He didn't say anything about blame, this man is getting the hivemind treatment for saying something that is true. Not a polite thing to say about a character plenty of people here seem to like, sure, but still not untrue.",
                                            "author": "MonsterStunter",
                                            "id": "gyqs7hu",
                                            "parent_id": "t1_gyqpa2k",
                                            "score": 0,
                                            "created_utc": 1621457781.0,
                                            "replies": [
                                                {
                                                    "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
                                                    "author": "regalfuzz",
                                                    "id": "gyqx12j",
                                                    "parent_id": "t1_gyqs7hu",
                                                    "score": 0,
                                                    "created_utc": 1621459549.0,
                                                    "replies": [
                                                        {
                                                            "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                                                            "author": "MonsterStunter",
                                                            "id": "gyrcqi8",
                                                            "parent_id": "t1_gyqx12j",
                                                            "score": 1,
                                                            "created_utc": 1621467149.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lmao",
                                                                    "author": "regalfuzz",
                                                                    "id": "gyrhncr",
                                                                    "parent_id": "t1_gyrcqi8",
                                                                    "score": 1,
                                                                    "created_utc": 1621469652.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                                                            "author": "MonsterStunter",
                                                                            "id": "gysy2u9",
                                                                            "parent_id": "t1_gyrhncr",
                                                                            "score": 1,
                                                                            "created_utc": 1621503699.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lmao",
                                                                                    "author": "regalfuzz",
                                                                                    "id": "gyt3801",
                                                                                    "parent_id": "t1_gysy2u9",
                                                                                    "score": 1,
                                                                                    "created_utc": 1621508109.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "What... dude",
                                            "author": "Sonicmaster06",
                                            "id": "gyqpeaa",
                                            "parent_id": "t1_gyqpa2k",
                                            "score": 2,
                                            "created_utc": 1621456727.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Your brain is small",
                                            "author": "Hermes_YSL",
                                            "id": "gyv7ayq",
                                            "parent_id": "t1_gyqpa2k",
                                            "score": 1,
                                            "created_utc": 1621542877.0,
                                            "replies": [
                                                {
                                                    "body": "I'm sure it is",
                                                    "author": "regalfuzz",
                                                    "id": "gyvyy08",
                                                    "parent_id": "t1_gyv7ayq",
                                                    "score": 1,
                                                    "created_utc": 1621556134.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bruh",
                    "author": "Exploded_hinge",
                    "id": "gypoypg",
                    "parent_id": "t1_gypc7tl",
                    "score": 37,
                    "created_utc": 1621441395.0,
                    "replies": [
                        {
                            "body": "Why are you booing me? I’m right",
                            "author": "Sonicmaster06",
                            "id": "gypp6ea",
                            "parent_id": "t1_gypoypg",
                            "score": -51,
                            "created_utc": 1621441482.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Shino pre shippuden: one of the strongest and smartest genin. Period.\n\nShino in Shippuden: still smart as a whip, takes on his clans strongest ninja and wins. \n\nShino in Boruto: gets bodied by some genin. Shitty teacher.",
            "author": "150crawfish",
            "id": "gypipj4",
            "parent_id": "t1_gypchty",
            "score": 139,
            "created_utc": 1621438806.0,
            "replies": [
                {
                    "body": "Lol, haven't seen Boruto but honestly how do you continue a story like Naruto?? I think they should have tried to do a prequel with one of the former Hokage's or Jiraiya or something.",
                    "author": "tpklus",
                    "id": "gypjsmj",
                    "parent_id": "t1_gypipj4",
                    "score": 43,
                    "created_utc": 1621439252.0,
                    "replies": [
                        {
                            "body": "You couldn't, that's why I've never wanted Boruto. Naruto's conclusion was very definitive, and put everything into place as to make it clear that the world is supposed to be at peace and the cycles that were keeping it at war were no more and the greatest threats were dealt with. There's just nothing else to continue, the only way would be repeating themselves and undermining everything that came before which is exactly what Boruto has done. It's exactly the same cycle that Dragon Ball fell into the moment they set up frieza as the most powerful being in the entire UNIVERSE - At that point what do you? Pretty much the same thing over and over again except with a new guy who it turns out is the REAL most powerful super awesome enemy in the universe every single new arc.",
                            "author": null,
                            "id": "gyqkpbl",
                            "parent_id": "t1_gypjsmj",
                            "score": 36,
                            "created_utc": 1621454737.0,
                            "replies": [
                                {
                                    "body": "Boruto would be successful too if it had plot from the beginning instead of horseshit 160+ episodes. Like literally the other MC Kawaki was introduced after 190+ episodes!",
                                    "author": "Clickbaiting_4_u",
                                    "id": "gyqsv1c",
                                    "parent_id": "t1_gyqkpbl",
                                    "score": 15,
                                    "created_utc": 1621458005.0,
                                    "replies": []
                                },
                                {
                                    "body": "You can continue it. But you can't continue it in the same genre.\n\nShonen anime is about some charming kid that becomes amazing, but the real victory is about the friends they make along the way. And how over-powered they become along the way.\n\nBoruto shouldn't be a shonen, it's too stupid at this point. It should a Seinen. Dealing with more mature themes in darker manners, dropping much of the comedy and wakiness. Maybe Naruto dealing with the the death of Ninja's Way as the world grows peaceful, the same way Samurai had to redefine themselves--and many failing to do so in a proper way. \n\nMaybe dealing with father hood honestly, the work it takes to sustain a marriage in a busy life, and so on. \n\nMaybe not everyone of our Naruto heroes can have kids, or maybe not all of their kids are interested in Ninja destinies. One of Naruto kids doesn't want to do it at all--and then Hinata has a fight with Naruto about how she never wanted to follow her dad's family crap just because she was born into the wrong family--that could take a whole arc, leading to Naruto realizing his destiny is not the one meant for his kids. \n\nYou know...dealing with them growing, in new ways.",
                                    "author": "i_Got_Rocks",
                                    "id": "gyrncwr",
                                    "parent_id": "t1_gyqkpbl",
                                    "score": 14,
                                    "created_utc": 1621472523.0,
                                    "replies": [
                                        {
                                            "body": "I agree actually I think switching the genre of the show would've been the only way it could have made sense along with scaling down some of the craziness, but that's too much of a risk for these giant corporations.",
                                            "author": null,
                                            "id": "gyrz4pm",
                                            "parent_id": "t1_gyrncwr",
                                            "score": 9,
                                            "created_utc": 1621478470.0,
                                            "replies": [
                                                {
                                                    "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
                                                    "author": "HazyMirror",
                                                    "id": "gys91vs",
                                                    "parent_id": "t1_gyrz4pm",
                                                    "score": 5,
                                                    "created_utc": 1621483885.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                                                            "author": null,
                                                            "id": "gysdtya",
                                                            "parent_id": "t1_gys91vs",
                                                            "score": 3,
                                                            "created_utc": 1621486702.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                                                                    "author": "HazyMirror",
                                                                    "id": "gysvkai",
                                                                    "parent_id": "t1_gysdtya",
                                                                    "score": 1,
                                                                    "created_utc": 1621501313.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I recently started watching it again and caught up. Out of the 199 episodes so far, maybe like 100 is filler and is very skippable, but just considering the actual story stuff it's not that bad. It's not really a continuation rather than a new story in the same setting with returning characters. The recent arcs have been pretty interesting too, but I wouldn't call it anywhere near as good as naruto yet.",
                            "author": "Rohit624",
                            "id": "gyqlur0",
                            "parent_id": "t1_gypjsmj",
                            "score": 7,
                            "created_utc": 1621455229.0,
                            "replies": [
                                {
                                    "body": "If you don't want filler just reas boruto Manga, the anime is intentionally more filler than the Manga.",
                                    "author": "locknloadstack",
                                    "id": "gyqor44",
                                    "parent_id": "t1_gyqlur0",
                                    "score": 2,
                                    "created_utc": 1621456454.0,
                                    "replies": [
                                        {
                                            "body": "Don't you have to pay for reading the mangas?",
                                            "author": "darknioss",
                                            "id": "gyqqo7g",
                                            "parent_id": "t1_gyqor44",
                                            "score": 2,
                                            "created_utc": 1621457260.0,
                                            "replies": [
                                                {
                                                    "body": "Lol",
                                                    "author": "locknloadstack",
                                                    "id": "gyqrvw1",
                                                    "parent_id": "t1_gyqqo7g",
                                                    "score": 9,
                                                    "created_utc": 1621457672.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
                                                    "author": "banishedpaladin",
                                                    "id": "gysktuk",
                                                    "parent_id": "t1_gyqqo7g",
                                                    "score": 2,
                                                    "created_utc": 1621491737.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
                                                    "author": "tamunti02",
                                                    "id": "gyrie81",
                                                    "parent_id": "t1_gyqqo7g",
                                                    "score": 1,
                                                    "created_utc": 1621470024.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did he get real bodied? He never used a powerful attack and seemed to be holding back",
                    "author": "Darkdragon3110525",
                    "id": "gypn7yy",
                    "parent_id": "t1_gypipj4",
                    "score": 7,
                    "created_utc": 1621440668.0,
                    "replies": [
                        {
                            "body": "He was possesed by Nue. Shikadai, Boruto, and Mitsuki handled him.",
                            "author": "150crawfish",
                            "id": "gyppygb",
                            "parent_id": "t1_gypn7yy",
                            "score": 6,
                            "created_utc": 1621441805.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Tenten gets increasingly nerfed in screentime and actual power level.\n\nScreentime sure, but idk about power wise. It's kinda hard to assess her since the only on-screen canon fight she took part in she got severely manhandled by Temari and took a huge L",
            "author": "KingofTrollenheim",
            "id": "gyplvfn",
            "parent_id": "t1_gypchty",
            "score": 11,
            "created_utc": 1621440105.0,
            "replies": [
                {
                    "body": "What about the war arc when she has a one of the Six Path's ninja tools",
                    "author": "NoobyOverlord",
                    "id": "gyq2pee",
                    "parent_id": "t1_gyplvfn",
                    "score": 4,
                    "created_utc": 1621447091.0,
                    "replies": [
                        {
                            "body": "She takes on kakuzu at that point doesnt she? I remember when the manga was still releasing and we saw tenten get back her tools (madara spat them out) and ppl were afraid she was gonna be the one to save the day and beat madara with the items.",
                            "author": "LikeRealityDislike",
                            "id": "gyq88a1",
                            "parent_id": "t1_gyq2pee",
                            "score": 9,
                            "created_utc": 1621449396.0,
                            "replies": []
                        },
                        {
                            "body": "That was more focused on in the anime, from what I recall in the manga it was kinda mentioned but not much emphasis was made about it",
                            "author": "KingofTrollenheim",
                            "id": "gyq9ssd",
                            "parent_id": "t1_gyq2pee",
                            "score": 1,
                            "created_utc": 1621450054.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She wasn’t nerfed, she just got power scaled into the abyss",
                    "author": "poop_ahaha",
                    "id": "gyq7qfx",
                    "parent_id": "t1_gyplvfn",
                    "score": 4,
                    "created_utc": 1621449191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would a been sick to see tenten just insta arm an entire regiment with bows or other ranged weapons then reequip them with swords soon after.\n\nOr mess with storing Legendary swords.\n\n\nHonestly Tenten could have basically leveled up onto Gilgamesh from Fate really easily.",
            "author": "Ghostkill221",
            "id": "gypupx4",
            "parent_id": "t1_gypchty",
            "score": 6,
            "created_utc": 1621443799.0,
            "replies": []
        },
        {
            "body": "I mean she’s not a super powerful ninja didn’t,  see a lot of drive from her to be more powerful (at least not like Rock lee, Kiba, or really anyone else). She doesn’t come from a super powerful clan. There were other Ninja who were strong but didn’t have powerful jutsu, mostly filler enemies or the guards of the village (lol), or random people who get beaten by narutos shadow clones. Idk maybe there’s a reason, and she just didn’t have the drive to become a hokage, or didn’t have a rival like the others?",
            "author": "Bups34",
            "id": "gyq97ok",
            "parent_id": "t1_gypchty",
            "score": 3,
            "created_utc": 1621449809.0,
            "replies": [
                {
                    "body": "You forgot to mention that Kishimoto doesn't know how to write women characters.\n\nThat's not a joke, it's something he's admitted. Hence why Naruto females get shit on and never fully develop into full characters.",
                    "author": "i_Got_Rocks",
                    "id": "gyrnxj1",
                    "parent_id": "t1_gyq97ok",
                    "score": 2,
                    "created_utc": 1621472815.0,
                    "replies": [
                        {
                            "body": "Yeah I guess I’m just talking about what I saw in the show",
                            "author": "Bups34",
                            "id": "gyro10p",
                            "parent_id": "t1_gyrnxj1",
                            "score": 1,
                            "created_utc": 1621472866.0,
                            "replies": [
                                {
                                    "body": "The show follows the manga (no including the filler), so it's about the same thing. RIP Ten Ten character development.",
                                    "author": "i_Got_Rocks",
                                    "id": "gyrrdcf",
                                    "parent_id": "t1_gyro10p",
                                    "score": 1,
                                    "created_utc": 1621474556.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tbf tenten does become pretty powerful once she gets the six paths weapons. I remember people being afraid she was gonna be the one to save the day and beat juubi madara.",
            "author": "LikeRealityDislike",
            "id": "gyq7zen",
            "parent_id": "t1_gypchty",
            "score": 1,
            "created_utc": 1621449295.0,
            "replies": []
        },
        {
            "body": "These and obito flashbacks are burned in my retina",
            "author": "medson25",
            "id": "gypzq7k",
            "parent_id": "t1_gyp03sn",
            "score": 26,
            "created_utc": 1621445865.0,
            "replies": [
                {
                    "body": "the amount of times I watched obito give kakashi his eye😂will deff be the last thing i see in my brain before i die. not complaining too much tho cause obito is my favorite character lmaoo",
                    "author": "leakawa17",
                    "id": "gyqn0eu",
                    "parent_id": "t1_gypzq7k",
                    "score": 15,
                    "created_utc": 1621455718.0,
                    "replies": [
                        {
                            "body": "Jokes apart. We need Naruto: Brotherhood",
                            "author": "Clickbaiting_4_u",
                            "id": "gyqro7b",
                            "parent_id": "t1_gyqn0eu",
                            "score": 5,
                            "created_utc": 1621457600.0,
                            "replies": [
                                {
                                    "body": "Go to r/Naruto. \n\nLook in the permanent tabs.\n\nlook at \"Naruto Kai\"\n\nFan made, but damn good job.",
                                    "author": "i_Got_Rocks",
                                    "id": "gyrmg42",
                                    "parent_id": "t1_gyqro7b",
                                    "score": 4,
                                    "created_utc": 1621472066.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lets remember that a lot of repeated flashbacks are actually filler and weren't in the manga. I hope to make a repeated flashback filler list someday...",
            "author": "LikeRealityDislike",
            "id": "gyq8g45",
            "parent_id": "t1_gyp03sn",
            "score": 11,
            "created_utc": 1621449487.0,
            "replies": [
                {
                    "body": "At least 20% of the show is the hallway chidori scene with itachi",
                    "author": "MyFingerPointeth",
                    "id": "gyq9x5u",
                    "parent_id": "t1_gyq8g45",
                    "score": 10,
                    "created_utc": 1621450105.0,
                    "replies": [
                        {
                            "body": "I’d say it’s the scene where Itachi massacres the Uchicha, I just rewatched the show and that scene must have replayed over 20 times",
                            "author": "Nymphadorena",
                            "id": "gyr4rm0",
                            "parent_id": "t1_gyq9x5u",
                            "score": 8,
                            "created_utc": 1621463129.0,
                            "replies": [
                                {
                                    "body": "Promise me one thing, look after sasuke, our suffering will be short compared to yours, youre truly a kind child 🙄🤮",
                                    "author": "MyFingerPointeth",
                                    "id": "gyrno60",
                                    "parent_id": "t1_gyr4rm0",
                                    "score": 1,
                                    "created_utc": 1621472683.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto: No one ever acknowledged me.\n\nHis Past: *Shikamaru, Choji, Sasuke, Kids laughing at his terrible transformations*\n\nHis past: Am I a joke to you??",
            "author": "i_Got_Rocks",
            "id": "gyrmcg7",
            "parent_id": "t1_gyp03sn",
            "score": 2,
            "created_utc": 1621472015.0,
            "replies": []
        },
        {
            "body": "YEZ",
            "author": "Huge_Flying_Lizard",
            "id": "gyp6065",
            "parent_id": "t1_gyow8t5",
            "score": 14,
            "created_utc": 1621433522.0,
            "replies": []
        },
        {
            "body": "Or watch filler episodes",
            "author": "smyth101-",
            "id": "gyp6qxh",
            "parent_id": "t1_gyow8t5",
            "score": 12,
            "created_utc": 1621433840.0,
            "replies": []
        },
        {
            "body": "Yez she gets even more screentime than Naruto gets in Sasuke shippuden",
            "author": "LikeRealityDislike",
            "id": "gyq8is4",
            "parent_id": "t1_gyow8t5",
            "score": 5,
            "created_utc": 1621449518.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gyq807b",
            "parent_id": "t1_gyow8t5",
            "score": -5,
            "created_utc": 1621449304.0,
            "replies": []
        },
        {
            "body": "Konan got destroyed by Uchiha bullshit.",
            "author": "TyrionGoldenLion",
            "id": "gypr2qh",
            "parent_id": "t1_gypf4mn",
            "score": 24,
            "created_utc": 1621442277.0,
            "replies": []
        },
        {
            "body": "Lets not forget tsunade especially in the very last arc against madara, she was doing so good and was so persistent, had muktiple blades through her gut and kept beating and breaking madara's susanoo! \n\nAlso let's not forget the meager yet significant contribution by sakura at the very end where she is the one who beats kaguya down into naruto's and sasuke's sealing. She's also the one who makes obito get sasuke back from the other dimension.",
            "author": "LikeRealityDislike",
            "id": "gyq8wpy",
            "parent_id": "t1_gypf4mn",
            "score": 11,
            "created_utc": 1621449682.0,
            "replies": [
                {
                    "body": "Kishimoto did well with Hinata and Tsunade. Because of Tsunade, Sakura and Ino did much better in Shippuden, and without Tsunade's help, many people would have died and there would have been a new Hokage.",
                    "author": "PlausibleSplendor15",
                    "id": "gytlpcc",
                    "parent_id": "t1_gyq8wpy",
                    "score": 2,
                    "created_utc": 1621518557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And arguably his toad wallet has the best character development.",
            "author": "PissBottleFromTF2",
            "id": "gyq1wvo",
            "parent_id": "t1_gyp2tk1",
            "score": 8,
            "created_utc": 1621446763.0,
            "replies": []
        },
        {
            "body": "Sub Title: \"Don't Cry Cause You're So Right Chronicles\"",
            "author": "i_Got_Rocks",
            "id": "gyro689",
            "parent_id": "t1_gyph2j6",
            "score": 1,
            "created_utc": 1621472940.0,
            "replies": []
        },
        {
            "body": "Sakura screaming Naruto's name has more character development.",
            "author": "i_Got_Rocks",
            "id": "gyro85s",
            "parent_id": "t1_gyqailf",
            "score": 5,
            "created_utc": 1621472967.0,
            "replies": []
        },
        {
            "body": "That's straight up Tenten's most iconic moment.",
            "author": "Mexus51",
            "id": "gyrvai1",
            "parent_id": "t1_gyrm4en",
            "score": 5,
            "created_utc": 1621476535.0,
            "replies": []
        },
        {
            "body": "Actually it’s Temari’s va Yuri Lowenthal is married to. I can see how it’s easily confusable since they both start with T (Tenten and Temari).",
            "author": "MilesYoungblood",
            "id": "gzdomjw",
            "parent_id": "t1_gys3d3s",
            "score": 1,
            "created_utc": 1621942161.0,
            "replies": [
                {
                    "body": "Yep, that’s what I meant lol 🤦🏻‍♂️",
                    "author": "itsRobbie_",
                    "id": "gzgn3fs",
                    "parent_id": "t1_gzdomjw",
                    "score": 2,
                    "created_utc": 1621992396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don't they have the same name?",
            "author": "Connorthecyborg",
            "id": "gyrklul",
            "parent_id": "t1_gyqhi1c",
            "score": 2,
            "created_utc": 1621471144.0,
            "replies": [
                {
                    "body": "oof",
                    "author": "i_Got_Rocks",
                    "id": "gyro93b",
                    "parent_id": "t1_gyrklul",
                    "score": 3,
                    "created_utc": 1621472981.0,
                    "replies": []
                },
                {
                    "body": "I think the pigs name is tonton",
                    "author": "ComfortableEar6",
                    "id": "gyv9lk3",
                    "parent_id": "t1_gyrklul",
                    "score": 1,
                    "created_utc": 1621543881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto's fart in Akamaru's face has more screen time lmao",
            "author": "i_Got_Rocks",
            "id": "gyroc8c",
            "parent_id": "t1_gyrcup6",
            "score": 1,
            "created_utc": 1621473025.0,
            "replies": []
        },
        {
            "body": "The writing made her so, she didn't have any character development in my opinion.",
            "author": "Ramiplease",
            "id": "gyppqe3",
            "parent_id": "t1_gypc7tl",
            "score": 59,
            "created_utc": 1621441710.0,
            "replies": [
                {
                    "body": "Imagine if in tenten vs temari she had chakra strings attached to all of her ninja tools resulting in tenten's win. Tenten would be OP and a \"real\" ninja.",
                    "author": "Clickbaiting_4_u",
                    "id": "gyqs7ps",
                    "parent_id": "t1_gyppqe3",
                    "score": 20,
                    "created_utc": 1621457783.0,
                    "replies": [
                        {
                            "body": "I think Tenten's character was too limited, that's why she never developed like the rest, which lead to her being sacrificed in order to focus on more important characters, that's how I see it.",
                            "author": "Ramiplease",
                            "id": "gyqx4sd",
                            "parent_id": "t1_gyqs7ps",
                            "score": 9,
                            "created_utc": 1621459595.0,
                            "replies": [
                                {
                                    "body": "\"You need to have a traumatic childhood to become an important character in anime\"",
                                    "author": "Clickbaiting_4_u",
                                    "id": "gyzkug7",
                                    "parent_id": "t1_gyqx4sd",
                                    "score": 1,
                                    "created_utc": 1621631780.0,
                                    "replies": [
                                        {
                                            "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
                                            "author": "Ramiplease",
                                            "id": "gyzobpm",
                                            "parent_id": "t1_gyzkug7",
                                            "score": 1,
                                            "created_utc": 1621633418.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "... I mean yeah. She's a character the only exists in art and writing.",
                    "author": "Ghostkill221",
                    "id": "gypuh8r",
                    "parent_id": "t1_gyppqe3",
                    "score": 14,
                    "created_utc": 1621443696.0,
                    "replies": []
                },
                {
                    "body": "And this is exactly why",
                    "author": "Sonicmaster06",
                    "id": "gyppsqb",
                    "parent_id": "t1_gyppqe3",
                    "score": -27,
                    "created_utc": 1621441737.0,
                    "replies": [
                        {
                            "body": "So you should be blaming the writer. Not the character 🤣",
                            "author": "regalfuzz",
                            "id": "gyqpa2k",
                            "parent_id": "t1_gyppsqb",
                            "score": 9,
                            "created_utc": 1621456678.0,
                            "replies": [
                                {
                                    "body": "Tenten is a loser though. He didn't say anything about blame, this man is getting the hivemind treatment for saying something that is true. Not a polite thing to say about a character plenty of people here seem to like, sure, but still not untrue.",
                                    "author": "MonsterStunter",
                                    "id": "gyqs7hu",
                                    "parent_id": "t1_gyqpa2k",
                                    "score": 0,
                                    "created_utc": 1621457781.0,
                                    "replies": [
                                        {
                                            "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
                                            "author": "regalfuzz",
                                            "id": "gyqx12j",
                                            "parent_id": "t1_gyqs7hu",
                                            "score": 0,
                                            "created_utc": 1621459549.0,
                                            "replies": [
                                                {
                                                    "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                                                    "author": "MonsterStunter",
                                                    "id": "gyrcqi8",
                                                    "parent_id": "t1_gyqx12j",
                                                    "score": 1,
                                                    "created_utc": 1621467149.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lmao",
                                                            "author": "regalfuzz",
                                                            "id": "gyrhncr",
                                                            "parent_id": "t1_gyrcqi8",
                                                            "score": 1,
                                                            "created_utc": 1621469652.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                                                    "author": "MonsterStunter",
                                                                    "id": "gysy2u9",
                                                                    "parent_id": "t1_gyrhncr",
                                                                    "score": 1,
                                                                    "created_utc": 1621503699.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lmao",
                                                                            "author": "regalfuzz",
                                                                            "id": "gyt3801",
                                                                            "parent_id": "t1_gysy2u9",
                                                                            "score": 1,
                                                                            "created_utc": 1621508109.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "What... dude",
                                    "author": "Sonicmaster06",
                                    "id": "gyqpeaa",
                                    "parent_id": "t1_gyqpa2k",
                                    "score": 2,
                                    "created_utc": 1621456727.0,
                                    "replies": []
                                },
                                {
                                    "body": "Your brain is small",
                                    "author": "Hermes_YSL",
                                    "id": "gyv7ayq",
                                    "parent_id": "t1_gyqpa2k",
                                    "score": 1,
                                    "created_utc": 1621542877.0,
                                    "replies": [
                                        {
                                            "body": "I'm sure it is",
                                            "author": "regalfuzz",
                                            "id": "gyvyy08",
                                            "parent_id": "t1_gyv7ayq",
                                            "score": 1,
                                            "created_utc": 1621556134.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh",
            "author": "Exploded_hinge",
            "id": "gypoypg",
            "parent_id": "t1_gypc7tl",
            "score": 37,
            "created_utc": 1621441395.0,
            "replies": [
                {
                    "body": "Why are you booing me? I’m right",
                    "author": "Sonicmaster06",
                    "id": "gypp6ea",
                    "parent_id": "t1_gypoypg",
                    "score": -51,
                    "created_utc": 1621441482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol, haven't seen Boruto but honestly how do you continue a story like Naruto?? I think they should have tried to do a prequel with one of the former Hokage's or Jiraiya or something.",
            "author": "tpklus",
            "id": "gypjsmj",
            "parent_id": "t1_gypipj4",
            "score": 43,
            "created_utc": 1621439252.0,
            "replies": [
                {
                    "body": "You couldn't, that's why I've never wanted Boruto. Naruto's conclusion was very definitive, and put everything into place as to make it clear that the world is supposed to be at peace and the cycles that were keeping it at war were no more and the greatest threats were dealt with. There's just nothing else to continue, the only way would be repeating themselves and undermining everything that came before which is exactly what Boruto has done. It's exactly the same cycle that Dragon Ball fell into the moment they set up frieza as the most powerful being in the entire UNIVERSE - At that point what do you? Pretty much the same thing over and over again except with a new guy who it turns out is the REAL most powerful super awesome enemy in the universe every single new arc.",
                    "author": null,
                    "id": "gyqkpbl",
                    "parent_id": "t1_gypjsmj",
                    "score": 36,
                    "created_utc": 1621454737.0,
                    "replies": [
                        {
                            "body": "Boruto would be successful too if it had plot from the beginning instead of horseshit 160+ episodes. Like literally the other MC Kawaki was introduced after 190+ episodes!",
                            "author": "Clickbaiting_4_u",
                            "id": "gyqsv1c",
                            "parent_id": "t1_gyqkpbl",
                            "score": 15,
                            "created_utc": 1621458005.0,
                            "replies": []
                        },
                        {
                            "body": "You can continue it. But you can't continue it in the same genre.\n\nShonen anime is about some charming kid that becomes amazing, but the real victory is about the friends they make along the way. And how over-powered they become along the way.\n\nBoruto shouldn't be a shonen, it's too stupid at this point. It should a Seinen. Dealing with more mature themes in darker manners, dropping much of the comedy and wakiness. Maybe Naruto dealing with the the death of Ninja's Way as the world grows peaceful, the same way Samurai had to redefine themselves--and many failing to do so in a proper way. \n\nMaybe dealing with father hood honestly, the work it takes to sustain a marriage in a busy life, and so on. \n\nMaybe not everyone of our Naruto heroes can have kids, or maybe not all of their kids are interested in Ninja destinies. One of Naruto kids doesn't want to do it at all--and then Hinata has a fight with Naruto about how she never wanted to follow her dad's family crap just because she was born into the wrong family--that could take a whole arc, leading to Naruto realizing his destiny is not the one meant for his kids. \n\nYou know...dealing with them growing, in new ways.",
                            "author": "i_Got_Rocks",
                            "id": "gyrncwr",
                            "parent_id": "t1_gyqkpbl",
                            "score": 14,
                            "created_utc": 1621472523.0,
                            "replies": [
                                {
                                    "body": "I agree actually I think switching the genre of the show would've been the only way it could have made sense along with scaling down some of the craziness, but that's too much of a risk for these giant corporations.",
                                    "author": null,
                                    "id": "gyrz4pm",
                                    "parent_id": "t1_gyrncwr",
                                    "score": 9,
                                    "created_utc": 1621478470.0,
                                    "replies": [
                                        {
                                            "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
                                            "author": "HazyMirror",
                                            "id": "gys91vs",
                                            "parent_id": "t1_gyrz4pm",
                                            "score": 5,
                                            "created_utc": 1621483885.0,
                                            "replies": [
                                                {
                                                    "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                                                    "author": null,
                                                    "id": "gysdtya",
                                                    "parent_id": "t1_gys91vs",
                                                    "score": 3,
                                                    "created_utc": 1621486702.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                                                            "author": "HazyMirror",
                                                            "id": "gysvkai",
                                                            "parent_id": "t1_gysdtya",
                                                            "score": 1,
                                                            "created_utc": 1621501313.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I recently started watching it again and caught up. Out of the 199 episodes so far, maybe like 100 is filler and is very skippable, but just considering the actual story stuff it's not that bad. It's not really a continuation rather than a new story in the same setting with returning characters. The recent arcs have been pretty interesting too, but I wouldn't call it anywhere near as good as naruto yet.",
                    "author": "Rohit624",
                    "id": "gyqlur0",
                    "parent_id": "t1_gypjsmj",
                    "score": 7,
                    "created_utc": 1621455229.0,
                    "replies": [
                        {
                            "body": "If you don't want filler just reas boruto Manga, the anime is intentionally more filler than the Manga.",
                            "author": "locknloadstack",
                            "id": "gyqor44",
                            "parent_id": "t1_gyqlur0",
                            "score": 2,
                            "created_utc": 1621456454.0,
                            "replies": [
                                {
                                    "body": "Don't you have to pay for reading the mangas?",
                                    "author": "darknioss",
                                    "id": "gyqqo7g",
                                    "parent_id": "t1_gyqor44",
                                    "score": 2,
                                    "created_utc": 1621457260.0,
                                    "replies": [
                                        {
                                            "body": "Lol",
                                            "author": "locknloadstack",
                                            "id": "gyqrvw1",
                                            "parent_id": "t1_gyqqo7g",
                                            "score": 9,
                                            "created_utc": 1621457672.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
                                            "author": "banishedpaladin",
                                            "id": "gysktuk",
                                            "parent_id": "t1_gyqqo7g",
                                            "score": 2,
                                            "created_utc": 1621491737.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
                                            "author": "tamunti02",
                                            "id": "gyrie81",
                                            "parent_id": "t1_gyqqo7g",
                                            "score": 1,
                                            "created_utc": 1621470024.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did he get real bodied? He never used a powerful attack and seemed to be holding back",
            "author": "Darkdragon3110525",
            "id": "gypn7yy",
            "parent_id": "t1_gypipj4",
            "score": 7,
            "created_utc": 1621440668.0,
            "replies": [
                {
                    "body": "He was possesed by Nue. Shikadai, Boruto, and Mitsuki handled him.",
                    "author": "150crawfish",
                    "id": "gyppygb",
                    "parent_id": "t1_gypn7yy",
                    "score": 6,
                    "created_utc": 1621441805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What about the war arc when she has a one of the Six Path's ninja tools",
            "author": "NoobyOverlord",
            "id": "gyq2pee",
            "parent_id": "t1_gyplvfn",
            "score": 4,
            "created_utc": 1621447091.0,
            "replies": [
                {
                    "body": "She takes on kakuzu at that point doesnt she? I remember when the manga was still releasing and we saw tenten get back her tools (madara spat them out) and ppl were afraid she was gonna be the one to save the day and beat madara with the items.",
                    "author": "LikeRealityDislike",
                    "id": "gyq88a1",
                    "parent_id": "t1_gyq2pee",
                    "score": 9,
                    "created_utc": 1621449396.0,
                    "replies": []
                },
                {
                    "body": "That was more focused on in the anime, from what I recall in the manga it was kinda mentioned but not much emphasis was made about it",
                    "author": "KingofTrollenheim",
                    "id": "gyq9ssd",
                    "parent_id": "t1_gyq2pee",
                    "score": 1,
                    "created_utc": 1621450054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She wasn’t nerfed, she just got power scaled into the abyss",
            "author": "poop_ahaha",
            "id": "gyq7qfx",
            "parent_id": "t1_gyplvfn",
            "score": 4,
            "created_utc": 1621449191.0,
            "replies": []
        },
        {
            "body": "You forgot to mention that Kishimoto doesn't know how to write women characters.\n\nThat's not a joke, it's something he's admitted. Hence why Naruto females get shit on and never fully develop into full characters.",
            "author": "i_Got_Rocks",
            "id": "gyrnxj1",
            "parent_id": "t1_gyq97ok",
            "score": 2,
            "created_utc": 1621472815.0,
            "replies": [
                {
                    "body": "Yeah I guess I’m just talking about what I saw in the show",
                    "author": "Bups34",
                    "id": "gyro10p",
                    "parent_id": "t1_gyrnxj1",
                    "score": 1,
                    "created_utc": 1621472866.0,
                    "replies": [
                        {
                            "body": "The show follows the manga (no including the filler), so it's about the same thing. RIP Ten Ten character development.",
                            "author": "i_Got_Rocks",
                            "id": "gyrrdcf",
                            "parent_id": "t1_gyro10p",
                            "score": 1,
                            "created_utc": 1621474556.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "the amount of times I watched obito give kakashi his eye😂will deff be the last thing i see in my brain before i die. not complaining too much tho cause obito is my favorite character lmaoo",
            "author": "leakawa17",
            "id": "gyqn0eu",
            "parent_id": "t1_gypzq7k",
            "score": 15,
            "created_utc": 1621455718.0,
            "replies": [
                {
                    "body": "Jokes apart. We need Naruto: Brotherhood",
                    "author": "Clickbaiting_4_u",
                    "id": "gyqro7b",
                    "parent_id": "t1_gyqn0eu",
                    "score": 5,
                    "created_utc": 1621457600.0,
                    "replies": [
                        {
                            "body": "Go to r/Naruto. \n\nLook in the permanent tabs.\n\nlook at \"Naruto Kai\"\n\nFan made, but damn good job.",
                            "author": "i_Got_Rocks",
                            "id": "gyrmg42",
                            "parent_id": "t1_gyqro7b",
                            "score": 4,
                            "created_utc": 1621472066.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At least 20% of the show is the hallway chidori scene with itachi",
            "author": "MyFingerPointeth",
            "id": "gyq9x5u",
            "parent_id": "t1_gyq8g45",
            "score": 10,
            "created_utc": 1621450105.0,
            "replies": [
                {
                    "body": "I’d say it’s the scene where Itachi massacres the Uchicha, I just rewatched the show and that scene must have replayed over 20 times",
                    "author": "Nymphadorena",
                    "id": "gyr4rm0",
                    "parent_id": "t1_gyq9x5u",
                    "score": 8,
                    "created_utc": 1621463129.0,
                    "replies": [
                        {
                            "body": "Promise me one thing, look after sasuke, our suffering will be short compared to yours, youre truly a kind child 🙄🤮",
                            "author": "MyFingerPointeth",
                            "id": "gyrno60",
                            "parent_id": "t1_gyr4rm0",
                            "score": 1,
                            "created_utc": 1621472683.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kishimoto did well with Hinata and Tsunade. Because of Tsunade, Sakura and Ino did much better in Shippuden, and without Tsunade's help, many people would have died and there would have been a new Hokage.",
            "author": "PlausibleSplendor15",
            "id": "gytlpcc",
            "parent_id": "t1_gyq8wpy",
            "score": 2,
            "created_utc": 1621518557.0,
            "replies": []
        },
        {
            "body": "Yep, that’s what I meant lol 🤦🏻‍♂️",
            "author": "itsRobbie_",
            "id": "gzgn3fs",
            "parent_id": "t1_gzdomjw",
            "score": 2,
            "created_utc": 1621992396.0,
            "replies": []
        },
        {
            "body": "oof",
            "author": "i_Got_Rocks",
            "id": "gyro93b",
            "parent_id": "t1_gyrklul",
            "score": 3,
            "created_utc": 1621472981.0,
            "replies": []
        },
        {
            "body": "I think the pigs name is tonton",
            "author": "ComfortableEar6",
            "id": "gyv9lk3",
            "parent_id": "t1_gyrklul",
            "score": 1,
            "created_utc": 1621543881.0,
            "replies": []
        },
        {
            "body": "Imagine if in tenten vs temari she had chakra strings attached to all of her ninja tools resulting in tenten's win. Tenten would be OP and a \"real\" ninja.",
            "author": "Clickbaiting_4_u",
            "id": "gyqs7ps",
            "parent_id": "t1_gyppqe3",
            "score": 20,
            "created_utc": 1621457783.0,
            "replies": [
                {
                    "body": "I think Tenten's character was too limited, that's why she never developed like the rest, which lead to her being sacrificed in order to focus on more important characters, that's how I see it.",
                    "author": "Ramiplease",
                    "id": "gyqx4sd",
                    "parent_id": "t1_gyqs7ps",
                    "score": 9,
                    "created_utc": 1621459595.0,
                    "replies": [
                        {
                            "body": "\"You need to have a traumatic childhood to become an important character in anime\"",
                            "author": "Clickbaiting_4_u",
                            "id": "gyzkug7",
                            "parent_id": "t1_gyqx4sd",
                            "score": 1,
                            "created_utc": 1621631780.0,
                            "replies": [
                                {
                                    "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
                                    "author": "Ramiplease",
                                    "id": "gyzobpm",
                                    "parent_id": "t1_gyzkug7",
                                    "score": 1,
                                    "created_utc": 1621633418.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "... I mean yeah. She's a character the only exists in art and writing.",
            "author": "Ghostkill221",
            "id": "gypuh8r",
            "parent_id": "t1_gyppqe3",
            "score": 14,
            "created_utc": 1621443696.0,
            "replies": []
        },
        {
            "body": "And this is exactly why",
            "author": "Sonicmaster06",
            "id": "gyppsqb",
            "parent_id": "t1_gyppqe3",
            "score": -27,
            "created_utc": 1621441737.0,
            "replies": [
                {
                    "body": "So you should be blaming the writer. Not the character 🤣",
                    "author": "regalfuzz",
                    "id": "gyqpa2k",
                    "parent_id": "t1_gyppsqb",
                    "score": 9,
                    "created_utc": 1621456678.0,
                    "replies": [
                        {
                            "body": "Tenten is a loser though. He didn't say anything about blame, this man is getting the hivemind treatment for saying something that is true. Not a polite thing to say about a character plenty of people here seem to like, sure, but still not untrue.",
                            "author": "MonsterStunter",
                            "id": "gyqs7hu",
                            "parent_id": "t1_gyqpa2k",
                            "score": 0,
                            "created_utc": 1621457781.0,
                            "replies": [
                                {
                                    "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
                                    "author": "regalfuzz",
                                    "id": "gyqx12j",
                                    "parent_id": "t1_gyqs7hu",
                                    "score": 0,
                                    "created_utc": 1621459549.0,
                                    "replies": [
                                        {
                                            "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                                            "author": "MonsterStunter",
                                            "id": "gyrcqi8",
                                            "parent_id": "t1_gyqx12j",
                                            "score": 1,
                                            "created_utc": 1621467149.0,
                                            "replies": [
                                                {
                                                    "body": "Lmao",
                                                    "author": "regalfuzz",
                                                    "id": "gyrhncr",
                                                    "parent_id": "t1_gyrcqi8",
                                                    "score": 1,
                                                    "created_utc": 1621469652.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                                            "author": "MonsterStunter",
                                                            "id": "gysy2u9",
                                                            "parent_id": "t1_gyrhncr",
                                                            "score": 1,
                                                            "created_utc": 1621503699.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lmao",
                                                                    "author": "regalfuzz",
                                                                    "id": "gyt3801",
                                                                    "parent_id": "t1_gysy2u9",
                                                                    "score": 1,
                                                                    "created_utc": 1621508109.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What... dude",
                            "author": "Sonicmaster06",
                            "id": "gyqpeaa",
                            "parent_id": "t1_gyqpa2k",
                            "score": 2,
                            "created_utc": 1621456727.0,
                            "replies": []
                        },
                        {
                            "body": "Your brain is small",
                            "author": "Hermes_YSL",
                            "id": "gyv7ayq",
                            "parent_id": "t1_gyqpa2k",
                            "score": 1,
                            "created_utc": 1621542877.0,
                            "replies": [
                                {
                                    "body": "I'm sure it is",
                                    "author": "regalfuzz",
                                    "id": "gyvyy08",
                                    "parent_id": "t1_gyv7ayq",
                                    "score": 1,
                                    "created_utc": 1621556134.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why are you booing me? I’m right",
            "author": "Sonicmaster06",
            "id": "gypp6ea",
            "parent_id": "t1_gypoypg",
            "score": -51,
            "created_utc": 1621441482.0,
            "replies": []
        },
        {
            "body": "You couldn't, that's why I've never wanted Boruto. Naruto's conclusion was very definitive, and put everything into place as to make it clear that the world is supposed to be at peace and the cycles that were keeping it at war were no more and the greatest threats were dealt with. There's just nothing else to continue, the only way would be repeating themselves and undermining everything that came before which is exactly what Boruto has done. It's exactly the same cycle that Dragon Ball fell into the moment they set up frieza as the most powerful being in the entire UNIVERSE - At that point what do you? Pretty much the same thing over and over again except with a new guy who it turns out is the REAL most powerful super awesome enemy in the universe every single new arc.",
            "author": null,
            "id": "gyqkpbl",
            "parent_id": "t1_gypjsmj",
            "score": 36,
            "created_utc": 1621454737.0,
            "replies": [
                {
                    "body": "Boruto would be successful too if it had plot from the beginning instead of horseshit 160+ episodes. Like literally the other MC Kawaki was introduced after 190+ episodes!",
                    "author": "Clickbaiting_4_u",
                    "id": "gyqsv1c",
                    "parent_id": "t1_gyqkpbl",
                    "score": 15,
                    "created_utc": 1621458005.0,
                    "replies": []
                },
                {
                    "body": "You can continue it. But you can't continue it in the same genre.\n\nShonen anime is about some charming kid that becomes amazing, but the real victory is about the friends they make along the way. And how over-powered they become along the way.\n\nBoruto shouldn't be a shonen, it's too stupid at this point. It should a Seinen. Dealing with more mature themes in darker manners, dropping much of the comedy and wakiness. Maybe Naruto dealing with the the death of Ninja's Way as the world grows peaceful, the same way Samurai had to redefine themselves--and many failing to do so in a proper way. \n\nMaybe dealing with father hood honestly, the work it takes to sustain a marriage in a busy life, and so on. \n\nMaybe not everyone of our Naruto heroes can have kids, or maybe not all of their kids are interested in Ninja destinies. One of Naruto kids doesn't want to do it at all--and then Hinata has a fight with Naruto about how she never wanted to follow her dad's family crap just because she was born into the wrong family--that could take a whole arc, leading to Naruto realizing his destiny is not the one meant for his kids. \n\nYou know...dealing with them growing, in new ways.",
                    "author": "i_Got_Rocks",
                    "id": "gyrncwr",
                    "parent_id": "t1_gyqkpbl",
                    "score": 14,
                    "created_utc": 1621472523.0,
                    "replies": [
                        {
                            "body": "I agree actually I think switching the genre of the show would've been the only way it could have made sense along with scaling down some of the craziness, but that's too much of a risk for these giant corporations.",
                            "author": null,
                            "id": "gyrz4pm",
                            "parent_id": "t1_gyrncwr",
                            "score": 9,
                            "created_utc": 1621478470.0,
                            "replies": [
                                {
                                    "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
                                    "author": "HazyMirror",
                                    "id": "gys91vs",
                                    "parent_id": "t1_gyrz4pm",
                                    "score": 5,
                                    "created_utc": 1621483885.0,
                                    "replies": [
                                        {
                                            "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                                            "author": null,
                                            "id": "gysdtya",
                                            "parent_id": "t1_gys91vs",
                                            "score": 3,
                                            "created_utc": 1621486702.0,
                                            "replies": [
                                                {
                                                    "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                                                    "author": "HazyMirror",
                                                    "id": "gysvkai",
                                                    "parent_id": "t1_gysdtya",
                                                    "score": 1,
                                                    "created_utc": 1621501313.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I recently started watching it again and caught up. Out of the 199 episodes so far, maybe like 100 is filler and is very skippable, but just considering the actual story stuff it's not that bad. It's not really a continuation rather than a new story in the same setting with returning characters. The recent arcs have been pretty interesting too, but I wouldn't call it anywhere near as good as naruto yet.",
            "author": "Rohit624",
            "id": "gyqlur0",
            "parent_id": "t1_gypjsmj",
            "score": 7,
            "created_utc": 1621455229.0,
            "replies": [
                {
                    "body": "If you don't want filler just reas boruto Manga, the anime is intentionally more filler than the Manga.",
                    "author": "locknloadstack",
                    "id": "gyqor44",
                    "parent_id": "t1_gyqlur0",
                    "score": 2,
                    "created_utc": 1621456454.0,
                    "replies": [
                        {
                            "body": "Don't you have to pay for reading the mangas?",
                            "author": "darknioss",
                            "id": "gyqqo7g",
                            "parent_id": "t1_gyqor44",
                            "score": 2,
                            "created_utc": 1621457260.0,
                            "replies": [
                                {
                                    "body": "Lol",
                                    "author": "locknloadstack",
                                    "id": "gyqrvw1",
                                    "parent_id": "t1_gyqqo7g",
                                    "score": 9,
                                    "created_utc": 1621457672.0,
                                    "replies": []
                                },
                                {
                                    "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
                                    "author": "banishedpaladin",
                                    "id": "gysktuk",
                                    "parent_id": "t1_gyqqo7g",
                                    "score": 2,
                                    "created_utc": 1621491737.0,
                                    "replies": []
                                },
                                {
                                    "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
                                    "author": "tamunti02",
                                    "id": "gyrie81",
                                    "parent_id": "t1_gyqqo7g",
                                    "score": 1,
                                    "created_utc": 1621470024.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He was possesed by Nue. Shikadai, Boruto, and Mitsuki handled him.",
            "author": "150crawfish",
            "id": "gyppygb",
            "parent_id": "t1_gypn7yy",
            "score": 6,
            "created_utc": 1621441805.0,
            "replies": []
        },
        {
            "body": "She takes on kakuzu at that point doesnt she? I remember when the manga was still releasing and we saw tenten get back her tools (madara spat them out) and ppl were afraid she was gonna be the one to save the day and beat madara with the items.",
            "author": "LikeRealityDislike",
            "id": "gyq88a1",
            "parent_id": "t1_gyq2pee",
            "score": 9,
            "created_utc": 1621449396.0,
            "replies": []
        },
        {
            "body": "That was more focused on in the anime, from what I recall in the manga it was kinda mentioned but not much emphasis was made about it",
            "author": "KingofTrollenheim",
            "id": "gyq9ssd",
            "parent_id": "t1_gyq2pee",
            "score": 1,
            "created_utc": 1621450054.0,
            "replies": []
        },
        {
            "body": "Yeah I guess I’m just talking about what I saw in the show",
            "author": "Bups34",
            "id": "gyro10p",
            "parent_id": "t1_gyrnxj1",
            "score": 1,
            "created_utc": 1621472866.0,
            "replies": [
                {
                    "body": "The show follows the manga (no including the filler), so it's about the same thing. RIP Ten Ten character development.",
                    "author": "i_Got_Rocks",
                    "id": "gyrrdcf",
                    "parent_id": "t1_gyro10p",
                    "score": 1,
                    "created_utc": 1621474556.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Jokes apart. We need Naruto: Brotherhood",
            "author": "Clickbaiting_4_u",
            "id": "gyqro7b",
            "parent_id": "t1_gyqn0eu",
            "score": 5,
            "created_utc": 1621457600.0,
            "replies": [
                {
                    "body": "Go to r/Naruto. \n\nLook in the permanent tabs.\n\nlook at \"Naruto Kai\"\n\nFan made, but damn good job.",
                    "author": "i_Got_Rocks",
                    "id": "gyrmg42",
                    "parent_id": "t1_gyqro7b",
                    "score": 4,
                    "created_utc": 1621472066.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d say it’s the scene where Itachi massacres the Uchicha, I just rewatched the show and that scene must have replayed over 20 times",
            "author": "Nymphadorena",
            "id": "gyr4rm0",
            "parent_id": "t1_gyq9x5u",
            "score": 8,
            "created_utc": 1621463129.0,
            "replies": [
                {
                    "body": "Promise me one thing, look after sasuke, our suffering will be short compared to yours, youre truly a kind child 🙄🤮",
                    "author": "MyFingerPointeth",
                    "id": "gyrno60",
                    "parent_id": "t1_gyr4rm0",
                    "score": 1,
                    "created_utc": 1621472683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think Tenten's character was too limited, that's why she never developed like the rest, which lead to her being sacrificed in order to focus on more important characters, that's how I see it.",
            "author": "Ramiplease",
            "id": "gyqx4sd",
            "parent_id": "t1_gyqs7ps",
            "score": 9,
            "created_utc": 1621459595.0,
            "replies": [
                {
                    "body": "\"You need to have a traumatic childhood to become an important character in anime\"",
                    "author": "Clickbaiting_4_u",
                    "id": "gyzkug7",
                    "parent_id": "t1_gyqx4sd",
                    "score": 1,
                    "created_utc": 1621631780.0,
                    "replies": [
                        {
                            "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
                            "author": "Ramiplease",
                            "id": "gyzobpm",
                            "parent_id": "t1_gyzkug7",
                            "score": 1,
                            "created_utc": 1621633418.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So you should be blaming the writer. Not the character 🤣",
            "author": "regalfuzz",
            "id": "gyqpa2k",
            "parent_id": "t1_gyppsqb",
            "score": 9,
            "created_utc": 1621456678.0,
            "replies": [
                {
                    "body": "Tenten is a loser though. He didn't say anything about blame, this man is getting the hivemind treatment for saying something that is true. Not a polite thing to say about a character plenty of people here seem to like, sure, but still not untrue.",
                    "author": "MonsterStunter",
                    "id": "gyqs7hu",
                    "parent_id": "t1_gyqpa2k",
                    "score": 0,
                    "created_utc": 1621457781.0,
                    "replies": [
                        {
                            "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
                            "author": "regalfuzz",
                            "id": "gyqx12j",
                            "parent_id": "t1_gyqs7hu",
                            "score": 0,
                            "created_utc": 1621459549.0,
                            "replies": [
                                {
                                    "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                                    "author": "MonsterStunter",
                                    "id": "gyrcqi8",
                                    "parent_id": "t1_gyqx12j",
                                    "score": 1,
                                    "created_utc": 1621467149.0,
                                    "replies": [
                                        {
                                            "body": "Lmao",
                                            "author": "regalfuzz",
                                            "id": "gyrhncr",
                                            "parent_id": "t1_gyrcqi8",
                                            "score": 1,
                                            "created_utc": 1621469652.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                                    "author": "MonsterStunter",
                                                    "id": "gysy2u9",
                                                    "parent_id": "t1_gyrhncr",
                                                    "score": 1,
                                                    "created_utc": 1621503699.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lmao",
                                                            "author": "regalfuzz",
                                                            "id": "gyt3801",
                                                            "parent_id": "t1_gysy2u9",
                                                            "score": 1,
                                                            "created_utc": 1621508109.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What... dude",
                    "author": "Sonicmaster06",
                    "id": "gyqpeaa",
                    "parent_id": "t1_gyqpa2k",
                    "score": 2,
                    "created_utc": 1621456727.0,
                    "replies": []
                },
                {
                    "body": "Your brain is small",
                    "author": "Hermes_YSL",
                    "id": "gyv7ayq",
                    "parent_id": "t1_gyqpa2k",
                    "score": 1,
                    "created_utc": 1621542877.0,
                    "replies": [
                        {
                            "body": "I'm sure it is",
                            "author": "regalfuzz",
                            "id": "gyvyy08",
                            "parent_id": "t1_gyv7ayq",
                            "score": 1,
                            "created_utc": 1621556134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Boruto would be successful too if it had plot from the beginning instead of horseshit 160+ episodes. Like literally the other MC Kawaki was introduced after 190+ episodes!",
            "author": "Clickbaiting_4_u",
            "id": "gyqsv1c",
            "parent_id": "t1_gyqkpbl",
            "score": 15,
            "created_utc": 1621458005.0,
            "replies": []
        },
        {
            "body": "You can continue it. But you can't continue it in the same genre.\n\nShonen anime is about some charming kid that becomes amazing, but the real victory is about the friends they make along the way. And how over-powered they become along the way.\n\nBoruto shouldn't be a shonen, it's too stupid at this point. It should a Seinen. Dealing with more mature themes in darker manners, dropping much of the comedy and wakiness. Maybe Naruto dealing with the the death of Ninja's Way as the world grows peaceful, the same way Samurai had to redefine themselves--and many failing to do so in a proper way. \n\nMaybe dealing with father hood honestly, the work it takes to sustain a marriage in a busy life, and so on. \n\nMaybe not everyone of our Naruto heroes can have kids, or maybe not all of their kids are interested in Ninja destinies. One of Naruto kids doesn't want to do it at all--and then Hinata has a fight with Naruto about how she never wanted to follow her dad's family crap just because she was born into the wrong family--that could take a whole arc, leading to Naruto realizing his destiny is not the one meant for his kids. \n\nYou know...dealing with them growing, in new ways.",
            "author": "i_Got_Rocks",
            "id": "gyrncwr",
            "parent_id": "t1_gyqkpbl",
            "score": 14,
            "created_utc": 1621472523.0,
            "replies": [
                {
                    "body": "I agree actually I think switching the genre of the show would've been the only way it could have made sense along with scaling down some of the craziness, but that's too much of a risk for these giant corporations.",
                    "author": null,
                    "id": "gyrz4pm",
                    "parent_id": "t1_gyrncwr",
                    "score": 9,
                    "created_utc": 1621478470.0,
                    "replies": [
                        {
                            "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
                            "author": "HazyMirror",
                            "id": "gys91vs",
                            "parent_id": "t1_gyrz4pm",
                            "score": 5,
                            "created_utc": 1621483885.0,
                            "replies": [
                                {
                                    "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                                    "author": null,
                                    "id": "gysdtya",
                                    "parent_id": "t1_gys91vs",
                                    "score": 3,
                                    "created_utc": 1621486702.0,
                                    "replies": [
                                        {
                                            "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                                            "author": "HazyMirror",
                                            "id": "gysvkai",
                                            "parent_id": "t1_gysdtya",
                                            "score": 1,
                                            "created_utc": 1621501313.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you don't want filler just reas boruto Manga, the anime is intentionally more filler than the Manga.",
            "author": "locknloadstack",
            "id": "gyqor44",
            "parent_id": "t1_gyqlur0",
            "score": 2,
            "created_utc": 1621456454.0,
            "replies": [
                {
                    "body": "Don't you have to pay for reading the mangas?",
                    "author": "darknioss",
                    "id": "gyqqo7g",
                    "parent_id": "t1_gyqor44",
                    "score": 2,
                    "created_utc": 1621457260.0,
                    "replies": [
                        {
                            "body": "Lol",
                            "author": "locknloadstack",
                            "id": "gyqrvw1",
                            "parent_id": "t1_gyqqo7g",
                            "score": 9,
                            "created_utc": 1621457672.0,
                            "replies": []
                        },
                        {
                            "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
                            "author": "banishedpaladin",
                            "id": "gysktuk",
                            "parent_id": "t1_gyqqo7g",
                            "score": 2,
                            "created_utc": 1621491737.0,
                            "replies": []
                        },
                        {
                            "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
                            "author": "tamunti02",
                            "id": "gyrie81",
                            "parent_id": "t1_gyqqo7g",
                            "score": 1,
                            "created_utc": 1621470024.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The show follows the manga (no including the filler), so it's about the same thing. RIP Ten Ten character development.",
            "author": "i_Got_Rocks",
            "id": "gyrrdcf",
            "parent_id": "t1_gyro10p",
            "score": 1,
            "created_utc": 1621474556.0,
            "replies": []
        },
        {
            "body": "Go to r/Naruto. \n\nLook in the permanent tabs.\n\nlook at \"Naruto Kai\"\n\nFan made, but damn good job.",
            "author": "i_Got_Rocks",
            "id": "gyrmg42",
            "parent_id": "t1_gyqro7b",
            "score": 4,
            "created_utc": 1621472066.0,
            "replies": []
        },
        {
            "body": "Promise me one thing, look after sasuke, our suffering will be short compared to yours, youre truly a kind child 🙄🤮",
            "author": "MyFingerPointeth",
            "id": "gyrno60",
            "parent_id": "t1_gyr4rm0",
            "score": 1,
            "created_utc": 1621472683.0,
            "replies": []
        },
        {
            "body": "\"You need to have a traumatic childhood to become an important character in anime\"",
            "author": "Clickbaiting_4_u",
            "id": "gyzkug7",
            "parent_id": "t1_gyqx4sd",
            "score": 1,
            "created_utc": 1621631780.0,
            "replies": [
                {
                    "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
                    "author": "Ramiplease",
                    "id": "gyzobpm",
                    "parent_id": "t1_gyzkug7",
                    "score": 1,
                    "created_utc": 1621633418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tenten is a loser though. He didn't say anything about blame, this man is getting the hivemind treatment for saying something that is true. Not a polite thing to say about a character plenty of people here seem to like, sure, but still not untrue.",
            "author": "MonsterStunter",
            "id": "gyqs7hu",
            "parent_id": "t1_gyqpa2k",
            "score": 0,
            "created_utc": 1621457781.0,
            "replies": [
                {
                    "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
                    "author": "regalfuzz",
                    "id": "gyqx12j",
                    "parent_id": "t1_gyqs7hu",
                    "score": 0,
                    "created_utc": 1621459549.0,
                    "replies": [
                        {
                            "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                            "author": "MonsterStunter",
                            "id": "gyrcqi8",
                            "parent_id": "t1_gyqx12j",
                            "score": 1,
                            "created_utc": 1621467149.0,
                            "replies": [
                                {
                                    "body": "Lmao",
                                    "author": "regalfuzz",
                                    "id": "gyrhncr",
                                    "parent_id": "t1_gyrcqi8",
                                    "score": 1,
                                    "created_utc": 1621469652.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                            "author": "MonsterStunter",
                                            "id": "gysy2u9",
                                            "parent_id": "t1_gyrhncr",
                                            "score": 1,
                                            "created_utc": 1621503699.0,
                                            "replies": [
                                                {
                                                    "body": "Lmao",
                                                    "author": "regalfuzz",
                                                    "id": "gyt3801",
                                                    "parent_id": "t1_gysy2u9",
                                                    "score": 1,
                                                    "created_utc": 1621508109.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What... dude",
            "author": "Sonicmaster06",
            "id": "gyqpeaa",
            "parent_id": "t1_gyqpa2k",
            "score": 2,
            "created_utc": 1621456727.0,
            "replies": []
        },
        {
            "body": "Your brain is small",
            "author": "Hermes_YSL",
            "id": "gyv7ayq",
            "parent_id": "t1_gyqpa2k",
            "score": 1,
            "created_utc": 1621542877.0,
            "replies": [
                {
                    "body": "I'm sure it is",
                    "author": "regalfuzz",
                    "id": "gyvyy08",
                    "parent_id": "t1_gyv7ayq",
                    "score": 1,
                    "created_utc": 1621556134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree actually I think switching the genre of the show would've been the only way it could have made sense along with scaling down some of the craziness, but that's too much of a risk for these giant corporations.",
            "author": null,
            "id": "gyrz4pm",
            "parent_id": "t1_gyrncwr",
            "score": 9,
            "created_utc": 1621478470.0,
            "replies": [
                {
                    "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
                    "author": "HazyMirror",
                    "id": "gys91vs",
                    "parent_id": "t1_gyrz4pm",
                    "score": 5,
                    "created_utc": 1621483885.0,
                    "replies": [
                        {
                            "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                            "author": null,
                            "id": "gysdtya",
                            "parent_id": "t1_gys91vs",
                            "score": 3,
                            "created_utc": 1621486702.0,
                            "replies": [
                                {
                                    "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                                    "author": "HazyMirror",
                                    "id": "gysvkai",
                                    "parent_id": "t1_gysdtya",
                                    "score": 1,
                                    "created_utc": 1621501313.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't you have to pay for reading the mangas?",
            "author": "darknioss",
            "id": "gyqqo7g",
            "parent_id": "t1_gyqor44",
            "score": 2,
            "created_utc": 1621457260.0,
            "replies": [
                {
                    "body": "Lol",
                    "author": "locknloadstack",
                    "id": "gyqrvw1",
                    "parent_id": "t1_gyqqo7g",
                    "score": 9,
                    "created_utc": 1621457672.0,
                    "replies": []
                },
                {
                    "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
                    "author": "banishedpaladin",
                    "id": "gysktuk",
                    "parent_id": "t1_gyqqo7g",
                    "score": 2,
                    "created_utc": 1621491737.0,
                    "replies": []
                },
                {
                    "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
                    "author": "tamunti02",
                    "id": "gyrie81",
                    "parent_id": "t1_gyqqo7g",
                    "score": 1,
                    "created_utc": 1621470024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not every important character has a traumatic childhood; When you say a character is \"important\", you mean it has an important role and influence in the story, however, whether a character is \"intriguing\" or not is entirely up to your opinion; Some people find traumatized characters more interesting lol.",
            "author": "Ramiplease",
            "id": "gyzobpm",
            "parent_id": "t1_gyzkug7",
            "score": 1,
            "created_utc": 1621633418.0,
            "replies": []
        },
        {
            "body": "He said \"this is exactly why\" to the guy who responded \"the writing made her so.\" Hence placing the blame on the writer. People who blame fake characters for shit writing are weird.",
            "author": "regalfuzz",
            "id": "gyqx12j",
            "parent_id": "t1_gyqs7hu",
            "score": 0,
            "created_utc": 1621459549.0,
            "replies": [
                {
                    "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
                    "author": "MonsterStunter",
                    "id": "gyrcqi8",
                    "parent_id": "t1_gyqx12j",
                    "score": 1,
                    "created_utc": 1621467149.0,
                    "replies": [
                        {
                            "body": "Lmao",
                            "author": "regalfuzz",
                            "id": "gyrhncr",
                            "parent_id": "t1_gyrcqi8",
                            "score": 1,
                            "created_utc": 1621469652.0,
                            "replies": [
                                {
                                    "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                                    "author": "MonsterStunter",
                                    "id": "gysy2u9",
                                    "parent_id": "t1_gyrhncr",
                                    "score": 1,
                                    "created_utc": 1621503699.0,
                                    "replies": [
                                        {
                                            "body": "Lmao",
                                            "author": "regalfuzz",
                                            "id": "gyt3801",
                                            "parent_id": "t1_gysy2u9",
                                            "score": 1,
                                            "created_utc": 1621508109.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sure it is",
            "author": "regalfuzz",
            "id": "gyvyy08",
            "parent_id": "t1_gyv7ayq",
            "score": 1,
            "created_utc": 1621556134.0,
            "replies": []
        },
        {
            "body": "It coulda been one of those shows where action scenes only happen once in a blue moon. Like idk if you've seen kobayashi's dragon maid, but every time there's an action sequence it's badass lol. Boruto coulda been something like that.",
            "author": "HazyMirror",
            "id": "gys91vs",
            "parent_id": "t1_gyrz4pm",
            "score": 5,
            "created_utc": 1621483885.0,
            "replies": [
                {
                    "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
                    "author": null,
                    "id": "gysdtya",
                    "parent_id": "t1_gys91vs",
                    "score": 3,
                    "created_utc": 1621486702.0,
                    "replies": [
                        {
                            "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                            "author": "HazyMirror",
                            "id": "gysvkai",
                            "parent_id": "t1_gysdtya",
                            "score": 1,
                            "created_utc": 1621501313.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol",
            "author": "locknloadstack",
            "id": "gyqrvw1",
            "parent_id": "t1_gyqqo7g",
            "score": 9,
            "created_utc": 1621457672.0,
            "replies": []
        },
        {
            "body": "If I’m correct (please someone correct me if not) a Shonen jump subscription is 2 dollars a month and the most recent 3 issues are  available for free without subscription, meaning you could pay 2 dollars to spend a month catching up and then continue reading for free indefinitely",
            "author": "banishedpaladin",
            "id": "gysktuk",
            "parent_id": "t1_gyqqo7g",
            "score": 2,
            "created_utc": 1621491737.0,
            "replies": []
        },
        {
            "body": "There are sites you can read the for free the same way there are sites you can watch the anime for free. I don't know of any specifically since I dont read manga but they're definitely there",
            "author": "tamunti02",
            "id": "gyrie81",
            "parent_id": "t1_gyqqo7g",
            "score": 1,
            "created_utc": 1621470024.0,
            "replies": []
        },
        {
            "body": "Right but he's not gonna say 'Kishimoto sucks.' is he? Yes he wrote a story where some, arguably many, characters didn't get enough focus. That's his fault. One of them is Tenten. As a result, she ends up being a pretty underwhelming character.",
            "author": "MonsterStunter",
            "id": "gyrcqi8",
            "parent_id": "t1_gyqx12j",
            "score": 1,
            "created_utc": 1621467149.0,
            "replies": [
                {
                    "body": "Lmao",
                    "author": "regalfuzz",
                    "id": "gyrhncr",
                    "parent_id": "t1_gyrcqi8",
                    "score": 1,
                    "created_utc": 1621469652.0,
                    "replies": [
                        {
                            "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                            "author": "MonsterStunter",
                            "id": "gysy2u9",
                            "parent_id": "t1_gyrhncr",
                            "score": 1,
                            "created_utc": 1621503699.0,
                            "replies": [
                                {
                                    "body": "Lmao",
                                    "author": "regalfuzz",
                                    "id": "gyt3801",
                                    "parent_id": "t1_gysy2u9",
                                    "score": 1,
                                    "created_utc": 1621508109.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's a Baader–Meinhof moment because I was just watching that show, but yes I know what that is and I know exactly what you mean. If a story that doesn't need a sequel for some reason gets one then what it should do is be an evolution, it shouldn't be the same shit repackaged. If that means lowering the action, so be it as long as it's actually interesting. I will applaud the sheer amount of Sakuga boruto gets sometimes though.",
            "author": null,
            "id": "gysdtya",
            "parent_id": "t1_gys91vs",
            "score": 3,
            "created_utc": 1621486702.0,
            "replies": [
                {
                    "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
                    "author": "HazyMirror",
                    "id": "gysvkai",
                    "parent_id": "t1_gysdtya",
                    "score": 1,
                    "created_utc": 1621501313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao",
            "author": "regalfuzz",
            "id": "gyrhncr",
            "parent_id": "t1_gyrcqi8",
            "score": 1,
            "created_utc": 1621469652.0,
            "replies": [
                {
                    "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
                    "author": "MonsterStunter",
                    "id": "gysy2u9",
                    "parent_id": "t1_gyrhncr",
                    "score": 1,
                    "created_utc": 1621503699.0,
                    "replies": [
                        {
                            "body": "Lmao",
                            "author": "regalfuzz",
                            "id": "gyt3801",
                            "parent_id": "t1_gysy2u9",
                            "score": 1,
                            "created_utc": 1621508109.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ep 65 is has the best fight scene of the franchise imo. But those moments don't happen enough. I need to catch up though since shit is starting to pick up. I've already been spoiled bc of stupid memes on instagram so it's kinda hard to give a shit lol",
            "author": "HazyMirror",
            "id": "gysvkai",
            "parent_id": "t1_gysdtya",
            "score": 1,
            "created_utc": 1621501313.0,
            "replies": []
        },
        {
            "body": "Yeah I tried to respond to your line of argument but now you see how laughable it really is.",
            "author": "MonsterStunter",
            "id": "gysy2u9",
            "parent_id": "t1_gyrhncr",
            "score": 1,
            "created_utc": 1621503699.0,
            "replies": [
                {
                    "body": "Lmao",
                    "author": "regalfuzz",
                    "id": "gyt3801",
                    "parent_id": "t1_gysy2u9",
                    "score": 1,
                    "created_utc": 1621508109.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao",
            "author": "regalfuzz",
            "id": "gyt3801",
            "parent_id": "t1_gysy2u9",
            "score": 1,
            "created_utc": 1621508109.0,
            "replies": []
        }
    ]
}