{
    "title": "Yearly allowance up front",
    "post_id": "10ee3qa",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10ee3qa/yearly_allowance_up_front/",
    "author": "Fair_Carrot_5591",
    "body": "Throw away cus idr the login for my main sugar acct.\n\nTLDR; getting my allowance for 2023 paid in full upfront.\n\nDon't know how I got here, but after going through an earth shaking heartbreak I started sugaring again in August. In October I met my SBF.\nHe's been so kind and caring and sweet, he just gave me a generous allowance every time I came over for PPM, we never discussed any hard details of an arrangement until this past Saturday.\n\nHe recently retired, put most of it away, but budgeted a certain amount for a certain amount of years. He also did not just have my PPM out waiting like it usually was. \nI wanted to try and budget too, so I breached the subject of arrangement details. \n\nHe was a little uncomfortable, and the conversation was definitely uncomfortable, but Jesus christ \nMy SBF decided the best way for us to proceed is if he gives me my allowance upfront for the entire year. \n\nI got the first portion of it on Saturday. \n11x my PPM in hand in one night.\n\nHoly shit 😳 \nI am still finding it hard to believe this is happening. \nIt honestly changes my life already. \nI'm sure this is a wildly ridiculous situation for a SR, and I couldn't find any posts about an upfront yearly allowance, so I had to document that I am receiving my allowance yearly. Most men think the SB would leave, and most SBs probably would.\nI'm not going anywhere. No one has ever cooked for me before and this man has cooked for me from scratch multiple times and remembers my dietary constraints, is a phenomenal mentor, and has a big ol dick that still works!👌👍\n\nIt is possible to receive a yearly allowance, but I sure as SHIT did not ask for it, and I have come 🤏 to telling him \"I love you\" plenty of times before this past weekend. \n\nSafe to say I am a very lucky baby. \nWe have a SBF(68M)/SGF(28F) dynamic, I spend a weekend at his place once or twice a month, have been on a couple little road trips, one overnight trip, and have 2 larger trips with airfare scheduled. \nI can't believe someone has been so kind to me, that they think I'm worth something like this. \n\nHe always says he wishes we met a long time ago (like physically impossible lol like both in our 30s) and fuck I wish we did too. \n\nI think I love him.\nThank you universe.\nThank you guys for reading.\n\nGood luck and if I don't see you,\nGood afternoon, good morning, and goodnight 🍭\n\nEdit : I got my first reddit award! And on a throw away sugar account! Woohoo! 🥹🤣 Thanks!!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10ee3qa/yearly_allowance_up_front/",
    "score": 174,
    "upvote_ratio": 0.93,
    "created_utc": 1673967044.0,
    "num_comments": 102,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Awww I love this so much! My SD paid my rent for the year last week and he gave me my own cc so I don’t have to ask him for xyz. So not quite money in hand but similar sentiment for me. I felt the same as you did: Very lucky, very empowered, very grateful, very happy.",
            "author": null,
            "id": "j4qasyd",
            "parent_id": "t3_10ee3qa",
            "score": 74,
            "created_utc": 1673967439.0,
            "replies": [
                {
                    "body": "Dreams really do come true, girl! 🏰 \nYear of rent paid, feels so fucking secure!! Cheers to being lucky babies 🥰🥂",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qbo0d",
                    "parent_id": "t1_j4qasyd",
                    "score": 32,
                    "created_utc": 1673967805.0,
                    "replies": []
                },
                {
                    "body": "Did you guys talk about a spending limit? Like you could spend 5k a week on a credit card if you wanted to.",
                    "author": "Pastakingfifth",
                    "id": "j4qrb88",
                    "parent_id": "t1_j4qasyd",
                    "score": 7,
                    "created_utc": 1673973990.0,
                    "replies": [
                        {
                            "body": "My SB (25F, 3 yrs together) has a credit card and debit card in her name. We don’t have a spending limit but I did tell her if she charged a car or something too expensive without checking with me she’d probably lose me. Only twice have I’ve asked her to slow down on spending (Christmas and when decorating her apartment). She uses the cards for basic shopping and expenses. On top of this I give her money for her savings. I tell her I want her to feel the luxury lifestyle of being able to buy or do what you want (within reason). I also encourage her to take her friends out and treat them periodically. \n\nWhen it comes to jewelry or handbags, she usually lets me get those as gifts. \n\nI figure all this is still cheaper than having a wife 🤣",
                            "author": "NewPhoneWhoDis_916",
                            "id": "j4shshd",
                            "parent_id": "t1_j4qrb88",
                            "score": 30,
                            "created_utc": 1673997258.0,
                            "replies": []
                        },
                        {
                            "body": "I would recommend that you get clarity on any limits.   My last sb had one of my cards and for the first few months was reasonable with her expenditure.    The last month - when it was clear we were not going to be able to continue - she just went shopping and shopping and shopping.   Almost blew the - very high - limit.   I’d not put any limits out but I felt she went too far.   I’m the end I told her that she bought her own Christmas present.    So even though I had not put a limit on - she did go a bit too far.    I still like her and would be there for her but I’d sure be a lot more clear in  the future.",
                            "author": "brit-sd",
                            "id": "j4temv3",
                            "parent_id": "t1_j4qrb88",
                            "score": 13,
                            "created_utc": 1674011058.0,
                            "replies": [
                                {
                                    "body": "Mine has black and platinum credit cards on my account so she can do the weekly shopping, buy clothes etc and go out with friends.   The arrangement though is I am there to look after her not her friends so if she goes out with them she has to go to places they can afford, not places they can’t paid for by me.    The second thing is she has them as long as she is responsible with them and if she misuses them they go.  She’s had them for a number of years now and so far I’ve never had a reason for concern.  We do have a bit of fun with them though for example if we go out for a good meal and everyone is thinking SR, she takes the check being offered to me (with a loudish “Let me get this” to me) and pulls out her black card to pay.  You can see the WTF look on the faces of the waiter and those seated near us 😂.  She loves that and also that she can go into a store in her own right and buy something, not be seen as an SB having stuff bought for her.\n\nOn this particular case though my only advice to the OP is put the money somewhere separate and budget it throughout the year or you will likely find it all gone by 6 months or less.   And then you will be effectively back to not having a monthly allowance and needing to ask for more or move on to live.   But it sounds like the OP is a good responsible person who will not abuse the trust placed in her as it is with my SB.  And that means a lot to me because it means she’s not just here for the money.",
                                    "author": "Dazzling_Truth6472",
                                    "id": "j4uj1hd",
                                    "parent_id": "t1_j4temv3",
                                    "score": 12,
                                    "created_utc": 1674037211.0,
                                    "replies": [
                                        {
                                            "body": "Omg spoiled goals",
                                            "author": "Maleficent_SB",
                                            "id": "j4vsp9x",
                                            "parent_id": "t1_j4uj1hd",
                                            "score": 3,
                                            "created_utc": 1674060141.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "My SB also loves to pick up the check and, not surprisingly, likes to tip generously 😂",
                                            "author": "NewPhoneWhoDis_916",
                                            "id": "j5bhh8j",
                                            "parent_id": "t1_j4uj1hd",
                                            "score": 3,
                                            "created_utc": 1674331767.0,
                                            "replies": [
                                                {
                                                    "body": "Mine is always telling me how much money she’s “saved” me 🤣",
                                                    "author": "Dazzling_Truth6472",
                                                    "id": "j69c22s",
                                                    "parent_id": "t1_j5bhh8j",
                                                    "score": 2,
                                                    "created_utc": 1674928966.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j4qu42s",
                            "parent_id": "t1_j4qrb88",
                            "score": 7,
                            "created_utc": 1673975045.0,
                            "replies": [
                                {
                                    "body": "Can I ask how old you are and if you consider yourself way more attractive than most SBs or is this a lucky arrangement?",
                                    "author": "Pastakingfifth",
                                    "id": "j4qv940",
                                    "parent_id": "t1_j4qu42s",
                                    "score": 5,
                                    "created_utc": 1673975472.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j4qx9ef",
                                            "parent_id": "t1_j4qv940",
                                            "score": 8,
                                            "created_utc": 1673976209.0,
                                            "replies": [
                                                {
                                                    "body": "Fascinating, thank you for sharing!",
                                                    "author": "Pastakingfifth",
                                                    "id": "j4qylql",
                                                    "parent_id": "t1_j4qx9ef",
                                                    "score": 2,
                                                    "created_utc": 1673976697.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "See, this is what I mean when I want to feel taken care of… idc about no money in hand, I want to just live without stressing tf about bills or rent every month 😂 I’d never leave!",
                    "author": "TheMaryJShow",
                    "id": "j6fmm0z",
                    "parent_id": "t1_j4qasyd",
                    "score": 3,
                    "created_utc": 1675037323.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There is a trust that has been fostered here that is amazing.",
            "author": "CaffineandGasoline",
            "id": "j4qgfjx",
            "parent_id": "t3_10ee3qa",
            "score": 16,
            "created_utc": 1673969753.0,
            "replies": []
        },
        {
            "body": "Thats an amazing story, hope you two are happy for a long time!",
            "author": "YourBadDecision",
            "id": "j4qchdl",
            "parent_id": "t3_10ee3qa",
            "score": 14,
            "created_utc": 1673968145.0,
            "replies": []
        },
        {
            "body": "What a wonderful gesture to someone who probably deserves it.  \n\nMy only caution is to be exceptionally careful to not take advantage of the situation. \n\nOver the past decade I have had some wonderful SBs when we were on a PPM basis and then I arranged for them to receive funds on a monthly basis automatically.  Also pledged security for one SBs car loan (by doing this her credit would be improved  vs  me cosigning on the loan) \n\nA couple worked out very well and two of what were the best went downhill with cancellations .",
            "author": "pinotandsugar",
            "id": "j4s2tsc",
            "parent_id": "t3_10ee3qa",
            "score": 11,
            "created_utc": 1673991453.0,
            "replies": [
                {
                    "body": "Hey, what does it mean to pledge security on a car loan vs. co-signing?",
                    "author": "TheMaryJShow",
                    "id": "j6fmp2f",
                    "parent_id": "t1_j4s2tsc",
                    "score": 1,
                    "created_utc": 1675037358.0,
                    "replies": [
                        {
                            "body": "Simplistically \n\nCosign -  the person cosigning is responsible for the loan.  Also as I understand it having a cosigner means that the primary person does not get the full benefit on their credit rating .  Also the cosigner is responsible for the full amount including interest and penalties. \n\nPledged Security - The lender  can go after the security pledged but not the person allowing the property to be pledged.  The borrower receives the credit rating boost from having paid the loan.",
                            "author": "pinotandsugar",
                            "id": "j6gkcbo",
                            "parent_id": "t1_j6fmp2f",
                            "score": 1,
                            "created_utc": 1675051414.0,
                            "replies": [
                                {
                                    "body": "I’ve never heard of that before! Thank you for sharing.",
                                    "author": "TheMaryJShow",
                                    "id": "j6i4sfs",
                                    "parent_id": "t1_j6gkcbo",
                                    "score": 2,
                                    "created_utc": 1675089160.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is what a real SR is about.  \n\nA man using his money to elevate you and provide security vs control and incentivize.\n\nI'm soo happy for you!!",
            "author": "Temporary-Dwelling",
            "id": "j4quy7h",
            "parent_id": "t3_10ee3qa",
            "score": 34,
            "created_utc": 1673975360.0,
            "replies": [
                {
                    "body": "Thank you 😄",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qv4op",
                    "parent_id": "t1_j4quy7h",
                    "score": 6,
                    "created_utc": 1673975426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Despite 1 in 300 Million odds, we constantly hear stories about people winning Mega Millions and Powerball",
            "author": "xanfiles",
            "id": "j4rd76h",
            "parent_id": "t3_10ee3qa",
            "score": 20,
            "created_utc": 1673982004.0,
            "replies": []
        },
        {
            "body": "You may think you've been lucky. I on the other hand am a strong believer in cause and effect.\n\nHe trusts you\n\nHe wants you to stick around.\n\nHe enjoys how he feels.\n\nThe cause; YOU, mainly but with a sprinkling of luck.",
            "author": "LondonSugarDaddy",
            "id": "j4qvh4x",
            "parent_id": "t3_10ee3qa",
            "score": 14,
            "created_utc": 1673975554.0,
            "replies": [
                {
                    "body": "I thought this was gonna be a mean comment at first, but it was so nice 🥹 Thank you so much!!!",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qvq4p",
                    "parent_id": "t1_j4qvh4x",
                    "score": 10,
                    "created_utc": 1673975647.0,
                    "replies": [
                        {
                            "body": "You are welcome.\n\nIf we assume he is sane and not as high as a kite....you've got to be one hell of a SB.\n\nPlease, please tell me you did not charge him a M&G fee?",
                            "author": "LondonSugarDaddy",
                            "id": "j4qyql8",
                            "parent_id": "t1_j4qvq4p",
                            "score": 2,
                            "created_utc": 1673976748.0,
                            "replies": [
                                {
                                    "body": "Absolutely not!\nWe had a great M&G and he INSISTED I take half of what the full PPM became when he was giving me PPM. \nAlmost 5x as much as any gift I have ever received on a M&G.\nA good SB should never ask for anything! In any kind of SR I want, I don't want to have to ask for things. A good SD just gives if he wants to, no need to ask.\n\nI never ask for anything, the discussion about moving to monthly was the only time I've asked for something, and wowza did I receive 🥹❤️\nOne thing this accomplishes,\nI can text him and invite myself over and stuff.... like I just did for tonight. \nThere's no expectations for anything and it feels more and more like a vanilla relationship now (apart from the daddy issues kink 🤭🤣).\n\nI'm living in the twilight zone, in a good way.",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j4r1b2l",
                                    "parent_id": "t1_j4qyql8",
                                    "score": 11,
                                    "created_utc": 1673977679.0,
                                    "replies": [
                                        {
                                            "body": "There you go, another reason why he trusts you. Don't let him down, it's going be hard to keep motivated.  \n\nThink about ways you could do that, e.g transfer money from one high interest account (monthly allowance) to another at the first of each month (assuming you are saving for a business).  Good luck!",
                                            "author": "LondonSugarDaddy",
                                            "id": "j4v2ta9",
                                            "parent_id": "t1_j4r1b2l",
                                            "score": 2,
                                            "created_utc": 1674049619.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very happy for you! Enjoy your wonderful SR.\n\nI hope all the newbie hopeful SB's realize how exceedingly rare this might be and don't try and insist this is the \"norm\", though.",
            "author": "mraspencer",
            "id": "j4qrpes",
            "parent_id": "t3_10ee3qa",
            "score": 11,
            "created_utc": 1673974140.0,
            "replies": [
                {
                    "body": "Me too. This is deff far from the norm, it is a fairytale dream that I never knew I had, that just magically came true. \nI'm really fucking grateful and so mf lucky!!!!!!!!! Good lord I'm lucky 💕",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qt7j0",
                    "parent_id": "t1_j4qrpes",
                    "score": 12,
                    "created_utc": 1673974704.0,
                    "replies": [
                        {
                            "body": "Hold onto that feeling. There's a risk with spoiling someone at that level very quickly. My experience is that only a small number of people can deal with it well. I've had really good relationships end because attitudes change if the spoiling is too much too fast. And congrats! You seem like someone that can deal with this",
                            "author": "sabordeazucar",
                            "id": "j4r5owf",
                            "parent_id": "t1_j4qt7j0",
                            "score": 5,
                            "created_utc": 1673979279.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "j4qvi04",
                    "parent_id": "t1_j4qrpes",
                    "score": 7,
                    "created_utc": 1673975564.0,
                    "replies": [
                        {
                            "body": "This. Before SA the sugar bowl was very small and everyone met IRL. There wasn't any PPM and allowances were much higher but not exactly monthly. You simply cared for your SB so that she didn't have to worry about anything. How much that cost was flexible. SA changed everything",
                            "author": "sabordeazucar",
                            "id": "j4qyfy6",
                            "parent_id": "t1_j4qvi04",
                            "score": 12,
                            "created_utc": 1673976638.0,
                            "replies": [
                                {
                                    "body": "There has been a commodifying of pretty much every online space.  It is sad.  Tumblr used to be this creative space, instagram too, even FB was cool in it's heyday.  Now it's some desperate elevator pitch from some sad stranger or old acquaintance trying to get you to buy into their mlm scheme.\n\nI think sugar is the same.  It used to be an elite club with certain unspoken norms.  Now it's the exact opposite.  The last time I used SA it was mostly middle income guys using deceit to buy sex and women just trying to survive.",
                                    "author": "Temporary-Dwelling",
                                    "id": "j4r7g6l",
                                    "parent_id": "t1_j4qyfy6",
                                    "score": 4,
                                    "created_utc": 1673979912.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "yet that $10k per month isn't going to be handed out at $120k on January 1st.",
                            "author": "mraspencer",
                            "id": "j4qyvwn",
                            "parent_id": "t1_j4qvi04",
                            "score": 3,
                            "created_utc": 1673976802.0,
                            "replies": [
                                {
                                    "body": "I have to agree that's unusual. He's already given her a credit card that he pays off. He could give her a debit card with a high daily limit and the same amount of yearly allowance in it. That's worked really well for me. But it's his money if he wants to spoil her that way\n\nHe's going to have to deal with the tax consequences since it's a gift over the yearly limit and he's older and most likely well over the lifetime exclusion amount. And of course his children or other people he has in his estate plan could cause an issue. While the OP will have her perspective his family may see things very differently",
                                    "author": "sabordeazucar",
                                    "id": "j4r54xi",
                                    "parent_id": "t1_j4qyvwn",
                                    "score": 7,
                                    "created_utc": 1673979075.0,
                                    "replies": [
                                        {
                                            "body": "You can give a way $12,000,000 during your life as gifts. don't believe me ask a professional.",
                                            "author": "4rtknox",
                                            "id": "j4svesa",
                                            "parent_id": "t1_j4r54xi",
                                            "score": 0,
                                            "created_utc": 1674002872.0,
                                            "replies": [
                                                {
                                                    "body": "That was the lifetime exclusion I was referencing. It's scheduled to sunset in 2025 so it'll be cut in half. I was assuming that someone wealthy enough to spoil the OP has a net worth over that amount. So what happens is he can give up to that amount away while he's alive, report it to the IRS each year, and deduct it from his lifetime exclusion. When he passes away only what's left of the exclusion is tax free. So you're correct that he won't be paying gift taxes most likely during his life (unless he's already given away his lifetime exclusion) but his estate will eventually pay that tax if his net worth is over the lifetime exclusion amount (12/6 million). The sunsetting of this is a big deal for UHNW estates",
                                                    "author": "sabordeazucar",
                                                    "id": "j4t430r",
                                                    "parent_id": "t1_j4svesa",
                                                    "score": 5,
                                                    "created_utc": 1674006546.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks, this is a big deal",
                                                            "author": "4rtknox",
                                                            "id": "j4t6vh3",
                                                            "parent_id": "t1_j4t430r",
                                                            "score": 2,
                                                            "created_utc": 1674007715.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It wasn't uncommon for SD's to give lump sums.\n\nMine suggested exactly this to ensure enthusiastic consent.  I was totally covered for the school year, tuition, rent, living expenses.  Then I got an allowance each month for fun, savings, investments.\n\nHe wanted me to want him, to be there because I wanted to be, to demonstrate I could trust him and to unskew some of the power dynamic so I would feel safe.",
                                    "author": "Temporary-Dwelling",
                                    "id": "j4r62yl",
                                    "parent_id": "t1_j4qyvwn",
                                    "score": 7,
                                    "created_utc": 1673979420.0,
                                    "replies": [
                                        {
                                            "body": "Sounds amazing! Whenabouts did this take place? Guessing not within the past couple of years?",
                                            "author": "uptiedand8",
                                            "id": "j4rc4r9",
                                            "parent_id": "t1_j4r62yl",
                                            "score": 2,
                                            "created_utc": 1673981615.0,
                                            "replies": [
                                                {
                                                    "body": "More than 5 years ago but less than 10.\n\nOnline sugar has entered it's crumbling late stage capitalism period.\n\nAs more and more desirable SB exit the bowl for better opportunities perhaps something better will emerge.",
                                                    "author": "Temporary-Dwelling",
                                                    "id": "j4redr0",
                                                    "parent_id": "t1_j4rc4r9",
                                                    "score": 4,
                                                    "created_utc": 1673982445.0,
                                                    "replies": [
                                                        {
                                                            "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
                                                            "author": "uptiedand8",
                                                            "id": "j4riae1",
                                                            "parent_id": "t1_j4redr0",
                                                            "score": 3,
                                                            "created_utc": 1673983891.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                                                                    "author": "Insatiable_Learner",
                                                                    "id": "j4trzlu",
                                                                    "parent_id": "t1_j4riae1",
                                                                    "score": 3,
                                                                    "created_utc": 1674017548.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                                                                    "author": "SDstartingOut",
                                                                    "id": "j4x06nt",
                                                                    "parent_id": "t1_j4riae1",
                                                                    "score": 1,
                                                                    "created_utc": 1674076127.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Enjoy it until he gets committed by his family or his Psych drugs run out. \n\nCynical I know. Be sure that you get budgeting help if you are not good at that. You know how lottery winners end up, even with millions. Broke.",
            "author": "GSSD",
            "id": "j4qgac1",
            "parent_id": "t3_10ee3qa",
            "score": 14,
            "created_utc": 1673969696.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j4qlpyh",
                    "parent_id": "t1_j4qgac1",
                    "score": 12,
                    "created_utc": 1673971821.0,
                    "replies": [
                        {
                            "body": "Not a  necessary scenario. I brought a lady to meet my family who was the same age as my granddaughter. My family was very supportive. There comment to a person was if she makes you happy, we are happy.",
                            "author": "AFSMSgt",
                            "id": "j4rsmsy",
                            "parent_id": "t1_j4qlpyh",
                            "score": 7,
                            "created_utc": 1673987706.0,
                            "replies": [
                                {
                                    "body": "I'm glad your family received her well... I hope to be so lucky!! Thank you for the hope!",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j4rsswc",
                                    "parent_id": "t1_j4rsmsy",
                                    "score": 2,
                                    "created_utc": 1673987768.0,
                                    "replies": [
                                        {
                                            "body": "There are a lot of people with no family to leave it to. I know several and that's just me.",
                                            "author": "4rtknox",
                                            "id": "j4sw1rh",
                                            "parent_id": "t1_j4rsswc",
                                            "score": 2,
                                            "created_utc": 1674003142.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Update us if this situation comes up because if there's one thing I know about women it's that they hate it when other women get to spend the money they feel like they're entitled to. \n\nIMO I agree that in this situation no matter how nice she is she's gonna flip the fuck out of you and take you to court to make it seem like you're a predator taking advantage of her confused father.",
                            "author": "Pastakingfifth",
                            "id": "j4qrpqz",
                            "parent_id": "t1_j4qlpyh",
                            "score": 9,
                            "created_utc": 1673974144.0,
                            "replies": [
                                {
                                    "body": "He most likely is a very active, almost 70 year old. I'm sure he's not anywhere near senility. OP says he JUST retired.",
                                    "author": "DarkEyes87",
                                    "id": "j4qt91d",
                                    "parent_id": "t1_j4qrpqz",
                                    "score": 8,
                                    "created_utc": 1673974720.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j4qtsia",
                                    "parent_id": "t1_j4qrpqz",
                                    "score": 5,
                                    "created_utc": 1673974924.0,
                                    "replies": [
                                        {
                                            "body": "> He is fully sound and competent. He signed trust documents during this time for her and her family too, so if his decisions made about me are not of sound mind, his decisions elsewhere can't be trusted to be of sound mind, stands to reason. 🤷‍♀️\n\nI would make sure that he has communicated that to them and that you have legal proof of this. The truth will not matter when his entitled family members with the money to sue you take you to court.",
                                            "author": "Pastakingfifth",
                                            "id": "j4qv0o4",
                                            "parent_id": "t1_j4qtsia",
                                            "score": 7,
                                            "created_utc": 1673975385.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I hope this is nowhere near the truth for OPs sake. 🙏 that said, there is sage advice in this perspective. \n\nOP be smart with your sudden windfall! Pay off all your debts. Set aside money somewhere for a rainy day. Seek investment advice from someone who is not related or involved.\n\nResist resist resist the temptation to spend spend spend. It is powerful when you come into money suddenly. u/GSSD is not wrong about lottery winners. I personally know multiple people who blew thru 100s of thousands in a short period of time because they didn’t have financial wisdom or willpower.",
                    "author": "P0sitiveViibes777",
                    "id": "j4qj2fz",
                    "parent_id": "t1_j4qgac1",
                    "score": 15,
                    "created_utc": 1673970779.0,
                    "replies": [
                        {
                            "body": "Thanks guys!\nNo worries here, I am somewhat financially literate, and as a result I actually don't have debts to pay off. 😅 \nJust saving for now until I figure out another business to start. 👍",
                            "author": "Fair_Carrot_5591",
                            "id": "j4qknqx",
                            "parent_id": "t1_j4qj2fz",
                            "score": 14,
                            "created_utc": 1673971401.0,
                            "replies": [
                                {
                                    "body": "💗💗💗",
                                    "author": "P0sitiveViibes777",
                                    "id": "j4qmso7",
                                    "parent_id": "t1_j4qknqx",
                                    "score": 5,
                                    "created_utc": 1673972247.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I agree.",
                            "author": "4rtknox",
                            "id": "j4swbz8",
                            "parent_id": "t1_j4qj2fz",
                            "score": 1,
                            "created_utc": 1674003260.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really puts things in perspective when you hear of men complaining/scrounging about single basic ass 1/4 payments and getting flustered about giving a gift at MG and asking women out on coffee dates like vanilla.",
            "author": "DarkEyes87",
            "id": "j4qftau",
            "parent_id": "t3_10ee3qa",
            "score": 11,
            "created_utc": 1673969502.0,
            "replies": [
                {
                    "body": "I mean also depends on what kind of SD you're going after too. This guy is 68 and retired, that kind of money is harder to swing for a 40-60-year-old working dude.",
                    "author": "Pastakingfifth",
                    "id": "j4qtb07",
                    "parent_id": "t1_j4qftau",
                    "score": 5,
                    "created_utc": 1673974739.0,
                    "replies": []
                },
                {
                    "body": "There’s a big difference between a M&G and an established SR though.  Not that some guys aren’t still cheap once they’re in established SRs, but I’ve had M&Gs with women who I’d never want to see again so I can see some hesitation to go big before you know if you’re even compatible in person.",
                    "author": "SugarlifeAlt",
                    "id": "j4qhtok",
                    "parent_id": "t1_j4qftau",
                    "score": 4,
                    "created_utc": 1673970298.0,
                    "replies": [
                        {
                            "body": "I'm not worried about it. I'm not in the bowl. But hopefully more posts like these set better expectations for SBs.",
                            "author": "DarkEyes87",
                            "id": "j4qi03z",
                            "parent_id": "t1_j4qhtok",
                            "score": 5,
                            "created_utc": 1673970368.0,
                            "replies": [
                                {
                                    "body": "yes, every SB should expect to be paid upfront for the whole year. wcgw.",
                                    "author": "xa3D",
                                    "id": "j4rvixg",
                                    "parent_id": "t1_j4qi03z",
                                    "score": 5,
                                    "created_utc": 1673988763.0,
                                    "replies": [
                                        {
                                            "body": "I think it’s one of those situations where you need both a SD with the means to do it, as well as a responsible SB.  \n\nI’ve definitely talked with POTs who if they were given $40K on January 1st would somehow be unable to make rent on March 1st.",
                                            "author": "SugarlifeAlt",
                                            "id": "j4sk2p9",
                                            "parent_id": "t1_j4rvixg",
                                            "score": 2,
                                            "created_utc": 1673998183.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "If you’re not in the bowl, why are you spouting nonsense on SLF?",
                                    "author": "DarthDaddius",
                                    "id": "j4y48aq",
                                    "parent_id": "t1_j4qi03z",
                                    "score": 2,
                                    "created_utc": 1674092916.0,
                                    "replies": [
                                        {
                                            "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                                            "author": "DarkEyes87",
                                            "id": "j4y5upg",
                                            "parent_id": "t1_j4y48aq",
                                            "score": 0,
                                            "created_utc": 1674093616.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                                            "author": "DarkEyes87",
                                            "id": "j4y5vnl",
                                            "parent_id": "t1_j4y48aq",
                                            "score": 0,
                                            "created_utc": 1674093628.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "keep in mind - just how many guys do you think there are like him to go around to the thousands of other women who would love to be in the same circumstance?",
                    "author": "joc13",
                    "id": "j4ztysg",
                    "parent_id": "t1_j4qftau",
                    "score": 1,
                    "created_utc": 1674131245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It has “a disaster about to happen” written in large red letters all over.",
            "author": "FerrumSagum",
            "id": "j4sxfhz",
            "parent_id": "t3_10ee3qa",
            "score": 5,
            "created_utc": 1674003726.0,
            "replies": [
                {
                    "body": "Salty",
                    "author": "Fair_Carrot_5591",
                    "id": "j4t1k2o",
                    "parent_id": "t1_j4sxfhz",
                    "score": 1,
                    "created_utc": 1674005477.0,
                    "replies": [
                        {
                            "body": "No, sweetheart. I wouldn’t rent a house for a year rent upfront - one never know how things could turn up 5 months down the road. And buyer remorse can be a very powerful emotion.",
                            "author": "FerrumSagum",
                            "id": "j4t3xb3",
                            "parent_id": "t1_j4t1k2o",
                            "score": 2,
                            "created_utc": 1674006479.0,
                            "replies": [
                                {
                                    "body": "Not with him, guaranteed. \nHe wouldn't rent a house either. \nHe would buy it and if he didn't like it, eat the losses. \nTo each their own, no one is in charge of anyone else's fiscal responsibility.",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j4tg1o9",
                                    "parent_id": "t1_j4t3xb3",
                                    "score": 3,
                                    "created_utc": 1674011697.0,
                                    "replies": [
                                        {
                                            "body": "Remind me to check in 9 months.",
                                            "author": "FerrumSagum",
                                            "id": "j4tivyx",
                                            "parent_id": "t1_j4tg1o9",
                                            "score": 4,
                                            "created_utc": 1674013001.0,
                                            "replies": [
                                                {
                                                    "body": "If you actually wanted to set a reddit remind me, you did it wrong.",
                                                    "author": "Fair_Carrot_5591",
                                                    "id": "j4tti9n",
                                                    "parent_id": "t1_j4tivyx",
                                                    "score": 2,
                                                    "created_utc": 1674018399.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "LOL OP your post got down voted. I knew Saltine Daddies were going to come in with the salt.",
            "author": "DarkEyes87",
            "id": "j4qtgfz",
            "parent_id": "t3_10ee3qa",
            "score": 11,
            "created_utc": 1673974797.0,
            "replies": [
                {
                    "body": "Oh yeah the down votes are coming lmfao \nBut it's OK, cus it's not a fan fiction 🤣🤣 these salt daddies are just looking even worse out here every time a success story for the SB comes out.",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qu07b",
                    "parent_id": "t1_j4qtgfz",
                    "score": 4,
                    "created_utc": 1673975005.0,
                    "replies": [
                        {
                            "body": "The Saltine Daddies on this post: https://tenor.com/bHWGR.gif",
                            "author": "DarkEyes87",
                            "id": "j4qxo8t",
                            "parent_id": "t1_j4qu07b",
                            "score": 0,
                            "created_utc": 1673976357.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣 they can keep their salt\nI'm on a full blown sugar high rn 🍭😜",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j4qxwf8",
                                    "parent_id": "t1_j4qxo8t",
                                    "score": 5,
                                    "created_utc": 1673976440.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It goes fast if you don't manage it! So happy for you.",
            "author": "4rtknox",
            "id": "j4sow06",
            "parent_id": "t3_10ee3qa",
            "score": 2,
            "created_utc": 1674000170.0,
            "replies": []
        },
        {
            "body": "This is so wonderful! Congrats!!",
            "author": "AliceReins",
            "id": "j4t3g02",
            "parent_id": "t3_10ee3qa",
            "score": 2,
            "created_utc": 1674006276.0,
            "replies": []
        },
        {
            "body": "way to go! sounds like you have the right attitude and it has worked out for you. your story seems to be a combination of two different sayings I've seen:\n\nshe who asks for the least (you just wanted some week to week, or month to month security to budget with), gets the most (and you go security for a whole year)\n\nand\n\nwhat you get out of a situation depends on the energy and effort you put into it (sounds like you were doing a lot to inspire this level of generosity in him)",
            "author": "joc13",
            "id": "j4ztgi1",
            "parent_id": "t3_10ee3qa",
            "score": 2,
            "created_utc": 1674130938.0,
            "replies": []
        },
        {
            "body": "It’s quite encouraging to hear about a happy relationship between two people. Thanks for posting.",
            "author": "reddithowman",
            "id": "j6f5f5g",
            "parent_id": "t3_10ee3qa",
            "score": 2,
            "created_utc": 1675030902.0,
            "replies": []
        },
        {
            "body": "This happens & is happening",
            "author": "jewlieyet",
            "id": "j6l3qxq",
            "parent_id": "t3_10ee3qa",
            "score": 2,
            "created_utc": 1675131403.0,
            "replies": []
        },
        {
            "body": "Happy for you and curious to see how this develops!",
            "author": "sugardad123",
            "id": "j7h4otz",
            "parent_id": "t3_10ee3qa",
            "score": 2,
            "created_utc": 1675711980.0,
            "replies": []
        },
        {
            "body": "I can’t help but wonder if you’d see him more then eleven times in 2023 without an allowance and thus kinda got shorted on the ppm overall. However, if you’re happy I’m happy for you. Well off men don’t necessarily realize that even amounts like 10K in a year can be total life changers.",
            "author": "Equivalent_Newt_6969",
            "id": "j4th9yd",
            "parent_id": "t3_10ee3qa",
            "score": 3,
            "created_utc": 1674012256.0,
            "replies": [
                {
                    "body": "That was the first pmnt. It's way more than 11x my PPM. \nHe didn't have enough cash on hand to pay it all same day.",
                    "author": "Fair_Carrot_5591",
                    "id": "j4tio7z",
                    "parent_id": "t1_j4th9yd",
                    "score": 1,
                    "created_utc": 1674012902.0,
                    "replies": [
                        {
                            "body": "Ohhh ok great! Amazing. There’s good men in this bowl. Thanks for confirming for everyone",
                            "author": "Equivalent_Newt_6969",
                            "id": "j4tiyfv",
                            "parent_id": "t1_j4tio7z",
                            "score": 2,
                            "created_utc": 1674013032.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i wonder how many pounds of gravlax i can make with the sugar to salt ratios in this thread\n\ncongrats op, hope he stays healthy for a while",
            "author": "night-gloss",
            "id": "j4s0eaw",
            "parent_id": "t3_10ee3qa",
            "score": 3,
            "created_utc": 1673990557.0,
            "replies": [
                {
                    "body": "The post has been heavily down voted 🙄",
                    "author": "Fair_Carrot_5591",
                    "id": "j4s8wy9",
                    "parent_id": "t1_j4s0eaw",
                    "score": 1,
                    "created_utc": 1673993738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can't find other posts about it because no one should do it.  \n\n\nI seriously question if this just a fan fiction post.",
            "author": "notsureoftheanswer",
            "id": "j4qqobm",
            "parent_id": "t3_10ee3qa",
            "score": 4,
            "created_utc": 1673973747.0,
            "replies": [
                {
                    "body": "I didn't ask for it, merely suggested moving to monthly so I could do a solid budget for the year, and he went for yearly. I wasn't gonna argue 🤭😄",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qrv5z",
                    "parent_id": "t1_j4qqobm",
                    "score": 5,
                    "created_utc": 1673974200.0,
                    "replies": [
                        {
                            "body": "It's crazy to me that just because some men are incapable/ unwilling to be this generous with their SB, they project that on to ALL men making this kind of situation 'fan fiction'. \n\nWell those of us who have experienced this level of connection and generosity know it happens - and thankfully don't have to prove it to anyone because our amazing SRs (and bank balance) already provide significantly more satisfaction than any random internet opinions could 😊",
                            "author": "-ittybittykitty_",
                            "id": "j4r63it",
                            "parent_id": "t1_j4qrv5z",
                            "score": 8,
                            "created_utc": 1673979426.0,
                            "replies": [
                                {
                                    "body": "Couldn't have said it better 😁❤️",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j4r88k2",
                                    "parent_id": "t1_j4r63it",
                                    "score": 1,
                                    "created_utc": 1673980197.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">We have a SBF(68M)/SGF(28F) dynamic,\n\nMaybe he thinks he could die any day now and wanted to take care of you for this year? 🤷😅",
            "author": "non_giant_panda",
            "id": "j4r7lvt",
            "parent_id": "t3_10ee3qa",
            "score": 1,
            "created_utc": 1673979968.0,
            "replies": [
                {
                    "body": "I hope not 🥲",
                    "author": "Fair_Carrot_5591",
                    "id": "j4r834w",
                    "parent_id": "t1_j4r7lvt",
                    "score": 2,
                    "created_utc": 1673980142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Her results are not the norm.\n\nMajority of 28 year old women or women in their 20's are not going to target men over age 65.   \n\n\nShe targeted right and found an older guy willing to put out upfront like that. Is this shit typical ? Hell no.  \n\n\nAre there a lot more men like him who'll do it if approached by the right woman ? Yes. Again, only a small percent of women got the nerve to purposely deal with much older men to even see if it work for them.",
            "author": "southernslick",
            "id": "j4qlqvl",
            "parent_id": "t3_10ee3qa",
            "score": 0,
            "created_utc": 1673971831.0,
            "replies": [
                {
                    "body": "He found me, honey.",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qltj5",
                    "parent_id": "t1_j4qlqvl",
                    "score": 15,
                    "created_utc": 1673971861.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j4r3be9",
            "parent_id": "t3_10ee3qa",
            "score": -1,
            "created_utc": 1673978405.0,
            "replies": [
                {
                    "body": "Duh 🙄",
                    "author": "Nefarious_evee",
                    "id": "j4rhr0i",
                    "parent_id": "t1_j4r3be9",
                    "score": 3,
                    "created_utc": 1673983691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You hit the jackpot. Now disappoint him, just like he deserves.",
            "author": "Realistic_Scratch912",
            "id": "j4tn7u6",
            "parent_id": "t3_10ee3qa",
            "score": -2,
            "created_utc": 1674015063.0,
            "replies": []
        },
        {
            "body": "i love this how can i be you 😭😭 legit question: how did you start the conversation about your arrangement? i need to have that conversation as well",
            "author": "okfiggy",
            "id": "j6s64y1",
            "parent_id": "t3_10ee3qa",
            "score": 1,
            "created_utc": 1675263325.0,
            "replies": []
        },
        {
            "body": "What about PPP",
            "author": "5MiTm4sTaF13x",
            "id": "j7bds73",
            "parent_id": "t3_10ee3qa",
            "score": 1,
            "created_utc": 1675610337.0,
            "replies": []
        },
        {
            "body": "How long have y’all been seeing one another?",
            "author": "Realistic-Shoulder34",
            "id": "j7urvsx",
            "parent_id": "t3_10ee3qa",
            "score": 1,
            "created_utc": 1675957373.0,
            "replies": [
                {
                    "body": "Not long, we are going on 4 months. Currently on a trip for V day. Should post an update because we have said  love yous since, and he has whisked me away like a princess this weekend. Idk if the yearly thing was a test or what but Jesus christ I've never been so happy and felt so loved and appreciated. 🥰",
                    "author": "Fair_Carrot_5591",
                    "id": "j7uzcrf",
                    "parent_id": "t1_j7urvsx",
                    "score": 2,
                    "created_utc": 1675960290.0,
                    "replies": [
                        {
                            "body": "So happy to hear you’re being doted on ❤️ I hope I find that too 🥹",
                            "author": "Realistic-Shoulder34",
                            "id": "j7uzlly",
                            "parent_id": "t1_j7uzcrf",
                            "score": 2,
                            "created_utc": 1675960386.0,
                            "replies": [
                                {
                                    "body": "I hope you do, too!! Best wishes 🙏",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j7wc7m4",
                                    "parent_id": "t1_j7uzlly",
                                    "score": 1,
                                    "created_utc": 1675978372.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dreams really do come true, girl! 🏰 \nYear of rent paid, feels so fucking secure!! Cheers to being lucky babies 🥰🥂",
            "author": "Fair_Carrot_5591",
            "id": "j4qbo0d",
            "parent_id": "t1_j4qasyd",
            "score": 32,
            "created_utc": 1673967805.0,
            "replies": []
        },
        {
            "body": "Did you guys talk about a spending limit? Like you could spend 5k a week on a credit card if you wanted to.",
            "author": "Pastakingfifth",
            "id": "j4qrb88",
            "parent_id": "t1_j4qasyd",
            "score": 7,
            "created_utc": 1673973990.0,
            "replies": [
                {
                    "body": "My SB (25F, 3 yrs together) has a credit card and debit card in her name. We don’t have a spending limit but I did tell her if she charged a car or something too expensive without checking with me she’d probably lose me. Only twice have I’ve asked her to slow down on spending (Christmas and when decorating her apartment). She uses the cards for basic shopping and expenses. On top of this I give her money for her savings. I tell her I want her to feel the luxury lifestyle of being able to buy or do what you want (within reason). I also encourage her to take her friends out and treat them periodically. \n\nWhen it comes to jewelry or handbags, she usually lets me get those as gifts. \n\nI figure all this is still cheaper than having a wife 🤣",
                    "author": "NewPhoneWhoDis_916",
                    "id": "j4shshd",
                    "parent_id": "t1_j4qrb88",
                    "score": 30,
                    "created_utc": 1673997258.0,
                    "replies": []
                },
                {
                    "body": "I would recommend that you get clarity on any limits.   My last sb had one of my cards and for the first few months was reasonable with her expenditure.    The last month - when it was clear we were not going to be able to continue - she just went shopping and shopping and shopping.   Almost blew the - very high - limit.   I’d not put any limits out but I felt she went too far.   I’m the end I told her that she bought her own Christmas present.    So even though I had not put a limit on - she did go a bit too far.    I still like her and would be there for her but I’d sure be a lot more clear in  the future.",
                    "author": "brit-sd",
                    "id": "j4temv3",
                    "parent_id": "t1_j4qrb88",
                    "score": 13,
                    "created_utc": 1674011058.0,
                    "replies": [
                        {
                            "body": "Mine has black and platinum credit cards on my account so she can do the weekly shopping, buy clothes etc and go out with friends.   The arrangement though is I am there to look after her not her friends so if she goes out with them she has to go to places they can afford, not places they can’t paid for by me.    The second thing is she has them as long as she is responsible with them and if she misuses them they go.  She’s had them for a number of years now and so far I’ve never had a reason for concern.  We do have a bit of fun with them though for example if we go out for a good meal and everyone is thinking SR, she takes the check being offered to me (with a loudish “Let me get this” to me) and pulls out her black card to pay.  You can see the WTF look on the faces of the waiter and those seated near us 😂.  She loves that and also that she can go into a store in her own right and buy something, not be seen as an SB having stuff bought for her.\n\nOn this particular case though my only advice to the OP is put the money somewhere separate and budget it throughout the year or you will likely find it all gone by 6 months or less.   And then you will be effectively back to not having a monthly allowance and needing to ask for more or move on to live.   But it sounds like the OP is a good responsible person who will not abuse the trust placed in her as it is with my SB.  And that means a lot to me because it means she’s not just here for the money.",
                            "author": "Dazzling_Truth6472",
                            "id": "j4uj1hd",
                            "parent_id": "t1_j4temv3",
                            "score": 12,
                            "created_utc": 1674037211.0,
                            "replies": [
                                {
                                    "body": "Omg spoiled goals",
                                    "author": "Maleficent_SB",
                                    "id": "j4vsp9x",
                                    "parent_id": "t1_j4uj1hd",
                                    "score": 3,
                                    "created_utc": 1674060141.0,
                                    "replies": []
                                },
                                {
                                    "body": "My SB also loves to pick up the check and, not surprisingly, likes to tip generously 😂",
                                    "author": "NewPhoneWhoDis_916",
                                    "id": "j5bhh8j",
                                    "parent_id": "t1_j4uj1hd",
                                    "score": 3,
                                    "created_utc": 1674331767.0,
                                    "replies": [
                                        {
                                            "body": "Mine is always telling me how much money she’s “saved” me 🤣",
                                            "author": "Dazzling_Truth6472",
                                            "id": "j69c22s",
                                            "parent_id": "t1_j5bhh8j",
                                            "score": 2,
                                            "created_utc": 1674928966.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j4qu42s",
                    "parent_id": "t1_j4qrb88",
                    "score": 7,
                    "created_utc": 1673975045.0,
                    "replies": [
                        {
                            "body": "Can I ask how old you are and if you consider yourself way more attractive than most SBs or is this a lucky arrangement?",
                            "author": "Pastakingfifth",
                            "id": "j4qv940",
                            "parent_id": "t1_j4qu42s",
                            "score": 5,
                            "created_utc": 1673975472.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j4qx9ef",
                                    "parent_id": "t1_j4qv940",
                                    "score": 8,
                                    "created_utc": 1673976209.0,
                                    "replies": [
                                        {
                                            "body": "Fascinating, thank you for sharing!",
                                            "author": "Pastakingfifth",
                                            "id": "j4qylql",
                                            "parent_id": "t1_j4qx9ef",
                                            "score": 2,
                                            "created_utc": 1673976697.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "See, this is what I mean when I want to feel taken care of… idc about no money in hand, I want to just live without stressing tf about bills or rent every month 😂 I’d never leave!",
            "author": "TheMaryJShow",
            "id": "j6fmm0z",
            "parent_id": "t1_j4qasyd",
            "score": 3,
            "created_utc": 1675037323.0,
            "replies": []
        },
        {
            "body": "Hey, what does it mean to pledge security on a car loan vs. co-signing?",
            "author": "TheMaryJShow",
            "id": "j6fmp2f",
            "parent_id": "t1_j4s2tsc",
            "score": 1,
            "created_utc": 1675037358.0,
            "replies": [
                {
                    "body": "Simplistically \n\nCosign -  the person cosigning is responsible for the loan.  Also as I understand it having a cosigner means that the primary person does not get the full benefit on their credit rating .  Also the cosigner is responsible for the full amount including interest and penalties. \n\nPledged Security - The lender  can go after the security pledged but not the person allowing the property to be pledged.  The borrower receives the credit rating boost from having paid the loan.",
                    "author": "pinotandsugar",
                    "id": "j6gkcbo",
                    "parent_id": "t1_j6fmp2f",
                    "score": 1,
                    "created_utc": 1675051414.0,
                    "replies": [
                        {
                            "body": "I’ve never heard of that before! Thank you for sharing.",
                            "author": "TheMaryJShow",
                            "id": "j6i4sfs",
                            "parent_id": "t1_j6gkcbo",
                            "score": 2,
                            "created_utc": 1675089160.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you 😄",
            "author": "Fair_Carrot_5591",
            "id": "j4qv4op",
            "parent_id": "t1_j4quy7h",
            "score": 6,
            "created_utc": 1673975426.0,
            "replies": []
        },
        {
            "body": "I thought this was gonna be a mean comment at first, but it was so nice 🥹 Thank you so much!!!",
            "author": "Fair_Carrot_5591",
            "id": "j4qvq4p",
            "parent_id": "t1_j4qvh4x",
            "score": 10,
            "created_utc": 1673975647.0,
            "replies": [
                {
                    "body": "You are welcome.\n\nIf we assume he is sane and not as high as a kite....you've got to be one hell of a SB.\n\nPlease, please tell me you did not charge him a M&G fee?",
                    "author": "LondonSugarDaddy",
                    "id": "j4qyql8",
                    "parent_id": "t1_j4qvq4p",
                    "score": 2,
                    "created_utc": 1673976748.0,
                    "replies": [
                        {
                            "body": "Absolutely not!\nWe had a great M&G and he INSISTED I take half of what the full PPM became when he was giving me PPM. \nAlmost 5x as much as any gift I have ever received on a M&G.\nA good SB should never ask for anything! In any kind of SR I want, I don't want to have to ask for things. A good SD just gives if he wants to, no need to ask.\n\nI never ask for anything, the discussion about moving to monthly was the only time I've asked for something, and wowza did I receive 🥹❤️\nOne thing this accomplishes,\nI can text him and invite myself over and stuff.... like I just did for tonight. \nThere's no expectations for anything and it feels more and more like a vanilla relationship now (apart from the daddy issues kink 🤭🤣).\n\nI'm living in the twilight zone, in a good way.",
                            "author": "Fair_Carrot_5591",
                            "id": "j4r1b2l",
                            "parent_id": "t1_j4qyql8",
                            "score": 11,
                            "created_utc": 1673977679.0,
                            "replies": [
                                {
                                    "body": "There you go, another reason why he trusts you. Don't let him down, it's going be hard to keep motivated.  \n\nThink about ways you could do that, e.g transfer money from one high interest account (monthly allowance) to another at the first of each month (assuming you are saving for a business).  Good luck!",
                                    "author": "LondonSugarDaddy",
                                    "id": "j4v2ta9",
                                    "parent_id": "t1_j4r1b2l",
                                    "score": 2,
                                    "created_utc": 1674049619.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me too. This is deff far from the norm, it is a fairytale dream that I never knew I had, that just magically came true. \nI'm really fucking grateful and so mf lucky!!!!!!!!! Good lord I'm lucky 💕",
            "author": "Fair_Carrot_5591",
            "id": "j4qt7j0",
            "parent_id": "t1_j4qrpes",
            "score": 12,
            "created_utc": 1673974704.0,
            "replies": [
                {
                    "body": "Hold onto that feeling. There's a risk with spoiling someone at that level very quickly. My experience is that only a small number of people can deal with it well. I've had really good relationships end because attitudes change if the spoiling is too much too fast. And congrats! You seem like someone that can deal with this",
                    "author": "sabordeazucar",
                    "id": "j4r5owf",
                    "parent_id": "t1_j4qt7j0",
                    "score": 5,
                    "created_utc": 1673979279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "j4qvi04",
            "parent_id": "t1_j4qrpes",
            "score": 7,
            "created_utc": 1673975564.0,
            "replies": [
                {
                    "body": "This. Before SA the sugar bowl was very small and everyone met IRL. There wasn't any PPM and allowances were much higher but not exactly monthly. You simply cared for your SB so that she didn't have to worry about anything. How much that cost was flexible. SA changed everything",
                    "author": "sabordeazucar",
                    "id": "j4qyfy6",
                    "parent_id": "t1_j4qvi04",
                    "score": 12,
                    "created_utc": 1673976638.0,
                    "replies": [
                        {
                            "body": "There has been a commodifying of pretty much every online space.  It is sad.  Tumblr used to be this creative space, instagram too, even FB was cool in it's heyday.  Now it's some desperate elevator pitch from some sad stranger or old acquaintance trying to get you to buy into their mlm scheme.\n\nI think sugar is the same.  It used to be an elite club with certain unspoken norms.  Now it's the exact opposite.  The last time I used SA it was mostly middle income guys using deceit to buy sex and women just trying to survive.",
                            "author": "Temporary-Dwelling",
                            "id": "j4r7g6l",
                            "parent_id": "t1_j4qyfy6",
                            "score": 4,
                            "created_utc": 1673979912.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "yet that $10k per month isn't going to be handed out at $120k on January 1st.",
                    "author": "mraspencer",
                    "id": "j4qyvwn",
                    "parent_id": "t1_j4qvi04",
                    "score": 3,
                    "created_utc": 1673976802.0,
                    "replies": [
                        {
                            "body": "I have to agree that's unusual. He's already given her a credit card that he pays off. He could give her a debit card with a high daily limit and the same amount of yearly allowance in it. That's worked really well for me. But it's his money if he wants to spoil her that way\n\nHe's going to have to deal with the tax consequences since it's a gift over the yearly limit and he's older and most likely well over the lifetime exclusion amount. And of course his children or other people he has in his estate plan could cause an issue. While the OP will have her perspective his family may see things very differently",
                            "author": "sabordeazucar",
                            "id": "j4r54xi",
                            "parent_id": "t1_j4qyvwn",
                            "score": 7,
                            "created_utc": 1673979075.0,
                            "replies": [
                                {
                                    "body": "You can give a way $12,000,000 during your life as gifts. don't believe me ask a professional.",
                                    "author": "4rtknox",
                                    "id": "j4svesa",
                                    "parent_id": "t1_j4r54xi",
                                    "score": 0,
                                    "created_utc": 1674002872.0,
                                    "replies": [
                                        {
                                            "body": "That was the lifetime exclusion I was referencing. It's scheduled to sunset in 2025 so it'll be cut in half. I was assuming that someone wealthy enough to spoil the OP has a net worth over that amount. So what happens is he can give up to that amount away while he's alive, report it to the IRS each year, and deduct it from his lifetime exclusion. When he passes away only what's left of the exclusion is tax free. So you're correct that he won't be paying gift taxes most likely during his life (unless he's already given away his lifetime exclusion) but his estate will eventually pay that tax if his net worth is over the lifetime exclusion amount (12/6 million). The sunsetting of this is a big deal for UHNW estates",
                                            "author": "sabordeazucar",
                                            "id": "j4t430r",
                                            "parent_id": "t1_j4svesa",
                                            "score": 5,
                                            "created_utc": 1674006546.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks, this is a big deal",
                                                    "author": "4rtknox",
                                                    "id": "j4t6vh3",
                                                    "parent_id": "t1_j4t430r",
                                                    "score": 2,
                                                    "created_utc": 1674007715.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It wasn't uncommon for SD's to give lump sums.\n\nMine suggested exactly this to ensure enthusiastic consent.  I was totally covered for the school year, tuition, rent, living expenses.  Then I got an allowance each month for fun, savings, investments.\n\nHe wanted me to want him, to be there because I wanted to be, to demonstrate I could trust him and to unskew some of the power dynamic so I would feel safe.",
                            "author": "Temporary-Dwelling",
                            "id": "j4r62yl",
                            "parent_id": "t1_j4qyvwn",
                            "score": 7,
                            "created_utc": 1673979420.0,
                            "replies": [
                                {
                                    "body": "Sounds amazing! Whenabouts did this take place? Guessing not within the past couple of years?",
                                    "author": "uptiedand8",
                                    "id": "j4rc4r9",
                                    "parent_id": "t1_j4r62yl",
                                    "score": 2,
                                    "created_utc": 1673981615.0,
                                    "replies": [
                                        {
                                            "body": "More than 5 years ago but less than 10.\n\nOnline sugar has entered it's crumbling late stage capitalism period.\n\nAs more and more desirable SB exit the bowl for better opportunities perhaps something better will emerge.",
                                            "author": "Temporary-Dwelling",
                                            "id": "j4redr0",
                                            "parent_id": "t1_j4rc4r9",
                                            "score": 4,
                                            "created_utc": 1673982445.0,
                                            "replies": [
                                                {
                                                    "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
                                                    "author": "uptiedand8",
                                                    "id": "j4riae1",
                                                    "parent_id": "t1_j4redr0",
                                                    "score": 3,
                                                    "created_utc": 1673983891.0,
                                                    "replies": [
                                                        {
                                                            "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                                                            "author": "Insatiable_Learner",
                                                            "id": "j4trzlu",
                                                            "parent_id": "t1_j4riae1",
                                                            "score": 3,
                                                            "created_utc": 1674017548.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                                                            "author": "SDstartingOut",
                                                            "id": "j4x06nt",
                                                            "parent_id": "t1_j4riae1",
                                                            "score": 1,
                                                            "created_utc": 1674076127.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j4qlpyh",
            "parent_id": "t1_j4qgac1",
            "score": 12,
            "created_utc": 1673971821.0,
            "replies": [
                {
                    "body": "Not a  necessary scenario. I brought a lady to meet my family who was the same age as my granddaughter. My family was very supportive. There comment to a person was if she makes you happy, we are happy.",
                    "author": "AFSMSgt",
                    "id": "j4rsmsy",
                    "parent_id": "t1_j4qlpyh",
                    "score": 7,
                    "created_utc": 1673987706.0,
                    "replies": [
                        {
                            "body": "I'm glad your family received her well... I hope to be so lucky!! Thank you for the hope!",
                            "author": "Fair_Carrot_5591",
                            "id": "j4rsswc",
                            "parent_id": "t1_j4rsmsy",
                            "score": 2,
                            "created_utc": 1673987768.0,
                            "replies": [
                                {
                                    "body": "There are a lot of people with no family to leave it to. I know several and that's just me.",
                                    "author": "4rtknox",
                                    "id": "j4sw1rh",
                                    "parent_id": "t1_j4rsswc",
                                    "score": 2,
                                    "created_utc": 1674003142.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Update us if this situation comes up because if there's one thing I know about women it's that they hate it when other women get to spend the money they feel like they're entitled to. \n\nIMO I agree that in this situation no matter how nice she is she's gonna flip the fuck out of you and take you to court to make it seem like you're a predator taking advantage of her confused father.",
                    "author": "Pastakingfifth",
                    "id": "j4qrpqz",
                    "parent_id": "t1_j4qlpyh",
                    "score": 9,
                    "created_utc": 1673974144.0,
                    "replies": [
                        {
                            "body": "He most likely is a very active, almost 70 year old. I'm sure he's not anywhere near senility. OP says he JUST retired.",
                            "author": "DarkEyes87",
                            "id": "j4qt91d",
                            "parent_id": "t1_j4qrpqz",
                            "score": 8,
                            "created_utc": 1673974720.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j4qtsia",
                            "parent_id": "t1_j4qrpqz",
                            "score": 5,
                            "created_utc": 1673974924.0,
                            "replies": [
                                {
                                    "body": "> He is fully sound and competent. He signed trust documents during this time for her and her family too, so if his decisions made about me are not of sound mind, his decisions elsewhere can't be trusted to be of sound mind, stands to reason. 🤷‍♀️\n\nI would make sure that he has communicated that to them and that you have legal proof of this. The truth will not matter when his entitled family members with the money to sue you take you to court.",
                                    "author": "Pastakingfifth",
                                    "id": "j4qv0o4",
                                    "parent_id": "t1_j4qtsia",
                                    "score": 7,
                                    "created_utc": 1673975385.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope this is nowhere near the truth for OPs sake. 🙏 that said, there is sage advice in this perspective. \n\nOP be smart with your sudden windfall! Pay off all your debts. Set aside money somewhere for a rainy day. Seek investment advice from someone who is not related or involved.\n\nResist resist resist the temptation to spend spend spend. It is powerful when you come into money suddenly. u/GSSD is not wrong about lottery winners. I personally know multiple people who blew thru 100s of thousands in a short period of time because they didn’t have financial wisdom or willpower.",
            "author": "P0sitiveViibes777",
            "id": "j4qj2fz",
            "parent_id": "t1_j4qgac1",
            "score": 15,
            "created_utc": 1673970779.0,
            "replies": [
                {
                    "body": "Thanks guys!\nNo worries here, I am somewhat financially literate, and as a result I actually don't have debts to pay off. 😅 \nJust saving for now until I figure out another business to start. 👍",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qknqx",
                    "parent_id": "t1_j4qj2fz",
                    "score": 14,
                    "created_utc": 1673971401.0,
                    "replies": [
                        {
                            "body": "💗💗💗",
                            "author": "P0sitiveViibes777",
                            "id": "j4qmso7",
                            "parent_id": "t1_j4qknqx",
                            "score": 5,
                            "created_utc": 1673972247.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree.",
                    "author": "4rtknox",
                    "id": "j4swbz8",
                    "parent_id": "t1_j4qj2fz",
                    "score": 1,
                    "created_utc": 1674003260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean also depends on what kind of SD you're going after too. This guy is 68 and retired, that kind of money is harder to swing for a 40-60-year-old working dude.",
            "author": "Pastakingfifth",
            "id": "j4qtb07",
            "parent_id": "t1_j4qftau",
            "score": 5,
            "created_utc": 1673974739.0,
            "replies": []
        },
        {
            "body": "There’s a big difference between a M&G and an established SR though.  Not that some guys aren’t still cheap once they’re in established SRs, but I’ve had M&Gs with women who I’d never want to see again so I can see some hesitation to go big before you know if you’re even compatible in person.",
            "author": "SugarlifeAlt",
            "id": "j4qhtok",
            "parent_id": "t1_j4qftau",
            "score": 4,
            "created_utc": 1673970298.0,
            "replies": [
                {
                    "body": "I'm not worried about it. I'm not in the bowl. But hopefully more posts like these set better expectations for SBs.",
                    "author": "DarkEyes87",
                    "id": "j4qi03z",
                    "parent_id": "t1_j4qhtok",
                    "score": 5,
                    "created_utc": 1673970368.0,
                    "replies": [
                        {
                            "body": "yes, every SB should expect to be paid upfront for the whole year. wcgw.",
                            "author": "xa3D",
                            "id": "j4rvixg",
                            "parent_id": "t1_j4qi03z",
                            "score": 5,
                            "created_utc": 1673988763.0,
                            "replies": [
                                {
                                    "body": "I think it’s one of those situations where you need both a SD with the means to do it, as well as a responsible SB.  \n\nI’ve definitely talked with POTs who if they were given $40K on January 1st would somehow be unable to make rent on March 1st.",
                                    "author": "SugarlifeAlt",
                                    "id": "j4sk2p9",
                                    "parent_id": "t1_j4rvixg",
                                    "score": 2,
                                    "created_utc": 1673998183.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "If you’re not in the bowl, why are you spouting nonsense on SLF?",
                            "author": "DarthDaddius",
                            "id": "j4y48aq",
                            "parent_id": "t1_j4qi03z",
                            "score": 2,
                            "created_utc": 1674092916.0,
                            "replies": [
                                {
                                    "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                                    "author": "DarkEyes87",
                                    "id": "j4y5upg",
                                    "parent_id": "t1_j4y48aq",
                                    "score": 0,
                                    "created_utc": 1674093616.0,
                                    "replies": []
                                },
                                {
                                    "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                                    "author": "DarkEyes87",
                                    "id": "j4y5vnl",
                                    "parent_id": "t1_j4y48aq",
                                    "score": 0,
                                    "created_utc": 1674093628.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "keep in mind - just how many guys do you think there are like him to go around to the thousands of other women who would love to be in the same circumstance?",
            "author": "joc13",
            "id": "j4ztysg",
            "parent_id": "t1_j4qftau",
            "score": 1,
            "created_utc": 1674131245.0,
            "replies": []
        },
        {
            "body": "Salty",
            "author": "Fair_Carrot_5591",
            "id": "j4t1k2o",
            "parent_id": "t1_j4sxfhz",
            "score": 1,
            "created_utc": 1674005477.0,
            "replies": [
                {
                    "body": "No, sweetheart. I wouldn’t rent a house for a year rent upfront - one never know how things could turn up 5 months down the road. And buyer remorse can be a very powerful emotion.",
                    "author": "FerrumSagum",
                    "id": "j4t3xb3",
                    "parent_id": "t1_j4t1k2o",
                    "score": 2,
                    "created_utc": 1674006479.0,
                    "replies": [
                        {
                            "body": "Not with him, guaranteed. \nHe wouldn't rent a house either. \nHe would buy it and if he didn't like it, eat the losses. \nTo each their own, no one is in charge of anyone else's fiscal responsibility.",
                            "author": "Fair_Carrot_5591",
                            "id": "j4tg1o9",
                            "parent_id": "t1_j4t3xb3",
                            "score": 3,
                            "created_utc": 1674011697.0,
                            "replies": [
                                {
                                    "body": "Remind me to check in 9 months.",
                                    "author": "FerrumSagum",
                                    "id": "j4tivyx",
                                    "parent_id": "t1_j4tg1o9",
                                    "score": 4,
                                    "created_utc": 1674013001.0,
                                    "replies": [
                                        {
                                            "body": "If you actually wanted to set a reddit remind me, you did it wrong.",
                                            "author": "Fair_Carrot_5591",
                                            "id": "j4tti9n",
                                            "parent_id": "t1_j4tivyx",
                                            "score": 2,
                                            "created_utc": 1674018399.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh yeah the down votes are coming lmfao \nBut it's OK, cus it's not a fan fiction 🤣🤣 these salt daddies are just looking even worse out here every time a success story for the SB comes out.",
            "author": "Fair_Carrot_5591",
            "id": "j4qu07b",
            "parent_id": "t1_j4qtgfz",
            "score": 4,
            "created_utc": 1673975005.0,
            "replies": [
                {
                    "body": "The Saltine Daddies on this post: https://tenor.com/bHWGR.gif",
                    "author": "DarkEyes87",
                    "id": "j4qxo8t",
                    "parent_id": "t1_j4qu07b",
                    "score": 0,
                    "created_utc": 1673976357.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣 they can keep their salt\nI'm on a full blown sugar high rn 🍭😜",
                            "author": "Fair_Carrot_5591",
                            "id": "j4qxwf8",
                            "parent_id": "t1_j4qxo8t",
                            "score": 5,
                            "created_utc": 1673976440.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That was the first pmnt. It's way more than 11x my PPM. \nHe didn't have enough cash on hand to pay it all same day.",
            "author": "Fair_Carrot_5591",
            "id": "j4tio7z",
            "parent_id": "t1_j4th9yd",
            "score": 1,
            "created_utc": 1674012902.0,
            "replies": [
                {
                    "body": "Ohhh ok great! Amazing. There’s good men in this bowl. Thanks for confirming for everyone",
                    "author": "Equivalent_Newt_6969",
                    "id": "j4tiyfv",
                    "parent_id": "t1_j4tio7z",
                    "score": 2,
                    "created_utc": 1674013032.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The post has been heavily down voted 🙄",
            "author": "Fair_Carrot_5591",
            "id": "j4s8wy9",
            "parent_id": "t1_j4s0eaw",
            "score": 1,
            "created_utc": 1673993738.0,
            "replies": []
        },
        {
            "body": "I didn't ask for it, merely suggested moving to monthly so I could do a solid budget for the year, and he went for yearly. I wasn't gonna argue 🤭😄",
            "author": "Fair_Carrot_5591",
            "id": "j4qrv5z",
            "parent_id": "t1_j4qqobm",
            "score": 5,
            "created_utc": 1673974200.0,
            "replies": [
                {
                    "body": "It's crazy to me that just because some men are incapable/ unwilling to be this generous with their SB, they project that on to ALL men making this kind of situation 'fan fiction'. \n\nWell those of us who have experienced this level of connection and generosity know it happens - and thankfully don't have to prove it to anyone because our amazing SRs (and bank balance) already provide significantly more satisfaction than any random internet opinions could 😊",
                    "author": "-ittybittykitty_",
                    "id": "j4r63it",
                    "parent_id": "t1_j4qrv5z",
                    "score": 8,
                    "created_utc": 1673979426.0,
                    "replies": [
                        {
                            "body": "Couldn't have said it better 😁❤️",
                            "author": "Fair_Carrot_5591",
                            "id": "j4r88k2",
                            "parent_id": "t1_j4r63it",
                            "score": 1,
                            "created_utc": 1673980197.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hope not 🥲",
            "author": "Fair_Carrot_5591",
            "id": "j4r834w",
            "parent_id": "t1_j4r7lvt",
            "score": 2,
            "created_utc": 1673980142.0,
            "replies": []
        },
        {
            "body": "He found me, honey.",
            "author": "Fair_Carrot_5591",
            "id": "j4qltj5",
            "parent_id": "t1_j4qlqvl",
            "score": 15,
            "created_utc": 1673971861.0,
            "replies": []
        },
        {
            "body": "Duh 🙄",
            "author": "Nefarious_evee",
            "id": "j4rhr0i",
            "parent_id": "t1_j4r3be9",
            "score": 3,
            "created_utc": 1673983691.0,
            "replies": []
        },
        {
            "body": "Not long, we are going on 4 months. Currently on a trip for V day. Should post an update because we have said  love yous since, and he has whisked me away like a princess this weekend. Idk if the yearly thing was a test or what but Jesus christ I've never been so happy and felt so loved and appreciated. 🥰",
            "author": "Fair_Carrot_5591",
            "id": "j7uzcrf",
            "parent_id": "t1_j7urvsx",
            "score": 2,
            "created_utc": 1675960290.0,
            "replies": [
                {
                    "body": "So happy to hear you’re being doted on ❤️ I hope I find that too 🥹",
                    "author": "Realistic-Shoulder34",
                    "id": "j7uzlly",
                    "parent_id": "t1_j7uzcrf",
                    "score": 2,
                    "created_utc": 1675960386.0,
                    "replies": [
                        {
                            "body": "I hope you do, too!! Best wishes 🙏",
                            "author": "Fair_Carrot_5591",
                            "id": "j7wc7m4",
                            "parent_id": "t1_j7uzlly",
                            "score": 1,
                            "created_utc": 1675978372.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My SB (25F, 3 yrs together) has a credit card and debit card in her name. We don’t have a spending limit but I did tell her if she charged a car or something too expensive without checking with me she’d probably lose me. Only twice have I’ve asked her to slow down on spending (Christmas and when decorating her apartment). She uses the cards for basic shopping and expenses. On top of this I give her money for her savings. I tell her I want her to feel the luxury lifestyle of being able to buy or do what you want (within reason). I also encourage her to take her friends out and treat them periodically. \n\nWhen it comes to jewelry or handbags, she usually lets me get those as gifts. \n\nI figure all this is still cheaper than having a wife 🤣",
            "author": "NewPhoneWhoDis_916",
            "id": "j4shshd",
            "parent_id": "t1_j4qrb88",
            "score": 30,
            "created_utc": 1673997258.0,
            "replies": []
        },
        {
            "body": "I would recommend that you get clarity on any limits.   My last sb had one of my cards and for the first few months was reasonable with her expenditure.    The last month - when it was clear we were not going to be able to continue - she just went shopping and shopping and shopping.   Almost blew the - very high - limit.   I’d not put any limits out but I felt she went too far.   I’m the end I told her that she bought her own Christmas present.    So even though I had not put a limit on - she did go a bit too far.    I still like her and would be there for her but I’d sure be a lot more clear in  the future.",
            "author": "brit-sd",
            "id": "j4temv3",
            "parent_id": "t1_j4qrb88",
            "score": 13,
            "created_utc": 1674011058.0,
            "replies": [
                {
                    "body": "Mine has black and platinum credit cards on my account so she can do the weekly shopping, buy clothes etc and go out with friends.   The arrangement though is I am there to look after her not her friends so if she goes out with them she has to go to places they can afford, not places they can’t paid for by me.    The second thing is she has them as long as she is responsible with them and if she misuses them they go.  She’s had them for a number of years now and so far I’ve never had a reason for concern.  We do have a bit of fun with them though for example if we go out for a good meal and everyone is thinking SR, she takes the check being offered to me (with a loudish “Let me get this” to me) and pulls out her black card to pay.  You can see the WTF look on the faces of the waiter and those seated near us 😂.  She loves that and also that she can go into a store in her own right and buy something, not be seen as an SB having stuff bought for her.\n\nOn this particular case though my only advice to the OP is put the money somewhere separate and budget it throughout the year or you will likely find it all gone by 6 months or less.   And then you will be effectively back to not having a monthly allowance and needing to ask for more or move on to live.   But it sounds like the OP is a good responsible person who will not abuse the trust placed in her as it is with my SB.  And that means a lot to me because it means she’s not just here for the money.",
                    "author": "Dazzling_Truth6472",
                    "id": "j4uj1hd",
                    "parent_id": "t1_j4temv3",
                    "score": 12,
                    "created_utc": 1674037211.0,
                    "replies": [
                        {
                            "body": "Omg spoiled goals",
                            "author": "Maleficent_SB",
                            "id": "j4vsp9x",
                            "parent_id": "t1_j4uj1hd",
                            "score": 3,
                            "created_utc": 1674060141.0,
                            "replies": []
                        },
                        {
                            "body": "My SB also loves to pick up the check and, not surprisingly, likes to tip generously 😂",
                            "author": "NewPhoneWhoDis_916",
                            "id": "j5bhh8j",
                            "parent_id": "t1_j4uj1hd",
                            "score": 3,
                            "created_utc": 1674331767.0,
                            "replies": [
                                {
                                    "body": "Mine is always telling me how much money she’s “saved” me 🤣",
                                    "author": "Dazzling_Truth6472",
                                    "id": "j69c22s",
                                    "parent_id": "t1_j5bhh8j",
                                    "score": 2,
                                    "created_utc": 1674928966.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j4qu42s",
            "parent_id": "t1_j4qrb88",
            "score": 7,
            "created_utc": 1673975045.0,
            "replies": [
                {
                    "body": "Can I ask how old you are and if you consider yourself way more attractive than most SBs or is this a lucky arrangement?",
                    "author": "Pastakingfifth",
                    "id": "j4qv940",
                    "parent_id": "t1_j4qu42s",
                    "score": 5,
                    "created_utc": 1673975472.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j4qx9ef",
                            "parent_id": "t1_j4qv940",
                            "score": 8,
                            "created_utc": 1673976209.0,
                            "replies": [
                                {
                                    "body": "Fascinating, thank you for sharing!",
                                    "author": "Pastakingfifth",
                                    "id": "j4qylql",
                                    "parent_id": "t1_j4qx9ef",
                                    "score": 2,
                                    "created_utc": 1673976697.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Simplistically \n\nCosign -  the person cosigning is responsible for the loan.  Also as I understand it having a cosigner means that the primary person does not get the full benefit on their credit rating .  Also the cosigner is responsible for the full amount including interest and penalties. \n\nPledged Security - The lender  can go after the security pledged but not the person allowing the property to be pledged.  The borrower receives the credit rating boost from having paid the loan.",
            "author": "pinotandsugar",
            "id": "j6gkcbo",
            "parent_id": "t1_j6fmp2f",
            "score": 1,
            "created_utc": 1675051414.0,
            "replies": [
                {
                    "body": "I’ve never heard of that before! Thank you for sharing.",
                    "author": "TheMaryJShow",
                    "id": "j6i4sfs",
                    "parent_id": "t1_j6gkcbo",
                    "score": 2,
                    "created_utc": 1675089160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are welcome.\n\nIf we assume he is sane and not as high as a kite....you've got to be one hell of a SB.\n\nPlease, please tell me you did not charge him a M&G fee?",
            "author": "LondonSugarDaddy",
            "id": "j4qyql8",
            "parent_id": "t1_j4qvq4p",
            "score": 2,
            "created_utc": 1673976748.0,
            "replies": [
                {
                    "body": "Absolutely not!\nWe had a great M&G and he INSISTED I take half of what the full PPM became when he was giving me PPM. \nAlmost 5x as much as any gift I have ever received on a M&G.\nA good SB should never ask for anything! In any kind of SR I want, I don't want to have to ask for things. A good SD just gives if he wants to, no need to ask.\n\nI never ask for anything, the discussion about moving to monthly was the only time I've asked for something, and wowza did I receive 🥹❤️\nOne thing this accomplishes,\nI can text him and invite myself over and stuff.... like I just did for tonight. \nThere's no expectations for anything and it feels more and more like a vanilla relationship now (apart from the daddy issues kink 🤭🤣).\n\nI'm living in the twilight zone, in a good way.",
                    "author": "Fair_Carrot_5591",
                    "id": "j4r1b2l",
                    "parent_id": "t1_j4qyql8",
                    "score": 11,
                    "created_utc": 1673977679.0,
                    "replies": [
                        {
                            "body": "There you go, another reason why he trusts you. Don't let him down, it's going be hard to keep motivated.  \n\nThink about ways you could do that, e.g transfer money from one high interest account (monthly allowance) to another at the first of each month (assuming you are saving for a business).  Good luck!",
                            "author": "LondonSugarDaddy",
                            "id": "j4v2ta9",
                            "parent_id": "t1_j4r1b2l",
                            "score": 2,
                            "created_utc": 1674049619.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hold onto that feeling. There's a risk with spoiling someone at that level very quickly. My experience is that only a small number of people can deal with it well. I've had really good relationships end because attitudes change if the spoiling is too much too fast. And congrats! You seem like someone that can deal with this",
            "author": "sabordeazucar",
            "id": "j4r5owf",
            "parent_id": "t1_j4qt7j0",
            "score": 5,
            "created_utc": 1673979279.0,
            "replies": []
        },
        {
            "body": "This. Before SA the sugar bowl was very small and everyone met IRL. There wasn't any PPM and allowances were much higher but not exactly monthly. You simply cared for your SB so that she didn't have to worry about anything. How much that cost was flexible. SA changed everything",
            "author": "sabordeazucar",
            "id": "j4qyfy6",
            "parent_id": "t1_j4qvi04",
            "score": 12,
            "created_utc": 1673976638.0,
            "replies": [
                {
                    "body": "There has been a commodifying of pretty much every online space.  It is sad.  Tumblr used to be this creative space, instagram too, even FB was cool in it's heyday.  Now it's some desperate elevator pitch from some sad stranger or old acquaintance trying to get you to buy into their mlm scheme.\n\nI think sugar is the same.  It used to be an elite club with certain unspoken norms.  Now it's the exact opposite.  The last time I used SA it was mostly middle income guys using deceit to buy sex and women just trying to survive.",
                    "author": "Temporary-Dwelling",
                    "id": "j4r7g6l",
                    "parent_id": "t1_j4qyfy6",
                    "score": 4,
                    "created_utc": 1673979912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yet that $10k per month isn't going to be handed out at $120k on January 1st.",
            "author": "mraspencer",
            "id": "j4qyvwn",
            "parent_id": "t1_j4qvi04",
            "score": 3,
            "created_utc": 1673976802.0,
            "replies": [
                {
                    "body": "I have to agree that's unusual. He's already given her a credit card that he pays off. He could give her a debit card with a high daily limit and the same amount of yearly allowance in it. That's worked really well for me. But it's his money if he wants to spoil her that way\n\nHe's going to have to deal with the tax consequences since it's a gift over the yearly limit and he's older and most likely well over the lifetime exclusion amount. And of course his children or other people he has in his estate plan could cause an issue. While the OP will have her perspective his family may see things very differently",
                    "author": "sabordeazucar",
                    "id": "j4r54xi",
                    "parent_id": "t1_j4qyvwn",
                    "score": 7,
                    "created_utc": 1673979075.0,
                    "replies": [
                        {
                            "body": "You can give a way $12,000,000 during your life as gifts. don't believe me ask a professional.",
                            "author": "4rtknox",
                            "id": "j4svesa",
                            "parent_id": "t1_j4r54xi",
                            "score": 0,
                            "created_utc": 1674002872.0,
                            "replies": [
                                {
                                    "body": "That was the lifetime exclusion I was referencing. It's scheduled to sunset in 2025 so it'll be cut in half. I was assuming that someone wealthy enough to spoil the OP has a net worth over that amount. So what happens is he can give up to that amount away while he's alive, report it to the IRS each year, and deduct it from his lifetime exclusion. When he passes away only what's left of the exclusion is tax free. So you're correct that he won't be paying gift taxes most likely during his life (unless he's already given away his lifetime exclusion) but his estate will eventually pay that tax if his net worth is over the lifetime exclusion amount (12/6 million). The sunsetting of this is a big deal for UHNW estates",
                                    "author": "sabordeazucar",
                                    "id": "j4t430r",
                                    "parent_id": "t1_j4svesa",
                                    "score": 5,
                                    "created_utc": 1674006546.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, this is a big deal",
                                            "author": "4rtknox",
                                            "id": "j4t6vh3",
                                            "parent_id": "t1_j4t430r",
                                            "score": 2,
                                            "created_utc": 1674007715.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It wasn't uncommon for SD's to give lump sums.\n\nMine suggested exactly this to ensure enthusiastic consent.  I was totally covered for the school year, tuition, rent, living expenses.  Then I got an allowance each month for fun, savings, investments.\n\nHe wanted me to want him, to be there because I wanted to be, to demonstrate I could trust him and to unskew some of the power dynamic so I would feel safe.",
                    "author": "Temporary-Dwelling",
                    "id": "j4r62yl",
                    "parent_id": "t1_j4qyvwn",
                    "score": 7,
                    "created_utc": 1673979420.0,
                    "replies": [
                        {
                            "body": "Sounds amazing! Whenabouts did this take place? Guessing not within the past couple of years?",
                            "author": "uptiedand8",
                            "id": "j4rc4r9",
                            "parent_id": "t1_j4r62yl",
                            "score": 2,
                            "created_utc": 1673981615.0,
                            "replies": [
                                {
                                    "body": "More than 5 years ago but less than 10.\n\nOnline sugar has entered it's crumbling late stage capitalism period.\n\nAs more and more desirable SB exit the bowl for better opportunities perhaps something better will emerge.",
                                    "author": "Temporary-Dwelling",
                                    "id": "j4redr0",
                                    "parent_id": "t1_j4rc4r9",
                                    "score": 4,
                                    "created_utc": 1673982445.0,
                                    "replies": [
                                        {
                                            "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
                                            "author": "uptiedand8",
                                            "id": "j4riae1",
                                            "parent_id": "t1_j4redr0",
                                            "score": 3,
                                            "created_utc": 1673983891.0,
                                            "replies": [
                                                {
                                                    "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                                                    "author": "Insatiable_Learner",
                                                    "id": "j4trzlu",
                                                    "parent_id": "t1_j4riae1",
                                                    "score": 3,
                                                    "created_utc": 1674017548.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                                                    "author": "SDstartingOut",
                                                    "id": "j4x06nt",
                                                    "parent_id": "t1_j4riae1",
                                                    "score": 1,
                                                    "created_utc": 1674076127.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not a  necessary scenario. I brought a lady to meet my family who was the same age as my granddaughter. My family was very supportive. There comment to a person was if she makes you happy, we are happy.",
            "author": "AFSMSgt",
            "id": "j4rsmsy",
            "parent_id": "t1_j4qlpyh",
            "score": 7,
            "created_utc": 1673987706.0,
            "replies": [
                {
                    "body": "I'm glad your family received her well... I hope to be so lucky!! Thank you for the hope!",
                    "author": "Fair_Carrot_5591",
                    "id": "j4rsswc",
                    "parent_id": "t1_j4rsmsy",
                    "score": 2,
                    "created_utc": 1673987768.0,
                    "replies": [
                        {
                            "body": "There are a lot of people with no family to leave it to. I know several and that's just me.",
                            "author": "4rtknox",
                            "id": "j4sw1rh",
                            "parent_id": "t1_j4rsswc",
                            "score": 2,
                            "created_utc": 1674003142.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Update us if this situation comes up because if there's one thing I know about women it's that they hate it when other women get to spend the money they feel like they're entitled to. \n\nIMO I agree that in this situation no matter how nice she is she's gonna flip the fuck out of you and take you to court to make it seem like you're a predator taking advantage of her confused father.",
            "author": "Pastakingfifth",
            "id": "j4qrpqz",
            "parent_id": "t1_j4qlpyh",
            "score": 9,
            "created_utc": 1673974144.0,
            "replies": [
                {
                    "body": "He most likely is a very active, almost 70 year old. I'm sure he's not anywhere near senility. OP says he JUST retired.",
                    "author": "DarkEyes87",
                    "id": "j4qt91d",
                    "parent_id": "t1_j4qrpqz",
                    "score": 8,
                    "created_utc": 1673974720.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j4qtsia",
                    "parent_id": "t1_j4qrpqz",
                    "score": 5,
                    "created_utc": 1673974924.0,
                    "replies": [
                        {
                            "body": "> He is fully sound and competent. He signed trust documents during this time for her and her family too, so if his decisions made about me are not of sound mind, his decisions elsewhere can't be trusted to be of sound mind, stands to reason. 🤷‍♀️\n\nI would make sure that he has communicated that to them and that you have legal proof of this. The truth will not matter when his entitled family members with the money to sue you take you to court.",
                            "author": "Pastakingfifth",
                            "id": "j4qv0o4",
                            "parent_id": "t1_j4qtsia",
                            "score": 7,
                            "created_utc": 1673975385.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks guys!\nNo worries here, I am somewhat financially literate, and as a result I actually don't have debts to pay off. 😅 \nJust saving for now until I figure out another business to start. 👍",
            "author": "Fair_Carrot_5591",
            "id": "j4qknqx",
            "parent_id": "t1_j4qj2fz",
            "score": 14,
            "created_utc": 1673971401.0,
            "replies": [
                {
                    "body": "💗💗💗",
                    "author": "P0sitiveViibes777",
                    "id": "j4qmso7",
                    "parent_id": "t1_j4qknqx",
                    "score": 5,
                    "created_utc": 1673972247.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree.",
            "author": "4rtknox",
            "id": "j4swbz8",
            "parent_id": "t1_j4qj2fz",
            "score": 1,
            "created_utc": 1674003260.0,
            "replies": []
        },
        {
            "body": "I'm not worried about it. I'm not in the bowl. But hopefully more posts like these set better expectations for SBs.",
            "author": "DarkEyes87",
            "id": "j4qi03z",
            "parent_id": "t1_j4qhtok",
            "score": 5,
            "created_utc": 1673970368.0,
            "replies": [
                {
                    "body": "yes, every SB should expect to be paid upfront for the whole year. wcgw.",
                    "author": "xa3D",
                    "id": "j4rvixg",
                    "parent_id": "t1_j4qi03z",
                    "score": 5,
                    "created_utc": 1673988763.0,
                    "replies": [
                        {
                            "body": "I think it’s one of those situations where you need both a SD with the means to do it, as well as a responsible SB.  \n\nI’ve definitely talked with POTs who if they were given $40K on January 1st would somehow be unable to make rent on March 1st.",
                            "author": "SugarlifeAlt",
                            "id": "j4sk2p9",
                            "parent_id": "t1_j4rvixg",
                            "score": 2,
                            "created_utc": 1673998183.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If you’re not in the bowl, why are you spouting nonsense on SLF?",
                    "author": "DarthDaddius",
                    "id": "j4y48aq",
                    "parent_id": "t1_j4qi03z",
                    "score": 2,
                    "created_utc": 1674092916.0,
                    "replies": [
                        {
                            "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                            "author": "DarkEyes87",
                            "id": "j4y5upg",
                            "parent_id": "t1_j4y48aq",
                            "score": 0,
                            "created_utc": 1674093616.0,
                            "replies": []
                        },
                        {
                            "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                            "author": "DarkEyes87",
                            "id": "j4y5vnl",
                            "parent_id": "t1_j4y48aq",
                            "score": 0,
                            "created_utc": 1674093628.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No, sweetheart. I wouldn’t rent a house for a year rent upfront - one never know how things could turn up 5 months down the road. And buyer remorse can be a very powerful emotion.",
            "author": "FerrumSagum",
            "id": "j4t3xb3",
            "parent_id": "t1_j4t1k2o",
            "score": 2,
            "created_utc": 1674006479.0,
            "replies": [
                {
                    "body": "Not with him, guaranteed. \nHe wouldn't rent a house either. \nHe would buy it and if he didn't like it, eat the losses. \nTo each their own, no one is in charge of anyone else's fiscal responsibility.",
                    "author": "Fair_Carrot_5591",
                    "id": "j4tg1o9",
                    "parent_id": "t1_j4t3xb3",
                    "score": 3,
                    "created_utc": 1674011697.0,
                    "replies": [
                        {
                            "body": "Remind me to check in 9 months.",
                            "author": "FerrumSagum",
                            "id": "j4tivyx",
                            "parent_id": "t1_j4tg1o9",
                            "score": 4,
                            "created_utc": 1674013001.0,
                            "replies": [
                                {
                                    "body": "If you actually wanted to set a reddit remind me, you did it wrong.",
                                    "author": "Fair_Carrot_5591",
                                    "id": "j4tti9n",
                                    "parent_id": "t1_j4tivyx",
                                    "score": 2,
                                    "created_utc": 1674018399.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Saltine Daddies on this post: https://tenor.com/bHWGR.gif",
            "author": "DarkEyes87",
            "id": "j4qxo8t",
            "parent_id": "t1_j4qu07b",
            "score": 0,
            "created_utc": 1673976357.0,
            "replies": [
                {
                    "body": "🤣🤣🤣 they can keep their salt\nI'm on a full blown sugar high rn 🍭😜",
                    "author": "Fair_Carrot_5591",
                    "id": "j4qxwf8",
                    "parent_id": "t1_j4qxo8t",
                    "score": 5,
                    "created_utc": 1673976440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ohhh ok great! Amazing. There’s good men in this bowl. Thanks for confirming for everyone",
            "author": "Equivalent_Newt_6969",
            "id": "j4tiyfv",
            "parent_id": "t1_j4tio7z",
            "score": 2,
            "created_utc": 1674013032.0,
            "replies": []
        },
        {
            "body": "It's crazy to me that just because some men are incapable/ unwilling to be this generous with their SB, they project that on to ALL men making this kind of situation 'fan fiction'. \n\nWell those of us who have experienced this level of connection and generosity know it happens - and thankfully don't have to prove it to anyone because our amazing SRs (and bank balance) already provide significantly more satisfaction than any random internet opinions could 😊",
            "author": "-ittybittykitty_",
            "id": "j4r63it",
            "parent_id": "t1_j4qrv5z",
            "score": 8,
            "created_utc": 1673979426.0,
            "replies": [
                {
                    "body": "Couldn't have said it better 😁❤️",
                    "author": "Fair_Carrot_5591",
                    "id": "j4r88k2",
                    "parent_id": "t1_j4r63it",
                    "score": 1,
                    "created_utc": 1673980197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So happy to hear you’re being doted on ❤️ I hope I find that too 🥹",
            "author": "Realistic-Shoulder34",
            "id": "j7uzlly",
            "parent_id": "t1_j7uzcrf",
            "score": 2,
            "created_utc": 1675960386.0,
            "replies": [
                {
                    "body": "I hope you do, too!! Best wishes 🙏",
                    "author": "Fair_Carrot_5591",
                    "id": "j7wc7m4",
                    "parent_id": "t1_j7uzlly",
                    "score": 1,
                    "created_utc": 1675978372.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mine has black and platinum credit cards on my account so she can do the weekly shopping, buy clothes etc and go out with friends.   The arrangement though is I am there to look after her not her friends so if she goes out with them she has to go to places they can afford, not places they can’t paid for by me.    The second thing is she has them as long as she is responsible with them and if she misuses them they go.  She’s had them for a number of years now and so far I’ve never had a reason for concern.  We do have a bit of fun with them though for example if we go out for a good meal and everyone is thinking SR, she takes the check being offered to me (with a loudish “Let me get this” to me) and pulls out her black card to pay.  You can see the WTF look on the faces of the waiter and those seated near us 😂.  She loves that and also that she can go into a store in her own right and buy something, not be seen as an SB having stuff bought for her.\n\nOn this particular case though my only advice to the OP is put the money somewhere separate and budget it throughout the year or you will likely find it all gone by 6 months or less.   And then you will be effectively back to not having a monthly allowance and needing to ask for more or move on to live.   But it sounds like the OP is a good responsible person who will not abuse the trust placed in her as it is with my SB.  And that means a lot to me because it means she’s not just here for the money.",
            "author": "Dazzling_Truth6472",
            "id": "j4uj1hd",
            "parent_id": "t1_j4temv3",
            "score": 12,
            "created_utc": 1674037211.0,
            "replies": [
                {
                    "body": "Omg spoiled goals",
                    "author": "Maleficent_SB",
                    "id": "j4vsp9x",
                    "parent_id": "t1_j4uj1hd",
                    "score": 3,
                    "created_utc": 1674060141.0,
                    "replies": []
                },
                {
                    "body": "My SB also loves to pick up the check and, not surprisingly, likes to tip generously 😂",
                    "author": "NewPhoneWhoDis_916",
                    "id": "j5bhh8j",
                    "parent_id": "t1_j4uj1hd",
                    "score": 3,
                    "created_utc": 1674331767.0,
                    "replies": [
                        {
                            "body": "Mine is always telling me how much money she’s “saved” me 🤣",
                            "author": "Dazzling_Truth6472",
                            "id": "j69c22s",
                            "parent_id": "t1_j5bhh8j",
                            "score": 2,
                            "created_utc": 1674928966.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can I ask how old you are and if you consider yourself way more attractive than most SBs or is this a lucky arrangement?",
            "author": "Pastakingfifth",
            "id": "j4qv940",
            "parent_id": "t1_j4qu42s",
            "score": 5,
            "created_utc": 1673975472.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j4qx9ef",
                    "parent_id": "t1_j4qv940",
                    "score": 8,
                    "created_utc": 1673976209.0,
                    "replies": [
                        {
                            "body": "Fascinating, thank you for sharing!",
                            "author": "Pastakingfifth",
                            "id": "j4qylql",
                            "parent_id": "t1_j4qx9ef",
                            "score": 2,
                            "created_utc": 1673976697.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve never heard of that before! Thank you for sharing.",
            "author": "TheMaryJShow",
            "id": "j6i4sfs",
            "parent_id": "t1_j6gkcbo",
            "score": 2,
            "created_utc": 1675089160.0,
            "replies": []
        },
        {
            "body": "Absolutely not!\nWe had a great M&G and he INSISTED I take half of what the full PPM became when he was giving me PPM. \nAlmost 5x as much as any gift I have ever received on a M&G.\nA good SB should never ask for anything! In any kind of SR I want, I don't want to have to ask for things. A good SD just gives if he wants to, no need to ask.\n\nI never ask for anything, the discussion about moving to monthly was the only time I've asked for something, and wowza did I receive 🥹❤️\nOne thing this accomplishes,\nI can text him and invite myself over and stuff.... like I just did for tonight. \nThere's no expectations for anything and it feels more and more like a vanilla relationship now (apart from the daddy issues kink 🤭🤣).\n\nI'm living in the twilight zone, in a good way.",
            "author": "Fair_Carrot_5591",
            "id": "j4r1b2l",
            "parent_id": "t1_j4qyql8",
            "score": 11,
            "created_utc": 1673977679.0,
            "replies": [
                {
                    "body": "There you go, another reason why he trusts you. Don't let him down, it's going be hard to keep motivated.  \n\nThink about ways you could do that, e.g transfer money from one high interest account (monthly allowance) to another at the first of each month (assuming you are saving for a business).  Good luck!",
                    "author": "LondonSugarDaddy",
                    "id": "j4v2ta9",
                    "parent_id": "t1_j4r1b2l",
                    "score": 2,
                    "created_utc": 1674049619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There has been a commodifying of pretty much every online space.  It is sad.  Tumblr used to be this creative space, instagram too, even FB was cool in it's heyday.  Now it's some desperate elevator pitch from some sad stranger or old acquaintance trying to get you to buy into their mlm scheme.\n\nI think sugar is the same.  It used to be an elite club with certain unspoken norms.  Now it's the exact opposite.  The last time I used SA it was mostly middle income guys using deceit to buy sex and women just trying to survive.",
            "author": "Temporary-Dwelling",
            "id": "j4r7g6l",
            "parent_id": "t1_j4qyfy6",
            "score": 4,
            "created_utc": 1673979912.0,
            "replies": []
        },
        {
            "body": "I have to agree that's unusual. He's already given her a credit card that he pays off. He could give her a debit card with a high daily limit and the same amount of yearly allowance in it. That's worked really well for me. But it's his money if he wants to spoil her that way\n\nHe's going to have to deal with the tax consequences since it's a gift over the yearly limit and he's older and most likely well over the lifetime exclusion amount. And of course his children or other people he has in his estate plan could cause an issue. While the OP will have her perspective his family may see things very differently",
            "author": "sabordeazucar",
            "id": "j4r54xi",
            "parent_id": "t1_j4qyvwn",
            "score": 7,
            "created_utc": 1673979075.0,
            "replies": [
                {
                    "body": "You can give a way $12,000,000 during your life as gifts. don't believe me ask a professional.",
                    "author": "4rtknox",
                    "id": "j4svesa",
                    "parent_id": "t1_j4r54xi",
                    "score": 0,
                    "created_utc": 1674002872.0,
                    "replies": [
                        {
                            "body": "That was the lifetime exclusion I was referencing. It's scheduled to sunset in 2025 so it'll be cut in half. I was assuming that someone wealthy enough to spoil the OP has a net worth over that amount. So what happens is he can give up to that amount away while he's alive, report it to the IRS each year, and deduct it from his lifetime exclusion. When he passes away only what's left of the exclusion is tax free. So you're correct that he won't be paying gift taxes most likely during his life (unless he's already given away his lifetime exclusion) but his estate will eventually pay that tax if his net worth is over the lifetime exclusion amount (12/6 million). The sunsetting of this is a big deal for UHNW estates",
                            "author": "sabordeazucar",
                            "id": "j4t430r",
                            "parent_id": "t1_j4svesa",
                            "score": 5,
                            "created_utc": 1674006546.0,
                            "replies": [
                                {
                                    "body": "Thanks, this is a big deal",
                                    "author": "4rtknox",
                                    "id": "j4t6vh3",
                                    "parent_id": "t1_j4t430r",
                                    "score": 2,
                                    "created_utc": 1674007715.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It wasn't uncommon for SD's to give lump sums.\n\nMine suggested exactly this to ensure enthusiastic consent.  I was totally covered for the school year, tuition, rent, living expenses.  Then I got an allowance each month for fun, savings, investments.\n\nHe wanted me to want him, to be there because I wanted to be, to demonstrate I could trust him and to unskew some of the power dynamic so I would feel safe.",
            "author": "Temporary-Dwelling",
            "id": "j4r62yl",
            "parent_id": "t1_j4qyvwn",
            "score": 7,
            "created_utc": 1673979420.0,
            "replies": [
                {
                    "body": "Sounds amazing! Whenabouts did this take place? Guessing not within the past couple of years?",
                    "author": "uptiedand8",
                    "id": "j4rc4r9",
                    "parent_id": "t1_j4r62yl",
                    "score": 2,
                    "created_utc": 1673981615.0,
                    "replies": [
                        {
                            "body": "More than 5 years ago but less than 10.\n\nOnline sugar has entered it's crumbling late stage capitalism period.\n\nAs more and more desirable SB exit the bowl for better opportunities perhaps something better will emerge.",
                            "author": "Temporary-Dwelling",
                            "id": "j4redr0",
                            "parent_id": "t1_j4rc4r9",
                            "score": 4,
                            "created_utc": 1673982445.0,
                            "replies": [
                                {
                                    "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
                                    "author": "uptiedand8",
                                    "id": "j4riae1",
                                    "parent_id": "t1_j4redr0",
                                    "score": 3,
                                    "created_utc": 1673983891.0,
                                    "replies": [
                                        {
                                            "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                                            "author": "Insatiable_Learner",
                                            "id": "j4trzlu",
                                            "parent_id": "t1_j4riae1",
                                            "score": 3,
                                            "created_utc": 1674017548.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                                            "author": "SDstartingOut",
                                            "id": "j4x06nt",
                                            "parent_id": "t1_j4riae1",
                                            "score": 1,
                                            "created_utc": 1674076127.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm glad your family received her well... I hope to be so lucky!! Thank you for the hope!",
            "author": "Fair_Carrot_5591",
            "id": "j4rsswc",
            "parent_id": "t1_j4rsmsy",
            "score": 2,
            "created_utc": 1673987768.0,
            "replies": [
                {
                    "body": "There are a lot of people with no family to leave it to. I know several and that's just me.",
                    "author": "4rtknox",
                    "id": "j4sw1rh",
                    "parent_id": "t1_j4rsswc",
                    "score": 2,
                    "created_utc": 1674003142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He most likely is a very active, almost 70 year old. I'm sure he's not anywhere near senility. OP says he JUST retired.",
            "author": "DarkEyes87",
            "id": "j4qt91d",
            "parent_id": "t1_j4qrpqz",
            "score": 8,
            "created_utc": 1673974720.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j4qtsia",
            "parent_id": "t1_j4qrpqz",
            "score": 5,
            "created_utc": 1673974924.0,
            "replies": [
                {
                    "body": "> He is fully sound and competent. He signed trust documents during this time for her and her family too, so if his decisions made about me are not of sound mind, his decisions elsewhere can't be trusted to be of sound mind, stands to reason. 🤷‍♀️\n\nI would make sure that he has communicated that to them and that you have legal proof of this. The truth will not matter when his entitled family members with the money to sue you take you to court.",
                    "author": "Pastakingfifth",
                    "id": "j4qv0o4",
                    "parent_id": "t1_j4qtsia",
                    "score": 7,
                    "created_utc": 1673975385.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💗💗💗",
            "author": "P0sitiveViibes777",
            "id": "j4qmso7",
            "parent_id": "t1_j4qknqx",
            "score": 5,
            "created_utc": 1673972247.0,
            "replies": []
        },
        {
            "body": "yes, every SB should expect to be paid upfront for the whole year. wcgw.",
            "author": "xa3D",
            "id": "j4rvixg",
            "parent_id": "t1_j4qi03z",
            "score": 5,
            "created_utc": 1673988763.0,
            "replies": [
                {
                    "body": "I think it’s one of those situations where you need both a SD with the means to do it, as well as a responsible SB.  \n\nI’ve definitely talked with POTs who if they were given $40K on January 1st would somehow be unable to make rent on March 1st.",
                    "author": "SugarlifeAlt",
                    "id": "j4sk2p9",
                    "parent_id": "t1_j4rvixg",
                    "score": 2,
                    "created_utc": 1673998183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you’re not in the bowl, why are you spouting nonsense on SLF?",
            "author": "DarthDaddius",
            "id": "j4y48aq",
            "parent_id": "t1_j4qi03z",
            "score": 2,
            "created_utc": 1674092916.0,
            "replies": [
                {
                    "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                    "author": "DarkEyes87",
                    "id": "j4y5upg",
                    "parent_id": "t1_j4y48aq",
                    "score": 0,
                    "created_utc": 1674093616.0,
                    "replies": []
                },
                {
                    "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
                    "author": "DarkEyes87",
                    "id": "j4y5vnl",
                    "parent_id": "t1_j4y48aq",
                    "score": 0,
                    "created_utc": 1674093628.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not with him, guaranteed. \nHe wouldn't rent a house either. \nHe would buy it and if he didn't like it, eat the losses. \nTo each their own, no one is in charge of anyone else's fiscal responsibility.",
            "author": "Fair_Carrot_5591",
            "id": "j4tg1o9",
            "parent_id": "t1_j4t3xb3",
            "score": 3,
            "created_utc": 1674011697.0,
            "replies": [
                {
                    "body": "Remind me to check in 9 months.",
                    "author": "FerrumSagum",
                    "id": "j4tivyx",
                    "parent_id": "t1_j4tg1o9",
                    "score": 4,
                    "created_utc": 1674013001.0,
                    "replies": [
                        {
                            "body": "If you actually wanted to set a reddit remind me, you did it wrong.",
                            "author": "Fair_Carrot_5591",
                            "id": "j4tti9n",
                            "parent_id": "t1_j4tivyx",
                            "score": 2,
                            "created_utc": 1674018399.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣🤣🤣 they can keep their salt\nI'm on a full blown sugar high rn 🍭😜",
            "author": "Fair_Carrot_5591",
            "id": "j4qxwf8",
            "parent_id": "t1_j4qxo8t",
            "score": 5,
            "created_utc": 1673976440.0,
            "replies": []
        },
        {
            "body": "Couldn't have said it better 😁❤️",
            "author": "Fair_Carrot_5591",
            "id": "j4r88k2",
            "parent_id": "t1_j4r63it",
            "score": 1,
            "created_utc": 1673980197.0,
            "replies": []
        },
        {
            "body": "I hope you do, too!! Best wishes 🙏",
            "author": "Fair_Carrot_5591",
            "id": "j7wc7m4",
            "parent_id": "t1_j7uzlly",
            "score": 1,
            "created_utc": 1675978372.0,
            "replies": []
        },
        {
            "body": "Omg spoiled goals",
            "author": "Maleficent_SB",
            "id": "j4vsp9x",
            "parent_id": "t1_j4uj1hd",
            "score": 3,
            "created_utc": 1674060141.0,
            "replies": []
        },
        {
            "body": "My SB also loves to pick up the check and, not surprisingly, likes to tip generously 😂",
            "author": "NewPhoneWhoDis_916",
            "id": "j5bhh8j",
            "parent_id": "t1_j4uj1hd",
            "score": 3,
            "created_utc": 1674331767.0,
            "replies": [
                {
                    "body": "Mine is always telling me how much money she’s “saved” me 🤣",
                    "author": "Dazzling_Truth6472",
                    "id": "j69c22s",
                    "parent_id": "t1_j5bhh8j",
                    "score": 2,
                    "created_utc": 1674928966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j4qx9ef",
            "parent_id": "t1_j4qv940",
            "score": 8,
            "created_utc": 1673976209.0,
            "replies": [
                {
                    "body": "Fascinating, thank you for sharing!",
                    "author": "Pastakingfifth",
                    "id": "j4qylql",
                    "parent_id": "t1_j4qx9ef",
                    "score": 2,
                    "created_utc": 1673976697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There you go, another reason why he trusts you. Don't let him down, it's going be hard to keep motivated.  \n\nThink about ways you could do that, e.g transfer money from one high interest account (monthly allowance) to another at the first of each month (assuming you are saving for a business).  Good luck!",
            "author": "LondonSugarDaddy",
            "id": "j4v2ta9",
            "parent_id": "t1_j4r1b2l",
            "score": 2,
            "created_utc": 1674049619.0,
            "replies": []
        },
        {
            "body": "You can give a way $12,000,000 during your life as gifts. don't believe me ask a professional.",
            "author": "4rtknox",
            "id": "j4svesa",
            "parent_id": "t1_j4r54xi",
            "score": 0,
            "created_utc": 1674002872.0,
            "replies": [
                {
                    "body": "That was the lifetime exclusion I was referencing. It's scheduled to sunset in 2025 so it'll be cut in half. I was assuming that someone wealthy enough to spoil the OP has a net worth over that amount. So what happens is he can give up to that amount away while he's alive, report it to the IRS each year, and deduct it from his lifetime exclusion. When he passes away only what's left of the exclusion is tax free. So you're correct that he won't be paying gift taxes most likely during his life (unless he's already given away his lifetime exclusion) but his estate will eventually pay that tax if his net worth is over the lifetime exclusion amount (12/6 million). The sunsetting of this is a big deal for UHNW estates",
                    "author": "sabordeazucar",
                    "id": "j4t430r",
                    "parent_id": "t1_j4svesa",
                    "score": 5,
                    "created_utc": 1674006546.0,
                    "replies": [
                        {
                            "body": "Thanks, this is a big deal",
                            "author": "4rtknox",
                            "id": "j4t6vh3",
                            "parent_id": "t1_j4t430r",
                            "score": 2,
                            "created_utc": 1674007715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds amazing! Whenabouts did this take place? Guessing not within the past couple of years?",
            "author": "uptiedand8",
            "id": "j4rc4r9",
            "parent_id": "t1_j4r62yl",
            "score": 2,
            "created_utc": 1673981615.0,
            "replies": [
                {
                    "body": "More than 5 years ago but less than 10.\n\nOnline sugar has entered it's crumbling late stage capitalism period.\n\nAs more and more desirable SB exit the bowl for better opportunities perhaps something better will emerge.",
                    "author": "Temporary-Dwelling",
                    "id": "j4redr0",
                    "parent_id": "t1_j4rc4r9",
                    "score": 4,
                    "created_utc": 1673982445.0,
                    "replies": [
                        {
                            "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
                            "author": "uptiedand8",
                            "id": "j4riae1",
                            "parent_id": "t1_j4redr0",
                            "score": 3,
                            "created_utc": 1673983891.0,
                            "replies": [
                                {
                                    "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                                    "author": "Insatiable_Learner",
                                    "id": "j4trzlu",
                                    "parent_id": "t1_j4riae1",
                                    "score": 3,
                                    "created_utc": 1674017548.0,
                                    "replies": []
                                },
                                {
                                    "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                                    "author": "SDstartingOut",
                                    "id": "j4x06nt",
                                    "parent_id": "t1_j4riae1",
                                    "score": 1,
                                    "created_utc": 1674076127.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are a lot of people with no family to leave it to. I know several and that's just me.",
            "author": "4rtknox",
            "id": "j4sw1rh",
            "parent_id": "t1_j4rsswc",
            "score": 2,
            "created_utc": 1674003142.0,
            "replies": []
        },
        {
            "body": "> He is fully sound and competent. He signed trust documents during this time for her and her family too, so if his decisions made about me are not of sound mind, his decisions elsewhere can't be trusted to be of sound mind, stands to reason. 🤷‍♀️\n\nI would make sure that he has communicated that to them and that you have legal proof of this. The truth will not matter when his entitled family members with the money to sue you take you to court.",
            "author": "Pastakingfifth",
            "id": "j4qv0o4",
            "parent_id": "t1_j4qtsia",
            "score": 7,
            "created_utc": 1673975385.0,
            "replies": []
        },
        {
            "body": "I think it’s one of those situations where you need both a SD with the means to do it, as well as a responsible SB.  \n\nI’ve definitely talked with POTs who if they were given $40K on January 1st would somehow be unable to make rent on March 1st.",
            "author": "SugarlifeAlt",
            "id": "j4sk2p9",
            "parent_id": "t1_j4rvixg",
            "score": 2,
            "created_utc": 1673998183.0,
            "replies": []
        },
        {
            "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
            "author": "DarkEyes87",
            "id": "j4y5upg",
            "parent_id": "t1_j4y48aq",
            "score": 0,
            "created_utc": 1674093616.0,
            "replies": []
        },
        {
            "body": "I'm just interested in relationships. I'm on dating subs. I *was* a huge reality show relationship junky as well. \n\nI'm just interested in the dynamics. I can't really date at the moment, living through others till later in the year.",
            "author": "DarkEyes87",
            "id": "j4y5vnl",
            "parent_id": "t1_j4y48aq",
            "score": 0,
            "created_utc": 1674093628.0,
            "replies": []
        },
        {
            "body": "Remind me to check in 9 months.",
            "author": "FerrumSagum",
            "id": "j4tivyx",
            "parent_id": "t1_j4tg1o9",
            "score": 4,
            "created_utc": 1674013001.0,
            "replies": [
                {
                    "body": "If you actually wanted to set a reddit remind me, you did it wrong.",
                    "author": "Fair_Carrot_5591",
                    "id": "j4tti9n",
                    "parent_id": "t1_j4tivyx",
                    "score": 2,
                    "created_utc": 1674018399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mine is always telling me how much money she’s “saved” me 🤣",
            "author": "Dazzling_Truth6472",
            "id": "j69c22s",
            "parent_id": "t1_j5bhh8j",
            "score": 2,
            "created_utc": 1674928966.0,
            "replies": []
        },
        {
            "body": "Fascinating, thank you for sharing!",
            "author": "Pastakingfifth",
            "id": "j4qylql",
            "parent_id": "t1_j4qx9ef",
            "score": 2,
            "created_utc": 1673976697.0,
            "replies": []
        },
        {
            "body": "That was the lifetime exclusion I was referencing. It's scheduled to sunset in 2025 so it'll be cut in half. I was assuming that someone wealthy enough to spoil the OP has a net worth over that amount. So what happens is he can give up to that amount away while he's alive, report it to the IRS each year, and deduct it from his lifetime exclusion. When he passes away only what's left of the exclusion is tax free. So you're correct that he won't be paying gift taxes most likely during his life (unless he's already given away his lifetime exclusion) but his estate will eventually pay that tax if his net worth is over the lifetime exclusion amount (12/6 million). The sunsetting of this is a big deal for UHNW estates",
            "author": "sabordeazucar",
            "id": "j4t430r",
            "parent_id": "t1_j4svesa",
            "score": 5,
            "created_utc": 1674006546.0,
            "replies": [
                {
                    "body": "Thanks, this is a big deal",
                    "author": "4rtknox",
                    "id": "j4t6vh3",
                    "parent_id": "t1_j4t430r",
                    "score": 2,
                    "created_utc": 1674007715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More than 5 years ago but less than 10.\n\nOnline sugar has entered it's crumbling late stage capitalism period.\n\nAs more and more desirable SB exit the bowl for better opportunities perhaps something better will emerge.",
            "author": "Temporary-Dwelling",
            "id": "j4redr0",
            "parent_id": "t1_j4rc4r9",
            "score": 4,
            "created_utc": 1673982445.0,
            "replies": [
                {
                    "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
                    "author": "uptiedand8",
                    "id": "j4riae1",
                    "parent_id": "t1_j4redr0",
                    "score": 3,
                    "created_utc": 1673983891.0,
                    "replies": [
                        {
                            "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                            "author": "Insatiable_Learner",
                            "id": "j4trzlu",
                            "parent_id": "t1_j4riae1",
                            "score": 3,
                            "created_utc": 1674017548.0,
                            "replies": []
                        },
                        {
                            "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                            "author": "SDstartingOut",
                            "id": "j4x06nt",
                            "parent_id": "t1_j4riae1",
                            "score": 1,
                            "created_utc": 1674076127.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you actually wanted to set a reddit remind me, you did it wrong.",
            "author": "Fair_Carrot_5591",
            "id": "j4tti9n",
            "parent_id": "t1_j4tivyx",
            "score": 2,
            "created_utc": 1674018399.0,
            "replies": []
        },
        {
            "body": "Thanks, this is a big deal",
            "author": "4rtknox",
            "id": "j4t6vh3",
            "parent_id": "t1_j4t430r",
            "score": 2,
            "created_utc": 1674007715.0,
            "replies": []
        },
        {
            "body": "It is interesting to me that I've seen a lot of complaints from men that SA has gone downhill in the past couple of years in terms of the quality of women available. And by quality, they mean looks of course. Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct). \n\nI would have guessed that there would still be plenty of pretty 23 year old girls on the site, as I'm not sure that the other looks-related moneymaking options have gotten better for those of us who are attractive but not literal models. But maybe I'm wrong about that? Or maybe, given that more men are entering the bowl as well, the male competition has gotten fiercer at the same time?\n\nI'm pretty curious about all this. \n\nAt this point in my life, I would not be interested in the market rate PPMs on offer, and am fine just working my vanilla job. I'd sooner try driving for Uber Eats as a side gig, after doing research on today's bowl. Perhaps women who aren't desperate feel the same as I do, whereas we would be on SA if we thought we could make more substantial amounts of money from it and deal with nicer men. Leaving only those women who are truly broke. I guess that's one theory I have.\n\nJust a random thought: I've also noticed that while some women view vanilla relationships as ultimately preferable, others enter the bowl because they have terrible vanilla experiences and think, \"I might as well get paid for this!\" Maybe the latter group is more likely to stick around, while the former group has just gone back to vanilla dating? I suppose it's possible that the second group helps drive down prices somewhat, too. I'm not sure what overall effect this has had on the competition though.",
            "author": "uptiedand8",
            "id": "j4riae1",
            "parent_id": "t1_j4redr0",
            "score": 3,
            "created_utc": 1673983891.0,
            "replies": [
                {
                    "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
                    "author": "Insatiable_Learner",
                    "id": "j4trzlu",
                    "parent_id": "t1_j4riae1",
                    "score": 3,
                    "created_utc": 1674017548.0,
                    "replies": []
                },
                {
                    "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
                    "author": "SDstartingOut",
                    "id": "j4x06nt",
                    "parent_id": "t1_j4riae1",
                    "score": 1,
                    "created_utc": 1674076127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would love to see categories or levels emerge. For instance, I'm a Splenda baby (due to lower looks) for a Splenda daddy (due to amount of support), or maybe I'm a sugarMILF (due to age), etc. And very broke. 😉 So I'm entering the bowl with the mindset of \"Is it okay that I'm asking for low xxx ppm? As a human I'm priceless, but as a contributor to a relationship, how much value do I bring?\" Ultimately, I decide WHO I want to spend my time with, WHAT I want to do with them, and then focus on an arrangement that is mutually sustainable for us.\n\nThe idea of being completely supported in a luxury lifestyle sounds jarring to me. Since I'm not in an elite category of beauty, etc, it isn't likely to come up though. 😅",
            "author": "Insatiable_Learner",
            "id": "j4trzlu",
            "parent_id": "t1_j4riae1",
            "score": 3,
            "created_utc": 1674017548.0,
            "replies": []
        },
        {
            "body": "> Probably depends on geographic location, but still, I am curious where all the more attractive women have gone (assuming their assessments are correct).\n\nTo be blunt?  They didn't go anywhere.  They are still on seeking.  Many of them are just not that attractive anymore.\n\nWhile there are always variances in people's standards of beauty - being slim/fit/in shape is still the one that tops the majority of men's lists.  Especially during covid, a lot of people put even more weight on, pushing them further outside the 'attractive' zone.",
            "author": "SDstartingOut",
            "id": "j4x06nt",
            "parent_id": "t1_j4riae1",
            "score": 1,
            "created_utc": 1674076127.0,
            "replies": []
        }
    ]
}