{
    "title": "TW -- SD assault -- advice please",
    "post_id": "k3ik7c",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k3ik7c/tw_sd_assault_advice_please/",
    "author": null,
    "body": "Trigger Warning -- sexual assault. Made a throwaway acc for this. I've (F 21) been in the bowl for about 2 years. Have had mostly good experiences. I've been with this SD for about 8 months now and we've had a great relationship. He's attractive, attentive, kind, and funny. He's married and works at my university (though I'd probably never see him, he's in admin in a different department). We met on SA and meet usually once a week, sometimes twice, for platonic and non-platonic dates. \n\nJust as a personal preference, I don't do anal ever. I've told him this plenty of times. Last night we smoked a little. After that, while I was laying face-down on the couch it happened. I don't want to get into detail but I clearly said things like \"I don't want to do this,\" \"It hurts too much\" \"I don't like this,\" etc. When he asked me if I wanted to stop, I said yes, but he kept going. It's the next day now and he's apologized 1,000,000 times through text, telling me how bad he feels and that he didn't realize that I was so upset. This behavior was so unlike anything I've ever seen from him -- it is the first time this has ever happened with him. I am still in shock. \n\nI'm not sure why I'm posting, maybe just to feel less alone and see if other SB's have had similar experiences as well? Obviously our relationship is over, but it just feels so shitty. This is not the first time this has happened to me, but this is a first from a non-vanilla relationship. Do you guys have any suggestions as to what I should do?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/k3ik7c/tw_sd_assault_advice_please/",
    "score": 162,
    "upvote_ratio": 0.97,
    "created_utc": 1606687993.0,
    "num_comments": 90,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "SD here.  \n\nHe raped you.\n\nSee a counselor. Talk to a friend of family member to decide if you want to report.\n\nThere would be fallout if you did, but rapist don't typically stop with just one victim.\n\nStay safe, and take the recovery that you need.",
            "author": null,
            "id": "ge3m5a7",
            "parent_id": "t3_k3ik7c",
            "score": 159,
            "created_utc": 1606696847.0,
            "replies": [
                {
                    "body": "I second this. Counselor here, you said this has happened before. This tells me you've likely grown up with unsafe people and this may make red flags seem normal to you. Therapy will not only help you process what happened but help you realign what healthy behaviors and boundaries are ❤️ boundaries keep us safe.  I'm sorry this happened to you",
                    "author": "LolaPastelle",
                    "id": "ge49yku",
                    "parent_id": "t1_ge3m5a7",
                    "score": 56,
                    "created_utc": 1606710688.0,
                    "replies": [
                        {
                            "body": "thirding this - I've been in your shoes and there were likely red flags you missed due to bad treatment prior. This kind of event will keep occurring if you don't seek out therapy or some other way to address the past abuse and learn what the signs are so you can protect yourself. I'm sorry OP, you didn't deserve this but there are things you can do to take back power and stop this happening again. It starts with realising what you're not picking up on.",
                            "author": "hopefulcaterpiller",
                            "id": "ge5qhtu",
                            "parent_id": "t1_ge49yku",
                            "score": 12,
                            "created_utc": 1606752756.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sorry to say I agree with this. Seek help I promise even if you don’t think you need it right now dude you’ll regret not talking to someone sooner. I’m sorry that happened to you. Hope nothing like that ever happens again",
                    "author": "Sarararalalala",
                    "id": "ge4vg43",
                    "parent_id": "t1_ge3m5a7",
                    "score": 13,
                    "created_utc": 1606729369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Keep his text as proof of you go to police. Also BS he didn't know.\n\nYou said no you said it hurts. He knew.",
            "author": "lovelychef87",
            "id": "ge3oe6t",
            "parent_id": "t3_k3ik7c",
            "score": 67,
            "created_utc": 1606698153.0,
            "replies": [
                {
                    "body": "This too bro even if you don’t want to look at them",
                    "author": "Sarararalalala",
                    "id": "ge4vgwo",
                    "parent_id": "t1_ge3oe6t",
                    "score": 14,
                    "created_utc": 1606729394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3a6o6",
            "parent_id": "t3_k3ik7c",
            "score": 116,
            "created_utc": 1606690453.0,
            "replies": [
                {
                    "body": "Definitely a weird power dynamic",
                    "author": "LinditaBonita",
                    "id": "ge3k7i3",
                    "parent_id": "t1_ge3a6o6",
                    "score": 17,
                    "created_utc": 1606695755.0,
                    "replies": []
                },
                {
                    "body": "maybe don't block him if that will delete texts because they could be used as evidence if OP decides to report. Maybe make a report with the uni?",
                    "author": "hopefulcaterpiller",
                    "id": "ge5qluf",
                    "parent_id": "t1_ge3a6o6",
                    "score": 6,
                    "created_utc": 1606752813.0,
                    "replies": []
                },
                {
                    "body": "! This too pls block him, he’s clearly manipulative enough to do what he did to you so please stay away from him",
                    "author": "Sarararalalala",
                    "id": "ge4vila",
                    "parent_id": "t1_ge3a6o6",
                    "score": 5,
                    "created_utc": 1606729448.0,
                    "replies": []
                },
                {
                    "body": "This.",
                    "author": "_babysnek_",
                    "id": "ge4b53k",
                    "parent_id": "t1_ge3a6o6",
                    "score": 3,
                    "created_utc": 1606711473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah... no. When it comes to rape and sexual assault, that's a hard line. Apologising doesn't change the fact that he violated you, and no amount of money makes that ok.\n\nDrop him, block him, and consider whether you're up for reporting it to your doctor / the police, if only to get it on file -- guys like that don't respond well when told \"no\" and he might not appreciate the relationship being over.",
            "author": "allyafterdark",
            "id": "ge3lsmc",
            "parent_id": "t3_k3ik7c",
            "score": 24,
            "created_utc": 1606696647.0,
            "replies": [
                {
                    "body": "I agree to filing. Get a rape kit and put his name in the database. You don't need to take him to court. If he does this to someone else and his info is already in the database he's screwed. So help the next woman's case if you don't want to press charges yourself.",
                    "author": null,
                    "id": "ge3veyn",
                    "parent_id": "t1_ge3lsmc",
                    "score": 16,
                    "created_utc": 1606702147.0,
                    "replies": [
                        {
                            "body": "Absolutely. However /u/jc8990 wants to deal with things herself, absolutely get checked out and tested as a hospital, and file with the relevant authorities. You don't have to stick your head above the parapet to make sure he won't get away with doing it again.",
                            "author": "allyafterdark",
                            "id": "ge3wljk",
                            "parent_id": "t1_ge3veyn",
                            "score": 8,
                            "created_utc": 1606702797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd suggest getting an omission of guilt from him, an apology would suffice, recorded, in writing, whatever and filing a civil suit.  A criminal suit would be an uphill battle.  He works for a university, he will be highly incentivized to settle.  Take him to the cleaners so you never need to sugar again.",
            "author": "sugarsenior2",
            "id": "ge3lomo",
            "parent_id": "t3_k3ik7c",
            "score": 88,
            "created_utc": 1606696584.0,
            "replies": [
                {
                    "body": "*An admission of guilt. But she should be careful about recording anything without his knowlege in a state that has rules against this. Some states make this a crime. If he write anything, it needs to be properly authenticated. Doubt he'd get it notarized or do a declaration/affidavit under penalty of perjury, but that's a start. The text measages are probably her best bet. She should save them. I might not block him before she gets him to text or email about what he did to her. And I wouldn't tell her a criminal suit was an uphill battle, only that she needs to report this asap if she was interested in such a thing.",
                    "author": "Legal54",
                    "id": "ge3wrfe",
                    "parent_id": "t1_ge3lomo",
                    "score": 27,
                    "created_utc": 1606702884.0,
                    "replies": []
                },
                {
                    "body": "OP should do criminal first. No it probably won’t get processed, but it will help that she at least tries. In a civil case they’ll factor in if she pressed those charges.",
                    "author": null,
                    "id": "ge3zji0",
                    "parent_id": "t1_ge3lomo",
                    "score": 12,
                    "created_utc": 1606704394.0,
                    "replies": [
                        {
                            "body": "I'm kind of banking on him feeling intense pressure to immediately settle, but yes you are quite correct.",
                            "author": "sugarsenior2",
                            "id": "ge7hitp",
                            "parent_id": "t1_ge3zji0",
                            "score": 3,
                            "created_utc": 1606782185.0,
                            "replies": [
                                {
                                    "body": "I hope he immediately settles but gotta play strong. If it’s criminal than the state presses charges typically- she just allows them to use all of her evidence. Then once that happens civil is the next best thing. Sodomy is illegal and she has his omission of guilt already so she could really win",
                                    "author": null,
                                    "id": "ge7thc2",
                                    "parent_id": "t1_ge7hitp",
                                    "score": 1,
                                    "created_utc": 1606788481.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I like this comment best",
                    "author": null,
                    "id": "ge3mvk1",
                    "parent_id": "t1_ge3lomo",
                    "score": 13,
                    "created_utc": 1606697269.0,
                    "replies": []
                },
                {
                    "body": "This is great advice",
                    "author": "naiadnyx96",
                    "id": "ge3ninp",
                    "parent_id": "t1_ge3lomo",
                    "score": 10,
                    "created_utc": 1606697638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s a rapist, and I’m so sorry you had to go through this. Everyone here seems to share a common sentiment, which is that he should be reported. \n\nMy recommendation would be to AT LEAST get an official rape kit done, and then decide afterwards if you want to press charges. At that point,‘ you’d have the evidence ready; as opposed to deciding to go through with it later, and not having anything concrete. \n\nAlso, screenshot and save the apology texts and his attempts to contact you. It can also be useful in the future, should you decide to turn this over to the police. Other than that, take some time to heal and process what happened; and feel free to reach out to this sub should you need any help or support",
            "author": "deuseyed",
            "id": "ge3sp0s",
            "parent_id": "t3_k3ik7c",
            "score": 14,
            "created_utc": 1606700627.0,
            "replies": []
        },
        {
            "body": "Please file a police report before he does this to another student. He has done this before, he will do it again. \n\nIf you go to the emergency room for a rape kit, you absolutely do not have to file a formal complaint right that second. You can secure the evidence now & decide later.",
            "author": "aaaltaltalttt",
            "id": "ge3g76j",
            "parent_id": "t3_k3ik7c",
            "score": 60,
            "created_utc": 1606693600.0,
            "replies": [
                {
                    "body": "Question out of ignorance......  you may not have to file but does the hospital have to file?  \n\n\n\nAlternate strategy while you contemplate additional actions-\n\n \"I have preserved your text messages apologizing for ( confessing to)  having anally raped me despite my verbal and physical attempts to stop you.\"   That is FORCEABLE RAPE.......... \n\n  I have instructed you not to contact me  and any further contact is a potential additional felony offense.\n\nTAKING CARE OF YOU -\nWhile you consider your options  see a counselor, skilled in sexual abuse cases and who may be not only able to help your recovery but also help you come to decisions on how you handle the legal side of it.  Also consider that anal sex carries with it an exponentially higher risk of disease transmission to you. \n\nPut him at risk - criminal/civil/divorce/employment \n(this is the Halderman Principle at work -\n\n \"when you have them by the balls their hearts and minds will surely follow\")",
                    "author": "pinotandsugar",
                    "id": "ge3wh62",
                    "parent_id": "t1_ge3g76j",
                    "score": 12,
                    "created_utc": 1606702732.0,
                    "replies": [
                        {
                            "body": "No the hospital won’t automatically file. They’ll keep the evidence for in the future if she wants to press charges. They’ll also give resources to counselors. Definitely KEEP the text messages he sent you as evidence.",
                            "author": null,
                            "id": "ge3zgdb",
                            "parent_id": "t1_ge3wh62",
                            "score": 8,
                            "created_utc": 1606704345.0,
                            "replies": [
                                {
                                    "body": "thanks",
                                    "author": "pinotandsugar",
                                    "id": "ge41cyf",
                                    "parent_id": "t1_ge3zgdb",
                                    "score": 2,
                                    "created_utc": 1606705468.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You should tell the administration and sue him. As hard as it is, you may want to consider filing a report so this doesn’t happen to someone else",
            "author": "BrushStreet9617",
            "id": "ge3f16x",
            "parent_id": "t3_k3ik7c",
            "score": 28,
            "created_utc": 1606692991.0,
            "replies": []
        },
        {
            "body": "He's a rapist. No means no. He can apologize 10 million times and that doesn't make it any more acceptable. This is who he is, no matter how charming he appears to be. He's more worried about the aftermath for himself than for you, should you decide to file a report. More disconcerting is that you say this isn't the first time this has happened to you. It isn't your fault anytime, but maybe you need to re-evaluate some things.",
            "author": "Intrepid_Seeker",
            "id": "ge3aaxi",
            "parent_id": "t3_k3ik7c",
            "score": 59,
            "created_utc": 1606690516.0,
            "replies": []
        },
        {
            "body": "I'm sorry to hear this, especially that this happened with someone you were together for quite some time. I just don't get why some people can't register anything that means no. Please put yourself first and heal before anything. Hugs.",
            "author": "macaroonqueen",
            "id": "ge36dto",
            "parent_id": "t3_k3ik7c",
            "score": 32,
            "created_utc": 1606688486.0,
            "replies": []
        },
        {
            "body": "Have a hot bath with epstom salts. It will help with the soreness and promote healing. Best of luck to you girl xx",
            "author": "zeekaq",
            "id": "ge36x33",
            "parent_id": "t3_k3ik7c",
            "score": 27,
            "created_utc": 1606688762.0,
            "replies": []
        },
        {
            "body": "That was rape and you need to report him.",
            "author": null,
            "id": "ge3bqu6",
            "parent_id": "t3_k3ik7c",
            "score": 41,
            "created_utc": 1606691271.0,
            "replies": []
        },
        {
            "body": "He raped you, it won’t get better. I’m really sorry, it’s an awful thing to happen. Please stay safe and stay away from him. He’s disgusting.",
            "author": "kirathekira",
            "id": "ge3hdjq",
            "parent_id": "t3_k3ik7c",
            "score": 17,
            "created_utc": 1606694217.0,
            "replies": []
        },
        {
            "body": "Lawyer. Now.",
            "author": "KeyToGramercy",
            "id": "ge3mo1e",
            "parent_id": "t3_k3ik7c",
            "score": 18,
            "created_utc": 1606697148.0,
            "replies": []
        },
        {
            "body": "I honestly would call the police and explain what happened along with going to the hospital. You need medical attention. \n\nI was sexually assaulted in a vanilla relationship. It feels weird regardless.",
            "author": null,
            "id": "ge3pkla",
            "parent_id": "t3_k3ik7c",
            "score": 9,
            "created_utc": 1606698844.0,
            "replies": []
        },
        {
            "body": "Get a rape kit done ASAP; talk to a civil atty; maybe title 9 if he knows who you are through the school?",
            "author": null,
            "id": "ge3z3tz",
            "parent_id": "t3_k3ik7c",
            "score": 10,
            "created_utc": 1606704147.0,
            "replies": []
        },
        {
            "body": "Hello, I don't use reddit often so I'm not sure how this works -- I hope everyone's able to see this comment. First of all, thank you so much for everyone that has written with helpful and kind suggestions. It has made me feel a lot better and more sure of myself. I have contacted a counselor @ my school so that I can learn about what next steps I can take. We will talk later today. My closest friend knows everything and is very supportive. I am heavily considering reporting, but am nervous about that.\n\nSecond, I have seen a few comments about how I should protect myself more, as this is not the first time I have been assaulted. It's happened two times before: both with men that had been solid members of two different friend groups -- everyone loved them. I had known one for 4 years and one for 2. Y'all fail to consider that anyone can be a predator, it's not always a random person or someone you just met. Please educate yourselves!",
            "author": null,
            "id": "ge5otgy",
            "parent_id": "t3_k3ik7c",
            "score": 9,
            "created_utc": 1606751916.0,
            "replies": [
                {
                    "body": "> it's not always a random person or someone you just met.\n\nIt's actually rarely a random person or someone you just met. Most victims know their assaulter.",
                    "author": "narkflint",
                    "id": "ge5xoew",
                    "parent_id": "t1_ge5otgy",
                    "score": 3,
                    "created_utc": 1606756265.0,
                    "replies": []
                },
                {
                    "body": "Glad to hear you're seeking counsel. I hope things go well and this is your last assault.",
                    "author": null,
                    "id": "ge60arw",
                    "parent_id": "t1_ge5otgy",
                    "score": 2,
                    "created_utc": 1606757520.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry this happened to you, what he did was NOT acceptable",
            "author": "slowdownrealfast",
            "id": "ge3ih9w",
            "parent_id": "t3_k3ik7c",
            "score": 12,
            "created_utc": 1606694808.0,
            "replies": []
        },
        {
            "body": "I am so very sorry this happened to you. Radiating love and support towards you. It is not your fault. Don’t let some of the ignorant questions here get in your head, he very clearly violated you. He committed a crime.",
            "author": "naiadnyx96",
            "id": "ge3nfhu",
            "parent_id": "t3_k3ik7c",
            "score": 5,
            "created_utc": 1606697589.0,
            "replies": []
        },
        {
            "body": "Vanilla or Sugar, consent is consent and rape is rape.\n\nYou need medical attention and get a girlfriend or two for support and go down and file so there’s a record  (paper trail) in case you choose to move forward criminally or in civil court.\n\nBut before you make any decision, go see (or call during covid) first so you can begin healing first.\n\nHe has done this before, and he’ll do it again, you had zero to with his actions that are that of a subhuman.",
            "author": "DFWCouple4SB",
            "id": "ge41hhx",
            "parent_id": "t3_k3ik7c",
            "score": 6,
            "created_utc": 1606705544.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you and hope you will consider going to the police and lawyering up.",
            "author": "roscoe7585",
            "id": "ge3s0ey",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606700246.0,
            "replies": []
        },
        {
            "body": "I am so sorry this happened. This is violation of consent, so rape. You might want to file a police report. Also,  assuming that you are undergrad, relationships between students and admins are probably prohibited by your university policy and you might seek counsel from the relevant office in your university.",
            "author": "camembert2",
            "id": "ge3s470",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606700304.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you. Break all contact with him and seek support for yourself in terms of counseling if you feel you need it. If you choose to report it to the police, great! If you feel you can't handle that, it's okay. The important thing is that you take care of yourself right now. ((hugs))",
            "author": null,
            "id": "ge3swkv",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606700746.0,
            "replies": []
        },
        {
            "body": "I am so sorry this happened to you. A similar thing happened to me but it wasn’t in a sugar relationship. It’s scary and traumatic to say the least. Again I’m so sorry this happened to you",
            "author": "Lilac-fairy",
            "id": "ge4h76h",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606715947.0,
            "replies": []
        },
        {
            "body": "That's rape.",
            "author": "SuperduperDUCKS",
            "id": "ge4hxgq",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606716544.0,
            "replies": []
        },
        {
            "body": "Peg him when he falls asleep",
            "author": "Lilybb16",
            "id": "ge5s1l2",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606753522.0,
            "replies": []
        },
        {
            "body": "In my book this is assault. Whether a day, months, or years in the relationship this should never have happened. He disrespected you and abused you. Whether you will report him or not is probably a difficult call for you, you should though, and at minimum you should never see him again, unless in court.",
            "author": "zebulon999",
            "id": "ge3gw77",
            "parent_id": "t3_k3ik7c",
            "score": 5,
            "created_utc": 1606693964.0,
            "replies": []
        },
        {
            "body": "File a report, or it will happen again and a chain of events could be devastating.\n\nIf you feel it's not worth your time and to just simply move on, well that is understandable too.",
            "author": "FFBraver",
            "id": "ge3hwrm",
            "parent_id": "t3_k3ik7c",
            "score": 5,
            "created_utc": 1606694509.0,
            "replies": []
        },
        {
            "body": "Hey babe - \n\nI'm sorry that this isn't the first time that this has happened to you. Please reach out to any friends (online or IRL) who you feel as though could support you without judgment - just because it happened in an SB/SD relationship doesn't mean that it's any less destructive, hurtful, or upsetting. \n\nIMO, and in my experience, a man who proves that he will go past your boundaries won't only do it once. Please take care of yourself, and prioritize your own safety. We're here for you if you need. xx.",
            "author": "thotaway123",
            "id": "ge3h0gx",
            "parent_id": "t3_k3ik7c",
            "score": 6,
            "created_utc": 1606694028.0,
            "replies": []
        },
        {
            "body": "Call police",
            "author": "mandingoBBC",
            "id": "ge3gsji",
            "parent_id": "t3_k3ik7c",
            "score": 3,
            "created_utc": 1606693912.0,
            "replies": []
        },
        {
            "body": "I’m so sorry this happened! Wtf from 8 months of good to this?!?! It does make being in the sugar bowl scary. Just take a break to heal and reflect and see a counselor. I’m sure as a student you can get one for free.",
            "author": null,
            "id": "ge3x6z0",
            "parent_id": "t3_k3ik7c",
            "score": 2,
            "created_utc": 1606703112.0,
            "replies": []
        },
        {
            "body": "Do not blackmail him as someone else suggested, that is a crime.",
            "author": "SuperduperDUCKS",
            "id": "ge4i0q1",
            "parent_id": "t3_k3ik7c",
            "score": 2,
            "created_utc": 1606716619.0,
            "replies": []
        },
        {
            "body": "Talk to a local legal expert and people who have experience with how rape victims are actually treated IN THAT LOCATION. You are getting a lot of well meaning advice here from people who don't even know what jurisdiction you are in, much less the laws or practicalities of how it works. You aren't required to save the world and reporting can be like getting raped all over again.",
            "author": "EvilDomGM",
            "id": "ge54uz6",
            "parent_id": "t3_k3ik7c",
            "score": 2,
            "created_utc": 1606739234.0,
            "replies": []
        },
        {
            "body": "Definitely rape. It's your body, you choose.",
            "author": "Grouchy_Ad_355",
            "id": "ge5cob6",
            "parent_id": "t3_k3ik7c",
            "score": 2,
            "created_utc": 1606745154.0,
            "replies": []
        },
        {
            "body": "This is rape report this pig",
            "author": "Lilybb16",
            "id": "ge5qnli",
            "parent_id": "t3_k3ik7c",
            "score": 2,
            "created_utc": 1606752837.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3dajv",
            "parent_id": "t3_k3ik7c",
            "score": 7,
            "created_utc": 1606692096.0,
            "replies": [
                {
                    "body": "ya this is very bad idea.  \n\nExtortion is a crime and you don't want to match his crime with committing one yourself. \n\nReport him as a crime not to the administration but to law enforcement or block and move on.",
                    "author": "craa141",
                    "id": "ge3hzmg",
                    "parent_id": "t1_ge3dajv",
                    "score": 18,
                    "created_utc": 1606694550.0,
                    "replies": [
                        {
                            "body": "Or explore an actual, above the board civil suit",
                            "author": null,
                            "id": "ge3tnqg",
                            "parent_id": "t1_ge3hzmg",
                            "score": 3,
                            "created_utc": 1606701174.0,
                            "replies": [
                                {
                                    "body": "Or this.. sorry not in the US so I forget that is a viable option.",
                                    "author": "craa141",
                                    "id": "ge4cxom",
                                    "parent_id": "t1_ge3tnqg",
                                    "score": 3,
                                    "created_utc": 1606712723.0,
                                    "replies": [
                                        {
                                            "body": "Oh darn. Yeah I just assumed she’s in the US.",
                                            "author": null,
                                            "id": "ge5i3j9",
                                            "parent_id": "t1_ge4cxom",
                                            "score": 1,
                                            "created_utc": 1606748412.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That approach is a felony.",
                    "author": "garret6758",
                    "id": "ge41q46",
                    "parent_id": "t1_ge3dajv",
                    "score": 3,
                    "created_utc": 1606705688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge38403",
            "parent_id": "t3_k3ik7c",
            "score": 0,
            "created_utc": 1606689379.0,
            "replies": [
                {
                    "body": "Don't listen to this clown.",
                    "author": "miss_cheongfun",
                    "id": "ge3kxbl",
                    "parent_id": "t1_ge38403",
                    "score": 11,
                    "created_utc": 1606696155.0,
                    "replies": []
                },
                {
                    "body": "OP can absolutely report this to law enforcement. It’s illegal to rape someone no matter what relationship/arrangement may exist.",
                    "author": "naiadnyx96",
                    "id": "ge3mycw",
                    "parent_id": "t1_ge38403",
                    "score": 8,
                    "created_utc": 1606697314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ge3a0ry",
            "parent_id": "t3_k3ik7c",
            "score": -7,
            "created_utc": 1606690370.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge3be2w",
                    "parent_id": "t1_ge3a0ry",
                    "score": 18,
                    "created_utc": 1606691086.0,
                    "replies": [
                        {
                            "body": "My favorite sub 😅",
                            "author": null,
                            "id": "ge3ei12",
                            "parent_id": "t1_ge3be2w",
                            "score": 2,
                            "created_utc": 1606692717.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "if you dont go to the cops your putting others at risk",
            "author": "International_Lab_73",
            "id": "ge3r0kw",
            "parent_id": "t3_k3ik7c",
            "score": -5,
            "created_utc": 1606699677.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge39mzl",
            "parent_id": "t3_k3ik7c",
            "score": -18,
            "created_utc": 1606690175.0,
            "replies": [
                {
                    "body": "You should know that what has happened in her previous relationships is completely irrelevant to what happened in this one. But also, some of your questions are definitely resulting in victim blaming. \n\n> Had you guys engaged in non-PIA ass play before?\n\nThis doesn’t matter since she had expressed that she doesn’t do anal sex ever and she’s told him plenty of times. From this comment alone, the SD was well-informed that she doesn’t want to participate in that event and he wasn’t allowed to insert his P into her A. He had no consent! \n\n> Had he gone from no ass play to anal rape in one fell thrust, or was there a slippery slope with markers ignored? \n\nA slippery slope doesn’t exist when she has expressed to him many times that she doesn’t do anal ever. \n\n> Was consensual non-consent or play-struggle part of your dynamic? \n\nThis is irrelevant since she told him that she never does anal. \n\n- I'm wondering if there's anything you can do to make sure that this doesn't happen for a fourth or fifth time?\n\nInstead of wondering that, why don’t you wonder about why a guy didn’t respect her wishes, her body, engaged in an act where he had no consent, aka raped her, and continued to do so after she told him: “ \"I don't want to do this,\" \"It hurts too much\" \"I don't like this,\" etc.“\n\nSeriously, your comment is crap.",
                    "author": "tahliawetnwild",
                    "id": "ge3mg5n",
                    "parent_id": "t1_ge39mzl",
                    "score": 14,
                    "created_utc": 1606697023.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge3ndsq",
                            "parent_id": "t1_ge3mg5n",
                            "score": -2,
                            "created_utc": 1606697561.0,
                            "replies": [
                                {
                                    "body": "If you were mugged, would you appreciate people bringing up your supposed \"lack of street sense\"? Would that somehow help you process it? \n\nYou don't get to claim your arguments are logical and not use logic to examine your own claims",
                                    "author": null,
                                    "id": "ge3widf",
                                    "parent_id": "t1_ge3ndsq",
                                    "score": 3,
                                    "created_utc": 1606702750.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ge3y2u3",
                                            "parent_id": "t1_ge3widf",
                                            "score": -2,
                                            "created_utc": 1606703582.0,
                                            "replies": [
                                                {
                                                    "body": "Actually your reasoning was not sound. Your statements were neither logical nor physically true, which is the threshold for a sound claim. You argued that she could have prevented the situation, as if what occurred to her was somehow against the status quo. Sexual assault unfortunately is the status quo. It happens at a 1:3 ratio. To assume that she made no efforts when she mentioned saying \"no\" and talking about pain several times shows your lack of physical evidence in your assertions. The best you could hope for is an inductive claim, which could never be sound like a deductive claim with physical truth, but your premises would have to be proven true, and you would only be within a potential ratio of accuracy. You did not fulfill that requirement either. So it came off as victim blaming.",
                                                    "author": null,
                                                    "id": "ge5z23e",
                                                    "parent_id": "t1_ge3y2u3",
                                                    "score": 1,
                                                    "created_utc": 1606756930.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ge60twc",
                                                            "parent_id": "t1_ge5z23e",
                                                            "score": 1,
                                                            "created_utc": 1606757774.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                                                                    "author": null,
                                                                    "id": "ge61t7a",
                                                                    "parent_id": "t1_ge60twc",
                                                                    "score": 1,
                                                                    "created_utc": 1606758242.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "ge64g9k",
                                                                            "parent_id": "t1_ge61t7a",
                                                                            "score": 1,
                                                                            "created_utc": 1606759507.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                                                                    "author": null,
                                                                                    "id": "ge655lr",
                                                                                    "parent_id": "t1_ge64g9k",
                                                                                    "score": 1,
                                                                                    "created_utc": 1606759848.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                                                                    "author": null,
                                                                    "id": "ge64ev1",
                                                                    "parent_id": "t1_ge60twc",
                                                                    "score": 1,
                                                                    "created_utc": 1606759488.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She told him no multiple times, slapping and screaming wouldn't have stopped him but it may have escalated the physical damage he did.\n\nI saw you outed yourself as a physician in another comment.  I strongly strongly urge you to educate yourself.  This isn't a matter of poor personal decision making.  It's a matter of circumstance.  You must realize the SB's you see may not be \"choosing\" to interact with you; you have resources they need and they weigh the benefit of those resources against the risks associated with acquiring them.  The patients you describe as repeated victims aren't choosing to be repeatedly assaulted.  Most domestic abuse is linked to financial abuse.  Perpetrators choose their victims wisely, someone without resources, supports.\n\nThere is no excuse to hold such antiquated views on gendered violence.  Please seek out some continuing education resources.",
                    "author": "sugarsenior2",
                    "id": "ge3leks",
                    "parent_id": "t1_ge39mzl",
                    "score": 8,
                    "created_utc": 1606696424.0,
                    "replies": [
                        {
                            "body": "As someone who is like OP and has been assaulted repeated, while I think the dude's comment is crappily timed and poorly worded not all the factors are systemic like you think. A big part of the repeated assaults is probably psychological and she needs therapy to address that. Yes, there were systemic factors in my initial abuse that lead me to not see red flags (most importantly I was a child) but those mostly impacted my parents - it just made me a vulnerable adult. There is nothing she can do about the systemic factors - there *is* something she can do about her own mind, healing and looking out for the warning signs/red flags better in future.   \n\n\nObvi can't see the original comment, I imagine it was awful. That being said we need to stop treating people like they're hapless victims with no agency or they'll spend their life scared and thinking they can't do anything to stop bad things happening to them because of \"systemic factors\".  It's just not true and is honestly a very harmful attitude.  It just feeds into abuse/mistreatment schemas that people who are repeated assault survivors usually have - the same mental processes that put them in positions where this kind of thing keeps happening.   \n\n\nWe're not victims, we're survivors and we have agency. Yes, people will choose to do whatever they want and there comes a point that you really can't do anything, and yes some people are just that sneaky that you wouldn't notice. But often there are things you can do and can notice to protect yourself and keep yourself safe before it reaches that point. They're hard to do, and for most people come naturally whereas people like us have to learn them - but they can be learned. \n\nOP didn't deserve this, no one does. But OP does have some agency here in terms of what she does next to make sure it doesn't happen again which is primarily to seek help and therapy and to learn to look out for warning signs when engaging with someone.",
                            "author": "hopefulcaterpiller",
                            "id": "ge5rzjr",
                            "parent_id": "t1_ge3leks",
                            "score": 2,
                            "created_utc": 1606753494.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is blantant victim blaming and you know it since you ended your comment acknowledging it. She said no and he persisted, doesn't matter what the boundaries were prior to this, or what sort of dynamic this was. She said no more than once, she expressed disinterested in anal long before and pain during. He committed a crime. That's that",
                    "author": "Last-Ad155",
                    "id": "ge3d1gh",
                    "parent_id": "t1_ge39mzl",
                    "score": 16,
                    "created_utc": 1606691960.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge3dmfw",
                            "parent_id": "t1_ge3d1gh",
                            "score": -1,
                            "created_utc": 1606692267.0,
                            "replies": [
                                {
                                    "body": "Oh my god dude.",
                                    "author": "naiadnyx96",
                                    "id": "ge3n6xz",
                                    "parent_id": "t1_ge3dmfw",
                                    "score": 5,
                                    "created_utc": 1606697453.0,
                                    "replies": []
                                },
                                {
                                    "body": "Just stop.  Try educating yourself, once you are a victim of sexual violence  your odds actually go up for being vicitmized again.  The factors are usually systemic, ie totally out of her control.  They include things like poverty, lack of a support network, race...all factors that may lead someone to work as an SB in the first place.\n\nYou owe OP an apology, your comment and follow up comments show a repeated pattern of disgustingness.",
                                    "author": "sugarsenior2",
                                    "id": "ge3m7uz",
                                    "parent_id": "t1_ge3dmfw",
                                    "score": 7,
                                    "created_utc": 1606696890.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are essentially victim blaming... some people freeze up and literally lose the ability to do anything",
                    "author": "LuluvioletSB",
                    "id": "ge3birb",
                    "parent_id": "t1_ge39mzl",
                    "score": 23,
                    "created_utc": 1606691154.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge3d665",
                            "parent_id": "t1_ge3birb",
                            "score": -9,
                            "created_utc": 1606692030.0,
                            "replies": [
                                {
                                    "body": "You realize people react to harm in different ways right? Fight, flight, freeze etc. It doesn’t negate the victim from being a victim.",
                                    "author": "dessertenthusiastTO",
                                    "id": "ge3euvw",
                                    "parent_id": "t1_ge3d665",
                                    "score": 10,
                                    "created_utc": 1606692899.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ge3fhj7",
                                            "parent_id": "t1_ge3euvw",
                                            "score": 1,
                                            "created_utc": 1606693228.0,
                                            "replies": [
                                                {
                                                    "body": "Delete yourself",
                                                    "author": null,
                                                    "id": "ge3fxvb",
                                                    "parent_id": "t1_ge3fhj7",
                                                    "score": 10,
                                                    "created_utc": 1606693463.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "100% victim blaming. She could've still fought to stop him from continuing, doesn't mean it didn't happen. Many victims become revictimized.",
                                    "author": null,
                                    "id": "ge3dluz",
                                    "parent_id": "t1_ge3d665",
                                    "score": 10,
                                    "created_utc": 1606692258.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Definitely victim blaming, and entirely inappropriate. As mentioned, many people will either freeze or fawn in these situations, especially people socialized as women in our society. There are a variety of power dynamics at play in situations like this, not the least of which is the physical one- it is quite often not physically safe for women to resist in these situations. \n\nWomen are deeply programmed to be deferent and submissive in bed. It doesn't mean we are asking for it, it means we're well trained. Going against this training is life long work, and the fact that this man took advantage of this training to force himself on a woman who is supposedly special to him is disgusting. \n\nJust about as gross as you trying to figure out how it might have been the woman's fault. \n\nTruly- fuck off.",
                    "author": "feralflowerlover",
                    "id": "ge3dc0g",
                    "parent_id": "t1_ge39mzl",
                    "score": 12,
                    "created_utc": 1606692118.0,
                    "replies": [
                        {
                            "body": "💯👏",
                            "author": null,
                            "id": "ge3fvxi",
                            "parent_id": "t1_ge3dc0g",
                            "score": 5,
                            "created_utc": 1606693435.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is a terrible, terrible comment. Questions like this are so fucked up. You are definitely victim blaming.",
                    "author": "naiadnyx96",
                    "id": "ge3n3uq",
                    "parent_id": "t1_ge39mzl",
                    "score": 2,
                    "created_utc": 1606697405.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For guys it's like the ultimate sex act and at some point we want to do it with every girl we're seeing. Obviously you drew a hard boundary with this act, however, and he simply did not respect that boundary. If it's that important for him (for some of us, it is a deal-breaker if a girl isn't open to it) that he forces it on you even when you said you weren't open to it, then you two probably should not be seeing each other.",
            "author": "mrjimmyjsz",
            "id": "ge3i2yx",
            "parent_id": "t3_k3ik7c",
            "score": -24,
            "created_utc": 1606694598.0,
            "replies": [
                {
                    "body": "Rubbish. We don't. Maybe some do, but I seriously doubt it's that widespread a must have that it's a deal breaker for most guys.",
                    "author": "ChapterRelative",
                    "id": "ge3oqxd",
                    "parent_id": "t1_ge3i2yx",
                    "score": 16,
                    "created_utc": 1606698365.0,
                    "replies": []
                },
                {
                    "body": ">For guys it's like the ultimate sex act and at some point we want to do it with every girl we're seeing.\n\nNope.",
                    "author": "highfructoseSD",
                    "id": "ge3vig1",
                    "parent_id": "t1_ge3i2yx",
                    "score": 13,
                    "created_utc": 1606702201.0,
                    "replies": []
                },
                {
                    "body": "This is an underreaction. He raped her.",
                    "author": "naiadnyx96",
                    "id": "ge3nabz",
                    "parent_id": "t1_ge3i2yx",
                    "score": 17,
                    "created_utc": 1606697507.0,
                    "replies": []
                },
                {
                    "body": "It was rape.  Period. \n\nThis isn't a post where she's asking for advice, because he keeps asking about anal.  And trying to push the boundary.  If it was - then your comment would apply.\n\nBut... this was rape.  There is no other side to it.",
                    "author": "SDstartingOut",
                    "id": "ge6qiwr",
                    "parent_id": "t1_ge3i2yx",
                    "score": 2,
                    "created_utc": 1606769866.0,
                    "replies": []
                },
                {
                    "body": "There’s a high percentage of guys that think having anal means you’re secretly gay. Don’t speak for all men",
                    "author": "zingmarker",
                    "id": "ge896pt",
                    "parent_id": "t1_ge3i2yx",
                    "score": 2,
                    "created_utc": 1606797280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This man is a predator & needs to be wrung through. Get that bag via lawsuit. AND BLOCK !",
            "author": "yraltgf",
            "id": "ge5guha",
            "parent_id": "t3_k3ik7c",
            "score": 1,
            "created_utc": 1606747702.0,
            "replies": []
        },
        {
            "body": "I am so sorry. What an awful thing to happen to you. It totally seems like you understand this, but to be clear – none of this was your fault.\n\nA few thoughts:\n\n0) As others have stated, this is rape. \n\n1) I suspect he texted you apologizing 1,000,000 times because he's scared of the repercussions. He knows what he did was scummy, and he wants you to walk away. It's not because he's a \"good guy\" who just screwed up. \n\n2) Even if you don't pursue legal action, you may consider filing a Title IX complaint with the University. However, depending on your status at the University, just be aware that the process is not always approached with *your* best interests in mind, but the University's. As an administrator, though, they would cut ties with him before overextending themselves. You might consider talking this over with your counselor. I'm a bit lukewarm on this suggestion, but it doesn't have the same legal requirements for getting some measure of \"justice.\" (Note, I'm not saying \"revenge\"...as others have noted, it'd be good if he doesn't have the opportunity to do this again.)",
            "author": "helios4fun",
            "id": "ge716kh",
            "parent_id": "t3_k3ik7c",
            "score": 1,
            "created_utc": 1606774983.0,
            "replies": []
        },
        {
            "body": "I second this. Counselor here, you said this has happened before. This tells me you've likely grown up with unsafe people and this may make red flags seem normal to you. Therapy will not only help you process what happened but help you realign what healthy behaviors and boundaries are ❤️ boundaries keep us safe.  I'm sorry this happened to you",
            "author": "LolaPastelle",
            "id": "ge49yku",
            "parent_id": "t1_ge3m5a7",
            "score": 56,
            "created_utc": 1606710688.0,
            "replies": [
                {
                    "body": "thirding this - I've been in your shoes and there were likely red flags you missed due to bad treatment prior. This kind of event will keep occurring if you don't seek out therapy or some other way to address the past abuse and learn what the signs are so you can protect yourself. I'm sorry OP, you didn't deserve this but there are things you can do to take back power and stop this happening again. It starts with realising what you're not picking up on.",
                    "author": "hopefulcaterpiller",
                    "id": "ge5qhtu",
                    "parent_id": "t1_ge49yku",
                    "score": 12,
                    "created_utc": 1606752756.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to say I agree with this. Seek help I promise even if you don’t think you need it right now dude you’ll regret not talking to someone sooner. I’m sorry that happened to you. Hope nothing like that ever happens again",
            "author": "Sarararalalala",
            "id": "ge4vg43",
            "parent_id": "t1_ge3m5a7",
            "score": 13,
            "created_utc": 1606729369.0,
            "replies": []
        },
        {
            "body": "This too bro even if you don’t want to look at them",
            "author": "Sarararalalala",
            "id": "ge4vgwo",
            "parent_id": "t1_ge3oe6t",
            "score": 14,
            "created_utc": 1606729394.0,
            "replies": []
        },
        {
            "body": "Definitely a weird power dynamic",
            "author": "LinditaBonita",
            "id": "ge3k7i3",
            "parent_id": "t1_ge3a6o6",
            "score": 17,
            "created_utc": 1606695755.0,
            "replies": []
        },
        {
            "body": "maybe don't block him if that will delete texts because they could be used as evidence if OP decides to report. Maybe make a report with the uni?",
            "author": "hopefulcaterpiller",
            "id": "ge5qluf",
            "parent_id": "t1_ge3a6o6",
            "score": 6,
            "created_utc": 1606752813.0,
            "replies": []
        },
        {
            "body": "! This too pls block him, he’s clearly manipulative enough to do what he did to you so please stay away from him",
            "author": "Sarararalalala",
            "id": "ge4vila",
            "parent_id": "t1_ge3a6o6",
            "score": 5,
            "created_utc": 1606729448.0,
            "replies": []
        },
        {
            "body": "This.",
            "author": "_babysnek_",
            "id": "ge4b53k",
            "parent_id": "t1_ge3a6o6",
            "score": 3,
            "created_utc": 1606711473.0,
            "replies": []
        },
        {
            "body": "I agree to filing. Get a rape kit and put his name in the database. You don't need to take him to court. If he does this to someone else and his info is already in the database he's screwed. So help the next woman's case if you don't want to press charges yourself.",
            "author": null,
            "id": "ge3veyn",
            "parent_id": "t1_ge3lsmc",
            "score": 16,
            "created_utc": 1606702147.0,
            "replies": [
                {
                    "body": "Absolutely. However /u/jc8990 wants to deal with things herself, absolutely get checked out and tested as a hospital, and file with the relevant authorities. You don't have to stick your head above the parapet to make sure he won't get away with doing it again.",
                    "author": "allyafterdark",
                    "id": "ge3wljk",
                    "parent_id": "t1_ge3veyn",
                    "score": 8,
                    "created_utc": 1606702797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*An admission of guilt. But she should be careful about recording anything without his knowlege in a state that has rules against this. Some states make this a crime. If he write anything, it needs to be properly authenticated. Doubt he'd get it notarized or do a declaration/affidavit under penalty of perjury, but that's a start. The text measages are probably her best bet. She should save them. I might not block him before she gets him to text or email about what he did to her. And I wouldn't tell her a criminal suit was an uphill battle, only that she needs to report this asap if she was interested in such a thing.",
            "author": "Legal54",
            "id": "ge3wrfe",
            "parent_id": "t1_ge3lomo",
            "score": 27,
            "created_utc": 1606702884.0,
            "replies": []
        },
        {
            "body": "OP should do criminal first. No it probably won’t get processed, but it will help that she at least tries. In a civil case they’ll factor in if she pressed those charges.",
            "author": null,
            "id": "ge3zji0",
            "parent_id": "t1_ge3lomo",
            "score": 12,
            "created_utc": 1606704394.0,
            "replies": [
                {
                    "body": "I'm kind of banking on him feeling intense pressure to immediately settle, but yes you are quite correct.",
                    "author": "sugarsenior2",
                    "id": "ge7hitp",
                    "parent_id": "t1_ge3zji0",
                    "score": 3,
                    "created_utc": 1606782185.0,
                    "replies": [
                        {
                            "body": "I hope he immediately settles but gotta play strong. If it’s criminal than the state presses charges typically- she just allows them to use all of her evidence. Then once that happens civil is the next best thing. Sodomy is illegal and she has his omission of guilt already so she could really win",
                            "author": null,
                            "id": "ge7thc2",
                            "parent_id": "t1_ge7hitp",
                            "score": 1,
                            "created_utc": 1606788481.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like this comment best",
            "author": null,
            "id": "ge3mvk1",
            "parent_id": "t1_ge3lomo",
            "score": 13,
            "created_utc": 1606697269.0,
            "replies": []
        },
        {
            "body": "This is great advice",
            "author": "naiadnyx96",
            "id": "ge3ninp",
            "parent_id": "t1_ge3lomo",
            "score": 10,
            "created_utc": 1606697638.0,
            "replies": []
        },
        {
            "body": "Question out of ignorance......  you may not have to file but does the hospital have to file?  \n\n\n\nAlternate strategy while you contemplate additional actions-\n\n \"I have preserved your text messages apologizing for ( confessing to)  having anally raped me despite my verbal and physical attempts to stop you.\"   That is FORCEABLE RAPE.......... \n\n  I have instructed you not to contact me  and any further contact is a potential additional felony offense.\n\nTAKING CARE OF YOU -\nWhile you consider your options  see a counselor, skilled in sexual abuse cases and who may be not only able to help your recovery but also help you come to decisions on how you handle the legal side of it.  Also consider that anal sex carries with it an exponentially higher risk of disease transmission to you. \n\nPut him at risk - criminal/civil/divorce/employment \n(this is the Halderman Principle at work -\n\n \"when you have them by the balls their hearts and minds will surely follow\")",
            "author": "pinotandsugar",
            "id": "ge3wh62",
            "parent_id": "t1_ge3g76j",
            "score": 12,
            "created_utc": 1606702732.0,
            "replies": [
                {
                    "body": "No the hospital won’t automatically file. They’ll keep the evidence for in the future if she wants to press charges. They’ll also give resources to counselors. Definitely KEEP the text messages he sent you as evidence.",
                    "author": null,
                    "id": "ge3zgdb",
                    "parent_id": "t1_ge3wh62",
                    "score": 8,
                    "created_utc": 1606704345.0,
                    "replies": [
                        {
                            "body": "thanks",
                            "author": "pinotandsugar",
                            "id": "ge41cyf",
                            "parent_id": "t1_ge3zgdb",
                            "score": 2,
                            "created_utc": 1606705468.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> it's not always a random person or someone you just met.\n\nIt's actually rarely a random person or someone you just met. Most victims know their assaulter.",
            "author": "narkflint",
            "id": "ge5xoew",
            "parent_id": "t1_ge5otgy",
            "score": 3,
            "created_utc": 1606756265.0,
            "replies": []
        },
        {
            "body": "Glad to hear you're seeking counsel. I hope things go well and this is your last assault.",
            "author": null,
            "id": "ge60arw",
            "parent_id": "t1_ge5otgy",
            "score": 2,
            "created_utc": 1606757520.0,
            "replies": []
        },
        {
            "body": "ya this is very bad idea.  \n\nExtortion is a crime and you don't want to match his crime with committing one yourself. \n\nReport him as a crime not to the administration but to law enforcement or block and move on.",
            "author": "craa141",
            "id": "ge3hzmg",
            "parent_id": "t1_ge3dajv",
            "score": 18,
            "created_utc": 1606694550.0,
            "replies": [
                {
                    "body": "Or explore an actual, above the board civil suit",
                    "author": null,
                    "id": "ge3tnqg",
                    "parent_id": "t1_ge3hzmg",
                    "score": 3,
                    "created_utc": 1606701174.0,
                    "replies": [
                        {
                            "body": "Or this.. sorry not in the US so I forget that is a viable option.",
                            "author": "craa141",
                            "id": "ge4cxom",
                            "parent_id": "t1_ge3tnqg",
                            "score": 3,
                            "created_utc": 1606712723.0,
                            "replies": [
                                {
                                    "body": "Oh darn. Yeah I just assumed she’s in the US.",
                                    "author": null,
                                    "id": "ge5i3j9",
                                    "parent_id": "t1_ge4cxom",
                                    "score": 1,
                                    "created_utc": 1606748412.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That approach is a felony.",
            "author": "garret6758",
            "id": "ge41q46",
            "parent_id": "t1_ge3dajv",
            "score": 3,
            "created_utc": 1606705688.0,
            "replies": []
        },
        {
            "body": "Don't listen to this clown.",
            "author": "miss_cheongfun",
            "id": "ge3kxbl",
            "parent_id": "t1_ge38403",
            "score": 11,
            "created_utc": 1606696155.0,
            "replies": []
        },
        {
            "body": "OP can absolutely report this to law enforcement. It’s illegal to rape someone no matter what relationship/arrangement may exist.",
            "author": "naiadnyx96",
            "id": "ge3mycw",
            "parent_id": "t1_ge38403",
            "score": 8,
            "created_utc": 1606697314.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3be2w",
            "parent_id": "t1_ge3a0ry",
            "score": 18,
            "created_utc": 1606691086.0,
            "replies": [
                {
                    "body": "My favorite sub 😅",
                    "author": null,
                    "id": "ge3ei12",
                    "parent_id": "t1_ge3be2w",
                    "score": 2,
                    "created_utc": 1606692717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should know that what has happened in her previous relationships is completely irrelevant to what happened in this one. But also, some of your questions are definitely resulting in victim blaming. \n\n> Had you guys engaged in non-PIA ass play before?\n\nThis doesn’t matter since she had expressed that she doesn’t do anal sex ever and she’s told him plenty of times. From this comment alone, the SD was well-informed that she doesn’t want to participate in that event and he wasn’t allowed to insert his P into her A. He had no consent! \n\n> Had he gone from no ass play to anal rape in one fell thrust, or was there a slippery slope with markers ignored? \n\nA slippery slope doesn’t exist when she has expressed to him many times that she doesn’t do anal ever. \n\n> Was consensual non-consent or play-struggle part of your dynamic? \n\nThis is irrelevant since she told him that she never does anal. \n\n- I'm wondering if there's anything you can do to make sure that this doesn't happen for a fourth or fifth time?\n\nInstead of wondering that, why don’t you wonder about why a guy didn’t respect her wishes, her body, engaged in an act where he had no consent, aka raped her, and continued to do so after she told him: “ \"I don't want to do this,\" \"It hurts too much\" \"I don't like this,\" etc.“\n\nSeriously, your comment is crap.",
            "author": "tahliawetnwild",
            "id": "ge3mg5n",
            "parent_id": "t1_ge39mzl",
            "score": 14,
            "created_utc": 1606697023.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge3ndsq",
                    "parent_id": "t1_ge3mg5n",
                    "score": -2,
                    "created_utc": 1606697561.0,
                    "replies": [
                        {
                            "body": "If you were mugged, would you appreciate people bringing up your supposed \"lack of street sense\"? Would that somehow help you process it? \n\nYou don't get to claim your arguments are logical and not use logic to examine your own claims",
                            "author": null,
                            "id": "ge3widf",
                            "parent_id": "t1_ge3ndsq",
                            "score": 3,
                            "created_utc": 1606702750.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ge3y2u3",
                                    "parent_id": "t1_ge3widf",
                                    "score": -2,
                                    "created_utc": 1606703582.0,
                                    "replies": [
                                        {
                                            "body": "Actually your reasoning was not sound. Your statements were neither logical nor physically true, which is the threshold for a sound claim. You argued that she could have prevented the situation, as if what occurred to her was somehow against the status quo. Sexual assault unfortunately is the status quo. It happens at a 1:3 ratio. To assume that she made no efforts when she mentioned saying \"no\" and talking about pain several times shows your lack of physical evidence in your assertions. The best you could hope for is an inductive claim, which could never be sound like a deductive claim with physical truth, but your premises would have to be proven true, and you would only be within a potential ratio of accuracy. You did not fulfill that requirement either. So it came off as victim blaming.",
                                            "author": null,
                                            "id": "ge5z23e",
                                            "parent_id": "t1_ge3y2u3",
                                            "score": 1,
                                            "created_utc": 1606756930.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ge60twc",
                                                    "parent_id": "t1_ge5z23e",
                                                    "score": 1,
                                                    "created_utc": 1606757774.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                                                            "author": null,
                                                            "id": "ge61t7a",
                                                            "parent_id": "t1_ge60twc",
                                                            "score": 1,
                                                            "created_utc": 1606758242.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ge64g9k",
                                                                    "parent_id": "t1_ge61t7a",
                                                                    "score": 1,
                                                                    "created_utc": 1606759507.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                                                            "author": null,
                                                                            "id": "ge655lr",
                                                                            "parent_id": "t1_ge64g9k",
                                                                            "score": 1,
                                                                            "created_utc": 1606759848.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                                                            "author": null,
                                                            "id": "ge64ev1",
                                                            "parent_id": "t1_ge60twc",
                                                            "score": 1,
                                                            "created_utc": 1606759488.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She told him no multiple times, slapping and screaming wouldn't have stopped him but it may have escalated the physical damage he did.\n\nI saw you outed yourself as a physician in another comment.  I strongly strongly urge you to educate yourself.  This isn't a matter of poor personal decision making.  It's a matter of circumstance.  You must realize the SB's you see may not be \"choosing\" to interact with you; you have resources they need and they weigh the benefit of those resources against the risks associated with acquiring them.  The patients you describe as repeated victims aren't choosing to be repeatedly assaulted.  Most domestic abuse is linked to financial abuse.  Perpetrators choose their victims wisely, someone without resources, supports.\n\nThere is no excuse to hold such antiquated views on gendered violence.  Please seek out some continuing education resources.",
            "author": "sugarsenior2",
            "id": "ge3leks",
            "parent_id": "t1_ge39mzl",
            "score": 8,
            "created_utc": 1606696424.0,
            "replies": [
                {
                    "body": "As someone who is like OP and has been assaulted repeated, while I think the dude's comment is crappily timed and poorly worded not all the factors are systemic like you think. A big part of the repeated assaults is probably psychological and she needs therapy to address that. Yes, there were systemic factors in my initial abuse that lead me to not see red flags (most importantly I was a child) but those mostly impacted my parents - it just made me a vulnerable adult. There is nothing she can do about the systemic factors - there *is* something she can do about her own mind, healing and looking out for the warning signs/red flags better in future.   \n\n\nObvi can't see the original comment, I imagine it was awful. That being said we need to stop treating people like they're hapless victims with no agency or they'll spend their life scared and thinking they can't do anything to stop bad things happening to them because of \"systemic factors\".  It's just not true and is honestly a very harmful attitude.  It just feeds into abuse/mistreatment schemas that people who are repeated assault survivors usually have - the same mental processes that put them in positions where this kind of thing keeps happening.   \n\n\nWe're not victims, we're survivors and we have agency. Yes, people will choose to do whatever they want and there comes a point that you really can't do anything, and yes some people are just that sneaky that you wouldn't notice. But often there are things you can do and can notice to protect yourself and keep yourself safe before it reaches that point. They're hard to do, and for most people come naturally whereas people like us have to learn them - but they can be learned. \n\nOP didn't deserve this, no one does. But OP does have some agency here in terms of what she does next to make sure it doesn't happen again which is primarily to seek help and therapy and to learn to look out for warning signs when engaging with someone.",
                    "author": "hopefulcaterpiller",
                    "id": "ge5rzjr",
                    "parent_id": "t1_ge3leks",
                    "score": 2,
                    "created_utc": 1606753494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is blantant victim blaming and you know it since you ended your comment acknowledging it. She said no and he persisted, doesn't matter what the boundaries were prior to this, or what sort of dynamic this was. She said no more than once, she expressed disinterested in anal long before and pain during. He committed a crime. That's that",
            "author": "Last-Ad155",
            "id": "ge3d1gh",
            "parent_id": "t1_ge39mzl",
            "score": 16,
            "created_utc": 1606691960.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge3dmfw",
                    "parent_id": "t1_ge3d1gh",
                    "score": -1,
                    "created_utc": 1606692267.0,
                    "replies": [
                        {
                            "body": "Oh my god dude.",
                            "author": "naiadnyx96",
                            "id": "ge3n6xz",
                            "parent_id": "t1_ge3dmfw",
                            "score": 5,
                            "created_utc": 1606697453.0,
                            "replies": []
                        },
                        {
                            "body": "Just stop.  Try educating yourself, once you are a victim of sexual violence  your odds actually go up for being vicitmized again.  The factors are usually systemic, ie totally out of her control.  They include things like poverty, lack of a support network, race...all factors that may lead someone to work as an SB in the first place.\n\nYou owe OP an apology, your comment and follow up comments show a repeated pattern of disgustingness.",
                            "author": "sugarsenior2",
                            "id": "ge3m7uz",
                            "parent_id": "t1_ge3dmfw",
                            "score": 7,
                            "created_utc": 1606696890.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are essentially victim blaming... some people freeze up and literally lose the ability to do anything",
            "author": "LuluvioletSB",
            "id": "ge3birb",
            "parent_id": "t1_ge39mzl",
            "score": 23,
            "created_utc": 1606691154.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge3d665",
                    "parent_id": "t1_ge3birb",
                    "score": -9,
                    "created_utc": 1606692030.0,
                    "replies": [
                        {
                            "body": "You realize people react to harm in different ways right? Fight, flight, freeze etc. It doesn’t negate the victim from being a victim.",
                            "author": "dessertenthusiastTO",
                            "id": "ge3euvw",
                            "parent_id": "t1_ge3d665",
                            "score": 10,
                            "created_utc": 1606692899.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ge3fhj7",
                                    "parent_id": "t1_ge3euvw",
                                    "score": 1,
                                    "created_utc": 1606693228.0,
                                    "replies": [
                                        {
                                            "body": "Delete yourself",
                                            "author": null,
                                            "id": "ge3fxvb",
                                            "parent_id": "t1_ge3fhj7",
                                            "score": 10,
                                            "created_utc": 1606693463.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "100% victim blaming. She could've still fought to stop him from continuing, doesn't mean it didn't happen. Many victims become revictimized.",
                            "author": null,
                            "id": "ge3dluz",
                            "parent_id": "t1_ge3d665",
                            "score": 10,
                            "created_utc": 1606692258.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely victim blaming, and entirely inappropriate. As mentioned, many people will either freeze or fawn in these situations, especially people socialized as women in our society. There are a variety of power dynamics at play in situations like this, not the least of which is the physical one- it is quite often not physically safe for women to resist in these situations. \n\nWomen are deeply programmed to be deferent and submissive in bed. It doesn't mean we are asking for it, it means we're well trained. Going against this training is life long work, and the fact that this man took advantage of this training to force himself on a woman who is supposedly special to him is disgusting. \n\nJust about as gross as you trying to figure out how it might have been the woman's fault. \n\nTruly- fuck off.",
            "author": "feralflowerlover",
            "id": "ge3dc0g",
            "parent_id": "t1_ge39mzl",
            "score": 12,
            "created_utc": 1606692118.0,
            "replies": [
                {
                    "body": "💯👏",
                    "author": null,
                    "id": "ge3fvxi",
                    "parent_id": "t1_ge3dc0g",
                    "score": 5,
                    "created_utc": 1606693435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a terrible, terrible comment. Questions like this are so fucked up. You are definitely victim blaming.",
            "author": "naiadnyx96",
            "id": "ge3n3uq",
            "parent_id": "t1_ge39mzl",
            "score": 2,
            "created_utc": 1606697405.0,
            "replies": []
        },
        {
            "body": "Rubbish. We don't. Maybe some do, but I seriously doubt it's that widespread a must have that it's a deal breaker for most guys.",
            "author": "ChapterRelative",
            "id": "ge3oqxd",
            "parent_id": "t1_ge3i2yx",
            "score": 16,
            "created_utc": 1606698365.0,
            "replies": []
        },
        {
            "body": ">For guys it's like the ultimate sex act and at some point we want to do it with every girl we're seeing.\n\nNope.",
            "author": "highfructoseSD",
            "id": "ge3vig1",
            "parent_id": "t1_ge3i2yx",
            "score": 13,
            "created_utc": 1606702201.0,
            "replies": []
        },
        {
            "body": "This is an underreaction. He raped her.",
            "author": "naiadnyx96",
            "id": "ge3nabz",
            "parent_id": "t1_ge3i2yx",
            "score": 17,
            "created_utc": 1606697507.0,
            "replies": []
        },
        {
            "body": "It was rape.  Period. \n\nThis isn't a post where she's asking for advice, because he keeps asking about anal.  And trying to push the boundary.  If it was - then your comment would apply.\n\nBut... this was rape.  There is no other side to it.",
            "author": "SDstartingOut",
            "id": "ge6qiwr",
            "parent_id": "t1_ge3i2yx",
            "score": 2,
            "created_utc": 1606769866.0,
            "replies": []
        },
        {
            "body": "There’s a high percentage of guys that think having anal means you’re secretly gay. Don’t speak for all men",
            "author": "zingmarker",
            "id": "ge896pt",
            "parent_id": "t1_ge3i2yx",
            "score": 2,
            "created_utc": 1606797280.0,
            "replies": []
        },
        {
            "body": "thirding this - I've been in your shoes and there were likely red flags you missed due to bad treatment prior. This kind of event will keep occurring if you don't seek out therapy or some other way to address the past abuse and learn what the signs are so you can protect yourself. I'm sorry OP, you didn't deserve this but there are things you can do to take back power and stop this happening again. It starts with realising what you're not picking up on.",
            "author": "hopefulcaterpiller",
            "id": "ge5qhtu",
            "parent_id": "t1_ge49yku",
            "score": 12,
            "created_utc": 1606752756.0,
            "replies": []
        },
        {
            "body": "Absolutely. However /u/jc8990 wants to deal with things herself, absolutely get checked out and tested as a hospital, and file with the relevant authorities. You don't have to stick your head above the parapet to make sure he won't get away with doing it again.",
            "author": "allyafterdark",
            "id": "ge3wljk",
            "parent_id": "t1_ge3veyn",
            "score": 8,
            "created_utc": 1606702797.0,
            "replies": []
        },
        {
            "body": "I'm kind of banking on him feeling intense pressure to immediately settle, but yes you are quite correct.",
            "author": "sugarsenior2",
            "id": "ge7hitp",
            "parent_id": "t1_ge3zji0",
            "score": 3,
            "created_utc": 1606782185.0,
            "replies": [
                {
                    "body": "I hope he immediately settles but gotta play strong. If it’s criminal than the state presses charges typically- she just allows them to use all of her evidence. Then once that happens civil is the next best thing. Sodomy is illegal and she has his omission of guilt already so she could really win",
                    "author": null,
                    "id": "ge7thc2",
                    "parent_id": "t1_ge7hitp",
                    "score": 1,
                    "created_utc": 1606788481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No the hospital won’t automatically file. They’ll keep the evidence for in the future if she wants to press charges. They’ll also give resources to counselors. Definitely KEEP the text messages he sent you as evidence.",
            "author": null,
            "id": "ge3zgdb",
            "parent_id": "t1_ge3wh62",
            "score": 8,
            "created_utc": 1606704345.0,
            "replies": [
                {
                    "body": "thanks",
                    "author": "pinotandsugar",
                    "id": "ge41cyf",
                    "parent_id": "t1_ge3zgdb",
                    "score": 2,
                    "created_utc": 1606705468.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or explore an actual, above the board civil suit",
            "author": null,
            "id": "ge3tnqg",
            "parent_id": "t1_ge3hzmg",
            "score": 3,
            "created_utc": 1606701174.0,
            "replies": [
                {
                    "body": "Or this.. sorry not in the US so I forget that is a viable option.",
                    "author": "craa141",
                    "id": "ge4cxom",
                    "parent_id": "t1_ge3tnqg",
                    "score": 3,
                    "created_utc": 1606712723.0,
                    "replies": [
                        {
                            "body": "Oh darn. Yeah I just assumed she’s in the US.",
                            "author": null,
                            "id": "ge5i3j9",
                            "parent_id": "t1_ge4cxom",
                            "score": 1,
                            "created_utc": 1606748412.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My favorite sub 😅",
            "author": null,
            "id": "ge3ei12",
            "parent_id": "t1_ge3be2w",
            "score": 2,
            "created_utc": 1606692717.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3ndsq",
            "parent_id": "t1_ge3mg5n",
            "score": -2,
            "created_utc": 1606697561.0,
            "replies": [
                {
                    "body": "If you were mugged, would you appreciate people bringing up your supposed \"lack of street sense\"? Would that somehow help you process it? \n\nYou don't get to claim your arguments are logical and not use logic to examine your own claims",
                    "author": null,
                    "id": "ge3widf",
                    "parent_id": "t1_ge3ndsq",
                    "score": 3,
                    "created_utc": 1606702750.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge3y2u3",
                            "parent_id": "t1_ge3widf",
                            "score": -2,
                            "created_utc": 1606703582.0,
                            "replies": [
                                {
                                    "body": "Actually your reasoning was not sound. Your statements were neither logical nor physically true, which is the threshold for a sound claim. You argued that she could have prevented the situation, as if what occurred to her was somehow against the status quo. Sexual assault unfortunately is the status quo. It happens at a 1:3 ratio. To assume that she made no efforts when she mentioned saying \"no\" and talking about pain several times shows your lack of physical evidence in your assertions. The best you could hope for is an inductive claim, which could never be sound like a deductive claim with physical truth, but your premises would have to be proven true, and you would only be within a potential ratio of accuracy. You did not fulfill that requirement either. So it came off as victim blaming.",
                                    "author": null,
                                    "id": "ge5z23e",
                                    "parent_id": "t1_ge3y2u3",
                                    "score": 1,
                                    "created_utc": 1606756930.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ge60twc",
                                            "parent_id": "t1_ge5z23e",
                                            "score": 1,
                                            "created_utc": 1606757774.0,
                                            "replies": [
                                                {
                                                    "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                                                    "author": null,
                                                    "id": "ge61t7a",
                                                    "parent_id": "t1_ge60twc",
                                                    "score": 1,
                                                    "created_utc": 1606758242.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ge64g9k",
                                                            "parent_id": "t1_ge61t7a",
                                                            "score": 1,
                                                            "created_utc": 1606759507.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                                                    "author": null,
                                                                    "id": "ge655lr",
                                                                    "parent_id": "t1_ge64g9k",
                                                                    "score": 1,
                                                                    "created_utc": 1606759848.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                                                    "author": null,
                                                    "id": "ge64ev1",
                                                    "parent_id": "t1_ge60twc",
                                                    "score": 1,
                                                    "created_utc": 1606759488.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As someone who is like OP and has been assaulted repeated, while I think the dude's comment is crappily timed and poorly worded not all the factors are systemic like you think. A big part of the repeated assaults is probably psychological and she needs therapy to address that. Yes, there were systemic factors in my initial abuse that lead me to not see red flags (most importantly I was a child) but those mostly impacted my parents - it just made me a vulnerable adult. There is nothing she can do about the systemic factors - there *is* something she can do about her own mind, healing and looking out for the warning signs/red flags better in future.   \n\n\nObvi can't see the original comment, I imagine it was awful. That being said we need to stop treating people like they're hapless victims with no agency or they'll spend their life scared and thinking they can't do anything to stop bad things happening to them because of \"systemic factors\".  It's just not true and is honestly a very harmful attitude.  It just feeds into abuse/mistreatment schemas that people who are repeated assault survivors usually have - the same mental processes that put them in positions where this kind of thing keeps happening.   \n\n\nWe're not victims, we're survivors and we have agency. Yes, people will choose to do whatever they want and there comes a point that you really can't do anything, and yes some people are just that sneaky that you wouldn't notice. But often there are things you can do and can notice to protect yourself and keep yourself safe before it reaches that point. They're hard to do, and for most people come naturally whereas people like us have to learn them - but they can be learned. \n\nOP didn't deserve this, no one does. But OP does have some agency here in terms of what she does next to make sure it doesn't happen again which is primarily to seek help and therapy and to learn to look out for warning signs when engaging with someone.",
            "author": "hopefulcaterpiller",
            "id": "ge5rzjr",
            "parent_id": "t1_ge3leks",
            "score": 2,
            "created_utc": 1606753494.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3dmfw",
            "parent_id": "t1_ge3d1gh",
            "score": -1,
            "created_utc": 1606692267.0,
            "replies": [
                {
                    "body": "Oh my god dude.",
                    "author": "naiadnyx96",
                    "id": "ge3n6xz",
                    "parent_id": "t1_ge3dmfw",
                    "score": 5,
                    "created_utc": 1606697453.0,
                    "replies": []
                },
                {
                    "body": "Just stop.  Try educating yourself, once you are a victim of sexual violence  your odds actually go up for being vicitmized again.  The factors are usually systemic, ie totally out of her control.  They include things like poverty, lack of a support network, race...all factors that may lead someone to work as an SB in the first place.\n\nYou owe OP an apology, your comment and follow up comments show a repeated pattern of disgustingness.",
                    "author": "sugarsenior2",
                    "id": "ge3m7uz",
                    "parent_id": "t1_ge3dmfw",
                    "score": 7,
                    "created_utc": 1606696890.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3d665",
            "parent_id": "t1_ge3birb",
            "score": -9,
            "created_utc": 1606692030.0,
            "replies": [
                {
                    "body": "You realize people react to harm in different ways right? Fight, flight, freeze etc. It doesn’t negate the victim from being a victim.",
                    "author": "dessertenthusiastTO",
                    "id": "ge3euvw",
                    "parent_id": "t1_ge3d665",
                    "score": 10,
                    "created_utc": 1606692899.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge3fhj7",
                            "parent_id": "t1_ge3euvw",
                            "score": 1,
                            "created_utc": 1606693228.0,
                            "replies": [
                                {
                                    "body": "Delete yourself",
                                    "author": null,
                                    "id": "ge3fxvb",
                                    "parent_id": "t1_ge3fhj7",
                                    "score": 10,
                                    "created_utc": 1606693463.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "100% victim blaming. She could've still fought to stop him from continuing, doesn't mean it didn't happen. Many victims become revictimized.",
                    "author": null,
                    "id": "ge3dluz",
                    "parent_id": "t1_ge3d665",
                    "score": 10,
                    "created_utc": 1606692258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💯👏",
            "author": null,
            "id": "ge3fvxi",
            "parent_id": "t1_ge3dc0g",
            "score": 5,
            "created_utc": 1606693435.0,
            "replies": []
        },
        {
            "body": "I hope he immediately settles but gotta play strong. If it’s criminal than the state presses charges typically- she just allows them to use all of her evidence. Then once that happens civil is the next best thing. Sodomy is illegal and she has his omission of guilt already so she could really win",
            "author": null,
            "id": "ge7thc2",
            "parent_id": "t1_ge7hitp",
            "score": 1,
            "created_utc": 1606788481.0,
            "replies": []
        },
        {
            "body": "thanks",
            "author": "pinotandsugar",
            "id": "ge41cyf",
            "parent_id": "t1_ge3zgdb",
            "score": 2,
            "created_utc": 1606705468.0,
            "replies": []
        },
        {
            "body": "Or this.. sorry not in the US so I forget that is a viable option.",
            "author": "craa141",
            "id": "ge4cxom",
            "parent_id": "t1_ge3tnqg",
            "score": 3,
            "created_utc": 1606712723.0,
            "replies": [
                {
                    "body": "Oh darn. Yeah I just assumed she’s in the US.",
                    "author": null,
                    "id": "ge5i3j9",
                    "parent_id": "t1_ge4cxom",
                    "score": 1,
                    "created_utc": 1606748412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you were mugged, would you appreciate people bringing up your supposed \"lack of street sense\"? Would that somehow help you process it? \n\nYou don't get to claim your arguments are logical and not use logic to examine your own claims",
            "author": null,
            "id": "ge3widf",
            "parent_id": "t1_ge3ndsq",
            "score": 3,
            "created_utc": 1606702750.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge3y2u3",
                    "parent_id": "t1_ge3widf",
                    "score": -2,
                    "created_utc": 1606703582.0,
                    "replies": [
                        {
                            "body": "Actually your reasoning was not sound. Your statements were neither logical nor physically true, which is the threshold for a sound claim. You argued that she could have prevented the situation, as if what occurred to her was somehow against the status quo. Sexual assault unfortunately is the status quo. It happens at a 1:3 ratio. To assume that she made no efforts when she mentioned saying \"no\" and talking about pain several times shows your lack of physical evidence in your assertions. The best you could hope for is an inductive claim, which could never be sound like a deductive claim with physical truth, but your premises would have to be proven true, and you would only be within a potential ratio of accuracy. You did not fulfill that requirement either. So it came off as victim blaming.",
                            "author": null,
                            "id": "ge5z23e",
                            "parent_id": "t1_ge3y2u3",
                            "score": 1,
                            "created_utc": 1606756930.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ge60twc",
                                    "parent_id": "t1_ge5z23e",
                                    "score": 1,
                                    "created_utc": 1606757774.0,
                                    "replies": [
                                        {
                                            "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                                            "author": null,
                                            "id": "ge61t7a",
                                            "parent_id": "t1_ge60twc",
                                            "score": 1,
                                            "created_utc": 1606758242.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ge64g9k",
                                                    "parent_id": "t1_ge61t7a",
                                                    "score": 1,
                                                    "created_utc": 1606759507.0,
                                                    "replies": [
                                                        {
                                                            "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                                            "author": null,
                                                            "id": "ge655lr",
                                                            "parent_id": "t1_ge64g9k",
                                                            "score": 1,
                                                            "created_utc": 1606759848.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                                            "author": null,
                                            "id": "ge64ev1",
                                            "parent_id": "t1_ge60twc",
                                            "score": 1,
                                            "created_utc": 1606759488.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my god dude.",
            "author": "naiadnyx96",
            "id": "ge3n6xz",
            "parent_id": "t1_ge3dmfw",
            "score": 5,
            "created_utc": 1606697453.0,
            "replies": []
        },
        {
            "body": "Just stop.  Try educating yourself, once you are a victim of sexual violence  your odds actually go up for being vicitmized again.  The factors are usually systemic, ie totally out of her control.  They include things like poverty, lack of a support network, race...all factors that may lead someone to work as an SB in the first place.\n\nYou owe OP an apology, your comment and follow up comments show a repeated pattern of disgustingness.",
            "author": "sugarsenior2",
            "id": "ge3m7uz",
            "parent_id": "t1_ge3dmfw",
            "score": 7,
            "created_utc": 1606696890.0,
            "replies": []
        },
        {
            "body": "You realize people react to harm in different ways right? Fight, flight, freeze etc. It doesn’t negate the victim from being a victim.",
            "author": "dessertenthusiastTO",
            "id": "ge3euvw",
            "parent_id": "t1_ge3d665",
            "score": 10,
            "created_utc": 1606692899.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge3fhj7",
                    "parent_id": "t1_ge3euvw",
                    "score": 1,
                    "created_utc": 1606693228.0,
                    "replies": [
                        {
                            "body": "Delete yourself",
                            "author": null,
                            "id": "ge3fxvb",
                            "parent_id": "t1_ge3fhj7",
                            "score": 10,
                            "created_utc": 1606693463.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% victim blaming. She could've still fought to stop him from continuing, doesn't mean it didn't happen. Many victims become revictimized.",
            "author": null,
            "id": "ge3dluz",
            "parent_id": "t1_ge3d665",
            "score": 10,
            "created_utc": 1606692258.0,
            "replies": []
        },
        {
            "body": "Oh darn. Yeah I just assumed she’s in the US.",
            "author": null,
            "id": "ge5i3j9",
            "parent_id": "t1_ge4cxom",
            "score": 1,
            "created_utc": 1606748412.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3y2u3",
            "parent_id": "t1_ge3widf",
            "score": -2,
            "created_utc": 1606703582.0,
            "replies": [
                {
                    "body": "Actually your reasoning was not sound. Your statements were neither logical nor physically true, which is the threshold for a sound claim. You argued that she could have prevented the situation, as if what occurred to her was somehow against the status quo. Sexual assault unfortunately is the status quo. It happens at a 1:3 ratio. To assume that she made no efforts when she mentioned saying \"no\" and talking about pain several times shows your lack of physical evidence in your assertions. The best you could hope for is an inductive claim, which could never be sound like a deductive claim with physical truth, but your premises would have to be proven true, and you would only be within a potential ratio of accuracy. You did not fulfill that requirement either. So it came off as victim blaming.",
                    "author": null,
                    "id": "ge5z23e",
                    "parent_id": "t1_ge3y2u3",
                    "score": 1,
                    "created_utc": 1606756930.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge60twc",
                            "parent_id": "t1_ge5z23e",
                            "score": 1,
                            "created_utc": 1606757774.0,
                            "replies": [
                                {
                                    "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                                    "author": null,
                                    "id": "ge61t7a",
                                    "parent_id": "t1_ge60twc",
                                    "score": 1,
                                    "created_utc": 1606758242.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ge64g9k",
                                            "parent_id": "t1_ge61t7a",
                                            "score": 1,
                                            "created_utc": 1606759507.0,
                                            "replies": [
                                                {
                                                    "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                                    "author": null,
                                                    "id": "ge655lr",
                                                    "parent_id": "t1_ge64g9k",
                                                    "score": 1,
                                                    "created_utc": 1606759848.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                                    "author": null,
                                    "id": "ge64ev1",
                                    "parent_id": "t1_ge60twc",
                                    "score": 1,
                                    "created_utc": 1606759488.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge3fhj7",
            "parent_id": "t1_ge3euvw",
            "score": 1,
            "created_utc": 1606693228.0,
            "replies": [
                {
                    "body": "Delete yourself",
                    "author": null,
                    "id": "ge3fxvb",
                    "parent_id": "t1_ge3fhj7",
                    "score": 10,
                    "created_utc": 1606693463.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually your reasoning was not sound. Your statements were neither logical nor physically true, which is the threshold for a sound claim. You argued that she could have prevented the situation, as if what occurred to her was somehow against the status quo. Sexual assault unfortunately is the status quo. It happens at a 1:3 ratio. To assume that she made no efforts when she mentioned saying \"no\" and talking about pain several times shows your lack of physical evidence in your assertions. The best you could hope for is an inductive claim, which could never be sound like a deductive claim with physical truth, but your premises would have to be proven true, and you would only be within a potential ratio of accuracy. You did not fulfill that requirement either. So it came off as victim blaming.",
            "author": null,
            "id": "ge5z23e",
            "parent_id": "t1_ge3y2u3",
            "score": 1,
            "created_utc": 1606756930.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge60twc",
                    "parent_id": "t1_ge5z23e",
                    "score": 1,
                    "created_utc": 1606757774.0,
                    "replies": [
                        {
                            "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                            "author": null,
                            "id": "ge61t7a",
                            "parent_id": "t1_ge60twc",
                            "score": 1,
                            "created_utc": 1606758242.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ge64g9k",
                                    "parent_id": "t1_ge61t7a",
                                    "score": 1,
                                    "created_utc": 1606759507.0,
                                    "replies": [
                                        {
                                            "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                            "author": null,
                                            "id": "ge655lr",
                                            "parent_id": "t1_ge64g9k",
                                            "score": 1,
                                            "created_utc": 1606759848.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                            "author": null,
                            "id": "ge64ev1",
                            "parent_id": "t1_ge60twc",
                            "score": 1,
                            "created_utc": 1606759488.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Delete yourself",
            "author": null,
            "id": "ge3fxvb",
            "parent_id": "t1_ge3fhj7",
            "score": 10,
            "created_utc": 1606693463.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge60twc",
            "parent_id": "t1_ge5z23e",
            "score": 1,
            "created_utc": 1606757774.0,
            "replies": [
                {
                    "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
                    "author": null,
                    "id": "ge61t7a",
                    "parent_id": "t1_ge60twc",
                    "score": 1,
                    "created_utc": 1606758242.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ge64g9k",
                            "parent_id": "t1_ge61t7a",
                            "score": 1,
                            "created_utc": 1606759507.0,
                            "replies": [
                                {
                                    "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                                    "author": null,
                                    "id": "ge655lr",
                                    "parent_id": "t1_ge64g9k",
                                    "score": 1,
                                    "created_utc": 1606759848.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
                    "author": null,
                    "id": "ge64ev1",
                    "parent_id": "t1_ge60twc",
                    "score": 1,
                    "created_utc": 1606759488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you were in the room with the victim and their family/therapist, you would know that's not how those conversations go. That's like arguing that women shouldn't go to college because of the likelihood on a college campus of sexual assault. It's a manipulation of logic and is a causation vs correlation fallacy.",
            "author": null,
            "id": "ge61t7a",
            "parent_id": "t1_ge60twc",
            "score": 1,
            "created_utc": 1606758242.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ge64g9k",
                    "parent_id": "t1_ge61t7a",
                    "score": 1,
                    "created_utc": 1606759507.0,
                    "replies": [
                        {
                            "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                            "author": null,
                            "id": "ge655lr",
                            "parent_id": "t1_ge64g9k",
                            "score": 1,
                            "created_utc": 1606759848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn't know you were going to add an entire paragraph with no \"EDIT\", hmm\n\nIf you didn't notice. I mentioned in an earlier comment that she should put his name on file with a rape kit so he gets flagged if this happens to another woman.\n\nYour \"set of skills\" argument is bullshit. Assault can happen at any time to anyone. And even in the kink community. I know people who have dated someone safely for a year. They played in public with them, knew other people he'd played with, vetted him. Only to have him turn on them and assault them a year into the relationship. Some abusers use long-game strategies. The guys get kicked out of events when people find out. Usually he had a string of silent victims. Currently this is a big problem in the kink community, and a lot of men are screaming about \"Me Too\" because they're getting caught. I recommend you know more before you speak about sexual assault and kink communities. \n\nWhat I actually tell newbies is:\n\n\"There's no one to protect you. If you jump into this you're going down a rabbit hole by yourself. People will tell you you're safe or ways to be safe, but every kink has risk. Some kinks like rope can cause permanent damage if mistakes are made. That's why it's a nerd's sport. Research and take classes to know how someone is supposed to tie you for example. And though these people say they'll protect you, they're not in the room when you go over to a top's house.\"",
            "author": null,
            "id": "ge64ev1",
            "parent_id": "t1_ge60twc",
            "score": 1,
            "created_utc": 1606759488.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ge64g9k",
            "parent_id": "t1_ge61t7a",
            "score": 1,
            "created_utc": 1606759507.0,
            "replies": [
                {
                    "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
                    "author": null,
                    "id": "ge655lr",
                    "parent_id": "t1_ge64g9k",
                    "score": 1,
                    "created_utc": 1606759848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Women have tried those things. Said those things. It didn't matter hun.\n\nEdit: I think the difference is you're assuming a woman is listened to like a man. Life doesn't operate like that.",
            "author": null,
            "id": "ge655lr",
            "parent_id": "t1_ge64g9k",
            "score": 1,
            "created_utc": 1606759848.0,
            "replies": []
        }
    ]
}