{
    "title": "RANT - Why can’t EX Husbands just leave it alone?",
    "post_id": "ll7hvt",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ll7hvt/rant_why_cant_ex_husbands_just_leave_it_alone/",
    "author": "zztop1999",
    "body": "Met a great (26f) SB 3 months ago that was recently divorced from a physically and emotionally abusive husband. She is a single mom of 2 toddlers and it was so obvious that she had been in an a abusive marriage. Fast forward we have had 3 great months. All things are positive. She is amazed at how a man can treat a woman when they have the woman’s interest to heart. Suddenly today the the ex husband shows up at SB’s parents house with screenshots of her SA profile that hasn’t been accessed since December. Parents go nuts. Huge blow up about how she has embarrassed the family. So get a text telling me she can’t keep seeing me. Can’t disappoint the parents and that ex-husband has said he is going to destroy her and embarrass her with the info. Needless to say everyone seems to skip the fact that the ex would have to also be on SA to find the profile.   So is there a SD mafia I can contact to send the ex a message??? This is a huge loss she was spectacular.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ll7hvt/rant_why_cant_ex_husbands_just_leave_it_alone/",
    "score": 144,
    "upvote_ratio": 0.96,
    "created_utc": 1613492903.0,
    "num_comments": 88,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "\" Needless to say everyone seems to skip the fact that the ex would have to also be on SA to find the profile. \"\n\nThis is very telling. Either he is in a position to be getting a SB and he should just mind his own damn business, or he is not in the position to get a SB and he is leading women on or just stalking. \n\nIn this day and age I don't really think having an online profile on any kind of dating website is embarrassing. Just shows you are an adult with a personal life.",
            "author": "Mysterious_Fox_8616",
            "id": "gno7zgo",
            "parent_id": "t3_ll7hvt",
            "score": 50,
            "created_utc": 1613499675.0,
            "replies": [
                {
                    "body": "No he doesn't. He could do like my ex did which was remotely send spy software to install on my computer to \"watch\" me. Despite the fact that at that time we had been divorced for a couple yrs. This was ALL over custody stuff by the way. Some men don't play fair.",
                    "author": "clair-cummings",
                    "id": "gnoi9ei",
                    "parent_id": "t1_gno7zgo",
                    "score": 20,
                    "created_utc": 1613504235.0,
                    "replies": [
                        {
                            "body": "Sure \"all is fair in love and war,\" but that there sounds like a violation of federal wiretapping laws, as well as the Computer Fraud and Abuse Act.\n\nNow, takes a bit of work usually to actually prove that in court, but if you can then he's going to have more important issues to deal with than if you're an SB or not...",
                            "author": "quietgrey1",
                            "id": "gnpakud",
                            "parent_id": "t1_gnoi9ei",
                            "score": 7,
                            "created_utc": 1613517067.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sounds like good old standard slut shaming. :/",
                    "author": "quietgrey1",
                    "id": "gnpa4sp",
                    "parent_id": "t1_gno7zgo",
                    "score": 3,
                    "created_utc": 1613516845.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "PSA: \n\nSBS - THIS IS WHY IT’S BEST NOT TO SHARE FACE PICTURES PUBLICLY OR PRIVATELY ON SA. \n\nSorry for the shouting. People ought to hear this. \n\nPrivacy isn’t just for the top earner executive or CEO dudes. It’s also absolutely fucking necessary to protect SBs too.",
            "author": "ExExpectations",
            "id": "gnnuino",
            "parent_id": "t3_ll7hvt",
            "score": 108,
            "created_utc": 1613493781.0,
            "replies": [
                {
                    "body": "I had one picture of my body .\n\nHaving been in a previously abusive relationship I don’t trust anything. I always envy the people who can have their pretty faces on the app. \n\nI’m just not one of them. \n\nI wish there was a warning on the subreddit about this. Like “hey if your family saw you , would you be fine with it ?”",
                    "author": "Momotheblack",
                    "id": "gnopawr",
                    "parent_id": "t1_gnnuino",
                    "score": 25,
                    "created_utc": 1613507399.0,
                    "replies": [
                        {
                            "body": "This makes me feel so bad. See, my entire family, consisting of my mom and four younger siblings, already knows that I’m on SA. \n\nMy abusive, narcissistic ex tried to pull the same thing on me that this post is about a few months ago. He came out of the woodwork after seven years of no contact threatening to “out me,” citing quotes from my SA profile and saying things like, “maybe if you don’t do what I say, I’ll tell all your sugar daddies.”\n\nI was able to send him one text message telling him that he could tell anybody anything he wanted, because everyone important already knows and he had absolutely nothing that would hurt me. Then I blocked him and dealt with the feelings that his contacting me brought up, and moved on. I really wish that there was something I could do for SBs like the one in the story and for you.",
                            "author": "FoxyFreckles1989",
                            "id": "gnpbzlx",
                            "parent_id": "t1_gnopawr",
                            "score": 15,
                            "created_utc": 1613517764.0,
                            "replies": [
                                {
                                    "body": "Yeah I also have a narcissistic ex.\n\nI’m too afraid to actually even discuss any arrangement on a vanilla site . It feels like I’m being watched .\n\nI’ve stopped posting on most social media. Until I feel comfortable. Not to mention he went onto my Twitter , found a tweet I commented on about emotional abuse and commented on it stating “heart break doesn’t make you a an expert “.\n\nYou’re lucky/blessed your family is supportive. Mine would be ashamed and embarrassed. They would most likely call me a prostitute 😂.",
                                    "author": "Momotheblack",
                                    "id": "gnpeo0v",
                                    "parent_id": "t1_gnpbzlx",
                                    "score": 7,
                                    "created_utc": 1613519100.0,
                                    "replies": [
                                        {
                                            "body": "I’m definitely lucky. My mom didn’t used to be this open minded. I was raised Catholic and went to a Catholic school, and was initially taught (at school, not necessarily by mom) that birth control, premarital sex, abortion, masturbation and being gay were all sins. Then, I decided not to get confirmed and switch to public school and junior high. All four of my younger siblings followed suit. Several of us came out as gay, I had a child out of wedlock at 18, and, well, you get the point. \n\nMom was forced to either get with the times or lose her close relationships with all five of her children. She made the right choice. By the time I told her that I was sugaring for the first time, nearly 10 years ago, I had told her much more shocking and potentially disappointing news several times over. 😂\n\nI’m really sorry that you have to deal with that. Nobody deserves it. I got rid of almost all of my social media about a year ago, as well, for similar reasons. The only one I really have left is Twitter, which I rarely use and definitely doesn’t have anything personal on it.",
                                            "author": "FoxyFreckles1989",
                                            "id": "gnpg064",
                                            "parent_id": "t1_gnpeo0v",
                                            "score": 5,
                                            "created_utc": 1613519765.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">I wish there was a warning on the subreddit about this. Like “hey if your family saw you , would you be fine with it ?”\n\nI would fully support that kind of verbiage!!! And I would extend it to friends, colleagues, and future partners and employers as well!Newbie women (and men) but especially women, somehow think the site's public (and private) pictures and profile is insulated from the eyes of everyone in their lives, but it's often not true. Thoughts of adding something more explicit to the opsec info??  u/azurecole ?  \n\n\nAnd I'm really sorry you had to experience abuse in a previous relationship. Too many of us have been through trauma. :(",
                            "author": "ExExpectations",
                            "id": "gns1a17",
                            "parent_id": "t1_gnopawr",
                            "score": 1,
                            "created_utc": 1613579099.0,
                            "replies": [
                                {
                                    "body": "Lol the good news is I left! So don’t be sorry.\n\nBut the warning about hiding yourself should be put on the subreddit. Not just family but some of us are working towards careers where this sort of lifestyle is ostracized. \n\nI’d appreciate a warning lol.",
                                    "author": "Momotheblack",
                                    "id": "gnsvrj1",
                                    "parent_id": "t1_gns1a17",
                                    "score": 2,
                                    "created_utc": 1613592204.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Correct. I am kicking myself for not doing better Opsec for her.",
                    "author": "zztop1999",
                    "id": "gnnv37z",
                    "parent_id": "t1_gnnuino",
                    "score": 26,
                    "created_utc": 1613494036.0,
                    "replies": [
                        {
                            "body": "**And yet, here we are, all day long we see men on this forum say shit like this to women regarding their profile reviews “include a smiling picture” or “there’s no reason to have private pictures, it will only make you jaded from receiving all the picture request messages” 🙄🙄**\n\n**No. I don’t get jaded from receiving 200 picture requests. It takes 1 second to delete those messages and ignore those who don’t even read our profiles or send a personal note. But it takes a lifetime to repair privacy breeches and damages.**",
                            "author": "ExExpectations",
                            "id": "gnnwwa3",
                            "parent_id": "t1_gnnv37z",
                            "score": 65,
                            "created_utc": 1613494822.0,
                            "replies": [
                                {
                                    "body": "Yeh i dont agree abkut not having private photos",
                                    "author": "wb19081908",
                                    "id": "gnp5ony",
                                    "parent_id": "t1_gnnwwa3",
                                    "score": 2,
                                    "created_utc": 1613514708.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I meant this for SDs who refuse to even talk or meet pot SBs when they refuse to share face pictures (I’m one of those SBs who don’t share face pictures ever, only meet in person). \n\nWe care about privacy - yours and ours. That should account for something. In your case, that rule would have saved your SR, (if she had that rule in place and you still asked to meet her).",
                            "author": "ExExpectations",
                            "id": "gnnwawb",
                            "parent_id": "t1_gnnv37z",
                            "score": 23,
                            "created_utc": 1613494564.0,
                            "replies": [
                                {
                                    "body": "Girl, you and me both. I've had rude POT SDs say, \"would you meet me without a face pic?\" And I say yes as I have and will continue to. The M&G is where it's at anyway. I am not interested in trying to repair my reputation. Too many assholes out there!\n\nOP, so sorry for you and more importantly, your SB. What a dick this ex is. I'm sure many of us can relate!",
                                    "author": "BlueJayJay82",
                                    "id": "gnoihpt",
                                    "parent_id": "t1_gnnwawb",
                                    "score": 15,
                                    "created_utc": 1613504337.0,
                                    "replies": [
                                        {
                                            "body": "Yep! Those who refuse video chat (where we are BOTH visible and can see each other) or to meet without seeing face pictures, I just tell them goodbye.   \np.s. Sent you a PM. Check your chat tab?",
                                            "author": "ExExpectations",
                                            "id": "gns1vkv",
                                            "parent_id": "t1_gnoihpt",
                                            "score": 1,
                                            "created_utc": 1613579354.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Exactly. No face pics.  \n\nAlso, putting together an “SD mafia” is one of the best ideas I have heard so far on this sub. Almost every SB I have met has an ex SD who loses all sense once the SB has moved on to a new relationship and goes through a period of harassing their ex SB. Creates all this unnecessary drama. Wouldn’t an SD mafia be nice in this case to just confront the person and say “Dude, stop, you know better”.",
                                    "author": "parttimeSD",
                                    "id": "gno69eo",
                                    "parent_id": "t1_gnnwawb",
                                    "score": 20,
                                    "created_utc": 1613498924.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There are many examples of partial face that show the beauty without being recognizable",
                    "author": "pinotandsugar",
                    "id": "gnp1smq",
                    "parent_id": "t1_gnnuino",
                    "score": 8,
                    "created_utc": 1613512887.0,
                    "replies": [
                        {
                            "body": "Exactly. Or even cropped-head pictures 😃🤪",
                            "author": "ExExpectations",
                            "id": "gnqas37",
                            "parent_id": "t1_gnp1smq",
                            "score": 1,
                            "created_utc": 1613536086.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "As usual, I love you.",
                    "author": "FoxyFreckles1989",
                    "id": "gnpbe6p",
                    "parent_id": "t1_gnnuino",
                    "score": 3,
                    "created_utc": 1613517468.0,
                    "replies": []
                },
                {
                    "body": "If you have a lot to lose and/ or an obviously 10/10 body, sure.  But you're leaving money on the table if you don't let guys know what you look like.  Of course, whether it's worth the risk to a person depends on everyone's individual circumstances. \n\nThere are many men out there - like yours truly - who have been burned too many times rolling the dice on what a girl's pixelated face actually looks like.",
                    "author": null,
                    "id": "gnpnrqm",
                    "parent_id": "t1_gnnuino",
                    "score": 1,
                    "created_utc": 1613523752.0,
                    "replies": [
                        {
                            "body": "I’m not sure what kind of “been burned” by women’s pixelated pictures mean exactly. Is it as severe as what was mentioned in the post? Her family now knows about her secret life, and she may possibly have to deal with her children’s custody issues because of this information provided by the ex.\n\nWhatever “burnt” you’ve experienced, I’m sorry that happened. Maybe ask for a video call before committing to meeting. Or just a brief coffee at a time and day that’s convenient for both to meet in public. The little bit of inconvenience far outweighs risking whoever may come across women pictures on SA and have their lives wrecked because of it. \n\nAnd those who feels the same as you wouldn’t be someone I’d want to meet - if you can’t respect my comfort level and need for anonymity and privacy. 🤷🏻‍♀️",
                            "author": "ExExpectations",
                            "id": "gnpqtc5",
                            "parent_id": "t1_gnpnrqm",
                            "score": 8,
                            "created_utc": 1613525329.0,
                            "replies": [
                                {
                                    "body": ">I’m sorry that happened.\n\nHaha thanks, it's really not the end of the world.  It's more like, on a site designed for people (usually more so the men) to meet people they're attracted to, it's a little annoying to put in the time necessary to 1) establish that y'all get along; and 2) go to meet up only to discover you're not actually attracted to the person. \n\nVideo chatting is a solid workaround, though, and in the post-COVID-19 world a much more acceptable ask than in days gone by.",
                                    "author": null,
                                    "id": "gntzfz8",
                                    "parent_id": "t1_gnpqtc5",
                                    "score": 1,
                                    "created_utc": 1613610233.0,
                                    "replies": [
                                        {
                                            "body": "Really. Take a guess how we women feel when the salty dudes are using it as tinder, or bait and switch us. And pump and dump. All under the guise of being a “sd” 🙄 I feel zero sympathy for the “hassles” you face, but it’s in NO WAY comparable to her privacy and the damages that can bring to a woman’s life.",
                                            "author": "ExExpectations",
                                            "id": "gnu2bq9",
                                            "parent_id": "t1_gntzfz8",
                                            "score": 1,
                                            "created_utc": 1613611674.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, there are annoying hurdles on both sides of the gender divide. \n\n>I feel zero sympathy for the “hassles” you face\n\nWell, perhaps you could try.  One person's grievances don't detract from those of others, even if the first person's are greater.  Wouldn't it be nice if no one ever had to deal with any annoying bullshit?",
                                                    "author": null,
                                                    "id": "gnu5uwx",
                                                    "parent_id": "t1_gnu2bq9",
                                                    "score": 1,
                                                    "created_utc": 1613613404.0,
                                                    "replies": [
                                                        {
                                                            "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
                                                            "author": "ExExpectations",
                                                            "id": "gnuc8bg",
                                                            "parent_id": "t1_gnu5uwx",
                                                            "score": 1,
                                                            "created_utc": 1613616557.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm just curious, how exactly were you \"burned\" by not getting a clear pic of someone? Was the worst thing to happen that you met IRL and weren't attracted? Because that's all I would ever ask someone to do - and it could be for something as inexpensive as coffee, so really not much of a gamble.",
                            "author": "BlueJayJay82",
                            "id": "gnqnlaq",
                            "parent_id": "t1_gnpnrqm",
                            "score": 4,
                            "created_utc": 1613544040.0,
                            "replies": [
                                {
                                    "body": "RIGHT?! Ugh. The false equivalence of some people! I guess their occasional \"waste\" of 45-60min time is more important than the havoc that breeches and damages of privacy and reputation on some lowly poor women. After all, we are nothing but objects. 🙄",
                                    "author": "ExExpectations",
                                    "id": "gns07b0",
                                    "parent_id": "t1_gnqnlaq",
                                    "score": 2,
                                    "created_utc": 1613578640.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Was the worst thing to happen that you met IRL and weren't attracted?\n\nCorrect.  And it's not the end of the world, but that's a lot of time wasted in talking and setting things up only to arrive and be like oh, I'm not attracted to you at all.",
                                    "author": null,
                                    "id": "gntyxqk",
                                    "parent_id": "t1_gnqnlaq",
                                    "score": 0,
                                    "created_utc": 1613609978.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is such a very rare occurrence, though (on both/either side). There are literally tens (hundreds?) of thousands of SBs with pictures on their profiles on SA and the other sites who never have any issue whatsoever. \n\nRather than a blanket statement of no pictures, it needs to be based on an individual's circumstances. If you have an abusive ex, then no pics. Or work in a field that's sensitive to being exposed for this type of thing, etc. \n\nI disagree with the blanket admonition to not have pictures on a profile.",
                    "author": "Y_4Z44",
                    "id": "gnq1al8",
                    "parent_id": "t1_gnnuino",
                    "score": 0,
                    "created_utc": 1613530806.0,
                    "replies": [
                        {
                            "body": "X happens so infrequently / rarely / occasionally so Y doesn’t need to be applied across the board.\n\nOkay; you do you. \n\nI stand by my convictions. And I will continue to tell SBs they SHOULD NOT show their face pictures publicly or privately on SA in order to be successful in the sugar world.\n\nAnd - I never said no pictures at all. I said NO FACE PICTURES.",
                            "author": "ExExpectations",
                            "id": "gnq54p4",
                            "parent_id": "t1_gnq1al8",
                            "score": 0,
                            "created_utc": 1613532888.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gnnulca",
            "parent_id": "t3_ll7hvt",
            "score": 9,
            "created_utc": 1613493814.0,
            "replies": [
                {
                    "body": "Yea he knows nothing about me. She doesn’t have my full name either and I always use a burner. I know enough about him, his gf and employer to cause plenty of problems for him. Just needed to rant today. Thanks",
                    "author": "zztop1999",
                    "id": "gnnvd5h",
                    "parent_id": "t1_gnnulca",
                    "score": 18,
                    "created_utc": 1613494156.0,
                    "replies": [
                        {
                            "body": " I know enough about him, his gf and employer to cause plenty of problems for him.\n\nWell, do that then.",
                            "author": "GSSD",
                            "id": "gnnx6fv",
                            "parent_id": "t1_gnnvd5h",
                            "score": 15,
                            "created_utc": 1613494944.0,
                            "replies": [
                                {
                                    "body": "Two things I learned in the bowl:\n\n1. Never get involved in a land war in Asia (long story).\n\n2. Never get into the middle of someone else's marital problems.",
                                    "author": null,
                                    "id": "gno51nv",
                                    "parent_id": "t1_gnnx6fv",
                                    "score": 22,
                                    "created_utc": 1613498390.0,
                                    "replies": [
                                        {
                                            "body": "Did you have Vizzini as a sugar daddy earlier in your life?",
                                            "author": "BinghamtonSD",
                                            "id": "gnobow6",
                                            "parent_id": "t1_gno51nv",
                                            "score": 7,
                                            "created_utc": 1613501286.0,
                                            "replies": [
                                                {
                                                    "body": "> Vizzini \n\nIt's not.. inconceivable.",
                                                    "author": null,
                                                    "id": "gnodsq9",
                                                    "parent_id": "t1_gnobow6",
                                                    "score": 9,
                                                    "created_utc": 1613502196.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Wait...are you Sicilian?",
                                            "author": "sdphilly",
                                            "id": "gnoiobj",
                                            "parent_id": "t1_gno51nv",
                                            "score": 5,
                                            "created_utc": 1613504419.0,
                                            "replies": [
                                                {
                                                    "body": "I come from Australia, as everyone knows..",
                                                    "author": null,
                                                    "id": "gnokj0s",
                                                    "parent_id": "t1_gnoiobj",
                                                    "score": 3,
                                                    "created_utc": 1613505248.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I mean, this is probably against the rules, but I wouldn't be mad if you smashed his world up a bit... that's beyond messed up for her.",
                            "author": "Lucy_in_the_sky_0",
                            "id": "gnowotw",
                            "parent_id": "t1_gnnvd5h",
                            "score": 7,
                            "created_utc": 1613510645.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s a possibility that she might be able to see you again after things cool down. Her family won’t be in her business forever (hopefully) so if you’re willing to wait it out you should. Though it might not be worth it as something similar could happen again. Crazy exes are a red flag that I’d be sure to avoid if I were you. Best wishes!",
            "author": "curly_spice",
            "id": "gnntxxq",
            "parent_id": "t3_ll7hvt",
            "score": 8,
            "created_utc": 1613493528.0,
            "replies": [
                {
                    "body": "Yes you are correct. I expressed that to her in our last chat. She was just blossoming in front of me with confidence and courage. Her day job was strong and her side hustle was growing. This EX is just trying to destroy it all for spite. He doesn’t even know she found a SD. He just knew the SA profile would aggravate her parents. Mean just to be mean.",
                    "author": "zztop1999",
                    "id": "gnnuv5o",
                    "parent_id": "t1_gnntxxq",
                    "score": 9,
                    "created_utc": 1613493935.0,
                    "replies": [
                        {
                            "body": " At least you have the comfort of knowing other parts of her life are going well even though two of you have to end things (for now). Be proud of that and try not to let her ex’s actions impact you too much.",
                            "author": "curly_spice",
                            "id": "gnnwwtn",
                            "parent_id": "t1_gnnuv5o",
                            "score": 4,
                            "created_utc": 1613494829.0,
                            "replies": []
                        },
                        {
                            "body": "> Mean just to be mean.\n\nA lot of that going on in the world today unfortunately.",
                            "author": "GSSD",
                            "id": "gnnxdx0",
                            "parent_id": "t1_gnnuv5o",
                            "score": 3,
                            "created_utc": 1613495033.0,
                            "replies": []
                        },
                        {
                            "body": "The other post and their sentiments are correct. I think it's important to give her some space but tell her you're around if she needs you. I've run into similar situations and I have left just an email address for ex SB's if contact needs to be made. It's possible to be supportive from afar; it's tough but possible.",
                            "author": "Notjustl00king",
                            "id": "gnpsfff",
                            "parent_id": "t1_gnnuv5o",
                            "score": 1,
                            "created_utc": 1613526167.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "*Fast forward we have had 3 great months. All things are positive. She is amazed at how a man can treat a woman when they have the woman’s interest to heart.* \n\nThe end to an SR can be sad and rough. But I want to you think of the good things you did for this woman over the course of 3 months. not only did you provide financial support, but you gave her the emotional/psychological boost of knowing than a man can and SHOULD treat her well. You can look at yourself in the mirror and know you made a positive impact on her life, longer term. And at the end of the day, that's what we, as SDs, need to do.",
            "author": "BinghamtonSD",
            "id": "gnocarn",
            "parent_id": "t3_ll7hvt",
            "score": 7,
            "created_utc": 1613501546.0,
            "replies": []
        },
        {
            "body": "> Why can't EX hubands just leave it alone?\n\nFor the same reason jealous BF's can't. The woman gained confidence, moved on from his sorry drama-llama ass and he gets butthurt when he realizes she doesn't need HIM or his \"D\" anymore.\n\nI think many of us have lost spectacular SB's to this exact kind of bullshit. \n\nBest thing to do is extricate yourself from it. I know it hurts and I know she's amazing - but contacting him or doing anything will just add gas to the fire. If she gains strength and clarity and comes back to you? Awesome! If not, cut your losses and walk leaving her with the memories of her time with you being good ones.\n\nOtherwise it will only end in tears.",
            "author": "SDRippington",
            "id": "gnnwlgq",
            "parent_id": "t3_ll7hvt",
            "score": 13,
            "created_utc": 1613494691.0,
            "replies": [
                {
                    "body": "I’m not saying it’s the case here, but there is a financial motive here.  If she’s getting demonstrable support as a SB, he can make a claim to reduce child support.  He can also claim that she’s acting as an escort and try to get the custody agreement changed.  The viability of those arguments are dependent on your state law, but it gives him considerable leverage.  Especially, if her parents are likely to be upset.",
                    "author": "BigSugar44",
                    "id": "gnoxxjn",
                    "parent_id": "t1_gnnwlgq",
                    "score": 3,
                    "created_utc": 1613511183.0,
                    "replies": [
                        {
                            "body": "Oh agreed. Any way you slice it, poking that bear is not at all worth it. Good intentions or not - staying away from it is simply the best course of action.",
                            "author": "SDRippington",
                            "id": "gnpjt4o",
                            "parent_id": "t1_gnoxxjn",
                            "score": 2,
                            "created_utc": 1613521707.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">>    Why can't EX hubands just leave it alone?\n> \n> For the same reason jealous BF's can't.\n\noh yeah, because women NEVER do any anything unfair or underhanded driven by uncontrollable emotion...",
                    "author": "sucRoseToTheOccasion",
                    "id": "gnpryuj",
                    "parent_id": "t1_gnnwlgq",
                    "score": -2,
                    "created_utc": 1613525926.0,
                    "replies": [
                        {
                            "body": "Oh puhleeze. Are you wanting me to rephrase my stuff as some \"gender neutral\" bullshit? Whatever. \n\nMen and women both can be over-emotional, batshit crazy people. \n\nI was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS, both of which I have had to deal with in SR's.",
                            "author": "SDRippington",
                            "id": "gnpsozl",
                            "parent_id": "t1_gnpryuj",
                            "score": 3,
                            "created_utc": 1613526303.0,
                            "replies": [
                                {
                                    "body": "> *I was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS*\n\nno, you were addressing the immediate question about ex HUSBANDS and it's you who brought up ex BOYFRIENDS which I read as white knighting, which you are now throwing a hissy fit about",
                                    "author": "sucRoseToTheOccasion",
                                    "id": "gnpxbip",
                                    "parent_id": "t1_gnpsozl",
                                    "score": -1,
                                    "created_utc": 1613528725.0,
                                    "replies": [
                                        {
                                            "body": "Read into it all ya want, I \"white knight\" on occasion and I absolutely make no excuses for it. Don't like it? Don't care :-)\n\nThing is, in my SR's I've seen more guys in my SB's lives \"lose their shit\" over things WAY more often than the women do. \n\nAnd no hissy fit. Just calling them the way I see em :-) You're the one trying to pull the _\"but...but... the women tho\"_, card ;)",
                                            "author": "SDRippington",
                                            "id": "gnpydhg",
                                            "parent_id": "t1_gnpxbip",
                                            "score": 2,
                                            "created_utc": 1613529275.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gnoo5j2",
            "parent_id": "t3_ll7hvt",
            "score": 5,
            "created_utc": 1613506890.0,
            "replies": [
                {
                    "body": "Ultra Christian family and her profile pics was from a boudoir photo shoot taken after the divorce was final. But the Christian family dynamic is the biggest factor. I am starting to think that her father may have been treating her as bad prior to her getting married.",
                    "author": "zztop1999",
                    "id": "gnopkrv",
                    "parent_id": "t1_gnoo5j2",
                    "score": 3,
                    "created_utc": 1613507519.0,
                    "replies": []
                },
                {
                    "body": "No it isn’t.  There is a connotation to SA that it’s guys paying women for sex.  That’s not going to play very well in a child custody hearing.  Also, if she’s getting money from a SD that’s going to potentially reduce the amount of her child support because you could make a strong argument that it’s income.  This is why you don’t want to discuss financial or sexual arrangements  in apps that leave a trail.  It’s discoverable in a legal proceeding.",
                    "author": "BigSugar44",
                    "id": "gnow8m6",
                    "parent_id": "t1_gnoo5j2",
                    "score": 3,
                    "created_utc": 1613510450.0,
                    "replies": [
                        {
                            "body": "Yes I agree with this. The ex-husband is no doubt paying child support, and possibly alimony or other financial support too, so of course he is going to be angry if she has large amounts of undeclared earnings. I think that is obvious.",
                            "author": "Miercolesian",
                            "id": "gnoxxnl",
                            "parent_id": "t1_gnow8m6",
                            "score": 2,
                            "created_utc": 1613511185.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sort of drama goes on in families all the time.  My rule is to try to screen for it early on. But if it arises during the SR, I back off and get out of it. \n\nYou can't fix her crazy family drama issues. I'm sure the money was helping her.  I'm sorry for your loss but if you insert yourself by contacting the ex or having someone do it on your behalf, you'll just multiply the drama for her and her kids, as well as you.\n\nWe've all lost spectacular SB's for any of a variety of reasons. It comes with the territory :(",
            "author": null,
            "id": "gnnt624",
            "parent_id": "t3_ll7hvt",
            "score": 4,
            "created_utc": 1613493188.0,
            "replies": [
                {
                    "body": "Yes correct. Just needed to vent. Early Opsec showed he had a new GF and was living life. And yes the $ was the cherry on top since she has a fantastic job. The $ let her spoil herself and her kids.",
                    "author": "zztop1999",
                    "id": "gnntnd2",
                    "parent_id": "t1_gnnt624",
                    "score": 5,
                    "created_utc": 1613493400.0,
                    "replies": [
                        {
                            "body": "Believe me, even though I have a GREAT SB right now there is one I still pine away for. Lost her to a committed relationship. Sucks but we move on.",
                            "author": null,
                            "id": "gnntyh0",
                            "parent_id": "t1_gnntnd2",
                            "score": 6,
                            "created_utc": 1613493535.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You can't stuff the genie back in the bottle, or choke the genie to death.  She might have been able to accuse the ex of creating the profile himself, but it's too late for that.  She has to worry about custody of her children.  Leave it alone!  She'll contact you if the time is ever right again.",
            "author": "hal99514",
            "id": "gno7qdn",
            "parent_id": "t3_ll7hvt",
            "score": 4,
            "created_utc": 1613499566.0,
            "replies": []
        },
        {
            "body": "See this is why Ive been slowly building up the case of me being the lovable black sheep of the family. That way when this all comes out they’re not gonna be too fazed by all this. Theyre just gonna be, “Goddammit, (insert my name here), not again.” Im pretty open about my thoughts/feelings and a lot of the women in my family love that I talk back to the sexist men in my family. Just when they thought I couldnt do anything stupider, I prove them wrong! 😤",
            "author": "LaIndiaDeAzucar",
            "id": "gnoty3x",
            "parent_id": "t3_ll7hvt",
            "score": 4,
            "created_utc": 1613509425.0,
            "replies": []
        },
        {
            "body": "It makes me incredibly angry that her parents put her down and told her she had disappointed and embarrassed them. I seriously won’t ever understand people reacting like that. I also wish she was able to tell the ex-husband that he can’t use this information to destroy her, because there’s nothing wrong with any of it and she isn’t ashamed/embarrassed. I understand that everybody has their limits, but it just makes me so fucking mad to know that a piece of shit dude like that is coming out on top in this situation.\n\nWhen my ex narcissistic abuser got in touch with me a few months ago, out of nowhere after seven years of no contact, I didn’t play the games he wanted me to play and he wound up saying that he was just going to expose me for being on SA and tell “all my sugar daddies” what kind of person I really was. All this really did was tell me that he’s been stalking me online, but it didn’t have the effect he was hoping it would because my whole family and my closest friends know I’m on the website/know I sugar. It was the first time since meeting that douche canoe that I was able to walk away from his threats and manipulation knowing that he legitimately couldn’t do anything to hurt me. I won’t say that it didn’t still make me sick to my stomach, nor can I be sure that he isn’t planning something else to hurt me, but that specific thing that he threatened me with was useless. \n\nI wish everyone had such open minded and understanding families. I’m so sorry that this happened, but the best thing you can do is let her be right now.\n\n**SBs: when you are signing up for sugar sites, please ask yourself, “would I be OK with my family knowing about this?“ If the answer is no, do not post any pictures that might reveal your identity and make decisions when communicating with new POTs that protect your identity as well.**",
            "author": "FoxyFreckles1989",
            "id": "gnpd854",
            "parent_id": "t3_ll7hvt",
            "score": 4,
            "created_utc": 1613518375.0,
            "replies": []
        },
        {
            "body": "My heart aches for her!",
            "author": "MJline",
            "id": "gnpmkhq",
            "parent_id": "t3_ll7hvt",
            "score": 2,
            "created_utc": 1613523135.0,
            "replies": []
        },
        {
            "body": "is there a SD mafia\n\nWe have a couple of guys here who have volunteered their services /s",
            "author": "GSSD",
            "id": "gnnx3ns",
            "parent_id": "t3_ll7hvt",
            "score": 2,
            "created_utc": 1613494909.0,
            "replies": [
                {
                    "body": "I was ready to jump on a plane to SD mafia that guy who raped a young lady last week.  so yeah think could be a real thing.",
                    "author": "Buckeyechamp21",
                    "id": "gno1sl2",
                    "parent_id": "t1_gnnx3ns",
                    "score": 8,
                    "created_utc": 1613496966.0,
                    "replies": [
                        {
                            "body": "\"The Avengers\"-catchy title. I wonder if anyone has thought of that one/s",
                            "author": "GSSD",
                            "id": "gno67qq",
                            "parent_id": "t1_gno1sl2",
                            "score": 2,
                            "created_utc": 1613498903.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This happens more often than not sadly.",
            "author": "BlueandAuburn",
            "id": "gnoo3tk",
            "parent_id": "t3_ll7hvt",
            "score": 1,
            "created_utc": 1613506869.0,
            "replies": []
        },
        {
            "body": "I dont understand why you have to go all through this. Sugar lifestyle is supposed to be stress free. Seems like you are falling in love or no other better option  🤷🏼‍♀️",
            "author": "ITSNEENAH",
            "id": "gnpxo7k",
            "parent_id": "t3_ll7hvt",
            "score": 0,
            "created_utc": 1613528912.0,
            "replies": [
                {
                    "body": "Oh there is no “ falling in love here”. I was just really enjoying the growth of the arrangement and her enthusiasm to share her passions in life as well as her excitement to be adventurous behind closed doors. She was raised ultra conservative to have missionary sex, serve her husband and have kids. 4 yrs of marriage and 2 kids. Plus being cheated on 3 times that she knew about but taking the blame for not being a better wife. It was just fun to open her eyes to what living can be like.",
                    "author": "zztop1999",
                    "id": "gnpypzn",
                    "parent_id": "t1_gnpxo7k",
                    "score": 3,
                    "created_utc": 1613529457.0,
                    "replies": [
                        {
                            "body": "Ehhhh just move on then. So much drama",
                            "author": "ITSNEENAH",
                            "id": "gnpzzdx",
                            "parent_id": "t1_gnpypzn",
                            "score": 0,
                            "created_utc": 1613530122.0,
                            "replies": [
                                {
                                    "body": "Basically have. She knows the door is open if she needs help but I know I can’t make her ask for it",
                                    "author": "zztop1999",
                                    "id": "gnq06si",
                                    "parent_id": "t1_gnpzzdx",
                                    "score": 2,
                                    "created_utc": 1613530228.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "what is SA?",
            "author": "mostro33",
            "id": "gnp3me0",
            "parent_id": "t3_ll7hvt",
            "score": -2,
            "created_utc": 1613513732.0,
            "replies": [
                {
                    "body": "Seriously?? Seeking Arrangement",
                    "author": "zztop1999",
                    "id": "gnptnfr",
                    "parent_id": "t1_gnp3me0",
                    "score": 1,
                    "created_utc": 1613526799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude women who have kids are still in love with there husband no matter what , they are confused and don’t know what to do. When ex keep up show up that’s a red flag 🚩 he will keep damaging her on phone and text or social media and mostly likely go back with the husband. \nJust find a single girl with no kids . That have time to go out and go on vacation without baby daddy harassing her .",
            "author": "boostedmanLA",
            "id": "gnoxtgj",
            "parent_id": "t3_ll7hvt",
            "score": -5,
            "created_utc": 1613511133.0,
            "replies": [
                {
                    "body": "No love here. Just crazy ex that is vindictive and he’ll bent on making her life unbearable. He had been MIA since the divorce with his new GF. I am pretty sure he saw her being happy. Enjoying life and picking up some new things from her allowance $ and he got jealous.",
                    "author": "zztop1999",
                    "id": "gnptzyh",
                    "parent_id": "t1_gnoxtgj",
                    "score": 1,
                    "created_utc": 1613526981.0,
                    "replies": []
                },
                {
                    "body": "I'm not even sure where to begin correcting you here...",
                    "author": "BlueJayJay82",
                    "id": "gnqod8p",
                    "parent_id": "t1_gnoxtgj",
                    "score": 1,
                    "created_utc": 1613544607.0,
                    "replies": [
                        {
                            "body": "Hi not even sure where to begin correcting you here, I'm Dad! :)",
                            "author": "dadbot_3000",
                            "id": "gnqodu7",
                            "parent_id": "t1_gnqod8p",
                            "score": 1,
                            "created_utc": 1613544619.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You could have met somewhere else.  And she should get an order of restraint against him.  Collect any data and there is also the fact that people steal pictures is there anything that is specifically her that would definitely tell them it was her?\n\nI might offer to be an ear for her maybe she will feel comfortable starting again after a breather?  Sorry to hear I hope he doesn't up the ante and become more unstable.",
            "author": "KittenReigns",
            "id": "gno40mr",
            "parent_id": "t3_ll7hvt",
            "score": 1,
            "created_utc": 1613497946.0,
            "replies": [
                {
                    "body": "A private forensic investigator could positively identify that she made the profile for under $1000.  For another $1000 to $1,500 and a Court order from a family law judge, they could get all your email correspondence, text correspondence etc, bank records, etc.  Sugaring when you just went through a contentious divorce or child custody battle isn’t very smart.",
                    "author": "BigSugar44",
                    "id": "gnox0gs",
                    "parent_id": "t1_gno40mr",
                    "score": 1,
                    "created_utc": 1613510784.0,
                    "replies": [
                        {
                            "body": "Given the status of her previous relationship my guess is she was in a bind.  Sounds like the guy, ex dirtbag, isn't about the legality but just stirring up shit at least off hand it reads that way.",
                            "author": "KittenReigns",
                            "id": "gns4f5q",
                            "parent_id": "t1_gnox0gs",
                            "score": 1,
                            "created_utc": 1613580424.0,
                            "replies": [
                                {
                                    "body": "Doesn’t change the overall analysis, which wasn’t necessarily meant for the OP because he has already crossed the Rubicon on that.",
                                    "author": "BigSugar44",
                                    "id": "gns8e9b",
                                    "parent_id": "t1_gns4f5q",
                                    "score": 1,
                                    "created_utc": 1613582124.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had a SB many years ago who had an abusive ex.  This guy would get drunk and show up at her place.  The cops had to come a few times (who, btw, were just as abusive towards her as he was).\n\nLuckily, the guys family was supportive of her and her daughter.  They brought the hammer down on him more than any mafia could.",
            "author": "sdphilly",
            "id": "gnoj78r",
            "parent_id": "t3_ll7hvt",
            "score": 1,
            "created_utc": 1613504655.0,
            "replies": []
        },
        {
            "body": "This is extortion. A felony, a federal crime. Just the threat is enough. If you still have contact with her, ask her to see a lawyer. At the very least, lawyer will put her mind at ease and it won’t cost her anything. \n\nIf she wants the lawyer to do something it will cost (letter, talk to the guy) - but if she und the SR are really important to you, maybe you can help her out with that?",
            "author": "BlBl_SD",
            "id": "gnpzak1",
            "parent_id": "t3_ll7hvt",
            "score": 1,
            "created_utc": 1613529759.0,
            "replies": []
        },
        {
            "body": "Why would someone admit that it is their profile if they knew their family would blow up? \n\nWhy wouldn’t you just state that your crazy, stalking ex-husband made up the profile to try and shame you? And what family wouldn’t just support their kid rather than believing a crazy, abusive ex?\n\nAnyone can make a profile if you have pictures elsewhere online (Facebook, etc). And an ex-husband would have lots of pictures of you that aren’t public. It just doesn’t make sense to me to ever get into a situation like this when you can insert so many ideas to doubt a fucking ex...",
            "author": "WCSD74",
            "id": "gnq4zdt",
            "parent_id": "t3_ll7hvt",
            "score": 1,
            "created_utc": 1613532804.0,
            "replies": [
                {
                    "body": "I agree. I can only assume she panicked. But very nice of you to blame her.",
                    "author": "zztop1999",
                    "id": "gns9w5o",
                    "parent_id": "t1_gnq4zdt",
                    "score": 1,
                    "created_utc": 1613582762.0,
                    "replies": [
                        {
                            "body": "Blame? I don’t think I’m blaming her. He is the asshole, no doubt. None of this would have happened if he was a decent human being. On the other hand, she ust isn’t very smart. The sugar world is a world that many look down on and can have real consequences if discovered you are in (not just by wives, but work, friends and family). No one should be entering into this lifestyle without thinking about the consequences to them if exposed, and what they are going to do in advance if someone exposes them (what is the plan to mitigate the risk of exposure). Seems like she didn’t think of any of that. \n\nNow with you being the experienced SD, did you coach here through this thought process? And if not, do you think it is worth while to start doing that in the future?",
                            "author": "WCSD74",
                            "id": "gnuu9a9",
                            "parent_id": "t1_gns9w5o",
                            "score": 1,
                            "created_utc": 1613626556.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are crazy people everywhere.",
            "author": "Mining4Gold2",
            "id": "gnw5jqj",
            "parent_id": "t3_ll7hvt",
            "score": 1,
            "created_utc": 1613661508.0,
            "replies": []
        },
        {
            "body": "No he doesn't. He could do like my ex did which was remotely send spy software to install on my computer to \"watch\" me. Despite the fact that at that time we had been divorced for a couple yrs. This was ALL over custody stuff by the way. Some men don't play fair.",
            "author": "clair-cummings",
            "id": "gnoi9ei",
            "parent_id": "t1_gno7zgo",
            "score": 20,
            "created_utc": 1613504235.0,
            "replies": [
                {
                    "body": "Sure \"all is fair in love and war,\" but that there sounds like a violation of federal wiretapping laws, as well as the Computer Fraud and Abuse Act.\n\nNow, takes a bit of work usually to actually prove that in court, but if you can then he's going to have more important issues to deal with than if you're an SB or not...",
                    "author": "quietgrey1",
                    "id": "gnpakud",
                    "parent_id": "t1_gnoi9ei",
                    "score": 7,
                    "created_utc": 1613517067.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like good old standard slut shaming. :/",
            "author": "quietgrey1",
            "id": "gnpa4sp",
            "parent_id": "t1_gno7zgo",
            "score": 3,
            "created_utc": 1613516845.0,
            "replies": []
        },
        {
            "body": "I had one picture of my body .\n\nHaving been in a previously abusive relationship I don’t trust anything. I always envy the people who can have their pretty faces on the app. \n\nI’m just not one of them. \n\nI wish there was a warning on the subreddit about this. Like “hey if your family saw you , would you be fine with it ?”",
            "author": "Momotheblack",
            "id": "gnopawr",
            "parent_id": "t1_gnnuino",
            "score": 25,
            "created_utc": 1613507399.0,
            "replies": [
                {
                    "body": "This makes me feel so bad. See, my entire family, consisting of my mom and four younger siblings, already knows that I’m on SA. \n\nMy abusive, narcissistic ex tried to pull the same thing on me that this post is about a few months ago. He came out of the woodwork after seven years of no contact threatening to “out me,” citing quotes from my SA profile and saying things like, “maybe if you don’t do what I say, I’ll tell all your sugar daddies.”\n\nI was able to send him one text message telling him that he could tell anybody anything he wanted, because everyone important already knows and he had absolutely nothing that would hurt me. Then I blocked him and dealt with the feelings that his contacting me brought up, and moved on. I really wish that there was something I could do for SBs like the one in the story and for you.",
                    "author": "FoxyFreckles1989",
                    "id": "gnpbzlx",
                    "parent_id": "t1_gnopawr",
                    "score": 15,
                    "created_utc": 1613517764.0,
                    "replies": [
                        {
                            "body": "Yeah I also have a narcissistic ex.\n\nI’m too afraid to actually even discuss any arrangement on a vanilla site . It feels like I’m being watched .\n\nI’ve stopped posting on most social media. Until I feel comfortable. Not to mention he went onto my Twitter , found a tweet I commented on about emotional abuse and commented on it stating “heart break doesn’t make you a an expert “.\n\nYou’re lucky/blessed your family is supportive. Mine would be ashamed and embarrassed. They would most likely call me a prostitute 😂.",
                            "author": "Momotheblack",
                            "id": "gnpeo0v",
                            "parent_id": "t1_gnpbzlx",
                            "score": 7,
                            "created_utc": 1613519100.0,
                            "replies": [
                                {
                                    "body": "I’m definitely lucky. My mom didn’t used to be this open minded. I was raised Catholic and went to a Catholic school, and was initially taught (at school, not necessarily by mom) that birth control, premarital sex, abortion, masturbation and being gay were all sins. Then, I decided not to get confirmed and switch to public school and junior high. All four of my younger siblings followed suit. Several of us came out as gay, I had a child out of wedlock at 18, and, well, you get the point. \n\nMom was forced to either get with the times or lose her close relationships with all five of her children. She made the right choice. By the time I told her that I was sugaring for the first time, nearly 10 years ago, I had told her much more shocking and potentially disappointing news several times over. 😂\n\nI’m really sorry that you have to deal with that. Nobody deserves it. I got rid of almost all of my social media about a year ago, as well, for similar reasons. The only one I really have left is Twitter, which I rarely use and definitely doesn’t have anything personal on it.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gnpg064",
                                    "parent_id": "t1_gnpeo0v",
                                    "score": 5,
                                    "created_utc": 1613519765.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I wish there was a warning on the subreddit about this. Like “hey if your family saw you , would you be fine with it ?”\n\nI would fully support that kind of verbiage!!! And I would extend it to friends, colleagues, and future partners and employers as well!Newbie women (and men) but especially women, somehow think the site's public (and private) pictures and profile is insulated from the eyes of everyone in their lives, but it's often not true. Thoughts of adding something more explicit to the opsec info??  u/azurecole ?  \n\n\nAnd I'm really sorry you had to experience abuse in a previous relationship. Too many of us have been through trauma. :(",
                    "author": "ExExpectations",
                    "id": "gns1a17",
                    "parent_id": "t1_gnopawr",
                    "score": 1,
                    "created_utc": 1613579099.0,
                    "replies": [
                        {
                            "body": "Lol the good news is I left! So don’t be sorry.\n\nBut the warning about hiding yourself should be put on the subreddit. Not just family but some of us are working towards careers where this sort of lifestyle is ostracized. \n\nI’d appreciate a warning lol.",
                            "author": "Momotheblack",
                            "id": "gnsvrj1",
                            "parent_id": "t1_gns1a17",
                            "score": 2,
                            "created_utc": 1613592204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Correct. I am kicking myself for not doing better Opsec for her.",
            "author": "zztop1999",
            "id": "gnnv37z",
            "parent_id": "t1_gnnuino",
            "score": 26,
            "created_utc": 1613494036.0,
            "replies": [
                {
                    "body": "**And yet, here we are, all day long we see men on this forum say shit like this to women regarding their profile reviews “include a smiling picture” or “there’s no reason to have private pictures, it will only make you jaded from receiving all the picture request messages” 🙄🙄**\n\n**No. I don’t get jaded from receiving 200 picture requests. It takes 1 second to delete those messages and ignore those who don’t even read our profiles or send a personal note. But it takes a lifetime to repair privacy breeches and damages.**",
                    "author": "ExExpectations",
                    "id": "gnnwwa3",
                    "parent_id": "t1_gnnv37z",
                    "score": 65,
                    "created_utc": 1613494822.0,
                    "replies": [
                        {
                            "body": "Yeh i dont agree abkut not having private photos",
                            "author": "wb19081908",
                            "id": "gnp5ony",
                            "parent_id": "t1_gnnwwa3",
                            "score": 2,
                            "created_utc": 1613514708.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I meant this for SDs who refuse to even talk or meet pot SBs when they refuse to share face pictures (I’m one of those SBs who don’t share face pictures ever, only meet in person). \n\nWe care about privacy - yours and ours. That should account for something. In your case, that rule would have saved your SR, (if she had that rule in place and you still asked to meet her).",
                    "author": "ExExpectations",
                    "id": "gnnwawb",
                    "parent_id": "t1_gnnv37z",
                    "score": 23,
                    "created_utc": 1613494564.0,
                    "replies": [
                        {
                            "body": "Girl, you and me both. I've had rude POT SDs say, \"would you meet me without a face pic?\" And I say yes as I have and will continue to. The M&G is where it's at anyway. I am not interested in trying to repair my reputation. Too many assholes out there!\n\nOP, so sorry for you and more importantly, your SB. What a dick this ex is. I'm sure many of us can relate!",
                            "author": "BlueJayJay82",
                            "id": "gnoihpt",
                            "parent_id": "t1_gnnwawb",
                            "score": 15,
                            "created_utc": 1613504337.0,
                            "replies": [
                                {
                                    "body": "Yep! Those who refuse video chat (where we are BOTH visible and can see each other) or to meet without seeing face pictures, I just tell them goodbye.   \np.s. Sent you a PM. Check your chat tab?",
                                    "author": "ExExpectations",
                                    "id": "gns1vkv",
                                    "parent_id": "t1_gnoihpt",
                                    "score": 1,
                                    "created_utc": 1613579354.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Exactly. No face pics.  \n\nAlso, putting together an “SD mafia” is one of the best ideas I have heard so far on this sub. Almost every SB I have met has an ex SD who loses all sense once the SB has moved on to a new relationship and goes through a period of harassing their ex SB. Creates all this unnecessary drama. Wouldn’t an SD mafia be nice in this case to just confront the person and say “Dude, stop, you know better”.",
                            "author": "parttimeSD",
                            "id": "gno69eo",
                            "parent_id": "t1_gnnwawb",
                            "score": 20,
                            "created_utc": 1613498924.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are many examples of partial face that show the beauty without being recognizable",
            "author": "pinotandsugar",
            "id": "gnp1smq",
            "parent_id": "t1_gnnuino",
            "score": 8,
            "created_utc": 1613512887.0,
            "replies": [
                {
                    "body": "Exactly. Or even cropped-head pictures 😃🤪",
                    "author": "ExExpectations",
                    "id": "gnqas37",
                    "parent_id": "t1_gnp1smq",
                    "score": 1,
                    "created_utc": 1613536086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As usual, I love you.",
            "author": "FoxyFreckles1989",
            "id": "gnpbe6p",
            "parent_id": "t1_gnnuino",
            "score": 3,
            "created_utc": 1613517468.0,
            "replies": []
        },
        {
            "body": "If you have a lot to lose and/ or an obviously 10/10 body, sure.  But you're leaving money on the table if you don't let guys know what you look like.  Of course, whether it's worth the risk to a person depends on everyone's individual circumstances. \n\nThere are many men out there - like yours truly - who have been burned too many times rolling the dice on what a girl's pixelated face actually looks like.",
            "author": null,
            "id": "gnpnrqm",
            "parent_id": "t1_gnnuino",
            "score": 1,
            "created_utc": 1613523752.0,
            "replies": [
                {
                    "body": "I’m not sure what kind of “been burned” by women’s pixelated pictures mean exactly. Is it as severe as what was mentioned in the post? Her family now knows about her secret life, and she may possibly have to deal with her children’s custody issues because of this information provided by the ex.\n\nWhatever “burnt” you’ve experienced, I’m sorry that happened. Maybe ask for a video call before committing to meeting. Or just a brief coffee at a time and day that’s convenient for both to meet in public. The little bit of inconvenience far outweighs risking whoever may come across women pictures on SA and have their lives wrecked because of it. \n\nAnd those who feels the same as you wouldn’t be someone I’d want to meet - if you can’t respect my comfort level and need for anonymity and privacy. 🤷🏻‍♀️",
                    "author": "ExExpectations",
                    "id": "gnpqtc5",
                    "parent_id": "t1_gnpnrqm",
                    "score": 8,
                    "created_utc": 1613525329.0,
                    "replies": [
                        {
                            "body": ">I’m sorry that happened.\n\nHaha thanks, it's really not the end of the world.  It's more like, on a site designed for people (usually more so the men) to meet people they're attracted to, it's a little annoying to put in the time necessary to 1) establish that y'all get along; and 2) go to meet up only to discover you're not actually attracted to the person. \n\nVideo chatting is a solid workaround, though, and in the post-COVID-19 world a much more acceptable ask than in days gone by.",
                            "author": null,
                            "id": "gntzfz8",
                            "parent_id": "t1_gnpqtc5",
                            "score": 1,
                            "created_utc": 1613610233.0,
                            "replies": [
                                {
                                    "body": "Really. Take a guess how we women feel when the salty dudes are using it as tinder, or bait and switch us. And pump and dump. All under the guise of being a “sd” 🙄 I feel zero sympathy for the “hassles” you face, but it’s in NO WAY comparable to her privacy and the damages that can bring to a woman’s life.",
                                    "author": "ExExpectations",
                                    "id": "gnu2bq9",
                                    "parent_id": "t1_gntzfz8",
                                    "score": 1,
                                    "created_utc": 1613611674.0,
                                    "replies": [
                                        {
                                            "body": "Yes, there are annoying hurdles on both sides of the gender divide. \n\n>I feel zero sympathy for the “hassles” you face\n\nWell, perhaps you could try.  One person's grievances don't detract from those of others, even if the first person's are greater.  Wouldn't it be nice if no one ever had to deal with any annoying bullshit?",
                                            "author": null,
                                            "id": "gnu5uwx",
                                            "parent_id": "t1_gnu2bq9",
                                            "score": 1,
                                            "created_utc": 1613613404.0,
                                            "replies": [
                                                {
                                                    "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
                                                    "author": "ExExpectations",
                                                    "id": "gnuc8bg",
                                                    "parent_id": "t1_gnu5uwx",
                                                    "score": 1,
                                                    "created_utc": 1613616557.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm just curious, how exactly were you \"burned\" by not getting a clear pic of someone? Was the worst thing to happen that you met IRL and weren't attracted? Because that's all I would ever ask someone to do - and it could be for something as inexpensive as coffee, so really not much of a gamble.",
                    "author": "BlueJayJay82",
                    "id": "gnqnlaq",
                    "parent_id": "t1_gnpnrqm",
                    "score": 4,
                    "created_utc": 1613544040.0,
                    "replies": [
                        {
                            "body": "RIGHT?! Ugh. The false equivalence of some people! I guess their occasional \"waste\" of 45-60min time is more important than the havoc that breeches and damages of privacy and reputation on some lowly poor women. After all, we are nothing but objects. 🙄",
                            "author": "ExExpectations",
                            "id": "gns07b0",
                            "parent_id": "t1_gnqnlaq",
                            "score": 2,
                            "created_utc": 1613578640.0,
                            "replies": []
                        },
                        {
                            "body": ">Was the worst thing to happen that you met IRL and weren't attracted?\n\nCorrect.  And it's not the end of the world, but that's a lot of time wasted in talking and setting things up only to arrive and be like oh, I'm not attracted to you at all.",
                            "author": null,
                            "id": "gntyxqk",
                            "parent_id": "t1_gnqnlaq",
                            "score": 0,
                            "created_utc": 1613609978.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is such a very rare occurrence, though (on both/either side). There are literally tens (hundreds?) of thousands of SBs with pictures on their profiles on SA and the other sites who never have any issue whatsoever. \n\nRather than a blanket statement of no pictures, it needs to be based on an individual's circumstances. If you have an abusive ex, then no pics. Or work in a field that's sensitive to being exposed for this type of thing, etc. \n\nI disagree with the blanket admonition to not have pictures on a profile.",
            "author": "Y_4Z44",
            "id": "gnq1al8",
            "parent_id": "t1_gnnuino",
            "score": 0,
            "created_utc": 1613530806.0,
            "replies": [
                {
                    "body": "X happens so infrequently / rarely / occasionally so Y doesn’t need to be applied across the board.\n\nOkay; you do you. \n\nI stand by my convictions. And I will continue to tell SBs they SHOULD NOT show their face pictures publicly or privately on SA in order to be successful in the sugar world.\n\nAnd - I never said no pictures at all. I said NO FACE PICTURES.",
                    "author": "ExExpectations",
                    "id": "gnq54p4",
                    "parent_id": "t1_gnq1al8",
                    "score": 0,
                    "created_utc": 1613532888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea he knows nothing about me. She doesn’t have my full name either and I always use a burner. I know enough about him, his gf and employer to cause plenty of problems for him. Just needed to rant today. Thanks",
            "author": "zztop1999",
            "id": "gnnvd5h",
            "parent_id": "t1_gnnulca",
            "score": 18,
            "created_utc": 1613494156.0,
            "replies": [
                {
                    "body": " I know enough about him, his gf and employer to cause plenty of problems for him.\n\nWell, do that then.",
                    "author": "GSSD",
                    "id": "gnnx6fv",
                    "parent_id": "t1_gnnvd5h",
                    "score": 15,
                    "created_utc": 1613494944.0,
                    "replies": [
                        {
                            "body": "Two things I learned in the bowl:\n\n1. Never get involved in a land war in Asia (long story).\n\n2. Never get into the middle of someone else's marital problems.",
                            "author": null,
                            "id": "gno51nv",
                            "parent_id": "t1_gnnx6fv",
                            "score": 22,
                            "created_utc": 1613498390.0,
                            "replies": [
                                {
                                    "body": "Did you have Vizzini as a sugar daddy earlier in your life?",
                                    "author": "BinghamtonSD",
                                    "id": "gnobow6",
                                    "parent_id": "t1_gno51nv",
                                    "score": 7,
                                    "created_utc": 1613501286.0,
                                    "replies": [
                                        {
                                            "body": "> Vizzini \n\nIt's not.. inconceivable.",
                                            "author": null,
                                            "id": "gnodsq9",
                                            "parent_id": "t1_gnobow6",
                                            "score": 9,
                                            "created_utc": 1613502196.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Wait...are you Sicilian?",
                                    "author": "sdphilly",
                                    "id": "gnoiobj",
                                    "parent_id": "t1_gno51nv",
                                    "score": 5,
                                    "created_utc": 1613504419.0,
                                    "replies": [
                                        {
                                            "body": "I come from Australia, as everyone knows..",
                                            "author": null,
                                            "id": "gnokj0s",
                                            "parent_id": "t1_gnoiobj",
                                            "score": 3,
                                            "created_utc": 1613505248.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean, this is probably against the rules, but I wouldn't be mad if you smashed his world up a bit... that's beyond messed up for her.",
                    "author": "Lucy_in_the_sky_0",
                    "id": "gnowotw",
                    "parent_id": "t1_gnnvd5h",
                    "score": 7,
                    "created_utc": 1613510645.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes you are correct. I expressed that to her in our last chat. She was just blossoming in front of me with confidence and courage. Her day job was strong and her side hustle was growing. This EX is just trying to destroy it all for spite. He doesn’t even know she found a SD. He just knew the SA profile would aggravate her parents. Mean just to be mean.",
            "author": "zztop1999",
            "id": "gnnuv5o",
            "parent_id": "t1_gnntxxq",
            "score": 9,
            "created_utc": 1613493935.0,
            "replies": [
                {
                    "body": " At least you have the comfort of knowing other parts of her life are going well even though two of you have to end things (for now). Be proud of that and try not to let her ex’s actions impact you too much.",
                    "author": "curly_spice",
                    "id": "gnnwwtn",
                    "parent_id": "t1_gnnuv5o",
                    "score": 4,
                    "created_utc": 1613494829.0,
                    "replies": []
                },
                {
                    "body": "> Mean just to be mean.\n\nA lot of that going on in the world today unfortunately.",
                    "author": "GSSD",
                    "id": "gnnxdx0",
                    "parent_id": "t1_gnnuv5o",
                    "score": 3,
                    "created_utc": 1613495033.0,
                    "replies": []
                },
                {
                    "body": "The other post and their sentiments are correct. I think it's important to give her some space but tell her you're around if she needs you. I've run into similar situations and I have left just an email address for ex SB's if contact needs to be made. It's possible to be supportive from afar; it's tough but possible.",
                    "author": "Notjustl00king",
                    "id": "gnpsfff",
                    "parent_id": "t1_gnnuv5o",
                    "score": 1,
                    "created_utc": 1613526167.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not saying it’s the case here, but there is a financial motive here.  If she’s getting demonstrable support as a SB, he can make a claim to reduce child support.  He can also claim that she’s acting as an escort and try to get the custody agreement changed.  The viability of those arguments are dependent on your state law, but it gives him considerable leverage.  Especially, if her parents are likely to be upset.",
            "author": "BigSugar44",
            "id": "gnoxxjn",
            "parent_id": "t1_gnnwlgq",
            "score": 3,
            "created_utc": 1613511183.0,
            "replies": [
                {
                    "body": "Oh agreed. Any way you slice it, poking that bear is not at all worth it. Good intentions or not - staying away from it is simply the best course of action.",
                    "author": "SDRippington",
                    "id": "gnpjt4o",
                    "parent_id": "t1_gnoxxjn",
                    "score": 2,
                    "created_utc": 1613521707.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">>    Why can't EX hubands just leave it alone?\n> \n> For the same reason jealous BF's can't.\n\noh yeah, because women NEVER do any anything unfair or underhanded driven by uncontrollable emotion...",
            "author": "sucRoseToTheOccasion",
            "id": "gnpryuj",
            "parent_id": "t1_gnnwlgq",
            "score": -2,
            "created_utc": 1613525926.0,
            "replies": [
                {
                    "body": "Oh puhleeze. Are you wanting me to rephrase my stuff as some \"gender neutral\" bullshit? Whatever. \n\nMen and women both can be over-emotional, batshit crazy people. \n\nI was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS, both of which I have had to deal with in SR's.",
                    "author": "SDRippington",
                    "id": "gnpsozl",
                    "parent_id": "t1_gnpryuj",
                    "score": 3,
                    "created_utc": 1613526303.0,
                    "replies": [
                        {
                            "body": "> *I was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS*\n\nno, you were addressing the immediate question about ex HUSBANDS and it's you who brought up ex BOYFRIENDS which I read as white knighting, which you are now throwing a hissy fit about",
                            "author": "sucRoseToTheOccasion",
                            "id": "gnpxbip",
                            "parent_id": "t1_gnpsozl",
                            "score": -1,
                            "created_utc": 1613528725.0,
                            "replies": [
                                {
                                    "body": "Read into it all ya want, I \"white knight\" on occasion and I absolutely make no excuses for it. Don't like it? Don't care :-)\n\nThing is, in my SR's I've seen more guys in my SB's lives \"lose their shit\" over things WAY more often than the women do. \n\nAnd no hissy fit. Just calling them the way I see em :-) You're the one trying to pull the _\"but...but... the women tho\"_, card ;)",
                                    "author": "SDRippington",
                                    "id": "gnpydhg",
                                    "parent_id": "t1_gnpxbip",
                                    "score": 2,
                                    "created_utc": 1613529275.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ultra Christian family and her profile pics was from a boudoir photo shoot taken after the divorce was final. But the Christian family dynamic is the biggest factor. I am starting to think that her father may have been treating her as bad prior to her getting married.",
            "author": "zztop1999",
            "id": "gnopkrv",
            "parent_id": "t1_gnoo5j2",
            "score": 3,
            "created_utc": 1613507519.0,
            "replies": []
        },
        {
            "body": "No it isn’t.  There is a connotation to SA that it’s guys paying women for sex.  That’s not going to play very well in a child custody hearing.  Also, if she’s getting money from a SD that’s going to potentially reduce the amount of her child support because you could make a strong argument that it’s income.  This is why you don’t want to discuss financial or sexual arrangements  in apps that leave a trail.  It’s discoverable in a legal proceeding.",
            "author": "BigSugar44",
            "id": "gnow8m6",
            "parent_id": "t1_gnoo5j2",
            "score": 3,
            "created_utc": 1613510450.0,
            "replies": [
                {
                    "body": "Yes I agree with this. The ex-husband is no doubt paying child support, and possibly alimony or other financial support too, so of course he is going to be angry if she has large amounts of undeclared earnings. I think that is obvious.",
                    "author": "Miercolesian",
                    "id": "gnoxxnl",
                    "parent_id": "t1_gnow8m6",
                    "score": 2,
                    "created_utc": 1613511185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes correct. Just needed to vent. Early Opsec showed he had a new GF and was living life. And yes the $ was the cherry on top since she has a fantastic job. The $ let her spoil herself and her kids.",
            "author": "zztop1999",
            "id": "gnntnd2",
            "parent_id": "t1_gnnt624",
            "score": 5,
            "created_utc": 1613493400.0,
            "replies": [
                {
                    "body": "Believe me, even though I have a GREAT SB right now there is one I still pine away for. Lost her to a committed relationship. Sucks but we move on.",
                    "author": null,
                    "id": "gnntyh0",
                    "parent_id": "t1_gnntnd2",
                    "score": 6,
                    "created_utc": 1613493535.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was ready to jump on a plane to SD mafia that guy who raped a young lady last week.  so yeah think could be a real thing.",
            "author": "Buckeyechamp21",
            "id": "gno1sl2",
            "parent_id": "t1_gnnx3ns",
            "score": 8,
            "created_utc": 1613496966.0,
            "replies": [
                {
                    "body": "\"The Avengers\"-catchy title. I wonder if anyone has thought of that one/s",
                    "author": "GSSD",
                    "id": "gno67qq",
                    "parent_id": "t1_gno1sl2",
                    "score": 2,
                    "created_utc": 1613498903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh there is no “ falling in love here”. I was just really enjoying the growth of the arrangement and her enthusiasm to share her passions in life as well as her excitement to be adventurous behind closed doors. She was raised ultra conservative to have missionary sex, serve her husband and have kids. 4 yrs of marriage and 2 kids. Plus being cheated on 3 times that she knew about but taking the blame for not being a better wife. It was just fun to open her eyes to what living can be like.",
            "author": "zztop1999",
            "id": "gnpypzn",
            "parent_id": "t1_gnpxo7k",
            "score": 3,
            "created_utc": 1613529457.0,
            "replies": [
                {
                    "body": "Ehhhh just move on then. So much drama",
                    "author": "ITSNEENAH",
                    "id": "gnpzzdx",
                    "parent_id": "t1_gnpypzn",
                    "score": 0,
                    "created_utc": 1613530122.0,
                    "replies": [
                        {
                            "body": "Basically have. She knows the door is open if she needs help but I know I can’t make her ask for it",
                            "author": "zztop1999",
                            "id": "gnq06si",
                            "parent_id": "t1_gnpzzdx",
                            "score": 2,
                            "created_utc": 1613530228.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously?? Seeking Arrangement",
            "author": "zztop1999",
            "id": "gnptnfr",
            "parent_id": "t1_gnp3me0",
            "score": 1,
            "created_utc": 1613526799.0,
            "replies": []
        },
        {
            "body": "No love here. Just crazy ex that is vindictive and he’ll bent on making her life unbearable. He had been MIA since the divorce with his new GF. I am pretty sure he saw her being happy. Enjoying life and picking up some new things from her allowance $ and he got jealous.",
            "author": "zztop1999",
            "id": "gnptzyh",
            "parent_id": "t1_gnoxtgj",
            "score": 1,
            "created_utc": 1613526981.0,
            "replies": []
        },
        {
            "body": "I'm not even sure where to begin correcting you here...",
            "author": "BlueJayJay82",
            "id": "gnqod8p",
            "parent_id": "t1_gnoxtgj",
            "score": 1,
            "created_utc": 1613544607.0,
            "replies": [
                {
                    "body": "Hi not even sure where to begin correcting you here, I'm Dad! :)",
                    "author": "dadbot_3000",
                    "id": "gnqodu7",
                    "parent_id": "t1_gnqod8p",
                    "score": 1,
                    "created_utc": 1613544619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A private forensic investigator could positively identify that she made the profile for under $1000.  For another $1000 to $1,500 and a Court order from a family law judge, they could get all your email correspondence, text correspondence etc, bank records, etc.  Sugaring when you just went through a contentious divorce or child custody battle isn’t very smart.",
            "author": "BigSugar44",
            "id": "gnox0gs",
            "parent_id": "t1_gno40mr",
            "score": 1,
            "created_utc": 1613510784.0,
            "replies": [
                {
                    "body": "Given the status of her previous relationship my guess is she was in a bind.  Sounds like the guy, ex dirtbag, isn't about the legality but just stirring up shit at least off hand it reads that way.",
                    "author": "KittenReigns",
                    "id": "gns4f5q",
                    "parent_id": "t1_gnox0gs",
                    "score": 1,
                    "created_utc": 1613580424.0,
                    "replies": [
                        {
                            "body": "Doesn’t change the overall analysis, which wasn’t necessarily meant for the OP because he has already crossed the Rubicon on that.",
                            "author": "BigSugar44",
                            "id": "gns8e9b",
                            "parent_id": "t1_gns4f5q",
                            "score": 1,
                            "created_utc": 1613582124.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. I can only assume she panicked. But very nice of you to blame her.",
            "author": "zztop1999",
            "id": "gns9w5o",
            "parent_id": "t1_gnq4zdt",
            "score": 1,
            "created_utc": 1613582762.0,
            "replies": [
                {
                    "body": "Blame? I don’t think I’m blaming her. He is the asshole, no doubt. None of this would have happened if he was a decent human being. On the other hand, she ust isn’t very smart. The sugar world is a world that many look down on and can have real consequences if discovered you are in (not just by wives, but work, friends and family). No one should be entering into this lifestyle without thinking about the consequences to them if exposed, and what they are going to do in advance if someone exposes them (what is the plan to mitigate the risk of exposure). Seems like she didn’t think of any of that. \n\nNow with you being the experienced SD, did you coach here through this thought process? And if not, do you think it is worth while to start doing that in the future?",
                    "author": "WCSD74",
                    "id": "gnuu9a9",
                    "parent_id": "t1_gns9w5o",
                    "score": 1,
                    "created_utc": 1613626556.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sure \"all is fair in love and war,\" but that there sounds like a violation of federal wiretapping laws, as well as the Computer Fraud and Abuse Act.\n\nNow, takes a bit of work usually to actually prove that in court, but if you can then he's going to have more important issues to deal with than if you're an SB or not...",
            "author": "quietgrey1",
            "id": "gnpakud",
            "parent_id": "t1_gnoi9ei",
            "score": 7,
            "created_utc": 1613517067.0,
            "replies": []
        },
        {
            "body": "This makes me feel so bad. See, my entire family, consisting of my mom and four younger siblings, already knows that I’m on SA. \n\nMy abusive, narcissistic ex tried to pull the same thing on me that this post is about a few months ago. He came out of the woodwork after seven years of no contact threatening to “out me,” citing quotes from my SA profile and saying things like, “maybe if you don’t do what I say, I’ll tell all your sugar daddies.”\n\nI was able to send him one text message telling him that he could tell anybody anything he wanted, because everyone important already knows and he had absolutely nothing that would hurt me. Then I blocked him and dealt with the feelings that his contacting me brought up, and moved on. I really wish that there was something I could do for SBs like the one in the story and for you.",
            "author": "FoxyFreckles1989",
            "id": "gnpbzlx",
            "parent_id": "t1_gnopawr",
            "score": 15,
            "created_utc": 1613517764.0,
            "replies": [
                {
                    "body": "Yeah I also have a narcissistic ex.\n\nI’m too afraid to actually even discuss any arrangement on a vanilla site . It feels like I’m being watched .\n\nI’ve stopped posting on most social media. Until I feel comfortable. Not to mention he went onto my Twitter , found a tweet I commented on about emotional abuse and commented on it stating “heart break doesn’t make you a an expert “.\n\nYou’re lucky/blessed your family is supportive. Mine would be ashamed and embarrassed. They would most likely call me a prostitute 😂.",
                    "author": "Momotheblack",
                    "id": "gnpeo0v",
                    "parent_id": "t1_gnpbzlx",
                    "score": 7,
                    "created_utc": 1613519100.0,
                    "replies": [
                        {
                            "body": "I’m definitely lucky. My mom didn’t used to be this open minded. I was raised Catholic and went to a Catholic school, and was initially taught (at school, not necessarily by mom) that birth control, premarital sex, abortion, masturbation and being gay were all sins. Then, I decided not to get confirmed and switch to public school and junior high. All four of my younger siblings followed suit. Several of us came out as gay, I had a child out of wedlock at 18, and, well, you get the point. \n\nMom was forced to either get with the times or lose her close relationships with all five of her children. She made the right choice. By the time I told her that I was sugaring for the first time, nearly 10 years ago, I had told her much more shocking and potentially disappointing news several times over. 😂\n\nI’m really sorry that you have to deal with that. Nobody deserves it. I got rid of almost all of my social media about a year ago, as well, for similar reasons. The only one I really have left is Twitter, which I rarely use and definitely doesn’t have anything personal on it.",
                            "author": "FoxyFreckles1989",
                            "id": "gnpg064",
                            "parent_id": "t1_gnpeo0v",
                            "score": 5,
                            "created_utc": 1613519765.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I wish there was a warning on the subreddit about this. Like “hey if your family saw you , would you be fine with it ?”\n\nI would fully support that kind of verbiage!!! And I would extend it to friends, colleagues, and future partners and employers as well!Newbie women (and men) but especially women, somehow think the site's public (and private) pictures and profile is insulated from the eyes of everyone in their lives, but it's often not true. Thoughts of adding something more explicit to the opsec info??  u/azurecole ?  \n\n\nAnd I'm really sorry you had to experience abuse in a previous relationship. Too many of us have been through trauma. :(",
            "author": "ExExpectations",
            "id": "gns1a17",
            "parent_id": "t1_gnopawr",
            "score": 1,
            "created_utc": 1613579099.0,
            "replies": [
                {
                    "body": "Lol the good news is I left! So don’t be sorry.\n\nBut the warning about hiding yourself should be put on the subreddit. Not just family but some of us are working towards careers where this sort of lifestyle is ostracized. \n\nI’d appreciate a warning lol.",
                    "author": "Momotheblack",
                    "id": "gnsvrj1",
                    "parent_id": "t1_gns1a17",
                    "score": 2,
                    "created_utc": 1613592204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "**And yet, here we are, all day long we see men on this forum say shit like this to women regarding their profile reviews “include a smiling picture” or “there’s no reason to have private pictures, it will only make you jaded from receiving all the picture request messages” 🙄🙄**\n\n**No. I don’t get jaded from receiving 200 picture requests. It takes 1 second to delete those messages and ignore those who don’t even read our profiles or send a personal note. But it takes a lifetime to repair privacy breeches and damages.**",
            "author": "ExExpectations",
            "id": "gnnwwa3",
            "parent_id": "t1_gnnv37z",
            "score": 65,
            "created_utc": 1613494822.0,
            "replies": [
                {
                    "body": "Yeh i dont agree abkut not having private photos",
                    "author": "wb19081908",
                    "id": "gnp5ony",
                    "parent_id": "t1_gnnwwa3",
                    "score": 2,
                    "created_utc": 1613514708.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I meant this for SDs who refuse to even talk or meet pot SBs when they refuse to share face pictures (I’m one of those SBs who don’t share face pictures ever, only meet in person). \n\nWe care about privacy - yours and ours. That should account for something. In your case, that rule would have saved your SR, (if she had that rule in place and you still asked to meet her).",
            "author": "ExExpectations",
            "id": "gnnwawb",
            "parent_id": "t1_gnnv37z",
            "score": 23,
            "created_utc": 1613494564.0,
            "replies": [
                {
                    "body": "Girl, you and me both. I've had rude POT SDs say, \"would you meet me without a face pic?\" And I say yes as I have and will continue to. The M&G is where it's at anyway. I am not interested in trying to repair my reputation. Too many assholes out there!\n\nOP, so sorry for you and more importantly, your SB. What a dick this ex is. I'm sure many of us can relate!",
                    "author": "BlueJayJay82",
                    "id": "gnoihpt",
                    "parent_id": "t1_gnnwawb",
                    "score": 15,
                    "created_utc": 1613504337.0,
                    "replies": [
                        {
                            "body": "Yep! Those who refuse video chat (where we are BOTH visible and can see each other) or to meet without seeing face pictures, I just tell them goodbye.   \np.s. Sent you a PM. Check your chat tab?",
                            "author": "ExExpectations",
                            "id": "gns1vkv",
                            "parent_id": "t1_gnoihpt",
                            "score": 1,
                            "created_utc": 1613579354.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Exactly. No face pics.  \n\nAlso, putting together an “SD mafia” is one of the best ideas I have heard so far on this sub. Almost every SB I have met has an ex SD who loses all sense once the SB has moved on to a new relationship and goes through a period of harassing their ex SB. Creates all this unnecessary drama. Wouldn’t an SD mafia be nice in this case to just confront the person and say “Dude, stop, you know better”.",
                    "author": "parttimeSD",
                    "id": "gno69eo",
                    "parent_id": "t1_gnnwawb",
                    "score": 20,
                    "created_utc": 1613498924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. Or even cropped-head pictures 😃🤪",
            "author": "ExExpectations",
            "id": "gnqas37",
            "parent_id": "t1_gnp1smq",
            "score": 1,
            "created_utc": 1613536086.0,
            "replies": []
        },
        {
            "body": "I’m not sure what kind of “been burned” by women’s pixelated pictures mean exactly. Is it as severe as what was mentioned in the post? Her family now knows about her secret life, and she may possibly have to deal with her children’s custody issues because of this information provided by the ex.\n\nWhatever “burnt” you’ve experienced, I’m sorry that happened. Maybe ask for a video call before committing to meeting. Or just a brief coffee at a time and day that’s convenient for both to meet in public. The little bit of inconvenience far outweighs risking whoever may come across women pictures on SA and have their lives wrecked because of it. \n\nAnd those who feels the same as you wouldn’t be someone I’d want to meet - if you can’t respect my comfort level and need for anonymity and privacy. 🤷🏻‍♀️",
            "author": "ExExpectations",
            "id": "gnpqtc5",
            "parent_id": "t1_gnpnrqm",
            "score": 8,
            "created_utc": 1613525329.0,
            "replies": [
                {
                    "body": ">I’m sorry that happened.\n\nHaha thanks, it's really not the end of the world.  It's more like, on a site designed for people (usually more so the men) to meet people they're attracted to, it's a little annoying to put in the time necessary to 1) establish that y'all get along; and 2) go to meet up only to discover you're not actually attracted to the person. \n\nVideo chatting is a solid workaround, though, and in the post-COVID-19 world a much more acceptable ask than in days gone by.",
                    "author": null,
                    "id": "gntzfz8",
                    "parent_id": "t1_gnpqtc5",
                    "score": 1,
                    "created_utc": 1613610233.0,
                    "replies": [
                        {
                            "body": "Really. Take a guess how we women feel when the salty dudes are using it as tinder, or bait and switch us. And pump and dump. All under the guise of being a “sd” 🙄 I feel zero sympathy for the “hassles” you face, but it’s in NO WAY comparable to her privacy and the damages that can bring to a woman’s life.",
                            "author": "ExExpectations",
                            "id": "gnu2bq9",
                            "parent_id": "t1_gntzfz8",
                            "score": 1,
                            "created_utc": 1613611674.0,
                            "replies": [
                                {
                                    "body": "Yes, there are annoying hurdles on both sides of the gender divide. \n\n>I feel zero sympathy for the “hassles” you face\n\nWell, perhaps you could try.  One person's grievances don't detract from those of others, even if the first person's are greater.  Wouldn't it be nice if no one ever had to deal with any annoying bullshit?",
                                    "author": null,
                                    "id": "gnu5uwx",
                                    "parent_id": "t1_gnu2bq9",
                                    "score": 1,
                                    "created_utc": 1613613404.0,
                                    "replies": [
                                        {
                                            "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
                                            "author": "ExExpectations",
                                            "id": "gnuc8bg",
                                            "parent_id": "t1_gnu5uwx",
                                            "score": 1,
                                            "created_utc": 1613616557.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm just curious, how exactly were you \"burned\" by not getting a clear pic of someone? Was the worst thing to happen that you met IRL and weren't attracted? Because that's all I would ever ask someone to do - and it could be for something as inexpensive as coffee, so really not much of a gamble.",
            "author": "BlueJayJay82",
            "id": "gnqnlaq",
            "parent_id": "t1_gnpnrqm",
            "score": 4,
            "created_utc": 1613544040.0,
            "replies": [
                {
                    "body": "RIGHT?! Ugh. The false equivalence of some people! I guess their occasional \"waste\" of 45-60min time is more important than the havoc that breeches and damages of privacy and reputation on some lowly poor women. After all, we are nothing but objects. 🙄",
                    "author": "ExExpectations",
                    "id": "gns07b0",
                    "parent_id": "t1_gnqnlaq",
                    "score": 2,
                    "created_utc": 1613578640.0,
                    "replies": []
                },
                {
                    "body": ">Was the worst thing to happen that you met IRL and weren't attracted?\n\nCorrect.  And it's not the end of the world, but that's a lot of time wasted in talking and setting things up only to arrive and be like oh, I'm not attracted to you at all.",
                    "author": null,
                    "id": "gntyxqk",
                    "parent_id": "t1_gnqnlaq",
                    "score": 0,
                    "created_utc": 1613609978.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "X happens so infrequently / rarely / occasionally so Y doesn’t need to be applied across the board.\n\nOkay; you do you. \n\nI stand by my convictions. And I will continue to tell SBs they SHOULD NOT show their face pictures publicly or privately on SA in order to be successful in the sugar world.\n\nAnd - I never said no pictures at all. I said NO FACE PICTURES.",
            "author": "ExExpectations",
            "id": "gnq54p4",
            "parent_id": "t1_gnq1al8",
            "score": 0,
            "created_utc": 1613532888.0,
            "replies": []
        },
        {
            "body": " I know enough about him, his gf and employer to cause plenty of problems for him.\n\nWell, do that then.",
            "author": "GSSD",
            "id": "gnnx6fv",
            "parent_id": "t1_gnnvd5h",
            "score": 15,
            "created_utc": 1613494944.0,
            "replies": [
                {
                    "body": "Two things I learned in the bowl:\n\n1. Never get involved in a land war in Asia (long story).\n\n2. Never get into the middle of someone else's marital problems.",
                    "author": null,
                    "id": "gno51nv",
                    "parent_id": "t1_gnnx6fv",
                    "score": 22,
                    "created_utc": 1613498390.0,
                    "replies": [
                        {
                            "body": "Did you have Vizzini as a sugar daddy earlier in your life?",
                            "author": "BinghamtonSD",
                            "id": "gnobow6",
                            "parent_id": "t1_gno51nv",
                            "score": 7,
                            "created_utc": 1613501286.0,
                            "replies": [
                                {
                                    "body": "> Vizzini \n\nIt's not.. inconceivable.",
                                    "author": null,
                                    "id": "gnodsq9",
                                    "parent_id": "t1_gnobow6",
                                    "score": 9,
                                    "created_utc": 1613502196.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wait...are you Sicilian?",
                            "author": "sdphilly",
                            "id": "gnoiobj",
                            "parent_id": "t1_gno51nv",
                            "score": 5,
                            "created_utc": 1613504419.0,
                            "replies": [
                                {
                                    "body": "I come from Australia, as everyone knows..",
                                    "author": null,
                                    "id": "gnokj0s",
                                    "parent_id": "t1_gnoiobj",
                                    "score": 3,
                                    "created_utc": 1613505248.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, this is probably against the rules, but I wouldn't be mad if you smashed his world up a bit... that's beyond messed up for her.",
            "author": "Lucy_in_the_sky_0",
            "id": "gnowotw",
            "parent_id": "t1_gnnvd5h",
            "score": 7,
            "created_utc": 1613510645.0,
            "replies": []
        },
        {
            "body": " At least you have the comfort of knowing other parts of her life are going well even though two of you have to end things (for now). Be proud of that and try not to let her ex’s actions impact you too much.",
            "author": "curly_spice",
            "id": "gnnwwtn",
            "parent_id": "t1_gnnuv5o",
            "score": 4,
            "created_utc": 1613494829.0,
            "replies": []
        },
        {
            "body": "> Mean just to be mean.\n\nA lot of that going on in the world today unfortunately.",
            "author": "GSSD",
            "id": "gnnxdx0",
            "parent_id": "t1_gnnuv5o",
            "score": 3,
            "created_utc": 1613495033.0,
            "replies": []
        },
        {
            "body": "The other post and their sentiments are correct. I think it's important to give her some space but tell her you're around if she needs you. I've run into similar situations and I have left just an email address for ex SB's if contact needs to be made. It's possible to be supportive from afar; it's tough but possible.",
            "author": "Notjustl00king",
            "id": "gnpsfff",
            "parent_id": "t1_gnnuv5o",
            "score": 1,
            "created_utc": 1613526167.0,
            "replies": []
        },
        {
            "body": "Oh agreed. Any way you slice it, poking that bear is not at all worth it. Good intentions or not - staying away from it is simply the best course of action.",
            "author": "SDRippington",
            "id": "gnpjt4o",
            "parent_id": "t1_gnoxxjn",
            "score": 2,
            "created_utc": 1613521707.0,
            "replies": []
        },
        {
            "body": "Oh puhleeze. Are you wanting me to rephrase my stuff as some \"gender neutral\" bullshit? Whatever. \n\nMen and women both can be over-emotional, batshit crazy people. \n\nI was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS, both of which I have had to deal with in SR's.",
            "author": "SDRippington",
            "id": "gnpsozl",
            "parent_id": "t1_gnpryuj",
            "score": 3,
            "created_utc": 1613526303.0,
            "replies": [
                {
                    "body": "> *I was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS*\n\nno, you were addressing the immediate question about ex HUSBANDS and it's you who brought up ex BOYFRIENDS which I read as white knighting, which you are now throwing a hissy fit about",
                    "author": "sucRoseToTheOccasion",
                    "id": "gnpxbip",
                    "parent_id": "t1_gnpsozl",
                    "score": -1,
                    "created_utc": 1613528725.0,
                    "replies": [
                        {
                            "body": "Read into it all ya want, I \"white knight\" on occasion and I absolutely make no excuses for it. Don't like it? Don't care :-)\n\nThing is, in my SR's I've seen more guys in my SB's lives \"lose their shit\" over things WAY more often than the women do. \n\nAnd no hissy fit. Just calling them the way I see em :-) You're the one trying to pull the _\"but...but... the women tho\"_, card ;)",
                            "author": "SDRippington",
                            "id": "gnpydhg",
                            "parent_id": "t1_gnpxbip",
                            "score": 2,
                            "created_utc": 1613529275.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes I agree with this. The ex-husband is no doubt paying child support, and possibly alimony or other financial support too, so of course he is going to be angry if she has large amounts of undeclared earnings. I think that is obvious.",
            "author": "Miercolesian",
            "id": "gnoxxnl",
            "parent_id": "t1_gnow8m6",
            "score": 2,
            "created_utc": 1613511185.0,
            "replies": []
        },
        {
            "body": "Believe me, even though I have a GREAT SB right now there is one I still pine away for. Lost her to a committed relationship. Sucks but we move on.",
            "author": null,
            "id": "gnntyh0",
            "parent_id": "t1_gnntnd2",
            "score": 6,
            "created_utc": 1613493535.0,
            "replies": []
        },
        {
            "body": "\"The Avengers\"-catchy title. I wonder if anyone has thought of that one/s",
            "author": "GSSD",
            "id": "gno67qq",
            "parent_id": "t1_gno1sl2",
            "score": 2,
            "created_utc": 1613498903.0,
            "replies": []
        },
        {
            "body": "Ehhhh just move on then. So much drama",
            "author": "ITSNEENAH",
            "id": "gnpzzdx",
            "parent_id": "t1_gnpypzn",
            "score": 0,
            "created_utc": 1613530122.0,
            "replies": [
                {
                    "body": "Basically have. She knows the door is open if she needs help but I know I can’t make her ask for it",
                    "author": "zztop1999",
                    "id": "gnq06si",
                    "parent_id": "t1_gnpzzdx",
                    "score": 2,
                    "created_utc": 1613530228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi not even sure where to begin correcting you here, I'm Dad! :)",
            "author": "dadbot_3000",
            "id": "gnqodu7",
            "parent_id": "t1_gnqod8p",
            "score": 1,
            "created_utc": 1613544619.0,
            "replies": []
        },
        {
            "body": "Given the status of her previous relationship my guess is she was in a bind.  Sounds like the guy, ex dirtbag, isn't about the legality but just stirring up shit at least off hand it reads that way.",
            "author": "KittenReigns",
            "id": "gns4f5q",
            "parent_id": "t1_gnox0gs",
            "score": 1,
            "created_utc": 1613580424.0,
            "replies": [
                {
                    "body": "Doesn’t change the overall analysis, which wasn’t necessarily meant for the OP because he has already crossed the Rubicon on that.",
                    "author": "BigSugar44",
                    "id": "gns8e9b",
                    "parent_id": "t1_gns4f5q",
                    "score": 1,
                    "created_utc": 1613582124.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Blame? I don’t think I’m blaming her. He is the asshole, no doubt. None of this would have happened if he was a decent human being. On the other hand, she ust isn’t very smart. The sugar world is a world that many look down on and can have real consequences if discovered you are in (not just by wives, but work, friends and family). No one should be entering into this lifestyle without thinking about the consequences to them if exposed, and what they are going to do in advance if someone exposes them (what is the plan to mitigate the risk of exposure). Seems like she didn’t think of any of that. \n\nNow with you being the experienced SD, did you coach here through this thought process? And if not, do you think it is worth while to start doing that in the future?",
            "author": "WCSD74",
            "id": "gnuu9a9",
            "parent_id": "t1_gns9w5o",
            "score": 1,
            "created_utc": 1613626556.0,
            "replies": []
        },
        {
            "body": "Yeah I also have a narcissistic ex.\n\nI’m too afraid to actually even discuss any arrangement on a vanilla site . It feels like I’m being watched .\n\nI’ve stopped posting on most social media. Until I feel comfortable. Not to mention he went onto my Twitter , found a tweet I commented on about emotional abuse and commented on it stating “heart break doesn’t make you a an expert “.\n\nYou’re lucky/blessed your family is supportive. Mine would be ashamed and embarrassed. They would most likely call me a prostitute 😂.",
            "author": "Momotheblack",
            "id": "gnpeo0v",
            "parent_id": "t1_gnpbzlx",
            "score": 7,
            "created_utc": 1613519100.0,
            "replies": [
                {
                    "body": "I’m definitely lucky. My mom didn’t used to be this open minded. I was raised Catholic and went to a Catholic school, and was initially taught (at school, not necessarily by mom) that birth control, premarital sex, abortion, masturbation and being gay were all sins. Then, I decided not to get confirmed and switch to public school and junior high. All four of my younger siblings followed suit. Several of us came out as gay, I had a child out of wedlock at 18, and, well, you get the point. \n\nMom was forced to either get with the times or lose her close relationships with all five of her children. She made the right choice. By the time I told her that I was sugaring for the first time, nearly 10 years ago, I had told her much more shocking and potentially disappointing news several times over. 😂\n\nI’m really sorry that you have to deal with that. Nobody deserves it. I got rid of almost all of my social media about a year ago, as well, for similar reasons. The only one I really have left is Twitter, which I rarely use and definitely doesn’t have anything personal on it.",
                    "author": "FoxyFreckles1989",
                    "id": "gnpg064",
                    "parent_id": "t1_gnpeo0v",
                    "score": 5,
                    "created_utc": 1613519765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol the good news is I left! So don’t be sorry.\n\nBut the warning about hiding yourself should be put on the subreddit. Not just family but some of us are working towards careers where this sort of lifestyle is ostracized. \n\nI’d appreciate a warning lol.",
            "author": "Momotheblack",
            "id": "gnsvrj1",
            "parent_id": "t1_gns1a17",
            "score": 2,
            "created_utc": 1613592204.0,
            "replies": []
        },
        {
            "body": "Yeh i dont agree abkut not having private photos",
            "author": "wb19081908",
            "id": "gnp5ony",
            "parent_id": "t1_gnnwwa3",
            "score": 2,
            "created_utc": 1613514708.0,
            "replies": []
        },
        {
            "body": "Girl, you and me both. I've had rude POT SDs say, \"would you meet me without a face pic?\" And I say yes as I have and will continue to. The M&G is where it's at anyway. I am not interested in trying to repair my reputation. Too many assholes out there!\n\nOP, so sorry for you and more importantly, your SB. What a dick this ex is. I'm sure many of us can relate!",
            "author": "BlueJayJay82",
            "id": "gnoihpt",
            "parent_id": "t1_gnnwawb",
            "score": 15,
            "created_utc": 1613504337.0,
            "replies": [
                {
                    "body": "Yep! Those who refuse video chat (where we are BOTH visible and can see each other) or to meet without seeing face pictures, I just tell them goodbye.   \np.s. Sent you a PM. Check your chat tab?",
                    "author": "ExExpectations",
                    "id": "gns1vkv",
                    "parent_id": "t1_gnoihpt",
                    "score": 1,
                    "created_utc": 1613579354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. No face pics.  \n\nAlso, putting together an “SD mafia” is one of the best ideas I have heard so far on this sub. Almost every SB I have met has an ex SD who loses all sense once the SB has moved on to a new relationship and goes through a period of harassing their ex SB. Creates all this unnecessary drama. Wouldn’t an SD mafia be nice in this case to just confront the person and say “Dude, stop, you know better”.",
            "author": "parttimeSD",
            "id": "gno69eo",
            "parent_id": "t1_gnnwawb",
            "score": 20,
            "created_utc": 1613498924.0,
            "replies": []
        },
        {
            "body": ">I’m sorry that happened.\n\nHaha thanks, it's really not the end of the world.  It's more like, on a site designed for people (usually more so the men) to meet people they're attracted to, it's a little annoying to put in the time necessary to 1) establish that y'all get along; and 2) go to meet up only to discover you're not actually attracted to the person. \n\nVideo chatting is a solid workaround, though, and in the post-COVID-19 world a much more acceptable ask than in days gone by.",
            "author": null,
            "id": "gntzfz8",
            "parent_id": "t1_gnpqtc5",
            "score": 1,
            "created_utc": 1613610233.0,
            "replies": [
                {
                    "body": "Really. Take a guess how we women feel when the salty dudes are using it as tinder, or bait and switch us. And pump and dump. All under the guise of being a “sd” 🙄 I feel zero sympathy for the “hassles” you face, but it’s in NO WAY comparable to her privacy and the damages that can bring to a woman’s life.",
                    "author": "ExExpectations",
                    "id": "gnu2bq9",
                    "parent_id": "t1_gntzfz8",
                    "score": 1,
                    "created_utc": 1613611674.0,
                    "replies": [
                        {
                            "body": "Yes, there are annoying hurdles on both sides of the gender divide. \n\n>I feel zero sympathy for the “hassles” you face\n\nWell, perhaps you could try.  One person's grievances don't detract from those of others, even if the first person's are greater.  Wouldn't it be nice if no one ever had to deal with any annoying bullshit?",
                            "author": null,
                            "id": "gnu5uwx",
                            "parent_id": "t1_gnu2bq9",
                            "score": 1,
                            "created_utc": 1613613404.0,
                            "replies": [
                                {
                                    "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
                                    "author": "ExExpectations",
                                    "id": "gnuc8bg",
                                    "parent_id": "t1_gnu5uwx",
                                    "score": 1,
                                    "created_utc": 1613616557.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "RIGHT?! Ugh. The false equivalence of some people! I guess their occasional \"waste\" of 45-60min time is more important than the havoc that breeches and damages of privacy and reputation on some lowly poor women. After all, we are nothing but objects. 🙄",
            "author": "ExExpectations",
            "id": "gns07b0",
            "parent_id": "t1_gnqnlaq",
            "score": 2,
            "created_utc": 1613578640.0,
            "replies": []
        },
        {
            "body": ">Was the worst thing to happen that you met IRL and weren't attracted?\n\nCorrect.  And it's not the end of the world, but that's a lot of time wasted in talking and setting things up only to arrive and be like oh, I'm not attracted to you at all.",
            "author": null,
            "id": "gntyxqk",
            "parent_id": "t1_gnqnlaq",
            "score": 0,
            "created_utc": 1613609978.0,
            "replies": []
        },
        {
            "body": "Two things I learned in the bowl:\n\n1. Never get involved in a land war in Asia (long story).\n\n2. Never get into the middle of someone else's marital problems.",
            "author": null,
            "id": "gno51nv",
            "parent_id": "t1_gnnx6fv",
            "score": 22,
            "created_utc": 1613498390.0,
            "replies": [
                {
                    "body": "Did you have Vizzini as a sugar daddy earlier in your life?",
                    "author": "BinghamtonSD",
                    "id": "gnobow6",
                    "parent_id": "t1_gno51nv",
                    "score": 7,
                    "created_utc": 1613501286.0,
                    "replies": [
                        {
                            "body": "> Vizzini \n\nIt's not.. inconceivable.",
                            "author": null,
                            "id": "gnodsq9",
                            "parent_id": "t1_gnobow6",
                            "score": 9,
                            "created_utc": 1613502196.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wait...are you Sicilian?",
                    "author": "sdphilly",
                    "id": "gnoiobj",
                    "parent_id": "t1_gno51nv",
                    "score": 5,
                    "created_utc": 1613504419.0,
                    "replies": [
                        {
                            "body": "I come from Australia, as everyone knows..",
                            "author": null,
                            "id": "gnokj0s",
                            "parent_id": "t1_gnoiobj",
                            "score": 3,
                            "created_utc": 1613505248.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> *I was addressing the immediate question about ex HUSBANDS, and ex BOYFRIENDS*\n\nno, you were addressing the immediate question about ex HUSBANDS and it's you who brought up ex BOYFRIENDS which I read as white knighting, which you are now throwing a hissy fit about",
            "author": "sucRoseToTheOccasion",
            "id": "gnpxbip",
            "parent_id": "t1_gnpsozl",
            "score": -1,
            "created_utc": 1613528725.0,
            "replies": [
                {
                    "body": "Read into it all ya want, I \"white knight\" on occasion and I absolutely make no excuses for it. Don't like it? Don't care :-)\n\nThing is, in my SR's I've seen more guys in my SB's lives \"lose their shit\" over things WAY more often than the women do. \n\nAnd no hissy fit. Just calling them the way I see em :-) You're the one trying to pull the _\"but...but... the women tho\"_, card ;)",
                    "author": "SDRippington",
                    "id": "gnpydhg",
                    "parent_id": "t1_gnpxbip",
                    "score": 2,
                    "created_utc": 1613529275.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Basically have. She knows the door is open if she needs help but I know I can’t make her ask for it",
            "author": "zztop1999",
            "id": "gnq06si",
            "parent_id": "t1_gnpzzdx",
            "score": 2,
            "created_utc": 1613530228.0,
            "replies": []
        },
        {
            "body": "Doesn’t change the overall analysis, which wasn’t necessarily meant for the OP because he has already crossed the Rubicon on that.",
            "author": "BigSugar44",
            "id": "gns8e9b",
            "parent_id": "t1_gns4f5q",
            "score": 1,
            "created_utc": 1613582124.0,
            "replies": []
        },
        {
            "body": "I’m definitely lucky. My mom didn’t used to be this open minded. I was raised Catholic and went to a Catholic school, and was initially taught (at school, not necessarily by mom) that birth control, premarital sex, abortion, masturbation and being gay were all sins. Then, I decided not to get confirmed and switch to public school and junior high. All four of my younger siblings followed suit. Several of us came out as gay, I had a child out of wedlock at 18, and, well, you get the point. \n\nMom was forced to either get with the times or lose her close relationships with all five of her children. She made the right choice. By the time I told her that I was sugaring for the first time, nearly 10 years ago, I had told her much more shocking and potentially disappointing news several times over. 😂\n\nI’m really sorry that you have to deal with that. Nobody deserves it. I got rid of almost all of my social media about a year ago, as well, for similar reasons. The only one I really have left is Twitter, which I rarely use and definitely doesn’t have anything personal on it.",
            "author": "FoxyFreckles1989",
            "id": "gnpg064",
            "parent_id": "t1_gnpeo0v",
            "score": 5,
            "created_utc": 1613519765.0,
            "replies": []
        },
        {
            "body": "Yep! Those who refuse video chat (where we are BOTH visible and can see each other) or to meet without seeing face pictures, I just tell them goodbye.   \np.s. Sent you a PM. Check your chat tab?",
            "author": "ExExpectations",
            "id": "gns1vkv",
            "parent_id": "t1_gnoihpt",
            "score": 1,
            "created_utc": 1613579354.0,
            "replies": []
        },
        {
            "body": "Really. Take a guess how we women feel when the salty dudes are using it as tinder, or bait and switch us. And pump and dump. All under the guise of being a “sd” 🙄 I feel zero sympathy for the “hassles” you face, but it’s in NO WAY comparable to her privacy and the damages that can bring to a woman’s life.",
            "author": "ExExpectations",
            "id": "gnu2bq9",
            "parent_id": "t1_gntzfz8",
            "score": 1,
            "created_utc": 1613611674.0,
            "replies": [
                {
                    "body": "Yes, there are annoying hurdles on both sides of the gender divide. \n\n>I feel zero sympathy for the “hassles” you face\n\nWell, perhaps you could try.  One person's grievances don't detract from those of others, even if the first person's are greater.  Wouldn't it be nice if no one ever had to deal with any annoying bullshit?",
                    "author": null,
                    "id": "gnu5uwx",
                    "parent_id": "t1_gnu2bq9",
                    "score": 1,
                    "created_utc": 1613613404.0,
                    "replies": [
                        {
                            "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
                            "author": "ExExpectations",
                            "id": "gnuc8bg",
                            "parent_id": "t1_gnu5uwx",
                            "score": 1,
                            "created_utc": 1613616557.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you have Vizzini as a sugar daddy earlier in your life?",
            "author": "BinghamtonSD",
            "id": "gnobow6",
            "parent_id": "t1_gno51nv",
            "score": 7,
            "created_utc": 1613501286.0,
            "replies": [
                {
                    "body": "> Vizzini \n\nIt's not.. inconceivable.",
                    "author": null,
                    "id": "gnodsq9",
                    "parent_id": "t1_gnobow6",
                    "score": 9,
                    "created_utc": 1613502196.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wait...are you Sicilian?",
            "author": "sdphilly",
            "id": "gnoiobj",
            "parent_id": "t1_gno51nv",
            "score": 5,
            "created_utc": 1613504419.0,
            "replies": [
                {
                    "body": "I come from Australia, as everyone knows..",
                    "author": null,
                    "id": "gnokj0s",
                    "parent_id": "t1_gnoiobj",
                    "score": 3,
                    "created_utc": 1613505248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Read into it all ya want, I \"white knight\" on occasion and I absolutely make no excuses for it. Don't like it? Don't care :-)\n\nThing is, in my SR's I've seen more guys in my SB's lives \"lose their shit\" over things WAY more often than the women do. \n\nAnd no hissy fit. Just calling them the way I see em :-) You're the one trying to pull the _\"but...but... the women tho\"_, card ;)",
            "author": "SDRippington",
            "id": "gnpydhg",
            "parent_id": "t1_gnpxbip",
            "score": 2,
            "created_utc": 1613529275.0,
            "replies": []
        },
        {
            "body": "Yes, there are annoying hurdles on both sides of the gender divide. \n\n>I feel zero sympathy for the “hassles” you face\n\nWell, perhaps you could try.  One person's grievances don't detract from those of others, even if the first person's are greater.  Wouldn't it be nice if no one ever had to deal with any annoying bullshit?",
            "author": null,
            "id": "gnu5uwx",
            "parent_id": "t1_gnu2bq9",
            "score": 1,
            "created_utc": 1613613404.0,
            "replies": [
                {
                    "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
                    "author": "ExExpectations",
                    "id": "gnuc8bg",
                    "parent_id": "t1_gnu5uwx",
                    "score": 1,
                    "created_utc": 1613616557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Vizzini \n\nIt's not.. inconceivable.",
            "author": null,
            "id": "gnodsq9",
            "parent_id": "t1_gnobow6",
            "score": 9,
            "created_utc": 1613502196.0,
            "replies": []
        },
        {
            "body": "I come from Australia, as everyone knows..",
            "author": null,
            "id": "gnokj0s",
            "parent_id": "t1_gnoiobj",
            "score": 3,
            "created_utc": 1613505248.0,
            "replies": []
        },
        {
            "body": "My compromise is video chat - where we BOTH see the other person. No discussions of sugar anything on video - just a few minutes of casual chat. That’s really fair.",
            "author": "ExExpectations",
            "id": "gnuc8bg",
            "parent_id": "t1_gnu5uwx",
            "score": 1,
            "created_utc": 1613616557.0,
            "replies": []
        }
    ]
}