{
    "title": "Runningman is Korea’s only game variety show",
    "post_id": "ucx66r",
    "post_url": "https://www.reddit.com/r/runningman/comments/ucx66r/runningman_is_koreas_only_game_variety_show/",
    "author": "ElectronBluePearl",
    "body": "I like to thank Haha for voicing something in episode 600 that has been bothering me for awhile.  The trend in this subreddit and other fan boards is to want to turn Runningman into a ‘wholesome’ variety show.  Where they get to talk, hang out and banter, which allows the viewers to get to know and connect with the members.  This also seems to be JSJ’s vision as he wants the members to work on ‘challenges’ like starting a business, with no more spies or missions.  There was a lot of support for part 1 of JSJ retirement episode and for the talk portion of Episode 600 in this subreddit.\n\nHowever, I like to voice support for the other side and that I love the competitive part of Runningman.  I was totally on board with KJK, Haha and Sechan in JSJ’s retirement episode where they felt it’s boring for them to film an episode of them just hanging out.  For me, I want to see them put their wits against each other and see who comes up on top.  I want to see them figure out loop holes and out smart the production team, to win against difficult odds, in difficult environments, to see them throw their bodies into mud flats in order to seize the victory.  Thank you YJS for repeating again - that they can play physical games.  Yes, they may have hurt themselves in the past but now they know how to take care of their bodies better.  JSM broke her foot walking around her house but that doesn’t mean she’s now too old to walk around.\n\nBopil PD if you are reading this, there is a lot of fan support for JSJ’s vision of Runningman.  That may be true for some, but I want to let you know there are also those who yearn for the old competitive runningman.  It’s no longer classified as an ‘urban action variety show’, but it doesn’t have to further devolve into one of the many ‘observation variety show’ as YJS puts it in Episode 598.  Let’s get to episode 1000 and let’s do it in such a way that the episodes are memorable, and epic.",
    "url": "https://www.reddit.com/r/runningman/comments/ucx66r/runningman_is_koreas_only_game_variety_show/",
    "score": 232,
    "upvote_ratio": 0.97,
    "created_utc": 1651041180.0,
    "num_comments": 27,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Agreed. Just because they're getting old, doesn't mean they can't play games anymore. Like your title says Running Man is a 'game variety show'. That doesn't only include games where they have to get physical. I love it when they play psychological games and I'm not talking about quizzes. They can still move around the city in their cars doing missions and stuffs without running tho (when the pandemic is over pls stay safe). They don't have to play mud games or tug of war or name tag elimination for it to be fun. Give them individual or team missions where they uncover some secret or decipher a code or where they have to backstab each other. That's what I loved about the show more than the physicality.",
            "author": "FckDeezShitImOut",
            "id": "i6dfn75",
            "parent_id": "t3_ucx66r",
            "score": 75,
            "created_utc": 1651043341.0,
            "replies": [
                {
                    "body": "Same here, there's so many options that don't include heavy physical activity that aren't just mini games at a restaurant or with a sport. Doing unique things like cooking challenges, code decoding, betrayals, and moving through unique locations across Korea are what made the show what it was and I want to see RM get back to that (Also, I doubt COVID would be much of an issue if they plan locations, as Sixth Sense moves around a lot as well).",
                    "author": "l33d0ngw00k",
                    "id": "i6e2141",
                    "parent_id": "t1_i6dfn75",
                    "score": 19,
                    "created_utc": 1651060924.0,
                    "replies": []
                },
                {
                    "body": "My FAVORITE games are the ones where they have to try not to laugh. That is something they can do with very little physical exertion.",
                    "author": "PenBeautiful",
                    "id": "i6fks7c",
                    "parent_id": "t1_i6dfn75",
                    "score": 10,
                    "created_utc": 1651083870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think Running Man needs both kind of concept to work. If they only stick to one concept, like doing a talk show for every episode, it'll become stale. Same as doing competitive games every episode, although this one is usually harder to get bored of. I think fans say they want the 'wholesome' episode because the bond the members has now looks stronger than ever, especially since they have gone through a lot together.\n\nso to summarise, yeah Running Man should do exciting missions. However, they should also do something like part 1 of JSJ retirement ep once in a while.",
            "author": "Everythingnothing9",
            "id": "i6dnp83",
            "parent_id": "t3_ucx66r",
            "score": 44,
            "created_utc": 1651050412.0,
            "replies": [
                {
                    "body": "I agree. Bopil PD does really great in bringing out/ allowing the natural chemistry of the cast to shine through, which is why I think the 'wholesome' episodes work. In my opinion, Chulmin PD had a more structured approach, which made the cast sort of have to stick to their characters more, while Bopil PD's more loose approach is allowing them to somewhat show more of their true selves and have more real (not character driven) interactions. But I do think Bopil PD's team needs to work more on the games side, especially on making the themes and games more coherent. Though another problem seems to be that it's hard for the members to play competitively as they've already played so many games in the past that winning or losing probably doesn't really matter.",
                    "author": "Infinite-Check4574",
                    "id": "i6ejkr6",
                    "parent_id": "t1_i6dnp83",
                    "score": 12,
                    "created_utc": 1651069239.0,
                    "replies": [
                        {
                            "body": "I really wish they'd bring back coherent themed episodes where all the missions and games actually tie into each other. These days they might get dressed up for the intro and then just start playing random games that have nothing to do with the original theme. Or bring guests on the show and do a poor job highlighting them. It's all very disoriented.",
                            "author": "merchseller",
                            "id": "i6f75y9",
                            "parent_id": "t1_i6ejkr6",
                            "score": 12,
                            "created_utc": 1651078472.0,
                            "replies": [
                                {
                                    "body": "It seems like they're focused on trying to be innovative with games rather than finding games that fit the theme. But based on how much they cut/ edit out, it appears that they haven't been as successful in trying to figure out what games actually work in terms of entertainment value.\n\nI completely agree with what you said about bringing in guests. It probably has to do with wanting to highlight cast chemistry more.",
                                    "author": "Infinite-Check4574",
                                    "id": "i6fgtys",
                                    "parent_id": "t1_i6f75y9",
                                    "score": 7,
                                    "created_utc": 1651082276.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As someone who much preferred Running Man when they were doing actual running (and jumping and grappling and chasing and whatnot), I wholeheartedly agree.  Now obviously RM can’t be as physical as it used to be, but it can and should still be competitive.  There’s plenty of “hanging out” variety shows.\nAnd I don’t have fond memories of the final events in episodes 29-31 where they all had to work together to complete a task so everyone won or everyone lost at the end.  I loved how they split up into teams in every episode and how the splitting would seem deliberate or arbitrary at times, but often worked to give us beloved team-ups or interesting new combinations, and so last week’s opponent could easily be this week’s teammate and vice versa.",
            "author": "bluebirdgm",
            "id": "i6df3m4",
            "parent_id": "t3_ucx66r",
            "score": 34,
            "created_utc": 1651042905.0,
            "replies": []
        },
        {
            "body": "Running Man wouldn't be the same without its games. I love the competitiveness too, but I wish they'd take out games that don't give the cast a chance to creatively play with the rules. \n\nThis goes for pretty much all the ball games, I just skip over them because it's not like they're pros and there's only so much to the game itself. But I did like the ones where they invited pro volleyball team members or the staff to participate. I thought that was hilarious.\n\nMy favorite type of games are members v. staff or the members actively try to make each other lose. I laugh so hard on those.",
            "author": "StaringOverACliff",
            "id": "i6f6kl9",
            "parent_id": "t3_ucx66r",
            "score": 8,
            "created_utc": 1651078242.0,
            "replies": []
        },
        {
            "body": "I think a good mixture would be great, coz having competitions and being on edge (yup I be on edge during chase time) all the time gets boring after a while. Also, too harsh on their bodies 😕",
            "author": null,
            "id": "i6dynnx",
            "parent_id": "t3_ucx66r",
            "score": 3,
            "created_utc": 1651058922.0,
            "replies": []
        },
        {
            "body": "Mhh. Hard topic, I don't really care for name tag elimination for example unless there's a twist like water pistols.\n\nAnd most physical games end with KJK winning.\n\nThat being said I very much enjoy games of skill or hide and seek etc.\n\nThe talking in a circle can be fun, but it should be by no means the focus.\n\nAlso, some of the recent circle games have been very bad.\n\nEdit: Grammar",
            "author": "Verethragna97",
            "id": "i6fx338",
            "parent_id": "t3_ucx66r",
            "score": 5,
            "created_utc": 1651088757.0,
            "replies": []
        },
        {
            "body": "Agreed. I feel like the show runners really picked up the fact that the sitting-and-talking version gets a lot of positive comments these days, but for me personally, the excitement feels lacking. I think even the laughter is easier to bring about with more action. I miss the scheming, betraying, and whining over difficult circumstances vibe. I know there's a lot of praise for the early RM version of action, but I also think Chul Min PD also succeeded in throwing them in situations that really brought out the competitiveness as well as the laughter. Talking Man is fun for maybe two episodes a year (for example I totally understand why it suited ep 600 - that was a milestone to sit and talk about), but doing a variation of that everyday is questionable. They could at least combine both approaches.",
            "author": "thunder_sun",
            "id": "i6eyndw",
            "parent_id": "t3_ucx66r",
            "score": 5,
            "created_utc": 1651075193.0,
            "replies": []
        },
        {
            "body": "Given how boring baking cookies was, you would think people should consider jsj ideas with a grain of salt.",
            "author": "Fudouri",
            "id": "i6ez274",
            "parent_id": "t3_ucx66r",
            "score": 6,
            "created_utc": 1651075350.0,
            "replies": [
                {
                    "body": "Lol yup. The way JSJ brought up his ideas at the production meeting made it sound like he was some throwing out groundbreaking ideas. \"Hey, we don't need to play games, why don't we just talk?\" As if RM hadn't already done tons of those concepts already. There's a reason why hi",
                    "author": "merchseller",
                    "id": "i6f6q9s",
                    "parent_id": "t1_i6ez274",
                    "score": 1,
                    "created_utc": 1651078303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally agree. People here love commenting how they like those random talk episodes but these recent episodes where they sat around the house cooking/eating and this latest talk show one are some of the most boring episodes in history. If this trend continues the show is 100% getting canceled. Really glad JSJ's production captain role is coming to an end, the guy should really not be directing shows.",
            "author": "merchseller",
            "id": "i6f7ikg",
            "parent_id": "t3_ucx66r",
            "score": 6,
            "created_utc": 1651078608.0,
            "replies": [
                {
                    "body": "The problem is these types of episodes tend to get great ratings in Korea. That's why there is already such a large assortment of talking variety shows on air. They're popular with the GP. Running Man nearly got canceled many times in the past because the original style didn't appeal domestically while it was wildly appealing with international audiences, and international audiences weren't bringing in the money back then. \n\nPersonally, I fully agree with you that the recent episodes have been some of the most boring in the history of the show, but as long as they get good domestic ratings and feedback, this is likely the style of show we'll keep seeing.  I just watch old episodes as a way to cope these days, and while it's not the whole cast, Outrun has had some Classic Running Man moments so I've been veering more towards it and another show to get my weekly laughs.",
                    "author": "ACEwriter12",
                    "id": "i6h4cbo",
                    "parent_id": "t1_i6f7ikg",
                    "score": 3,
                    "created_utc": 1651107447.0,
                    "replies": []
                },
                {
                    "body": "I think he just used his captain role as an excuse to get the running men a paid vacation lol",
                    "author": "sadwattpadwriter",
                    "id": "i6h13gs",
                    "parent_id": "t1_i6f7ikg",
                    "score": 2,
                    "created_utc": 1651105969.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They rly deserve respect ALL + All ex members",
            "author": "h4t3",
            "id": "i6dfuys",
            "parent_id": "t3_ucx66r",
            "score": 3,
            "created_utc": 1651043518.0,
            "replies": []
        },
        {
            "body": "Agreed its why I watch running man as opposed to the boring talk shows. I enjoy games and doing unexpected things it's fun to watch them compete and figure out problems because they all do it differently which is interesting to see. I personally think they've gone to far in talk direction since Bo pil became PD and think it might be time for a change there, but that might be a controversial opinion here.  Then again I'm a big fan of anything Na Pd ( journey to west, youth over flowers etc) does so might be assuming the PD has a more direct effect than it does.  Would love for a turn back to what running man was hoping baser on preview for next episode that there is still a way to get there.",
            "author": "xMorwainx",
            "id": "i6gkuxt",
            "parent_id": "t3_ucx66r",
            "score": 3,
            "created_utc": 1651098423.0,
            "replies": []
        },
        {
            "body": "Or, hear me out here, this might sound crazy...\n\nDo both.\n\nWhy are you all acting like this is some binary choice?",
            "author": "Hawkwing369",
            "id": "i6e9enp",
            "parent_id": "t3_ucx66r",
            "score": 6,
            "created_utc": 1651064759.0,
            "replies": []
        },
        {
            "body": "I have yet to see people say they want RM to turn into a talk show. However they have said they wouldn't mind seeing it every now and then not every episode being like that. That's a huge difference in what you're saying",
            "author": "cbizzle14",
            "id": "i6dk4h4",
            "parent_id": "t3_ucx66r",
            "score": 7,
            "created_utc": 1651047168.0,
            "replies": [
                {
                    "body": "this. i was confused reading what op said bc i'm on this sub often and literally never seen anyone say they want runningman to be a talk show.",
                    "author": "bobhwans",
                    "id": "i6gf2gp",
                    "parent_id": "t1_i6dk4h4",
                    "score": 3,
                    "created_utc": 1651095910.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For me, combination of both would be fine. What I actually would love to see is for them to invite more guests.   \n\n\nOne of the reason I've liked RM is because they basically opened Korean entertainment industry for me.",
            "author": "mouseinatrap",
            "id": "i6em3yv",
            "parent_id": "t3_ucx66r",
            "score": 3,
            "created_utc": 1651070274.0,
            "replies": []
        },
        {
            "body": "I think whatever they do is fun - whether it's games or just banter.",
            "author": "no_names_open",
            "id": "i6dq7wf",
            "parent_id": "t3_ucx66r",
            "score": 3,
            "created_utc": 1651052660.0,
            "replies": []
        },
        {
            "body": "Thing about variety shows is that can do all of the above. If Running Man turned into Talking Man, the show would die.  \n  \nEverything that we enjoy on the show comes in spurts.",
            "author": "SpoonAtAGunFight",
            "id": "i6e1jd4",
            "parent_id": "t3_ucx66r",
            "score": 2,
            "created_utc": 1651060641.0,
            "replies": []
        },
        {
            "body": "Running man, walking man, then talking man; my preference in that order.",
            "author": "behappy1002",
            "id": "i6e6ibl",
            "parent_id": "t3_ucx66r",
            "score": 2,
            "created_utc": 1651063345.0,
            "replies": []
        },
        {
            "body": "IMO I think they are too far in now to just turn it into a talk show because what can they talk about that we don't already know?... many of the stories they tell we've heard many times now and yes it's fun but not as funny anymore. (an example is KJK talking about YJS payment before he was popular, which we've heard about ten times already. lol).   \nIf they went the talking route we would likely see them repeating the same thing every 2-4 months which would get boring fast. \n\nWhereas I would like to see more nametag (next episode looks like it has one) and physical challenges it is understandable why they can't do them every week but no reason why they can't do spy, mafia, 'race/first to finish' challenges (like some older episodes and the one they did in OutRun where they had to get food) etc, etc (they have tons of games they could revisit).\n\nThe way I saw the last few episodes was it seems more like JSJ wants to be on a less demanding show, and even his letter at the end was sombre but it felt it was more him talking rather than the views of the rest of the members. (maybe JSJ is thinking of leaving which would be a shame but if he can't do it anymore and/or he wants more free time then all good and can respect his decision either way)",
            "author": "zauchi",
            "id": "i6dij9h",
            "parent_id": "t3_ucx66r",
            "score": 2,
            "created_utc": 1651045759.0,
            "replies": []
        },
        {
            "body": "Same here, there's so many options that don't include heavy physical activity that aren't just mini games at a restaurant or with a sport. Doing unique things like cooking challenges, code decoding, betrayals, and moving through unique locations across Korea are what made the show what it was and I want to see RM get back to that (Also, I doubt COVID would be much of an issue if they plan locations, as Sixth Sense moves around a lot as well).",
            "author": "l33d0ngw00k",
            "id": "i6e2141",
            "parent_id": "t1_i6dfn75",
            "score": 19,
            "created_utc": 1651060924.0,
            "replies": []
        },
        {
            "body": "My FAVORITE games are the ones where they have to try not to laugh. That is something they can do with very little physical exertion.",
            "author": "PenBeautiful",
            "id": "i6fks7c",
            "parent_id": "t1_i6dfn75",
            "score": 10,
            "created_utc": 1651083870.0,
            "replies": []
        },
        {
            "body": "I agree. Bopil PD does really great in bringing out/ allowing the natural chemistry of the cast to shine through, which is why I think the 'wholesome' episodes work. In my opinion, Chulmin PD had a more structured approach, which made the cast sort of have to stick to their characters more, while Bopil PD's more loose approach is allowing them to somewhat show more of their true selves and have more real (not character driven) interactions. But I do think Bopil PD's team needs to work more on the games side, especially on making the themes and games more coherent. Though another problem seems to be that it's hard for the members to play competitively as they've already played so many games in the past that winning or losing probably doesn't really matter.",
            "author": "Infinite-Check4574",
            "id": "i6ejkr6",
            "parent_id": "t1_i6dnp83",
            "score": 12,
            "created_utc": 1651069239.0,
            "replies": [
                {
                    "body": "I really wish they'd bring back coherent themed episodes where all the missions and games actually tie into each other. These days they might get dressed up for the intro and then just start playing random games that have nothing to do with the original theme. Or bring guests on the show and do a poor job highlighting them. It's all very disoriented.",
                    "author": "merchseller",
                    "id": "i6f75y9",
                    "parent_id": "t1_i6ejkr6",
                    "score": 12,
                    "created_utc": 1651078472.0,
                    "replies": [
                        {
                            "body": "It seems like they're focused on trying to be innovative with games rather than finding games that fit the theme. But based on how much they cut/ edit out, it appears that they haven't been as successful in trying to figure out what games actually work in terms of entertainment value.\n\nI completely agree with what you said about bringing in guests. It probably has to do with wanting to highlight cast chemistry more.",
                            "author": "Infinite-Check4574",
                            "id": "i6fgtys",
                            "parent_id": "t1_i6f75y9",
                            "score": 7,
                            "created_utc": 1651082276.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol yup. The way JSJ brought up his ideas at the production meeting made it sound like he was some throwing out groundbreaking ideas. \"Hey, we don't need to play games, why don't we just talk?\" As if RM hadn't already done tons of those concepts already. There's a reason why hi",
            "author": "merchseller",
            "id": "i6f6q9s",
            "parent_id": "t1_i6ez274",
            "score": 1,
            "created_utc": 1651078303.0,
            "replies": []
        },
        {
            "body": "The problem is these types of episodes tend to get great ratings in Korea. That's why there is already such a large assortment of talking variety shows on air. They're popular with the GP. Running Man nearly got canceled many times in the past because the original style didn't appeal domestically while it was wildly appealing with international audiences, and international audiences weren't bringing in the money back then. \n\nPersonally, I fully agree with you that the recent episodes have been some of the most boring in the history of the show, but as long as they get good domestic ratings and feedback, this is likely the style of show we'll keep seeing.  I just watch old episodes as a way to cope these days, and while it's not the whole cast, Outrun has had some Classic Running Man moments so I've been veering more towards it and another show to get my weekly laughs.",
            "author": "ACEwriter12",
            "id": "i6h4cbo",
            "parent_id": "t1_i6f7ikg",
            "score": 3,
            "created_utc": 1651107447.0,
            "replies": []
        },
        {
            "body": "I think he just used his captain role as an excuse to get the running men a paid vacation lol",
            "author": "sadwattpadwriter",
            "id": "i6h13gs",
            "parent_id": "t1_i6f7ikg",
            "score": 2,
            "created_utc": 1651105969.0,
            "replies": []
        },
        {
            "body": "this. i was confused reading what op said bc i'm on this sub often and literally never seen anyone say they want runningman to be a talk show.",
            "author": "bobhwans",
            "id": "i6gf2gp",
            "parent_id": "t1_i6dk4h4",
            "score": 3,
            "created_utc": 1651095910.0,
            "replies": []
        },
        {
            "body": "I really wish they'd bring back coherent themed episodes where all the missions and games actually tie into each other. These days they might get dressed up for the intro and then just start playing random games that have nothing to do with the original theme. Or bring guests on the show and do a poor job highlighting them. It's all very disoriented.",
            "author": "merchseller",
            "id": "i6f75y9",
            "parent_id": "t1_i6ejkr6",
            "score": 12,
            "created_utc": 1651078472.0,
            "replies": [
                {
                    "body": "It seems like they're focused on trying to be innovative with games rather than finding games that fit the theme. But based on how much they cut/ edit out, it appears that they haven't been as successful in trying to figure out what games actually work in terms of entertainment value.\n\nI completely agree with what you said about bringing in guests. It probably has to do with wanting to highlight cast chemistry more.",
                    "author": "Infinite-Check4574",
                    "id": "i6fgtys",
                    "parent_id": "t1_i6f75y9",
                    "score": 7,
                    "created_utc": 1651082276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems like they're focused on trying to be innovative with games rather than finding games that fit the theme. But based on how much they cut/ edit out, it appears that they haven't been as successful in trying to figure out what games actually work in terms of entertainment value.\n\nI completely agree with what you said about bringing in guests. It probably has to do with wanting to highlight cast chemistry more.",
            "author": "Infinite-Check4574",
            "id": "i6fgtys",
            "parent_id": "t1_i6f75y9",
            "score": 7,
            "created_utc": 1651082276.0,
            "replies": []
        }
    ]
}