{
    "title": "I was raped by my SD",
    "post_id": "uym6o4",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/uym6o4/i_was_raped_by_my_sd/",
    "author": null,
    "body": "The goal of this post is to warn SBs about the potential dangers of sugar dating. Please do not ignore the early signs and stay safe!\n\nI(20f) started sugar dating this past year to support myself through college. I started seeing this new SD(51M) we went on a platonic date before we decided to get intimate. The first time he didn’t want to wear a condom, he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me. He convinced me that he was clean, he even showed me a recent test result on his phone and he promised to pull out. I didn’t know any better and he was giving me 3 times the ppm that I asked for so I decided to go through with it. Fast forward to our 3rd intimate date, it was just different. He was just pounding in me and when I asked him to stop he did not. It just started to hurt at some point, I tried to fight him but I wasn’t strong enough. He just locked me on the bed and continued assaulting me while telling me that he was paying me more than he should and I have to meet his needs. I didn’t have the energy to fight him anymore I just took it and let him finish he even came inside of me when he was aware that I wasn’t on birth control I had to take an after pill afterward. After he was done I locked myself inside of the bathroom for a few minutes and when I came back he was gone but he left the money. A few days later he reached out and asked to see me again as nothing happened. I’m traumatized from this, I don’t even know what to say or what to do. I’m still in shock that he would do something like this to me, at the same time I can’t stop blaming myself for putting myself in this situation.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/uym6o4/i_was_raped_by_my_sd/",
    "score": 118,
    "upvote_ratio": 0.85,
    "created_utc": 1653612903.0,
    "num_comments": 136,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Once again we have to repeat what was already [said.](https://old.reddit.com/r/sugarlifestyleforum/comments/mblyoy/slf_and_important_sb_topics_issues/) This is not a legal forum where people are debating the legal definition of rape. If someone comes here and chooses to disclose on SLF, they should be able to do so without people accusing them of lying etc. You don't believe them then move on to another post. Moving forward I am going to start considering this a Rule #1 violation. It's absolutely ridiculous that we have to continually tell adults it's not appropriate behavior.",
            "author": "LaSirene23",
            "id": "ia7dww4",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653665984.0,
            "replies": [
                {
                    "body": "Since it's not a legal forum, does it not confuse posters who get questionable legal advice as well?",
                    "author": "JohnnyKemmer009",
                    "id": "ia7mm3d",
                    "parent_id": "t1_ia7dww4",
                    "score": 0,
                    "created_utc": 1653669531.0,
                    "replies": [
                        {
                            "body": "Yeah, it's also not a tax forum. Or a medical forum. Yet...",
                            "author": "Y_4Z44",
                            "id": "ia7oyf5",
                            "parent_id": "t1_ia7mm3d",
                            "score": 7,
                            "created_utc": 1653670488.0,
                            "replies": [
                                {
                                    "body": "True. It is the Internet. All information, including this sentence, needs to be independently verified.",
                                    "author": "JohnnyKemmer009",
                                    "id": "ia7p4wv",
                                    "parent_id": "t1_ia7oyf5",
                                    "score": 1,
                                    "created_utc": 1653670562.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is the internet, people are going to accuse people, you're going to have to get over it. People also chase internet clout all the time. I thought the johnny Depp and amber herd case proved anybody can lie about this shit.",
                    "author": "EricaBellini",
                    "id": "ia82g3g",
                    "parent_id": "t1_ia7dww4",
                    "score": -2,
                    "created_utc": 1653676208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Take care of yourself. Might be a good idea to talk to a therapist on campus if you have access.  Never see this person again alone. Don’t blame yourself - hindsight is always 20/20.",
            "author": "itgetsbetterutah",
            "id": "ia5cyvt",
            "parent_id": "t3_uym6o4",
            "score": 72,
            "created_utc": 1653620306.0,
            "replies": []
        },
        {
            "body": "It's not your fault. \n\nIt doesn't matter that he paid you. He should have stopped the second you indicated you weren't ok with it.",
            "author": "Additional-Ability99",
            "id": "ia6a9xm",
            "parent_id": "t3_uym6o4",
            "score": 31,
            "created_utc": 1653644243.0,
            "replies": []
        },
        {
            "body": "It is disturbing that these kinds of experiences occur. Your trauma is unimaginably raw. Your bravery in coming forward is appreciated because it will hopefully be cautionary tale for others.",
            "author": "Intrepid_Seeker",
            "id": "ia59t5z",
            "parent_id": "t3_uym6o4",
            "score": 51,
            "created_utc": 1653618716.0,
            "replies": []
        },
        {
            "body": "This is not your fault. He CHOSE to harm you. He is a human with free will and he decided to hurt you. It's on him.\n\nPlease consider seeking out some specialist support from a rape crisis service. You do not need to work through this alone if you dont want to.",
            "author": "OneCanToucanThreeCan",
            "id": "ia6czrw",
            "parent_id": "t3_uym6o4",
            "score": 35,
            "created_utc": 1653646587.0,
            "replies": []
        },
        {
            "body": "I do feel sad for what happened to you and I wish you lots of strength to get over this. Do you have a support group, like family or friends who could be there and care for you and who'd you let know what happened ? I do not know the laws of USA and I can't help in that regard, but if you ever want someone to listen to you, you can always DM me. I do hope you have a real life bestie too. \n\nMost important is to know that it was not your fault, you never put yourself in a situation to be raped, you agreed to consensual sex, not to be forced to anything or in pain. He's a rapist and a terrible human being, it's not your fault. It really isn't your fault, dear. I'll keep you in my prayers.",
            "author": "EvaGreyson",
            "id": "ia6drkc",
            "parent_id": "t3_uym6o4",
            "score": 13,
            "created_utc": 1653647216.0,
            "replies": [
                {
                    "body": "I’m still trying to figure out the best way to go about this. Thank you",
                    "author": null,
                    "id": "ia91k9m",
                    "parent_id": "t1_ia6drkc",
                    "score": 1,
                    "created_utc": 1653692568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so sorry 😢 Did you get tested, and did you see a therapist for this? Sending lots of love!",
            "author": "Ivyandthehoney",
            "id": "ia6n30a",
            "parent_id": "t3_uym6o4",
            "score": 13,
            "created_utc": 1653653565.0,
            "replies": []
        },
        {
            "body": "I am so sorry this happened to you but I would like to thank you for being brave enough to come forth and say what happened. Even if it’s just reddit…..it’s still incredibly courageous.  Also this is probably not his first time(forcing girls into unprotected sex)so I suggest also getting tested as soon as you are able to do so. Sending you an internet hug and strength 💕",
            "author": "Excellent_Original66",
            "id": "ia6o8us",
            "parent_id": "t3_uym6o4",
            "score": 9,
            "created_utc": 1653654239.0,
            "replies": []
        },
        {
            "body": "I’m truly so sorry, girl :(",
            "author": "c0rnstarr",
            "id": "ia6q8a9",
            "parent_id": "t3_uym6o4",
            "score": 9,
            "created_utc": 1653655343.0,
            "replies": []
        },
        {
            "body": "I am disturbed by the amount of victim-blaming and shaming I'm seeing.\n\nOP, I just want to tell you that this wasn't your fault, there was nothing you could ever have done to invite this happening to you. I strongly suggest getting off of reddit (empathy seems to be in short supply) and calling your local crisis line; they can give you some resources to talk to regarding finding support. \n\nI want to stress that you DO NOT owe anybody anything. THERE IS NO PROTOCOL FOR VICTIMS TO TAKE. You never have to file a police report, you never have to take a rape kit. You never have to tell anyone else or feel like you need to warn others. If you WANT to do any of these things, that is fine! But I just want you to know that you don't HAVE to. There is no time-frame, you can take this as slowly as you like. The biggest priority is YOU. We need to do whatever it takes to make sure YOU will be ok. ...and a counselor will be able to help you make a plan to feel ok again.\n\nI hope the pain eases soon. Take gentle care of yourself. ❤️",
            "author": "worship_me_or_die",
            "id": "ia603qd",
            "parent_id": "t3_uym6o4",
            "score": 31,
            "created_utc": 1653635144.0,
            "replies": [
                {
                    "body": "Thank You!",
                    "author": null,
                    "id": "ia636o3",
                    "parent_id": "t1_ia603qd",
                    "score": 6,
                    "created_utc": 1653637844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia5ad5s",
            "parent_id": "t3_uym6o4",
            "score": 54,
            "created_utc": 1653618992.0,
            "replies": [
                {
                    "body": "All well and good until the police decide she was a whore and she'd agreed to the sex and decide to torment her a bit before nothing really happens to the rapist. It's not always easy to just \"go to the police\" they BLAME WOMEN for assaults like these. We don't know where she is and if her local police force is any good at handling sexual assaults. \n\nOP should certainly seek out specialist support & counselling from a take crisis service.",
                    "author": "OneCanToucanThreeCan",
                    "id": "ia6csln",
                    "parent_id": "t1_ia5ad5s",
                    "score": 40,
                    "created_utc": 1653646419.0,
                    "replies": [
                        {
                            "body": "This is a ridiculous assumption. Trying to get justice is Always better than doing nothing. The police can do their job and she needs support in pursuing justice, not this negating.",
                            "author": "MissRoyalBrush",
                            "id": "ia8eg87",
                            "parent_id": "t1_ia6csln",
                            "score": 0,
                            "created_utc": 1653681557.0,
                            "replies": [
                                {
                                    "body": "As someone who was raped and beaten by my stbx husband, who has evidence and photos and even texts where he admitted to it all: nothing is better than what you think justice will entitle you to. Because it turned into nothing but more trauma to me.\n\nShe’s only 20. She’s in college. She is a sex worker. She was violently raped. Telling her to carry the weight of inviting more strangers and trauma into her situation is bullshit. There are other groups that she can get into contact with via RAINN who can discuss her options with her in a way that gives her time to think and heal. Her mental and physical well-being is the priority, not your after school special version of justice.",
                                    "author": "anneofgreennipples",
                                    "id": "ia8fuvm",
                                    "parent_id": "t1_ia8eg87",
                                    "score": 10,
                                    "created_utc": 1653682186.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where do you get off telling victims what to do and how to act? Have you been through this? Do you know how traumatic and demanding it can be? If she chooses to then I wish her luck. But your faith in the police to do the right thing is sadly misplaced. \nMore important is knowing there are support services that will prioritise her wellbeing and assist if she needs it.",
                                    "author": "OneCanToucanThreeCan",
                                    "id": "ia94q64",
                                    "parent_id": "t1_ia8eg87",
                                    "score": 4,
                                    "created_utc": 1653694177.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thank you for saying this. I reported and this happened to me. They just made fun of me. He got to keep the video. Racism and sexism from my police department. He was white, so he got away with it.",
                            "author": "truthbetold05",
                            "id": "ic3wv11",
                            "parent_id": "t1_ia6csln",
                            "score": 1,
                            "created_utc": 1655054902.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This.\n\n100% this.\n\nVery, very sorry for your trauma.  I would still contact the police and file a report.  \n\nContact local sexual assault resources. \n\nLet the sisters of Shawshank have him!!!",
                    "author": "Pitkin_SD",
                    "id": "ia5eavl",
                    "parent_id": "t1_ia5ad5s",
                    "score": 29,
                    "created_utc": 1653620995.0,
                    "replies": []
                },
                {
                    "body": "If he followed opsec instruction, she doesn't even know his name to press charges. \n\nWhat she's describing will be considered prostitution and she will be dragged. \n\nNot that easy",
                    "author": "WiseRequirement9277",
                    "id": "ia74tbj",
                    "parent_id": "t1_ia5ad5s",
                    "score": 13,
                    "created_utc": 1653662211.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia7e0jc",
                            "parent_id": "t1_ia74tbj",
                            "score": 1,
                            "created_utc": 1653666025.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "ia7ortg",
                                    "parent_id": "t1_ia7e0jc",
                                    "score": 6,
                                    "created_utc": 1653670413.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You're wrong and aside from that No-one deserves to be raped, including prostitutes. If the police do their job there are ways to find him.",
                            "author": "MissRoyalBrush",
                            "id": "ia8drhq",
                            "parent_id": "t1_ia74tbj",
                            "score": 1,
                            "created_utc": 1653681241.0,
                            "replies": [
                                {
                                    "body": "\"If police officer do their jobs\" Oh yes because police officer are known for doing their job often pr most of the time",
                                    "author": "WiseRequirement9277",
                                    "id": "ia8u8l6",
                                    "parent_id": "t1_ia8drhq",
                                    "score": 2,
                                    "created_utc": 1653688962.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Except, he wouldn't be. What would happen is the police would ask her questions, she'd get a rape kit done, etc. In the end, he will simply say she was willing and he has clear evidence of this. \n\nYes, she was clearly raped. Yes, the man deserves to be imprisoned and castrated. I agree with your sentiment, but I think your advice is not realistic. Most rape accusations never go to court simply because there is not sufficient evidence to lead to a conviction.",
                    "author": "AShatteredKing",
                    "id": "ia62m94",
                    "parent_id": "t1_ia5ad5s",
                    "score": 24,
                    "created_utc": 1653637336.0,
                    "replies": [
                        {
                            "body": "He *could* simply say she was willing. But that doesn't mean he will. Especially if he thinks he was justified. He very well likely try to convince the officers that he was in the right. That's why cops do interrogations.\n\nYou are looking at this through the prism of someone who knows that was rape and knows it was wrong. Probably because you are someone who knows that was rape and knows rape is wrong. But he probably isn't that kind of person.",
                            "author": "NinCarolina",
                            "id": "ia7l754",
                            "parent_id": "t1_ia62m94",
                            "score": 3,
                            "created_utc": 1653668949.0,
                            "replies": []
                        },
                        {
                            "body": "Unfortunately so",
                            "author": "Chaxxa4",
                            "id": "ia720yp",
                            "parent_id": "t1_ia62m94",
                            "score": 1,
                            "created_utc": 1653661011.0,
                            "replies": []
                        },
                        {
                            "body": "Agree. It’s a very unfortunate, horrible and difficult situation. Best of luck to the OP to heal and move on from this. (I know this sounds simplistic but my comment is meant in a heartfelt way.)",
                            "author": "SDchat",
                            "id": "ia7lzwl",
                            "parent_id": "t1_ia62m94",
                            "score": 0,
                            "created_utc": 1653669277.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia7qwkr",
                    "parent_id": "t1_ia5ad5s",
                    "score": 3,
                    "created_utc": 1653671288.0,
                    "replies": [
                        {
                            "body": "Alllll of this! Thank you for being a reasonable & decent human being. Cant believe the rape supporters on this thread smh. \n\nBut, I wouldn't text so much detail, I would just say in her own words 'I dont want to see you again, I'm hurting, I asked you to stop but you didnt so I'm still really sore, it wasnt fun for me.' Dont go accusatory. Leave it open for him to respond to get the confession. IF the police can set something up with her so she can get the confession then agree to meet and he unknowingly walks in and police are there to arrest him. \n\nHe knows what he did was wrong. This is where these cowards tend to play dumb. He just didnt care that he was hurting her.",
                            "author": "MissRoyalBrush",
                            "id": "ia8getz",
                            "parent_id": "t1_ia7qwkr",
                            "score": 6,
                            "created_utc": 1653682442.0,
                            "replies": [
                                {
                                    "body": "I think a realistic view is important and it should be up to the person who experienced the abuse to decide what they want to do. You’re reaching by calling them rape apologists. I can’t take you seriously if that’s what you actually think. It’s so deluded. Talk about over correcting or all or nothing thinking.",
                                    "author": "truthbetold05",
                                    "id": "ic3ym9h",
                                    "parent_id": "t1_ia8getz",
                                    "score": 0,
                                    "created_utc": 1655055718.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I’m really trying to find the courage to report this. I’m just so scared. I’m all alone in all this, i don’t have no one to support me. I don’t want to put myself at risk and get reported for prostitution in the process.",
                            "author": null,
                            "id": "ia8mope",
                            "parent_id": "t1_ia7qwkr",
                            "score": 5,
                            "created_utc": 1653685340.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ia9btvp",
                                    "parent_id": "t1_ia8mope",
                                    "score": 2,
                                    "created_utc": 1653697879.0,
                                    "replies": [
                                        {
                                            "body": "There’s so much wrong with what you said here. She should be supported, but you’re a bigot. Do sex workers not deserve support then? What are you even saying",
                                            "author": "truthbetold05",
                                            "id": "ic3yz5g",
                                            "parent_id": "t1_ia9btvp",
                                            "score": 0,
                                            "created_utc": 1655055882.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Rapists get away because the system is built to favor them. Sex work is also criminalized. What world are you living in!!? Putting all of this on people who have experienced sexual violence at the hands of a system that is set up to victimize them from birth by indoctrination of gender norms and social privileges. You need to sit down and shut up. You can support people if they wanna report but NEVEr blame them for their abusers running free when the system is set up to work that way. Must be nice living under that rock.",
                            "author": "truthbetold05",
                            "id": "ic3xte2",
                            "parent_id": "t1_ia7qwkr",
                            "score": 2,
                            "created_utc": 1655055343.0,
                            "replies": []
                        },
                        {
                            "body": "I reported 3 different rapes I had and nothing ever happened. I didn’t even get resources from them. I think it’s up to the person if they want to report or not.",
                            "author": "truthbetold05",
                            "id": "ic3x8ll",
                            "parent_id": "t1_ia7qwkr",
                            "score": 0,
                            "created_utc": 1655055080.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Although I feel horrible for the OP and what happened to her, she would never win anything in court. Check the case history, judges throw cases like this out all the time saying that it was “consensual”. I’m so sorry this happened ♥️",
                    "author": "Severe_Middle7989",
                    "id": "ia7bv97",
                    "parent_id": "t1_ia5ad5s",
                    "score": 5,
                    "created_utc": 1653665144.0,
                    "replies": []
                },
                {
                    "body": "Look at the statistics of how many reported rapes actually go to trial and of those which are actually convicted. It’s practically 0. Calling the police will do nothing other than force her to relive her trauma in a room full of strangers. A rape kit is a good idea because at least the victim can get the medical assistance they need (medication for STIs, plan b pills, maybe even mental health counseling). But our system does not hold rapists accountable for their crimes.",
                    "author": "dontfindmythrowaway",
                    "id": "ia7koo9",
                    "parent_id": "t1_ia5ad5s",
                    "score": 4,
                    "created_utc": 1653668744.0,
                    "replies": [
                        {
                            "body": "No, calling the police will force them to do their job. Not calling will leave a string of future victims. If the police are not adequately investigating she can file a lawsuit. Things wont change when we do nothing to change it. Plus if hes already in their system they will be more likely to pursue. With reporting, it is documented and gives more evidence if/when theres another victim. Always report.",
                            "author": "MissRoyalBrush",
                            "id": "ia8f3um",
                            "parent_id": "t1_ia7koo9",
                            "score": 0,
                            "created_utc": 1653681848.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I would guarantee you’ve never attempted to report a sexual assault to the police",
                    "author": "Lipstickluna97",
                    "id": "ia7ymq2",
                    "parent_id": "t1_ia5ad5s",
                    "score": 2,
                    "created_utc": 1653674540.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia883b8",
                            "parent_id": "t1_ia7ymq2",
                            "score": -1,
                            "created_utc": 1653678696.0,
                            "replies": [
                                {
                                    "body": "That’s horrible, and still does not give him the right to tell another victim how to deal with their own assault. Nor does it give him the right to wish rape on others.",
                                    "author": "Lipstickluna97",
                                    "id": "ia89drp",
                                    "parent_id": "t1_ia883b8",
                                    "score": 3,
                                    "created_utc": 1653679271.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ia8adu9",
                                            "parent_id": "t1_ia89drp",
                                            "score": -1,
                                            "created_utc": 1653679715.0,
                                            "replies": [
                                                {
                                                    "body": "Why are we playing the oppression Olympics? Reporting assault to cops in the United States ESPECIALLY as any type of SWer (and that includes SB) is hugely futile. I’m not doubling down on a damn thing, I said what I said. If he understands how traumatic attempting to report SA is, then there is no reason to pressure another surviver into doing so.\n\nAnd with all those maybes it seems that you’re doing a lot more assuming than I am.",
                                                    "author": "Lipstickluna97",
                                                    "id": "ia8aqu7",
                                                    "parent_id": "t1_ia8adu9",
                                                    "score": 3,
                                                    "created_utc": 1653679879.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ia8c6k3",
                                                            "parent_id": "t1_ia8aqu7",
                                                            "score": -1,
                                                            "created_utc": 1653680527.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                                                                    "author": "Lipstickluna97",
                                                                    "id": "ia8dbjs",
                                                                    "parent_id": "t1_ia8c6k3",
                                                                    "score": 3,
                                                                    "created_utc": 1653681040.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ia8blzi",
                                            "parent_id": "t1_ia89drp",
                                            "score": -1,
                                            "created_utc": 1653680270.0,
                                            "replies": [
                                                {
                                                    "body": "Good for you, but you’re still not a sexworker, and was not at risk for being arrested for reporting. It’s wrong to pressure victims into reporting. That’s rape crisis counseling 101. You had a terrible experience, and that really sucks. I’m not going to give you my entire life story, but I’ve been in OPs shoes, and I wouldn’t wish it on anyone.",
                                                    "author": "Lipstickluna97",
                                                    "id": "ia8c6yk",
                                                    "parent_id": "t1_ia8blzi",
                                                    "score": 4,
                                                    "created_utc": 1653680532.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ia8cj6b",
                                                            "parent_id": "t1_ia8c6yk",
                                                            "score": -1,
                                                            "created_utc": 1653680685.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                                                                    "author": "Lipstickluna97",
                                                                    "id": "ia8d0tf",
                                                                    "parent_id": "t1_ia8cj6b",
                                                                    "score": 2,
                                                                    "created_utc": 1653680907.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so ugly and feel really sorry for you  - pls get some therapist to talk to you if you can, you can choose to disclose only what you feel comfortable with but it will help \n\nSadly, money is a lever the unscrupulous like this jerk use to paper over their serious character flaws. Another reason to see SRs in their “totality” - character, personality and financial support have to come as a package and just one aspect of these attributes should not override the others",
            "author": "OCbird22",
            "id": "ia5g9ey",
            "parent_id": "t3_uym6o4",
            "score": 6,
            "created_utc": 1653621990.0,
            "replies": []
        },
        {
            "body": "Oh my goodness babe I’m so so sorry that happened to you! Just know that was not your fault, no means NO! It is your body and a real respectable man would have stopped even if he was already inside you. You are entitled to whatever action you want to take moving forward (pressing charges or not, it is all up to you!) but please make sure you take care of yourself mentally and emotionally after experiencing a traumatic situation like that. Talk to a trusted person you know or even a therapist! If you decide to continue to sugar date in the future, just always be sure to stand on your rules/non-negotiables! If you want to wear condoms, do exactly that! Don’t let these men talk you out of doing anything you don’t want to do! If they can’t respect your wishes then that’s just not the SD for you!",
            "author": "Geminibabesss",
            "id": "ia69pb7",
            "parent_id": "t3_uym6o4",
            "score": 5,
            "created_utc": 1653643717.0,
            "replies": []
        },
        {
            "body": "To everyone saying she should call the police: to what end?\n\nWhat do you think the actual outcome would be if she got a rape kit done and called the police? Do you think they would even arrest the guy? Of course not, there's no evidence of a rape, only of consensual sex. \n\nThis is the sad reality of the world. Victims of sexual assault and rape often have no legal recourse as there's often no corroborating evidence. I've seen this happen many times.",
            "author": "AShatteredKing",
            "id": "ia62xin",
            "parent_id": "t3_uym6o4",
            "score": 13,
            "created_utc": 1653637618.0,
            "replies": [
                {
                    "body": "This is the brutal but honest truth. I have a good friend (SB) who had something similar happen and when she reported it to the police and tried to talk to an attorney it made her life 10 times worse. I’m so sorry this happened.",
                    "author": "Severe_Middle7989",
                    "id": "ia7clk9",
                    "parent_id": "t1_ia62xin",
                    "score": 5,
                    "created_utc": 1653665441.0,
                    "replies": [
                        {
                            "body": "True, I had a girl friend (not girlfriend) that something like this happened to. She came to me to help pick up the pieces. Her conclusion was the same. Unfortunately she felt it would be worse to report it.\n\nShe contemplated having a few big guy friends to go and “take care of the situation“ but decided against it.",
                            "author": "SDchat",
                            "id": "ia7n3z0",
                            "parent_id": "t1_ia7clk9",
                            "score": 4,
                            "created_utc": 1653669734.0,
                            "replies": [
                                {
                                    "body": "The last sounds like a good plan to me. I am, obviously, not advocating anyone do anything illegal.",
                                    "author": "AShatteredKing",
                                    "id": "ia7rqyc",
                                    "parent_id": "t1_ia7n3z0",
                                    "score": 1,
                                    "created_utc": 1653671638.0,
                                    "replies": [
                                        {
                                            "body": "The problem is that there is no guarantee that the ”problem” will not come back in revenge.",
                                            "author": "SDchat",
                                            "id": "ia7smar",
                                            "parent_id": "t1_ia7rqyc",
                                            "score": 0,
                                            "created_utc": 1653672001.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are setting a precedent even if the person is not convicted that this kind of behavior will not be tolerable. Even with a rape kit my abuser did not serve time but I think he learned his lesson to never take advantage of someone in a vulnerable situation.\n\n*edit * I do hope by more victims standing up and pressing charges the process will change to help aid those who have been wronged.",
                    "author": "fidgetfuckboi",
                    "id": "ia66f2h",
                    "parent_id": "t1_ia62xin",
                    "score": 2,
                    "created_utc": 1653640735.0,
                    "replies": [
                        {
                            "body": "It won't be changed because we can't convict the man on a baseless accusation. It's a shitty situation but one that doesn't seem to have a good solution. \n\nThere won't be any lesson learned from him except maybe to embolden him. He won't be arrested. He likely won't even be questioned. There is no evidence of a rape. None. Then, even if he is questioned, he simply shows that it was a consensual arrangement, that she met him with the intent of having sex and did so willingly, likely with vigorous prior consent, and with a history of consensual sex. Sorry, but the idea that he will suffer any consequences from this is simply not based in reality.",
                            "author": "AShatteredKing",
                            "id": "ia67ter",
                            "parent_id": "t1_ia66f2h",
                            "score": 3,
                            "created_utc": 1653642003.0,
                            "replies": [
                                {
                                    "body": "Nope, that's not true.  If OP brings a victims advocate and or a lawyer the police will reluctantly do their jobs.  They might be incompetent and mysogynistic but they are also civil servants.\n\nThis was not a consensual arrangement.  The facts according to the law:  OP is a victim, she was raped by a john after revoking consent.  OP cannot be charged with prostitution under these conditions.\n\nGuys like this have a trail of victims, one close encounter with the police and the the house of cards could come tumbling down...he'll be highly motivated to settle.",
                                    "author": "double-weird-3-0",
                                    "id": "ia7j6ka",
                                    "parent_id": "t1_ia67ter",
                                    "score": 1,
                                    "created_utc": 1653668135.0,
                                    "replies": [
                                        {
                                            "body": "Show this to be the case please because everything I've read says it's not. \n\n[https://en.wikipedia.org/wiki/Rape\\_in\\_the\\_United\\_States#:\\~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest](https://en.wikipedia.org/wiki/Rape_in_the_United_States#:~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest).\n\nThis states about 1/3 of rapes reported to police lead to an arrest. \n\nThey have had repeated sexual encounters. They have an arrangement to have sex. She gave consent to have sex. She received money for the sex. She was not under in the influence or otherwise unable to give consent. \n\nYes, he raped her. No, that cannot be demonstrated to be the case here without the guy himself directly stating he knew she withdrew consent and continued anyways. This is an impossible case. The police know this. \n\nHell, until a couple years ago, there were states that didn't even recognize that a woman could be raped after giving consent. California had to explicitly state that consent must be ongoing because people would argue over this. \n\nDo you have any examples of a woman withdrawing consent during sex after repeated past encounters and the woman received payment for the encounter and the man was arrested for it?",
                                            "author": "AShatteredKing",
                                            "id": "iaa4xbz",
                                            "parent_id": "t1_ia7j6ka",
                                            "score": 1,
                                            "created_utc": 1653714329.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "True… unless it’s a complete stranger in a dark alley...",
                    "author": "SDchat",
                    "id": "ia7mf4h",
                    "parent_id": "t1_ia62xin",
                    "score": 2,
                    "created_utc": 1653669451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We need to have a post reviewing safety protocol for young women. This is absolutely horrendous. I think she knows she was raped. We don’t need reassure of her trauma but we need to be men and actually think of how women don’t have to be so vulnerable and trusting to complete strangers so fast. This 3 date— equals sex rule is absolutely ridiculous. It’s when the women is COMFORTABLE because that calls for her to go up into a private room with you.  Regardless of a great man you may be. There are situation as followed. I’m sure she went into this blind because the “job” demand her to follow this man in private locations in order to be a “good SB”. \n\nNo money in the world will change what happens to her. This is her memory she has to live with. \n\nHow do you all think situations like this can be avoided?",
            "author": "Admirable_Skin6860",
            "id": "ia6zt4b",
            "parent_id": "t3_uym6o4",
            "score": 7,
            "created_utc": 1653660018.0,
            "replies": []
        },
        {
            "body": "Hi, OP. I’m so sorry this happened to you. If you are in the US and ever need someone to talk to, RAINN has great resources with a confidential hotline. They connect you with local advocates, and help you navigate resources/process reporting etc. https://www.rainn.org please take care of yourself. Remember it is not your fault at all!",
            "author": "Particular_Look7414",
            "id": "ia6xnjm",
            "parent_id": "t3_uym6o4",
            "score": 3,
            "created_utc": 1653659023.0,
            "replies": []
        },
        {
            "body": "I’ve been in this situation before OP and if you need an emotional support outlet I’d like to offer my DMs. I also have a recommendation of exposure therapy which helped me immensely with the ptsd, I entered a clinical trial in my area and I swear by it. The quality of my life has drastically improved. I hope you seek counseling in some form",
            "author": "neighborhood_nympho",
            "id": "ia7111c",
            "parent_id": "t3_uym6o4",
            "score": 3,
            "created_utc": 1653660566.0,
            "replies": []
        },
        {
            "body": "No no no!!! Do not blame yourself for a damn thing!! No means no whether it be during the act or not you are not an object you are a person with emotion with desires and what he did was wrong do not blame yourself for his lack of self control sex with you SD/SB is a GIFT that baby gifts it is not a requirement and it sure as heck isn’t something that can be taken by force. I hope you can find peace in yourself be sure to forgive yourself he isn’t losing sleep over it you are he isn’t hurting you are take care of that person she’ll come out stronger but do not blame yourself!",
            "author": "Strawberri-cream",
            "id": "ia6nu1c",
            "parent_id": "t3_uym6o4",
            "score": 5,
            "created_utc": 1653654005.0,
            "replies": []
        },
        {
            "body": "You were raped, plain and simple. It would be good to speak with the therapist and report the whole thing to the police. Also, to stay away from that guy. \r  \n\r  \nHowever, you mentioned “early signs.” If you can, it would be great if you could explain them.",
            "author": "Foreign-Concern436",
            "id": "ia5u7ae",
            "parent_id": "t3_uym6o4",
            "score": 4,
            "created_utc": 1653630606.0,
            "replies": [
                {
                    "body": "I should have been more careful when he didn’t want to wear a condom like we agreed days before.",
                    "author": null,
                    "id": "ia6f2om",
                    "parent_id": "t1_ia5u7ae",
                    "score": 3,
                    "created_utc": 1653648237.0,
                    "replies": [
                        {
                            "body": "Please do not let some of the comments here get to you. You were the victim of a crime and it is not your fault, do not blame yourself.\n\nSome members of this forum don't seem to understand that a person has a right to revoke consent at any time even during intercourse.\n\nI hope that you are also able to reach out for support in the real world. Sending you a gentle hug.\n\nEdited to add: someone had mentioned the \"auntie network\" but linked to the wrong sub so here is the link\n\n[https://www.reddit.com/r/auntienetwork/](https://www.reddit.com/r/auntienetwork/)",
                            "author": "LightOLove",
                            "id": "ia6v5dm",
                            "parent_id": "t1_ia6f2om",
                            "score": 7,
                            "created_utc": 1653657826.0,
                            "replies": []
                        },
                        {
                            "body": "SD here. No, he shouldn’t have raped you. I could never imagine treating my SB like this. This is a terrible human being who didn’t care about you at all, only about himself. \n\nI’m so sorry this happened to you. Take some time and heal. Don’t let it turn you off from sugaring, as it promise it’s possible to have amazing, safe arrangements. But the respect has to be mutual, and neither party can compromise that respect for the sake of money (for the SB) or sex (for the SD).",
                            "author": "freeewillieee",
                            "id": "iahs2xj",
                            "parent_id": "t1_ia6f2om",
                            "score": 1,
                            "created_utc": 1653874036.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please call the police. This creep will continue to assault women. \nCall for your sake and for theirs.",
            "author": null,
            "id": "ia5mhfo",
            "parent_id": "t3_uym6o4",
            "score": 6,
            "created_utc": 1653625483.0,
            "replies": [
                {
                    "body": "Depending on where she is located that may cause issues for her.",
                    "author": "aajniojnoihnoi",
                    "id": "ia5n73p",
                    "parent_id": "t1_ia5mhfo",
                    "score": 7,
                    "created_utc": 1653625922.0,
                    "replies": []
                },
                {
                    "body": "It is never the victim's responsibility to prevent/control their rapist's behaviour. When you guilt victims by saying this shit, you are not helping anyone; you are just hurting them.",
                    "author": "worship_me_or_die",
                    "id": "ia5y8a4",
                    "parent_id": "t1_ia5mhfo",
                    "score": 11,
                    "created_utc": 1653633624.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "F*ck all these sour victim blaming comments, especially from SBs, for shame. \n\nWe all make mistakes, we get help, we support. Learn from the survivors.",
            "author": "fidgetfuckboi",
            "id": "ia66tgx",
            "parent_id": "t3_uym6o4",
            "score": 5,
            "created_utc": 1653641092.0,
            "replies": []
        },
        {
            "body": "> Please do not ignore the early signs\n\nI'm confused about these \"early warning signs.\" You don't mention any of them in your post. Can you elaborate on the signs you think you didn't pay attention to?",
            "author": "Y_4Z44",
            "id": "ia5g2u7",
            "parent_id": "t3_uym6o4",
            "score": 3,
            "created_utc": 1653621895.0,
            "replies": [
                {
                    "body": "1st date didn’t want to wear a condom. Already pushing boundaries because rather than accepting her no as an answer he tried to persuade her (and succeeded).",
                    "author": "Dazzleshamazzle",
                    "id": "ia5ub86",
                    "parent_id": "t1_ia5g2u7",
                    "score": 7,
                    "created_utc": 1653630686.0,
                    "replies": [
                        {
                            "body": "How is that a warning sign?\nHe gave her the choice and she chose the 3 times higher PPM. \n\nWhat was he supposed to do? Walk away immediately without seeing if they can come to the same place?",
                            "author": "YlangScent",
                            "id": "ia61ovt",
                            "parent_id": "t1_ia5ub86",
                            "score": -4,
                            "created_utc": 1653636510.0,
                            "replies": [
                                {
                                    "body": "Haggling someone about using protection and using money as a coercion tactic is a huge red flag",
                                    "author": "c0rnstarr",
                                    "id": "ia6pqc9",
                                    "parent_id": "t1_ia61ovt",
                                    "score": 9,
                                    "created_utc": 1653655071.0,
                                    "replies": [
                                        {
                                            "body": "He didn't use money as a coercion tactic before he raped her. He simply offered 3 times more than others to begin with. There is no flag to see here and it's toxic to act like OP should have seen it coming or any other SB can learn from this.\n\nThe guy is a rapist pos, but I disagree greatly that he showed any red flags beforehand.",
                                            "author": "YlangScent",
                                            "id": "ia6s7vi",
                                            "parent_id": "t1_ia6pqc9",
                                            "score": -1,
                                            "created_utc": 1653656388.0,
                                            "replies": [
                                                {
                                                    "body": "Literally not what I’m saying??\n\nI’m not blaming OP for ANYTHING. I’m saying that  it is a red flag when “he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me.” It’s something for other SBs to be mindful of bc that is also quite common",
                                                    "author": "c0rnstarr",
                                                    "id": "ia6xwwe",
                                                    "parent_id": "t1_ia6s7vi",
                                                    "score": 5,
                                                    "created_utc": 1653659142.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It’s a warning sign because he previously agree to wearing condoms to lure her in.\n\nHe was supposed not to be pushy and manipulate a woman that might be in a place of financial vulnerability to do something she already stated she is. it comfortable.\nSex is not a negotiation table. If he/she is not comfortable then the other part needs to back away and respect without insisting \n\nSo yes, he was supposed to walk away, or rather, never go meet her on the first place",
                                    "author": "osestella",
                                    "id": "ia6cqbz",
                                    "parent_id": "t1_ia61ovt",
                                    "score": 6,
                                    "created_utc": 1653646365.0,
                                    "replies": [
                                        {
                                            "body": ">he previously agree to wearing condoms to lure her in\n\nWhat? Where in her post does it say anything like that?\nShe says:\n\n>The first time he didn’t want to wear a condom\n\nSo it was clear from the start?\nYou're adding details that she definitely did not write.",
                                            "author": "YlangScent",
                                            "id": "ia6l3x1",
                                            "parent_id": "t1_ia6cqbz",
                                            "score": -2,
                                            "created_utc": 1653652374.0,
                                            "replies": [
                                                {
                                                    "body": "But if someone says “no” for something sexual the appropriate response is “ok”. Then you can walk away or stay and agree with the other person boundaries. \nTrying to convince someone to overlook their own boundaries is not ok.",
                                                    "author": "osestella",
                                                    "id": "ia6m4du",
                                                    "parent_id": "t1_ia6l3x1",
                                                    "score": 5,
                                                    "created_utc": 1653652994.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
                                                            "author": "YlangScent",
                                                            "id": "ia6ruh4",
                                                            "parent_id": "t1_ia6m4du",
                                                            "score": 0,
                                                            "created_utc": 1653656196.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                                                                    "author": "osestella",
                                                                    "id": "ia6tlyr",
                                                                    "parent_id": "t1_ia6ruh4",
                                                                    "score": 3,
                                                                    "created_utc": 1653657082.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "She said so in the comments.",
                                                    "author": "osestella",
                                                    "id": "ia6lqod",
                                                    "parent_id": "t1_ia6l3x1",
                                                    "score": 3,
                                                    "created_utc": 1653652766.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes, if he didn't like it then he should either leave or wear a condom, not coerce her into it.\nTaking advantage of people in financial distress, or otherwise less powerful than you, to coerce them into sex they don't want is abusive behaviour.",
                                    "author": "OneCanToucanThreeCan",
                                    "id": "ia6dbhz",
                                    "parent_id": "t1_ia61ovt",
                                    "score": 5,
                                    "created_utc": 1653646855.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I made it clear that we were supposed to use a condom he agreed but when we met he was so defensive about it",
                    "author": null,
                    "id": "ia618y2",
                    "parent_id": "t1_ia5g2u7",
                    "score": 2,
                    "created_utc": 1653636120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see people saying you can't prove that it's rape. True enough. But you can get proof.\n\nThe following is up to whether you wish to or not. Be aware that it may retrigger you.\n\nHere's how you get your proof that it was rape.\n\nHe messaged you asking to get together again. So he's an idiot who thinks he still has a chance. If you're up to it, message him back.\n\nThis won't work unless you act like you're hurt but confused and might consider sex with him again.\n\nYou text him and ask him why he held you down and didn't stop when you made it clear that you weren't ok with it. You specifically mention that act and that it hurt and you told him to stop. Ask him why he did it, and say that you had to get the morning after pill.\n\nMaybe say you're never doing anything with him again unless he apologizes.\n\nHe will likely respond. *If* you are lucky, he will think with his smaller head and will likely not deny what he did, and will instead try to excuse it again with his \"I paid you money\", or try to convince you it wasn't that bad. Or will apologize, which is a good enough admittance if guilt.\n\nYou now have evidence that he confirms that he had (or, continued having) sex without your consent. Whether you take that to the police or anything else is up to you.\n\nYou may consider going to the legaladvice forum. r/auntinetwork is also good for things like this.",
            "author": "Additional-Ability99",
            "id": "ia6bp4o",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653645494.0,
            "replies": [
                {
                    "body": "This is real life, not a true crime TV show, if the OP does this there are all sorts of retaliation tactics he can use which you are not mentioning here.",
                    "author": "Severe_Middle7989",
                    "id": "ia7d272",
                    "parent_id": "t1_ia6bp4o",
                    "score": 4,
                    "created_utc": 1653665632.0,
                    "replies": [
                        {
                            "body": "Oh? Feel free to point them out.",
                            "author": "Additional-Ability99",
                            "id": "ia7gd0d",
                            "parent_id": "t1_ia7d272",
                            "score": 1,
                            "created_utc": 1653666986.0,
                            "replies": []
                        },
                        {
                            "body": "I might be wrong, but I'm pretty sure that pinning someone down and fucking them after they tell you to stop, counts as rape.\n\nAnd I'm pretty sure that apologizing for doing so counts as an admission of the act.\n\nShe doesn't have to tell him she's reporting him.\n\nI'm also pretty sure that if he was that forceful and it hurt, she likely has bruising on her arms that pictures can be taken of, and which could be used as evidence in court",
                            "author": "Additional-Ability99",
                            "id": "ia7ivr0",
                            "parent_id": "t1_ia7d272",
                            "score": 0,
                            "created_utc": 1653668011.0,
                            "replies": []
                        },
                        {
                            "body": "But this is literally what a sexual assault detective would do, try and get a confession in text.",
                            "author": "double-weird-3-0",
                            "id": "ia7jw6p",
                            "parent_id": "t1_ia7d272",
                            "score": 1,
                            "created_utc": 1653668424.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry that he did that to you. Definitely talk to a rape counselor. You also might be able to call the police department and ask to talk to a female detective. Even if it doesn’t result in a case, just having a detective contact the guy might be a deterrent from him doing this to someone else.",
            "author": null,
            "id": "ia6u4uv",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653657340.0,
            "replies": []
        },
        {
            "body": "What an asshole. And the audacity to contact you again afterwards as if everything was cool! I hope you told him to fuck himself gently with a chainsaw, and I hope you took whatever steps you need to overcome this awful event.",
            "author": "HailToTheQuinn",
            "id": "ia727b4",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653661089.0,
            "replies": []
        },
        {
            "body": "I’m so so sorry. I have SA trauma myself and I just wished I could save everyone from these things. :( let me know if you ever need anything.",
            "author": "xchelx5",
            "id": "ia759k0",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653662404.0,
            "replies": []
        },
        {
            "body": "I’m sorry that happened to you. Please do whatever you need to process and take care of yourself in the healthiest ways possible.\n\nTo be clear, I am not saying this in defense of the sugar lifestyle: Unfortunately what you described can and does happen outside of sugar dating all the time. The only real difference is the mention of money. Sugar babies do have to take some extra precautions and be more weary. But there’s only so much that can be done by a victim/survivor to prevent a violent act. People do awful things. This wasn’t your fault. I hope you can find some peace after this.",
            "author": null,
            "id": "ia75aez",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653662414.0,
            "replies": []
        },
        {
            "body": "Im so sorry this happened to you. This could happen to anyone...sugar or not. Worldwide, 1 in 3 women have experienced physical or sexual violence.  Always have your guard up and practice common sense safety measures. Never ignore red flags just because there is sugar involved. \n\nFor anyone who needs support, advice, or referrals, The US National Sexual Assault Hotline is 800.656.HOPE.",
            "author": "LadyMorgan2018",
            "id": "ia7inph",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653667919.0,
            "replies": []
        },
        {
            "body": "I'm so sorry he did this to you. You did nothing wrong whatsoever and aren't responsible. This could happen to absolutely anybody, it happens in marriages. He violently assaulted you. I hope you recover asap & get the support you need",
            "author": "ZookeepergameNo4674",
            "id": "ia7m6tp",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653669355.0,
            "replies": []
        },
        {
            "body": "I'm sorry this happened. Nobody should go through this. \n\nAlways choose the SD that is kind and respectful, even if his allowance is lower. Focusing too much on the money will bring out guys like this .",
            "author": "malcolm_reyn0lds",
            "id": "ia5n0s7",
            "parent_id": "t3_uym6o4",
            "score": -3,
            "created_utc": 1653625815.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ia5empk",
            "parent_id": "t3_uym6o4",
            "score": -20,
            "created_utc": 1653621167.0,
            "replies": [
                {
                    "body": "This is incorrect. She clearly describes telling him to stop and him refusing. That is an assault in every jurisdiction I know of.",
                    "author": "Doramang",
                    "id": "ia5ovkq",
                    "parent_id": "t1_ia5empk",
                    "score": 11,
                    "created_utc": 1653626963.0,
                    "replies": []
                },
                {
                    "body": "Victim blaming always goes well on rape threads.",
                    "author": "Pacwing",
                    "id": "ia5g69q",
                    "parent_id": "t1_ia5empk",
                    "score": 11,
                    "created_utc": 1653621944.0,
                    "replies": []
                },
                {
                    "body": "WHAT?\n\nShe said “stop” and he kept going. This is not ok.\n\nAnd whenever I have unprotected sex I ask the guy to pull out and not come inside. Coming inside without permission is not ok",
                    "author": "osestella",
                    "id": "ia6cxlc",
                    "parent_id": "t1_ia5empk",
                    "score": 5,
                    "created_utc": 1653646535.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia5g8su",
                    "parent_id": "t1_ia5empk",
                    "score": -12,
                    "created_utc": 1653621982.0,
                    "replies": [
                        {
                            "body": "If a woman says “stop” during sex and you don’t, you assaulted her. If you don’t know that already, then I’m worried for the women you sleep with.\n\nAnd if you do know that already, you should have seen she said that happened.",
                            "author": "Doramang",
                            "id": "ia6dlnb",
                            "parent_id": "t1_ia5g8su",
                            "score": 4,
                            "created_utc": 1653647084.0,
                            "replies": []
                        },
                        {
                            "body": "If it’s fake indeed nobody will ever know and accusing people is not going to change anything and is not doing any good to anyone. On the other hand, If the post is not fake you are hurting a innocent person who is traumatized. \nThe “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nHer story is plausible and holds important messages. Many woman put themselves in dangerous situations for financial gain. And man who try to push and negotiate sexual boundaries are potentially dangerous. A good sexual partner (man or woman) prioritizes their partners well being and comfort over their own individual pleasure. Attempts to bribe someone into sexual activities are not a good sign.\n\nThere are real people behind the computer screen. Please be responsible.",
                            "author": "osestella",
                            "id": "ia6k9jq",
                            "parent_id": "t1_ia5g8su",
                            "score": 5,
                            "created_utc": 1653651843.0,
                            "replies": []
                        },
                        {
                            "body": "What are you talking about? There is nothing wrong with OP post.\nThe situation is clear. She told him to stop and he kept going’s Any other information is irrelevant to the case",
                            "author": "osestella",
                            "id": "ia6d3e2",
                            "parent_id": "t1_ia5g8su",
                            "score": 2,
                            "created_utc": 1653646673.0,
                            "replies": [
                                {
                                    "body": "They think the post is fake.  There's not an insignificant portion of the sub that are paranoid about people posting fake stories to 'change public perceptions'.  Why they choose to engage on the internet in any capacity, I have no idea.  That type of shit is everywhere and has always been the case.\n\nPicking and choosing random posts and users to accuse is some grandpa fox news paranoia shit.  It makes people feel smart when they 'figured out the dirty secret no one else can see.'",
                                    "author": "Pacwing",
                                    "id": "ia6i0iu",
                                    "parent_id": "t1_ia6d3e2",
                                    "score": 5,
                                    "created_utc": 1653650345.0,
                                    "replies": [
                                        {
                                            "body": "Why would they think this particular post is fake? Even if they think is fake I feel that of all post people should just leave this alone. If it’s fake indeed nobody will ever know and accusing people is not going to change anything.\n\nIf the post is not fake they are hurting a innocent person who is traumatized. The “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nI cant understand how people can be so mean and cold. \n\nWho would benefit from changing the public’s perception? How does anyone benefit from a post life this? It doesn’t benefit SB’s or SD’s? What is the moral of the story? SD’s who offer triple ppm are potentially dangerous? This is so stupid.\n\nI’ve been acuses of faking a post once and I was like…… I even send people the private message exchange to prove it was real.\nEven if this particular post is not real the history is very plausible and akin to many that happen.\n\nPushy man and man who try to negotiate boundaries are boundaries pushers and are potentially dangerous. Girls get tempted to overlook security for financial gain. This is also not a great idea.\nReal or fake the message behind this post is accurate",
                                            "author": "osestella",
                                            "id": "ia6jd7r",
                                            "parent_id": "t1_ia6i0iu",
                                            "score": 6,
                                            "created_utc": 1653651263.0,
                                            "replies": [
                                                {
                                                    "body": "Because they think women are liars. It is mean and cold, you’re not wrong.",
                                                    "author": "Doramang",
                                                    "id": "ia6xi62",
                                                    "parent_id": "t1_ia6jd7r",
                                                    "score": 5,
                                                    "created_utc": 1653658953.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ia5i2i7",
            "parent_id": "t3_uym6o4",
            "score": -19,
            "created_utc": 1653622951.0,
            "replies": [
                {
                    "body": "Did we read the same story? What do you mean “and never give in if you really don’t want it in are in pain”? \n\nThe only reason she gave up was because she was in pain and tired of fighting because he was ASSAULTING her. Why are you insinuating that it’s what she wanted ? You’re disgusting",
                    "author": "1inquisitiveminded",
                    "id": "ia6khjo",
                    "parent_id": "t1_ia5i2i7",
                    "score": 5,
                    "created_utc": 1653651985.0,
                    "replies": []
                },
                {
                    "body": "A rape victim is never to be blamed.",
                    "author": null,
                    "id": "ia5mlp8",
                    "parent_id": "t1_ia5i2i7",
                    "score": 14,
                    "created_utc": 1653625556.0,
                    "replies": [
                        {
                            "body": "Yes I understand. I may have been quick in my comment but my intention is to instill a learning lesson. She should absolutely still take action as a victim and report it etc. \n\nBring on the downvotes.",
                            "author": "femuserhere",
                            "id": "ia5oihz",
                            "parent_id": "t1_ia5mlp8",
                            "score": -16,
                            "created_utc": 1653626734.0,
                            "replies": [
                                {
                                    "body": "Sure one should always be cautious but honestly it can happen anywhere. And it doesn’t matter. It’s the rapists fault, always.",
                                    "author": null,
                                    "id": "ia5p6nx",
                                    "parent_id": "t1_ia5oihz",
                                    "score": 9,
                                    "created_utc": 1653627160.0,
                                    "replies": []
                                },
                                {
                                    "body": "Instill a learning lesson?? For a rape victim?? Fuck outta here shes been through enough what learning lesson?",
                                    "author": "AstroP23",
                                    "id": "ia751gm",
                                    "parent_id": "t1_ia5oihz",
                                    "score": 5,
                                    "created_utc": 1653662308.0,
                                    "replies": []
                                },
                                {
                                    "body": "\"My intent is to instill a learning lesson\" - how condescending and unhelpful. Pretty sure she learned from this experience without your help, smartass.",
                                    "author": "worship_me_or_die",
                                    "id": "ia5yprp",
                                    "parent_id": "t1_ia5oihz",
                                    "score": 11,
                                    "created_utc": 1653634009.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ia73lvo",
            "parent_id": "t3_uym6o4",
            "score": -4,
            "created_utc": 1653661694.0,
            "replies": [
                {
                    "body": "Well, when I was raped and had questions I made a sock to do so anonymously and avoid getting creepy comments and having it linked to my main forevermore. I’d imagine other women do similarly. \n\nWhat is your argument here? That women aren’t assaulted in the bowl and there are no dangers in sugar dating?",
                    "author": "SBerryTrifle",
                    "id": "ia7fjla",
                    "parent_id": "t1_ia73lvo",
                    "score": 4,
                    "created_utc": 1653666653.0,
                    "replies": []
                },
                {
                    "body": "It’s a throwaway…. are you not familiar? They are used for anonymity. This may be a very active user of SLF who wants to share but doesn’t want it following her. Hope that helps!",
                    "author": "Azucarbabby",
                    "id": "ia7hni2",
                    "parent_id": "t1_ia73lvo",
                    "score": 3,
                    "created_utc": 1653667508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia72rhc",
            "parent_id": "t3_uym6o4",
            "score": -2,
            "created_utc": 1653661329.0,
            "replies": [
                {
                    "body": "You have no understanding of how cases like this actually play out in the court room. You are assuming that the SD will put up zero defense, and everything will work perfectly for the SB. Your advice is erroneous & misleading. Go read case history for scenarios like this and you will see how this plays out in reality.",
                    "author": "Severe_Middle7989",
                    "id": "ia7ds1i",
                    "parent_id": "t1_ia72rhc",
                    "score": 3,
                    "created_utc": 1653665928.0,
                    "replies": [
                        {
                            "body": "The rapist would be strongly incentivized to never let this case get anywhere near a courtroom.\n\nA guy like this will have a string of victims...OP would only have to find one which isn't that hard with this thing called the internet.",
                            "author": "double-weird-3-0",
                            "id": "ia7kt7j",
                            "parent_id": "t1_ia7ds1i",
                            "score": 1,
                            "created_utc": 1653668794.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Rapist deserves to be castrated and raped forever.\"\n\nA lot of responses like this. Very disturbing immoral sadistic vengeance streak in people.\n\nThe State does the prosecution, not the mob, and the US Constitution provides for no cruel and unusual punishment. If you want to help victims, get a grip people, instead of mob hysteria.",
            "author": "JohnnyKemmer009",
            "id": "ia7n5r1",
            "parent_id": "t3_uym6o4",
            "score": -2,
            "created_utc": 1653669755.0,
            "replies": [
                {
                    "body": "You sure are fussed by clearly impotent anger directed at rapists, huh?",
                    "author": "SBerryTrifle",
                    "id": "ia7q9nx",
                    "parent_id": "t1_ia7n5r1",
                    "score": 1,
                    "created_utc": 1653671025.0,
                    "replies": [
                        {
                            "body": "Yes, mob justice is impotent.\n\nIt does nothing for the victim.\n\nEspecially since no one approves of rapists (which would mean no one would approve of a rapist raping a rapist).",
                            "author": "JohnnyKemmer009",
                            "id": "ia7qjd6",
                            "parent_id": "t1_ia7q9nx",
                            "score": -1,
                            "created_utc": 1653671135.0,
                            "replies": [
                                {
                                    "body": "First off there are not a lot of responses like that, there is only the one and it’s not a threat but a statement of what he feels rapists deserve. The majority of comments are offering support and a good additional chunk are victim blaming or giving sort of clueless advice. I’d feel differently if there were an actual angry mob outside of the rapist’s door but no one has yet been harmed by the outrage of internet users with no idea who they are. In fact, chances are so laughably higher that he will face no consequences whatsoever than that he will face excessive consequences that your concern for him seems absurd. There are men who use SA specifically to harm women because they know the already low probability of facing consequences for assault is lesser still meeting a woman from there.",
                                    "author": "SBerryTrifle",
                                    "id": "ia7xhxl",
                                    "parent_id": "t1_ia7qjd6",
                                    "score": 2,
                                    "created_utc": 1653674056.0,
                                    "replies": [
                                        {
                                            "body": "There are plenty on this rape report thread including other rape report threads. My response did not mention only this post. You are being pedantic.\n\nHelping victims with detailed advice is not \"victim blaming\".\n\n\"There are men who use SA specifically to harm women...\"  \nYou don't know that. Nor that it is different from other dating venues were it true. And if that were true in any significant degree, women don't seem to stop seeking men out out of that fear. Women should just stop dating men period in that case.\n\nMine is a rational response to help both male and female victims. You are projecting some other purpose onto me.",
                                            "author": "JohnnyKemmer009",
                                            "id": "ia7ybnb",
                                            "parent_id": "t1_ia7xhxl",
                                            "score": 0,
                                            "created_utc": 1653674409.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ia613j0",
            "parent_id": "t3_uym6o4",
            "score": -6,
            "created_utc": 1653635994.0,
            "replies": [
                {
                    "body": "Seriously??",
                    "author": "JSBelle",
                    "id": "ia6lboz",
                    "parent_id": "t1_ia613j0",
                    "score": 5,
                    "created_utc": 1653652509.0,
                    "replies": []
                },
                {
                    "body": "🙄",
                    "author": "osestella",
                    "id": "ia6d784",
                    "parent_id": "t1_ia613j0",
                    "score": 4,
                    "created_utc": 1653646761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Truly sorry. Go see a therapist",
            "author": "WiseRequirement9277",
            "id": "ia75194",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653662306.0,
            "replies": []
        },
        {
            "body": "I'm soo sorry this happened to you.\n\nSLF guide to sugaring, meeting a strange man once or twice, then doing pay for play somewhere private leaves SB's very vulnerable to meeting black listed johns.  \n\nIf a guy wont' share his name and place of employment that is not someone to meet in private.\n\nI'd file a police report, bring a victims advocate, even if you decide not to press charges, it'll help for a civil suit, which he will likely settle.  A guy like this will have many victims on SA.  He's done it before.\n\nYou did nothing wrong.  You were lulled into a false sense of security that sugar was comparatively safe when it's really incredibly dangerous.",
            "author": "double-weird-3-0",
            "id": "ia7ifm3",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653667828.0,
            "replies": []
        },
        {
            "body": "In defense of the sugar community this horrible act could and unfortunately does happen in many vanilla and other non-sugar relationships. So sorry that this happened to you. Take care of you and heal.",
            "author": "SDchat",
            "id": "ia7nl2q",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653669929.0,
            "replies": []
        },
        {
            "body": "Please report this. Get justice. This has happened before and it will keep happening if hes not arrested & charged. Dont talk to him or meet at all. \nGo to a hospital and get checked out right away. Screen for STD/I's now AND in 3 months.\n\nSome things to remind yourself for you & others\n\n- Being treated badly does not mean you deserve it. \n- No amount of money is worth the risk. Reread.\n\nMoving forward, wether sugar or traditional dating\n- Meet MORE than once before being intimate. One date lasting a cpl/few hours is not enough to get a feel for anyone. So be platonic for as long as it takes to make sure you feel 100% comfortable before deciding to be intimate. \n-Ignore the so called SD's/John's on here who dont give a shit about your safety. Some or rather a lot of their 'advice' & bitching is getting women hurt. \n- ALWAYS USE PROTECTION, ALWAYS. This should be a non negotiable. If you dont both want a future and kids together there is no reason not to use protection. STD/I's can kill. Some are not curable. Some cause cancer.   If he pushes for no protection, he's not worth it.\n- Both should get STD/I testing done, some STD/I's can be passed through skin contact. You can get STD/I's in your mouth. Know each others status. Men should ask about detecting hpv. It isnt in a blood test. HPV & herpes are very contagious & stay in your system. \n- Get vacc'd, make sure to talk to your Drs and your partner about it. Covid-HPV-Hepatitis- know each others status.\n- Birth Control, speak to your gyno about it. Men could/should consider getting snipped. We really need better science, its messed up that us ladies have to take on so much more responsibility. Make sure hes aware of risks and stays safe. \n\nI'm sorry this happened to you. There are better people out there. I hope that vile douche is caught. You still have his contact info. Give it to police. Also report him on the platform you used to meet him. Then block him. If you used a real number consider changing it. Report everytime he tries to contact you. This could be seen as harassment. Please be safe. 💛",
            "author": "MissRoyalBrush",
            "id": "ia8ccus",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653680606.0,
            "replies": []
        },
        {
            "body": "Nothing about this is OK; I'm so sorry you went through this.\n\nIt doesn't matter (other posters!) if this constitutes a rape under the laws of whatever jurisdiction this occurred it; what matters is that our community member was assaulted, feels violated, feels awful.\n\nOP, please get help through RAINN or similar via your college. Don't suffer in silence. At least understand your legal options before making any decisions. \n\nFind a friend or two you trust that be confidants in this matter. Don't suffer alone in silence; you won't heal that way.\n\nI am so, so sorry.",
            "author": "marker3000",
            "id": "ia9d2uv",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653698542.0,
            "replies": []
        },
        {
            "body": "is the payment worth the potential harm? based on your story, he's both dishonest and inconsiderate - potentially dangerous? also, you don't have to do anything besides take care of yourself. don't feel obligated to respond to him unless you feel a response is the safer option. you have the community here to help you work through this - don't feel like you're alone!",
            "author": null,
            "id": "ia9dqx9",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653698902.0,
            "replies": []
        },
        {
            "body": "Damn, that is horrific. I cant even imagine how traumatic that must be. I would think that its legit to call that rape. \n\nFWIW, My SB and I have a safe word, but that doesn't matter, if she even hints at wanting to go home for any reason, I will take her right away. Even if that means giving up intimacy.",
            "author": null,
            "id": "iaa3r4u",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653713493.0,
            "replies": []
        },
        {
            "body": "1) Not your fault. He is disgusting. \n2) Seek medical help.\n3) Seek out a therapist. \n4) Take all the time you need.\n5) DO NOT BLAME YOURSELF.\n\n3 years ago I went on a Tinder date “hook up” that turned into rape. I still struggle with shame and self-blame. Just know that it isn’t your fault, no matter how gross you may feel now. Your feelings will catch up with the facts. Stay safe and take care of you.",
            "author": null,
            "id": "iaam04b",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653728794.0,
            "replies": []
        },
        {
            "body": "For future reference, please use protection with these men. If they can’t handle that, it’s a dealbreaker every time. You know you’re not the only woman he’s sleeping with raw. Boundary stomping is always a huge red flag,",
            "author": "abbydavis102",
            "id": "iacxqw4",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653774467.0,
            "replies": []
        },
        {
            "body": "Are you going to see him again?",
            "author": "Heree2Comment",
            "id": "iagjo88",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1653851655.0,
            "replies": []
        },
        {
            "body": "Im so sorry.",
            "author": "truthbetold05",
            "id": "ic3wflc",
            "parent_id": "t3_uym6o4",
            "score": 1,
            "created_utc": 1655054702.0,
            "replies": []
        },
        {
            "body": "Since it's not a legal forum, does it not confuse posters who get questionable legal advice as well?",
            "author": "JohnnyKemmer009",
            "id": "ia7mm3d",
            "parent_id": "t1_ia7dww4",
            "score": 0,
            "created_utc": 1653669531.0,
            "replies": [
                {
                    "body": "Yeah, it's also not a tax forum. Or a medical forum. Yet...",
                    "author": "Y_4Z44",
                    "id": "ia7oyf5",
                    "parent_id": "t1_ia7mm3d",
                    "score": 7,
                    "created_utc": 1653670488.0,
                    "replies": [
                        {
                            "body": "True. It is the Internet. All information, including this sentence, needs to be independently verified.",
                            "author": "JohnnyKemmer009",
                            "id": "ia7p4wv",
                            "parent_id": "t1_ia7oyf5",
                            "score": 1,
                            "created_utc": 1653670562.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the internet, people are going to accuse people, you're going to have to get over it. People also chase internet clout all the time. I thought the johnny Depp and amber herd case proved anybody can lie about this shit.",
            "author": "EricaBellini",
            "id": "ia82g3g",
            "parent_id": "t1_ia7dww4",
            "score": -2,
            "created_utc": 1653676208.0,
            "replies": []
        },
        {
            "body": "I’m still trying to figure out the best way to go about this. Thank you",
            "author": null,
            "id": "ia91k9m",
            "parent_id": "t1_ia6drkc",
            "score": 1,
            "created_utc": 1653692568.0,
            "replies": []
        },
        {
            "body": "Thank You!",
            "author": null,
            "id": "ia636o3",
            "parent_id": "t1_ia603qd",
            "score": 6,
            "created_utc": 1653637844.0,
            "replies": []
        },
        {
            "body": "All well and good until the police decide she was a whore and she'd agreed to the sex and decide to torment her a bit before nothing really happens to the rapist. It's not always easy to just \"go to the police\" they BLAME WOMEN for assaults like these. We don't know where she is and if her local police force is any good at handling sexual assaults. \n\nOP should certainly seek out specialist support & counselling from a take crisis service.",
            "author": "OneCanToucanThreeCan",
            "id": "ia6csln",
            "parent_id": "t1_ia5ad5s",
            "score": 40,
            "created_utc": 1653646419.0,
            "replies": [
                {
                    "body": "This is a ridiculous assumption. Trying to get justice is Always better than doing nothing. The police can do their job and she needs support in pursuing justice, not this negating.",
                    "author": "MissRoyalBrush",
                    "id": "ia8eg87",
                    "parent_id": "t1_ia6csln",
                    "score": 0,
                    "created_utc": 1653681557.0,
                    "replies": [
                        {
                            "body": "As someone who was raped and beaten by my stbx husband, who has evidence and photos and even texts where he admitted to it all: nothing is better than what you think justice will entitle you to. Because it turned into nothing but more trauma to me.\n\nShe’s only 20. She’s in college. She is a sex worker. She was violently raped. Telling her to carry the weight of inviting more strangers and trauma into her situation is bullshit. There are other groups that she can get into contact with via RAINN who can discuss her options with her in a way that gives her time to think and heal. Her mental and physical well-being is the priority, not your after school special version of justice.",
                            "author": "anneofgreennipples",
                            "id": "ia8fuvm",
                            "parent_id": "t1_ia8eg87",
                            "score": 10,
                            "created_utc": 1653682186.0,
                            "replies": []
                        },
                        {
                            "body": "Where do you get off telling victims what to do and how to act? Have you been through this? Do you know how traumatic and demanding it can be? If she chooses to then I wish her luck. But your faith in the police to do the right thing is sadly misplaced. \nMore important is knowing there are support services that will prioritise her wellbeing and assist if she needs it.",
                            "author": "OneCanToucanThreeCan",
                            "id": "ia94q64",
                            "parent_id": "t1_ia8eg87",
                            "score": 4,
                            "created_utc": 1653694177.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you for saying this. I reported and this happened to me. They just made fun of me. He got to keep the video. Racism and sexism from my police department. He was white, so he got away with it.",
                    "author": "truthbetold05",
                    "id": "ic3wv11",
                    "parent_id": "t1_ia6csln",
                    "score": 1,
                    "created_utc": 1655054902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This.\n\n100% this.\n\nVery, very sorry for your trauma.  I would still contact the police and file a report.  \n\nContact local sexual assault resources. \n\nLet the sisters of Shawshank have him!!!",
            "author": "Pitkin_SD",
            "id": "ia5eavl",
            "parent_id": "t1_ia5ad5s",
            "score": 29,
            "created_utc": 1653620995.0,
            "replies": []
        },
        {
            "body": "If he followed opsec instruction, she doesn't even know his name to press charges. \n\nWhat she's describing will be considered prostitution and she will be dragged. \n\nNot that easy",
            "author": "WiseRequirement9277",
            "id": "ia74tbj",
            "parent_id": "t1_ia5ad5s",
            "score": 13,
            "created_utc": 1653662211.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia7e0jc",
                    "parent_id": "t1_ia74tbj",
                    "score": 1,
                    "created_utc": 1653666025.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "ia7ortg",
                            "parent_id": "t1_ia7e0jc",
                            "score": 6,
                            "created_utc": 1653670413.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You're wrong and aside from that No-one deserves to be raped, including prostitutes. If the police do their job there are ways to find him.",
                    "author": "MissRoyalBrush",
                    "id": "ia8drhq",
                    "parent_id": "t1_ia74tbj",
                    "score": 1,
                    "created_utc": 1653681241.0,
                    "replies": [
                        {
                            "body": "\"If police officer do their jobs\" Oh yes because police officer are known for doing their job often pr most of the time",
                            "author": "WiseRequirement9277",
                            "id": "ia8u8l6",
                            "parent_id": "t1_ia8drhq",
                            "score": 2,
                            "created_utc": 1653688962.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Except, he wouldn't be. What would happen is the police would ask her questions, she'd get a rape kit done, etc. In the end, he will simply say she was willing and he has clear evidence of this. \n\nYes, she was clearly raped. Yes, the man deserves to be imprisoned and castrated. I agree with your sentiment, but I think your advice is not realistic. Most rape accusations never go to court simply because there is not sufficient evidence to lead to a conviction.",
            "author": "AShatteredKing",
            "id": "ia62m94",
            "parent_id": "t1_ia5ad5s",
            "score": 24,
            "created_utc": 1653637336.0,
            "replies": [
                {
                    "body": "He *could* simply say she was willing. But that doesn't mean he will. Especially if he thinks he was justified. He very well likely try to convince the officers that he was in the right. That's why cops do interrogations.\n\nYou are looking at this through the prism of someone who knows that was rape and knows it was wrong. Probably because you are someone who knows that was rape and knows rape is wrong. But he probably isn't that kind of person.",
                    "author": "NinCarolina",
                    "id": "ia7l754",
                    "parent_id": "t1_ia62m94",
                    "score": 3,
                    "created_utc": 1653668949.0,
                    "replies": []
                },
                {
                    "body": "Unfortunately so",
                    "author": "Chaxxa4",
                    "id": "ia720yp",
                    "parent_id": "t1_ia62m94",
                    "score": 1,
                    "created_utc": 1653661011.0,
                    "replies": []
                },
                {
                    "body": "Agree. It’s a very unfortunate, horrible and difficult situation. Best of luck to the OP to heal and move on from this. (I know this sounds simplistic but my comment is meant in a heartfelt way.)",
                    "author": "SDchat",
                    "id": "ia7lzwl",
                    "parent_id": "t1_ia62m94",
                    "score": 0,
                    "created_utc": 1653669277.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia7qwkr",
            "parent_id": "t1_ia5ad5s",
            "score": 3,
            "created_utc": 1653671288.0,
            "replies": [
                {
                    "body": "Alllll of this! Thank you for being a reasonable & decent human being. Cant believe the rape supporters on this thread smh. \n\nBut, I wouldn't text so much detail, I would just say in her own words 'I dont want to see you again, I'm hurting, I asked you to stop but you didnt so I'm still really sore, it wasnt fun for me.' Dont go accusatory. Leave it open for him to respond to get the confession. IF the police can set something up with her so she can get the confession then agree to meet and he unknowingly walks in and police are there to arrest him. \n\nHe knows what he did was wrong. This is where these cowards tend to play dumb. He just didnt care that he was hurting her.",
                    "author": "MissRoyalBrush",
                    "id": "ia8getz",
                    "parent_id": "t1_ia7qwkr",
                    "score": 6,
                    "created_utc": 1653682442.0,
                    "replies": [
                        {
                            "body": "I think a realistic view is important and it should be up to the person who experienced the abuse to decide what they want to do. You’re reaching by calling them rape apologists. I can’t take you seriously if that’s what you actually think. It’s so deluded. Talk about over correcting or all or nothing thinking.",
                            "author": "truthbetold05",
                            "id": "ic3ym9h",
                            "parent_id": "t1_ia8getz",
                            "score": 0,
                            "created_utc": 1655055718.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m really trying to find the courage to report this. I’m just so scared. I’m all alone in all this, i don’t have no one to support me. I don’t want to put myself at risk and get reported for prostitution in the process.",
                    "author": null,
                    "id": "ia8mope",
                    "parent_id": "t1_ia7qwkr",
                    "score": 5,
                    "created_utc": 1653685340.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia9btvp",
                            "parent_id": "t1_ia8mope",
                            "score": 2,
                            "created_utc": 1653697879.0,
                            "replies": [
                                {
                                    "body": "There’s so much wrong with what you said here. She should be supported, but you’re a bigot. Do sex workers not deserve support then? What are you even saying",
                                    "author": "truthbetold05",
                                    "id": "ic3yz5g",
                                    "parent_id": "t1_ia9btvp",
                                    "score": 0,
                                    "created_utc": 1655055882.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Rapists get away because the system is built to favor them. Sex work is also criminalized. What world are you living in!!? Putting all of this on people who have experienced sexual violence at the hands of a system that is set up to victimize them from birth by indoctrination of gender norms and social privileges. You need to sit down and shut up. You can support people if they wanna report but NEVEr blame them for their abusers running free when the system is set up to work that way. Must be nice living under that rock.",
                    "author": "truthbetold05",
                    "id": "ic3xte2",
                    "parent_id": "t1_ia7qwkr",
                    "score": 2,
                    "created_utc": 1655055343.0,
                    "replies": []
                },
                {
                    "body": "I reported 3 different rapes I had and nothing ever happened. I didn’t even get resources from them. I think it’s up to the person if they want to report or not.",
                    "author": "truthbetold05",
                    "id": "ic3x8ll",
                    "parent_id": "t1_ia7qwkr",
                    "score": 0,
                    "created_utc": 1655055080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Although I feel horrible for the OP and what happened to her, she would never win anything in court. Check the case history, judges throw cases like this out all the time saying that it was “consensual”. I’m so sorry this happened ♥️",
            "author": "Severe_Middle7989",
            "id": "ia7bv97",
            "parent_id": "t1_ia5ad5s",
            "score": 5,
            "created_utc": 1653665144.0,
            "replies": []
        },
        {
            "body": "Look at the statistics of how many reported rapes actually go to trial and of those which are actually convicted. It’s practically 0. Calling the police will do nothing other than force her to relive her trauma in a room full of strangers. A rape kit is a good idea because at least the victim can get the medical assistance they need (medication for STIs, plan b pills, maybe even mental health counseling). But our system does not hold rapists accountable for their crimes.",
            "author": "dontfindmythrowaway",
            "id": "ia7koo9",
            "parent_id": "t1_ia5ad5s",
            "score": 4,
            "created_utc": 1653668744.0,
            "replies": [
                {
                    "body": "No, calling the police will force them to do their job. Not calling will leave a string of future victims. If the police are not adequately investigating she can file a lawsuit. Things wont change when we do nothing to change it. Plus if hes already in their system they will be more likely to pursue. With reporting, it is documented and gives more evidence if/when theres another victim. Always report.",
                    "author": "MissRoyalBrush",
                    "id": "ia8f3um",
                    "parent_id": "t1_ia7koo9",
                    "score": 0,
                    "created_utc": 1653681848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would guarantee you’ve never attempted to report a sexual assault to the police",
            "author": "Lipstickluna97",
            "id": "ia7ymq2",
            "parent_id": "t1_ia5ad5s",
            "score": 2,
            "created_utc": 1653674540.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia883b8",
                    "parent_id": "t1_ia7ymq2",
                    "score": -1,
                    "created_utc": 1653678696.0,
                    "replies": [
                        {
                            "body": "That’s horrible, and still does not give him the right to tell another victim how to deal with their own assault. Nor does it give him the right to wish rape on others.",
                            "author": "Lipstickluna97",
                            "id": "ia89drp",
                            "parent_id": "t1_ia883b8",
                            "score": 3,
                            "created_utc": 1653679271.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ia8adu9",
                                    "parent_id": "t1_ia89drp",
                                    "score": -1,
                                    "created_utc": 1653679715.0,
                                    "replies": [
                                        {
                                            "body": "Why are we playing the oppression Olympics? Reporting assault to cops in the United States ESPECIALLY as any type of SWer (and that includes SB) is hugely futile. I’m not doubling down on a damn thing, I said what I said. If he understands how traumatic attempting to report SA is, then there is no reason to pressure another surviver into doing so.\n\nAnd with all those maybes it seems that you’re doing a lot more assuming than I am.",
                                            "author": "Lipstickluna97",
                                            "id": "ia8aqu7",
                                            "parent_id": "t1_ia8adu9",
                                            "score": 3,
                                            "created_utc": 1653679879.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ia8c6k3",
                                                    "parent_id": "t1_ia8aqu7",
                                                    "score": -1,
                                                    "created_utc": 1653680527.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                                                            "author": "Lipstickluna97",
                                                            "id": "ia8dbjs",
                                                            "parent_id": "t1_ia8c6k3",
                                                            "score": 3,
                                                            "created_utc": 1653681040.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ia8blzi",
                                    "parent_id": "t1_ia89drp",
                                    "score": -1,
                                    "created_utc": 1653680270.0,
                                    "replies": [
                                        {
                                            "body": "Good for you, but you’re still not a sexworker, and was not at risk for being arrested for reporting. It’s wrong to pressure victims into reporting. That’s rape crisis counseling 101. You had a terrible experience, and that really sucks. I’m not going to give you my entire life story, but I’ve been in OPs shoes, and I wouldn’t wish it on anyone.",
                                            "author": "Lipstickluna97",
                                            "id": "ia8c6yk",
                                            "parent_id": "t1_ia8blzi",
                                            "score": 4,
                                            "created_utc": 1653680532.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ia8cj6b",
                                                    "parent_id": "t1_ia8c6yk",
                                                    "score": -1,
                                                    "created_utc": 1653680685.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                                                            "author": "Lipstickluna97",
                                                            "id": "ia8d0tf",
                                                            "parent_id": "t1_ia8cj6b",
                                                            "score": 2,
                                                            "created_utc": 1653680907.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the brutal but honest truth. I have a good friend (SB) who had something similar happen and when she reported it to the police and tried to talk to an attorney it made her life 10 times worse. I’m so sorry this happened.",
            "author": "Severe_Middle7989",
            "id": "ia7clk9",
            "parent_id": "t1_ia62xin",
            "score": 5,
            "created_utc": 1653665441.0,
            "replies": [
                {
                    "body": "True, I had a girl friend (not girlfriend) that something like this happened to. She came to me to help pick up the pieces. Her conclusion was the same. Unfortunately she felt it would be worse to report it.\n\nShe contemplated having a few big guy friends to go and “take care of the situation“ but decided against it.",
                    "author": "SDchat",
                    "id": "ia7n3z0",
                    "parent_id": "t1_ia7clk9",
                    "score": 4,
                    "created_utc": 1653669734.0,
                    "replies": [
                        {
                            "body": "The last sounds like a good plan to me. I am, obviously, not advocating anyone do anything illegal.",
                            "author": "AShatteredKing",
                            "id": "ia7rqyc",
                            "parent_id": "t1_ia7n3z0",
                            "score": 1,
                            "created_utc": 1653671638.0,
                            "replies": [
                                {
                                    "body": "The problem is that there is no guarantee that the ”problem” will not come back in revenge.",
                                    "author": "SDchat",
                                    "id": "ia7smar",
                                    "parent_id": "t1_ia7rqyc",
                                    "score": 0,
                                    "created_utc": 1653672001.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are setting a precedent even if the person is not convicted that this kind of behavior will not be tolerable. Even with a rape kit my abuser did not serve time but I think he learned his lesson to never take advantage of someone in a vulnerable situation.\n\n*edit * I do hope by more victims standing up and pressing charges the process will change to help aid those who have been wronged.",
            "author": "fidgetfuckboi",
            "id": "ia66f2h",
            "parent_id": "t1_ia62xin",
            "score": 2,
            "created_utc": 1653640735.0,
            "replies": [
                {
                    "body": "It won't be changed because we can't convict the man on a baseless accusation. It's a shitty situation but one that doesn't seem to have a good solution. \n\nThere won't be any lesson learned from him except maybe to embolden him. He won't be arrested. He likely won't even be questioned. There is no evidence of a rape. None. Then, even if he is questioned, he simply shows that it was a consensual arrangement, that she met him with the intent of having sex and did so willingly, likely with vigorous prior consent, and with a history of consensual sex. Sorry, but the idea that he will suffer any consequences from this is simply not based in reality.",
                    "author": "AShatteredKing",
                    "id": "ia67ter",
                    "parent_id": "t1_ia66f2h",
                    "score": 3,
                    "created_utc": 1653642003.0,
                    "replies": [
                        {
                            "body": "Nope, that's not true.  If OP brings a victims advocate and or a lawyer the police will reluctantly do their jobs.  They might be incompetent and mysogynistic but they are also civil servants.\n\nThis was not a consensual arrangement.  The facts according to the law:  OP is a victim, she was raped by a john after revoking consent.  OP cannot be charged with prostitution under these conditions.\n\nGuys like this have a trail of victims, one close encounter with the police and the the house of cards could come tumbling down...he'll be highly motivated to settle.",
                            "author": "double-weird-3-0",
                            "id": "ia7j6ka",
                            "parent_id": "t1_ia67ter",
                            "score": 1,
                            "created_utc": 1653668135.0,
                            "replies": [
                                {
                                    "body": "Show this to be the case please because everything I've read says it's not. \n\n[https://en.wikipedia.org/wiki/Rape\\_in\\_the\\_United\\_States#:\\~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest](https://en.wikipedia.org/wiki/Rape_in_the_United_States#:~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest).\n\nThis states about 1/3 of rapes reported to police lead to an arrest. \n\nThey have had repeated sexual encounters. They have an arrangement to have sex. She gave consent to have sex. She received money for the sex. She was not under in the influence or otherwise unable to give consent. \n\nYes, he raped her. No, that cannot be demonstrated to be the case here without the guy himself directly stating he knew she withdrew consent and continued anyways. This is an impossible case. The police know this. \n\nHell, until a couple years ago, there were states that didn't even recognize that a woman could be raped after giving consent. California had to explicitly state that consent must be ongoing because people would argue over this. \n\nDo you have any examples of a woman withdrawing consent during sex after repeated past encounters and the woman received payment for the encounter and the man was arrested for it?",
                                    "author": "AShatteredKing",
                                    "id": "iaa4xbz",
                                    "parent_id": "t1_ia7j6ka",
                                    "score": 1,
                                    "created_utc": 1653714329.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "True… unless it’s a complete stranger in a dark alley...",
            "author": "SDchat",
            "id": "ia7mf4h",
            "parent_id": "t1_ia62xin",
            "score": 2,
            "created_utc": 1653669451.0,
            "replies": []
        },
        {
            "body": "I should have been more careful when he didn’t want to wear a condom like we agreed days before.",
            "author": null,
            "id": "ia6f2om",
            "parent_id": "t1_ia5u7ae",
            "score": 3,
            "created_utc": 1653648237.0,
            "replies": [
                {
                    "body": "Please do not let some of the comments here get to you. You were the victim of a crime and it is not your fault, do not blame yourself.\n\nSome members of this forum don't seem to understand that a person has a right to revoke consent at any time even during intercourse.\n\nI hope that you are also able to reach out for support in the real world. Sending you a gentle hug.\n\nEdited to add: someone had mentioned the \"auntie network\" but linked to the wrong sub so here is the link\n\n[https://www.reddit.com/r/auntienetwork/](https://www.reddit.com/r/auntienetwork/)",
                    "author": "LightOLove",
                    "id": "ia6v5dm",
                    "parent_id": "t1_ia6f2om",
                    "score": 7,
                    "created_utc": 1653657826.0,
                    "replies": []
                },
                {
                    "body": "SD here. No, he shouldn’t have raped you. I could never imagine treating my SB like this. This is a terrible human being who didn’t care about you at all, only about himself. \n\nI’m so sorry this happened to you. Take some time and heal. Don’t let it turn you off from sugaring, as it promise it’s possible to have amazing, safe arrangements. But the respect has to be mutual, and neither party can compromise that respect for the sake of money (for the SB) or sex (for the SD).",
                    "author": "freeewillieee",
                    "id": "iahs2xj",
                    "parent_id": "t1_ia6f2om",
                    "score": 1,
                    "created_utc": 1653874036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Depending on where she is located that may cause issues for her.",
            "author": "aajniojnoihnoi",
            "id": "ia5n73p",
            "parent_id": "t1_ia5mhfo",
            "score": 7,
            "created_utc": 1653625922.0,
            "replies": []
        },
        {
            "body": "It is never the victim's responsibility to prevent/control their rapist's behaviour. When you guilt victims by saying this shit, you are not helping anyone; you are just hurting them.",
            "author": "worship_me_or_die",
            "id": "ia5y8a4",
            "parent_id": "t1_ia5mhfo",
            "score": 11,
            "created_utc": 1653633624.0,
            "replies": []
        },
        {
            "body": "1st date didn’t want to wear a condom. Already pushing boundaries because rather than accepting her no as an answer he tried to persuade her (and succeeded).",
            "author": "Dazzleshamazzle",
            "id": "ia5ub86",
            "parent_id": "t1_ia5g2u7",
            "score": 7,
            "created_utc": 1653630686.0,
            "replies": [
                {
                    "body": "How is that a warning sign?\nHe gave her the choice and she chose the 3 times higher PPM. \n\nWhat was he supposed to do? Walk away immediately without seeing if they can come to the same place?",
                    "author": "YlangScent",
                    "id": "ia61ovt",
                    "parent_id": "t1_ia5ub86",
                    "score": -4,
                    "created_utc": 1653636510.0,
                    "replies": [
                        {
                            "body": "Haggling someone about using protection and using money as a coercion tactic is a huge red flag",
                            "author": "c0rnstarr",
                            "id": "ia6pqc9",
                            "parent_id": "t1_ia61ovt",
                            "score": 9,
                            "created_utc": 1653655071.0,
                            "replies": [
                                {
                                    "body": "He didn't use money as a coercion tactic before he raped her. He simply offered 3 times more than others to begin with. There is no flag to see here and it's toxic to act like OP should have seen it coming or any other SB can learn from this.\n\nThe guy is a rapist pos, but I disagree greatly that he showed any red flags beforehand.",
                                    "author": "YlangScent",
                                    "id": "ia6s7vi",
                                    "parent_id": "t1_ia6pqc9",
                                    "score": -1,
                                    "created_utc": 1653656388.0,
                                    "replies": [
                                        {
                                            "body": "Literally not what I’m saying??\n\nI’m not blaming OP for ANYTHING. I’m saying that  it is a red flag when “he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me.” It’s something for other SBs to be mindful of bc that is also quite common",
                                            "author": "c0rnstarr",
                                            "id": "ia6xwwe",
                                            "parent_id": "t1_ia6s7vi",
                                            "score": 5,
                                            "created_utc": 1653659142.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It’s a warning sign because he previously agree to wearing condoms to lure her in.\n\nHe was supposed not to be pushy and manipulate a woman that might be in a place of financial vulnerability to do something she already stated she is. it comfortable.\nSex is not a negotiation table. If he/she is not comfortable then the other part needs to back away and respect without insisting \n\nSo yes, he was supposed to walk away, or rather, never go meet her on the first place",
                            "author": "osestella",
                            "id": "ia6cqbz",
                            "parent_id": "t1_ia61ovt",
                            "score": 6,
                            "created_utc": 1653646365.0,
                            "replies": [
                                {
                                    "body": ">he previously agree to wearing condoms to lure her in\n\nWhat? Where in her post does it say anything like that?\nShe says:\n\n>The first time he didn’t want to wear a condom\n\nSo it was clear from the start?\nYou're adding details that she definitely did not write.",
                                    "author": "YlangScent",
                                    "id": "ia6l3x1",
                                    "parent_id": "t1_ia6cqbz",
                                    "score": -2,
                                    "created_utc": 1653652374.0,
                                    "replies": [
                                        {
                                            "body": "But if someone says “no” for something sexual the appropriate response is “ok”. Then you can walk away or stay and agree with the other person boundaries. \nTrying to convince someone to overlook their own boundaries is not ok.",
                                            "author": "osestella",
                                            "id": "ia6m4du",
                                            "parent_id": "t1_ia6l3x1",
                                            "score": 5,
                                            "created_utc": 1653652994.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
                                                    "author": "YlangScent",
                                                    "id": "ia6ruh4",
                                                    "parent_id": "t1_ia6m4du",
                                                    "score": 0,
                                                    "created_utc": 1653656196.0,
                                                    "replies": [
                                                        {
                                                            "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                                                            "author": "osestella",
                                                            "id": "ia6tlyr",
                                                            "parent_id": "t1_ia6ruh4",
                                                            "score": 3,
                                                            "created_utc": 1653657082.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "She said so in the comments.",
                                            "author": "osestella",
                                            "id": "ia6lqod",
                                            "parent_id": "t1_ia6l3x1",
                                            "score": 3,
                                            "created_utc": 1653652766.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes, if he didn't like it then he should either leave or wear a condom, not coerce her into it.\nTaking advantage of people in financial distress, or otherwise less powerful than you, to coerce them into sex they don't want is abusive behaviour.",
                            "author": "OneCanToucanThreeCan",
                            "id": "ia6dbhz",
                            "parent_id": "t1_ia61ovt",
                            "score": 5,
                            "created_utc": 1653646855.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I made it clear that we were supposed to use a condom he agreed but when we met he was so defensive about it",
            "author": null,
            "id": "ia618y2",
            "parent_id": "t1_ia5g2u7",
            "score": 2,
            "created_utc": 1653636120.0,
            "replies": []
        },
        {
            "body": "This is real life, not a true crime TV show, if the OP does this there are all sorts of retaliation tactics he can use which you are not mentioning here.",
            "author": "Severe_Middle7989",
            "id": "ia7d272",
            "parent_id": "t1_ia6bp4o",
            "score": 4,
            "created_utc": 1653665632.0,
            "replies": [
                {
                    "body": "Oh? Feel free to point them out.",
                    "author": "Additional-Ability99",
                    "id": "ia7gd0d",
                    "parent_id": "t1_ia7d272",
                    "score": 1,
                    "created_utc": 1653666986.0,
                    "replies": []
                },
                {
                    "body": "I might be wrong, but I'm pretty sure that pinning someone down and fucking them after they tell you to stop, counts as rape.\n\nAnd I'm pretty sure that apologizing for doing so counts as an admission of the act.\n\nShe doesn't have to tell him she's reporting him.\n\nI'm also pretty sure that if he was that forceful and it hurt, she likely has bruising on her arms that pictures can be taken of, and which could be used as evidence in court",
                    "author": "Additional-Ability99",
                    "id": "ia7ivr0",
                    "parent_id": "t1_ia7d272",
                    "score": 0,
                    "created_utc": 1653668011.0,
                    "replies": []
                },
                {
                    "body": "But this is literally what a sexual assault detective would do, try and get a confession in text.",
                    "author": "double-weird-3-0",
                    "id": "ia7jw6p",
                    "parent_id": "t1_ia7d272",
                    "score": 1,
                    "created_utc": 1653668424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is incorrect. She clearly describes telling him to stop and him refusing. That is an assault in every jurisdiction I know of.",
            "author": "Doramang",
            "id": "ia5ovkq",
            "parent_id": "t1_ia5empk",
            "score": 11,
            "created_utc": 1653626963.0,
            "replies": []
        },
        {
            "body": "Victim blaming always goes well on rape threads.",
            "author": "Pacwing",
            "id": "ia5g69q",
            "parent_id": "t1_ia5empk",
            "score": 11,
            "created_utc": 1653621944.0,
            "replies": []
        },
        {
            "body": "WHAT?\n\nShe said “stop” and he kept going. This is not ok.\n\nAnd whenever I have unprotected sex I ask the guy to pull out and not come inside. Coming inside without permission is not ok",
            "author": "osestella",
            "id": "ia6cxlc",
            "parent_id": "t1_ia5empk",
            "score": 5,
            "created_utc": 1653646535.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia5g8su",
            "parent_id": "t1_ia5empk",
            "score": -12,
            "created_utc": 1653621982.0,
            "replies": [
                {
                    "body": "If a woman says “stop” during sex and you don’t, you assaulted her. If you don’t know that already, then I’m worried for the women you sleep with.\n\nAnd if you do know that already, you should have seen she said that happened.",
                    "author": "Doramang",
                    "id": "ia6dlnb",
                    "parent_id": "t1_ia5g8su",
                    "score": 4,
                    "created_utc": 1653647084.0,
                    "replies": []
                },
                {
                    "body": "If it’s fake indeed nobody will ever know and accusing people is not going to change anything and is not doing any good to anyone. On the other hand, If the post is not fake you are hurting a innocent person who is traumatized. \nThe “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nHer story is plausible and holds important messages. Many woman put themselves in dangerous situations for financial gain. And man who try to push and negotiate sexual boundaries are potentially dangerous. A good sexual partner (man or woman) prioritizes their partners well being and comfort over their own individual pleasure. Attempts to bribe someone into sexual activities are not a good sign.\n\nThere are real people behind the computer screen. Please be responsible.",
                    "author": "osestella",
                    "id": "ia6k9jq",
                    "parent_id": "t1_ia5g8su",
                    "score": 5,
                    "created_utc": 1653651843.0,
                    "replies": []
                },
                {
                    "body": "What are you talking about? There is nothing wrong with OP post.\nThe situation is clear. She told him to stop and he kept going’s Any other information is irrelevant to the case",
                    "author": "osestella",
                    "id": "ia6d3e2",
                    "parent_id": "t1_ia5g8su",
                    "score": 2,
                    "created_utc": 1653646673.0,
                    "replies": [
                        {
                            "body": "They think the post is fake.  There's not an insignificant portion of the sub that are paranoid about people posting fake stories to 'change public perceptions'.  Why they choose to engage on the internet in any capacity, I have no idea.  That type of shit is everywhere and has always been the case.\n\nPicking and choosing random posts and users to accuse is some grandpa fox news paranoia shit.  It makes people feel smart when they 'figured out the dirty secret no one else can see.'",
                            "author": "Pacwing",
                            "id": "ia6i0iu",
                            "parent_id": "t1_ia6d3e2",
                            "score": 5,
                            "created_utc": 1653650345.0,
                            "replies": [
                                {
                                    "body": "Why would they think this particular post is fake? Even if they think is fake I feel that of all post people should just leave this alone. If it’s fake indeed nobody will ever know and accusing people is not going to change anything.\n\nIf the post is not fake they are hurting a innocent person who is traumatized. The “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nI cant understand how people can be so mean and cold. \n\nWho would benefit from changing the public’s perception? How does anyone benefit from a post life this? It doesn’t benefit SB’s or SD’s? What is the moral of the story? SD’s who offer triple ppm are potentially dangerous? This is so stupid.\n\nI’ve been acuses of faking a post once and I was like…… I even send people the private message exchange to prove it was real.\nEven if this particular post is not real the history is very plausible and akin to many that happen.\n\nPushy man and man who try to negotiate boundaries are boundaries pushers and are potentially dangerous. Girls get tempted to overlook security for financial gain. This is also not a great idea.\nReal or fake the message behind this post is accurate",
                                    "author": "osestella",
                                    "id": "ia6jd7r",
                                    "parent_id": "t1_ia6i0iu",
                                    "score": 6,
                                    "created_utc": 1653651263.0,
                                    "replies": [
                                        {
                                            "body": "Because they think women are liars. It is mean and cold, you’re not wrong.",
                                            "author": "Doramang",
                                            "id": "ia6xi62",
                                            "parent_id": "t1_ia6jd7r",
                                            "score": 5,
                                            "created_utc": 1653658953.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did we read the same story? What do you mean “and never give in if you really don’t want it in are in pain”? \n\nThe only reason she gave up was because she was in pain and tired of fighting because he was ASSAULTING her. Why are you insinuating that it’s what she wanted ? You’re disgusting",
            "author": "1inquisitiveminded",
            "id": "ia6khjo",
            "parent_id": "t1_ia5i2i7",
            "score": 5,
            "created_utc": 1653651985.0,
            "replies": []
        },
        {
            "body": "A rape victim is never to be blamed.",
            "author": null,
            "id": "ia5mlp8",
            "parent_id": "t1_ia5i2i7",
            "score": 14,
            "created_utc": 1653625556.0,
            "replies": [
                {
                    "body": "Yes I understand. I may have been quick in my comment but my intention is to instill a learning lesson. She should absolutely still take action as a victim and report it etc. \n\nBring on the downvotes.",
                    "author": "femuserhere",
                    "id": "ia5oihz",
                    "parent_id": "t1_ia5mlp8",
                    "score": -16,
                    "created_utc": 1653626734.0,
                    "replies": [
                        {
                            "body": "Sure one should always be cautious but honestly it can happen anywhere. And it doesn’t matter. It’s the rapists fault, always.",
                            "author": null,
                            "id": "ia5p6nx",
                            "parent_id": "t1_ia5oihz",
                            "score": 9,
                            "created_utc": 1653627160.0,
                            "replies": []
                        },
                        {
                            "body": "Instill a learning lesson?? For a rape victim?? Fuck outta here shes been through enough what learning lesson?",
                            "author": "AstroP23",
                            "id": "ia751gm",
                            "parent_id": "t1_ia5oihz",
                            "score": 5,
                            "created_utc": 1653662308.0,
                            "replies": []
                        },
                        {
                            "body": "\"My intent is to instill a learning lesson\" - how condescending and unhelpful. Pretty sure she learned from this experience without your help, smartass.",
                            "author": "worship_me_or_die",
                            "id": "ia5yprp",
                            "parent_id": "t1_ia5oihz",
                            "score": 11,
                            "created_utc": 1653634009.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, when I was raped and had questions I made a sock to do so anonymously and avoid getting creepy comments and having it linked to my main forevermore. I’d imagine other women do similarly. \n\nWhat is your argument here? That women aren’t assaulted in the bowl and there are no dangers in sugar dating?",
            "author": "SBerryTrifle",
            "id": "ia7fjla",
            "parent_id": "t1_ia73lvo",
            "score": 4,
            "created_utc": 1653666653.0,
            "replies": []
        },
        {
            "body": "It’s a throwaway…. are you not familiar? They are used for anonymity. This may be a very active user of SLF who wants to share but doesn’t want it following her. Hope that helps!",
            "author": "Azucarbabby",
            "id": "ia7hni2",
            "parent_id": "t1_ia73lvo",
            "score": 3,
            "created_utc": 1653667508.0,
            "replies": []
        },
        {
            "body": "You have no understanding of how cases like this actually play out in the court room. You are assuming that the SD will put up zero defense, and everything will work perfectly for the SB. Your advice is erroneous & misleading. Go read case history for scenarios like this and you will see how this plays out in reality.",
            "author": "Severe_Middle7989",
            "id": "ia7ds1i",
            "parent_id": "t1_ia72rhc",
            "score": 3,
            "created_utc": 1653665928.0,
            "replies": [
                {
                    "body": "The rapist would be strongly incentivized to never let this case get anywhere near a courtroom.\n\nA guy like this will have a string of victims...OP would only have to find one which isn't that hard with this thing called the internet.",
                    "author": "double-weird-3-0",
                    "id": "ia7kt7j",
                    "parent_id": "t1_ia7ds1i",
                    "score": 1,
                    "created_utc": 1653668794.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You sure are fussed by clearly impotent anger directed at rapists, huh?",
            "author": "SBerryTrifle",
            "id": "ia7q9nx",
            "parent_id": "t1_ia7n5r1",
            "score": 1,
            "created_utc": 1653671025.0,
            "replies": [
                {
                    "body": "Yes, mob justice is impotent.\n\nIt does nothing for the victim.\n\nEspecially since no one approves of rapists (which would mean no one would approve of a rapist raping a rapist).",
                    "author": "JohnnyKemmer009",
                    "id": "ia7qjd6",
                    "parent_id": "t1_ia7q9nx",
                    "score": -1,
                    "created_utc": 1653671135.0,
                    "replies": [
                        {
                            "body": "First off there are not a lot of responses like that, there is only the one and it’s not a threat but a statement of what he feels rapists deserve. The majority of comments are offering support and a good additional chunk are victim blaming or giving sort of clueless advice. I’d feel differently if there were an actual angry mob outside of the rapist’s door but no one has yet been harmed by the outrage of internet users with no idea who they are. In fact, chances are so laughably higher that he will face no consequences whatsoever than that he will face excessive consequences that your concern for him seems absurd. There are men who use SA specifically to harm women because they know the already low probability of facing consequences for assault is lesser still meeting a woman from there.",
                            "author": "SBerryTrifle",
                            "id": "ia7xhxl",
                            "parent_id": "t1_ia7qjd6",
                            "score": 2,
                            "created_utc": 1653674056.0,
                            "replies": [
                                {
                                    "body": "There are plenty on this rape report thread including other rape report threads. My response did not mention only this post. You are being pedantic.\n\nHelping victims with detailed advice is not \"victim blaming\".\n\n\"There are men who use SA specifically to harm women...\"  \nYou don't know that. Nor that it is different from other dating venues were it true. And if that were true in any significant degree, women don't seem to stop seeking men out out of that fear. Women should just stop dating men period in that case.\n\nMine is a rational response to help both male and female victims. You are projecting some other purpose onto me.",
                                    "author": "JohnnyKemmer009",
                                    "id": "ia7ybnb",
                                    "parent_id": "t1_ia7xhxl",
                                    "score": 0,
                                    "created_utc": 1653674409.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously??",
            "author": "JSBelle",
            "id": "ia6lboz",
            "parent_id": "t1_ia613j0",
            "score": 5,
            "created_utc": 1653652509.0,
            "replies": []
        },
        {
            "body": "🙄",
            "author": "osestella",
            "id": "ia6d784",
            "parent_id": "t1_ia613j0",
            "score": 4,
            "created_utc": 1653646761.0,
            "replies": []
        },
        {
            "body": "Yeah, it's also not a tax forum. Or a medical forum. Yet...",
            "author": "Y_4Z44",
            "id": "ia7oyf5",
            "parent_id": "t1_ia7mm3d",
            "score": 7,
            "created_utc": 1653670488.0,
            "replies": [
                {
                    "body": "True. It is the Internet. All information, including this sentence, needs to be independently verified.",
                    "author": "JohnnyKemmer009",
                    "id": "ia7p4wv",
                    "parent_id": "t1_ia7oyf5",
                    "score": 1,
                    "created_utc": 1653670562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a ridiculous assumption. Trying to get justice is Always better than doing nothing. The police can do their job and she needs support in pursuing justice, not this negating.",
            "author": "MissRoyalBrush",
            "id": "ia8eg87",
            "parent_id": "t1_ia6csln",
            "score": 0,
            "created_utc": 1653681557.0,
            "replies": [
                {
                    "body": "As someone who was raped and beaten by my stbx husband, who has evidence and photos and even texts where he admitted to it all: nothing is better than what you think justice will entitle you to. Because it turned into nothing but more trauma to me.\n\nShe’s only 20. She’s in college. She is a sex worker. She was violently raped. Telling her to carry the weight of inviting more strangers and trauma into her situation is bullshit. There are other groups that she can get into contact with via RAINN who can discuss her options with her in a way that gives her time to think and heal. Her mental and physical well-being is the priority, not your after school special version of justice.",
                    "author": "anneofgreennipples",
                    "id": "ia8fuvm",
                    "parent_id": "t1_ia8eg87",
                    "score": 10,
                    "created_utc": 1653682186.0,
                    "replies": []
                },
                {
                    "body": "Where do you get off telling victims what to do and how to act? Have you been through this? Do you know how traumatic and demanding it can be? If she chooses to then I wish her luck. But your faith in the police to do the right thing is sadly misplaced. \nMore important is knowing there are support services that will prioritise her wellbeing and assist if she needs it.",
                    "author": "OneCanToucanThreeCan",
                    "id": "ia94q64",
                    "parent_id": "t1_ia8eg87",
                    "score": 4,
                    "created_utc": 1653694177.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for saying this. I reported and this happened to me. They just made fun of me. He got to keep the video. Racism and sexism from my police department. He was white, so he got away with it.",
            "author": "truthbetold05",
            "id": "ic3wv11",
            "parent_id": "t1_ia6csln",
            "score": 1,
            "created_utc": 1655054902.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia7e0jc",
            "parent_id": "t1_ia74tbj",
            "score": 1,
            "created_utc": 1653666025.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ia7ortg",
                    "parent_id": "t1_ia7e0jc",
                    "score": 6,
                    "created_utc": 1653670413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're wrong and aside from that No-one deserves to be raped, including prostitutes. If the police do their job there are ways to find him.",
            "author": "MissRoyalBrush",
            "id": "ia8drhq",
            "parent_id": "t1_ia74tbj",
            "score": 1,
            "created_utc": 1653681241.0,
            "replies": [
                {
                    "body": "\"If police officer do their jobs\" Oh yes because police officer are known for doing their job often pr most of the time",
                    "author": "WiseRequirement9277",
                    "id": "ia8u8l6",
                    "parent_id": "t1_ia8drhq",
                    "score": 2,
                    "created_utc": 1653688962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He *could* simply say she was willing. But that doesn't mean he will. Especially if he thinks he was justified. He very well likely try to convince the officers that he was in the right. That's why cops do interrogations.\n\nYou are looking at this through the prism of someone who knows that was rape and knows it was wrong. Probably because you are someone who knows that was rape and knows rape is wrong. But he probably isn't that kind of person.",
            "author": "NinCarolina",
            "id": "ia7l754",
            "parent_id": "t1_ia62m94",
            "score": 3,
            "created_utc": 1653668949.0,
            "replies": []
        },
        {
            "body": "Unfortunately so",
            "author": "Chaxxa4",
            "id": "ia720yp",
            "parent_id": "t1_ia62m94",
            "score": 1,
            "created_utc": 1653661011.0,
            "replies": []
        },
        {
            "body": "Agree. It’s a very unfortunate, horrible and difficult situation. Best of luck to the OP to heal and move on from this. (I know this sounds simplistic but my comment is meant in a heartfelt way.)",
            "author": "SDchat",
            "id": "ia7lzwl",
            "parent_id": "t1_ia62m94",
            "score": 0,
            "created_utc": 1653669277.0,
            "replies": []
        },
        {
            "body": "Alllll of this! Thank you for being a reasonable & decent human being. Cant believe the rape supporters on this thread smh. \n\nBut, I wouldn't text so much detail, I would just say in her own words 'I dont want to see you again, I'm hurting, I asked you to stop but you didnt so I'm still really sore, it wasnt fun for me.' Dont go accusatory. Leave it open for him to respond to get the confession. IF the police can set something up with her so she can get the confession then agree to meet and he unknowingly walks in and police are there to arrest him. \n\nHe knows what he did was wrong. This is where these cowards tend to play dumb. He just didnt care that he was hurting her.",
            "author": "MissRoyalBrush",
            "id": "ia8getz",
            "parent_id": "t1_ia7qwkr",
            "score": 6,
            "created_utc": 1653682442.0,
            "replies": [
                {
                    "body": "I think a realistic view is important and it should be up to the person who experienced the abuse to decide what they want to do. You’re reaching by calling them rape apologists. I can’t take you seriously if that’s what you actually think. It’s so deluded. Talk about over correcting or all or nothing thinking.",
                    "author": "truthbetold05",
                    "id": "ic3ym9h",
                    "parent_id": "t1_ia8getz",
                    "score": 0,
                    "created_utc": 1655055718.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m really trying to find the courage to report this. I’m just so scared. I’m all alone in all this, i don’t have no one to support me. I don’t want to put myself at risk and get reported for prostitution in the process.",
            "author": null,
            "id": "ia8mope",
            "parent_id": "t1_ia7qwkr",
            "score": 5,
            "created_utc": 1653685340.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia9btvp",
                    "parent_id": "t1_ia8mope",
                    "score": 2,
                    "created_utc": 1653697879.0,
                    "replies": [
                        {
                            "body": "There’s so much wrong with what you said here. She should be supported, but you’re a bigot. Do sex workers not deserve support then? What are you even saying",
                            "author": "truthbetold05",
                            "id": "ic3yz5g",
                            "parent_id": "t1_ia9btvp",
                            "score": 0,
                            "created_utc": 1655055882.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rapists get away because the system is built to favor them. Sex work is also criminalized. What world are you living in!!? Putting all of this on people who have experienced sexual violence at the hands of a system that is set up to victimize them from birth by indoctrination of gender norms and social privileges. You need to sit down and shut up. You can support people if they wanna report but NEVEr blame them for their abusers running free when the system is set up to work that way. Must be nice living under that rock.",
            "author": "truthbetold05",
            "id": "ic3xte2",
            "parent_id": "t1_ia7qwkr",
            "score": 2,
            "created_utc": 1655055343.0,
            "replies": []
        },
        {
            "body": "I reported 3 different rapes I had and nothing ever happened. I didn’t even get resources from them. I think it’s up to the person if they want to report or not.",
            "author": "truthbetold05",
            "id": "ic3x8ll",
            "parent_id": "t1_ia7qwkr",
            "score": 0,
            "created_utc": 1655055080.0,
            "replies": []
        },
        {
            "body": "No, calling the police will force them to do their job. Not calling will leave a string of future victims. If the police are not adequately investigating she can file a lawsuit. Things wont change when we do nothing to change it. Plus if hes already in their system they will be more likely to pursue. With reporting, it is documented and gives more evidence if/when theres another victim. Always report.",
            "author": "MissRoyalBrush",
            "id": "ia8f3um",
            "parent_id": "t1_ia7koo9",
            "score": 0,
            "created_utc": 1653681848.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia883b8",
            "parent_id": "t1_ia7ymq2",
            "score": -1,
            "created_utc": 1653678696.0,
            "replies": [
                {
                    "body": "That’s horrible, and still does not give him the right to tell another victim how to deal with their own assault. Nor does it give him the right to wish rape on others.",
                    "author": "Lipstickluna97",
                    "id": "ia89drp",
                    "parent_id": "t1_ia883b8",
                    "score": 3,
                    "created_utc": 1653679271.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia8adu9",
                            "parent_id": "t1_ia89drp",
                            "score": -1,
                            "created_utc": 1653679715.0,
                            "replies": [
                                {
                                    "body": "Why are we playing the oppression Olympics? Reporting assault to cops in the United States ESPECIALLY as any type of SWer (and that includes SB) is hugely futile. I’m not doubling down on a damn thing, I said what I said. If he understands how traumatic attempting to report SA is, then there is no reason to pressure another surviver into doing so.\n\nAnd with all those maybes it seems that you’re doing a lot more assuming than I am.",
                                    "author": "Lipstickluna97",
                                    "id": "ia8aqu7",
                                    "parent_id": "t1_ia8adu9",
                                    "score": 3,
                                    "created_utc": 1653679879.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ia8c6k3",
                                            "parent_id": "t1_ia8aqu7",
                                            "score": -1,
                                            "created_utc": 1653680527.0,
                                            "replies": [
                                                {
                                                    "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                                                    "author": "Lipstickluna97",
                                                    "id": "ia8dbjs",
                                                    "parent_id": "t1_ia8c6k3",
                                                    "score": 3,
                                                    "created_utc": 1653681040.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia8blzi",
                            "parent_id": "t1_ia89drp",
                            "score": -1,
                            "created_utc": 1653680270.0,
                            "replies": [
                                {
                                    "body": "Good for you, but you’re still not a sexworker, and was not at risk for being arrested for reporting. It’s wrong to pressure victims into reporting. That’s rape crisis counseling 101. You had a terrible experience, and that really sucks. I’m not going to give you my entire life story, but I’ve been in OPs shoes, and I wouldn’t wish it on anyone.",
                                    "author": "Lipstickluna97",
                                    "id": "ia8c6yk",
                                    "parent_id": "t1_ia8blzi",
                                    "score": 4,
                                    "created_utc": 1653680532.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ia8cj6b",
                                            "parent_id": "t1_ia8c6yk",
                                            "score": -1,
                                            "created_utc": 1653680685.0,
                                            "replies": [
                                                {
                                                    "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                                                    "author": "Lipstickluna97",
                                                    "id": "ia8d0tf",
                                                    "parent_id": "t1_ia8cj6b",
                                                    "score": 2,
                                                    "created_utc": 1653680907.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "True, I had a girl friend (not girlfriend) that something like this happened to. She came to me to help pick up the pieces. Her conclusion was the same. Unfortunately she felt it would be worse to report it.\n\nShe contemplated having a few big guy friends to go and “take care of the situation“ but decided against it.",
            "author": "SDchat",
            "id": "ia7n3z0",
            "parent_id": "t1_ia7clk9",
            "score": 4,
            "created_utc": 1653669734.0,
            "replies": [
                {
                    "body": "The last sounds like a good plan to me. I am, obviously, not advocating anyone do anything illegal.",
                    "author": "AShatteredKing",
                    "id": "ia7rqyc",
                    "parent_id": "t1_ia7n3z0",
                    "score": 1,
                    "created_utc": 1653671638.0,
                    "replies": [
                        {
                            "body": "The problem is that there is no guarantee that the ”problem” will not come back in revenge.",
                            "author": "SDchat",
                            "id": "ia7smar",
                            "parent_id": "t1_ia7rqyc",
                            "score": 0,
                            "created_utc": 1653672001.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It won't be changed because we can't convict the man on a baseless accusation. It's a shitty situation but one that doesn't seem to have a good solution. \n\nThere won't be any lesson learned from him except maybe to embolden him. He won't be arrested. He likely won't even be questioned. There is no evidence of a rape. None. Then, even if he is questioned, he simply shows that it was a consensual arrangement, that she met him with the intent of having sex and did so willingly, likely with vigorous prior consent, and with a history of consensual sex. Sorry, but the idea that he will suffer any consequences from this is simply not based in reality.",
            "author": "AShatteredKing",
            "id": "ia67ter",
            "parent_id": "t1_ia66f2h",
            "score": 3,
            "created_utc": 1653642003.0,
            "replies": [
                {
                    "body": "Nope, that's not true.  If OP brings a victims advocate and or a lawyer the police will reluctantly do their jobs.  They might be incompetent and mysogynistic but they are also civil servants.\n\nThis was not a consensual arrangement.  The facts according to the law:  OP is a victim, she was raped by a john after revoking consent.  OP cannot be charged with prostitution under these conditions.\n\nGuys like this have a trail of victims, one close encounter with the police and the the house of cards could come tumbling down...he'll be highly motivated to settle.",
                    "author": "double-weird-3-0",
                    "id": "ia7j6ka",
                    "parent_id": "t1_ia67ter",
                    "score": 1,
                    "created_utc": 1653668135.0,
                    "replies": [
                        {
                            "body": "Show this to be the case please because everything I've read says it's not. \n\n[https://en.wikipedia.org/wiki/Rape\\_in\\_the\\_United\\_States#:\\~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest](https://en.wikipedia.org/wiki/Rape_in_the_United_States#:~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest).\n\nThis states about 1/3 of rapes reported to police lead to an arrest. \n\nThey have had repeated sexual encounters. They have an arrangement to have sex. She gave consent to have sex. She received money for the sex. She was not under in the influence or otherwise unable to give consent. \n\nYes, he raped her. No, that cannot be demonstrated to be the case here without the guy himself directly stating he knew she withdrew consent and continued anyways. This is an impossible case. The police know this. \n\nHell, until a couple years ago, there were states that didn't even recognize that a woman could be raped after giving consent. California had to explicitly state that consent must be ongoing because people would argue over this. \n\nDo you have any examples of a woman withdrawing consent during sex after repeated past encounters and the woman received payment for the encounter and the man was arrested for it?",
                            "author": "AShatteredKing",
                            "id": "iaa4xbz",
                            "parent_id": "t1_ia7j6ka",
                            "score": 1,
                            "created_utc": 1653714329.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please do not let some of the comments here get to you. You were the victim of a crime and it is not your fault, do not blame yourself.\n\nSome members of this forum don't seem to understand that a person has a right to revoke consent at any time even during intercourse.\n\nI hope that you are also able to reach out for support in the real world. Sending you a gentle hug.\n\nEdited to add: someone had mentioned the \"auntie network\" but linked to the wrong sub so here is the link\n\n[https://www.reddit.com/r/auntienetwork/](https://www.reddit.com/r/auntienetwork/)",
            "author": "LightOLove",
            "id": "ia6v5dm",
            "parent_id": "t1_ia6f2om",
            "score": 7,
            "created_utc": 1653657826.0,
            "replies": []
        },
        {
            "body": "SD here. No, he shouldn’t have raped you. I could never imagine treating my SB like this. This is a terrible human being who didn’t care about you at all, only about himself. \n\nI’m so sorry this happened to you. Take some time and heal. Don’t let it turn you off from sugaring, as it promise it’s possible to have amazing, safe arrangements. But the respect has to be mutual, and neither party can compromise that respect for the sake of money (for the SB) or sex (for the SD).",
            "author": "freeewillieee",
            "id": "iahs2xj",
            "parent_id": "t1_ia6f2om",
            "score": 1,
            "created_utc": 1653874036.0,
            "replies": []
        },
        {
            "body": "How is that a warning sign?\nHe gave her the choice and she chose the 3 times higher PPM. \n\nWhat was he supposed to do? Walk away immediately without seeing if they can come to the same place?",
            "author": "YlangScent",
            "id": "ia61ovt",
            "parent_id": "t1_ia5ub86",
            "score": -4,
            "created_utc": 1653636510.0,
            "replies": [
                {
                    "body": "Haggling someone about using protection and using money as a coercion tactic is a huge red flag",
                    "author": "c0rnstarr",
                    "id": "ia6pqc9",
                    "parent_id": "t1_ia61ovt",
                    "score": 9,
                    "created_utc": 1653655071.0,
                    "replies": [
                        {
                            "body": "He didn't use money as a coercion tactic before he raped her. He simply offered 3 times more than others to begin with. There is no flag to see here and it's toxic to act like OP should have seen it coming or any other SB can learn from this.\n\nThe guy is a rapist pos, but I disagree greatly that he showed any red flags beforehand.",
                            "author": "YlangScent",
                            "id": "ia6s7vi",
                            "parent_id": "t1_ia6pqc9",
                            "score": -1,
                            "created_utc": 1653656388.0,
                            "replies": [
                                {
                                    "body": "Literally not what I’m saying??\n\nI’m not blaming OP for ANYTHING. I’m saying that  it is a red flag when “he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me.” It’s something for other SBs to be mindful of bc that is also quite common",
                                    "author": "c0rnstarr",
                                    "id": "ia6xwwe",
                                    "parent_id": "t1_ia6s7vi",
                                    "score": 5,
                                    "created_utc": 1653659142.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It’s a warning sign because he previously agree to wearing condoms to lure her in.\n\nHe was supposed not to be pushy and manipulate a woman that might be in a place of financial vulnerability to do something she already stated she is. it comfortable.\nSex is not a negotiation table. If he/she is not comfortable then the other part needs to back away and respect without insisting \n\nSo yes, he was supposed to walk away, or rather, never go meet her on the first place",
                    "author": "osestella",
                    "id": "ia6cqbz",
                    "parent_id": "t1_ia61ovt",
                    "score": 6,
                    "created_utc": 1653646365.0,
                    "replies": [
                        {
                            "body": ">he previously agree to wearing condoms to lure her in\n\nWhat? Where in her post does it say anything like that?\nShe says:\n\n>The first time he didn’t want to wear a condom\n\nSo it was clear from the start?\nYou're adding details that she definitely did not write.",
                            "author": "YlangScent",
                            "id": "ia6l3x1",
                            "parent_id": "t1_ia6cqbz",
                            "score": -2,
                            "created_utc": 1653652374.0,
                            "replies": [
                                {
                                    "body": "But if someone says “no” for something sexual the appropriate response is “ok”. Then you can walk away or stay and agree with the other person boundaries. \nTrying to convince someone to overlook their own boundaries is not ok.",
                                    "author": "osestella",
                                    "id": "ia6m4du",
                                    "parent_id": "t1_ia6l3x1",
                                    "score": 5,
                                    "created_utc": 1653652994.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
                                            "author": "YlangScent",
                                            "id": "ia6ruh4",
                                            "parent_id": "t1_ia6m4du",
                                            "score": 0,
                                            "created_utc": 1653656196.0,
                                            "replies": [
                                                {
                                                    "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                                                    "author": "osestella",
                                                    "id": "ia6tlyr",
                                                    "parent_id": "t1_ia6ruh4",
                                                    "score": 3,
                                                    "created_utc": 1653657082.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "She said so in the comments.",
                                    "author": "osestella",
                                    "id": "ia6lqod",
                                    "parent_id": "t1_ia6l3x1",
                                    "score": 3,
                                    "created_utc": 1653652766.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, if he didn't like it then he should either leave or wear a condom, not coerce her into it.\nTaking advantage of people in financial distress, or otherwise less powerful than you, to coerce them into sex they don't want is abusive behaviour.",
                    "author": "OneCanToucanThreeCan",
                    "id": "ia6dbhz",
                    "parent_id": "t1_ia61ovt",
                    "score": 5,
                    "created_utc": 1653646855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh? Feel free to point them out.",
            "author": "Additional-Ability99",
            "id": "ia7gd0d",
            "parent_id": "t1_ia7d272",
            "score": 1,
            "created_utc": 1653666986.0,
            "replies": []
        },
        {
            "body": "I might be wrong, but I'm pretty sure that pinning someone down and fucking them after they tell you to stop, counts as rape.\n\nAnd I'm pretty sure that apologizing for doing so counts as an admission of the act.\n\nShe doesn't have to tell him she's reporting him.\n\nI'm also pretty sure that if he was that forceful and it hurt, she likely has bruising on her arms that pictures can be taken of, and which could be used as evidence in court",
            "author": "Additional-Ability99",
            "id": "ia7ivr0",
            "parent_id": "t1_ia7d272",
            "score": 0,
            "created_utc": 1653668011.0,
            "replies": []
        },
        {
            "body": "But this is literally what a sexual assault detective would do, try and get a confession in text.",
            "author": "double-weird-3-0",
            "id": "ia7jw6p",
            "parent_id": "t1_ia7d272",
            "score": 1,
            "created_utc": 1653668424.0,
            "replies": []
        },
        {
            "body": "If a woman says “stop” during sex and you don’t, you assaulted her. If you don’t know that already, then I’m worried for the women you sleep with.\n\nAnd if you do know that already, you should have seen she said that happened.",
            "author": "Doramang",
            "id": "ia6dlnb",
            "parent_id": "t1_ia5g8su",
            "score": 4,
            "created_utc": 1653647084.0,
            "replies": []
        },
        {
            "body": "If it’s fake indeed nobody will ever know and accusing people is not going to change anything and is not doing any good to anyone. On the other hand, If the post is not fake you are hurting a innocent person who is traumatized. \nThe “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nHer story is plausible and holds important messages. Many woman put themselves in dangerous situations for financial gain. And man who try to push and negotiate sexual boundaries are potentially dangerous. A good sexual partner (man or woman) prioritizes their partners well being and comfort over their own individual pleasure. Attempts to bribe someone into sexual activities are not a good sign.\n\nThere are real people behind the computer screen. Please be responsible.",
            "author": "osestella",
            "id": "ia6k9jq",
            "parent_id": "t1_ia5g8su",
            "score": 5,
            "created_utc": 1653651843.0,
            "replies": []
        },
        {
            "body": "What are you talking about? There is nothing wrong with OP post.\nThe situation is clear. She told him to stop and he kept going’s Any other information is irrelevant to the case",
            "author": "osestella",
            "id": "ia6d3e2",
            "parent_id": "t1_ia5g8su",
            "score": 2,
            "created_utc": 1653646673.0,
            "replies": [
                {
                    "body": "They think the post is fake.  There's not an insignificant portion of the sub that are paranoid about people posting fake stories to 'change public perceptions'.  Why they choose to engage on the internet in any capacity, I have no idea.  That type of shit is everywhere and has always been the case.\n\nPicking and choosing random posts and users to accuse is some grandpa fox news paranoia shit.  It makes people feel smart when they 'figured out the dirty secret no one else can see.'",
                    "author": "Pacwing",
                    "id": "ia6i0iu",
                    "parent_id": "t1_ia6d3e2",
                    "score": 5,
                    "created_utc": 1653650345.0,
                    "replies": [
                        {
                            "body": "Why would they think this particular post is fake? Even if they think is fake I feel that of all post people should just leave this alone. If it’s fake indeed nobody will ever know and accusing people is not going to change anything.\n\nIf the post is not fake they are hurting a innocent person who is traumatized. The “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nI cant understand how people can be so mean and cold. \n\nWho would benefit from changing the public’s perception? How does anyone benefit from a post life this? It doesn’t benefit SB’s or SD’s? What is the moral of the story? SD’s who offer triple ppm are potentially dangerous? This is so stupid.\n\nI’ve been acuses of faking a post once and I was like…… I even send people the private message exchange to prove it was real.\nEven if this particular post is not real the history is very plausible and akin to many that happen.\n\nPushy man and man who try to negotiate boundaries are boundaries pushers and are potentially dangerous. Girls get tempted to overlook security for financial gain. This is also not a great idea.\nReal or fake the message behind this post is accurate",
                            "author": "osestella",
                            "id": "ia6jd7r",
                            "parent_id": "t1_ia6i0iu",
                            "score": 6,
                            "created_utc": 1653651263.0,
                            "replies": [
                                {
                                    "body": "Because they think women are liars. It is mean and cold, you’re not wrong.",
                                    "author": "Doramang",
                                    "id": "ia6xi62",
                                    "parent_id": "t1_ia6jd7r",
                                    "score": 5,
                                    "created_utc": 1653658953.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes I understand. I may have been quick in my comment but my intention is to instill a learning lesson. She should absolutely still take action as a victim and report it etc. \n\nBring on the downvotes.",
            "author": "femuserhere",
            "id": "ia5oihz",
            "parent_id": "t1_ia5mlp8",
            "score": -16,
            "created_utc": 1653626734.0,
            "replies": [
                {
                    "body": "Sure one should always be cautious but honestly it can happen anywhere. And it doesn’t matter. It’s the rapists fault, always.",
                    "author": null,
                    "id": "ia5p6nx",
                    "parent_id": "t1_ia5oihz",
                    "score": 9,
                    "created_utc": 1653627160.0,
                    "replies": []
                },
                {
                    "body": "Instill a learning lesson?? For a rape victim?? Fuck outta here shes been through enough what learning lesson?",
                    "author": "AstroP23",
                    "id": "ia751gm",
                    "parent_id": "t1_ia5oihz",
                    "score": 5,
                    "created_utc": 1653662308.0,
                    "replies": []
                },
                {
                    "body": "\"My intent is to instill a learning lesson\" - how condescending and unhelpful. Pretty sure she learned from this experience without your help, smartass.",
                    "author": "worship_me_or_die",
                    "id": "ia5yprp",
                    "parent_id": "t1_ia5oihz",
                    "score": 11,
                    "created_utc": 1653634009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The rapist would be strongly incentivized to never let this case get anywhere near a courtroom.\n\nA guy like this will have a string of victims...OP would only have to find one which isn't that hard with this thing called the internet.",
            "author": "double-weird-3-0",
            "id": "ia7kt7j",
            "parent_id": "t1_ia7ds1i",
            "score": 1,
            "created_utc": 1653668794.0,
            "replies": []
        },
        {
            "body": "Yes, mob justice is impotent.\n\nIt does nothing for the victim.\n\nEspecially since no one approves of rapists (which would mean no one would approve of a rapist raping a rapist).",
            "author": "JohnnyKemmer009",
            "id": "ia7qjd6",
            "parent_id": "t1_ia7q9nx",
            "score": -1,
            "created_utc": 1653671135.0,
            "replies": [
                {
                    "body": "First off there are not a lot of responses like that, there is only the one and it’s not a threat but a statement of what he feels rapists deserve. The majority of comments are offering support and a good additional chunk are victim blaming or giving sort of clueless advice. I’d feel differently if there were an actual angry mob outside of the rapist’s door but no one has yet been harmed by the outrage of internet users with no idea who they are. In fact, chances are so laughably higher that he will face no consequences whatsoever than that he will face excessive consequences that your concern for him seems absurd. There are men who use SA specifically to harm women because they know the already low probability of facing consequences for assault is lesser still meeting a woman from there.",
                    "author": "SBerryTrifle",
                    "id": "ia7xhxl",
                    "parent_id": "t1_ia7qjd6",
                    "score": 2,
                    "created_utc": 1653674056.0,
                    "replies": [
                        {
                            "body": "There are plenty on this rape report thread including other rape report threads. My response did not mention only this post. You are being pedantic.\n\nHelping victims with detailed advice is not \"victim blaming\".\n\n\"There are men who use SA specifically to harm women...\"  \nYou don't know that. Nor that it is different from other dating venues were it true. And if that were true in any significant degree, women don't seem to stop seeking men out out of that fear. Women should just stop dating men period in that case.\n\nMine is a rational response to help both male and female victims. You are projecting some other purpose onto me.",
                            "author": "JohnnyKemmer009",
                            "id": "ia7ybnb",
                            "parent_id": "t1_ia7xhxl",
                            "score": 0,
                            "created_utc": 1653674409.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True. It is the Internet. All information, including this sentence, needs to be independently verified.",
            "author": "JohnnyKemmer009",
            "id": "ia7p4wv",
            "parent_id": "t1_ia7oyf5",
            "score": 1,
            "created_utc": 1653670562.0,
            "replies": []
        },
        {
            "body": "As someone who was raped and beaten by my stbx husband, who has evidence and photos and even texts where he admitted to it all: nothing is better than what you think justice will entitle you to. Because it turned into nothing but more trauma to me.\n\nShe’s only 20. She’s in college. She is a sex worker. She was violently raped. Telling her to carry the weight of inviting more strangers and trauma into her situation is bullshit. There are other groups that she can get into contact with via RAINN who can discuss her options with her in a way that gives her time to think and heal. Her mental and physical well-being is the priority, not your after school special version of justice.",
            "author": "anneofgreennipples",
            "id": "ia8fuvm",
            "parent_id": "t1_ia8eg87",
            "score": 10,
            "created_utc": 1653682186.0,
            "replies": []
        },
        {
            "body": "Where do you get off telling victims what to do and how to act? Have you been through this? Do you know how traumatic and demanding it can be? If she chooses to then I wish her luck. But your faith in the police to do the right thing is sadly misplaced. \nMore important is knowing there are support services that will prioritise her wellbeing and assist if she needs it.",
            "author": "OneCanToucanThreeCan",
            "id": "ia94q64",
            "parent_id": "t1_ia8eg87",
            "score": 4,
            "created_utc": 1653694177.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ia7ortg",
            "parent_id": "t1_ia7e0jc",
            "score": 6,
            "created_utc": 1653670413.0,
            "replies": []
        },
        {
            "body": "\"If police officer do their jobs\" Oh yes because police officer are known for doing their job often pr most of the time",
            "author": "WiseRequirement9277",
            "id": "ia8u8l6",
            "parent_id": "t1_ia8drhq",
            "score": 2,
            "created_utc": 1653688962.0,
            "replies": []
        },
        {
            "body": "I think a realistic view is important and it should be up to the person who experienced the abuse to decide what they want to do. You’re reaching by calling them rape apologists. I can’t take you seriously if that’s what you actually think. It’s so deluded. Talk about over correcting or all or nothing thinking.",
            "author": "truthbetold05",
            "id": "ic3ym9h",
            "parent_id": "t1_ia8getz",
            "score": 0,
            "created_utc": 1655055718.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia9btvp",
            "parent_id": "t1_ia8mope",
            "score": 2,
            "created_utc": 1653697879.0,
            "replies": [
                {
                    "body": "There’s so much wrong with what you said here. She should be supported, but you’re a bigot. Do sex workers not deserve support then? What are you even saying",
                    "author": "truthbetold05",
                    "id": "ic3yz5g",
                    "parent_id": "t1_ia9btvp",
                    "score": 0,
                    "created_utc": 1655055882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s horrible, and still does not give him the right to tell another victim how to deal with their own assault. Nor does it give him the right to wish rape on others.",
            "author": "Lipstickluna97",
            "id": "ia89drp",
            "parent_id": "t1_ia883b8",
            "score": 3,
            "created_utc": 1653679271.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia8adu9",
                    "parent_id": "t1_ia89drp",
                    "score": -1,
                    "created_utc": 1653679715.0,
                    "replies": [
                        {
                            "body": "Why are we playing the oppression Olympics? Reporting assault to cops in the United States ESPECIALLY as any type of SWer (and that includes SB) is hugely futile. I’m not doubling down on a damn thing, I said what I said. If he understands how traumatic attempting to report SA is, then there is no reason to pressure another surviver into doing so.\n\nAnd with all those maybes it seems that you’re doing a lot more assuming than I am.",
                            "author": "Lipstickluna97",
                            "id": "ia8aqu7",
                            "parent_id": "t1_ia8adu9",
                            "score": 3,
                            "created_utc": 1653679879.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ia8c6k3",
                                    "parent_id": "t1_ia8aqu7",
                                    "score": -1,
                                    "created_utc": 1653680527.0,
                                    "replies": [
                                        {
                                            "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                                            "author": "Lipstickluna97",
                                            "id": "ia8dbjs",
                                            "parent_id": "t1_ia8c6k3",
                                            "score": 3,
                                            "created_utc": 1653681040.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia8blzi",
                    "parent_id": "t1_ia89drp",
                    "score": -1,
                    "created_utc": 1653680270.0,
                    "replies": [
                        {
                            "body": "Good for you, but you’re still not a sexworker, and was not at risk for being arrested for reporting. It’s wrong to pressure victims into reporting. That’s rape crisis counseling 101. You had a terrible experience, and that really sucks. I’m not going to give you my entire life story, but I’ve been in OPs shoes, and I wouldn’t wish it on anyone.",
                            "author": "Lipstickluna97",
                            "id": "ia8c6yk",
                            "parent_id": "t1_ia8blzi",
                            "score": 4,
                            "created_utc": 1653680532.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ia8cj6b",
                                    "parent_id": "t1_ia8c6yk",
                                    "score": -1,
                                    "created_utc": 1653680685.0,
                                    "replies": [
                                        {
                                            "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                                            "author": "Lipstickluna97",
                                            "id": "ia8d0tf",
                                            "parent_id": "t1_ia8cj6b",
                                            "score": 2,
                                            "created_utc": 1653680907.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The last sounds like a good plan to me. I am, obviously, not advocating anyone do anything illegal.",
            "author": "AShatteredKing",
            "id": "ia7rqyc",
            "parent_id": "t1_ia7n3z0",
            "score": 1,
            "created_utc": 1653671638.0,
            "replies": [
                {
                    "body": "The problem is that there is no guarantee that the ”problem” will not come back in revenge.",
                    "author": "SDchat",
                    "id": "ia7smar",
                    "parent_id": "t1_ia7rqyc",
                    "score": 0,
                    "created_utc": 1653672001.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope, that's not true.  If OP brings a victims advocate and or a lawyer the police will reluctantly do their jobs.  They might be incompetent and mysogynistic but they are also civil servants.\n\nThis was not a consensual arrangement.  The facts according to the law:  OP is a victim, she was raped by a john after revoking consent.  OP cannot be charged with prostitution under these conditions.\n\nGuys like this have a trail of victims, one close encounter with the police and the the house of cards could come tumbling down...he'll be highly motivated to settle.",
            "author": "double-weird-3-0",
            "id": "ia7j6ka",
            "parent_id": "t1_ia67ter",
            "score": 1,
            "created_utc": 1653668135.0,
            "replies": [
                {
                    "body": "Show this to be the case please because everything I've read says it's not. \n\n[https://en.wikipedia.org/wiki/Rape\\_in\\_the\\_United\\_States#:\\~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest](https://en.wikipedia.org/wiki/Rape_in_the_United_States#:~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest).\n\nThis states about 1/3 of rapes reported to police lead to an arrest. \n\nThey have had repeated sexual encounters. They have an arrangement to have sex. She gave consent to have sex. She received money for the sex. She was not under in the influence or otherwise unable to give consent. \n\nYes, he raped her. No, that cannot be demonstrated to be the case here without the guy himself directly stating he knew she withdrew consent and continued anyways. This is an impossible case. The police know this. \n\nHell, until a couple years ago, there were states that didn't even recognize that a woman could be raped after giving consent. California had to explicitly state that consent must be ongoing because people would argue over this. \n\nDo you have any examples of a woman withdrawing consent during sex after repeated past encounters and the woman received payment for the encounter and the man was arrested for it?",
                    "author": "AShatteredKing",
                    "id": "iaa4xbz",
                    "parent_id": "t1_ia7j6ka",
                    "score": 1,
                    "created_utc": 1653714329.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haggling someone about using protection and using money as a coercion tactic is a huge red flag",
            "author": "c0rnstarr",
            "id": "ia6pqc9",
            "parent_id": "t1_ia61ovt",
            "score": 9,
            "created_utc": 1653655071.0,
            "replies": [
                {
                    "body": "He didn't use money as a coercion tactic before he raped her. He simply offered 3 times more than others to begin with. There is no flag to see here and it's toxic to act like OP should have seen it coming or any other SB can learn from this.\n\nThe guy is a rapist pos, but I disagree greatly that he showed any red flags beforehand.",
                    "author": "YlangScent",
                    "id": "ia6s7vi",
                    "parent_id": "t1_ia6pqc9",
                    "score": -1,
                    "created_utc": 1653656388.0,
                    "replies": [
                        {
                            "body": "Literally not what I’m saying??\n\nI’m not blaming OP for ANYTHING. I’m saying that  it is a red flag when “he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me.” It’s something for other SBs to be mindful of bc that is also quite common",
                            "author": "c0rnstarr",
                            "id": "ia6xwwe",
                            "parent_id": "t1_ia6s7vi",
                            "score": 5,
                            "created_utc": 1653659142.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a warning sign because he previously agree to wearing condoms to lure her in.\n\nHe was supposed not to be pushy and manipulate a woman that might be in a place of financial vulnerability to do something she already stated she is. it comfortable.\nSex is not a negotiation table. If he/she is not comfortable then the other part needs to back away and respect without insisting \n\nSo yes, he was supposed to walk away, or rather, never go meet her on the first place",
            "author": "osestella",
            "id": "ia6cqbz",
            "parent_id": "t1_ia61ovt",
            "score": 6,
            "created_utc": 1653646365.0,
            "replies": [
                {
                    "body": ">he previously agree to wearing condoms to lure her in\n\nWhat? Where in her post does it say anything like that?\nShe says:\n\n>The first time he didn’t want to wear a condom\n\nSo it was clear from the start?\nYou're adding details that she definitely did not write.",
                    "author": "YlangScent",
                    "id": "ia6l3x1",
                    "parent_id": "t1_ia6cqbz",
                    "score": -2,
                    "created_utc": 1653652374.0,
                    "replies": [
                        {
                            "body": "But if someone says “no” for something sexual the appropriate response is “ok”. Then you can walk away or stay and agree with the other person boundaries. \nTrying to convince someone to overlook their own boundaries is not ok.",
                            "author": "osestella",
                            "id": "ia6m4du",
                            "parent_id": "t1_ia6l3x1",
                            "score": 5,
                            "created_utc": 1653652994.0,
                            "replies": [
                                {
                                    "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
                                    "author": "YlangScent",
                                    "id": "ia6ruh4",
                                    "parent_id": "t1_ia6m4du",
                                    "score": 0,
                                    "created_utc": 1653656196.0,
                                    "replies": [
                                        {
                                            "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                                            "author": "osestella",
                                            "id": "ia6tlyr",
                                            "parent_id": "t1_ia6ruh4",
                                            "score": 3,
                                            "created_utc": 1653657082.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "She said so in the comments.",
                            "author": "osestella",
                            "id": "ia6lqod",
                            "parent_id": "t1_ia6l3x1",
                            "score": 3,
                            "created_utc": 1653652766.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, if he didn't like it then he should either leave or wear a condom, not coerce her into it.\nTaking advantage of people in financial distress, or otherwise less powerful than you, to coerce them into sex they don't want is abusive behaviour.",
            "author": "OneCanToucanThreeCan",
            "id": "ia6dbhz",
            "parent_id": "t1_ia61ovt",
            "score": 5,
            "created_utc": 1653646855.0,
            "replies": []
        },
        {
            "body": "They think the post is fake.  There's not an insignificant portion of the sub that are paranoid about people posting fake stories to 'change public perceptions'.  Why they choose to engage on the internet in any capacity, I have no idea.  That type of shit is everywhere and has always been the case.\n\nPicking and choosing random posts and users to accuse is some grandpa fox news paranoia shit.  It makes people feel smart when they 'figured out the dirty secret no one else can see.'",
            "author": "Pacwing",
            "id": "ia6i0iu",
            "parent_id": "t1_ia6d3e2",
            "score": 5,
            "created_utc": 1653650345.0,
            "replies": [
                {
                    "body": "Why would they think this particular post is fake? Even if they think is fake I feel that of all post people should just leave this alone. If it’s fake indeed nobody will ever know and accusing people is not going to change anything.\n\nIf the post is not fake they are hurting a innocent person who is traumatized. The “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nI cant understand how people can be so mean and cold. \n\nWho would benefit from changing the public’s perception? How does anyone benefit from a post life this? It doesn’t benefit SB’s or SD’s? What is the moral of the story? SD’s who offer triple ppm are potentially dangerous? This is so stupid.\n\nI’ve been acuses of faking a post once and I was like…… I even send people the private message exchange to prove it was real.\nEven if this particular post is not real the history is very plausible and akin to many that happen.\n\nPushy man and man who try to negotiate boundaries are boundaries pushers and are potentially dangerous. Girls get tempted to overlook security for financial gain. This is also not a great idea.\nReal or fake the message behind this post is accurate",
                    "author": "osestella",
                    "id": "ia6jd7r",
                    "parent_id": "t1_ia6i0iu",
                    "score": 6,
                    "created_utc": 1653651263.0,
                    "replies": [
                        {
                            "body": "Because they think women are liars. It is mean and cold, you’re not wrong.",
                            "author": "Doramang",
                            "id": "ia6xi62",
                            "parent_id": "t1_ia6jd7r",
                            "score": 5,
                            "created_utc": 1653658953.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sure one should always be cautious but honestly it can happen anywhere. And it doesn’t matter. It’s the rapists fault, always.",
            "author": null,
            "id": "ia5p6nx",
            "parent_id": "t1_ia5oihz",
            "score": 9,
            "created_utc": 1653627160.0,
            "replies": []
        },
        {
            "body": "Instill a learning lesson?? For a rape victim?? Fuck outta here shes been through enough what learning lesson?",
            "author": "AstroP23",
            "id": "ia751gm",
            "parent_id": "t1_ia5oihz",
            "score": 5,
            "created_utc": 1653662308.0,
            "replies": []
        },
        {
            "body": "\"My intent is to instill a learning lesson\" - how condescending and unhelpful. Pretty sure she learned from this experience without your help, smartass.",
            "author": "worship_me_or_die",
            "id": "ia5yprp",
            "parent_id": "t1_ia5oihz",
            "score": 11,
            "created_utc": 1653634009.0,
            "replies": []
        },
        {
            "body": "First off there are not a lot of responses like that, there is only the one and it’s not a threat but a statement of what he feels rapists deserve. The majority of comments are offering support and a good additional chunk are victim blaming or giving sort of clueless advice. I’d feel differently if there were an actual angry mob outside of the rapist’s door but no one has yet been harmed by the outrage of internet users with no idea who they are. In fact, chances are so laughably higher that he will face no consequences whatsoever than that he will face excessive consequences that your concern for him seems absurd. There are men who use SA specifically to harm women because they know the already low probability of facing consequences for assault is lesser still meeting a woman from there.",
            "author": "SBerryTrifle",
            "id": "ia7xhxl",
            "parent_id": "t1_ia7qjd6",
            "score": 2,
            "created_utc": 1653674056.0,
            "replies": [
                {
                    "body": "There are plenty on this rape report thread including other rape report threads. My response did not mention only this post. You are being pedantic.\n\nHelping victims with detailed advice is not \"victim blaming\".\n\n\"There are men who use SA specifically to harm women...\"  \nYou don't know that. Nor that it is different from other dating venues were it true. And if that were true in any significant degree, women don't seem to stop seeking men out out of that fear. Women should just stop dating men period in that case.\n\nMine is a rational response to help both male and female victims. You are projecting some other purpose onto me.",
                    "author": "JohnnyKemmer009",
                    "id": "ia7ybnb",
                    "parent_id": "t1_ia7xhxl",
                    "score": 0,
                    "created_utc": 1653674409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s so much wrong with what you said here. She should be supported, but you’re a bigot. Do sex workers not deserve support then? What are you even saying",
            "author": "truthbetold05",
            "id": "ic3yz5g",
            "parent_id": "t1_ia9btvp",
            "score": 0,
            "created_utc": 1655055882.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia8adu9",
            "parent_id": "t1_ia89drp",
            "score": -1,
            "created_utc": 1653679715.0,
            "replies": [
                {
                    "body": "Why are we playing the oppression Olympics? Reporting assault to cops in the United States ESPECIALLY as any type of SWer (and that includes SB) is hugely futile. I’m not doubling down on a damn thing, I said what I said. If he understands how traumatic attempting to report SA is, then there is no reason to pressure another surviver into doing so.\n\nAnd with all those maybes it seems that you’re doing a lot more assuming than I am.",
                    "author": "Lipstickluna97",
                    "id": "ia8aqu7",
                    "parent_id": "t1_ia8adu9",
                    "score": 3,
                    "created_utc": 1653679879.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia8c6k3",
                            "parent_id": "t1_ia8aqu7",
                            "score": -1,
                            "created_utc": 1653680527.0,
                            "replies": [
                                {
                                    "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                                    "author": "Lipstickluna97",
                                    "id": "ia8dbjs",
                                    "parent_id": "t1_ia8c6k3",
                                    "score": 3,
                                    "created_utc": 1653681040.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia8blzi",
            "parent_id": "t1_ia89drp",
            "score": -1,
            "created_utc": 1653680270.0,
            "replies": [
                {
                    "body": "Good for you, but you’re still not a sexworker, and was not at risk for being arrested for reporting. It’s wrong to pressure victims into reporting. That’s rape crisis counseling 101. You had a terrible experience, and that really sucks. I’m not going to give you my entire life story, but I’ve been in OPs shoes, and I wouldn’t wish it on anyone.",
                    "author": "Lipstickluna97",
                    "id": "ia8c6yk",
                    "parent_id": "t1_ia8blzi",
                    "score": 4,
                    "created_utc": 1653680532.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ia8cj6b",
                            "parent_id": "t1_ia8c6yk",
                            "score": -1,
                            "created_utc": 1653680685.0,
                            "replies": [
                                {
                                    "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                                    "author": "Lipstickluna97",
                                    "id": "ia8d0tf",
                                    "parent_id": "t1_ia8cj6b",
                                    "score": 2,
                                    "created_utc": 1653680907.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The problem is that there is no guarantee that the ”problem” will not come back in revenge.",
            "author": "SDchat",
            "id": "ia7smar",
            "parent_id": "t1_ia7rqyc",
            "score": 0,
            "created_utc": 1653672001.0,
            "replies": []
        },
        {
            "body": "Show this to be the case please because everything I've read says it's not. \n\n[https://en.wikipedia.org/wiki/Rape\\_in\\_the\\_United\\_States#:\\~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest](https://en.wikipedia.org/wiki/Rape_in_the_United_States#:~:text=or%20multiple%20reasons-,Prosecution%20rate,percent%20resulted%20in%20an%20arrest).\n\nThis states about 1/3 of rapes reported to police lead to an arrest. \n\nThey have had repeated sexual encounters. They have an arrangement to have sex. She gave consent to have sex. She received money for the sex. She was not under in the influence or otherwise unable to give consent. \n\nYes, he raped her. No, that cannot be demonstrated to be the case here without the guy himself directly stating he knew she withdrew consent and continued anyways. This is an impossible case. The police know this. \n\nHell, until a couple years ago, there were states that didn't even recognize that a woman could be raped after giving consent. California had to explicitly state that consent must be ongoing because people would argue over this. \n\nDo you have any examples of a woman withdrawing consent during sex after repeated past encounters and the woman received payment for the encounter and the man was arrested for it?",
            "author": "AShatteredKing",
            "id": "iaa4xbz",
            "parent_id": "t1_ia7j6ka",
            "score": 1,
            "created_utc": 1653714329.0,
            "replies": []
        },
        {
            "body": "He didn't use money as a coercion tactic before he raped her. He simply offered 3 times more than others to begin with. There is no flag to see here and it's toxic to act like OP should have seen it coming or any other SB can learn from this.\n\nThe guy is a rapist pos, but I disagree greatly that he showed any red flags beforehand.",
            "author": "YlangScent",
            "id": "ia6s7vi",
            "parent_id": "t1_ia6pqc9",
            "score": -1,
            "created_utc": 1653656388.0,
            "replies": [
                {
                    "body": "Literally not what I’m saying??\n\nI’m not blaming OP for ANYTHING. I’m saying that  it is a red flag when “he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me.” It’s something for other SBs to be mindful of bc that is also quite common",
                    "author": "c0rnstarr",
                    "id": "ia6xwwe",
                    "parent_id": "t1_ia6s7vi",
                    "score": 5,
                    "created_utc": 1653659142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">he previously agree to wearing condoms to lure her in\n\nWhat? Where in her post does it say anything like that?\nShe says:\n\n>The first time he didn’t want to wear a condom\n\nSo it was clear from the start?\nYou're adding details that she definitely did not write.",
            "author": "YlangScent",
            "id": "ia6l3x1",
            "parent_id": "t1_ia6cqbz",
            "score": -2,
            "created_utc": 1653652374.0,
            "replies": [
                {
                    "body": "But if someone says “no” for something sexual the appropriate response is “ok”. Then you can walk away or stay and agree with the other person boundaries. \nTrying to convince someone to overlook their own boundaries is not ok.",
                    "author": "osestella",
                    "id": "ia6m4du",
                    "parent_id": "t1_ia6l3x1",
                    "score": 5,
                    "created_utc": 1653652994.0,
                    "replies": [
                        {
                            "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
                            "author": "YlangScent",
                            "id": "ia6ruh4",
                            "parent_id": "t1_ia6m4du",
                            "score": 0,
                            "created_utc": 1653656196.0,
                            "replies": [
                                {
                                    "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                                    "author": "osestella",
                                    "id": "ia6tlyr",
                                    "parent_id": "t1_ia6ruh4",
                                    "score": 3,
                                    "created_utc": 1653657082.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She said so in the comments.",
                    "author": "osestella",
                    "id": "ia6lqod",
                    "parent_id": "t1_ia6l3x1",
                    "score": 3,
                    "created_utc": 1653652766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why would they think this particular post is fake? Even if they think is fake I feel that of all post people should just leave this alone. If it’s fake indeed nobody will ever know and accusing people is not going to change anything.\n\nIf the post is not fake they are hurting a innocent person who is traumatized. The “good” of outing a fake post doesn’t outweighs the “bad” of further traumatizing a innocent girl who experienced intense trauma.\n\nI cant understand how people can be so mean and cold. \n\nWho would benefit from changing the public’s perception? How does anyone benefit from a post life this? It doesn’t benefit SB’s or SD’s? What is the moral of the story? SD’s who offer triple ppm are potentially dangerous? This is so stupid.\n\nI’ve been acuses of faking a post once and I was like…… I even send people the private message exchange to prove it was real.\nEven if this particular post is not real the history is very plausible and akin to many that happen.\n\nPushy man and man who try to negotiate boundaries are boundaries pushers and are potentially dangerous. Girls get tempted to overlook security for financial gain. This is also not a great idea.\nReal or fake the message behind this post is accurate",
            "author": "osestella",
            "id": "ia6jd7r",
            "parent_id": "t1_ia6i0iu",
            "score": 6,
            "created_utc": 1653651263.0,
            "replies": [
                {
                    "body": "Because they think women are liars. It is mean and cold, you’re not wrong.",
                    "author": "Doramang",
                    "id": "ia6xi62",
                    "parent_id": "t1_ia6jd7r",
                    "score": 5,
                    "created_utc": 1653658953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are plenty on this rape report thread including other rape report threads. My response did not mention only this post. You are being pedantic.\n\nHelping victims with detailed advice is not \"victim blaming\".\n\n\"There are men who use SA specifically to harm women...\"  \nYou don't know that. Nor that it is different from other dating venues were it true. And if that were true in any significant degree, women don't seem to stop seeking men out out of that fear. Women should just stop dating men period in that case.\n\nMine is a rational response to help both male and female victims. You are projecting some other purpose onto me.",
            "author": "JohnnyKemmer009",
            "id": "ia7ybnb",
            "parent_id": "t1_ia7xhxl",
            "score": 0,
            "created_utc": 1653674409.0,
            "replies": []
        },
        {
            "body": "Why are we playing the oppression Olympics? Reporting assault to cops in the United States ESPECIALLY as any type of SWer (and that includes SB) is hugely futile. I’m not doubling down on a damn thing, I said what I said. If he understands how traumatic attempting to report SA is, then there is no reason to pressure another surviver into doing so.\n\nAnd with all those maybes it seems that you’re doing a lot more assuming than I am.",
            "author": "Lipstickluna97",
            "id": "ia8aqu7",
            "parent_id": "t1_ia8adu9",
            "score": 3,
            "created_utc": 1653679879.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia8c6k3",
                    "parent_id": "t1_ia8aqu7",
                    "score": -1,
                    "created_utc": 1653680527.0,
                    "replies": [
                        {
                            "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                            "author": "Lipstickluna97",
                            "id": "ia8dbjs",
                            "parent_id": "t1_ia8c6k3",
                            "score": 3,
                            "created_utc": 1653681040.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good for you, but you’re still not a sexworker, and was not at risk for being arrested for reporting. It’s wrong to pressure victims into reporting. That’s rape crisis counseling 101. You had a terrible experience, and that really sucks. I’m not going to give you my entire life story, but I’ve been in OPs shoes, and I wouldn’t wish it on anyone.",
            "author": "Lipstickluna97",
            "id": "ia8c6yk",
            "parent_id": "t1_ia8blzi",
            "score": 4,
            "created_utc": 1653680532.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ia8cj6b",
                    "parent_id": "t1_ia8c6yk",
                    "score": -1,
                    "created_utc": 1653680685.0,
                    "replies": [
                        {
                            "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                            "author": "Lipstickluna97",
                            "id": "ia8d0tf",
                            "parent_id": "t1_ia8cj6b",
                            "score": 2,
                            "created_utc": 1653680907.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Literally not what I’m saying??\n\nI’m not blaming OP for ANYTHING. I’m saying that  it is a red flag when “he said if I didn’t agree for us to have unprotected sex he wasn’t going to pay me.” It’s something for other SBs to be mindful of bc that is also quite common",
            "author": "c0rnstarr",
            "id": "ia6xwwe",
            "parent_id": "t1_ia6s7vi",
            "score": 5,
            "created_utc": 1653659142.0,
            "replies": []
        },
        {
            "body": "But if someone says “no” for something sexual the appropriate response is “ok”. Then you can walk away or stay and agree with the other person boundaries. \nTrying to convince someone to overlook their own boundaries is not ok.",
            "author": "osestella",
            "id": "ia6m4du",
            "parent_id": "t1_ia6l3x1",
            "score": 5,
            "created_utc": 1653652994.0,
            "replies": [
                {
                    "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
                    "author": "YlangScent",
                    "id": "ia6ruh4",
                    "parent_id": "t1_ia6m4du",
                    "score": 0,
                    "created_utc": 1653656196.0,
                    "replies": [
                        {
                            "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                            "author": "osestella",
                            "id": "ia6tlyr",
                            "parent_id": "t1_ia6ruh4",
                            "score": 3,
                            "created_utc": 1653657082.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She said so in the comments.",
            "author": "osestella",
            "id": "ia6lqod",
            "parent_id": "t1_ia6l3x1",
            "score": 3,
            "created_utc": 1653652766.0,
            "replies": []
        },
        {
            "body": "Because they think women are liars. It is mean and cold, you’re not wrong.",
            "author": "Doramang",
            "id": "ia6xi62",
            "parent_id": "t1_ia6jd7r",
            "score": 5,
            "created_utc": 1653658953.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia8c6k3",
            "parent_id": "t1_ia8aqu7",
            "score": -1,
            "created_utc": 1653680527.0,
            "replies": [
                {
                    "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
                    "author": "Lipstickluna97",
                    "id": "ia8dbjs",
                    "parent_id": "t1_ia8c6k3",
                    "score": 3,
                    "created_utc": 1653681040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ia8cj6b",
            "parent_id": "t1_ia8c6yk",
            "score": -1,
            "created_utc": 1653680685.0,
            "replies": [
                {
                    "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
                    "author": "Lipstickluna97",
                    "id": "ia8d0tf",
                    "parent_id": "t1_ia8cj6b",
                    "score": 2,
                    "created_utc": 1653680907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I'm sure walking out is a good way to make the SB feel in control. It's not at all going to lead to her not speaking up in the future out of fear that the SD will immediately take his money and walk out.\n\nOpen communication is always best. No is no doesn't mean that conversations can't be had as to the reasoning.",
            "author": "YlangScent",
            "id": "ia6ruh4",
            "parent_id": "t1_ia6m4du",
            "score": 0,
            "created_utc": 1653656196.0,
            "replies": [
                {
                    "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
                    "author": "osestella",
                    "id": "ia6tlyr",
                    "parent_id": "t1_ia6ruh4",
                    "score": 3,
                    "created_utc": 1653657082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you think it’s a coincidence that it’s only men disagreeing with me? Find some self awareness somewhere jfc",
            "author": "Lipstickluna97",
            "id": "ia8dbjs",
            "parent_id": "t1_ia8c6k3",
            "score": 3,
            "created_utc": 1653681040.0,
            "replies": []
        },
        {
            "body": "Lol ok\n\nETA telling someone they’re wrong despite them being a victim isn’t “victim blaming” so keep the straw man thanks",
            "author": "Lipstickluna97",
            "id": "ia8d0tf",
            "parent_id": "t1_ia8cj6b",
            "score": 2,
            "created_utc": 1653680907.0,
            "replies": []
        },
        {
            "body": "No it won’t. You clearly don’t understand a girls position.\n\nWhen I was younger I dealt with many pushy coercive man and ended up doing things that I didn’t want to do. Mostly because they low key shamed me and sweet talked me into those things. They made me question my judgement with their “open conversation”.\nI wish they had just left. A man who says “your boundaries are valid but not compatible with what I’m looking for” is a responsible man\n\nUsing protection is a serious thing. STD’s sometimes take months to show up in exams. Trying to coerce someone into unprotected sex claiming they have exams and that the money is good sounds manipulative.\n\nHaving an open conversation about it sounds like an older man (aka figure of authority) trying to coerce a younger girl. If he walks away and she regrets and decides not to speak up on the future that’s HER decision.\n\nPersonally losing a POT wouldn’t make me not speak up about my boundaries. I’ve rejected multiple man who didn’t want to have sex with a condom. They just say “ok” and leave. That doesn’t make me bend my rules.",
            "author": "osestella",
            "id": "ia6tlyr",
            "parent_id": "t1_ia6ruh4",
            "score": 3,
            "created_utc": 1653657082.0,
            "replies": []
        }
    ]
}