{
    "title": "Intimacy date went so horribly wrong",
    "post_id": "zfdcjd",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zfdcjd/intimacy_date_went_so_horribly_wrong/",
    "author": "Bluesparkles2",
    "body": "Lol I don’t even know what to say. Keep in mind I’m new to the sugar world.I met a a Pot SD a couple of weeks ago. Talked on the phone a few times. We went on M&G and everything was great, all green flags 100%. He offered a great ppm and allowance for my area. We scheduled a date right than and there for the following week, which was today. So I show up to the hotel, we talk for a bit, I’m sitting on the bed when he get leans in trying to kiss me. I lean back and ask if he has a gift to give me before we start (ppm). Now this is where things take a turn \n\nWe went back and forth calmly for a good 10 minutes, felt long as hell. Him essentially saying he has been a SD for 15 years and never gives ppm first, giving money first is for hookers not SBs, I should trust him, he wants to tip and can’t tip if he gives the agreed upon amount first, etc. refusing to give ppm before intimacy. \n\n\nI of course have done my research on sugar dating and have read many times to get your money first. So I wasn’t going for it. How can I trust you when this is only my second time meeting you? So I just got up and started putting my shoes back on while he’s in the bed. He reaches over to the candle on the bedside table, lifts it and flashes some money saying “see I had your money”. I told him take care and left. \n\nI don’t even know what to think. I waxed (incredibly painful might I add) spent hours getting ready, planned my day around only to have my time absolutely wasted. Wow \n\nIs it normal to give ppm after? Like what percentage of you guys do that? Is that regular or is he the odd one out? Like why is giving ppm first such an issue? Is he worried I would run out of the room with they money???? He clearly had the money, what was his problem? \n\nI made a good call leaving right?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/zfdcjd/intimacy_date_went_so_horribly_wrong/",
    "score": 111,
    "upvote_ratio": 0.94,
    "created_utc": 1670446203.0,
    "num_comments": 129,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Congrats on listening to your intuition and walking away. Trust us earned and that guy failed the test. \n\nWho cares about “normal” if one of the parties involved doesn’t feel comfortable with the norm. You’re two adults, you can make your own norm and both feel comfortable. Sugar is supposed to be fun and mutually beneficial!\n\nYou saved yourself a headache.",
            "author": "b_n008",
            "id": "izczn6k",
            "parent_id": "t3_zfdcjd",
            "score": 36,
            "created_utc": 1670474835.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izb8yj9",
            "parent_id": "t3_zfdcjd",
            "score": 88,
            "created_utc": 1670446754.0,
            "replies": [
                {
                    "body": "I forgotten a few times in the heat of the moment. I feel so bad and transfer directly asap. Not so bad if weve been dating a while but first time always looks suspicious",
                    "author": "Upper-District-50",
                    "id": "izcygx4",
                    "parent_id": "t1_izb8yj9",
                    "score": 15,
                    "created_utc": 1670474191.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "izd1ej7",
                            "parent_id": "t1_izcygx4",
                            "score": 20,
                            "created_utc": 1670475838.0,
                            "replies": [
                                {
                                    "body": "I did, apologised profusely and sent more than we agreed to. She hadnt reminded me or brought it up at all which was very sweet but I felt very guilty. A month later i just switched to an allowance to prevent that from happening",
                                    "author": "Upper-District-50",
                                    "id": "izd6nut",
                                    "parent_id": "t1_izd1ej7",
                                    "score": 16,
                                    "created_utc": 1670479105.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do too although I’ve heard horror stories of SB running out after taking the money",
                    "author": "UnearthlyDinosaur",
                    "id": "izc9n1j",
                    "parent_id": "t1_izb8yj9",
                    "score": 6,
                    "created_utc": 1670462346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good call leaving. I usually give ppm first for her piece of mind and also so I don't forget",
            "author": "dgtyco",
            "id": "izb8d63",
            "parent_id": "t3_zfdcjd",
            "score": 69,
            "created_utc": 1670446524.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "izc02ic",
                    "parent_id": "t1_izb8d63",
                    "score": -12,
                    "created_utc": 1670458059.0,
                    "replies": [
                        {
                            "body": "Its money for sex and companionship regardless of how you want to spin it and in one the girl is more comfortable and consent is assured.",
                            "author": "Pastakingfifth",
                            "id": "izc85mr",
                            "parent_id": "t1_izc02ic",
                            "score": 7,
                            "created_utc": 1670461677.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You 100% did the right thing. Any good SD would be more concerned with making you comfortable before intimacy so you can enjoy yourself. Whose to say he would have actually given you that money after? Or that what he showed was your agreed upon amount? Or that it was even real money? There have been stories of SD's passing off fake or counterfeit cash that looked real enough that the SB didn't notice until after she was gone. You did the right thing. Yes, you may have wasted your time, but at least you didn't give your sugar to someone who CLEARY didn't deserve you.",
            "author": "HailToTheQuinn",
            "id": "izc00kc",
            "parent_id": "t3_zfdcjd",
            "score": 66,
            "created_utc": 1670458035.0,
            "replies": [
                {
                    "body": "This.  100% this.",
                    "author": "disposable9account",
                    "id": "ize5g5l",
                    "parent_id": "t1_izc00kc",
                    "score": 5,
                    "created_utc": 1670505652.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've never been asked for the money first and always give it at the end of the evening, but if asked of course I would in a heartbeat.\n\n&#x200B;\n\n>Is he worried I would run out of the room with they money????\n\nPerhaps. There have been stories on here of that happening. However, it's his job to make sure you feel safe and comfortable on the date, and the calculus is that if you ripped him off, he'd be out the PPM. If he ripped you off, you'd be out the PPM (and can afford it less) as well as have given him sex, which you only consented to with the promise of the PPM. So, he's the one that needs to assume the risk.\n\nAlso:\n\n&#x200B;\n\n>giving money first is for hookers and SBs, I should trust him, he wants to tip and can’t tip if he gives the agreed upon amount first\n\nI've never heard of someone using \"tip\" in the context of an SR. Seems this guy might have been a john.",
            "author": "roscoe7585",
            "id": "izb94h9",
            "parent_id": "t3_zfdcjd",
            "score": 92,
            "created_utc": 1670446818.0,
            "replies": [
                {
                    "body": "I always give the ppm the moment they walk into the room. If you are too scared they gonna run at that point you got bigger issues.",
                    "author": "Stairsareok",
                    "id": "izcj9th",
                    "parent_id": "t1_izb94h9",
                    "score": 22,
                    "created_utc": 1670466692.0,
                    "replies": []
                },
                {
                    "body": "I agree. Money does not have to change hands right away, but if asking for it at the beginning creates a problem for the SD then he's not an SD and you did right getting leaving.",
                    "author": "Either_Anybody_6017",
                    "id": "izdieic",
                    "parent_id": "t1_izb94h9",
                    "score": 11,
                    "created_utc": 1670488145.0,
                    "replies": []
                },
                {
                    "body": ">I've never heard of someone using \"tip\" in the context of\n\nWell I have heard of it - but usually only in Vanilla in the context of   \n\"Let me put just the tip in please\"   \n:D :D :D",
                    "author": "sd424242",
                    "id": "izbrw3l",
                    "parent_id": "t1_izb94h9",
                    "score": 16,
                    "created_utc": 1670454510.0,
                    "replies": []
                },
                {
                    "body": "I agree with everything you’ve said",
                    "author": "Equivalent_Newt_6969",
                    "id": "izbchyr",
                    "parent_id": "t1_izb94h9",
                    "score": 21,
                    "created_utc": 1670448213.0,
                    "replies": [
                        {
                            "body": "He was 💥definitely💥 a John with the 💵 tip thing.",
                            "author": null,
                            "id": "izbejzk",
                            "parent_id": "t1_izbchyr",
                            "score": 31,
                            "created_utc": 1670449065.0,
                            "replies": [
                                {
                                    "body": "> 💥definitely💥 a John \n\nexcept escorts ALWAYS require the payment up front. He probably read on some site that he should pay later.",
                                    "author": "GSSD",
                                    "id": "izbhp3j",
                                    "parent_id": "t1_izbejzk",
                                    "score": 26,
                                    "created_utc": 1670450290.0,
                                    "replies": [
                                        {
                                            "body": "it could have been this site. 🙃 saw some SD saying that SDs should wait to pay until the end. which annoys me to no end. for our safety etc, we should get the money up front.",
                                            "author": "AspiringSplendaBaby",
                                            "id": "izd9ofl",
                                            "parent_id": "t1_izbhp3j",
                                            "score": 10,
                                            "created_utc": 1670481197.0,
                                            "replies": [
                                                {
                                                    "body": "100% agree",
                                                    "author": "GSSD",
                                                    "id": "izdxx58",
                                                    "parent_id": "t1_izd9ofl",
                                                    "score": 2,
                                                    "created_utc": 1670501004.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That’s not always true.",
                                            "author": "JBWentworth",
                                            "id": "izcnnol",
                                            "parent_id": "t1_izbhp3j",
                                            "score": 1,
                                            "created_utc": 1670468746.0,
                                            "replies": [
                                                {
                                                    "body": "True.... if you've been seeing the same one for a while and have a level of trust. \n\nAs a guy who's visited & reviewed escorts, if they don't know you, they will demand payment up front. Can they take the cash & run (CND)? Yes. Thats just part of the chance you take. Or you hand them the cash and suddenly \"angry boyfriend/husband\" comes into the room or comes home, sometimes waving a gun around. Its all part of the game.\n\nThis is why I prefer a SB/SD relationship. There's a level of trust.",
                                                    "author": "MrRetrdO",
                                                    "id": "izd7ebq",
                                                    "parent_id": "t1_izcnnol",
                                                    "score": 6,
                                                    "created_utc": 1670479601.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Given the number of scammers in the world it is reasonable for the SB to ask that it be delivered prior to intimacy on the first meet.  Actually she should not need to ask.  However, it is probably wise to cover the issue prior to arrival at the place of intended consummation.  \"For our first meeting I would feel better if we could get the financial stuff out of the way so we can fully enjoy our time.\"  \n\nIt is not an unreasonable request but also is best confirmed prior to the meeting.  Later on you can do whatever seems reasonable.  \n\nA final bit of preventive maintenance is to let the SB know that you will never decrease the amount without discussing it with her and so if the amount is not correct she would be doing you a favor by speaking up.",
                    "author": "pinotandsugar",
                    "id": "izbrgrj",
                    "parent_id": "t1_izb94h9",
                    "score": 19,
                    "created_utc": 1670454331.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "izbece0",
                    "parent_id": "t1_izb94h9",
                    "score": 6,
                    "created_utc": 1670448986.0,
                    "replies": [
                        {
                            "body": "Especially for a first intimate meet I think it is helpful to make sure she has it prior. Of course in an envelope.",
                            "author": "pinotandsugar",
                            "id": "izbrrq0",
                            "parent_id": "t1_izbece0",
                            "score": 9,
                            "created_utc": 1670454460.0,
                            "replies": [
                                {
                                    "body": "I like to use Greeting Cards. Just a nice touch.",
                                    "author": "MrRetrdO",
                                    "id": "izd7jv6",
                                    "parent_id": "t1_izbrrq0",
                                    "score": 3,
                                    "created_utc": 1670479702.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Almost what I said lol. Agree 100%.  Way too many escorts giving bad advice here.",
                    "author": "RedHeavyG603",
                    "id": "izbw4vm",
                    "parent_id": "t1_izb94h9",
                    "score": 6,
                    "created_utc": 1670456329.0,
                    "replies": []
                },
                {
                    "body": "If she is going to grab the money and run before intimacy it's perhaps a great benefit to the SD.....  If she waited until after she might have left with his kidney and her boyfriend waiting in the car with an ice chest.",
                    "author": "pinotandsugar",
                    "id": "izd6ksc",
                    "parent_id": "t1_izb94h9",
                    "score": 4,
                    "created_utc": 1670479047.0,
                    "replies": [
                        {
                            "body": "I always look the door. In hotel rooms after it shuts behind me whether I am Alone, with an sb, or with a vanilla partner. I’m paranoid I guess idk.",
                            "author": "ntxstud007",
                            "id": "izdfhx8",
                            "parent_id": "t1_izd6ksc",
                            "score": -1,
                            "created_utc": 1670485732.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yup a potential SB suddenly “felt bad” after getting the cash.",
                    "author": "k815",
                    "id": "izbw7xa",
                    "parent_id": "t1_izb94h9",
                    "score": 1,
                    "created_utc": 1670456366.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "izcqnxr",
                    "parent_id": "t1_izb94h9",
                    "score": -8,
                    "created_utc": 1670470198.0,
                    "replies": [
                        {
                            "body": "I give it up front. Especially on the first intimate date. \nAs I want her to be relaxed and comfortable, and not thinking about the ppm or allowances. \n\nIdk it’s like why keep that hostage, and there’s a saying…. \nYou don’t pay escorts to show up you pay her to leave… \nJust saying, and I’m also not paying my sb for sex I’m giving her money for financial support and to benefit her. \n\nSo to me giving it afternoon is kind of awkward. for both parties. \n\nAlso, by giving it up front especially in the early stages, allows you to see what happens after y’all get done for the first time. Like if you give it up front you finish and she immediately gets up , gets dressed inns peaces out well….  She’s not that into you",
                            "author": "ntxstud007",
                            "id": "izdgpu5",
                            "parent_id": "t1_izcqnxr",
                            "score": 5,
                            "created_utc": 1670486739.0,
                            "replies": [
                                {
                                    "body": "“I am also not paying my SB for sex….. financial assistance “ trust me without financial assistance there is no sex. I do not understand the word salad used to explain a financial transaction.",
                                    "author": "SmallOccasion8321",
                                    "id": "ize3i1i",
                                    "parent_id": "t1_izdgpu5",
                                    "score": 0,
                                    "created_utc": 1670504540.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would have left as well. There’s no guarantee he would have given you the money after and his refusal to acquiesce to your reasonable request was alarming. There’s a good chance you dodged a huge bullet.",
            "author": "mysticalheavensawait",
            "id": "izb8oir",
            "parent_id": "t3_zfdcjd",
            "score": 48,
            "created_utc": 1670446646.0,
            "replies": [
                {
                    "body": "100% this. His entire demeanor here was a red flag. While it may have felt awkward, you made the right call to nope the fuck out, good job! And better luck with the next one.",
                    "author": "DesertShae",
                    "id": "izbzgcn",
                    "parent_id": "t1_izb8oir",
                    "score": 16,
                    "created_utc": 1670457786.0,
                    "replies": [
                        {
                            "body": "Agreed. You dodged a bullet with a guy who’s at minimum insensitive and possibly a complete scammer…..\nIf he doesn’t make you feel comfortable - next.",
                            "author": "ChitownWanderlust",
                            "id": "izc6eln",
                            "parent_id": "t1_izbzgcn",
                            "score": 15,
                            "created_utc": 1670460892.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sorry this happened but I'm glad you were able to get out. Disagree with the people here who say it is not real life to expect money first. Of my four ABs three asked for it ahead on first intimate meeting and the one who didn't I gave anyways. The risks are asymmetrical: in the unlikely even the SB dashes from hotel room with cash, a man with excess money is out funds. If an SD stiffs an SB, a woman who does not have excess cash is out money and on top of that feels sexually abused.",
            "author": "IndividualSeaweed969",
            "id": "izbm7ik",
            "parent_id": "t3_zfdcjd",
            "score": 41,
            "created_utc": 1670452136.0,
            "replies": []
        },
        {
            "body": "My SB asked for it up front the first time, which I was happy to provide.  She hasn’t asked since and sometimes I do before if I remember or if not it’s at the end of the date.  \n\nWhen it’s a first intimate date you should get it up front.  After you’ve established trust do whatever works for you.",
            "author": "SugarlifeAlt",
            "id": "izbckm6",
            "parent_id": "t3_zfdcjd",
            "score": 27,
            "created_utc": 1670448244.0,
            "replies": []
        },
        {
            "body": "I think you’re right to ask upfront because I’ve had guys lie about allowances and it’s truly such a gut punch and gross feeling. I feel like trust should be earned on both sides especially during the very first intimate date. My SD paid me for a platonic talk as he saw Id been scammed before and it got us off to a great start. It made intimacy more comfortable for me and more enjoyable for us. You’ll find someone real",
            "author": "Equivalent_Newt_6969",
            "id": "izbcfnh",
            "parent_id": "t3_zfdcjd",
            "score": 36,
            "created_utc": 1670448184.0,
            "replies": []
        },
        {
            "body": "You’re not wrong. I’ve had 2 experiences where ppm was not given after intimacy. I was going to come here to ask for advice as to how to approach it moving forward, because it is a very bad feeling. I don’t want to make it “transactional” and seem all about the money, but, just as SDs have had bad experiences, so have I. Protecting yourself on all accords is a must. 😘Thanks for asking",
            "author": "calidotcom",
            "id": "izc02ap",
            "parent_id": "t3_zfdcjd",
            "score": 14,
            "created_utc": 1670458057.0,
            "replies": []
        },
        {
            "body": "I put it in plain view on the desk and she can take it before or after…\n\nThis is at the end of a nice date where she already wants me or at least has me fooled enough for me to have fun.\n\nIn your case it sounds like a power play and is a big red flag.",
            "author": "MattiasMars",
            "id": "izce9py",
            "parent_id": "t3_zfdcjd",
            "score": 14,
            "created_utc": 1670464424.0,
            "replies": []
        },
        {
            "body": "1. Yes, you made a good call leaving.  Nice job, it's not easy to do!\n2. If your date was you showing up to the hotel for sex, and you went along with that, you should put your activities in the sugar world on hold until you do a little more research about what a sugar relationship is.  \"show up at the hotel\" is a red flag that you should have recognized, and would have let you  nope out before the date even started, much less the waxing!\n3. As far as how PPM is usually handled, I need three hands to tell you.  On the one hand, in the wide world of sugar, SBs almost never ask for the PPM before sex (mostly because they're scared to), so it's handled after sex.   On the other hand, this is exactly why so many SBs get scammed, and why slf recommends you ask for it before sex.  On the third hand, given that it isn't the norm, I do always say that you should expect your SD to be a little surprised when you ask for it beforehand... *but he should still understand your concern and comply*.  I've never heard a story where the SD tried to guilt and shame an SB out of getting it beforehand, that ended well.   He gives it, or walk, is the suggestion.",
            "author": "Azurecole",
            "id": "izb8vw0",
            "parent_id": "t3_zfdcjd",
            "score": 33,
            "created_utc": 1670446725.0,
            "replies": [
                {
                    "body": "\\#2 is spot on. In my opinion that is a bad sign. He's using sugaring to get a girl friend experience and pay less. Him even saying to you \"that's what escorts do\" is trashy af.\n\nTo the point below, I've had SRs that were strictly indoor, for long periods of time, but we had already established a great rapport over some time.\n\nOP, think back to this: How did you feel walking up to the hotel door, going into the room, seeing him in bed, immediately talking about the PPM because it wasn't on the table?\n\nNow, how would you have felt if he said: \"Let's meet at x and have a drink and a light bite to eat, if we're hungry later we can eat room service. You look amazing, what would you like to drink, wow, I feel so lucky to have met you. How was your day? That dress is stunning. You look better each time I see you. I love sitting across the table from you and anticipating later.\"",
                    "author": null,
                    "id": "izcmxo6",
                    "parent_id": "t1_izb8vw0",
                    "score": 6,
                    "created_utc": 1670468401.0,
                    "replies": []
                },
                {
                    "body": "Regarding your #2 point what is so bad about going to a hotel for the “date”? What’s the difference between that and going to a SD’s house as a date? Some are date dates and some could just be meeting for sex which is what the basis of a lot if not all SR is 🤷‍♀️ and sometimes it’s good to get the first time out of the way especially if you’ve had a lot of convos and a M&G already",
                    "author": "Notsobabysugarbaby",
                    "id": "izbb53o",
                    "parent_id": "t1_izb8vw0",
                    "score": 9,
                    "created_utc": 1670447625.0,
                    "replies": [
                        {
                            "body": "Agreed. My SB and I rotate every other date, one being an experience - concert, show, etc. and the other being just sex, and always at a hotel. I wouldn’t count that as a bad sign or red flag on its own.",
                            "author": "nordicman21",
                            "id": "izbd8my",
                            "parent_id": "t1_izbb53o",
                            "score": 6,
                            "created_utc": 1670448535.0,
                            "replies": []
                        },
                        {
                            "body": "Obviously there's room to disagree here, but for the most part we're trying to build a sugar *relationship*.  Like any relationship -- e.g., if you were vanilla dating -- typically the first real date isn't \"show up to my place, have sex\".  It's wining, dining, getting to know each other, him romancing her a bit, she seducing him a bit.  Yes, it's sugar, so financial support and sex are understood -- but that's not ALL there is, otherwise most of us don't think it's sugar.   And **especially** for the first date, there should be more than sex and money.\n\nIn most cases, even going to an SD's house for a date, is preceded by having dinner together out, or even him  cooking dinner, or some other effort to make this a date, not a sex appointment.  Speaking of which, the #1 reason the first date shouldn't be a \"go to the hotel for a sex date\" is... 100% of the time if that's the first date he designed, he's a john, and she's looking for an SD.",
                            "author": "Azurecole",
                            "id": "izbd26m",
                            "parent_id": "t1_izbb53o",
                            "score": 19,
                            "created_utc": 1670448456.0,
                            "replies": [
                                {
                                    "body": "I see what you’re saying and I don’t disagree in theory. But I think every SR is different and even if it’s just sexual for the most part it doesn’t mean the guy is a John",
                                    "author": "Notsobabysugarbaby",
                                    "id": "izbe0hb",
                                    "parent_id": "t1_izbd26m",
                                    "score": 5,
                                    "created_utc": 1670448860.0,
                                    "replies": [
                                        {
                                            "body": "I think if it's just sexual, for me, that's where it's left sugar. A strict sex-and-money exchange just that, it isn't sugar to me, no reason to call it that.\n\nThat said, I do think there's sugar relationships where both people want discretion, and they meet at a hotel room or one of their homes... but usually these still include the wining and dining, watching a movie together, etc.  I can see it, even though it's not something I'd want to be in.  But I don't think actual SDs propose just-sex dates, at least according to my concept of what sugar is",
                                            "author": "Azurecole",
                                            "id": "izbg4uz",
                                            "parent_id": "t1_izbe0hb",
                                            "score": 7,
                                            "created_utc": 1670449676.0,
                                            "replies": [
                                                {
                                                    "body": "Yes I agree with you. And I’m not saying that’s what mine are/were like. I just think sometimes they can be quickie or sex dates and not always wining and dining. With genuine connection ofc. But I prefer intelligent conversation and quality time together to just expensive dinners. Like being in a hotel room and having our own party with great conversation and sex - I like that. It doesn’t feel transactional to me bec I make sure I have a genuine connection with a SD first. And I realize this was a first time date for her but even so, I am a very sexual person and if I had already talked on the phone with a person and had a M&G that went well, I would absolutely be intimate in that scenario",
                                                    "author": "Notsobabysugarbaby",
                                                    "id": "izbndb9",
                                                    "parent_id": "t1_izbg4uz",
                                                    "score": 3,
                                                    "created_utc": 1670452621.0,
                                                    "replies": [
                                                        {
                                                            "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
                                                            "author": "Azurecole",
                                                            "id": "izbnrr5",
                                                            "parent_id": "t1_izbndb9",
                                                            "score": 4,
                                                            "created_utc": 1670452788.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Odds are very high 📈 he's a John.",
                                            "author": null,
                                            "id": "izbgi1k",
                                            "parent_id": "t1_izbe0hb",
                                            "score": 3,
                                            "created_utc": 1670449821.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If it’s just sexual… he’s paying you for sex… then he is literally a John and you are literally a prostitute.",
                                            "author": "tempsdforfuns",
                                            "id": "izbh09k",
                                            "parent_id": "t1_izbe0hb",
                                            "score": 1,
                                            "created_utc": 1670450019.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah I actually prefer hotels for intimate dates especially in the beginning as they’re safer for both parties. A young girl walking into a man’s property is vulnerable. He could have friends there waiting",
                            "author": "Equivalent_Newt_6969",
                            "id": "izbcqiz",
                            "parent_id": "t1_izbb53o",
                            "score": 5,
                            "created_utc": 1670448316.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely made a good call! Who knows if that “flash of cash” was your agreed on ppm? He might be an experienced SD (doubtful) but trust is a key factor! He should recognize the newness and respect that! He didn’t. \n\nRed flags all around! Glad you got out safe and stood your ground.",
            "author": "chiquitabrilliant",
            "id": "izc25zb",
            "parent_id": "t3_zfdcjd",
            "score": 16,
            "created_utc": 1670458993.0,
            "replies": []
        },
        {
            "body": "Depending on which part of reddit you are on, you will see a variety of thoughts on whether to give money before or after. Clearly, whoever yields first is bearing a risk. \n\nIt really comes down to a sugar daddy is more able to handle the risk than a sugarbaby.",
            "author": "zapzangboombang",
            "id": "izcv3a6",
            "parent_id": "t3_zfdcjd",
            "score": 7,
            "created_utc": 1670472416.0,
            "replies": []
        },
        {
            "body": "You absolutely made the right decision. For your comfort, he should always give you the money first.",
            "author": "RealEarthAngel",
            "id": "izbcli9",
            "parent_id": "t3_zfdcjd",
            "score": 15,
            "created_utc": 1670448255.0,
            "replies": []
        },
        {
            "body": "homeboy on some weird power trip. you did good.",
            "author": "xa3D",
            "id": "izco198",
            "parent_id": "t3_zfdcjd",
            "score": 12,
            "created_utc": 1670468925.0,
            "replies": []
        },
        {
            "body": "My thoughts?\n\nFake SD \n\nI know what I offer it doesnt cause financial pain. Ive sent it before SBs have even made it to the venue.\n\nI have done it all sorts of ways, but in the begimning always 1st before intimacy, always gifts and some spoiling before anything happens.\n\nPay it forward!! Make their life better for meeting you!!",
            "author": "bookworm010101",
            "id": "izc1os8",
            "parent_id": "t3_zfdcjd",
            "score": 14,
            "created_utc": 1670458780.0,
            "replies": [
                {
                    "body": "This",
                    "author": "OHshySB",
                    "id": "izdbg0c",
                    "parent_id": "t1_izc1os8",
                    "score": 2,
                    "created_utc": 1670482505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did the right thing. It is not ok for him to behave like that. Mutual trust matters. Congratulations for calling it off before going in deeper.",
            "author": "WhoKnowsCurious",
            "id": "izcycd8",
            "parent_id": "t3_zfdcjd",
            "score": 11,
            "created_utc": 1670474123.0,
            "replies": []
        },
        {
            "body": "I always provide the PPM before sex. It is there waiting for her in a white envelope when she walks in. She is free to check it out or count it. I’ve never seen a SB do that, but I have seen some put it in her purse, then go to the restroom before sex and I assume they check out the envelope to make sure.\n\nI have been robbed by a SB. She grabbed the PPM and ran. I did everything wrong and ignored every red flag (I was horny and stupid). As she took off my only thought was “yeah, that seems about right”. It doesn’t change the fact that I provide the PPM first, only that I vet better.\n\nThere are a few reasons I provide the PPM first:\n\n1. You are putting a lot of trust in me to show up at a private place with a man you barely know. You are risking so much, I can risk losing a few hundred bucks.\n2. There is no better way to show you I’m worthy of your trust. Once you see that I’ve honored our deal you will relax. Knowing you are taken care of and with a man who will do what he says makes you more open to enjoy the sex, which is very good for me.\n3. I don’t want you to have sex with me if you don’t want to. I always tell a new SB that if she isn’t 100% comfortable we will stop, at any point. I could see one girl was becoming overwhelmed during sex, I stopped and asked if she was okay, she wasn’t. We stopped, got dressed, cuddled and talked and nothing more happened that day. But it did not effect her PPM, it isn’t conditional. I never want a woman to regret having sex with me, or be traumatized in any way. (Fwiw: with that girl I assumed sugaring wasn’t for her and we wouldn’t meet again, but she was very persistent that she wanted another date, I agreed and she fucked my brains out, she just needed to know she was safe).",
            "author": "TwerkingAvocado",
            "id": "ize7h0j",
            "parent_id": "t3_zfdcjd",
            "score": 6,
            "created_utc": 1670506728.0,
            "replies": []
        },
        {
            "body": "This is where I think sugar gets a bad name. \n\nEverybody is in such a rush nowadays that they don’t take the time to really get to know someone so that there is more trust involved. \n\nWhen I was first in the bowl, I was usually expecting a m&g, then a dinner then after that dinner and personal time later on.  \n\nBut to go straight from a m&g to a full intimate date when you’re not entirely sure or trust that person - well I don’t know it just seem strange and maybe forced a little. \n\nanyway better luck for next time and maybe go on more platonic dates first",
            "author": "Jonconnerysd",
            "id": "izbgj35",
            "parent_id": "t3_zfdcjd",
            "score": 17,
            "created_utc": 1670449833.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "izdqtrp",
                    "parent_id": "t1_izbgj35",
                    "score": 0,
                    "created_utc": 1670495424.0,
                    "replies": [
                        {
                            "body": "yes alas I think you’re right",
                            "author": "Jonconnerysd",
                            "id": "izdx4ph",
                            "parent_id": "t1_izdqtrp",
                            "score": 1,
                            "created_utc": 1670500446.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't worry about whether he might have given you the money at the end. If you had slept with him, you would have risked feeling gross, used and unworthy, in the event he didn't give you the PPM. Besides that, you would have been letting someone penetrate you who was fine with you being anxious and frightened during the sex- not really the attitude of a guy who's cut out for a long term SR, anyway. \n\nHopefully this was just meant to be side income, and you aren't desperate for money. If so, the few hundred dollars you may have missed out on wasn't worth the risk to your mental well being. A year or ten years from now, that money would have been long since spent, but the memory of being used would stay with you.",
            "author": "uptiedand8",
            "id": "izc3zbb",
            "parent_id": "t3_zfdcjd",
            "score": 11,
            "created_utc": 1670459812.0,
            "replies": [
                {
                    "body": "Absolutely",
                    "author": "calidotcom",
                    "id": "izc4z21",
                    "parent_id": "t1_izc3zbb",
                    "score": 6,
                    "created_utc": 1670460253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did good leaving. Also, he was going to “TIP” you? \nHe wasn’t going to give you the PPM you agreed to. What a loser.",
            "author": "Parrotsandpeanuts",
            "id": "izb8vvh",
            "parent_id": "t3_zfdcjd",
            "score": 11,
            "created_utc": 1670446725.0,
            "replies": [
                {
                    "body": ">Also, he was going to “TIP” you?\n\nGiven that the date was \"showing up to the hotel for sex\", rather than the type of date that normally happens in sugar, I suspect he was a john thinking of this as a sexwork service, so he's using terms he'd use with an escort -- he'll \"tip\" her, etc.   The red flag happened well before she ever got in the room.",
                    "author": "Azurecole",
                    "id": "izb9ejt",
                    "parent_id": "t1_izb8vvh",
                    "score": 10,
                    "created_utc": 1670446927.0,
                    "replies": [
                        {
                            "body": "It’s strange because if he viewed it as an escort service he would have given money upfront. I think he was probably a John going on sugar sites to trick girls… or somehow he mixed up escorting and sugaring and managed to break the rules for both in one go. Agreed tho- she shouldn’t have gone to a hotel for the second date if this is sugaring.",
                            "author": "Parrotsandpeanuts",
                            "id": "izcby62",
                            "parent_id": "t1_izb9ejt",
                            "score": 8,
                            "created_utc": 1670463384.0,
                            "replies": [
                                {
                                    "body": "Exactly.  These guys sure tips on their forums on how easy it is to manipulate SBs.  A lot easier than manipulating an experienced escort, obviously.  That's exactly what I think happened, he invited her to a sex-service date, but was pre-armed with \"pay after\" manipulations to  scam her out of some of the promised PPM",
                                    "author": "Azurecole",
                                    "id": "izcle2o",
                                    "parent_id": "t1_izcby62",
                                    "score": 5,
                                    "created_utc": 1670467676.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always, always provide the gift before clothes come off.\n\nYou have a young girl, nervous of the situation and the least you can do is to help her relax.\n\nIf you are worried about the girl running, then it is a lower risk than you refusing to give her gift.\n\nBe a decent person, help the girl relax. Maybe your experience would be better if you do that.\n\nNow, I do double lock the door just so no one gets in... I don't really know what I would do if she tries to run....",
            "author": "Worldly_Forever_9353",
            "id": "izbi8ku",
            "parent_id": "t3_zfdcjd",
            "score": 11,
            "created_utc": 1670450506.0,
            "replies": []
        },
        {
            "body": "I would never suggest starting the intimacy without you getting your money. How will you enjoy the intimate act without feeling secure? That’s on him. You did the right thing, sweetheart. \n\nAnyone who tells you to give hun the benefit of the doubt is wrong.",
            "author": "AdUpbeat1526",
            "id": "izbga90",
            "parent_id": "t3_zfdcjd",
            "score": 16,
            "created_utc": 1670449737.0,
            "replies": []
        },
        {
            "body": "To OP, these are details that should be vetted out prior to meeting.  Why? Well there are two camps. Before and after.  If we were chatting, I’d get this out of the way real fast. It’s ok to hold your ground. If I say I won’t do that, then move on, your not changing my mind. Won’t try to change yours. \n\nYou will find someone for you. Takes time. \nTrust your gut feeling always!",
            "author": "wyattgr",
            "id": "izbq87g",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670453810.0,
            "replies": []
        },
        {
            "body": "So most SD's 'don't want it to be all about money, or feeling transactional'. So what do they do?\n\nThey start haggling about the money and completely ruin the mood and make it *ALL* about money. Just because....  they don't want it to be about the money they will have to give you anyway!\n\nBecause hey! Why would you give it in a nice and discreet way before, and calm her nerves! After all, you don't want a relaxed SB who's mind is free of worries and full of carefree fun, would you? /s\n\n\"But... but ... she can run off with it! \"  Yes she can. Would you really have preferred she'd stayed and grinded her way through sex with you in that case?",
            "author": "A-touchofreality",
            "id": "izbp845",
            "parent_id": "t3_zfdcjd",
            "score": 12,
            "created_utc": 1670453395.0,
            "replies": []
        },
        {
            "body": "How I do things:\n\nIt’s a gift, not payment. It’s in an envelope and pointed out to you as soon as possible after you enter without making things awkward. (“Your gift is there for whenever you want it?”) \n\nIt is called a gift and not payment because it is a gift. If you grab it and walk out, so be it. I’ll never schedule a date with you again, but whether I got laid or not, the money was already given away in my mind. \n\nI’ve never had someone grab it and go count it - always been trusted and that makes me glad. But if a SB wanted to go count, she could. Perhaps this is because I always gift a bit at the M&G - and a good little bit (~20-30% of PPM) if I really want to see them again. Establishing generosity before intimacy has probably already set them at ease. That is mission accomplished. \n\nI also always give more than we agreed to. Maybe just a very small amount more at times, but I’m going to spoil with gifting, not pay for a service. \n\nI’ve more than once had to remind someone of their gift as they were leaving.\n\nThere is more than one right way to do things, but the SD should take control and remove anxiety for the SB. The above allows me to do that.",
            "author": "GenIISD",
            "id": "izbtvco",
            "parent_id": "t3_zfdcjd",
            "score": 8,
            "created_utc": 1670455354.0,
            "replies": []
        },
        {
            "body": "I leave the money in clear view either on her side of the bed or on the coffee table so that she knows it's there. No one has ever asked me for money upfront but it might be because they can see the money. \n\nIf she is too proud or shy to pick the money then I just pick it up and put it on top of her bag at the end of the date and walk to the bathroom. This way she can put it in her bag without feeling embarassed, not that this is something to be embarrassed about but new SBs can find it awkward sometimes.",
            "author": "chemistryromance",
            "id": "izbep6x",
            "parent_id": "t3_zfdcjd",
            "score": 6,
            "created_utc": 1670449120.0,
            "replies": []
        },
        {
            "body": "Cash inside a blank greeting card in plain sight with the SB's name on it. Most of the time it gets left there until after but occasionally she'll take it into the bathroom and check.",
            "author": "StunnedSilencer",
            "id": "izc2yed",
            "parent_id": "t3_zfdcjd",
            "score": 6,
            "created_utc": 1670459351.0,
            "replies": []
        },
        {
            "body": "Just give the money at beginning of the date and if you get rinsed who gives a fuck?  Its just a lay - plus  Its not going to happen a lot.",
            "author": "JDMultralight",
            "id": "izc3l8g",
            "parent_id": "t3_zfdcjd",
            "score": 8,
            "created_utc": 1670459637.0,
            "replies": []
        },
        {
            "body": "I just leave it at the table and say is her money, he can take it before or after the intimacy.",
            "author": "k815",
            "id": "izbw26k",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670456296.0,
            "replies": []
        },
        {
            "body": "I was so worried until you said you left. Never have a MG at a hotel. You could’ve been in so much danger. Real guys don’t care and want you to feel safe. Thank god you left.",
            "author": "Forsaken-Smile-1129",
            "id": "izehas6",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670511305.0,
            "replies": []
        },
        {
            "body": "Really?  If you think about it who is at risk here?  If SB runs off with money and I get no sugar it is really minimal in the grand scope, the risk to me is relatively small.  If an SD gets burned, I’m sure it happens but you didn’t invest several hours getting thirsty not to get a drink.  \n\nHonestly I want her to feel comfortable, not worry about anything and focus on ME ( selfish about this really).  The SB needs the money and the fear is being salted is real and positively devastating, because if it happened it would be.",
            "author": "geekinkc",
            "id": "izbzbhf",
            "parent_id": "t3_zfdcjd",
            "score": 8,
            "created_utc": 1670457725.0,
            "replies": []
        },
        {
            "body": "As a sugar daddy, I provide ppm first. We need to build trust and the financial risk to me is less important than the risk sugar babies are taking by trusting someone to pay after. \n\nGuy gotta stop acting like his dollars are so important",
            "author": "JorgeHowardSkub",
            "id": "izc4af7",
            "parent_id": "t3_zfdcjd",
            "score": 9,
            "created_utc": 1670459949.0,
            "replies": []
        },
        {
            "body": "There are scammers on both sides. If a SD is worried about losing one PPM worth of money on a rip-off vs establishing trust with a new potential SB he shouldn't be there. The PPM should be out and visible (in an envelope) so there is no stress. Don't be upset if it's counted and giving any additional amount after the date is separate and appreciated so the excuse is pretty empty.",
            "author": "GettingTwoOld4This",
            "id": "izd95uk",
            "parent_id": "t3_zfdcjd",
            "score": 5,
            "created_utc": 1670480821.0,
            "replies": []
        },
        {
            "body": "I’ve only been asked for money up front once but she didn’t scam me.\n\nI would like to introduce you to what I call the underwear rule.  If you haven’t received your ppm by the time you are in your underwear now is the time.  It’s not like you can leave the hotel room in your underwear so your SD should be pretty well at ease that it’s a done deal.",
            "author": "Starshogun1",
            "id": "izbguqs",
            "parent_id": "t3_zfdcjd",
            "score": 8,
            "created_utc": 1670449960.0,
            "replies": []
        },
        {
            "body": "I give it first and make it fun.. she lies down on the bed and I shower her with 100 dollar bills!",
            "author": "TastySugarBite",
            "id": "izbcavp",
            "parent_id": "t3_zfdcjd",
            "score": 7,
            "created_utc": 1670448128.0,
            "replies": []
        },
        {
            "body": "Am I the odd one out for never taking money in the beginning? That seems weird ..like ..you don't pay someone before they do their job .. \nMy SDs always give me the ppm at the end of the night before we part ways. \nI've never been stiffed",
            "author": "BlondieSanto",
            "id": "izbtlvb",
            "parent_id": "t3_zfdcjd",
            "score": 6,
            "created_utc": 1670455245.0,
            "replies": []
        },
        {
            "body": "Did I miss a memo? Are we supposed to tip SBs now. It’s so hard to keep up.",
            "author": "nordicman21",
            "id": "izbcv4w",
            "parent_id": "t3_zfdcjd",
            "score": 4,
            "created_utc": 1670448371.0,
            "replies": [
                {
                    "body": "Is this where we have another 15% vs 18% vs 20% debate? LOL",
                    "author": "BinghamtonSD",
                    "id": "izbzoow",
                    "parent_id": "t1_izbcv4w",
                    "score": 2,
                    "created_utc": 1670457892.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes 👍 you made a good call 👋 leaving.",
            "author": null,
            "id": "izbedv5",
            "parent_id": "t3_zfdcjd",
            "score": 5,
            "created_utc": 1670449001.0,
            "replies": []
        },
        {
            "body": "I’ve never had a SB ask for it upfront, but wouldn’t care if she did. \n\nI typical slip it into her purse or jacket when she uses the restroom",
            "author": "throwawaymeter",
            "id": "ize0xux",
            "parent_id": "t3_zfdcjd",
            "score": 2,
            "created_utc": 1670503000.0,
            "replies": []
        },
        {
            "body": "Someone will eventually post a story of how their SB took the ppm and left the room while they were in the bathroom. \n\nSome SB will eventually post a story of the SD leaving the room without leaving the ppm while they were in the bathroom.  \n\n🤷🏻‍♂️",
            "author": "TheDallasReverend",
            "id": "izb90ro",
            "parent_id": "t3_zfdcjd",
            "score": 8,
            "created_utc": 1670446778.0,
            "replies": []
        },
        {
            "body": "Best Call you have made all day :-)\n\nWhen you arrive at the designated location for the intimacy - then any 'gentleman' will provide the payment up front without hesitation or question. \n\nTotal BS - if he wanted to 'Tip' he can do that at any time - he just wanted to see if he could pump you - say you were no good (no matter HOW stellar you were) and then skip the payment. \n\nTOTAL ASS HAT\n\nCould an SB run out the door? Yes - and So What? \n\nThe risk at that point to the SD is minimal vs. the risks for an SB to get Not Paid.   \nBest to set this expectation up front on your next event planning date.",
            "author": "sd424242",
            "id": "izbrpvt",
            "parent_id": "t3_zfdcjd",
            "score": 5,
            "created_utc": 1670454439.0,
            "replies": []
        },
        {
            "body": "I’ve always given PPM after, and never had a girl question it.\n\nBut if they did, I wouldn’t be a dick about it.\n\nGood call to just leave.",
            "author": "NotAnEngineer287",
            "id": "izbn56k",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670452525.0,
            "replies": []
        },
        {
            "body": "I typically cashapp the ppm or allowance to them the minute they step into room.",
            "author": "Kooky-Ad-1792",
            "id": "izc2zt2",
            "parent_id": "t3_zfdcjd",
            "score": 4,
            "created_utc": 1670459368.0,
            "replies": []
        },
        {
            "body": "You did nothing wrong.\n\nYou need to ignore the whole ‘the tip means he is a John’ or ‘the date shouldn’t of happened in a hotel’\n\nSD’s have an issue within them for paying for it so they made the bowl rules so they don’t feel like a ‘John’.\n\nIt’s ok, it’s an ego thing. No judgement.\n\nAlways get the money up front cause ou do run the risk of not getting paid at the end BECAUSE of those issues.\n\nNot to mention many escort clients on other forums say they love be the bowl cause it’s cheaper and they can train new SB’s how they want.\n\nYou did everything right.",
            "author": "ellechi2019",
            "id": "izbn0bp",
            "parent_id": "t3_zfdcjd",
            "score": 4,
            "created_utc": 1670452469.0,
            "replies": []
        },
        {
            "body": "Collecting the PPM is the safest thing to do and many(most) of us practice it and recommend that others do it.   \n\nBut there are OPs in this space who purport to be good SDs who will not ever pay before intimacy. Many have been burned by a cash and dash. You possibly lost a good SD, but I still think you did the right thing.  The best thing to do with future Pots, when you are ready to sign on the dotted line, is tell him that you expect your allowance in the hotel room before any intimacy occurs. If he objects then it will come out before the embarrassing hotel event.",
            "author": "GSSD",
            "id": "izbhcsk",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670450156.0,
            "replies": []
        },
        {
            "body": "You were both in the wrong.  \n\nDespite what SLF tells you, real world SBs do not generally ask for PPM before clothes come off, so he is perfectly correct in saying it’s uncommon.   I’m not saying it’s a good idea to wait nor am I saying that you shouldn’t ask, but if you ask, you should ask gently because it *is* uncommon and it *will* be a red flag for some men.   \n\nHowever, once you asked, he had to make a decision to give it to you (which really seems to be the only realistic option) or ask you to leave.  There’s no 10 minute discussion, either he’s willing to give it or not.   Even worse, the idea of a “tip” is for sex workers, not SBs.",
            "author": "tempsdforfuns",
            "id": "izbgi2j",
            "parent_id": "t3_zfdcjd",
            "score": 4,
            "created_utc": 1670449821.0,
            "replies": [
                {
                    "body": "Agreed",
                    "author": "SmallOccasion8321",
                    "id": "izd0u5f",
                    "parent_id": "t1_izbgi2j",
                    "score": -1,
                    "created_utc": 1670475505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have never given ppm before intimacy and it would feel a bit transactional to me. In fact, I never handed ppm once to a SB. I just wait for my lady to use the restroom and place an envelope in a pocket of her coat or in her purse (just through the opening, don't go through her stuff lol). Then, wisper in her ear where I left the gift. \n\nAt the same time, I would have no problem handing it first if asked but I have to say that it would count negatively in my book on the ability to establish a genuine connection. Probably it shouldn't but it does psychologically for me.\n\nWith that in mind, that gentleman gave all the wrong answers and strange reaction, I would have also doubted his sincerity under your circumstances.\n\nYou should not be stiffed and it seemed you got all the wrong vibes. In fact, at best, I suspect he intended to provide less than the agreed-upon alllowance. I believe that you did the right thing.\n\nPlease be safe out there!",
            "author": "NaturalNo7512",
            "id": "izca310",
            "parent_id": "t3_zfdcjd",
            "score": 4,
            "created_utc": 1670462542.0,
            "replies": []
        },
        {
            "body": "He would have ghosted you if you didn’t get the money first. Good for you for not going for it. Screw him. His loss. He knows better than to try and play that shit.",
            "author": "lcastill1",
            "id": "izchb6c",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670465795.0,
            "replies": []
        },
        {
            "body": "I’ve always given PPM after, and never had a girl question it.\n\nBut if they did, I wouldn’t be a dick about it.\n\nGood call to just leave.",
            "author": "NotAnEngineer287",
            "id": "izbn2or",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670452497.0,
            "replies": []
        },
        {
            "body": "cash and dash is a thing in first meets. ... no doubt he could have gained your trust if he was sincere.. if he was the experienced one its on him to make you comfortable and help you past the trust issue.. sorry to hear.",
            "author": "atxdaddio44",
            "id": "izcpx9e",
            "parent_id": "t3_zfdcjd",
            "score": 2,
            "created_utc": 1670469839.0,
            "replies": []
        },
        {
            "body": "This is where the disconnect between SLF and real life comes in. I’ve never had a new SB ask for the ppm upfront before sex, if she did I would probably not feel good about it, but I’d give her the money anyway and assume I was about to be scammed. It’s just not normal at all for SB’s to ask for ppm beforehand. \n\nHere’s something I think you can do for next time. Before the date, let them know that you would appreciate it if they had the ppm visible in the room before sex, just for safety purposes.",
            "author": "NewYorkSD",
            "id": "izbb2ed",
            "parent_id": "t3_zfdcjd",
            "score": 1,
            "created_utc": 1670447593.0,
            "replies": [
                {
                    "body": "I agree never had this happen in NY",
                    "author": "SmallOccasion8321",
                    "id": "izd0w5h",
                    "parent_id": "t1_izbb2ed",
                    "score": 0,
                    "created_utc": 1670475537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone here counsels money first. Everyone on other subs say the same, some more vehemently than others. But in the real world, in my experience, I have only ever been asked for it up front a few times and each time it was by a scammer who took the money and dipped. One with an elaborate scheme to do so.\n\nI always have it, I never make a big deal out of it but I also don't do the whole envelope into her purse that some SDs on here talk about. Now if an SB asks for it up front Id probably show it to her, maybe laughingly give it to her as I kiss her, but a part of me will be bracing for her to bolt. Part of me will be amused by the lack of trust while also understanding the why behind the lack of trust and also still a tiny bit hurt because by the time our clothes come off I feel like I have tried pretty hard to show my character. It would most likely be a whirlwind of thoughts.",
            "author": "Suspicious_Run_",
            "id": "izbfdel",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670449379.0,
            "replies": []
        },
        {
            "body": "Your timing sucked certainly 😂 I would have just laughed and left though.  Been an SD for over 20 years, never given anyone a PPM first and never have been asked.  I’ve also never failed to give anyone a PPM.  Yes I have been robbed a couple times before I learned how to screen better.  Outside of escorts, never heard anyone refer to a “tip” in this context so please don’t say that around your potentials if you don’t want to be nexted.  If you want your money first you can certainly ask, but I’d have discussed well in advance.",
            "author": "RedHeavyG603",
            "id": "izbvvbw",
            "parent_id": "t3_zfdcjd",
            "score": 3,
            "created_utc": 1670456213.0,
            "replies": []
        },
        {
            "body": "He probably was worried that you would quickly leave the room with the money - just as you were worried he would not give you the money after you had sex.  Too bad you two could not work that out today as it seems you were so close to doing that.  It does seem like a single meeting at the hotel rather than a sugar arrangement which usually starts with dinner out etc.., and tipping sounds more like an escort situation.",
            "author": "HappyBear1952",
            "id": "izcc2gj",
            "parent_id": "t3_zfdcjd",
            "score": 2,
            "created_utc": 1670463437.0,
            "replies": []
        },
        {
            "body": "I don't know what others do, but I've been an SD for 3 years. I always give a gift of appreciation after intimacy. I'm not sure what happened but maybe you both just didn't vibe. It happens. First time is always difficult until trust is established. I'm sorry that happened to you.",
            "author": "built4fun71",
            "id": "izbv4b5",
            "parent_id": "t3_zfdcjd",
            "score": 1,
            "created_utc": 1670455888.0,
            "replies": []
        },
        {
            "body": "Is it just me or does this sound like 100% escort/john type of thing?",
            "author": "MrObservantHere",
            "id": "izd8xlg",
            "parent_id": "t3_zfdcjd",
            "score": 1,
            "created_utc": 1670480655.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izbw5cq",
            "parent_id": "t3_zfdcjd",
            "score": -2,
            "created_utc": 1670456335.0,
            "replies": [
                {
                    "body": "That’s a perfect answer - captures the problem with the “where’s the cash” approach - would pass over the cash and just view as recreational use only. PPM word salad",
                    "author": "SmallOccasion8321",
                    "id": "izd27kc",
                    "parent_id": "t1_izbw5cq",
                    "score": 2,
                    "created_utc": 1670476322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have given at the end of date. Few times I had given ahead they poof. Sudden phone calls.. going to restroom but order me my food.. one girl though we had a compromise that I give her $ but I can hold her phone and driver lisc. We did this for months. \nI usually ask before how they handle ppm and if they say they want it at beginning I tell them I don't think it won't work. I don't try to convince them or argue it either works for us or not. Not wasting time.",
            "author": "Federal_Garage_4307",
            "id": "izbcqu0",
            "parent_id": "t3_zfdcjd",
            "score": -3,
            "created_utc": 1670448319.0,
            "replies": []
        },
        {
            "body": "I think it could have been easily resolved without walking out.    Just say (ideally before) Hey we’ve just met and there’s a mutual trust thing here … can you just make sure the ‘allowance’ is in an envelope on the side for me to pick up on my way out of the door’.   \n\nJob done … if he disagrees with that then he’s a definitely a knob and looking to short you.  I’ve never given it before but always made it available.  If someone had pushed me as hard as you did for it before hand and then walked I’d have 100% put you down as looking to stash the cash and bolt for the door … it happens!",
            "author": "OneMore97",
            "id": "izctjht",
            "parent_id": "t3_zfdcjd",
            "score": 0,
            "created_utc": 1670471622.0,
            "replies": []
        },
        {
            "body": "I always give the money as we wrap up, but the envelope is always clearly laying on the table in the room.  I’ve been in my current SR longer than I’ve been on this forum, so I honestly never considered the stress a SB might be under not receiving the gift at the start.  I’ve also never stiffed anyone, well they do get a stiffy 😂.  I did have one years ago tell me she didn’t see me put the envelope in her purse and thought I may have stiffed her",
            "author": "blk-tye",
            "id": "izd46vd",
            "parent_id": "t3_zfdcjd",
            "score": 0,
            "created_utc": 1670477522.0,
            "replies": []
        },
        {
            "body": "I've done a mix of before and after. I think if you're meeting someone for the first time then money up front is reasonable. I did get questioned on it once and I just said I was new and didn't know the etiquette around it yet. Crisis averted and I think he was too interested in getting me unwrapped.",
            "author": "superbex98",
            "id": "izdjx3d",
            "parent_id": "t3_zfdcjd",
            "score": 0,
            "created_utc": 1670489460.0,
            "replies": []
        },
        {
            "body": "I have to agree w some of other posters here - the missing piece is the “relationship” \n\nIt’s much better to meet a couple of times and establish some chemistry where such issues of “who blinks first” become moot\n\nI do what others have said as well - leave it in plain sight. But if an SB actually started counting the money as the first thing she did upon entering the room, it would mean all the time we spent together on getting to know each other was an exercise in futility",
            "author": "OCbird22",
            "id": "izd5w2r",
            "parent_id": "t3_zfdcjd",
            "score": -1,
            "created_utc": 1670478595.0,
            "replies": []
        },
        {
            "body": "Then there’s my crazy-self… I have almost forgotten to grab the donation from my SD’s dresser on multiple visits 🙄",
            "author": "itsme06082",
            "id": "izbvwe4",
            "parent_id": "t3_zfdcjd",
            "score": 0,
            "created_utc": 1670456226.0,
            "replies": []
        },
        {
            "body": "> Is he worried I would run out of the room with they money????\n\nYes. Never happened to me, but has happened to people in this sub.",
            "author": "sdbythebeach",
            "id": "izcbq46",
            "parent_id": "t3_zfdcjd",
            "score": 0,
            "created_utc": 1670463281.0,
            "replies": []
        },
        {
            "body": ">he wants to tip and can’t tip if he gives the agreed upon amount first\n\nSBs are not \"tipped\". That language is such a red flag to me, I probably would've left if I were you.\n\n>I of course have done my research on sugar dating and have read many times to get your money first.\n\nI've been an SD for 5+ years. I think once ever in that time she asked for money first and was given it.\n\n>Is it normal to give ppm after? Like what percentage of you guys do that? \n\nIn my experience it's quite normal. Also in my experience it's *actually what is normal.* This forum disagrees, but it's not clear if it disagrees because of negative experiences of some SBs, political correctness, power dynamics, or that most people live in a different reality than I've experienced.\n\n>Is he worried I would run out of the room with they money????\n\nYes, and we've read that story here more than a few times. Also, I had a brief arrangement with a woman who admitted she had done this before. Also, I had a couple of \"not yet an arrangements\" where the money came from me before hand, went to her, and, well, she totally flew the coop.\n\n>I made a good call leaving right?\n\nIn my opinion, you did, despite what I wrote above. You were super uncomfortable and that's not a great way to start. Also, he was basically looking for an escort.",
            "author": "marker3000",
            "id": "izdzb63",
            "parent_id": "t3_zfdcjd",
            "score": 0,
            "created_utc": 1670501950.0,
            "replies": []
        },
        {
            "body": "I never give money first, and no one has ever left unhappy. His statement is correct. But the execution is poor. If yall weren't at the comfort level of payment yall probably weren't at the comfort level for the deed. \nAlso I think you got bad advise. SD aren't out here ripping off SB for a little bit of ass. We out here changing people's lives.",
            "author": "ifxnj",
            "id": "izc3we6",
            "parent_id": "t3_zfdcjd",
            "score": -4,
            "created_utc": 1670459776.0,
            "replies": [
                {
                    "body": "Super bingo! That’s how it works IRL.",
                    "author": null,
                    "id": "izc9b6f",
                    "parent_id": "t1_izc3we6",
                    "score": -3,
                    "created_utc": 1670462198.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Been in this world for 8 years. Never ever given a ppm upfront. If you want that, go escorting instead",
            "author": "thesuitelife2010",
            "id": "izcvdvh",
            "parent_id": "t3_zfdcjd",
            "score": -4,
            "created_utc": 1670472567.0,
            "replies": []
        },
        {
            "body": "There are more than a few SD reports of a scamming SB who took money upfront, and went to the “bathroom” (aka hotel door).    \n\n\nNot sure there is a sure fire solution to this conundrum.   Imagine the hundreds of comedy kidnap exchange.\n\nOne hand on the money, and another on the snatch?   😂",
            "author": "NationalSilver00",
            "id": "izbx094",
            "parent_id": "t3_zfdcjd",
            "score": -1,
            "created_utc": 1670456711.0,
            "replies": []
        },
        {
            "body": "Ive never given ppm upfront but usually by that stage we are already trusting and into each other so it would feel \"weird.\" If she asked though Id also feel a bit weird like she didnt trust me but Id understand and hand it over. \n\nCorrection. I did hand over the ppm once as she had been scammed before and was concerned. We were going to spend the afternoon together and it was quite high but things had been going well.   About 30 mins into the date..no intimacy yet as we were just hanging out and chatting\nShe gets a suprise phone call and her housemate was coming home so she kicked me out then blocked me. \nWe had met platonically twice so trust was established she decided it was more important to take my money.",
            "author": "Upper-District-50",
            "id": "izcwg2m",
            "parent_id": "t3_zfdcjd",
            "score": -1,
            "created_utc": 1670473126.0,
            "replies": []
        },
        {
            "body": "Half now and half at the end would be the next go to if i were in your situation",
            "author": "Rich_Wishbone",
            "id": "izbevyl",
            "parent_id": "t3_zfdcjd",
            "score": -5,
            "created_utc": 1670449190.0,
            "replies": [
                {
                    "body": "I never do this. It’s a cheap move.",
                    "author": "AdUpbeat1526",
                    "id": "izbgijd",
                    "parent_id": "t1_izbevyl",
                    "score": 9,
                    "created_utc": 1670449827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes it is normal to give after, my girls always let me hand it to them at end of night. I've also gifted small amount after MnG. Yes some girls try to run after grabbing it. He was crass about it tho, waving money. I have it in an envelope visible.\n\nBut maybe the girls I see are unique, they are usually newer to the game.",
            "author": "NotARussianBot1984",
            "id": "izejqxz",
            "parent_id": "t3_zfdcjd",
            "score": -2,
            "created_utc": 1670512351.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izdkw4i",
            "parent_id": "t3_zfdcjd",
            "score": -3,
            "created_utc": 1670490327.0,
            "replies": []
        },
        {
            "body": "Only scammers and hookers demand money upfront. It’s a gift, not a fee. Personally, I like to slide it into their purse when they’re in the bathroom or into their back pocket during a goodbye hug. Sometimes a little extra for a truly great performance. Nearly every time demanded upfront it’s been cash/dash or just terrible effort. You might’ve waxed, but he already took you to dinner and got a hotel room; you were both invested. He even had it ready to go, but then... reference first sentence.",
            "author": "YourSugarFather",
            "id": "izdw12j",
            "parent_id": "t3_zfdcjd",
            "score": 1,
            "created_utc": 1670499638.0,
            "replies": []
        },
        {
            "body": "I forgotten a few times in the heat of the moment. I feel so bad and transfer directly asap. Not so bad if weve been dating a while but first time always looks suspicious",
            "author": "Upper-District-50",
            "id": "izcygx4",
            "parent_id": "t1_izb8yj9",
            "score": 15,
            "created_utc": 1670474191.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "izd1ej7",
                    "parent_id": "t1_izcygx4",
                    "score": 20,
                    "created_utc": 1670475838.0,
                    "replies": [
                        {
                            "body": "I did, apologised profusely and sent more than we agreed to. She hadnt reminded me or brought it up at all which was very sweet but I felt very guilty. A month later i just switched to an allowance to prevent that from happening",
                            "author": "Upper-District-50",
                            "id": "izd6nut",
                            "parent_id": "t1_izd1ej7",
                            "score": 16,
                            "created_utc": 1670479105.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do too although I’ve heard horror stories of SB running out after taking the money",
            "author": "UnearthlyDinosaur",
            "id": "izc9n1j",
            "parent_id": "t1_izb8yj9",
            "score": 6,
            "created_utc": 1670462346.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "izc02ic",
            "parent_id": "t1_izb8d63",
            "score": -12,
            "created_utc": 1670458059.0,
            "replies": [
                {
                    "body": "Its money for sex and companionship regardless of how you want to spin it and in one the girl is more comfortable and consent is assured.",
                    "author": "Pastakingfifth",
                    "id": "izc85mr",
                    "parent_id": "t1_izc02ic",
                    "score": 7,
                    "created_utc": 1670461677.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This.  100% this.",
            "author": "disposable9account",
            "id": "ize5g5l",
            "parent_id": "t1_izc00kc",
            "score": 5,
            "created_utc": 1670505652.0,
            "replies": []
        },
        {
            "body": "I always give the ppm the moment they walk into the room. If you are too scared they gonna run at that point you got bigger issues.",
            "author": "Stairsareok",
            "id": "izcj9th",
            "parent_id": "t1_izb94h9",
            "score": 22,
            "created_utc": 1670466692.0,
            "replies": []
        },
        {
            "body": "I agree. Money does not have to change hands right away, but if asking for it at the beginning creates a problem for the SD then he's not an SD and you did right getting leaving.",
            "author": "Either_Anybody_6017",
            "id": "izdieic",
            "parent_id": "t1_izb94h9",
            "score": 11,
            "created_utc": 1670488145.0,
            "replies": []
        },
        {
            "body": ">I've never heard of someone using \"tip\" in the context of\n\nWell I have heard of it - but usually only in Vanilla in the context of   \n\"Let me put just the tip in please\"   \n:D :D :D",
            "author": "sd424242",
            "id": "izbrw3l",
            "parent_id": "t1_izb94h9",
            "score": 16,
            "created_utc": 1670454510.0,
            "replies": []
        },
        {
            "body": "I agree with everything you’ve said",
            "author": "Equivalent_Newt_6969",
            "id": "izbchyr",
            "parent_id": "t1_izb94h9",
            "score": 21,
            "created_utc": 1670448213.0,
            "replies": [
                {
                    "body": "He was 💥definitely💥 a John with the 💵 tip thing.",
                    "author": null,
                    "id": "izbejzk",
                    "parent_id": "t1_izbchyr",
                    "score": 31,
                    "created_utc": 1670449065.0,
                    "replies": [
                        {
                            "body": "> 💥definitely💥 a John \n\nexcept escorts ALWAYS require the payment up front. He probably read on some site that he should pay later.",
                            "author": "GSSD",
                            "id": "izbhp3j",
                            "parent_id": "t1_izbejzk",
                            "score": 26,
                            "created_utc": 1670450290.0,
                            "replies": [
                                {
                                    "body": "it could have been this site. 🙃 saw some SD saying that SDs should wait to pay until the end. which annoys me to no end. for our safety etc, we should get the money up front.",
                                    "author": "AspiringSplendaBaby",
                                    "id": "izd9ofl",
                                    "parent_id": "t1_izbhp3j",
                                    "score": 10,
                                    "created_utc": 1670481197.0,
                                    "replies": [
                                        {
                                            "body": "100% agree",
                                            "author": "GSSD",
                                            "id": "izdxx58",
                                            "parent_id": "t1_izd9ofl",
                                            "score": 2,
                                            "created_utc": 1670501004.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That’s not always true.",
                                    "author": "JBWentworth",
                                    "id": "izcnnol",
                                    "parent_id": "t1_izbhp3j",
                                    "score": 1,
                                    "created_utc": 1670468746.0,
                                    "replies": [
                                        {
                                            "body": "True.... if you've been seeing the same one for a while and have a level of trust. \n\nAs a guy who's visited & reviewed escorts, if they don't know you, they will demand payment up front. Can they take the cash & run (CND)? Yes. Thats just part of the chance you take. Or you hand them the cash and suddenly \"angry boyfriend/husband\" comes into the room or comes home, sometimes waving a gun around. Its all part of the game.\n\nThis is why I prefer a SB/SD relationship. There's a level of trust.",
                                            "author": "MrRetrdO",
                                            "id": "izd7ebq",
                                            "parent_id": "t1_izcnnol",
                                            "score": 6,
                                            "created_utc": 1670479601.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Given the number of scammers in the world it is reasonable for the SB to ask that it be delivered prior to intimacy on the first meet.  Actually she should not need to ask.  However, it is probably wise to cover the issue prior to arrival at the place of intended consummation.  \"For our first meeting I would feel better if we could get the financial stuff out of the way so we can fully enjoy our time.\"  \n\nIt is not an unreasonable request but also is best confirmed prior to the meeting.  Later on you can do whatever seems reasonable.  \n\nA final bit of preventive maintenance is to let the SB know that you will never decrease the amount without discussing it with her and so if the amount is not correct she would be doing you a favor by speaking up.",
            "author": "pinotandsugar",
            "id": "izbrgrj",
            "parent_id": "t1_izb94h9",
            "score": 19,
            "created_utc": 1670454331.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izbece0",
            "parent_id": "t1_izb94h9",
            "score": 6,
            "created_utc": 1670448986.0,
            "replies": [
                {
                    "body": "Especially for a first intimate meet I think it is helpful to make sure she has it prior. Of course in an envelope.",
                    "author": "pinotandsugar",
                    "id": "izbrrq0",
                    "parent_id": "t1_izbece0",
                    "score": 9,
                    "created_utc": 1670454460.0,
                    "replies": [
                        {
                            "body": "I like to use Greeting Cards. Just a nice touch.",
                            "author": "MrRetrdO",
                            "id": "izd7jv6",
                            "parent_id": "t1_izbrrq0",
                            "score": 3,
                            "created_utc": 1670479702.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Almost what I said lol. Agree 100%.  Way too many escorts giving bad advice here.",
            "author": "RedHeavyG603",
            "id": "izbw4vm",
            "parent_id": "t1_izb94h9",
            "score": 6,
            "created_utc": 1670456329.0,
            "replies": []
        },
        {
            "body": "If she is going to grab the money and run before intimacy it's perhaps a great benefit to the SD.....  If she waited until after she might have left with his kidney and her boyfriend waiting in the car with an ice chest.",
            "author": "pinotandsugar",
            "id": "izd6ksc",
            "parent_id": "t1_izb94h9",
            "score": 4,
            "created_utc": 1670479047.0,
            "replies": [
                {
                    "body": "I always look the door. In hotel rooms after it shuts behind me whether I am Alone, with an sb, or with a vanilla partner. I’m paranoid I guess idk.",
                    "author": "ntxstud007",
                    "id": "izdfhx8",
                    "parent_id": "t1_izd6ksc",
                    "score": -1,
                    "created_utc": 1670485732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup a potential SB suddenly “felt bad” after getting the cash.",
            "author": "k815",
            "id": "izbw7xa",
            "parent_id": "t1_izb94h9",
            "score": 1,
            "created_utc": 1670456366.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "izcqnxr",
            "parent_id": "t1_izb94h9",
            "score": -8,
            "created_utc": 1670470198.0,
            "replies": [
                {
                    "body": "I give it up front. Especially on the first intimate date. \nAs I want her to be relaxed and comfortable, and not thinking about the ppm or allowances. \n\nIdk it’s like why keep that hostage, and there’s a saying…. \nYou don’t pay escorts to show up you pay her to leave… \nJust saying, and I’m also not paying my sb for sex I’m giving her money for financial support and to benefit her. \n\nSo to me giving it afternoon is kind of awkward. for both parties. \n\nAlso, by giving it up front especially in the early stages, allows you to see what happens after y’all get done for the first time. Like if you give it up front you finish and she immediately gets up , gets dressed inns peaces out well….  She’s not that into you",
                    "author": "ntxstud007",
                    "id": "izdgpu5",
                    "parent_id": "t1_izcqnxr",
                    "score": 5,
                    "created_utc": 1670486739.0,
                    "replies": [
                        {
                            "body": "“I am also not paying my SB for sex….. financial assistance “ trust me without financial assistance there is no sex. I do not understand the word salad used to explain a financial transaction.",
                            "author": "SmallOccasion8321",
                            "id": "ize3i1i",
                            "parent_id": "t1_izdgpu5",
                            "score": 0,
                            "created_utc": 1670504540.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% this. His entire demeanor here was a red flag. While it may have felt awkward, you made the right call to nope the fuck out, good job! And better luck with the next one.",
            "author": "DesertShae",
            "id": "izbzgcn",
            "parent_id": "t1_izb8oir",
            "score": 16,
            "created_utc": 1670457786.0,
            "replies": [
                {
                    "body": "Agreed. You dodged a bullet with a guy who’s at minimum insensitive and possibly a complete scammer…..\nIf he doesn’t make you feel comfortable - next.",
                    "author": "ChitownWanderlust",
                    "id": "izc6eln",
                    "parent_id": "t1_izbzgcn",
                    "score": 15,
                    "created_utc": 1670460892.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\#2 is spot on. In my opinion that is a bad sign. He's using sugaring to get a girl friend experience and pay less. Him even saying to you \"that's what escorts do\" is trashy af.\n\nTo the point below, I've had SRs that were strictly indoor, for long periods of time, but we had already established a great rapport over some time.\n\nOP, think back to this: How did you feel walking up to the hotel door, going into the room, seeing him in bed, immediately talking about the PPM because it wasn't on the table?\n\nNow, how would you have felt if he said: \"Let's meet at x and have a drink and a light bite to eat, if we're hungry later we can eat room service. You look amazing, what would you like to drink, wow, I feel so lucky to have met you. How was your day? That dress is stunning. You look better each time I see you. I love sitting across the table from you and anticipating later.\"",
            "author": null,
            "id": "izcmxo6",
            "parent_id": "t1_izb8vw0",
            "score": 6,
            "created_utc": 1670468401.0,
            "replies": []
        },
        {
            "body": "Regarding your #2 point what is so bad about going to a hotel for the “date”? What’s the difference between that and going to a SD’s house as a date? Some are date dates and some could just be meeting for sex which is what the basis of a lot if not all SR is 🤷‍♀️ and sometimes it’s good to get the first time out of the way especially if you’ve had a lot of convos and a M&G already",
            "author": "Notsobabysugarbaby",
            "id": "izbb53o",
            "parent_id": "t1_izb8vw0",
            "score": 9,
            "created_utc": 1670447625.0,
            "replies": [
                {
                    "body": "Agreed. My SB and I rotate every other date, one being an experience - concert, show, etc. and the other being just sex, and always at a hotel. I wouldn’t count that as a bad sign or red flag on its own.",
                    "author": "nordicman21",
                    "id": "izbd8my",
                    "parent_id": "t1_izbb53o",
                    "score": 6,
                    "created_utc": 1670448535.0,
                    "replies": []
                },
                {
                    "body": "Obviously there's room to disagree here, but for the most part we're trying to build a sugar *relationship*.  Like any relationship -- e.g., if you were vanilla dating -- typically the first real date isn't \"show up to my place, have sex\".  It's wining, dining, getting to know each other, him romancing her a bit, she seducing him a bit.  Yes, it's sugar, so financial support and sex are understood -- but that's not ALL there is, otherwise most of us don't think it's sugar.   And **especially** for the first date, there should be more than sex and money.\n\nIn most cases, even going to an SD's house for a date, is preceded by having dinner together out, or even him  cooking dinner, or some other effort to make this a date, not a sex appointment.  Speaking of which, the #1 reason the first date shouldn't be a \"go to the hotel for a sex date\" is... 100% of the time if that's the first date he designed, he's a john, and she's looking for an SD.",
                    "author": "Azurecole",
                    "id": "izbd26m",
                    "parent_id": "t1_izbb53o",
                    "score": 19,
                    "created_utc": 1670448456.0,
                    "replies": [
                        {
                            "body": "I see what you’re saying and I don’t disagree in theory. But I think every SR is different and even if it’s just sexual for the most part it doesn’t mean the guy is a John",
                            "author": "Notsobabysugarbaby",
                            "id": "izbe0hb",
                            "parent_id": "t1_izbd26m",
                            "score": 5,
                            "created_utc": 1670448860.0,
                            "replies": [
                                {
                                    "body": "I think if it's just sexual, for me, that's where it's left sugar. A strict sex-and-money exchange just that, it isn't sugar to me, no reason to call it that.\n\nThat said, I do think there's sugar relationships where both people want discretion, and they meet at a hotel room or one of their homes... but usually these still include the wining and dining, watching a movie together, etc.  I can see it, even though it's not something I'd want to be in.  But I don't think actual SDs propose just-sex dates, at least according to my concept of what sugar is",
                                    "author": "Azurecole",
                                    "id": "izbg4uz",
                                    "parent_id": "t1_izbe0hb",
                                    "score": 7,
                                    "created_utc": 1670449676.0,
                                    "replies": [
                                        {
                                            "body": "Yes I agree with you. And I’m not saying that’s what mine are/were like. I just think sometimes they can be quickie or sex dates and not always wining and dining. With genuine connection ofc. But I prefer intelligent conversation and quality time together to just expensive dinners. Like being in a hotel room and having our own party with great conversation and sex - I like that. It doesn’t feel transactional to me bec I make sure I have a genuine connection with a SD first. And I realize this was a first time date for her but even so, I am a very sexual person and if I had already talked on the phone with a person and had a M&G that went well, I would absolutely be intimate in that scenario",
                                            "author": "Notsobabysugarbaby",
                                            "id": "izbndb9",
                                            "parent_id": "t1_izbg4uz",
                                            "score": 3,
                                            "created_utc": 1670452621.0,
                                            "replies": [
                                                {
                                                    "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
                                                    "author": "Azurecole",
                                                    "id": "izbnrr5",
                                                    "parent_id": "t1_izbndb9",
                                                    "score": 4,
                                                    "created_utc": 1670452788.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Odds are very high 📈 he's a John.",
                                    "author": null,
                                    "id": "izbgi1k",
                                    "parent_id": "t1_izbe0hb",
                                    "score": 3,
                                    "created_utc": 1670449821.0,
                                    "replies": []
                                },
                                {
                                    "body": "If it’s just sexual… he’s paying you for sex… then he is literally a John and you are literally a prostitute.",
                                    "author": "tempsdforfuns",
                                    "id": "izbh09k",
                                    "parent_id": "t1_izbe0hb",
                                    "score": 1,
                                    "created_utc": 1670450019.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah I actually prefer hotels for intimate dates especially in the beginning as they’re safer for both parties. A young girl walking into a man’s property is vulnerable. He could have friends there waiting",
                    "author": "Equivalent_Newt_6969",
                    "id": "izbcqiz",
                    "parent_id": "t1_izbb53o",
                    "score": 5,
                    "created_utc": 1670448316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This",
            "author": "OHshySB",
            "id": "izdbg0c",
            "parent_id": "t1_izc1os8",
            "score": 2,
            "created_utc": 1670482505.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izdqtrp",
            "parent_id": "t1_izbgj35",
            "score": 0,
            "created_utc": 1670495424.0,
            "replies": [
                {
                    "body": "yes alas I think you’re right",
                    "author": "Jonconnerysd",
                    "id": "izdx4ph",
                    "parent_id": "t1_izdqtrp",
                    "score": 1,
                    "created_utc": 1670500446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely",
            "author": "calidotcom",
            "id": "izc4z21",
            "parent_id": "t1_izc3zbb",
            "score": 6,
            "created_utc": 1670460253.0,
            "replies": []
        },
        {
            "body": ">Also, he was going to “TIP” you?\n\nGiven that the date was \"showing up to the hotel for sex\", rather than the type of date that normally happens in sugar, I suspect he was a john thinking of this as a sexwork service, so he's using terms he'd use with an escort -- he'll \"tip\" her, etc.   The red flag happened well before she ever got in the room.",
            "author": "Azurecole",
            "id": "izb9ejt",
            "parent_id": "t1_izb8vvh",
            "score": 10,
            "created_utc": 1670446927.0,
            "replies": [
                {
                    "body": "It’s strange because if he viewed it as an escort service he would have given money upfront. I think he was probably a John going on sugar sites to trick girls… or somehow he mixed up escorting and sugaring and managed to break the rules for both in one go. Agreed tho- she shouldn’t have gone to a hotel for the second date if this is sugaring.",
                    "author": "Parrotsandpeanuts",
                    "id": "izcby62",
                    "parent_id": "t1_izb9ejt",
                    "score": 8,
                    "created_utc": 1670463384.0,
                    "replies": [
                        {
                            "body": "Exactly.  These guys sure tips on their forums on how easy it is to manipulate SBs.  A lot easier than manipulating an experienced escort, obviously.  That's exactly what I think happened, he invited her to a sex-service date, but was pre-armed with \"pay after\" manipulations to  scam her out of some of the promised PPM",
                            "author": "Azurecole",
                            "id": "izcle2o",
                            "parent_id": "t1_izcby62",
                            "score": 5,
                            "created_utc": 1670467676.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is this where we have another 15% vs 18% vs 20% debate? LOL",
            "author": "BinghamtonSD",
            "id": "izbzoow",
            "parent_id": "t1_izbcv4w",
            "score": 2,
            "created_utc": 1670457892.0,
            "replies": []
        },
        {
            "body": "Agreed",
            "author": "SmallOccasion8321",
            "id": "izd0u5f",
            "parent_id": "t1_izbgi2j",
            "score": -1,
            "created_utc": 1670475505.0,
            "replies": []
        },
        {
            "body": "I agree never had this happen in NY",
            "author": "SmallOccasion8321",
            "id": "izd0w5h",
            "parent_id": "t1_izbb2ed",
            "score": 0,
            "created_utc": 1670475537.0,
            "replies": []
        },
        {
            "body": "That’s a perfect answer - captures the problem with the “where’s the cash” approach - would pass over the cash and just view as recreational use only. PPM word salad",
            "author": "SmallOccasion8321",
            "id": "izd27kc",
            "parent_id": "t1_izbw5cq",
            "score": 2,
            "created_utc": 1670476322.0,
            "replies": []
        },
        {
            "body": "Super bingo! That’s how it works IRL.",
            "author": null,
            "id": "izc9b6f",
            "parent_id": "t1_izc3we6",
            "score": -3,
            "created_utc": 1670462198.0,
            "replies": []
        },
        {
            "body": "I never do this. It’s a cheap move.",
            "author": "AdUpbeat1526",
            "id": "izbgijd",
            "parent_id": "t1_izbevyl",
            "score": 9,
            "created_utc": 1670449827.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izd1ej7",
            "parent_id": "t1_izcygx4",
            "score": 20,
            "created_utc": 1670475838.0,
            "replies": [
                {
                    "body": "I did, apologised profusely and sent more than we agreed to. She hadnt reminded me or brought it up at all which was very sweet but I felt very guilty. A month later i just switched to an allowance to prevent that from happening",
                    "author": "Upper-District-50",
                    "id": "izd6nut",
                    "parent_id": "t1_izd1ej7",
                    "score": 16,
                    "created_utc": 1670479105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its money for sex and companionship regardless of how you want to spin it and in one the girl is more comfortable and consent is assured.",
            "author": "Pastakingfifth",
            "id": "izc85mr",
            "parent_id": "t1_izc02ic",
            "score": 7,
            "created_utc": 1670461677.0,
            "replies": []
        },
        {
            "body": "He was 💥definitely💥 a John with the 💵 tip thing.",
            "author": null,
            "id": "izbejzk",
            "parent_id": "t1_izbchyr",
            "score": 31,
            "created_utc": 1670449065.0,
            "replies": [
                {
                    "body": "> 💥definitely💥 a John \n\nexcept escorts ALWAYS require the payment up front. He probably read on some site that he should pay later.",
                    "author": "GSSD",
                    "id": "izbhp3j",
                    "parent_id": "t1_izbejzk",
                    "score": 26,
                    "created_utc": 1670450290.0,
                    "replies": [
                        {
                            "body": "it could have been this site. 🙃 saw some SD saying that SDs should wait to pay until the end. which annoys me to no end. for our safety etc, we should get the money up front.",
                            "author": "AspiringSplendaBaby",
                            "id": "izd9ofl",
                            "parent_id": "t1_izbhp3j",
                            "score": 10,
                            "created_utc": 1670481197.0,
                            "replies": [
                                {
                                    "body": "100% agree",
                                    "author": "GSSD",
                                    "id": "izdxx58",
                                    "parent_id": "t1_izd9ofl",
                                    "score": 2,
                                    "created_utc": 1670501004.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That’s not always true.",
                            "author": "JBWentworth",
                            "id": "izcnnol",
                            "parent_id": "t1_izbhp3j",
                            "score": 1,
                            "created_utc": 1670468746.0,
                            "replies": [
                                {
                                    "body": "True.... if you've been seeing the same one for a while and have a level of trust. \n\nAs a guy who's visited & reviewed escorts, if they don't know you, they will demand payment up front. Can they take the cash & run (CND)? Yes. Thats just part of the chance you take. Or you hand them the cash and suddenly \"angry boyfriend/husband\" comes into the room or comes home, sometimes waving a gun around. Its all part of the game.\n\nThis is why I prefer a SB/SD relationship. There's a level of trust.",
                                    "author": "MrRetrdO",
                                    "id": "izd7ebq",
                                    "parent_id": "t1_izcnnol",
                                    "score": 6,
                                    "created_utc": 1670479601.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Especially for a first intimate meet I think it is helpful to make sure she has it prior. Of course in an envelope.",
            "author": "pinotandsugar",
            "id": "izbrrq0",
            "parent_id": "t1_izbece0",
            "score": 9,
            "created_utc": 1670454460.0,
            "replies": [
                {
                    "body": "I like to use Greeting Cards. Just a nice touch.",
                    "author": "MrRetrdO",
                    "id": "izd7jv6",
                    "parent_id": "t1_izbrrq0",
                    "score": 3,
                    "created_utc": 1670479702.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I always look the door. In hotel rooms after it shuts behind me whether I am Alone, with an sb, or with a vanilla partner. I’m paranoid I guess idk.",
            "author": "ntxstud007",
            "id": "izdfhx8",
            "parent_id": "t1_izd6ksc",
            "score": -1,
            "created_utc": 1670485732.0,
            "replies": []
        },
        {
            "body": "I give it up front. Especially on the first intimate date. \nAs I want her to be relaxed and comfortable, and not thinking about the ppm or allowances. \n\nIdk it’s like why keep that hostage, and there’s a saying…. \nYou don’t pay escorts to show up you pay her to leave… \nJust saying, and I’m also not paying my sb for sex I’m giving her money for financial support and to benefit her. \n\nSo to me giving it afternoon is kind of awkward. for both parties. \n\nAlso, by giving it up front especially in the early stages, allows you to see what happens after y’all get done for the first time. Like if you give it up front you finish and she immediately gets up , gets dressed inns peaces out well….  She’s not that into you",
            "author": "ntxstud007",
            "id": "izdgpu5",
            "parent_id": "t1_izcqnxr",
            "score": 5,
            "created_utc": 1670486739.0,
            "replies": [
                {
                    "body": "“I am also not paying my SB for sex….. financial assistance “ trust me without financial assistance there is no sex. I do not understand the word salad used to explain a financial transaction.",
                    "author": "SmallOccasion8321",
                    "id": "ize3i1i",
                    "parent_id": "t1_izdgpu5",
                    "score": 0,
                    "created_utc": 1670504540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. You dodged a bullet with a guy who’s at minimum insensitive and possibly a complete scammer…..\nIf he doesn’t make you feel comfortable - next.",
            "author": "ChitownWanderlust",
            "id": "izc6eln",
            "parent_id": "t1_izbzgcn",
            "score": 15,
            "created_utc": 1670460892.0,
            "replies": []
        },
        {
            "body": "Agreed. My SB and I rotate every other date, one being an experience - concert, show, etc. and the other being just sex, and always at a hotel. I wouldn’t count that as a bad sign or red flag on its own.",
            "author": "nordicman21",
            "id": "izbd8my",
            "parent_id": "t1_izbb53o",
            "score": 6,
            "created_utc": 1670448535.0,
            "replies": []
        },
        {
            "body": "Obviously there's room to disagree here, but for the most part we're trying to build a sugar *relationship*.  Like any relationship -- e.g., if you were vanilla dating -- typically the first real date isn't \"show up to my place, have sex\".  It's wining, dining, getting to know each other, him romancing her a bit, she seducing him a bit.  Yes, it's sugar, so financial support and sex are understood -- but that's not ALL there is, otherwise most of us don't think it's sugar.   And **especially** for the first date, there should be more than sex and money.\n\nIn most cases, even going to an SD's house for a date, is preceded by having dinner together out, or even him  cooking dinner, or some other effort to make this a date, not a sex appointment.  Speaking of which, the #1 reason the first date shouldn't be a \"go to the hotel for a sex date\" is... 100% of the time if that's the first date he designed, he's a john, and she's looking for an SD.",
            "author": "Azurecole",
            "id": "izbd26m",
            "parent_id": "t1_izbb53o",
            "score": 19,
            "created_utc": 1670448456.0,
            "replies": [
                {
                    "body": "I see what you’re saying and I don’t disagree in theory. But I think every SR is different and even if it’s just sexual for the most part it doesn’t mean the guy is a John",
                    "author": "Notsobabysugarbaby",
                    "id": "izbe0hb",
                    "parent_id": "t1_izbd26m",
                    "score": 5,
                    "created_utc": 1670448860.0,
                    "replies": [
                        {
                            "body": "I think if it's just sexual, for me, that's where it's left sugar. A strict sex-and-money exchange just that, it isn't sugar to me, no reason to call it that.\n\nThat said, I do think there's sugar relationships where both people want discretion, and they meet at a hotel room or one of their homes... but usually these still include the wining and dining, watching a movie together, etc.  I can see it, even though it's not something I'd want to be in.  But I don't think actual SDs propose just-sex dates, at least according to my concept of what sugar is",
                            "author": "Azurecole",
                            "id": "izbg4uz",
                            "parent_id": "t1_izbe0hb",
                            "score": 7,
                            "created_utc": 1670449676.0,
                            "replies": [
                                {
                                    "body": "Yes I agree with you. And I’m not saying that’s what mine are/were like. I just think sometimes they can be quickie or sex dates and not always wining and dining. With genuine connection ofc. But I prefer intelligent conversation and quality time together to just expensive dinners. Like being in a hotel room and having our own party with great conversation and sex - I like that. It doesn’t feel transactional to me bec I make sure I have a genuine connection with a SD first. And I realize this was a first time date for her but even so, I am a very sexual person and if I had already talked on the phone with a person and had a M&G that went well, I would absolutely be intimate in that scenario",
                                    "author": "Notsobabysugarbaby",
                                    "id": "izbndb9",
                                    "parent_id": "t1_izbg4uz",
                                    "score": 3,
                                    "created_utc": 1670452621.0,
                                    "replies": [
                                        {
                                            "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
                                            "author": "Azurecole",
                                            "id": "izbnrr5",
                                            "parent_id": "t1_izbndb9",
                                            "score": 4,
                                            "created_utc": 1670452788.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Odds are very high 📈 he's a John.",
                            "author": null,
                            "id": "izbgi1k",
                            "parent_id": "t1_izbe0hb",
                            "score": 3,
                            "created_utc": 1670449821.0,
                            "replies": []
                        },
                        {
                            "body": "If it’s just sexual… he’s paying you for sex… then he is literally a John and you are literally a prostitute.",
                            "author": "tempsdforfuns",
                            "id": "izbh09k",
                            "parent_id": "t1_izbe0hb",
                            "score": 1,
                            "created_utc": 1670450019.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I actually prefer hotels for intimate dates especially in the beginning as they’re safer for both parties. A young girl walking into a man’s property is vulnerable. He could have friends there waiting",
            "author": "Equivalent_Newt_6969",
            "id": "izbcqiz",
            "parent_id": "t1_izbb53o",
            "score": 5,
            "created_utc": 1670448316.0,
            "replies": []
        },
        {
            "body": "yes alas I think you’re right",
            "author": "Jonconnerysd",
            "id": "izdx4ph",
            "parent_id": "t1_izdqtrp",
            "score": 1,
            "created_utc": 1670500446.0,
            "replies": []
        },
        {
            "body": "It’s strange because if he viewed it as an escort service he would have given money upfront. I think he was probably a John going on sugar sites to trick girls… or somehow he mixed up escorting and sugaring and managed to break the rules for both in one go. Agreed tho- she shouldn’t have gone to a hotel for the second date if this is sugaring.",
            "author": "Parrotsandpeanuts",
            "id": "izcby62",
            "parent_id": "t1_izb9ejt",
            "score": 8,
            "created_utc": 1670463384.0,
            "replies": [
                {
                    "body": "Exactly.  These guys sure tips on their forums on how easy it is to manipulate SBs.  A lot easier than manipulating an experienced escort, obviously.  That's exactly what I think happened, he invited her to a sex-service date, but was pre-armed with \"pay after\" manipulations to  scam her out of some of the promised PPM",
                    "author": "Azurecole",
                    "id": "izcle2o",
                    "parent_id": "t1_izcby62",
                    "score": 5,
                    "created_utc": 1670467676.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did, apologised profusely and sent more than we agreed to. She hadnt reminded me or brought it up at all which was very sweet but I felt very guilty. A month later i just switched to an allowance to prevent that from happening",
            "author": "Upper-District-50",
            "id": "izd6nut",
            "parent_id": "t1_izd1ej7",
            "score": 16,
            "created_utc": 1670479105.0,
            "replies": []
        },
        {
            "body": "> 💥definitely💥 a John \n\nexcept escorts ALWAYS require the payment up front. He probably read on some site that he should pay later.",
            "author": "GSSD",
            "id": "izbhp3j",
            "parent_id": "t1_izbejzk",
            "score": 26,
            "created_utc": 1670450290.0,
            "replies": [
                {
                    "body": "it could have been this site. 🙃 saw some SD saying that SDs should wait to pay until the end. which annoys me to no end. for our safety etc, we should get the money up front.",
                    "author": "AspiringSplendaBaby",
                    "id": "izd9ofl",
                    "parent_id": "t1_izbhp3j",
                    "score": 10,
                    "created_utc": 1670481197.0,
                    "replies": [
                        {
                            "body": "100% agree",
                            "author": "GSSD",
                            "id": "izdxx58",
                            "parent_id": "t1_izd9ofl",
                            "score": 2,
                            "created_utc": 1670501004.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That’s not always true.",
                    "author": "JBWentworth",
                    "id": "izcnnol",
                    "parent_id": "t1_izbhp3j",
                    "score": 1,
                    "created_utc": 1670468746.0,
                    "replies": [
                        {
                            "body": "True.... if you've been seeing the same one for a while and have a level of trust. \n\nAs a guy who's visited & reviewed escorts, if they don't know you, they will demand payment up front. Can they take the cash & run (CND)? Yes. Thats just part of the chance you take. Or you hand them the cash and suddenly \"angry boyfriend/husband\" comes into the room or comes home, sometimes waving a gun around. Its all part of the game.\n\nThis is why I prefer a SB/SD relationship. There's a level of trust.",
                            "author": "MrRetrdO",
                            "id": "izd7ebq",
                            "parent_id": "t1_izcnnol",
                            "score": 6,
                            "created_utc": 1670479601.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like to use Greeting Cards. Just a nice touch.",
            "author": "MrRetrdO",
            "id": "izd7jv6",
            "parent_id": "t1_izbrrq0",
            "score": 3,
            "created_utc": 1670479702.0,
            "replies": []
        },
        {
            "body": "“I am also not paying my SB for sex….. financial assistance “ trust me without financial assistance there is no sex. I do not understand the word salad used to explain a financial transaction.",
            "author": "SmallOccasion8321",
            "id": "ize3i1i",
            "parent_id": "t1_izdgpu5",
            "score": 0,
            "created_utc": 1670504540.0,
            "replies": []
        },
        {
            "body": "I see what you’re saying and I don’t disagree in theory. But I think every SR is different and even if it’s just sexual for the most part it doesn’t mean the guy is a John",
            "author": "Notsobabysugarbaby",
            "id": "izbe0hb",
            "parent_id": "t1_izbd26m",
            "score": 5,
            "created_utc": 1670448860.0,
            "replies": [
                {
                    "body": "I think if it's just sexual, for me, that's where it's left sugar. A strict sex-and-money exchange just that, it isn't sugar to me, no reason to call it that.\n\nThat said, I do think there's sugar relationships where both people want discretion, and they meet at a hotel room or one of their homes... but usually these still include the wining and dining, watching a movie together, etc.  I can see it, even though it's not something I'd want to be in.  But I don't think actual SDs propose just-sex dates, at least according to my concept of what sugar is",
                    "author": "Azurecole",
                    "id": "izbg4uz",
                    "parent_id": "t1_izbe0hb",
                    "score": 7,
                    "created_utc": 1670449676.0,
                    "replies": [
                        {
                            "body": "Yes I agree with you. And I’m not saying that’s what mine are/were like. I just think sometimes they can be quickie or sex dates and not always wining and dining. With genuine connection ofc. But I prefer intelligent conversation and quality time together to just expensive dinners. Like being in a hotel room and having our own party with great conversation and sex - I like that. It doesn’t feel transactional to me bec I make sure I have a genuine connection with a SD first. And I realize this was a first time date for her but even so, I am a very sexual person and if I had already talked on the phone with a person and had a M&G that went well, I would absolutely be intimate in that scenario",
                            "author": "Notsobabysugarbaby",
                            "id": "izbndb9",
                            "parent_id": "t1_izbg4uz",
                            "score": 3,
                            "created_utc": 1670452621.0,
                            "replies": [
                                {
                                    "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
                                    "author": "Azurecole",
                                    "id": "izbnrr5",
                                    "parent_id": "t1_izbndb9",
                                    "score": 4,
                                    "created_utc": 1670452788.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Odds are very high 📈 he's a John.",
                    "author": null,
                    "id": "izbgi1k",
                    "parent_id": "t1_izbe0hb",
                    "score": 3,
                    "created_utc": 1670449821.0,
                    "replies": []
                },
                {
                    "body": "If it’s just sexual… he’s paying you for sex… then he is literally a John and you are literally a prostitute.",
                    "author": "tempsdforfuns",
                    "id": "izbh09k",
                    "parent_id": "t1_izbe0hb",
                    "score": 1,
                    "created_utc": 1670450019.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly.  These guys sure tips on their forums on how easy it is to manipulate SBs.  A lot easier than manipulating an experienced escort, obviously.  That's exactly what I think happened, he invited her to a sex-service date, but was pre-armed with \"pay after\" manipulations to  scam her out of some of the promised PPM",
            "author": "Azurecole",
            "id": "izcle2o",
            "parent_id": "t1_izcby62",
            "score": 5,
            "created_utc": 1670467676.0,
            "replies": []
        },
        {
            "body": "it could have been this site. 🙃 saw some SD saying that SDs should wait to pay until the end. which annoys me to no end. for our safety etc, we should get the money up front.",
            "author": "AspiringSplendaBaby",
            "id": "izd9ofl",
            "parent_id": "t1_izbhp3j",
            "score": 10,
            "created_utc": 1670481197.0,
            "replies": [
                {
                    "body": "100% agree",
                    "author": "GSSD",
                    "id": "izdxx58",
                    "parent_id": "t1_izd9ofl",
                    "score": 2,
                    "created_utc": 1670501004.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s not always true.",
            "author": "JBWentworth",
            "id": "izcnnol",
            "parent_id": "t1_izbhp3j",
            "score": 1,
            "created_utc": 1670468746.0,
            "replies": [
                {
                    "body": "True.... if you've been seeing the same one for a while and have a level of trust. \n\nAs a guy who's visited & reviewed escorts, if they don't know you, they will demand payment up front. Can they take the cash & run (CND)? Yes. Thats just part of the chance you take. Or you hand them the cash and suddenly \"angry boyfriend/husband\" comes into the room or comes home, sometimes waving a gun around. Its all part of the game.\n\nThis is why I prefer a SB/SD relationship. There's a level of trust.",
                    "author": "MrRetrdO",
                    "id": "izd7ebq",
                    "parent_id": "t1_izcnnol",
                    "score": 6,
                    "created_utc": 1670479601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think if it's just sexual, for me, that's where it's left sugar. A strict sex-and-money exchange just that, it isn't sugar to me, no reason to call it that.\n\nThat said, I do think there's sugar relationships where both people want discretion, and they meet at a hotel room or one of their homes... but usually these still include the wining and dining, watching a movie together, etc.  I can see it, even though it's not something I'd want to be in.  But I don't think actual SDs propose just-sex dates, at least according to my concept of what sugar is",
            "author": "Azurecole",
            "id": "izbg4uz",
            "parent_id": "t1_izbe0hb",
            "score": 7,
            "created_utc": 1670449676.0,
            "replies": [
                {
                    "body": "Yes I agree with you. And I’m not saying that’s what mine are/were like. I just think sometimes they can be quickie or sex dates and not always wining and dining. With genuine connection ofc. But I prefer intelligent conversation and quality time together to just expensive dinners. Like being in a hotel room and having our own party with great conversation and sex - I like that. It doesn’t feel transactional to me bec I make sure I have a genuine connection with a SD first. And I realize this was a first time date for her but even so, I am a very sexual person and if I had already talked on the phone with a person and had a M&G that went well, I would absolutely be intimate in that scenario",
                    "author": "Notsobabysugarbaby",
                    "id": "izbndb9",
                    "parent_id": "t1_izbg4uz",
                    "score": 3,
                    "created_utc": 1670452621.0,
                    "replies": [
                        {
                            "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
                            "author": "Azurecole",
                            "id": "izbnrr5",
                            "parent_id": "t1_izbndb9",
                            "score": 4,
                            "created_utc": 1670452788.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Odds are very high 📈 he's a John.",
            "author": null,
            "id": "izbgi1k",
            "parent_id": "t1_izbe0hb",
            "score": 3,
            "created_utc": 1670449821.0,
            "replies": []
        },
        {
            "body": "If it’s just sexual… he’s paying you for sex… then he is literally a John and you are literally a prostitute.",
            "author": "tempsdforfuns",
            "id": "izbh09k",
            "parent_id": "t1_izbe0hb",
            "score": 1,
            "created_utc": 1670450019.0,
            "replies": []
        },
        {
            "body": "100% agree",
            "author": "GSSD",
            "id": "izdxx58",
            "parent_id": "t1_izd9ofl",
            "score": 2,
            "created_utc": 1670501004.0,
            "replies": []
        },
        {
            "body": "True.... if you've been seeing the same one for a while and have a level of trust. \n\nAs a guy who's visited & reviewed escorts, if they don't know you, they will demand payment up front. Can they take the cash & run (CND)? Yes. Thats just part of the chance you take. Or you hand them the cash and suddenly \"angry boyfriend/husband\" comes into the room or comes home, sometimes waving a gun around. Its all part of the game.\n\nThis is why I prefer a SB/SD relationship. There's a level of trust.",
            "author": "MrRetrdO",
            "id": "izd7ebq",
            "parent_id": "t1_izcnnol",
            "score": 6,
            "created_utc": 1670479601.0,
            "replies": []
        },
        {
            "body": "Yes I agree with you. And I’m not saying that’s what mine are/were like. I just think sometimes they can be quickie or sex dates and not always wining and dining. With genuine connection ofc. But I prefer intelligent conversation and quality time together to just expensive dinners. Like being in a hotel room and having our own party with great conversation and sex - I like that. It doesn’t feel transactional to me bec I make sure I have a genuine connection with a SD first. And I realize this was a first time date for her but even so, I am a very sexual person and if I had already talked on the phone with a person and had a M&G that went well, I would absolutely be intimate in that scenario",
            "author": "Notsobabysugarbaby",
            "id": "izbndb9",
            "parent_id": "t1_izbg4uz",
            "score": 3,
            "created_utc": 1670452621.0,
            "replies": [
                {
                    "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
                    "author": "Azurecole",
                    "id": "izbnrr5",
                    "parent_id": "t1_izbndb9",
                    "score": 4,
                    "created_utc": 1670452788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">And I realize this was a first time date \n\nRight!  I understand the occasional booty call date in an established SR.  I'm stuck over it being first (or early) date.  Totally understand you have a different tolerance ehre",
            "author": "Azurecole",
            "id": "izbnrr5",
            "parent_id": "t1_izbndb9",
            "score": 4,
            "created_utc": 1670452788.0,
            "replies": []
        }
    ]
}