{
    "title": "Ways to improve SB's life in the long term",
    "post_id": "skjbxe",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/skjbxe/ways_to_improve_sbs_life_in_the_long_term/",
    "author": "_CallMeDodge_",
    "body": "I get a lot of satisfaction out of helping her in the future as well as the present.  These are things I do or would like to do on top of our regular arrangement, for example:\n\n\\- Show her how to set up an investment account and give her some initial funding. Add a bit to it every month.\n\n\\- Hook her up with (and fund) a career coaching service to help navigate a career transition.\n\n\\- Tuition, gym membership, etc.\n\n\\- Help her learn to drive (it doesn't have to be financial)\n\nIt's not entirely selfless. I like the idea of her remembering a positive impact I had after I'm gone. Not dead, I mean after we eventually part ways (though I guess dead would work too lol).\n\nSBs, what are some ways your SD has helped your future self?\n\nSDs, do you have other ideas in the same vein?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/skjbxe/ways_to_improve_sbs_life_in_the_long_term/",
    "score": 191,
    "upvote_ratio": 0.98,
    "created_utc": 1643996385.0,
    "num_comments": 101,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "* found her a resume coach specific to her field of work so she could try for a better job\n* got her a full head to toe health assessment at a private clinic since she was having all these issues and couldn't figure it out via the public system (we're in Canada and this is an extra expense since we have public healthcare) \n* Naturopath appointments & supplements\n* Helped with professional fees, school, any sort of learning\n* Paid for therapy to address some long standing issues which she could never address due to cost\n* Personal care - massages, exercise classes, nails, hair, spas, etc.",
            "author": "ResidentGelatoExpert",
            "id": "hvl9zp4",
            "parent_id": "t3_skjbxe",
            "score": 98,
            "created_utc": 1643997880.0,
            "replies": [
                {
                    "body": "wow the therapy one 👏👏",
                    "author": "TlMEGH0ST",
                    "id": "hvmiqwc",
                    "parent_id": "t1_hvl9zp4",
                    "score": 25,
                    "created_utc": 1644014900.0,
                    "replies": [
                        {
                            "body": "I completely agree. So many sbs or women looking to become sbs feel they have to be this completely perfect and polished person while most men (in my experience) are looking for a sh to be herself flaws and all and I applaud the SDs helping get their SBs mental health care, and the SBs for putting their true selves out there because nobody is perfect but everyone is perfect and beautiful in their own way, flaws included.",
                            "author": "Beneficial-Agent4000",
                            "id": "hvo746n",
                            "parent_id": "t1_hvmiqwc",
                            "score": 8,
                            "created_utc": 1644044887.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Very good point on mental health.  I myself am bipolar and didn’t address it correctly until my 30’s.  I have helped several SB’s with mental health issues get into the right insurance programs for Meds and therapy.",
                    "author": "LotBuilder",
                    "id": "hvlyg12",
                    "parent_id": "t1_hvl9zp4",
                    "score": 24,
                    "created_utc": 1644007029.0,
                    "replies": []
                },
                {
                    "body": "Also in Canada, curious about the health assessment. I’ve been meaning to do this just for funsies. Was it successful? Did you find the problem?",
                    "author": "WestCoastCompanion",
                    "id": "hvn508i",
                    "parent_id": "t1_hvl9zp4",
                    "score": 2,
                    "created_utc": 1644024565.0,
                    "replies": [
                        {
                            "body": "Still going through the tests so inconclusive so far, but overall, the experience was awesome.  Doctors who actually listened, MRI & CT scans in a matter of weeks vs months (apparently they have a team of 10 people keeping tabs on cancellations and then jump on them), full bloodwork with extra tests, etc etc.\n\nIt wasn't cheap ($XXXX), but it was better than the patchwork of family doctors & referrals which take forever.  I'd say go for it!",
                            "author": "ResidentGelatoExpert",
                            "id": "hvntfju",
                            "parent_id": "t1_hvn508i",
                            "score": 3,
                            "created_utc": 1644036398.0,
                            "replies": [
                                {
                                    "body": "Sounds great! I think I will. 4 figures is not bad at all, coming from a dual citizen who’s payed US Hospital bills lol I don’t have any issues at the moment, but would be cool to see if there’s anything lurking around.",
                                    "author": "WestCoastCompanion",
                                    "id": "hvntuh2",
                                    "parent_id": "t1_hvntfju",
                                    "score": 4,
                                    "created_utc": 1644036621.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The therapy one made my cry a little and is inspiring me to ask my SD for this support",
                    "author": "Anastasiaxoxox",
                    "id": "hzqf72m",
                    "parent_id": "t1_hvl9zp4",
                    "score": 1,
                    "created_utc": 1646677610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had an SD 20-10 years ago.  He mentored me throughout my career and I became wildly successful in part because of him.  He also helped me buy a house by helping me choose the right one and giving me the down payment.  There's plenty of other things but those are the two big ones.",
            "author": "naughtychick9999",
            "id": "hvlr1pd",
            "parent_id": "t3_skjbxe",
            "score": 29,
            "created_utc": 1644004248.0,
            "replies": []
        },
        {
            "body": "Things I have done for my sugar baby:\n\n1. taught my sb how to drive and get her license\n2. paid her college tuition\n3. opened a schwab trading account for her\n4. took her to nyc with me for two weeks to see 15 broadway shows - she had never been on an airplane before - opened her horizons",
            "author": "LuckyINTJ",
            "id": "hvla34d",
            "parent_id": "t3_skjbxe",
            "score": 47,
            "created_utc": 1643997915.0,
            "replies": [
                {
                    "body": "| Broadway shows\n\nGood point. Unique memories together kind of works the same",
                    "author": "_CallMeDodge_",
                    "id": "hvlc0td",
                    "parent_id": "t1_hvla34d",
                    "score": 23,
                    "created_utc": 1643998623.0,
                    "replies": []
                },
                {
                    "body": "You should take her abroad! 😻",
                    "author": "SBerryTrifle",
                    "id": "hvld4fk",
                    "parent_id": "t1_hvla34d",
                    "score": 10,
                    "created_utc": 1643999032.0,
                    "replies": []
                },
                {
                    "body": "broadways shows 🤩 creative AND thoughtful!",
                    "author": "kimmy_bb",
                    "id": "hvop0su",
                    "parent_id": "t1_hvla34d",
                    "score": 3,
                    "created_utc": 1644058829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aside from what you've mentioned:\n\nConnect her with contacts you have in her industry (only when you absolutely trust her)\n\nHelp her put together an appropriate wardrobe for her career/job interviews\n\nTravel to culturally enriching destinations",
            "author": "roscoe7585",
            "id": "hvlbqhm",
            "parent_id": "t3_skjbxe",
            "score": 22,
            "created_utc": 1643998518.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvlesb1",
            "parent_id": "t3_skjbxe",
            "score": 40,
            "created_utc": 1643999650.0,
            "replies": [
                {
                    "body": "There is something so wonderful about a person caring for not only you, but then also your loved ones. 🥰",
                    "author": "Cdnsugarr",
                    "id": "hvmidkq",
                    "parent_id": "t1_hvlesb1",
                    "score": 10,
                    "created_utc": 1644014747.0,
                    "replies": []
                },
                {
                    "body": "omg your SD sounds amazing!! i love how he also went out of his way to help your sister too <33 stuff related to helping you discover more things about you (like the cultural stuff) and helping your family is always great aahh im glad you found him!",
                    "author": "Superb-Scale4533",
                    "id": "hvokngi",
                    "parent_id": "t1_hvlesb1",
                    "score": 7,
                    "created_utc": 1644055306.0,
                    "replies": []
                },
                {
                    "body": ">Was it platonic as well that ended when he moved ?",
                    "author": null,
                    "id": "hvq2yhh",
                    "parent_id": "t1_hvlesb1",
                    "score": 1,
                    "created_utc": 1644083889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You sound like a great SD! I would consider doing some fun classes together like painting, music, cooking, etc.. Hobbies can be great long term. Find something you both enjoy.",
            "author": "_Terrible_Advice_",
            "id": "hvli7z0",
            "parent_id": "t3_skjbxe",
            "score": 19,
            "created_utc": 1644000920.0,
            "replies": []
        },
        {
            "body": "This is so sweet ❣️",
            "author": "brighteraurora",
            "id": "hvlhqmf",
            "parent_id": "t3_skjbxe",
            "score": 15,
            "created_utc": 1644000739.0,
            "replies": []
        },
        {
            "body": "You guy guys are literally amazing. This is my first time seeing SDs talk about furthering their SBs and not just having them as intimate partners.",
            "author": "Monkeybrainoogabooga",
            "id": "hvnjtf6",
            "parent_id": "t3_skjbxe",
            "score": 11,
            "created_utc": 1644031509.0,
            "replies": []
        },
        {
            "body": "I love reading this sub 🥺 as I get into sugar work I get nervous to make genuine connections but reading these it makes me see how caring SD can be. 💕",
            "author": "bunnyfood_",
            "id": "hvlfq5c",
            "parent_id": "t3_skjbxe",
            "score": 20,
            "created_utc": 1643999999.0,
            "replies": [
                {
                    "body": "This isn’t work…",
                    "author": null,
                    "id": "hwbo6bp",
                    "parent_id": "t1_hvlfq5c",
                    "score": 1,
                    "created_utc": 1644465987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gold 😄 also being my reference for anything and everything. He’s also helping me get my novel published through some of his connections. Yay! Not to mention one of the most important longest lasting things… raising the bar for how I know I deserve to be treated and lowering my tolerance for BS, breaking my former habit of making excuses for tolerating unacceptable behavior from romantic partners. This never needs to be necessary.",
            "author": "WestCoastCompanion",
            "id": "hvn4st5",
            "parent_id": "t3_skjbxe",
            "score": 10,
            "created_utc": 1644024470.0,
            "replies": []
        },
        {
            "body": "My three long term SR lasted 7, 3, and 5 years, and all started as college students where tuition was part of the arrangement. The 7 year relationship I put thru college and law school, smartest person I have ever met, and she is now my personal attorney. The 3 and 5 I helped get their BAs. They were all live in arrangements as well, so I told them to invest their allowance for the future, since I took care of daily expenses, and they knew how to get me to buy them anything special they wanted, lol. \n\nI do this because a good friend of mine, a wonderful woman who was the SB of a friend of mine, spent 10 years with him, actually believed at some point he was going to leave his wife and kids, and left the relationship worse off than when she went in because she had no money saved and a decade long job gap on her resume. \n\nI just don’t have it in me to let someone into my life for years and then completely turn my back on them, I want to know they are not only okay, but better people for having spent a portion of their life with me. Also, proud to say I am still friends with all of them, and it may sound a little strange, but gave one away at her wedding (no, husband only thought I was a family friend that mentored her). \n\nAgain, these were long term relationships, not just a few weeks or months, but years, and they lived with me as my girlfriend as far as anyone knew. If you can do that, and not want to make sure the person you are with is better from it, something is deeply wrong with you as a person.",
            "author": "Southern-Air5484",
            "id": "hvo9qw0",
            "parent_id": "t3_skjbxe",
            "score": 9,
            "created_utc": 1644046811.0,
            "replies": []
        },
        {
            "body": "I think I wrote about half of my SBs college papers.  I'm still mad about the Biology Final Paper she turned in 3 days late and got a C on....I was clearly an A-/B+ paper.",
            "author": "js2066",
            "id": "hvl8anl",
            "parent_id": "t3_skjbxe",
            "score": 25,
            "created_utc": 1643997261.0,
            "replies": [
                {
                    "body": "😹 you should complain to the professor   \n\nI know it was good because I wrote it for her! You are denigrating what I have legitimately cheated!",
                    "author": "SBerryTrifle",
                    "id": "hvl9uf1",
                    "parent_id": "t1_hvl8anl",
                    "score": 17,
                    "created_utc": 1643997826.0,
                    "replies": []
                },
                {
                    "body": "lol but no",
                    "author": "_CallMeDodge_",
                    "id": "hvlbrl1",
                    "parent_id": "t1_hvl8anl",
                    "score": 5,
                    "created_utc": 1643998529.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I purchased life insurance with my SB as the beneficiary as well as life insurance on her with her child as the beneficiary.",
            "author": "AARCEntertainment",
            "id": "hvn1il9",
            "parent_id": "t3_skjbxe",
            "score": 8,
            "created_utc": 1644022965.0,
            "replies": [
                {
                    "body": "Are you married and do you have children?",
                    "author": null,
                    "id": "hvncjf1",
                    "parent_id": "t1_hvn1il9",
                    "score": 3,
                    "created_utc": 1644028042.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The main things I provided my first SB were:\n\n\\- Safe place to live (full room and board)  \n\\- Industry classes (IT Classes for certifications)  \n\\- Financial coaching/assistance  \n\\- Investment coaching/assistance  \n\\- Industry mentorship (both of us IT)  \n\\- Taught her to drive  \n\\- Taught her how to work on her car (so as to not get ripped off by shops later)  \n\\- Shooting lessons and bought her a pistol as 21st bday present  \n\\- Any extra ordinary expense like if she had a car issues, unexpected medical expenses, etc.  \n\\- LOTS of flying in my plane.  Taught her how to talk to air traffic control while I flew.\n\nIronically some of the SBs here would have labeled me splenda or worse as I never just paid a monthly allowance.  I am very very confident that all I contributed over 4 years is well more valuable than 48 months at $xx per month.  She will be a legit millionaire on her own later in life just due to good investments and time (30 year career).\n\nA good SD (REAL SD) always makes a positive impact and in the end the SB is better for having had the SR than not.   Each relationship is different and has its own needs.",
            "author": "TXPolyDaddy",
            "id": "hvlbv59",
            "parent_id": "t3_skjbxe",
            "score": 23,
            "created_utc": 1643998565.0,
            "replies": [
                {
                    "body": "New to this subreddit, and this place seems to really emphasize the allowance-based model of SB/SD.  Personally, I am similar to what it sounds like you do.",
                    "author": "westcoaststyleballs",
                    "id": "hvlhkzz",
                    "parent_id": "t1_hvlbv59",
                    "score": 8,
                    "created_utc": 1644000682.0,
                    "replies": [
                        {
                            "body": "It really depends upon what the two people need.  Allowance is commonly discussed here and it is a pretty easy starting point... usually with weekly advances for a few weeks then into the first month.  \n\n\nIn the case of SB#1 for me, she had an immediate need for a place to live.  I also needed a crash pad as I was working in town but main home 3 hours away.  I just bought a condo, she lived there full time and I was there part time.  It worked for us.  Now the condo is just another rental property for me since we no longer need it.  \n\n\nThe main thing in my mind is be honest with each other about what you need/want and see if you can help each other.  I get a sense of satisfaction making a positive difference for people I care about.  If I didn't want to care about the beautiful young woman in my life I would just be a John and do that lifestyle.  It IS very different and not for me, though I know it has a place.",
                            "author": "TXPolyDaddy",
                            "id": "hvlvmlb",
                            "parent_id": "t1_hvlhkzz",
                            "score": 8,
                            "created_utc": 1644005976.0,
                            "replies": []
                        },
                        {
                            "body": "Normally an SR will start as PPM until both sides are comfortable and enough trust to move to an allowance.  For me, it normally takes a month or two.",
                            "author": "MrRhoarke",
                            "id": "hvlpsp2",
                            "parent_id": "t1_hvlhkzz",
                            "score": 5,
                            "created_utc": 1644003776.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Nice",
                    "author": "lipstickdiet",
                    "id": "hvlkp91",
                    "parent_id": "t1_hvlbv59",
                    "score": 2,
                    "created_utc": 1644001855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I helped my LT SB land her dream job.  I forced us to end the SR, but I felt great about it.",
            "author": "sdphilly",
            "id": "hvlqj47",
            "parent_id": "t3_skjbxe",
            "score": 10,
            "created_utc": 1644004054.0,
            "replies": []
        },
        {
            "body": "I have been a silent partner in several SB's businesses. I have connected a few with business acquaintances to get better or first jobs. But I think the thing I am most proud of is convincing more than a few young ladies that completing their education, not to rely on a man or SD for support, is most important. To be a competent, independent, self-sufficient woman is most important.",
            "author": "AFSMSgt",
            "id": "hvlwlwc",
            "parent_id": "t3_skjbxe",
            "score": 11,
            "created_utc": 1644006339.0,
            "replies": [
                {
                    "body": "That is the best advice to give any woman 😊 your a good man",
                    "author": "Secure_Bend_18",
                    "id": "hvnn5aq",
                    "parent_id": "t1_hvlwlwc",
                    "score": 1,
                    "created_utc": 1644033137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love this! You sound like the true gentleman we all strive to find 🤍",
            "author": "relearnoldthings",
            "id": "hvmmafh",
            "parent_id": "t3_skjbxe",
            "score": 5,
            "created_utc": 1644016334.0,
            "replies": []
        },
        {
            "body": "First sb - lots and lots of international travel and Instagramable dinners. Kick starting a business for my last one.     Offering to pay for an acting course for my current one (she hasn’t taken it up yet).",
            "author": "brit-sd",
            "id": "hvmns9f",
            "parent_id": "t3_skjbxe",
            "score": 5,
            "created_utc": 1644016954.0,
            "replies": []
        },
        {
            "body": "The things I've done for my babies are all over the map. These are on top of a modest allowance.\n\n\\- Unhacked her 20k+ IG account required for her modeling agency to book her & then did a complete security sweep.\n\n\\- Helped them hire VAs to manage social media and online brand assets.\n\n\\- Helped them with SEO so they ranked #1 for their name and various related brand keywords in their primary country of business.\n\n\\- Migrated their ecommerce site from WooCommerce > Shopify & helped set up an agency to manage paid media.\n\n\\- Paid for a \"biz in a box\" type course we reviewed and selected together. It is in an industry niche and now I'm helping her with implementation of marketing, etc. It's going really well.\n\n\\- Help them with trying new things in the bedroom. I'm into BDSM and a lot of them want to practice with someone experienced who isn't going to hurt them. I teach them how to set boundaries & control consent.\n\n\\- I'm a very fashion forward guy so my babies ask me to dress them. I buy them custom leather BDSM harnesses & accessories that can also be worn as fashion statements outside the bedroom. They each get their own little dolly set :-)\n\n\\- Paid for a non-emergency dental surgery that would become an emergency in 10 years. \"I can't date you knowing in the back of my mind you're jaw is going to fall off. It's just weird. Let me pay for the surgery.\"",
            "author": "notnoteworthyatall",
            "id": "hvqa629",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644087758.0,
            "replies": [
                {
                    "body": "Omggg I love all of these so much 😍😍😍",
                    "author": "Anastasiaxoxox",
                    "id": "hzqswbk",
                    "parent_id": "t1_hvqa629",
                    "score": 1,
                    "created_utc": 1646682901.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Buying her a (cheap) car which was necessary for work and funding an investment account are probably the top two I've done. Advise and mentoring on business, marketing and general life skills. Always aim to be a positive influence in her life, and hope that I succeed - it is important to me, and a core part of my view in SRs",
            "author": "SpartanInBritain",
            "id": "hvl9v3j",
            "parent_id": "t3_skjbxe",
            "score": 13,
            "created_utc": 1643997833.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hvlfkah",
                    "parent_id": "t1_hvl9v3j",
                    "score": 9,
                    "created_utc": 1643999938.0,
                    "replies": [
                        {
                            "body": "Oh I have done the same and more for vanilla girlfriends too... People do...",
                            "author": "SpartanInBritain",
                            "id": "hvlk267",
                            "parent_id": "t1_hvlfkah",
                            "score": 5,
                            "created_utc": 1644001611.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hvlk946",
                                    "parent_id": "t1_hvlk267",
                                    "score": 9,
                                    "created_utc": 1644001685.0,
                                    "replies": [
                                        {
                                            "body": "I hope you find the right person to connect, sugar or vanilla",
                                            "author": "SpartanInBritain",
                                            "id": "hvll6iy",
                                            "parent_id": "t1_hvlk946",
                                            "score": 6,
                                            "created_utc": 1644002038.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Most don't have the financial cash flow to do it.",
                            "author": "GACyberCool",
                            "id": "hvp80tq",
                            "parent_id": "t1_hvlfkah",
                            "score": 2,
                            "created_utc": 1644071041.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hvp86zd",
                                    "parent_id": "t1_hvp80tq",
                                    "score": 2,
                                    "created_utc": 1644071125.0,
                                    "replies": [
                                        {
                                            "body": "A vanilla boyfriend or a vanilla boyfriend that can lavish his girlfriend with these type of experiences and gifts?",
                                            "author": "GACyberCool",
                                            "id": "hvq9ulq",
                                            "parent_id": "t1_hvp86zd",
                                            "score": 1,
                                            "created_utc": 1644087611.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hvqa9f3",
                                                    "parent_id": "t1_hvq9ulq",
                                                    "score": 2,
                                                    "created_utc": 1644087802.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
                                                            "author": "GACyberCool",
                                                            "id": "hvqbp54",
                                                            "parent_id": "t1_hvqa9f3",
                                                            "score": 1,
                                                            "created_utc": 1644088447.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow this post is making me feel some type of way…Im looking into becoming a SB, hope I find someone as thoughtful as the SDs on the post ❣️",
            "author": null,
            "id": "hvljebw",
            "parent_id": "t3_skjbxe",
            "score": 10,
            "created_utc": 1644001360.0,
            "replies": [
                {
                    "body": "You have to find someone that is well to do who is really offering you a SR not just someone who only beds with you and nothing else.",
                    "author": "MKTekke",
                    "id": "hvlpivs",
                    "parent_id": "t1_hvljebw",
                    "score": 9,
                    "created_utc": 1644003672.0,
                    "replies": [
                        {
                            "body": "That’s what I’m looking for!",
                            "author": null,
                            "id": "hvlqcwn",
                            "parent_id": "t1_hvlpivs",
                            "score": 5,
                            "created_utc": 1644003989.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My longer term SB’s in order depending on what they already have :\n\nAAA card (if they have a beater)\nPhone \nStable housing \nReliable transportation \nSchool or a trade to a viable career\nCredit repair or build credit\nGym  (I have 3 Nanny’s on my Lifetime membership ;) \nGirl stuff (skin hair nails) \nBoobs (if they want) \n\nThe goal is to spoil them a bit and put them in a position to be self sufficient.  \n\nI am super proud that I just helped one of my recently ex SB’s but a beautiful condo all by herself.  I’m in RE so I credited her the commission to closing and she had zero out of pocket.  She has a career,  a newer car , a condo and a seven fifty credit score.  When I met her three and a half years ago she was couch surfing with a beat up civic and a four hundred credit score.  She is very smart but her parents are losers and nobody had showed her what is possible or what her expectations should be.",
            "author": "LotBuilder",
            "id": "hvlxzma",
            "parent_id": "t3_skjbxe",
            "score": 10,
            "created_utc": 1644006860.0,
            "replies": []
        },
        {
            "body": "Large purchases for the house. Tempur-pedic king bed, washer/dryer set.  MacBook for school, building out her home office.\n\nThings that will be around for years.",
            "author": "sandman200",
            "id": "hvm08ep",
            "parent_id": "t3_skjbxe",
            "score": 10,
            "created_utc": 1644007711.0,
            "replies": []
        },
        {
            "body": "All I can say is so that everyone so far are doing great thing for their SB. True gentlemen 🤗🤗🤗",
            "author": "SugaMoonSweet",
            "id": "hvmz5k0",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644021906.0,
            "replies": []
        },
        {
            "body": "You see there are SD that actually care more than about there carnal desires.\n\nAnd SDs that help their stunning SBs in life will most likely be better of mentally, because being a part of a person journey to become a better version of themselves is a wonderfully feeling. So really we help ourselves by helping you.",
            "author": "forgotten3434",
            "id": "hvpcetn",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644073098.0,
            "replies": []
        },
        {
            "body": "I would literally cry if a SD took care of me like this… \nI feel like I’m always being used, underpaid and under appreciated. it’s never about money for me, but my mental health would be instantly cured if my daddy paid for my gym bill or small payments like that. wow .. where do I find someone as nice as this? hah 🥺😞",
            "author": null,
            "id": "hvqaeby",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644087864.0,
            "replies": []
        },
        {
            "body": "Paid for real estate license course / test.\n\nShe's a realtor now and sold her first home @ 1.5 mill.\n\nI might need a sugar momma when I retire.",
            "author": "Buckeyechamp21",
            "id": "hvr2dv1",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644101741.0,
            "replies": []
        },
        {
            "body": "Paid her college, bought her a mustang..",
            "author": "Pancho_villa25",
            "id": "hvlsyt6",
            "parent_id": "t3_skjbxe",
            "score": 6,
            "created_utc": 1644004965.0,
            "replies": []
        },
        {
            "body": "Covers a lot of years in SR and a number of awesome SB \n\nTaught one how to fly to the point where she needed minimal time with an FAA instructor to get signed off. \n\nArmed SB to terrify landlord who assumed he could just intimidate her .  He backed off their unreasonable demands \n\nNow that the statute of limitation has probably expired, a former wonderful SB had moved on with her life but we stayed in contact. She was living in an isolated location and concerned with potential threats so I loaned her a pistol.  Much earlier we had gone to the range together and her country girl lifestyle put everything into the center of the target. She returned the pistol feeling more comfortable since she had her own firearm,   a month later some meth addict broke in and she perforated him.  Not a fatal wound but I wondered what would have happened if that were my gun.",
            "author": "pinotandsugar",
            "id": "hvnoql0",
            "parent_id": "t3_skjbxe",
            "score": 6,
            "created_utc": 1644033934.0,
            "replies": [
                {
                    "body": "Never been into guns myself, don’t think anyone in my extended family own ones (apart from my grandpa who goes hunting for deer).\n\nHowever I would like to learn the basics if nothing else for safety in case I ever need to handle one. Might be fun to do it together with a SB. \n\nWhat do you suggest? Can we just show up at a gun range? I’m assuming they must have a beginner overview course? Do I need a permit before I go? Do I need my own gun? Can I borrow one.\n\nHope you don’t mind sharing some knowledge.",
                    "author": "techsd00",
                    "id": "hvnsvmd",
                    "parent_id": "t1_hvnoql0",
                    "score": 4,
                    "created_utc": 1644036097.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m an SB that got into the lifestyle to help myself with a future. Help with preventative health and dental care is something that I think is really helpful, and benefits her in the long run, but it’s hard to set up for the future.",
            "author": "madlyintrigued",
            "id": "hvlvtqi",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644006050.0,
            "replies": []
        },
        {
            "body": "Sir don't go dying on us now. great post btw.",
            "author": null,
            "id": "hvo1vq4",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644041371.0,
            "replies": []
        },
        {
            "body": "𝐈 𝐰𝐨𝐮𝐥𝐝 𝐥𝐨𝐯𝐞 𝐭𝐨 𝐦𝐞𝐞𝐭 𝐚 𝐟𝐫𝐢𝐞𝐧𝐝 𝐥𝐢𝐤𝐞 𝐭𝐡𝐢𝐬. \n𝐈 𝐡𝐚𝐯𝐞 𝐭𝐨 𝐬𝐚𝐲, 𝐈'𝐦 𝐤𝐢𝐧𝐝𝐚 𝐧𝐞𝐰 𝐨𝐧 𝐑𝐞𝐝𝐝𝐢𝐭 𝐚𝐧𝐝 𝐈 𝐚𝐦 𝐬𝐮𝐫𝐩𝐫𝐢𝐬𝐞𝐝 𝐚𝐥𝐥 𝐭𝐡𝐢𝐬 𝐢𝐧𝐟𝐨𝐫𝐦𝐚𝐭𝐢𝐨𝐧 𝐢𝐬 𝐬𝐨 𝐞𝐚𝐬𝐲 𝐭𝐨 𝐚𝐜𝐜𝐞𝐬𝐬.",
            "author": "Gold_Syllabub_3782",
            "id": "hvo85zp",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644045637.0,
            "replies": [
                {
                    "body": "as you're learning, it's not just intimacy but you can have a lot of font too!",
                    "author": "mayorofny",
                    "id": "hvublut",
                    "parent_id": "t1_hvo85zp",
                    "score": 3,
                    "created_utc": 1644172620.0,
                    "replies": [
                        {
                            "body": "𝑺𝒐𝒎𝒆𝒕𝒊𝒎𝒆𝒔 𝒔𝒊𝒎𝒑𝒍𝒆 𝒕𝒉𝒊𝒏𝒈𝒔 𝒍𝒊𝒌𝒆 𝒇𝒐𝒏𝒕 𝒎𝒂𝒌𝒆 𝒆𝒗𝒆𝒓𝒚𝒕𝒉𝒊𝒏𝒈 𝒕𝒉𝒂𝒕 𝒎𝒖𝒄𝒉 𝒃𝒆𝒕𝒕𝒆𝒓😉",
                            "author": "Gold_Syllabub_3782",
                            "id": "hvw774w",
                            "parent_id": "t1_hvublut",
                            "score": 1,
                            "created_utc": 1644201422.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love this post and all the comments!! This positivity is amazing to see. ❤️✨",
            "author": "kimmy_bb",
            "id": "hvop3y3",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644058900.0,
            "replies": []
        },
        {
            "body": "For the love of God I don't know where and how to find a sugar mummy or daddy .... but you are awesome for doing that to your sugar baby ! Way to go Dodge !",
            "author": "DjDarkSide7",
            "id": "hvoxkh9",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644065221.0,
            "replies": []
        },
        {
            "body": "Reading this makes me happy and makes me smile. Good job, guys!",
            "author": "lost-wanderess",
            "id": "hvozaxh",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644066314.0,
            "replies": []
        },
        {
            "body": "Some of these work but only if the SB is willing to put in the work, mine haven’t.\n\n-  got her a gym membership, she never goes. I suggested a trainer and going together.\n\n- I also suggested further her career, there’s a vocation she’s passionate about, but it requires studying. It’s been a year and she’s made no effort .\n\n- I do try and get her car in good running condition. I know she needs new tires for winter and a tune up.\n\n- Tried to teach her to budget and pay off debt",
            "author": "techsd00",
            "id": "hvmdwc7",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644012951.0,
            "replies": [
                {
                    "body": "Very typical!",
                    "author": null,
                    "id": "hvn899g",
                    "parent_id": "t1_hvmdwc7",
                    "score": 1,
                    "created_utc": 1644026077.0,
                    "replies": []
                },
                {
                    "body": "I would be so grateful 🥺🥺🥺",
                    "author": "LesLez",
                    "id": "hvrve5z",
                    "parent_id": "t1_hvmdwc7",
                    "score": 1,
                    "created_utc": 1644115057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He has supported me in everything along with the advice for investments and savings and how to clean up my record. He has shown me I'm ok and I don't have to rely on others for my worth.",
            "author": "Simple_Stomach",
            "id": "hvm0ksa",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644007841.0,
            "replies": []
        },
        {
            "body": "I bought a past SB a young person's railcard. So she could come and see me (or anyone, I suppose) at a 33% discount. Amazing how many young SBs don't seem to know about that sort of thing  \n\n\nSmall beer I guess, but useful all the same - I wasn't in a position to buy her a car :)",
            "author": "hwillson00",
            "id": "hvm151n",
            "parent_id": "t3_skjbxe",
            "score": 5,
            "created_utc": 1644008054.0,
            "replies": []
        },
        {
            "body": "Well, many SBs do not want an investment account unless you plan to deposit additional funds other than the PPM there.  They don't want one penny out of their PPM into an investment acct.  They want to invest but are living pay to pay often because of debt or expenses.\n\nThe best thing to do is explain to them how to cut costs, without trimming costs there's no way they can invest.\n\nI've frequently offered to help but they would say if I cut the amount of dinners and just give them the extra $ they would gladly eat takeout instead.  \n\nSo, the most important thing for me is to giving them education.  No amount of $$  will change their perspective without education.",
            "author": "MKTekke",
            "id": "hvloqoo",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1644003378.0,
            "replies": [
                {
                    "body": "> *They don't want one penny out of their PPM into an investment acct. They want to invest but are living pay to pay often because of debt or expenses.*\n\neverybody can save, and everybody should save. you look at the stories of hardworking immigrants who come here with nothing and build successful lives, it underscores the importance of good financial habits.\n\nLearning this idea is a gift. Yes, I know you don't want to hear it, I know there're a lot of exuses that can be made, but trust me.",
                    "author": "mayorofny",
                    "id": "hvuxet9",
                    "parent_id": "t1_hvloqoo",
                    "score": 1,
                    "created_utc": 1644181372.0,
                    "replies": [
                        {
                            "body": "Savings is partly important today, because we are in a hyper-inflationary environment.  You can't outpace inflation by saving, you must use your money to buy assets that hedges against inflation.  Putting money in the bank decreases purchasing power unless you can find a bank that pays you 8% APR.",
                            "author": "MKTekke",
                            "id": "hw121vz",
                            "parent_id": "t1_hvuxet9",
                            "score": 1,
                            "created_utc": 1644286851.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Copying this over from an old DM\n\nOne guy (Michael) I've been seeing for a while, we hang out whenever he's in town, which isn't anything regular, but occasional. So, a lot of time we'll hang out at his hotel room, just relaxing, watching tv and getting room service.\n\nWas hanging out there when he had to do a call - he told me in advance that it was a tough negotiation, and the guy calling would try to get an emotional response. There were like five rounds of the other guy saying something like \"Listen you pussy ass bitch, we're never going for this bullshit you criminal jackasses are trying to get us to agree to, you're all assholes and I'm going to fuck your mother\" and Michael would respond with \"So, we could possibly sweeten the offer with an additional amount, but in return we'd need you to agree to ....\", followed by another round of (even worse) name calling. I've never seen anything like it, even on tv or a movie.\n\nAfter, he's like \"Look, it's just a negotiation, trying to get a deal done, but he's trying to make it emotional by calling names. You can't let it get emotional, either you're making money off of the other guy's emotional response or he's making money off of yours, which do you want to be\". And I could just see how any normal person would have gotten upset at the namecalling, was a great lesson. Overall, I just have seen a lot of business interactions that are interesting, and I'd never have insight into if not for spending time with older men.\n\n&#x200B;\n\nI've had a number of times where an SD or just an older guy I know for whatever reason has said \"Here's some wisdom\" and I've gotten a lot out of it, but that one stood out because I don't think that was even what he was trying to do right then.",
            "author": "NoLimitLexa",
            "id": "hvpvgiz",
            "parent_id": "t3_skjbxe",
            "score": 3,
            "created_utc": 1644080984.0,
            "replies": [
                {
                    "body": "Wow, that's actually intense. That's a lesson\\\\experience you could never get at school and I imagine it's a great lesson for SB about negotiation in an emotional environment.",
                    "author": "_CallMeDodge_",
                    "id": "hvpyb3z",
                    "parent_id": "t1_hvpvgiz",
                    "score": 1,
                    "created_utc": 1644082102.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly a lot of these things sound like a cookbook. \n\nAsk her. If you want to help her achieve her dreams, you have to help her achieve **her** dreams. Maybe that’s just the financial support she needs. Maybe it’s emotional support. It’s different for each person and you need to be in tune to each person. \n\nOnce someone had their thesis defense coming up. I asked what I could do to help. She wanted a certain outfit. I got it for her: a specific sweater and skirt. She nailed it but that was her doing. I just provided moral support and maybe the sweater made her feel more confident. But she did it.",
            "author": "daddoms",
            "id": "hvlbfz3",
            "parent_id": "t3_skjbxe",
            "score": 4,
            "created_utc": 1643998410.0,
            "replies": []
        },
        {
            "body": "*SDs, do you have other ideas in the same vein?*\n\nIn my past SRs, its also been about exposing her to cultural things she might never have experienced before. The symphony, a Broadway show, an opera. Sometimes the experiences and memories will last longer than the cash.",
            "author": "BinghamtonSD",
            "id": "hvlp9kx",
            "parent_id": "t3_skjbxe",
            "score": 1,
            "created_utc": 1644003575.0,
            "replies": []
        },
        {
            "body": "Cash. Unfortunately, I'm not dumb.",
            "author": "KitehDotNet",
            "id": "hvlbtw3",
            "parent_id": "t3_skjbxe",
            "score": 2,
            "created_utc": 1643998553.0,
            "replies": []
        },
        {
            "body": "I often wonder if some of the perks and the amount of sugar noted in some posts are above and beyond. Some SBs may have the impression that all SD have unlimited resources.  I tend to believe that most SDs are money-smart, somewhat frugal, but fair. The perks noted in this article, although wonderful, may create a somewhat false illusion that makes the game more complicated than it needs to be.",
            "author": null,
            "id": "hvm27sf",
            "parent_id": "t3_skjbxe",
            "score": 1,
            "created_utc": 1644008462.0,
            "replies": [
                {
                    "body": "The way I look at it is there is the VERY traditional SR, your Coca Cola, that is VERY sweet and feels above and beyond for all involved.\n\nThen there’s what MOST of us on this forum are involved with, the Diet Coke version of the traditional SR. \n\nBoth are great, but all involved must be matched on their style or expectations will never be met.",
                    "author": "Azucarbabby",
                    "id": "hvmo1nd",
                    "parent_id": "t1_hvm27sf",
                    "score": 8,
                    "created_utc": 1644017064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">SDs, do you have other ideas in the same vein?\n\nGive her more money and stop deluding yourself into thinking you're Robin Hood.",
            "author": "Anoonnyymmoous",
            "id": "hvmp3r1",
            "parent_id": "t3_skjbxe",
            "score": -2,
            "created_utc": 1644017516.0,
            "replies": [
                {
                    "body": "> SDs, do you have other ideas in the same vein?\n>\n\n>*Give her more money and stop deluding yourself into thinking you're Robin Hood.*\n\nYou’re thinking of a White Night.  Robin Hood stole from the rich and and then kept most of it for himself. \n\nBut at least your heart was in the wrong place.  😆",
                    "author": "Chill_SD1974",
                    "id": "hvnqdke",
                    "parent_id": "t1_hvmp3r1",
                    "score": 3,
                    "created_utc": 1644034770.0,
                    "replies": [
                        {
                            "body": "Robin Hood took from the rich (himself) and gave to the needy. The analogy wasn't perfect, but it clearly made a point strong enough to elicit a reaction.\n\nBut at least your mansplaining condescending heart was in the wrong place.",
                            "author": "Anoonnyymmoous",
                            "id": "hvnvf4k",
                            "parent_id": "t1_hvnqdke",
                            "score": -2,
                            "created_utc": 1644037496.0,
                            "replies": [
                                {
                                    "body": "*But while Robin is willing to lend to a knight who finds himself in financial difficulties, in The Lyttle Geste and in other early ballads **there is no mention of money being distributed among the peasants or of society being reordered to their advantage.** On the contrary, stories that have the outlaws mutilating a vanquished enemy and even killing a child on one occasion show them in a quite different light.*\n\nRiiiiiight. \n\nWhat a lovely fairy tale you believe in. \nLook at Myth # 3.  \n[Robin Hood: 7 myths about the legendary outlaw of Sherwood Forest](https://www.historyextra.com/period/medieval/robin-hood-real-myths-facts/)",
                                    "author": "Chill_SD1974",
                                    "id": "hvpek9g",
                                    "parent_id": "t1_hvnvf4k",
                                    "score": 2,
                                    "created_utc": 1644074055.0,
                                    "replies": [
                                        {
                                            "body": "I'm not confused about whether Robin Hood was \\*actually\\* a hero. He likely wasn't.\n\nHowever, there is \\*absolutely zero\\* doubt that the prevailing understanding of Robin Hood is that he took from the rich and gave to the poor.",
                                            "author": "Anoonnyymmoous",
                                            "id": "hvpffud",
                                            "parent_id": "t1_hvpek9g",
                                            "score": 1,
                                            "created_utc": 1644074442.0,
                                            "replies": [
                                                {
                                                    "body": "That Robin Hood may or may not be a great guy was a side comment you latched on to. \n\nThe real problem with your analogy — my bad for not “mansplaining” it better — is why the fuck would an SD need to “steal from the rich?”  Doesn’t the SD have their own money?\n\nThis is why the White Night rescuing the Damsel in distress is more appropriate. \n\nClass dismissed.",
                                                    "author": "Chill_SD1974",
                                                    "id": "hvpgr59",
                                                    "parent_id": "t1_hvpffud",
                                                    "score": 1,
                                                    "created_utc": 1644075020.0,
                                                    "replies": [
                                                        {
                                                            "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
                                                            "author": "Anoonnyymmoous",
                                                            "id": "hvphs2w",
                                                            "parent_id": "t1_hvpgr59",
                                                            "score": 1,
                                                            "created_utc": 1644075459.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                                                                    "author": "Chill_SD1974",
                                                                    "id": "hvpln29",
                                                                    "parent_id": "t1_hvphs2w",
                                                                    "score": 1,
                                                                    "created_utc": 1644077073.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not a mentor.. for me it’s about companionship and intimacy only. I make that perfectly clear at our initial M&G",
            "author": "lessgeo",
            "id": "hvlwml8",
            "parent_id": "t3_skjbxe",
            "score": 0,
            "created_utc": 1644006346.0,
            "replies": [
                {
                    "body": "honest and sincere post that often lands at the bottom.",
                    "author": null,
                    "id": "hvq27nt",
                    "parent_id": "t1_hvlwml8",
                    "score": 0,
                    "created_utc": 1644083592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Frankly I don’t care. I will get downvoted but I just want to be honest. \n\nTo me an SR is always about the present and the time we are experiencing now. Within that context if I can be helpful to her progress in life, I am happy to help within reasonable bounds but let’s not forget the ppm and allowance that is already on the table. \n\nPlus she is an adult responsible for her own life. She may have others who support her including her parents,  other SDs or sponsors. I don’t want to think that I know what’s best for her and offer her investment ideas and products and stuff.",
            "author": null,
            "id": "hvlc3g4",
            "parent_id": "t3_skjbxe",
            "score": -4,
            "created_utc": 1643998651.0,
            "replies": [
                {
                    "body": "I agree a lot of these guys are going above and beyond. If I met an SB that was worth all that cool. But 9 out of 10 I meet make as little effort as possible and expect as much cash as possible.",
                    "author": "Careless-Parfait-587",
                    "id": "hvlg4j0",
                    "parent_id": "t1_hvlc3g4",
                    "score": 0,
                    "created_utc": 1644000147.0,
                    "replies": [
                        {
                            "body": "Going above and beyond is one thing, I just hope they are taking care of their families especially their children first.  I actually think some SDs are doing them a disfavor by going too far helping their SBs.  Many SBs can never quit their lifestyle because they have too much access and entitlements offered by their SDs.  When they quit SR or too old to keep the whales, they end up being depressed because they learned how to live in luxury but they can't afford to live like that without access to whales.  SR is a very short shelf life.  Whenever the SD takes a SB to expensive places, it's actually he that gets the most value out of it not the SB.  Because other people will look and thinks that he's scored some trophy girl but really it's just a SB.",
                            "author": "MKTekke",
                            "id": "hvlq9ge",
                            "parent_id": "t1_hvlg4j0",
                            "score": -1,
                            "created_utc": 1644003952.0,
                            "replies": [
                                {
                                    "body": "I think SR's are highly transient and both parties need to understand it. If anything an SD should stay away from putting a 'mark' on an SB's future.\n\nI am not asking anyone to mislead anyone but at the very least not over intrude on turf that is not really yours.\n\nSB's are young women and over time they will figure out things on their own. Read this forum and you will see many ladies have multiple SD's, vanilla boyfriends etc, so what is the point for any guy to go above and beyond.\n\nThe best case scenario is for the SB to find a solid vanilla partner who can take her into her future. That is what I have wanted for all of my SB's that they leave SR's fully and soon and meet great vanilla dudes who can offer a great long term future.",
                                    "author": null,
                                    "id": "hvls0fn",
                                    "parent_id": "t1_hvlq9ge",
                                    "score": 5,
                                    "created_utc": 1644004606.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is presuming that's what they want out of the arrangement. Most of the PSBs I've met just want to enjoy life. They aren't interested in advice, investments, etc. They want cash in hand, some luxurious experiences, and to feel appreciated. The one that was thinking more long term, I helped her start a business, which quickly ended the SR. \n\nWe aren't here to save these women, unless that's what they are asking for. They are adults and are, or at least should be, self reliant.",
            "author": "AShatteredKing",
            "id": "hvpee7l",
            "parent_id": "t3_skjbxe",
            "score": 0,
            "created_utc": 1644073980.0,
            "replies": [
                {
                    "body": "100%. I had an SB last year and she literally told me she just wanted to have fun while she was young. I respect that, and I helped her the way she wanted. But I personally got way less satisfaction out of it. For whatever reason, I vibe with the ambitious type. That's what works for me",
                    "author": "_CallMeDodge_",
                    "id": "hvpwt1e",
                    "parent_id": "t1_hvpee7l",
                    "score": 1,
                    "created_utc": 1644081518.0,
                    "replies": [
                        {
                            "body": "I am not ambitious at all and tend to vibe with smart unambitious women.",
                            "author": "AShatteredKing",
                            "id": "hvwy7t3",
                            "parent_id": "t1_hvpwt1e",
                            "score": 2,
                            "created_utc": 1644215583.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">We aren't here to save these women, unless that's what they are asking for. They are adults and are, or at least should be, self reliant.\n\n10000% true. We are SD's and not KISA's (Knights in shinning armor). The whole notion of yo baby I know better what is good for you because I have a bigger belly and more grey hair is quite KISA in my mind. These ladies have grown up in the digital age have more access to more information that we have until many of us were 30. What they do with these tools and how they take their lives is their choice. We can make their lives great when we are together but thats all we can do.",
                    "author": null,
                    "id": "hvq2o29",
                    "parent_id": "t1_hvpee7l",
                    "score": 1,
                    "created_utc": 1644083773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wow the therapy one 👏👏",
            "author": "TlMEGH0ST",
            "id": "hvmiqwc",
            "parent_id": "t1_hvl9zp4",
            "score": 25,
            "created_utc": 1644014900.0,
            "replies": [
                {
                    "body": "I completely agree. So many sbs or women looking to become sbs feel they have to be this completely perfect and polished person while most men (in my experience) are looking for a sh to be herself flaws and all and I applaud the SDs helping get their SBs mental health care, and the SBs for putting their true selves out there because nobody is perfect but everyone is perfect and beautiful in their own way, flaws included.",
                    "author": "Beneficial-Agent4000",
                    "id": "hvo746n",
                    "parent_id": "t1_hvmiqwc",
                    "score": 8,
                    "created_utc": 1644044887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very good point on mental health.  I myself am bipolar and didn’t address it correctly until my 30’s.  I have helped several SB’s with mental health issues get into the right insurance programs for Meds and therapy.",
            "author": "LotBuilder",
            "id": "hvlyg12",
            "parent_id": "t1_hvl9zp4",
            "score": 24,
            "created_utc": 1644007029.0,
            "replies": []
        },
        {
            "body": "Also in Canada, curious about the health assessment. I’ve been meaning to do this just for funsies. Was it successful? Did you find the problem?",
            "author": "WestCoastCompanion",
            "id": "hvn508i",
            "parent_id": "t1_hvl9zp4",
            "score": 2,
            "created_utc": 1644024565.0,
            "replies": [
                {
                    "body": "Still going through the tests so inconclusive so far, but overall, the experience was awesome.  Doctors who actually listened, MRI & CT scans in a matter of weeks vs months (apparently they have a team of 10 people keeping tabs on cancellations and then jump on them), full bloodwork with extra tests, etc etc.\n\nIt wasn't cheap ($XXXX), but it was better than the patchwork of family doctors & referrals which take forever.  I'd say go for it!",
                    "author": "ResidentGelatoExpert",
                    "id": "hvntfju",
                    "parent_id": "t1_hvn508i",
                    "score": 3,
                    "created_utc": 1644036398.0,
                    "replies": [
                        {
                            "body": "Sounds great! I think I will. 4 figures is not bad at all, coming from a dual citizen who’s payed US Hospital bills lol I don’t have any issues at the moment, but would be cool to see if there’s anything lurking around.",
                            "author": "WestCoastCompanion",
                            "id": "hvntuh2",
                            "parent_id": "t1_hvntfju",
                            "score": 4,
                            "created_utc": 1644036621.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The therapy one made my cry a little and is inspiring me to ask my SD for this support",
            "author": "Anastasiaxoxox",
            "id": "hzqf72m",
            "parent_id": "t1_hvl9zp4",
            "score": 1,
            "created_utc": 1646677610.0,
            "replies": []
        },
        {
            "body": "| Broadway shows\n\nGood point. Unique memories together kind of works the same",
            "author": "_CallMeDodge_",
            "id": "hvlc0td",
            "parent_id": "t1_hvla34d",
            "score": 23,
            "created_utc": 1643998623.0,
            "replies": []
        },
        {
            "body": "You should take her abroad! 😻",
            "author": "SBerryTrifle",
            "id": "hvld4fk",
            "parent_id": "t1_hvla34d",
            "score": 10,
            "created_utc": 1643999032.0,
            "replies": []
        },
        {
            "body": "broadways shows 🤩 creative AND thoughtful!",
            "author": "kimmy_bb",
            "id": "hvop0su",
            "parent_id": "t1_hvla34d",
            "score": 3,
            "created_utc": 1644058829.0,
            "replies": []
        },
        {
            "body": "There is something so wonderful about a person caring for not only you, but then also your loved ones. 🥰",
            "author": "Cdnsugarr",
            "id": "hvmidkq",
            "parent_id": "t1_hvlesb1",
            "score": 10,
            "created_utc": 1644014747.0,
            "replies": []
        },
        {
            "body": "omg your SD sounds amazing!! i love how he also went out of his way to help your sister too <33 stuff related to helping you discover more things about you (like the cultural stuff) and helping your family is always great aahh im glad you found him!",
            "author": "Superb-Scale4533",
            "id": "hvokngi",
            "parent_id": "t1_hvlesb1",
            "score": 7,
            "created_utc": 1644055306.0,
            "replies": []
        },
        {
            "body": ">Was it platonic as well that ended when he moved ?",
            "author": null,
            "id": "hvq2yhh",
            "parent_id": "t1_hvlesb1",
            "score": 1,
            "created_utc": 1644083889.0,
            "replies": []
        },
        {
            "body": "This isn’t work…",
            "author": null,
            "id": "hwbo6bp",
            "parent_id": "t1_hvlfq5c",
            "score": 1,
            "created_utc": 1644465987.0,
            "replies": []
        },
        {
            "body": "😹 you should complain to the professor   \n\nI know it was good because I wrote it for her! You are denigrating what I have legitimately cheated!",
            "author": "SBerryTrifle",
            "id": "hvl9uf1",
            "parent_id": "t1_hvl8anl",
            "score": 17,
            "created_utc": 1643997826.0,
            "replies": []
        },
        {
            "body": "lol but no",
            "author": "_CallMeDodge_",
            "id": "hvlbrl1",
            "parent_id": "t1_hvl8anl",
            "score": 5,
            "created_utc": 1643998529.0,
            "replies": []
        },
        {
            "body": "Are you married and do you have children?",
            "author": null,
            "id": "hvncjf1",
            "parent_id": "t1_hvn1il9",
            "score": 3,
            "created_utc": 1644028042.0,
            "replies": []
        },
        {
            "body": "New to this subreddit, and this place seems to really emphasize the allowance-based model of SB/SD.  Personally, I am similar to what it sounds like you do.",
            "author": "westcoaststyleballs",
            "id": "hvlhkzz",
            "parent_id": "t1_hvlbv59",
            "score": 8,
            "created_utc": 1644000682.0,
            "replies": [
                {
                    "body": "It really depends upon what the two people need.  Allowance is commonly discussed here and it is a pretty easy starting point... usually with weekly advances for a few weeks then into the first month.  \n\n\nIn the case of SB#1 for me, she had an immediate need for a place to live.  I also needed a crash pad as I was working in town but main home 3 hours away.  I just bought a condo, she lived there full time and I was there part time.  It worked for us.  Now the condo is just another rental property for me since we no longer need it.  \n\n\nThe main thing in my mind is be honest with each other about what you need/want and see if you can help each other.  I get a sense of satisfaction making a positive difference for people I care about.  If I didn't want to care about the beautiful young woman in my life I would just be a John and do that lifestyle.  It IS very different and not for me, though I know it has a place.",
                    "author": "TXPolyDaddy",
                    "id": "hvlvmlb",
                    "parent_id": "t1_hvlhkzz",
                    "score": 8,
                    "created_utc": 1644005976.0,
                    "replies": []
                },
                {
                    "body": "Normally an SR will start as PPM until both sides are comfortable and enough trust to move to an allowance.  For me, it normally takes a month or two.",
                    "author": "MrRhoarke",
                    "id": "hvlpsp2",
                    "parent_id": "t1_hvlhkzz",
                    "score": 5,
                    "created_utc": 1644003776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice",
            "author": "lipstickdiet",
            "id": "hvlkp91",
            "parent_id": "t1_hvlbv59",
            "score": 2,
            "created_utc": 1644001855.0,
            "replies": []
        },
        {
            "body": "That is the best advice to give any woman 😊 your a good man",
            "author": "Secure_Bend_18",
            "id": "hvnn5aq",
            "parent_id": "t1_hvlwlwc",
            "score": 1,
            "created_utc": 1644033137.0,
            "replies": []
        },
        {
            "body": "Omggg I love all of these so much 😍😍😍",
            "author": "Anastasiaxoxox",
            "id": "hzqswbk",
            "parent_id": "t1_hvqa629",
            "score": 1,
            "created_utc": 1646682901.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvlfkah",
            "parent_id": "t1_hvl9v3j",
            "score": 9,
            "created_utc": 1643999938.0,
            "replies": [
                {
                    "body": "Oh I have done the same and more for vanilla girlfriends too... People do...",
                    "author": "SpartanInBritain",
                    "id": "hvlk267",
                    "parent_id": "t1_hvlfkah",
                    "score": 5,
                    "created_utc": 1644001611.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hvlk946",
                            "parent_id": "t1_hvlk267",
                            "score": 9,
                            "created_utc": 1644001685.0,
                            "replies": [
                                {
                                    "body": "I hope you find the right person to connect, sugar or vanilla",
                                    "author": "SpartanInBritain",
                                    "id": "hvll6iy",
                                    "parent_id": "t1_hvlk946",
                                    "score": 6,
                                    "created_utc": 1644002038.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Most don't have the financial cash flow to do it.",
                    "author": "GACyberCool",
                    "id": "hvp80tq",
                    "parent_id": "t1_hvlfkah",
                    "score": 2,
                    "created_utc": 1644071041.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hvp86zd",
                            "parent_id": "t1_hvp80tq",
                            "score": 2,
                            "created_utc": 1644071125.0,
                            "replies": [
                                {
                                    "body": "A vanilla boyfriend or a vanilla boyfriend that can lavish his girlfriend with these type of experiences and gifts?",
                                    "author": "GACyberCool",
                                    "id": "hvq9ulq",
                                    "parent_id": "t1_hvp86zd",
                                    "score": 1,
                                    "created_utc": 1644087611.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hvqa9f3",
                                            "parent_id": "t1_hvq9ulq",
                                            "score": 2,
                                            "created_utc": 1644087802.0,
                                            "replies": [
                                                {
                                                    "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
                                                    "author": "GACyberCool",
                                                    "id": "hvqbp54",
                                                    "parent_id": "t1_hvqa9f3",
                                                    "score": 1,
                                                    "created_utc": 1644088447.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have to find someone that is well to do who is really offering you a SR not just someone who only beds with you and nothing else.",
            "author": "MKTekke",
            "id": "hvlpivs",
            "parent_id": "t1_hvljebw",
            "score": 9,
            "created_utc": 1644003672.0,
            "replies": [
                {
                    "body": "That’s what I’m looking for!",
                    "author": null,
                    "id": "hvlqcwn",
                    "parent_id": "t1_hvlpivs",
                    "score": 5,
                    "created_utc": 1644003989.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Never been into guns myself, don’t think anyone in my extended family own ones (apart from my grandpa who goes hunting for deer).\n\nHowever I would like to learn the basics if nothing else for safety in case I ever need to handle one. Might be fun to do it together with a SB. \n\nWhat do you suggest? Can we just show up at a gun range? I’m assuming they must have a beginner overview course? Do I need a permit before I go? Do I need my own gun? Can I borrow one.\n\nHope you don’t mind sharing some knowledge.",
            "author": "techsd00",
            "id": "hvnsvmd",
            "parent_id": "t1_hvnoql0",
            "score": 4,
            "created_utc": 1644036097.0,
            "replies": []
        },
        {
            "body": "as you're learning, it's not just intimacy but you can have a lot of font too!",
            "author": "mayorofny",
            "id": "hvublut",
            "parent_id": "t1_hvo85zp",
            "score": 3,
            "created_utc": 1644172620.0,
            "replies": [
                {
                    "body": "𝑺𝒐𝒎𝒆𝒕𝒊𝒎𝒆𝒔 𝒔𝒊𝒎𝒑𝒍𝒆 𝒕𝒉𝒊𝒏𝒈𝒔 𝒍𝒊𝒌𝒆 𝒇𝒐𝒏𝒕 𝒎𝒂𝒌𝒆 𝒆𝒗𝒆𝒓𝒚𝒕𝒉𝒊𝒏𝒈 𝒕𝒉𝒂𝒕 𝒎𝒖𝒄𝒉 𝒃𝒆𝒕𝒕𝒆𝒓😉",
                    "author": "Gold_Syllabub_3782",
                    "id": "hvw774w",
                    "parent_id": "t1_hvublut",
                    "score": 1,
                    "created_utc": 1644201422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very typical!",
            "author": null,
            "id": "hvn899g",
            "parent_id": "t1_hvmdwc7",
            "score": 1,
            "created_utc": 1644026077.0,
            "replies": []
        },
        {
            "body": "I would be so grateful 🥺🥺🥺",
            "author": "LesLez",
            "id": "hvrve5z",
            "parent_id": "t1_hvmdwc7",
            "score": 1,
            "created_utc": 1644115057.0,
            "replies": []
        },
        {
            "body": "> *They don't want one penny out of their PPM into an investment acct. They want to invest but are living pay to pay often because of debt or expenses.*\n\neverybody can save, and everybody should save. you look at the stories of hardworking immigrants who come here with nothing and build successful lives, it underscores the importance of good financial habits.\n\nLearning this idea is a gift. Yes, I know you don't want to hear it, I know there're a lot of exuses that can be made, but trust me.",
            "author": "mayorofny",
            "id": "hvuxet9",
            "parent_id": "t1_hvloqoo",
            "score": 1,
            "created_utc": 1644181372.0,
            "replies": [
                {
                    "body": "Savings is partly important today, because we are in a hyper-inflationary environment.  You can't outpace inflation by saving, you must use your money to buy assets that hedges against inflation.  Putting money in the bank decreases purchasing power unless you can find a bank that pays you 8% APR.",
                    "author": "MKTekke",
                    "id": "hw121vz",
                    "parent_id": "t1_hvuxet9",
                    "score": 1,
                    "created_utc": 1644286851.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, that's actually intense. That's a lesson\\\\experience you could never get at school and I imagine it's a great lesson for SB about negotiation in an emotional environment.",
            "author": "_CallMeDodge_",
            "id": "hvpyb3z",
            "parent_id": "t1_hvpvgiz",
            "score": 1,
            "created_utc": 1644082102.0,
            "replies": []
        },
        {
            "body": "The way I look at it is there is the VERY traditional SR, your Coca Cola, that is VERY sweet and feels above and beyond for all involved.\n\nThen there’s what MOST of us on this forum are involved with, the Diet Coke version of the traditional SR. \n\nBoth are great, but all involved must be matched on their style or expectations will never be met.",
            "author": "Azucarbabby",
            "id": "hvmo1nd",
            "parent_id": "t1_hvm27sf",
            "score": 8,
            "created_utc": 1644017064.0,
            "replies": []
        },
        {
            "body": "> SDs, do you have other ideas in the same vein?\n>\n\n>*Give her more money and stop deluding yourself into thinking you're Robin Hood.*\n\nYou’re thinking of a White Night.  Robin Hood stole from the rich and and then kept most of it for himself. \n\nBut at least your heart was in the wrong place.  😆",
            "author": "Chill_SD1974",
            "id": "hvnqdke",
            "parent_id": "t1_hvmp3r1",
            "score": 3,
            "created_utc": 1644034770.0,
            "replies": [
                {
                    "body": "Robin Hood took from the rich (himself) and gave to the needy. The analogy wasn't perfect, but it clearly made a point strong enough to elicit a reaction.\n\nBut at least your mansplaining condescending heart was in the wrong place.",
                    "author": "Anoonnyymmoous",
                    "id": "hvnvf4k",
                    "parent_id": "t1_hvnqdke",
                    "score": -2,
                    "created_utc": 1644037496.0,
                    "replies": [
                        {
                            "body": "*But while Robin is willing to lend to a knight who finds himself in financial difficulties, in The Lyttle Geste and in other early ballads **there is no mention of money being distributed among the peasants or of society being reordered to their advantage.** On the contrary, stories that have the outlaws mutilating a vanquished enemy and even killing a child on one occasion show them in a quite different light.*\n\nRiiiiiight. \n\nWhat a lovely fairy tale you believe in. \nLook at Myth # 3.  \n[Robin Hood: 7 myths about the legendary outlaw of Sherwood Forest](https://www.historyextra.com/period/medieval/robin-hood-real-myths-facts/)",
                            "author": "Chill_SD1974",
                            "id": "hvpek9g",
                            "parent_id": "t1_hvnvf4k",
                            "score": 2,
                            "created_utc": 1644074055.0,
                            "replies": [
                                {
                                    "body": "I'm not confused about whether Robin Hood was \\*actually\\* a hero. He likely wasn't.\n\nHowever, there is \\*absolutely zero\\* doubt that the prevailing understanding of Robin Hood is that he took from the rich and gave to the poor.",
                                    "author": "Anoonnyymmoous",
                                    "id": "hvpffud",
                                    "parent_id": "t1_hvpek9g",
                                    "score": 1,
                                    "created_utc": 1644074442.0,
                                    "replies": [
                                        {
                                            "body": "That Robin Hood may or may not be a great guy was a side comment you latched on to. \n\nThe real problem with your analogy — my bad for not “mansplaining” it better — is why the fuck would an SD need to “steal from the rich?”  Doesn’t the SD have their own money?\n\nThis is why the White Night rescuing the Damsel in distress is more appropriate. \n\nClass dismissed.",
                                            "author": "Chill_SD1974",
                                            "id": "hvpgr59",
                                            "parent_id": "t1_hvpffud",
                                            "score": 1,
                                            "created_utc": 1644075020.0,
                                            "replies": [
                                                {
                                                    "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
                                                    "author": "Anoonnyymmoous",
                                                    "id": "hvphs2w",
                                                    "parent_id": "t1_hvpgr59",
                                                    "score": 1,
                                                    "created_utc": 1644075459.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                                                            "author": "Chill_SD1974",
                                                            "id": "hvpln29",
                                                            "parent_id": "t1_hvphs2w",
                                                            "score": 1,
                                                            "created_utc": 1644077073.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "honest and sincere post that often lands at the bottom.",
            "author": null,
            "id": "hvq27nt",
            "parent_id": "t1_hvlwml8",
            "score": 0,
            "created_utc": 1644083592.0,
            "replies": []
        },
        {
            "body": "I agree a lot of these guys are going above and beyond. If I met an SB that was worth all that cool. But 9 out of 10 I meet make as little effort as possible and expect as much cash as possible.",
            "author": "Careless-Parfait-587",
            "id": "hvlg4j0",
            "parent_id": "t1_hvlc3g4",
            "score": 0,
            "created_utc": 1644000147.0,
            "replies": [
                {
                    "body": "Going above and beyond is one thing, I just hope they are taking care of their families especially their children first.  I actually think some SDs are doing them a disfavor by going too far helping their SBs.  Many SBs can never quit their lifestyle because they have too much access and entitlements offered by their SDs.  When they quit SR or too old to keep the whales, they end up being depressed because they learned how to live in luxury but they can't afford to live like that without access to whales.  SR is a very short shelf life.  Whenever the SD takes a SB to expensive places, it's actually he that gets the most value out of it not the SB.  Because other people will look and thinks that he's scored some trophy girl but really it's just a SB.",
                    "author": "MKTekke",
                    "id": "hvlq9ge",
                    "parent_id": "t1_hvlg4j0",
                    "score": -1,
                    "created_utc": 1644003952.0,
                    "replies": [
                        {
                            "body": "I think SR's are highly transient and both parties need to understand it. If anything an SD should stay away from putting a 'mark' on an SB's future.\n\nI am not asking anyone to mislead anyone but at the very least not over intrude on turf that is not really yours.\n\nSB's are young women and over time they will figure out things on their own. Read this forum and you will see many ladies have multiple SD's, vanilla boyfriends etc, so what is the point for any guy to go above and beyond.\n\nThe best case scenario is for the SB to find a solid vanilla partner who can take her into her future. That is what I have wanted for all of my SB's that they leave SR's fully and soon and meet great vanilla dudes who can offer a great long term future.",
                            "author": null,
                            "id": "hvls0fn",
                            "parent_id": "t1_hvlq9ge",
                            "score": 5,
                            "created_utc": 1644004606.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100%. I had an SB last year and she literally told me she just wanted to have fun while she was young. I respect that, and I helped her the way she wanted. But I personally got way less satisfaction out of it. For whatever reason, I vibe with the ambitious type. That's what works for me",
            "author": "_CallMeDodge_",
            "id": "hvpwt1e",
            "parent_id": "t1_hvpee7l",
            "score": 1,
            "created_utc": 1644081518.0,
            "replies": [
                {
                    "body": "I am not ambitious at all and tend to vibe with smart unambitious women.",
                    "author": "AShatteredKing",
                    "id": "hvwy7t3",
                    "parent_id": "t1_hvpwt1e",
                    "score": 2,
                    "created_utc": 1644215583.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">We aren't here to save these women, unless that's what they are asking for. They are adults and are, or at least should be, self reliant.\n\n10000% true. We are SD's and not KISA's (Knights in shinning armor). The whole notion of yo baby I know better what is good for you because I have a bigger belly and more grey hair is quite KISA in my mind. These ladies have grown up in the digital age have more access to more information that we have until many of us were 30. What they do with these tools and how they take their lives is their choice. We can make their lives great when we are together but thats all we can do.",
            "author": null,
            "id": "hvq2o29",
            "parent_id": "t1_hvpee7l",
            "score": 1,
            "created_utc": 1644083773.0,
            "replies": []
        },
        {
            "body": "I completely agree. So many sbs or women looking to become sbs feel they have to be this completely perfect and polished person while most men (in my experience) are looking for a sh to be herself flaws and all and I applaud the SDs helping get their SBs mental health care, and the SBs for putting their true selves out there because nobody is perfect but everyone is perfect and beautiful in their own way, flaws included.",
            "author": "Beneficial-Agent4000",
            "id": "hvo746n",
            "parent_id": "t1_hvmiqwc",
            "score": 8,
            "created_utc": 1644044887.0,
            "replies": []
        },
        {
            "body": "Still going through the tests so inconclusive so far, but overall, the experience was awesome.  Doctors who actually listened, MRI & CT scans in a matter of weeks vs months (apparently they have a team of 10 people keeping tabs on cancellations and then jump on them), full bloodwork with extra tests, etc etc.\n\nIt wasn't cheap ($XXXX), but it was better than the patchwork of family doctors & referrals which take forever.  I'd say go for it!",
            "author": "ResidentGelatoExpert",
            "id": "hvntfju",
            "parent_id": "t1_hvn508i",
            "score": 3,
            "created_utc": 1644036398.0,
            "replies": [
                {
                    "body": "Sounds great! I think I will. 4 figures is not bad at all, coming from a dual citizen who’s payed US Hospital bills lol I don’t have any issues at the moment, but would be cool to see if there’s anything lurking around.",
                    "author": "WestCoastCompanion",
                    "id": "hvntuh2",
                    "parent_id": "t1_hvntfju",
                    "score": 4,
                    "created_utc": 1644036621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It really depends upon what the two people need.  Allowance is commonly discussed here and it is a pretty easy starting point... usually with weekly advances for a few weeks then into the first month.  \n\n\nIn the case of SB#1 for me, she had an immediate need for a place to live.  I also needed a crash pad as I was working in town but main home 3 hours away.  I just bought a condo, she lived there full time and I was there part time.  It worked for us.  Now the condo is just another rental property for me since we no longer need it.  \n\n\nThe main thing in my mind is be honest with each other about what you need/want and see if you can help each other.  I get a sense of satisfaction making a positive difference for people I care about.  If I didn't want to care about the beautiful young woman in my life I would just be a John and do that lifestyle.  It IS very different and not for me, though I know it has a place.",
            "author": "TXPolyDaddy",
            "id": "hvlvmlb",
            "parent_id": "t1_hvlhkzz",
            "score": 8,
            "created_utc": 1644005976.0,
            "replies": []
        },
        {
            "body": "Normally an SR will start as PPM until both sides are comfortable and enough trust to move to an allowance.  For me, it normally takes a month or two.",
            "author": "MrRhoarke",
            "id": "hvlpsp2",
            "parent_id": "t1_hvlhkzz",
            "score": 5,
            "created_utc": 1644003776.0,
            "replies": []
        },
        {
            "body": "Oh I have done the same and more for vanilla girlfriends too... People do...",
            "author": "SpartanInBritain",
            "id": "hvlk267",
            "parent_id": "t1_hvlfkah",
            "score": 5,
            "created_utc": 1644001611.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hvlk946",
                    "parent_id": "t1_hvlk267",
                    "score": 9,
                    "created_utc": 1644001685.0,
                    "replies": [
                        {
                            "body": "I hope you find the right person to connect, sugar or vanilla",
                            "author": "SpartanInBritain",
                            "id": "hvll6iy",
                            "parent_id": "t1_hvlk946",
                            "score": 6,
                            "created_utc": 1644002038.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Most don't have the financial cash flow to do it.",
            "author": "GACyberCool",
            "id": "hvp80tq",
            "parent_id": "t1_hvlfkah",
            "score": 2,
            "created_utc": 1644071041.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hvp86zd",
                    "parent_id": "t1_hvp80tq",
                    "score": 2,
                    "created_utc": 1644071125.0,
                    "replies": [
                        {
                            "body": "A vanilla boyfriend or a vanilla boyfriend that can lavish his girlfriend with these type of experiences and gifts?",
                            "author": "GACyberCool",
                            "id": "hvq9ulq",
                            "parent_id": "t1_hvp86zd",
                            "score": 1,
                            "created_utc": 1644087611.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hvqa9f3",
                                    "parent_id": "t1_hvq9ulq",
                                    "score": 2,
                                    "created_utc": 1644087802.0,
                                    "replies": [
                                        {
                                            "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
                                            "author": "GACyberCool",
                                            "id": "hvqbp54",
                                            "parent_id": "t1_hvqa9f3",
                                            "score": 1,
                                            "created_utc": 1644088447.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s what I’m looking for!",
            "author": null,
            "id": "hvlqcwn",
            "parent_id": "t1_hvlpivs",
            "score": 5,
            "created_utc": 1644003989.0,
            "replies": []
        },
        {
            "body": "𝑺𝒐𝒎𝒆𝒕𝒊𝒎𝒆𝒔 𝒔𝒊𝒎𝒑𝒍𝒆 𝒕𝒉𝒊𝒏𝒈𝒔 𝒍𝒊𝒌𝒆 𝒇𝒐𝒏𝒕 𝒎𝒂𝒌𝒆 𝒆𝒗𝒆𝒓𝒚𝒕𝒉𝒊𝒏𝒈 𝒕𝒉𝒂𝒕 𝒎𝒖𝒄𝒉 𝒃𝒆𝒕𝒕𝒆𝒓😉",
            "author": "Gold_Syllabub_3782",
            "id": "hvw774w",
            "parent_id": "t1_hvublut",
            "score": 1,
            "created_utc": 1644201422.0,
            "replies": []
        },
        {
            "body": "Savings is partly important today, because we are in a hyper-inflationary environment.  You can't outpace inflation by saving, you must use your money to buy assets that hedges against inflation.  Putting money in the bank decreases purchasing power unless you can find a bank that pays you 8% APR.",
            "author": "MKTekke",
            "id": "hw121vz",
            "parent_id": "t1_hvuxet9",
            "score": 1,
            "created_utc": 1644286851.0,
            "replies": []
        },
        {
            "body": "Robin Hood took from the rich (himself) and gave to the needy. The analogy wasn't perfect, but it clearly made a point strong enough to elicit a reaction.\n\nBut at least your mansplaining condescending heart was in the wrong place.",
            "author": "Anoonnyymmoous",
            "id": "hvnvf4k",
            "parent_id": "t1_hvnqdke",
            "score": -2,
            "created_utc": 1644037496.0,
            "replies": [
                {
                    "body": "*But while Robin is willing to lend to a knight who finds himself in financial difficulties, in The Lyttle Geste and in other early ballads **there is no mention of money being distributed among the peasants or of society being reordered to their advantage.** On the contrary, stories that have the outlaws mutilating a vanquished enemy and even killing a child on one occasion show them in a quite different light.*\n\nRiiiiiight. \n\nWhat a lovely fairy tale you believe in. \nLook at Myth # 3.  \n[Robin Hood: 7 myths about the legendary outlaw of Sherwood Forest](https://www.historyextra.com/period/medieval/robin-hood-real-myths-facts/)",
                    "author": "Chill_SD1974",
                    "id": "hvpek9g",
                    "parent_id": "t1_hvnvf4k",
                    "score": 2,
                    "created_utc": 1644074055.0,
                    "replies": [
                        {
                            "body": "I'm not confused about whether Robin Hood was \\*actually\\* a hero. He likely wasn't.\n\nHowever, there is \\*absolutely zero\\* doubt that the prevailing understanding of Robin Hood is that he took from the rich and gave to the poor.",
                            "author": "Anoonnyymmoous",
                            "id": "hvpffud",
                            "parent_id": "t1_hvpek9g",
                            "score": 1,
                            "created_utc": 1644074442.0,
                            "replies": [
                                {
                                    "body": "That Robin Hood may or may not be a great guy was a side comment you latched on to. \n\nThe real problem with your analogy — my bad for not “mansplaining” it better — is why the fuck would an SD need to “steal from the rich?”  Doesn’t the SD have their own money?\n\nThis is why the White Night rescuing the Damsel in distress is more appropriate. \n\nClass dismissed.",
                                    "author": "Chill_SD1974",
                                    "id": "hvpgr59",
                                    "parent_id": "t1_hvpffud",
                                    "score": 1,
                                    "created_utc": 1644075020.0,
                                    "replies": [
                                        {
                                            "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
                                            "author": "Anoonnyymmoous",
                                            "id": "hvphs2w",
                                            "parent_id": "t1_hvpgr59",
                                            "score": 1,
                                            "created_utc": 1644075459.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                                                    "author": "Chill_SD1974",
                                                    "id": "hvpln29",
                                                    "parent_id": "t1_hvphs2w",
                                                    "score": 1,
                                                    "created_utc": 1644077073.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Going above and beyond is one thing, I just hope they are taking care of their families especially their children first.  I actually think some SDs are doing them a disfavor by going too far helping their SBs.  Many SBs can never quit their lifestyle because they have too much access and entitlements offered by their SDs.  When they quit SR or too old to keep the whales, they end up being depressed because they learned how to live in luxury but they can't afford to live like that without access to whales.  SR is a very short shelf life.  Whenever the SD takes a SB to expensive places, it's actually he that gets the most value out of it not the SB.  Because other people will look and thinks that he's scored some trophy girl but really it's just a SB.",
            "author": "MKTekke",
            "id": "hvlq9ge",
            "parent_id": "t1_hvlg4j0",
            "score": -1,
            "created_utc": 1644003952.0,
            "replies": [
                {
                    "body": "I think SR's are highly transient and both parties need to understand it. If anything an SD should stay away from putting a 'mark' on an SB's future.\n\nI am not asking anyone to mislead anyone but at the very least not over intrude on turf that is not really yours.\n\nSB's are young women and over time they will figure out things on their own. Read this forum and you will see many ladies have multiple SD's, vanilla boyfriends etc, so what is the point for any guy to go above and beyond.\n\nThe best case scenario is for the SB to find a solid vanilla partner who can take her into her future. That is what I have wanted for all of my SB's that they leave SR's fully and soon and meet great vanilla dudes who can offer a great long term future.",
                    "author": null,
                    "id": "hvls0fn",
                    "parent_id": "t1_hvlq9ge",
                    "score": 5,
                    "created_utc": 1644004606.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am not ambitious at all and tend to vibe with smart unambitious women.",
            "author": "AShatteredKing",
            "id": "hvwy7t3",
            "parent_id": "t1_hvpwt1e",
            "score": 2,
            "created_utc": 1644215583.0,
            "replies": []
        },
        {
            "body": "Sounds great! I think I will. 4 figures is not bad at all, coming from a dual citizen who’s payed US Hospital bills lol I don’t have any issues at the moment, but would be cool to see if there’s anything lurking around.",
            "author": "WestCoastCompanion",
            "id": "hvntuh2",
            "parent_id": "t1_hvntfju",
            "score": 4,
            "created_utc": 1644036621.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvlk946",
            "parent_id": "t1_hvlk267",
            "score": 9,
            "created_utc": 1644001685.0,
            "replies": [
                {
                    "body": "I hope you find the right person to connect, sugar or vanilla",
                    "author": "SpartanInBritain",
                    "id": "hvll6iy",
                    "parent_id": "t1_hvlk946",
                    "score": 6,
                    "created_utc": 1644002038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvp86zd",
            "parent_id": "t1_hvp80tq",
            "score": 2,
            "created_utc": 1644071125.0,
            "replies": [
                {
                    "body": "A vanilla boyfriend or a vanilla boyfriend that can lavish his girlfriend with these type of experiences and gifts?",
                    "author": "GACyberCool",
                    "id": "hvq9ulq",
                    "parent_id": "t1_hvp86zd",
                    "score": 1,
                    "created_utc": 1644087611.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hvqa9f3",
                            "parent_id": "t1_hvq9ulq",
                            "score": 2,
                            "created_utc": 1644087802.0,
                            "replies": [
                                {
                                    "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
                                    "author": "GACyberCool",
                                    "id": "hvqbp54",
                                    "parent_id": "t1_hvqa9f3",
                                    "score": 1,
                                    "created_utc": 1644088447.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "*But while Robin is willing to lend to a knight who finds himself in financial difficulties, in The Lyttle Geste and in other early ballads **there is no mention of money being distributed among the peasants or of society being reordered to their advantage.** On the contrary, stories that have the outlaws mutilating a vanquished enemy and even killing a child on one occasion show them in a quite different light.*\n\nRiiiiiight. \n\nWhat a lovely fairy tale you believe in. \nLook at Myth # 3.  \n[Robin Hood: 7 myths about the legendary outlaw of Sherwood Forest](https://www.historyextra.com/period/medieval/robin-hood-real-myths-facts/)",
            "author": "Chill_SD1974",
            "id": "hvpek9g",
            "parent_id": "t1_hvnvf4k",
            "score": 2,
            "created_utc": 1644074055.0,
            "replies": [
                {
                    "body": "I'm not confused about whether Robin Hood was \\*actually\\* a hero. He likely wasn't.\n\nHowever, there is \\*absolutely zero\\* doubt that the prevailing understanding of Robin Hood is that he took from the rich and gave to the poor.",
                    "author": "Anoonnyymmoous",
                    "id": "hvpffud",
                    "parent_id": "t1_hvpek9g",
                    "score": 1,
                    "created_utc": 1644074442.0,
                    "replies": [
                        {
                            "body": "That Robin Hood may or may not be a great guy was a side comment you latched on to. \n\nThe real problem with your analogy — my bad for not “mansplaining” it better — is why the fuck would an SD need to “steal from the rich?”  Doesn’t the SD have their own money?\n\nThis is why the White Night rescuing the Damsel in distress is more appropriate. \n\nClass dismissed.",
                            "author": "Chill_SD1974",
                            "id": "hvpgr59",
                            "parent_id": "t1_hvpffud",
                            "score": 1,
                            "created_utc": 1644075020.0,
                            "replies": [
                                {
                                    "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
                                    "author": "Anoonnyymmoous",
                                    "id": "hvphs2w",
                                    "parent_id": "t1_hvpgr59",
                                    "score": 1,
                                    "created_utc": 1644075459.0,
                                    "replies": [
                                        {
                                            "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                                            "author": "Chill_SD1974",
                                            "id": "hvpln29",
                                            "parent_id": "t1_hvphs2w",
                                            "score": 1,
                                            "created_utc": 1644077073.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think SR's are highly transient and both parties need to understand it. If anything an SD should stay away from putting a 'mark' on an SB's future.\n\nI am not asking anyone to mislead anyone but at the very least not over intrude on turf that is not really yours.\n\nSB's are young women and over time they will figure out things on their own. Read this forum and you will see many ladies have multiple SD's, vanilla boyfriends etc, so what is the point for any guy to go above and beyond.\n\nThe best case scenario is for the SB to find a solid vanilla partner who can take her into her future. That is what I have wanted for all of my SB's that they leave SR's fully and soon and meet great vanilla dudes who can offer a great long term future.",
            "author": null,
            "id": "hvls0fn",
            "parent_id": "t1_hvlq9ge",
            "score": 5,
            "created_utc": 1644004606.0,
            "replies": []
        },
        {
            "body": "I hope you find the right person to connect, sugar or vanilla",
            "author": "SpartanInBritain",
            "id": "hvll6iy",
            "parent_id": "t1_hvlk946",
            "score": 6,
            "created_utc": 1644002038.0,
            "replies": []
        },
        {
            "body": "A vanilla boyfriend or a vanilla boyfriend that can lavish his girlfriend with these type of experiences and gifts?",
            "author": "GACyberCool",
            "id": "hvq9ulq",
            "parent_id": "t1_hvp86zd",
            "score": 1,
            "created_utc": 1644087611.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hvqa9f3",
                    "parent_id": "t1_hvq9ulq",
                    "score": 2,
                    "created_utc": 1644087802.0,
                    "replies": [
                        {
                            "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
                            "author": "GACyberCool",
                            "id": "hvqbp54",
                            "parent_id": "t1_hvqa9f3",
                            "score": 1,
                            "created_utc": 1644088447.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not confused about whether Robin Hood was \\*actually\\* a hero. He likely wasn't.\n\nHowever, there is \\*absolutely zero\\* doubt that the prevailing understanding of Robin Hood is that he took from the rich and gave to the poor.",
            "author": "Anoonnyymmoous",
            "id": "hvpffud",
            "parent_id": "t1_hvpek9g",
            "score": 1,
            "created_utc": 1644074442.0,
            "replies": [
                {
                    "body": "That Robin Hood may or may not be a great guy was a side comment you latched on to. \n\nThe real problem with your analogy — my bad for not “mansplaining” it better — is why the fuck would an SD need to “steal from the rich?”  Doesn’t the SD have their own money?\n\nThis is why the White Night rescuing the Damsel in distress is more appropriate. \n\nClass dismissed.",
                    "author": "Chill_SD1974",
                    "id": "hvpgr59",
                    "parent_id": "t1_hvpffud",
                    "score": 1,
                    "created_utc": 1644075020.0,
                    "replies": [
                        {
                            "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
                            "author": "Anoonnyymmoous",
                            "id": "hvphs2w",
                            "parent_id": "t1_hvpgr59",
                            "score": 1,
                            "created_utc": 1644075459.0,
                            "replies": [
                                {
                                    "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                                    "author": "Chill_SD1974",
                                    "id": "hvpln29",
                                    "parent_id": "t1_hvphs2w",
                                    "score": 1,
                                    "created_utc": 1644077073.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvqa9f3",
            "parent_id": "t1_hvq9ulq",
            "score": 2,
            "created_utc": 1644087802.0,
            "replies": [
                {
                    "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
                    "author": "GACyberCool",
                    "id": "hvqbp54",
                    "parent_id": "t1_hvqa9f3",
                    "score": 1,
                    "created_utc": 1644088447.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That Robin Hood may or may not be a great guy was a side comment you latched on to. \n\nThe real problem with your analogy — my bad for not “mansplaining” it better — is why the fuck would an SD need to “steal from the rich?”  Doesn’t the SD have their own money?\n\nThis is why the White Night rescuing the Damsel in distress is more appropriate. \n\nClass dismissed.",
            "author": "Chill_SD1974",
            "id": "hvpgr59",
            "parent_id": "t1_hvpffud",
            "score": 1,
            "created_utc": 1644075020.0,
            "replies": [
                {
                    "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
                    "author": "Anoonnyymmoous",
                    "id": "hvphs2w",
                    "parent_id": "t1_hvpgr59",
                    "score": 1,
                    "created_utc": 1644075459.0,
                    "replies": [
                        {
                            "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                            "author": "Chill_SD1974",
                            "id": "hvpln29",
                            "parent_id": "t1_hvphs2w",
                            "score": 1,
                            "created_utc": 1644077073.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's probably about the level of income needed to start comfortably providing these type of experiences.  I'm sorry you are speaking of this in the past tense, but I'm sure it was for a good reason.",
            "author": "GACyberCool",
            "id": "hvqbp54",
            "parent_id": "t1_hvqa9f3",
            "score": 1,
            "created_utc": 1644088447.0,
            "replies": []
        },
        {
            "body": "This isn't the own you think it is.\n\nSaving my time for more valuable interactions.",
            "author": "Anoonnyymmoous",
            "id": "hvphs2w",
            "parent_id": "t1_hvpgr59",
            "score": 1,
            "created_utc": 1644075459.0,
            "replies": [
                {
                    "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
                    "author": "Chill_SD1974",
                    "id": "hvpln29",
                    "parent_id": "t1_hvphs2w",
                    "score": 1,
                    "created_utc": 1644077073.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, I’m sure in your mind this is not the bigger fish you want to die on.",
            "author": "Chill_SD1974",
            "id": "hvpln29",
            "parent_id": "t1_hvphs2w",
            "score": 1,
            "created_utc": 1644077073.0,
            "replies": []
        }
    ]
}