{
    "title": "That scene where he revealed the face of the body he was possesing and the maniac laugh afterwards was fucking iconic",
    "post_id": "n7n3fy",
    "post_url": "https://www.reddit.com/r/dankruto/comments/n7n3fy/that_scene_where_he_revealed_the_face_of_the_body/",
    "author": "floral-dawns",
    "body": "",
    "url": "https://i.redd.it/ijp6ochfrvx61.jpg",
    "score": 4650,
    "upvote_ratio": 0.98,
    "created_utc": 1620472628.0,
    "num_comments": 163,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Pre-timeskip really had a different tone then the rest of the series, sure there were murder lads walking around but pre-skip Itachi and Orochimaru were some really scary people.",
            "author": "Ziggy_the_third",
            "id": "gxdnkz1",
            "parent_id": "t3_n7n3fy",
            "score": 714,
            "created_utc": 1620474939.0,
            "replies": [
                {
                    "body": "Even post time skip, he still held his own against Cloaked Naruto, the same one that almost killed Jiraya. He then fought with Itachi and somehow survived to come back yet again to bring back the Hokage and fight in the final battle. Compared to all but the most elite characters in the end of the series",
                    "author": "FalloutLover7",
                    "id": "gxdu9qg",
                    "parent_id": "t1_gxdnkz1",
                    "score": 170,
                    "created_utc": 1620479538.0,
                    "replies": [
                        {
                            "body": "All with his arms sealed until he brought back the Hokage.",
                            "author": "danceswithdux",
                            "id": "gxdve9m",
                            "parent_id": "t1_gxdu9qg",
                            "score": 109,
                            "created_utc": 1620480227.0,
                            "replies": []
                        },
                        {
                            "body": "I will say, if Jiraiya was fighting to kill Naruto I think he wouldnt have taken such a hit.",
                            "author": "RickyNixon",
                            "id": "gxeczo3",
                            "parent_id": "t1_gxdu9qg",
                            "score": 68,
                            "created_utc": 1620489551.0,
                            "replies": [
                                {
                                    "body": "You also have to take into account that Naruto would’ve kept getting more mad and unleashing more tails like he did against Pain",
                                    "author": "FalloutLover7",
                                    "id": "gxep88x",
                                    "parent_id": "t1_gxeczo3",
                                    "score": 27,
                                    "created_utc": 1620495522.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Again, you misinterpret strength and atmosphere, they gave off this scary vibe and their strength was not what produced this, it was their motives etc.",
                            "author": "Ziggy_the_third",
                            "id": "gxe14s4",
                            "parent_id": "t1_gxdu9qg",
                            "score": 42,
                            "created_utc": 1620483464.0,
                            "replies": [
                                {
                                    "body": "The fact that I started watching Naruto after I finished Banana Fish meant that Orochimaru's obsession with Sasuke was setting off alarm bells in my head from day one.",
                                    "author": "HollyTheMage",
                                    "id": "gxh1u4g",
                                    "parent_id": "t1_gxe14s4",
                                    "score": 1,
                                    "created_utc": 1620542477.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He didn’t really hold his own so much as not die, which is the kind of his whole schtick. Naruto was bullying him right up until Orochimaru used the Grass Longsword, which didn’t really hurt Naruto anyway.",
                            "author": "American_Madman",
                            "id": "gxee4qu",
                            "parent_id": "t1_gxdu9qg",
                            "score": 7,
                            "created_utc": 1620490105.0,
                            "replies": [
                                {
                                    "body": "He had his arms sealed...",
                                    "author": "Crocodile_raper",
                                    "id": "gxehtp1",
                                    "parent_id": "t1_gxee4qu",
                                    "score": 6,
                                    "created_utc": 1620491929.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, and having his arms sealed lead to him getting bullied pretty hard. Not saying he wasn’t weakened, just that he didn’t really hold his own.",
                                            "author": "American_Madman",
                                            "id": "gxeocq7",
                                            "parent_id": "t1_gxehtp1",
                                            "score": 6,
                                            "created_utc": 1620495095.0,
                                            "replies": [
                                                {
                                                    "body": "I'm only at season 8 on Netflix India, so all these happen in the upcoming seasons? Netflix India has only 9 seasons.",
                                                    "author": "lockkheart",
                                                    "id": "gxeyyh7",
                                                    "parent_id": "t1_gxeocq7",
                                                    "score": 2,
                                                    "created_utc": 1620500267.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
                                                            "author": "Majoranza",
                                                            "id": "gxf28jv",
                                                            "parent_id": "t1_gxeyyh7",
                                                            "score": 5,
                                                            "created_utc": 1620501926.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                                                                    "author": "American_Madman",
                                                                    "id": "gxfhcsj",
                                                                    "parent_id": "t1_gxf28jv",
                                                                    "score": 2,
                                                                    "created_utc": 1620509617.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
                                                            "author": "American_Madman",
                                                            "id": "gxffle7",
                                                            "parent_id": "t1_gxeyyh7",
                                                            "score": 2,
                                                            "created_utc": 1620508694.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                                                                    "author": "lockkheart",
                                                                    "id": "gxg70bd",
                                                                    "parent_id": "t1_gxffle7",
                                                                    "score": 2,
                                                                    "created_utc": 1620523200.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
                                                            "author": "Terminal_Monk",
                                                            "id": "gxgqsiq",
                                                            "parent_id": "t1_gxeyyh7",
                                                            "score": 2,
                                                            "created_utc": 1620534477.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I guess I'll have to go the other route :)",
                                                                    "author": "lockkheart",
                                                                    "id": "gxgylbj",
                                                                    "parent_id": "t1_gxgqsiq",
                                                                    "score": 1,
                                                                    "created_utc": 1620539776.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                                                                    "author": "lockkheart",
                                                                    "id": "gxilqg1",
                                                                    "parent_id": "t1_gxgqsiq",
                                                                    "score": 1,
                                                                    "created_utc": 1620581054.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To be fair, if Itachi was still alive by the end of the series, even if he had been nerfed like Orochimaru they would both still be powerhouses. People like to shit on the part 1 big boys because of the power creep in Shippuden, but forget that outside of the protagonists, a LOT of the world is still the way it was. Suigetsu woke up from a nap and smacked the fuck out of Boruto’s classmates with very little effort, and he’s definitely not as strong as Orochimaru.",
                    "author": "Agorbs",
                    "id": "gxds2m9",
                    "parent_id": "t1_gxdnkz1",
                    "score": 169,
                    "created_utc": 1620478117.0,
                    "replies": [
                        {
                            "body": "My thoughts were more about the atmosphere, and not really strength related, part 1 Itachi wasn't scary just because he was strong, but the way he used his strength was scary, and types of moves he was employing. It was the personalities we saw more than their strength.",
                            "author": "Ziggy_the_third",
                            "id": "gxdsi1p",
                            "parent_id": "t1_gxds2m9",
                            "score": 128,
                            "created_utc": 1620478399.0,
                            "replies": [
                                {
                                    "body": "Yeah I can agree there. Itachi oozed this aura of cold, calculated genius killer. No wasted movements, no wasted words, just pure lethality.",
                                    "author": "Agorbs",
                                    "id": "gxdsx3u",
                                    "parent_id": "t1_gxdsi1p",
                                    "score": 90,
                                    "created_utc": 1620478680.0,
                                    "replies": [
                                        {
                                            "body": "The Itachi vs Kakashi/Asuma/Kurama fight made it seem like the level of ninja that Konoha had was no match for Itachi. You also vaguely knew that 8 more, and assumed they were all like Itachi.\n\nOnce we skip forward, Naruto always seemed capable of protecting himself, and the rest of the Akatsuki were reckless psychos. Only a few even remotely gave the same vibes.",
                                            "author": "Harden-Soul",
                                            "id": "gxekvdy",
                                            "parent_id": "t1_gxdsx3u",
                                            "score": 28,
                                            "created_utc": 1620493427.0,
                                            "replies": [
                                                {
                                                    "body": "Well yeah, but I’d wager there’s very few Konoha shinobi that could take down anyone in Akatsuki regardless. \n\n\nThe main reason Kakuzu and Hidan got killed was because Shikamaru had god tier planning and even then it was pretty close. If Naruto didn’t roll in with his brand new plot device no jutsu...",
                                                    "author": "Agorbs",
                                                    "id": "gxenbnk",
                                                    "parent_id": "t1_gxekvdy",
                                                    "score": 17,
                                                    "created_utc": 1620494595.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "They also made Itachi seem a ton more powerful because we had sasuke, who we all felt was pretty damn strong, which is always in fear of Itachi. Then when they finally meet, as expected, Itachi destroys him. Overall Itachi was arguably the big scary guy in pre skip Naruto",
                                    "author": "Metalona",
                                    "id": "gxe208o",
                                    "parent_id": "t1_gxdsi1p",
                                    "score": 47,
                                    "created_utc": 1620483933.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. Orochimaru was scary, but itachi was more scary. The cold calculated genius psycho killer",
                                            "author": null,
                                            "id": "gxe2hw7",
                                            "parent_id": "t1_gxe208o",
                                            "score": 31,
                                            "created_utc": 1620484197.0,
                                            "replies": [
                                                {
                                                    "body": "Orochimaru was afraid of Itachi which tells you everything you need to know about him. At the time he was introduced, Orochimaru had killed 2 Kage and traumatized an entire generation of kids. Then when talking about Itachi he was like “Nah fuck that shit he’s way too strong. I’ll gladly take on two whole nations, but not this teenager with the eyes”",
                                                    "author": "SeductivePillowcase",
                                                    "id": "gxki0kg",
                                                    "parent_id": "t1_gxe2hw7",
                                                    "score": 7,
                                                    "created_utc": 1620617029.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Also he fucking destroyed Kakashi, who we all saw as unbeatable up to this point.",
                                            "author": "ItzDrSeuss",
                                            "id": "gxe7x5d",
                                            "parent_id": "t1_gxe208o",
                                            "score": 30,
                                            "created_utc": 1620487031.0,
                                            "replies": [
                                                {
                                                    "body": "He didn't even seem to be trying against the lead Jonin. And the idea was that this was just the beginning. We thought the other Akatsuki members would be just as strong, but only Pain was really even close.",
                                                    "author": "Harden-Soul",
                                                    "id": "gxel5jc",
                                                    "parent_id": "t1_gxe7x5d",
                                                    "score": 13,
                                                    "created_utc": 1620493561.0,
                                                    "replies": [
                                                        {
                                                            "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
                                                            "author": "ItzDrSeuss",
                                                            "id": "gxevnld",
                                                            "parent_id": "t1_gxel5jc",
                                                            "score": 9,
                                                            "created_utc": 1620498635.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
                                                            "author": "SeductivePillowcase",
                                                            "id": "gxkjan1",
                                                            "parent_id": "t1_gxel5jc",
                                                            "score": 1,
                                                            "created_utc": 1620617837.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Suigetsu may not be as strong as Orochimaru, but he’s still strong AF. Dealing with genin like Boruto’s friends is never going to a problem for someone of his level. He’s the same level as Karin or higher and she easily outplayed multiple Jonins like Yamato and the others observing the site and Muggi.",
                            "author": "Supernova-581",
                            "id": "gxdsf9c",
                            "parent_id": "t1_gxds2m9",
                            "score": 45,
                            "created_utc": 1620478348.0,
                            "replies": [
                                {
                                    "body": "People underappreciated suigetsu’s strength, the man tanked a bijuudama and recovered after maybe a week or two",
                                    "author": "isaaceyfish",
                                    "id": "gxdzgfp",
                                    "parent_id": "t1_gxdsf9c",
                                    "score": 40,
                                    "created_utc": 1620482555.0,
                                    "replies": [
                                        {
                                            "body": "The man was boxing with the Hachibii.",
                                            "author": null,
                                            "id": "gxekrgz",
                                            "parent_id": "t1_gxdzgfp",
                                            "score": 9,
                                            "created_utc": 1620493375.0,
                                            "replies": [
                                                {
                                                    "body": "Straight facts, not to mention barely anything works on him because he’s made of water",
                                                    "author": "isaaceyfish",
                                                    "id": "gxem3t7",
                                                    "parent_id": "t1_gxekrgz",
                                                    "score": 8,
                                                    "created_utc": 1620494021.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Saw some vid about how Orochimaru should have remained the big bad guy throughout the series, and although they would have needed some amazing writing to pull off, I think it would have made for a stronger series and satysfying end.\n\nTsunade dead, Jiraiya dead, it would have been great for Team 7 to defeat the last legendary sannin as an official new beginning to their Ninja world.",
                    "author": "i_Got_Rocks",
                    "id": "gxeptrt",
                    "parent_id": "t1_gxdnkz1",
                    "score": 9,
                    "created_utc": 1620495813.0,
                    "replies": [
                        {
                            "body": "Considering Orochimaru's ability to body swap, they could have come up with a less powerful being than a god, and he could have taken their body.",
                            "author": "Ziggy_the_third",
                            "id": "gxet2fl",
                            "parent_id": "t1_gxeptrt",
                            "score": 4,
                            "created_utc": 1620497393.0,
                            "replies": [
                                {
                                    "body": "Imagine the fucking mindgames he could have played, kicking the shit out of the people Naruto cares about while wearing the stolen faces of his dead loved ones. \n\nThat would have been absolutely brutal.",
                                    "author": "HollyTheMage",
                                    "id": "gxkd08r",
                                    "parent_id": "t1_gxet2fl",
                                    "score": 3,
                                    "created_utc": 1620614011.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To add to what everyone else is saying I actually prefer the skip.\n\nWe know itachi was going blind for a long time and even with the frailty he had he was still op. Imagine if he had unlocked the renagan in his eye like sasuke would after transplanting his eyes. Itachi would have no doubt been other worldly. I also suspect he let sasuke defeat him to push him to his peak. Itachi made use of like no jitsu even though we know the sharingan can let uchiha copy jitsu and create or use jitsu not available to those who do not have the eye(s) (chidori) \n\nI like him in both. \n\nOrochimaru though they did dirty and boruto makes him even more pathetic. The man killed kage and was even seen by the akatsuki as a threat years after him leaving",
                    "author": "GoodboyGotter",
                    "id": "gxecrf2",
                    "parent_id": "t1_gxdnkz1",
                    "score": 7,
                    "created_utc": 1620489438.0,
                    "replies": [
                        {
                            "body": "What do u mean u suspect he let sasuke defeat him to push him to his peak? That’s literally what happened in the story.",
                            "author": "Smitten130",
                            "id": "gxenu72",
                            "parent_id": "t1_gxecrf2",
                            "score": 3,
                            "created_utc": 1620494845.0,
                            "replies": [
                                {
                                    "body": "Well I have an alternate head cannon theory that in the event sasuke didn't live up to itachi's expectations or died during their fight then that would only leave itachi with the option of taking his eyes.\n\nLike imagine if sasuke died so many times what was itachi going to do? Just go blind? Fight obito? \n\nIt's not clear but if itachi's plan had failed at even a single part then his only option would be to take sasuke's  eyes and finish the akatsuki arc himself. Sasuke died to zabuza? Tough fucking luck.\n\nI suppose he could have used the eye he confiscated from shitsuge or whatever his name was but I don't think it would have helped much.",
                                    "author": "GoodboyGotter",
                                    "id": "gxeqjn5",
                                    "parent_id": "t1_gxenu72",
                                    "score": 3,
                                    "created_utc": 1620496169.0,
                                    "replies": [
                                        {
                                            "body": "Hmm, interesting! I’ve always thought that itachi was already on the verge of death and wanted sasuke to kill him for personal growth.",
                                            "author": "Smitten130",
                                            "id": "gxeqxjq",
                                            "parent_id": "t1_gxeqjn5",
                                            "score": 2,
                                            "created_utc": 1620496351.0,
                                            "replies": [
                                                {
                                                    "body": "He was quite frail but still powerful.\n\nMy head canon \"what if?\" Is trying to explain what the fuck itachi plans to do if sasuke died. It really changes everything. It's not like itachi was holding his hand after he left the village or protecting him. His entire plan when you think about it was \"sasuke tragedy, sasuke get strong, sasuke kill me get stronger,\" but what if sasuke just fucking died at any point? Like itachi would have to take his eyes and come up with a new plan and with greater urgency.",
                                                    "author": "GoodboyGotter",
                                                    "id": "gxerh6c",
                                                    "parent_id": "t1_gxeqxjq",
                                                    "score": 2,
                                                    "created_utc": 1620496613.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You're saying his OP, prefacing it with he's going blind--and despite us knowing he is literally dying. He is literally a glass cannon. He is literally a balanced power character.\n\nThis is the kind of balancing more characters needed. Naruto and Sasuke being the most OP in the bunch, being able to just learn Jutsu on the fly like no one's business.",
                            "author": "i_Got_Rocks",
                            "id": "gxeq2kn",
                            "parent_id": "t1_gxecrf2",
                            "score": 1,
                            "created_utc": 1620495935.0,
                            "replies": [
                                {
                                    "body": "Yeah that's why I like arc 2 itachi better than one. More depth.\n\nI only enjoy borutos generation for Saradas potential and the fear/knowledge she might have to take her father's eyes to peak power but with it tragedy. Unfortunately the writer is more concerned with some karma mark garbage and just making the entire previous lore stupid and unimportant",
                                    "author": "GoodboyGotter",
                                    "id": "gxeqxv6",
                                    "parent_id": "t1_gxeq2kn",
                                    "score": 1,
                                    "created_utc": 1620496355.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah itachi was so mysterious and scary back then. Youd really think he did kill every uchiha with ill intent.",
                    "author": "bohenian12",
                    "id": "gxeom4b",
                    "parent_id": "t1_gxdnkz1",
                    "score": 2,
                    "created_utc": 1620495223.0,
                    "replies": []
                },
                {
                    "body": "A lot of fans dropped off after the Chunnin exam arc because the manga went in a different direction and power creep started happening on a regular basis.",
                    "author": "DisneyPrincessDVorah",
                    "id": "gxgu00w",
                    "parent_id": "t1_gxdnkz1",
                    "score": 2,
                    "created_utc": 1620536441.0,
                    "replies": []
                },
                {
                    "body": "So are we gonna talk about how Kisame drained all of Naruto's chakra with Samehada and then casually suggested cutting off his limbs so he wouldn't be able to run away from them or-",
                    "author": "HollyTheMage",
                    "id": "gxh4x7h",
                    "parent_id": "t1_gxdnkz1",
                    "score": 2,
                    "created_utc": 1620545191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remember being in middle school and being  terrified for sasuke bc of orochimaru setting his sights on him and planning to kidnap/manipulate him into coming to his lair and when the sound 5 told sasuke that he had no option but to go to orochimaru bc if  his curse mark was not treated by orochimaru, it would slowly destroy sasuke's body, it confirmed my fears that one way or another sasuke would end up at orochimaru's side no matter how hard naruto tried to stop him\n\nAnd after the timeskip i was afraid that when we'd next see sasuke he'd be a completely brainwashed evil version of his former self with no hopes of return, which is why his epic betrayal and revelation that not only sasuke never intended to let orochimaru have his body, but also was disgusted with orochimaru and was secretly planning and waiting to bring him down over the years was so SATISFYING and made me see sasuke in a completely new light as someone who could be extremely cold and dangerous when he wanted to be",
            "author": "crossing--animals",
            "id": "gxdqhc7",
            "parent_id": "t3_n7n3fy",
            "score": 157,
            "created_utc": 1620477032.0,
            "replies": [
                {
                    "body": "Yeah like his creepy fixation on sasuke and the way he used to talk to and about his targets was bad enough but the fact that we knew that he loved to experiment on bodies of kids and had similar intentions towards sasuke (aside from taking his body) was what truly was scary about him especially when it all seemed to be coming true by the ending of part 1\n\nAnd almost everything about sasuke during the beginning of shippuden was pleasantly surprising. The fact that even after spending 3 years with orochimaru his morals hadn't changed and he refused to kill people unless extremely necessary. The fact that his personality was almost the same as part 1 or at least more stable than how it was during his rooftop fight with naruto. The fact that he freed all of orochimaru's prisoners when he had no obligation to do that. The fact that he had an explicit no kill policy not only for himself but for his teammates as well. I liked it alot",
                    "author": "floral-dawns",
                    "id": "gxdwtbd",
                    "parent_id": "t1_gxdqhc7",
                    "score": 48,
                    "created_utc": 1620481064.0,
                    "replies": [
                        {
                            "body": "This! And just to piggy back, this exact feeling also helped make it feel even deeper/heavier when Sasuke began spiraling towards hatred more and more after \"beating\" Itachi and chasing down Danzou/meeting Naruto after he became a Sage. Karin specifically pointed out how dark and cold Sasuke was becoming too. That face when he stabbed thru her was chilling..",
                            "author": "CelticDK",
                            "id": "gxe52o9",
                            "parent_id": "t1_gxdwtbd",
                            "score": 18,
                            "created_utc": 1620485555.0,
                            "replies": [
                                {
                                    "body": "Follow up to that specific mention of Karin, the fact that Sasuke essentially discarded her after she had outlived her usefulness to him was especially disconcerting because I feel like it parallels the way Danzo would use and throw away his subordinates or really anyone in order to accomplish his goals. \n\nAlso Karin's fucked up backstory makes that scene so much more heartbreaking in retrospect.",
                                    "author": "HollyTheMage",
                                    "id": "gxh2n4g",
                                    "parent_id": "t1_gxe52o9",
                                    "score": 1,
                                    "created_utc": 1620543160.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, almost none of them were even *trying* to be scary. Orochimaru is unique because he in all of his fights (in part one at least) he got in the heads of everyone he fought. No other villain was playing that type of psychological warfare. In battle, the villains were all very straight-forward with their methods. The closest was Zabuza with how he made Sasuke nearly kill himself in fear, and that is very artificial way of doing so, it doesn't translate Sasuke's fear to the viewers like Orochimaru's methods did.",
            "author": "LarryTheLazyAss",
            "id": "gxdszsv",
            "parent_id": "t3_n7n3fy",
            "score": 82,
            "created_utc": 1620478730.0,
            "replies": [
                {
                    "body": "Also he was plain evil. He wasn't doing anything for some big cause. He just wanted to be immortal so was less likely to fall to any speeches. He also experimented on human bodies which i dobtf think any other naruto villain came close to do",
                    "author": "floral-dawns",
                    "id": "gxdz3cm",
                    "parent_id": "t1_gxdszsv",
                    "score": 38,
                    "created_utc": 1620482354.0,
                    "replies": [
                        {
                            "body": "This is what makes him so menacing really. He doesn’t have some grandiose vision for the world. He just wants immortality and  perfection for himself and himself alone. It makes him all the more scary because he isn’t bound by any ideology or code",
                            "author": "Calidore_X",
                            "id": "gxe0x8p",
                            "parent_id": "t1_gxdz3cm",
                            "score": 30,
                            "created_utc": 1620483350.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Someone needs to say this: Part of the reason Orochimaru was frightening was because of his *sick* music theme.",
            "author": "Silent_Sparrow02",
            "id": "gxdu57f",
            "parent_id": "t3_n7n3fy",
            "score": 148,
            "created_utc": 1620479460.0,
            "replies": [
                {
                    "body": "Oh absolutely. orochimaru's main theme and that one unreleaed ost truly hammered down the scariness and creepyness of all the scenes involving him.",
                    "author": "floral-dawns",
                    "id": "gxdyeqz",
                    "parent_id": "t1_gxdu57f",
                    "score": 46,
                    "created_utc": 1620481980.0,
                    "replies": [
                        {
                            "body": "What made the early arcs awesome was that there was stuff going on--the chuunin exams--and there was world crap going on, Orochimaru and other nations with different goals.\n\nIt made the world feel so big and real. As the series goes on, it becomes more and more about Naruto. It doesn't feel like a big world anymore, it feels like a Naruto world. And the story suffers because of it.",
                            "author": "i_Got_Rocks",
                            "id": "gxesh5g",
                            "parent_id": "t1_gxdyeqz",
                            "score": 9,
                            "created_utc": 1620497105.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Fucker just wouldn’t die, and he taught Hiruzen a thing or two about dying and *then living again*",
                    "author": "Kryllllllyx",
                    "id": "gxe0npj",
                    "parent_id": "t1_gxdu57f",
                    "score": 19,
                    "created_utc": 1620483209.0,
                    "replies": [
                        {
                            "body": "Jesus, Voldemort, Orochimaru. \n\nBack to life gang.",
                            "author": "brobronn17",
                            "id": "gxe4uh0",
                            "parent_id": "t1_gxe0npj",
                            "score": 18,
                            "created_utc": 1620485437.0,
                            "replies": [
                                {
                                    "body": "Voldemort and Orochimaru have so many similarities that it's uncanny. Both snakey sneks, both obsessed with immortality, both passed up for a position they felt they deserved by their mentor, who they then tried to kill.",
                                    "author": "WanderingToTheEnd",
                                    "id": "gxejf5a",
                                    "parent_id": "t1_gxe4uh0",
                                    "score": 10,
                                    "created_utc": 1620492718.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, makes me wonder if it's some kind of a biblical archetype. I wasn't raised with religion but sometimes I notice these similarities and wish I knew a bit more about the bible and stuff so I could be like \"Aha! That's a Cain and Abel reference!!\" I mean I guess the snake itself is a biblical reference and the idea that knowledge can corrupt?",
                                            "author": "brobronn17",
                                            "id": "gxeuxrp",
                                            "parent_id": "t1_gxejf5a",
                                            "score": 3,
                                            "created_utc": 1620498293.0,
                                            "replies": [
                                                {
                                                    "body": "It is, but in Orochimaru's case I think he's primarily based off of a Japanese myth involving a snake.",
                                                    "author": "WanderingToTheEnd",
                                                    "id": "gxewufd",
                                                    "parent_id": "t1_gxeuxrp",
                                                    "score": 2,
                                                    "created_utc": 1620499213.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
                                                            "author": "brobronn17",
                                                            "id": "gxextdv",
                                                            "parent_id": "t1_gxewufd",
                                                            "score": 3,
                                                            "created_utc": 1620499694.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                                                                    "author": "HollyTheMage",
                                                                    "id": "gxh387f",
                                                                    "parent_id": "t1_gxextdv",
                                                                    "score": 3,
                                                                    "created_utc": 1620543675.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">both passed up for a position they felt they deserved by their mentor, who they then tried to kill.\n\nTbf Voldemort only wanted the role some could be closer to control the Basilisk, pick on half bloods and muggleborns and recruit bigoted purebloods to his cause",
                                            "author": "KingofTrollenheim",
                                            "id": "gxi78zm",
                                            "parent_id": "t1_gxejf5a",
                                            "score": 1,
                                            "created_utc": 1620573878.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "NeverDieGangGang",
                                    "author": "i_Got_Rocks",
                                    "id": "gxesiw4",
                                    "parent_id": "t1_gxe4uh0",
                                    "score": 1,
                                    "created_utc": 1620497128.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "God his theme is the best.",
                    "author": "SPS_Agent",
                    "id": "gxe3rd5",
                    "parent_id": "t1_gxdu57f",
                    "score": 6,
                    "created_utc": 1620484867.0,
                    "replies": []
                },
                {
                    "body": "It's all fun and games until the organ starts playing",
                    "author": "Tsynami",
                    "id": "gxe4oer",
                    "parent_id": "t1_gxdu57f",
                    "score": 6,
                    "created_utc": 1620485351.0,
                    "replies": [
                        {
                            "body": "Lmao yes",
                            "author": "Silent_Sparrow02",
                            "id": "gxe5owo",
                            "parent_id": "t1_gxe4oer",
                            "score": 3,
                            "created_utc": 1620485878.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "*ominous hindi chanting over cathedral organ music intensifies*",
                    "author": null,
                    "id": "gxekyim",
                    "parent_id": "t1_gxdu57f",
                    "score": 2,
                    "created_utc": 1620493469.0,
                    "replies": []
                },
                {
                    "body": "Fucking seriously. Going back and listening to it now is still horribly unsettling.",
                    "author": "Laphing_Drunk",
                    "id": "gxespyr",
                    "parent_id": "t1_gxdu57f",
                    "score": 2,
                    "created_utc": 1620497223.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think Pain as a character was less scary, but no character made it seem hopeless to fight them like Pain did. He was just so far ahead of every other villain they had fought up to that point. Jiraiya sensei  even died fighting to him, and he was an incredibly powerful sannin, second to only the kage themselves. No other character made you feel as much dread as Pain. The second he destroyed the Hidden Leaf Village he showed just how incredibly vast his power was. Even in death Pain was above everyone they had fought to that point, as he almost killed Naruto and Killer Bee instantly after being reincarnated. Kaguya was leagues ahead of Pain, but not so far ahead of Naruto and Sasuke that fighting seemed hopeless. The feeling of hopelessness that Pain created on screen when he fought, is something I find far more terrifying than body stealing ninjustu Micheal Jackson.",
            "author": "NoobyOverlord",
            "id": "gxdzpm4",
            "parent_id": "t3_n7n3fy",
            "score": 61,
            "created_utc": 1620482695.0,
            "replies": [
                {
                    "body": "I think the soundtracks really make it better Pains theme is incredible which adds to the unknown amounts of power he had.",
                    "author": "MoldyToblerone",
                    "id": "gxenhom",
                    "parent_id": "t1_gxdzpm4",
                    "score": 10,
                    "created_utc": 1620494676.0,
                    "replies": []
                },
                {
                    "body": "\"Body Stealing Ninjutsu Michael Jackson\", lol",
                    "author": "vokul_vokundova",
                    "id": "gxh5l5s",
                    "parent_id": "t1_gxdzpm4",
                    "score": 2,
                    "created_utc": 1620545796.0,
                    "replies": []
                },
                {
                    "body": "His view and monologues were powerful: Everyone will feel...pain.\n\nHe doesn't want to unify the world in love and peace, but in pain. It's an interesting take on a villain trying to do the \"right\" thing according to their life experience.",
                    "author": "i_Got_Rocks",
                    "id": "gxess7y",
                    "parent_id": "t1_gxdzpm4",
                    "score": 1,
                    "created_utc": 1620497254.0,
                    "replies": [
                        {
                            "body": "One of my reactions to stressful situations is to use humor as a coping mechanism, so when Pain said the line \"this world shall know pain\" I just said \"lmao kinky\" and then watched in abject horror as he fucking obliterated the entire village.",
                            "author": "HollyTheMage",
                            "id": "gxh2vdq",
                            "parent_id": "t1_gxess7y",
                            "score": 1,
                            "created_utc": 1620543362.0,
                            "replies": [
                                {
                                    "body": "*Everyone dying around you*\n\nPAIN: ...know...Pain. *Akatsuki theme song start*\n\n/u/HollyTheMage : Oh, yeashhhh, Daddy, stomp. ON. MEH!\n\n*Akatsuki theme song goes \"Ouu-ah, oouu-ah\"*\n\n/u/HollyTheMage : YES! YES!!\n\n*Village civilians start to die. Ramen Noodles holding his dead wife in his arms.*\n\n/u/HollyTheMage : OH, no, not like that. No. What is this?! DO SOMETHING SOMEONE! *hunches over on the ground* NARUTOOOOOOOOOOO!",
                                    "author": "i_Got_Rocks",
                                    "id": "gxhy64i",
                                    "parent_id": "t1_gxh2vdq",
                                    "score": 2,
                                    "created_utc": 1620569214.0,
                                    "replies": [
                                        {
                                            "body": "Bold of you to assume I would be in the right state of mind to even scream for help.\n\nActually if I keep it up with the obnoxious innuendos maybe the Six Paths will get annoyed with me and start targeting me specifically rather than attacking civilians at random. Hopefully I'll be able to distract them just long enough for some of the non-combatants in the area to be evacuated to the bunkers hidden in the Hokage mountain.\n\nShit, I could probably come up with a comedy routine for each of the Six Paths. For the Animal Path, it will be Pokemon jokes. For the Asura Path, it will be Metal Gear memes. If the Naraka Path pulls out the King of Hell, you can be sure I'll be making Doom Eternal and Devil May Cry references. For the Preta Path, I might humorously refer to them as Dazai Osamu from Bungou Stray Dogs. If the Human Path tries to rip my soul out I'll start singing one of the opening themes of Fullmetal Alchemist as loudly and horribly as I possibly can.\n\nThey probably won't understand any of my references, but my reactions would be unpredictable enough to throw them off their rhythm. All the time they spend bothering to try and parse out some semblance of meaning from my bullshit in order to formulate a more effective argument against my worldviews once it comes time for Pain to lecture me is time they could have otherwise spent murdering innocent people.\n\nEventually they'll get tired of trying to kill me and just send the main Pain over to deal with my shit.\n\nWatch me get pinned down to the ground with a bunch of rods impaled through my limbs like Naruto but every time Pain starts monologuing I just keep interrupting him to make penetration and bondage jokes related to the current situation I am in at the moment. Hell, I'll probably get my head smashed in, but if it buys a little more time for reinforcements to arrive and help evacuate the wounded from ground zero, so be it. \n\nI'm so goddamn obnoxious that most of the village probably wouldn't mind seeing me wiped off the face of the earth, so I won't have to worry about anyone needlessly sacrificing themselves in a suicide mission to save my worthless ass, only to have their memory insulted when I react by making a vine reference to cope with the trauma of witnessing their death.\n\nEventually Pain calls Konan over to try and talk to me because nothing else is working.\n\nIt goes about as well as you'd expect.\n\nNobody:\n\nNot even Danzo:\n\nMe: [https://youtu.be/-sMQpWCNTQw](https://youtu.be/-sMQpWCNTQw)",
                                            "author": "HollyTheMage",
                                            "id": "gxjh17g",
                                            "parent_id": "t1_gxhy64i",
                                            "score": 2,
                                            "created_utc": 1620596218.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously, Shiore Orochimaru was scary AF.",
            "author": null,
            "id": "gxdlrle",
            "parent_id": "t3_n7n3fy",
            "score": 23,
            "created_utc": 1620473496.0,
            "replies": []
        },
        {
            "body": "Even more than himself, I dreaded his theme music. I can't listen to the theme music without being scared.\n\nShows how good the theme was. A masterpiece.",
            "author": "robinhood8022",
            "id": "gxduqk2",
            "parent_id": "t3_n7n3fy",
            "score": 23,
            "created_utc": 1620479824.0,
            "replies": [
                {
                    "body": "His theme is epiccc. Quality bossfight music.",
                    "author": "brobronn17",
                    "id": "gxe56r6",
                    "parent_id": "t1_gxduqk2",
                    "score": 12,
                    "created_utc": 1620485615.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would’ve smashed if he was a girl not even gonna lie",
            "author": "Za106",
            "id": "gxdx88j",
            "parent_id": "t3_n7n3fy",
            "score": 16,
            "created_utc": 1620481305.0,
            "replies": [
                {
                    "body": "...",
                    "author": "FeelingPrettyChill",
                    "id": "gxef9zj",
                    "parent_id": "t1_gxdx88j",
                    "score": 3,
                    "created_utc": 1620490668.0,
                    "replies": [
                        {
                            "body": "I get where he's coming from that tongue game would *crazy*",
                            "author": "whitey-ofwgkta",
                            "id": "gxeot11",
                            "parent_id": "t1_gxef9zj",
                            "score": 9,
                            "created_utc": 1620495316.0,
                            "replies": [
                                {
                                    "body": "Someone understands 😏🤦🏾‍♂️😂😂",
                                    "author": "Za106",
                                    "id": "gxfbfjz",
                                    "parent_id": "t1_gxeot11",
                                    "score": 4,
                                    "created_utc": 1620506579.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What? I’m deadass 😩😩",
                            "author": "Za106",
                            "id": "gxej6up",
                            "parent_id": "t1_gxef9zj",
                            "score": 6,
                            "created_utc": 1620492606.0,
                            "replies": [
                                {
                                    "body": "ok then",
                                    "author": "FeelingPrettyChill",
                                    "id": "gxej93l",
                                    "parent_id": "t1_gxej6up",
                                    "score": 3,
                                    "created_utc": 1620492636.0,
                                    "replies": [
                                        {
                                            "body": "😂😂",
                                            "author": "Za106",
                                            "id": "gxek9re",
                                            "parent_id": "t1_gxej93l",
                                            "score": 1,
                                            "created_utc": 1620493134.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used to get nightmares of Voldemort chasing me. Orochimaru comes a close second though.",
            "author": "lipstickspoiler",
            "id": "gxdsfj1",
            "parent_id": "t3_n7n3fy",
            "score": 14,
            "created_utc": 1620478354.0,
            "replies": []
        },
        {
            "body": "Part I Orochimaru was a fantastic villain. Early Shippuden Orochimaru was meh but he becomes completely nonsensical after Sasuke resurrects him.",
            "author": "TyrionGoldenLion",
            "id": "gxdq424",
            "parent_id": "t3_n7n3fy",
            "score": 21,
            "created_utc": 1620476769.0,
            "replies": [
                {
                    "body": "He just got bored and decided to watch someone else fuck shit up instead.",
                    "author": "HollyTheMage",
                    "id": "gxkd45z",
                    "parent_id": "t1_gxdq424",
                    "score": 1,
                    "created_utc": 1620614075.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And now he’s a mother",
            "author": "smyth101-",
            "id": "gxe2ca1",
            "parent_id": "t3_n7n3fy",
            "score": 11,
            "created_utc": 1620484114.0,
            "replies": [
                {
                    "body": "Luffy's mother was never Crocodile.",
                    "author": "germanymodsarenazis",
                    "id": "gxebfq2",
                    "parent_id": "t1_gxe2ca1",
                    "score": 1,
                    "created_utc": 1620488795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I told my friend my fav villian was orochimaru he said Ew lol",
            "author": "Ays_500",
            "id": "gxdskko",
            "parent_id": "t3_n7n3fy",
            "score": 10,
            "created_utc": 1620478446.0,
            "replies": [
                {
                    "body": "Your friend has bad taste in villains 😤",
                    "author": "FeelingPrettyChill",
                    "id": "gxefc6h",
                    "parent_id": "t1_gxdskko",
                    "score": 5,
                    "created_utc": 1620490698.0,
                    "replies": [
                        {
                            "body": "Fuck yea. I was hurt like homie how could u say that to me XD",
                            "author": "Ays_500",
                            "id": "gxefyab",
                            "parent_id": "t1_gxefc6h",
                            "score": 5,
                            "created_utc": 1620490998.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Orochimaru was done so dirty, we never really see him fight full power all out",
            "author": "LazyBriton",
            "id": "gxdui0u",
            "parent_id": "t3_n7n3fy",
            "score": 12,
            "created_utc": 1620479679.0,
            "replies": [
                {
                    "body": "Right?\n\nHe might actually be able to claim he is the best candidate for kage. The dude just cannot be defeated in his prime and if he never body switched he would have been able to learn snake sage.",
                    "author": "GoodboyGotter",
                    "id": "gxedgdn",
                    "parent_id": "t1_gxdui0u",
                    "score": 4,
                    "created_utc": 1620489775.0,
                    "replies": [
                        {
                            "body": "Well idk about that, Itachi wrecked prime Orochimaru at like 13, and I don’t think Orochimaru could beat Minato either but he’d definitely be a beast",
                            "author": "LazyBriton",
                            "id": "gxegq7z",
                            "parent_id": "t1_gxedgdn",
                            "score": 5,
                            "created_utc": 1620491383.0,
                            "replies": [
                                {
                                    "body": "Itachi could have probably beat any of the akatsuki except maybe--MAYBE--nagato though. He is a league of his own. His genjitsu is so powerful it can warp reality and he could kill his entire clan which not even the first 2 kage or other clans seemed competent enough to accomplish with the entire history of the uchiha. \n\nHe is much in a league of his own and we never see madara or obito even flex such a level of mastery over the sharingan with all their power and skill. \n\nSo itachi is in a league uniquely of his own and his friend he took the eye of and put in a bird. \n\nOrochimaru though is probably equal to or stronger than Jariayah at his peak and if he didn't body swap he could have learned snake sage which Mitsuki has already shown to be op and somewhat mysterious in how it works relative to say toad sage form. I would even put peak orochimaru wit sage form higher than kakashi theoretically. Something that was little explored was all the forbidden and new jitsu, novel or forbidden, orochimaru invented or discovered. A better writer would have flexed his strengths like in part 1. Instead we get orochimaru the cripple bitch who dies in 2 and orochimaru the dude who does nothing in Boruto",
                                    "author": "GoodboyGotter",
                                    "id": "gxeifna",
                                    "parent_id": "t1_gxegq7z",
                                    "score": 1,
                                    "created_utc": 1620492232.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That white skin, transgender voice (because he took over a female body), casually reviving the most powerful characters like Jesus... \n\nDon't forget about Itachi on the roof after murdering his whole clan (before Kishimoto changed the story to make him the good guy)",
            "author": "germanymodsarenazis",
            "id": "gxebcap",
            "parent_id": "t3_n7n3fy",
            "score": 5,
            "created_utc": 1620488748.0,
            "replies": []
        },
        {
            "body": "Still to this day even when I rewatch this it scares the crap out of me",
            "author": "Ddog10132",
            "id": "gxdvadh",
            "parent_id": "t3_n7n3fy",
            "score": 6,
            "created_utc": 1620480160.0,
            "replies": []
        },
        {
            "body": "I'm still sad Orochimaru played such a small role in Shippuden. When he first showed up he really felt like THE big bad who we would spend the entire series trying to stop, but then halfway through it became all about the Akatsuki, then Sasuke just fucking murdered him, then he got a redemption arc, it was just kinda sad honestly. Like I like to think occasionally of a happier ending where Kaguya doesn't exist and never gets brought up in the series and Orochimaru is the one to take over Madari's powers somehow to be the final boss.",
            "author": "Sasukuto",
            "id": "gxdvy3q",
            "parent_id": "t3_n7n3fy",
            "score": 8,
            "created_utc": 1620480560.0,
            "replies": [
                {
                    "body": "> Kaguya \n\nThink of how interesting it would been for Orochimaru subplot--he keeps \"helping\" the good guys, knowing it will lead, eventually to Kaguya being revealed. Knowing damn well Naruto will save everyone. \n\nAnd his entire scheme, we see it play out, and even other characters are suspicious of him--but they leave him alone because he is helping them defeat Pain and others--but then, when Kaguya is revealed, he reveals a new forbidden jutsu where he absorbs Kaguya, forcing her inside of himself like another one of the tailed beasts. He escapes, the Ninja world rebuilds.\n\nThe final arc focuses on what Orochimaru is doing with such power--and how he's using it, not to take over the world, but on taking down individual ninja and stealing their abilities--and yes, this time, he actually kills them. No \"sealing\" or burying, or borrowing their bodies, no nonsense.\n\nPart of his new jutsu requires him to kill and drain life force and chakra in order to survive. This leads to the final 10 or so episodes that could be summed up in a movie later, with better animation budget as a re-release finale a year or so later.\n\nBut in the finale, more ninja die--and it's what forces people to seek the peaceful world Naruto dreams about since day 1. They defeat Orochimaru (or Naruto defeats him, basically) by reaching inside of him, in the same way Sasuke was able to go inside Naruto's mind in early Shippuden and see Kurama. Or maybe, Sasuke teams up with Naruto to show him this technique. Forcing Team 7 to lead the remaining Ninja on a large scale attack against Orochimaru and Kaguya. \n\nThey realize the only way to defeat Orochimaru is to seal up Kaguya. This will lead to a big sacrifice from a lot of Ninja, and we will even lose some Gaaras and big Hokage names. Naruto loses his arm here. They seal up Kaguya deep inside Orochimaru's mind and he cannot access this power anymore. Then, they're able to seal him up. And to be sure, they seal the seal that seals him up further--making sure this isn't a returning villain (it's the end of the series).\n\nAt the end of it, Naruto tells Sasuke he must pay for his crimes against the Ninja world. Sasuke excuse himself by saying he was just another Ninja doing cruel things. Naruto doesn't buy it, proclaims he'll make sure Sasuke pays--it's the only way to redeem him. Sakura, no longer a useless muppet, yells at Sasuke telling him that despite her love for him--she cannot forgive him. And it's because of her love, that she'll ensure he pays his debts for all the fallen lives he caused. Sasuke runs into the forest. Sakura yells super loud that he'll find redemption in prison or by her own hands, tears in her eyes. Naruto looks as a weakened Sasuke runs away; remembering his promise to Itachi, Naruto whispers, \"Sasuke...I'll always love you,\" mirroring Itachi's last words and shipping that hot-hot yaoi relationship some fans can't get enough of (Sorry, Sakura, this is not a war you can win--we gotta sell some merch).\n\nThis is where we end the series. Lives have paid for a better future. Sasuke is no \"magically forgiven\" darling and Naruto is almost ready to become Hokage. Despite being asked to be Hokage already, he must go and find his boyfriend, I mean, best friend before he can feel he has saved his village. To him, his boyfriend, I mean best friend, is his village.\n\nThere could be a theater film finale showing the final battle between Sasuke and Naruto/Sakura, but make it more about how they've grown. In the end, either Sasuke dies, because he still feels his clan was humiliated and destroyed for a village that didn't care about him. Well written, this could a strong film where Sasuke's rage and anger is justified--and Team Seven follows the path of the legendary Sannin, but rather than allow another Orochimaru to survive, Sakura and Naruto agree that they must take him down.\n\nEven though they kill him, they build a minor monument inside Konoha to honor his good deeds. An act that is controversial among Ninja and civilians in Konoha.\n\nSakura ain't got no kids by Sasuke. She has grown up. Naruto is one-armed for life. And the series ends. It ends. It's done. No Boruto kun bullshit.\n\n(Sorry, Sakura ^_^;;)",
                    "author": "i_Got_Rocks",
                    "id": "gxgda64",
                    "parent_id": "t1_gxdvy3q",
                    "score": 2,
                    "created_utc": 1620526687.0,
                    "replies": [
                        {
                            "body": "Damn, not bad. I'd watch this over the alternate universe story that played out during Tsunade's dream arc in the Infinite Tsukuyomi.",
                            "author": "HollyTheMage",
                            "id": "gxkeska",
                            "parent_id": "t1_gxgda64",
                            "score": 2,
                            "created_utc": 1620615063.0,
                            "replies": [
                                {
                                    "body": "There's so much potential for stories that were never told in Naruto because it focused too heavily on Naruto...gaining another tail or something.\n\nI have a story in mind where Sakura tests her might and goes to find Sasuke alone, when her training with Tsunade is finished, but Naruto is still training. \n\nLong story short: She manages to *almost* beat Sasuke and bring him back due to her advantage of good Chakra control and good wits. She manages to outwit almost every trick Sasuke tries because she realizes that her biggest weakness will be her love for him. And it's in this fight that she realizes Sasuke won't change, and she gives herself the worth she deserves and that life isn't about her--but about the village and all that mushy stuff that she never saw because of Sasuke.\n\nSakura foils so much of Sasuke's tactics so Sasuke leaves because Sakura is able to bluff she has stronger attacks, but in reality, she is drained and out of options. Sasuke is weakened and is not willing to risk it because his bigger goal is to destroy the Leaf village, but he is actually scared that Sakura might be even more powerful than she lets on.\n\nThere's a link between her fight and the training she does with Tsunade where Tsunade forces her to think and not just punch blast everything. The emotional weight of the fight is about Sakura overcoming her own childish love for a guy that isn't interested in redemption.\n\nThis would later resonate again when Sasuke leaves as Orochimaru escapes too. \n\nIn the final arc when they defeat Sasuke, Naruto buries his boyfriend, and Sakura buries a stranger--no longer in love with him, but grateful their paths crossed.  Naruto cries for Sasuke. Sakura cries for the end of a clan. Naruto tells her that of all the Ninja he knows, she is the only one that could stand a chance against him, solely by using her wits. She tells him she knows. Her role at the end, would probably be head of Ambu. Though she's a great medical Ninja, she doesn't want to heal allies when they're broken, she wants to prevent the tragedies from happening in the first place.",
                                    "author": "i_Got_Rocks",
                                    "id": "gxkh6zd",
                                    "parent_id": "t1_gxkeska",
                                    "score": 2,
                                    "created_utc": 1620616516.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still think naruto shippuden was the biggest fumble of a time slip we’ve every witnessed, totally different tone with close to zero training for random power boosts",
            "author": "OGchillidig",
            "id": "gxeokya",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620495208.0,
            "replies": []
        },
        {
            "body": "gaara did",
            "author": "onexy_",
            "id": "gxdskfq",
            "parent_id": "t3_n7n3fy",
            "score": 6,
            "created_utc": 1620478444.0,
            "replies": [
                {
                    "body": "I wasn't much scared with gaara bc he was still just a genin and until the revelation about him having a tailed best sealed within him it seemed like kakashi and guy could have easily taken him down especially since he was intimidated into backing down by gai twice already\n\nOrochimaru on the other hand was more craftier and clever than gaara and had managed to kill the 3rd hokage and was able to take on 2 sanins without 2 proper hands which made him more scarier",
                    "author": "floral-dawns",
                    "id": "gxdx4x3",
                    "parent_id": "t1_gxdskfq",
                    "score": 12,
                    "created_utc": 1620481252.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I still don’t understand what he did to people to put so much fear in them and make them stop in their tracks. It usually happened when they made eye contact and you’d hear their heartbeat. It happened to Sasuke, Naruto, & Kakashi from what I recall.",
            "author": "Vnecktrev09",
            "id": "gxdvmyv",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620480376.0,
            "replies": [
                {
                    "body": "They saw their deaths, even Kakashi was terrified",
                    "author": "FeelingPrettyChill",
                    "id": "gxefouw",
                    "parent_id": "t1_gxdvmyv",
                    "score": 2,
                    "created_utc": 1620490870.0,
                    "replies": [
                        {
                            "body": "Oh snap so they literally saw a vision of their death or simply that they felt the fear of death in that moment?",
                            "author": "Vnecktrev09",
                            "id": "gxeit4d",
                            "parent_id": "t1_gxefouw",
                            "score": 3,
                            "created_utc": 1620492417.0,
                            "replies": [
                                {
                                    "body": "The best depiction is in the Forest of Death when Sasuke and Sakura see themselves getting headshotted from a couple kunai and then Sasuke puked",
                                    "author": "whitey-ofwgkta",
                                    "id": "gxeparv",
                                    "parent_id": "t1_gxeit4d",
                                    "score": 3,
                                    "created_utc": 1620495556.0,
                                    "replies": []
                                },
                                {
                                    "body": "Both",
                                    "author": "FeelingPrettyChill",
                                    "id": "gxeizfh",
                                    "parent_id": "t1_gxeit4d",
                                    "score": 1,
                                    "created_utc": 1620492504.0,
                                    "replies": [
                                        {
                                            "body": "I just looked up Orochimaru’s “killer intent” and it’s hard to understand. I guess it’s just sort of a terrifying gengutsu or something.",
                                            "author": "Vnecktrev09",
                                            "id": "gxeoblw",
                                            "parent_id": "t1_gxeizfh",
                                            "score": 2,
                                            "created_utc": 1620495080.0,
                                            "replies": [
                                                {
                                                    "body": "Not even a genjutsu. It's just pure, lethal, killing intent. Its more of an anime trope than anything, just done incredibly effectively",
                                                    "author": "silverx2000",
                                                    "id": "gxeoymp",
                                                    "parent_id": "t1_gxeoblw",
                                                    "score": 3,
                                                    "created_utc": 1620495391.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "naruto version of orochimaru was creepy and dangerous \n\ngo on youtube search for orochimaru theme you will feel fear and chills down to your spine\n\nhere's link= [https://www.youtube.com/watch?v=ikmSfQmtq20](https://www.youtube.com/watch?v=ikmSfQmtq20)",
            "author": "yellowflash28",
            "id": "gxdw1ad",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620480611.0,
            "replies": []
        },
        {
            "body": "I was really scared those time.. Specially his theme was scary and thrilling. Sometimes I felt he's speaking nearby me!! though it was my eardrums my gosh",
            "author": null,
            "id": "gxdzovk",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620482684.0,
            "replies": []
        },
        {
            "body": "That scene really was the only time i was scared of anything in an anime lol, so good",
            "author": "futuresverse",
            "id": "gxe2iy8",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620484213.0,
            "replies": []
        },
        {
            "body": "Dude riiiight? And it was only exacerbated because at the time all we knew was Kakashi was this insane Jonin (which was the highest class) and he rekt Zabuza, then Orochimaru shows up and giggles at his chidori then makes Kakashi tremble and ask himself what he was thinking. Really was terrifying..\n\nI sometimes think back to how different that fight against Hiruzen coulda went. Even heavily subdued, Hashirama and Tobirama shouldve been close to unbeatable back then, luckily Minato couldnt be summoned, and like what would've happened if Orochimaru legit just fought Hiruzen? Instead of relying on the edo tensei? I think Orochimaru could've won one on one, but then again Hiruzen did have Enma too.",
            "author": "CelticDK",
            "id": "gxe4ksk",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620485299.0,
            "replies": []
        },
        {
            "body": "And then he got clapped by Itachi",
            "author": "Sonicmaster06",
            "id": "gxeavdt",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620488520.0,
            "replies": []
        },
        {
            "body": "Yeah back when he was intimidating.\n\nA legendary sanin, inventor of numerous jitsu, discoverer of the snake sages, practically immortal for no good reason, perfecter of the profane experimentation danzo could only dream of, collector of talent akin to the akatsuki model, former akatsuki member, so natorious and feared that even the akatsuki saw him as a threat despite not being able to perform jitsu, and overall menace to societies everywhere. Killer of kage and even with 2 retarded arms could not be defeated in combat by the other 2 Sanin. Not to mention defeating hanzo, assisting tsunade in the final war arc, having heavy connections to underground slave trade and markets, international connections and politicians, training sasuke, etc etc\n\nHe really should be no fucking joke but now he is a clown.",
            "author": "GoodboyGotter",
            "id": "gxebyhl",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620489046.0,
            "replies": []
        },
        {
            "body": "His music too, that ominous chanting aria, God it still gives me goosebumps. One of, if not THE best anime villain of all time in my humble opinion",
            "author": "aa821",
            "id": "gxeevog",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620490469.0,
            "replies": []
        },
        {
            "body": "I watch lots of horror movie, watch fuckedup  thing but when this seen apear I was creepout",
            "author": null,
            "id": "gxefz7y",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620491011.0,
            "replies": []
        },
        {
            "body": "Facts this dude was a monster",
            "author": "Grey-patterned-shirt",
            "id": "gxem47d",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620494027.0,
            "replies": []
        },
        {
            "body": "Curious, does Orochimaru’s genitalia change if he swaps bodies with a woman?",
            "author": "RazutoUchiha",
            "id": "gxet6l5",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620497450.0,
            "replies": [
                {
                    "body": "I’ve been wondering this too.",
                    "author": "FeelingPrettyChill",
                    "id": "gxhu31t",
                    "parent_id": "t1_gxet6l5",
                    "score": 2,
                    "created_utc": 1620566726.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i was shivering at every orochimaru scene in part one especially during the forest of death and after sakura and sasuke saw themselves fucking die",
            "author": "Predictionpogg",
            "id": "gxguxri",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620537061.0,
            "replies": []
        },
        {
            "body": "when he deep-throats the heaven scroll 😭😭😭",
            "author": "arcerath",
            "id": "gxgvvwa",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620537723.0,
            "replies": []
        },
        {
            "body": "Crazy how he went from creepy child molester giving out magic hickies to a loving mad scientist dad, all in the span of naruto to boruto",
            "author": "betweenboundary",
            "id": "gxgxt72",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620539169.0,
            "replies": []
        },
        {
            "body": "I was genuinly feeling watched, scared and uncomfortable in the first pics scene",
            "author": "LifelessBlame",
            "id": "gxh1ds2",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620542092.0,
            "replies": []
        },
        {
            "body": "Man his fucking tongue was scary as shit",
            "author": "death4life12",
            "id": "gxh37z1",
            "parent_id": "t3_n7n3fy",
            "score": 3,
            "created_utc": 1620543669.0,
            "replies": []
        },
        {
            "body": "The mans infiltrated the “best village” cursed Sasuke and killed Lord Third. \n\nUuh yueauh we were terrified lol",
            "author": "CheezGaming",
            "id": "gxe4ihx",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620485266.0,
            "replies": []
        },
        {
            "body": "Og villain",
            "author": null,
            "id": "gxe9zzg",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620488083.0,
            "replies": []
        },
        {
            "body": "I was always scared but I loved the music",
            "author": "cosmicZED",
            "id": "gxefe42",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620490725.0,
            "replies": []
        },
        {
            "body": "Bro when he turned into that girl I was so fucking confused the first time I watched it. I thought he was a girl the whole time and I was like, “daaam orochimaru bad af”",
            "author": "FatherSpike",
            "id": "gxefgge",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620490757.0,
            "replies": []
        },
        {
            "body": "Orochimaru was done so dirty in Shippuden but Orochimaru is still my favourite character and villain because he was just such a great villain in part 1.",
            "author": "FeelingPrettyChill",
            "id": "gxefh60",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620490767.0,
            "replies": []
        },
        {
            "body": "Cool but that’s not a meme",
            "author": "Golden_Nogger",
            "id": "gxey8tz",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620499907.0,
            "replies": []
        },
        {
            "body": "Orochimaru was down right creepy throughout Naruto. He become less creepy in shippudeen",
            "author": null,
            "id": "gxgpc6o",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620533664.0,
            "replies": []
        },
        {
            "body": "To add to what many people had already said here, Orochimaru just has that crazy creepy psychotic villain vibes. It's sad that he was sidelined as a plot device.\n\nSure the succeeding main villains are more powerful and fleshed out better, but they don't feel as menacing and dangerous.",
            "author": "LardHop",
            "id": "gxh4vq0",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620545151.0,
            "replies": []
        },
        {
            "body": "For people who don't understand the feeling this post is talking about take a moment. Now imagine you're in a dark alleyway. Out of Pain, Madara and Orochimaru who would you rather bump into? Madara and Pain might kill you sure but Orochimaru has far worse things in store. Personally I'd rather facetank a Susanoo hit or an Almighty push that be experiemented on untill my body melts.",
            "author": "Admaril",
            "id": "gxjik1f",
            "parent_id": "t3_n7n3fy",
            "score": 2,
            "created_utc": 1620596985.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gxdp3lh",
            "parent_id": "t3_n7n3fy",
            "score": -22,
            "created_utc": 1620476046.0,
            "replies": [
                {
                    "body": "Orochimaru took down the third Hokage. That and Tsunade gave him a beating and he looked like he barely felt much from it.\n\nHow is he \"not much of a threat\" ?",
                    "author": null,
                    "id": "gxdsvv3",
                    "parent_id": "t1_gxdp3lh",
                    "score": 12,
                    "created_utc": 1620478657.0,
                    "replies": []
                },
                {
                    "body": "Did.............. did you just say Boruto is better than.......... aight imma head out",
                    "author": "howabout24",
                    "id": "gxdqj38",
                    "parent_id": "t1_gxdp3lh",
                    "score": 4,
                    "created_utc": 1620477066.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gxdvbzj",
                            "parent_id": "t1_gxdqj38",
                            "score": 9,
                            "created_utc": 1620480186.0,
                            "replies": [
                                {
                                    "body": "Oof I suppose my brain just inserted an as. I can feel my reading comprehension falling",
                                    "author": "howabout24",
                                    "id": "gxdvf8x",
                                    "parent_id": "t1_gxdvbzj",
                                    "score": 2,
                                    "created_utc": 1620480243.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gxdvm1j",
                                            "parent_id": "t1_gxdvf8x",
                                            "score": 1,
                                            "created_utc": 1620480360.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The strangest thing is that he kept clothes from that girl over all these years.\n\nLike get it together Orochimaru, find some better clothes!",
            "author": "Anonim97",
            "id": "gxea885",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620488197.0,
            "replies": []
        },
        {
            "body": "orochiMAMA",
            "author": "Killmonger3012",
            "id": "gxee8me",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620490158.0,
            "replies": []
        },
        {
            "body": "I was thinking this recently and realised what is a big part of the reason why, its simply because I was a lot younger then than I was compared to when shippuden came about.",
            "author": "eNiminator",
            "id": "gxeg0oc",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620491031.0,
            "replies": []
        },
        {
            "body": "Took me years to finally understand that Kishi introduced a trans main character before we even ready for it.",
            "author": "drupe14",
            "id": "gxesxuw",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620497331.0,
            "replies": []
        },
        {
            "body": "Madara and Pain would like to have a word with you",
            "author": "MatchuPichu",
            "id": "gxetp59",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620497704.0,
            "replies": []
        },
        {
            "body": "Could never be me😐😑😐🤭💨",
            "author": "XlowscoutsX",
            "id": "gxgpd3r",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620533678.0,
            "replies": []
        },
        {
            "body": "He kinda look like roswaal",
            "author": "squidbrady",
            "id": "gxgrtsw",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620535074.0,
            "replies": []
        },
        {
            "body": "Madara uchiha came damn close but he had to pull a fucking meteorite out of the sky",
            "author": "DevaPath_Winchester",
            "id": "gxgvw18",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620537726.0,
            "replies": []
        },
        {
            "body": "He was dope, but pain made me feel like everything was pointless, like no one even came close until naruto’s power up",
            "author": "mmecham2000",
            "id": "gxgysyg",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620539948.0,
            "replies": []
        },
        {
            "body": "Honestly I had the most fear of Gaara",
            "author": "D3ATHSTR0KE_",
            "id": "gxgzduh",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620540416.0,
            "replies": []
        },
        {
            "body": "True. But pain. Uh pain. NOW THE WORLD SHALL KNOW PAIN. (Palm theme plays)",
            "author": "FaultyChain4",
            "id": "gxh8mrb",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620548660.0,
            "replies": []
        },
        {
            "body": "True. And he was even pretty hot as a girl lol",
            "author": null,
            "id": "gxje5ju",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620594787.0,
            "replies": []
        },
        {
            "body": "Pain claiming to be Madara was scarier imo",
            "author": "Luke_Shields_",
            "id": "gxkrev8",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620623335.0,
            "replies": []
        },
        {
            "body": "I never understood why he had that face",
            "author": null,
            "id": "gxkutz9",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620626015.0,
            "replies": []
        },
        {
            "body": "I remember when Tsunade asking him what he was doing recently, and he goes \"Not much, just killing the 3rd Hokage\" in the most casual tone. It was badass",
            "author": "Equivalent_Action594",
            "id": "gxo3thh",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620689780.0,
            "replies": []
        },
        {
            "body": "literally the best thing about oro is how he gets his ass beat in every fight but still inspires fear/disgust/admiration in like every fan",
            "author": null,
            "id": "gxs81gz",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620770903.0,
            "replies": []
        },
        {
            "body": "ngl I'm the same",
            "author": "Doge69420meme",
            "id": "gxzd86e",
            "parent_id": "t3_n7n3fy",
            "score": 1,
            "created_utc": 1620916493.0,
            "replies": []
        },
        {
            "body": "Even post time skip, he still held his own against Cloaked Naruto, the same one that almost killed Jiraya. He then fought with Itachi and somehow survived to come back yet again to bring back the Hokage and fight in the final battle. Compared to all but the most elite characters in the end of the series",
            "author": "FalloutLover7",
            "id": "gxdu9qg",
            "parent_id": "t1_gxdnkz1",
            "score": 170,
            "created_utc": 1620479538.0,
            "replies": [
                {
                    "body": "All with his arms sealed until he brought back the Hokage.",
                    "author": "danceswithdux",
                    "id": "gxdve9m",
                    "parent_id": "t1_gxdu9qg",
                    "score": 109,
                    "created_utc": 1620480227.0,
                    "replies": []
                },
                {
                    "body": "I will say, if Jiraiya was fighting to kill Naruto I think he wouldnt have taken such a hit.",
                    "author": "RickyNixon",
                    "id": "gxeczo3",
                    "parent_id": "t1_gxdu9qg",
                    "score": 68,
                    "created_utc": 1620489551.0,
                    "replies": [
                        {
                            "body": "You also have to take into account that Naruto would’ve kept getting more mad and unleashing more tails like he did against Pain",
                            "author": "FalloutLover7",
                            "id": "gxep88x",
                            "parent_id": "t1_gxeczo3",
                            "score": 27,
                            "created_utc": 1620495522.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Again, you misinterpret strength and atmosphere, they gave off this scary vibe and their strength was not what produced this, it was their motives etc.",
                    "author": "Ziggy_the_third",
                    "id": "gxe14s4",
                    "parent_id": "t1_gxdu9qg",
                    "score": 42,
                    "created_utc": 1620483464.0,
                    "replies": [
                        {
                            "body": "The fact that I started watching Naruto after I finished Banana Fish meant that Orochimaru's obsession with Sasuke was setting off alarm bells in my head from day one.",
                            "author": "HollyTheMage",
                            "id": "gxh1u4g",
                            "parent_id": "t1_gxe14s4",
                            "score": 1,
                            "created_utc": 1620542477.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He didn’t really hold his own so much as not die, which is the kind of his whole schtick. Naruto was bullying him right up until Orochimaru used the Grass Longsword, which didn’t really hurt Naruto anyway.",
                    "author": "American_Madman",
                    "id": "gxee4qu",
                    "parent_id": "t1_gxdu9qg",
                    "score": 7,
                    "created_utc": 1620490105.0,
                    "replies": [
                        {
                            "body": "He had his arms sealed...",
                            "author": "Crocodile_raper",
                            "id": "gxehtp1",
                            "parent_id": "t1_gxee4qu",
                            "score": 6,
                            "created_utc": 1620491929.0,
                            "replies": [
                                {
                                    "body": "Yeah, and having his arms sealed lead to him getting bullied pretty hard. Not saying he wasn’t weakened, just that he didn’t really hold his own.",
                                    "author": "American_Madman",
                                    "id": "gxeocq7",
                                    "parent_id": "t1_gxehtp1",
                                    "score": 6,
                                    "created_utc": 1620495095.0,
                                    "replies": [
                                        {
                                            "body": "I'm only at season 8 on Netflix India, so all these happen in the upcoming seasons? Netflix India has only 9 seasons.",
                                            "author": "lockkheart",
                                            "id": "gxeyyh7",
                                            "parent_id": "t1_gxeocq7",
                                            "score": 2,
                                            "created_utc": 1620500267.0,
                                            "replies": [
                                                {
                                                    "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
                                                    "author": "Majoranza",
                                                    "id": "gxf28jv",
                                                    "parent_id": "t1_gxeyyh7",
                                                    "score": 5,
                                                    "created_utc": 1620501926.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                                                            "author": "American_Madman",
                                                            "id": "gxfhcsj",
                                                            "parent_id": "t1_gxf28jv",
                                                            "score": 2,
                                                            "created_utc": 1620509617.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
                                                    "author": "American_Madman",
                                                    "id": "gxffle7",
                                                    "parent_id": "t1_gxeyyh7",
                                                    "score": 2,
                                                    "created_utc": 1620508694.0,
                                                    "replies": [
                                                        {
                                                            "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                                                            "author": "lockkheart",
                                                            "id": "gxg70bd",
                                                            "parent_id": "t1_gxffle7",
                                                            "score": 2,
                                                            "created_utc": 1620523200.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
                                                    "author": "Terminal_Monk",
                                                    "id": "gxgqsiq",
                                                    "parent_id": "t1_gxeyyh7",
                                                    "score": 2,
                                                    "created_utc": 1620534477.0,
                                                    "replies": [
                                                        {
                                                            "body": "I guess I'll have to go the other route :)",
                                                            "author": "lockkheart",
                                                            "id": "gxgylbj",
                                                            "parent_id": "t1_gxgqsiq",
                                                            "score": 1,
                                                            "created_utc": 1620539776.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                                                            "author": "lockkheart",
                                                            "id": "gxilqg1",
                                                            "parent_id": "t1_gxgqsiq",
                                                            "score": 1,
                                                            "created_utc": 1620581054.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, if Itachi was still alive by the end of the series, even if he had been nerfed like Orochimaru they would both still be powerhouses. People like to shit on the part 1 big boys because of the power creep in Shippuden, but forget that outside of the protagonists, a LOT of the world is still the way it was. Suigetsu woke up from a nap and smacked the fuck out of Boruto’s classmates with very little effort, and he’s definitely not as strong as Orochimaru.",
            "author": "Agorbs",
            "id": "gxds2m9",
            "parent_id": "t1_gxdnkz1",
            "score": 169,
            "created_utc": 1620478117.0,
            "replies": [
                {
                    "body": "My thoughts were more about the atmosphere, and not really strength related, part 1 Itachi wasn't scary just because he was strong, but the way he used his strength was scary, and types of moves he was employing. It was the personalities we saw more than their strength.",
                    "author": "Ziggy_the_third",
                    "id": "gxdsi1p",
                    "parent_id": "t1_gxds2m9",
                    "score": 128,
                    "created_utc": 1620478399.0,
                    "replies": [
                        {
                            "body": "Yeah I can agree there. Itachi oozed this aura of cold, calculated genius killer. No wasted movements, no wasted words, just pure lethality.",
                            "author": "Agorbs",
                            "id": "gxdsx3u",
                            "parent_id": "t1_gxdsi1p",
                            "score": 90,
                            "created_utc": 1620478680.0,
                            "replies": [
                                {
                                    "body": "The Itachi vs Kakashi/Asuma/Kurama fight made it seem like the level of ninja that Konoha had was no match for Itachi. You also vaguely knew that 8 more, and assumed they were all like Itachi.\n\nOnce we skip forward, Naruto always seemed capable of protecting himself, and the rest of the Akatsuki were reckless psychos. Only a few even remotely gave the same vibes.",
                                    "author": "Harden-Soul",
                                    "id": "gxekvdy",
                                    "parent_id": "t1_gxdsx3u",
                                    "score": 28,
                                    "created_utc": 1620493427.0,
                                    "replies": [
                                        {
                                            "body": "Well yeah, but I’d wager there’s very few Konoha shinobi that could take down anyone in Akatsuki regardless. \n\n\nThe main reason Kakuzu and Hidan got killed was because Shikamaru had god tier planning and even then it was pretty close. If Naruto didn’t roll in with his brand new plot device no jutsu...",
                                            "author": "Agorbs",
                                            "id": "gxenbnk",
                                            "parent_id": "t1_gxekvdy",
                                            "score": 17,
                                            "created_utc": 1620494595.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "They also made Itachi seem a ton more powerful because we had sasuke, who we all felt was pretty damn strong, which is always in fear of Itachi. Then when they finally meet, as expected, Itachi destroys him. Overall Itachi was arguably the big scary guy in pre skip Naruto",
                            "author": "Metalona",
                            "id": "gxe208o",
                            "parent_id": "t1_gxdsi1p",
                            "score": 47,
                            "created_utc": 1620483933.0,
                            "replies": [
                                {
                                    "body": "Yeah. Orochimaru was scary, but itachi was more scary. The cold calculated genius psycho killer",
                                    "author": null,
                                    "id": "gxe2hw7",
                                    "parent_id": "t1_gxe208o",
                                    "score": 31,
                                    "created_utc": 1620484197.0,
                                    "replies": [
                                        {
                                            "body": "Orochimaru was afraid of Itachi which tells you everything you need to know about him. At the time he was introduced, Orochimaru had killed 2 Kage and traumatized an entire generation of kids. Then when talking about Itachi he was like “Nah fuck that shit he’s way too strong. I’ll gladly take on two whole nations, but not this teenager with the eyes”",
                                            "author": "SeductivePillowcase",
                                            "id": "gxki0kg",
                                            "parent_id": "t1_gxe2hw7",
                                            "score": 7,
                                            "created_utc": 1620617029.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Also he fucking destroyed Kakashi, who we all saw as unbeatable up to this point.",
                                    "author": "ItzDrSeuss",
                                    "id": "gxe7x5d",
                                    "parent_id": "t1_gxe208o",
                                    "score": 30,
                                    "created_utc": 1620487031.0,
                                    "replies": [
                                        {
                                            "body": "He didn't even seem to be trying against the lead Jonin. And the idea was that this was just the beginning. We thought the other Akatsuki members would be just as strong, but only Pain was really even close.",
                                            "author": "Harden-Soul",
                                            "id": "gxel5jc",
                                            "parent_id": "t1_gxe7x5d",
                                            "score": 13,
                                            "created_utc": 1620493561.0,
                                            "replies": [
                                                {
                                                    "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
                                                    "author": "ItzDrSeuss",
                                                    "id": "gxevnld",
                                                    "parent_id": "t1_gxel5jc",
                                                    "score": 9,
                                                    "created_utc": 1620498635.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
                                                    "author": "SeductivePillowcase",
                                                    "id": "gxkjan1",
                                                    "parent_id": "t1_gxel5jc",
                                                    "score": 1,
                                                    "created_utc": 1620617837.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Suigetsu may not be as strong as Orochimaru, but he’s still strong AF. Dealing with genin like Boruto’s friends is never going to a problem for someone of his level. He’s the same level as Karin or higher and she easily outplayed multiple Jonins like Yamato and the others observing the site and Muggi.",
                    "author": "Supernova-581",
                    "id": "gxdsf9c",
                    "parent_id": "t1_gxds2m9",
                    "score": 45,
                    "created_utc": 1620478348.0,
                    "replies": [
                        {
                            "body": "People underappreciated suigetsu’s strength, the man tanked a bijuudama and recovered after maybe a week or two",
                            "author": "isaaceyfish",
                            "id": "gxdzgfp",
                            "parent_id": "t1_gxdsf9c",
                            "score": 40,
                            "created_utc": 1620482555.0,
                            "replies": [
                                {
                                    "body": "The man was boxing with the Hachibii.",
                                    "author": null,
                                    "id": "gxekrgz",
                                    "parent_id": "t1_gxdzgfp",
                                    "score": 9,
                                    "created_utc": 1620493375.0,
                                    "replies": [
                                        {
                                            "body": "Straight facts, not to mention barely anything works on him because he’s made of water",
                                            "author": "isaaceyfish",
                                            "id": "gxem3t7",
                                            "parent_id": "t1_gxekrgz",
                                            "score": 8,
                                            "created_utc": 1620494021.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saw some vid about how Orochimaru should have remained the big bad guy throughout the series, and although they would have needed some amazing writing to pull off, I think it would have made for a stronger series and satysfying end.\n\nTsunade dead, Jiraiya dead, it would have been great for Team 7 to defeat the last legendary sannin as an official new beginning to their Ninja world.",
            "author": "i_Got_Rocks",
            "id": "gxeptrt",
            "parent_id": "t1_gxdnkz1",
            "score": 9,
            "created_utc": 1620495813.0,
            "replies": [
                {
                    "body": "Considering Orochimaru's ability to body swap, they could have come up with a less powerful being than a god, and he could have taken their body.",
                    "author": "Ziggy_the_third",
                    "id": "gxet2fl",
                    "parent_id": "t1_gxeptrt",
                    "score": 4,
                    "created_utc": 1620497393.0,
                    "replies": [
                        {
                            "body": "Imagine the fucking mindgames he could have played, kicking the shit out of the people Naruto cares about while wearing the stolen faces of his dead loved ones. \n\nThat would have been absolutely brutal.",
                            "author": "HollyTheMage",
                            "id": "gxkd08r",
                            "parent_id": "t1_gxet2fl",
                            "score": 3,
                            "created_utc": 1620614011.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To add to what everyone else is saying I actually prefer the skip.\n\nWe know itachi was going blind for a long time and even with the frailty he had he was still op. Imagine if he had unlocked the renagan in his eye like sasuke would after transplanting his eyes. Itachi would have no doubt been other worldly. I also suspect he let sasuke defeat him to push him to his peak. Itachi made use of like no jitsu even though we know the sharingan can let uchiha copy jitsu and create or use jitsu not available to those who do not have the eye(s) (chidori) \n\nI like him in both. \n\nOrochimaru though they did dirty and boruto makes him even more pathetic. The man killed kage and was even seen by the akatsuki as a threat years after him leaving",
            "author": "GoodboyGotter",
            "id": "gxecrf2",
            "parent_id": "t1_gxdnkz1",
            "score": 7,
            "created_utc": 1620489438.0,
            "replies": [
                {
                    "body": "What do u mean u suspect he let sasuke defeat him to push him to his peak? That’s literally what happened in the story.",
                    "author": "Smitten130",
                    "id": "gxenu72",
                    "parent_id": "t1_gxecrf2",
                    "score": 3,
                    "created_utc": 1620494845.0,
                    "replies": [
                        {
                            "body": "Well I have an alternate head cannon theory that in the event sasuke didn't live up to itachi's expectations or died during their fight then that would only leave itachi with the option of taking his eyes.\n\nLike imagine if sasuke died so many times what was itachi going to do? Just go blind? Fight obito? \n\nIt's not clear but if itachi's plan had failed at even a single part then his only option would be to take sasuke's  eyes and finish the akatsuki arc himself. Sasuke died to zabuza? Tough fucking luck.\n\nI suppose he could have used the eye he confiscated from shitsuge or whatever his name was but I don't think it would have helped much.",
                            "author": "GoodboyGotter",
                            "id": "gxeqjn5",
                            "parent_id": "t1_gxenu72",
                            "score": 3,
                            "created_utc": 1620496169.0,
                            "replies": [
                                {
                                    "body": "Hmm, interesting! I’ve always thought that itachi was already on the verge of death and wanted sasuke to kill him for personal growth.",
                                    "author": "Smitten130",
                                    "id": "gxeqxjq",
                                    "parent_id": "t1_gxeqjn5",
                                    "score": 2,
                                    "created_utc": 1620496351.0,
                                    "replies": [
                                        {
                                            "body": "He was quite frail but still powerful.\n\nMy head canon \"what if?\" Is trying to explain what the fuck itachi plans to do if sasuke died. It really changes everything. It's not like itachi was holding his hand after he left the village or protecting him. His entire plan when you think about it was \"sasuke tragedy, sasuke get strong, sasuke kill me get stronger,\" but what if sasuke just fucking died at any point? Like itachi would have to take his eyes and come up with a new plan and with greater urgency.",
                                            "author": "GoodboyGotter",
                                            "id": "gxerh6c",
                                            "parent_id": "t1_gxeqxjq",
                                            "score": 2,
                                            "created_utc": 1620496613.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You're saying his OP, prefacing it with he's going blind--and despite us knowing he is literally dying. He is literally a glass cannon. He is literally a balanced power character.\n\nThis is the kind of balancing more characters needed. Naruto and Sasuke being the most OP in the bunch, being able to just learn Jutsu on the fly like no one's business.",
                    "author": "i_Got_Rocks",
                    "id": "gxeq2kn",
                    "parent_id": "t1_gxecrf2",
                    "score": 1,
                    "created_utc": 1620495935.0,
                    "replies": [
                        {
                            "body": "Yeah that's why I like arc 2 itachi better than one. More depth.\n\nI only enjoy borutos generation for Saradas potential and the fear/knowledge she might have to take her father's eyes to peak power but with it tragedy. Unfortunately the writer is more concerned with some karma mark garbage and just making the entire previous lore stupid and unimportant",
                            "author": "GoodboyGotter",
                            "id": "gxeqxv6",
                            "parent_id": "t1_gxeq2kn",
                            "score": 1,
                            "created_utc": 1620496355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah itachi was so mysterious and scary back then. Youd really think he did kill every uchiha with ill intent.",
            "author": "bohenian12",
            "id": "gxeom4b",
            "parent_id": "t1_gxdnkz1",
            "score": 2,
            "created_utc": 1620495223.0,
            "replies": []
        },
        {
            "body": "A lot of fans dropped off after the Chunnin exam arc because the manga went in a different direction and power creep started happening on a regular basis.",
            "author": "DisneyPrincessDVorah",
            "id": "gxgu00w",
            "parent_id": "t1_gxdnkz1",
            "score": 2,
            "created_utc": 1620536441.0,
            "replies": []
        },
        {
            "body": "So are we gonna talk about how Kisame drained all of Naruto's chakra with Samehada and then casually suggested cutting off his limbs so he wouldn't be able to run away from them or-",
            "author": "HollyTheMage",
            "id": "gxh4x7h",
            "parent_id": "t1_gxdnkz1",
            "score": 2,
            "created_utc": 1620545191.0,
            "replies": []
        },
        {
            "body": "Yeah like his creepy fixation on sasuke and the way he used to talk to and about his targets was bad enough but the fact that we knew that he loved to experiment on bodies of kids and had similar intentions towards sasuke (aside from taking his body) was what truly was scary about him especially when it all seemed to be coming true by the ending of part 1\n\nAnd almost everything about sasuke during the beginning of shippuden was pleasantly surprising. The fact that even after spending 3 years with orochimaru his morals hadn't changed and he refused to kill people unless extremely necessary. The fact that his personality was almost the same as part 1 or at least more stable than how it was during his rooftop fight with naruto. The fact that he freed all of orochimaru's prisoners when he had no obligation to do that. The fact that he had an explicit no kill policy not only for himself but for his teammates as well. I liked it alot",
            "author": "floral-dawns",
            "id": "gxdwtbd",
            "parent_id": "t1_gxdqhc7",
            "score": 48,
            "created_utc": 1620481064.0,
            "replies": [
                {
                    "body": "This! And just to piggy back, this exact feeling also helped make it feel even deeper/heavier when Sasuke began spiraling towards hatred more and more after \"beating\" Itachi and chasing down Danzou/meeting Naruto after he became a Sage. Karin specifically pointed out how dark and cold Sasuke was becoming too. That face when he stabbed thru her was chilling..",
                    "author": "CelticDK",
                    "id": "gxe52o9",
                    "parent_id": "t1_gxdwtbd",
                    "score": 18,
                    "created_utc": 1620485555.0,
                    "replies": [
                        {
                            "body": "Follow up to that specific mention of Karin, the fact that Sasuke essentially discarded her after she had outlived her usefulness to him was especially disconcerting because I feel like it parallels the way Danzo would use and throw away his subordinates or really anyone in order to accomplish his goals. \n\nAlso Karin's fucked up backstory makes that scene so much more heartbreaking in retrospect.",
                            "author": "HollyTheMage",
                            "id": "gxh2n4g",
                            "parent_id": "t1_gxe52o9",
                            "score": 1,
                            "created_utc": 1620543160.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also he was plain evil. He wasn't doing anything for some big cause. He just wanted to be immortal so was less likely to fall to any speeches. He also experimented on human bodies which i dobtf think any other naruto villain came close to do",
            "author": "floral-dawns",
            "id": "gxdz3cm",
            "parent_id": "t1_gxdszsv",
            "score": 38,
            "created_utc": 1620482354.0,
            "replies": [
                {
                    "body": "This is what makes him so menacing really. He doesn’t have some grandiose vision for the world. He just wants immortality and  perfection for himself and himself alone. It makes him all the more scary because he isn’t bound by any ideology or code",
                    "author": "Calidore_X",
                    "id": "gxe0x8p",
                    "parent_id": "t1_gxdz3cm",
                    "score": 30,
                    "created_utc": 1620483350.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh absolutely. orochimaru's main theme and that one unreleaed ost truly hammered down the scariness and creepyness of all the scenes involving him.",
            "author": "floral-dawns",
            "id": "gxdyeqz",
            "parent_id": "t1_gxdu57f",
            "score": 46,
            "created_utc": 1620481980.0,
            "replies": [
                {
                    "body": "What made the early arcs awesome was that there was stuff going on--the chuunin exams--and there was world crap going on, Orochimaru and other nations with different goals.\n\nIt made the world feel so big and real. As the series goes on, it becomes more and more about Naruto. It doesn't feel like a big world anymore, it feels like a Naruto world. And the story suffers because of it.",
                    "author": "i_Got_Rocks",
                    "id": "gxesh5g",
                    "parent_id": "t1_gxdyeqz",
                    "score": 9,
                    "created_utc": 1620497105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fucker just wouldn’t die, and he taught Hiruzen a thing or two about dying and *then living again*",
            "author": "Kryllllllyx",
            "id": "gxe0npj",
            "parent_id": "t1_gxdu57f",
            "score": 19,
            "created_utc": 1620483209.0,
            "replies": [
                {
                    "body": "Jesus, Voldemort, Orochimaru. \n\nBack to life gang.",
                    "author": "brobronn17",
                    "id": "gxe4uh0",
                    "parent_id": "t1_gxe0npj",
                    "score": 18,
                    "created_utc": 1620485437.0,
                    "replies": [
                        {
                            "body": "Voldemort and Orochimaru have so many similarities that it's uncanny. Both snakey sneks, both obsessed with immortality, both passed up for a position they felt they deserved by their mentor, who they then tried to kill.",
                            "author": "WanderingToTheEnd",
                            "id": "gxejf5a",
                            "parent_id": "t1_gxe4uh0",
                            "score": 10,
                            "created_utc": 1620492718.0,
                            "replies": [
                                {
                                    "body": "Yeah, makes me wonder if it's some kind of a biblical archetype. I wasn't raised with religion but sometimes I notice these similarities and wish I knew a bit more about the bible and stuff so I could be like \"Aha! That's a Cain and Abel reference!!\" I mean I guess the snake itself is a biblical reference and the idea that knowledge can corrupt?",
                                    "author": "brobronn17",
                                    "id": "gxeuxrp",
                                    "parent_id": "t1_gxejf5a",
                                    "score": 3,
                                    "created_utc": 1620498293.0,
                                    "replies": [
                                        {
                                            "body": "It is, but in Orochimaru's case I think he's primarily based off of a Japanese myth involving a snake.",
                                            "author": "WanderingToTheEnd",
                                            "id": "gxewufd",
                                            "parent_id": "t1_gxeuxrp",
                                            "score": 2,
                                            "created_utc": 1620499213.0,
                                            "replies": [
                                                {
                                                    "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
                                                    "author": "brobronn17",
                                                    "id": "gxextdv",
                                                    "parent_id": "t1_gxewufd",
                                                    "score": 3,
                                                    "created_utc": 1620499694.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                                                            "author": "HollyTheMage",
                                                            "id": "gxh387f",
                                                            "parent_id": "t1_gxextdv",
                                                            "score": 3,
                                                            "created_utc": 1620543675.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": ">both passed up for a position they felt they deserved by their mentor, who they then tried to kill.\n\nTbf Voldemort only wanted the role some could be closer to control the Basilisk, pick on half bloods and muggleborns and recruit bigoted purebloods to his cause",
                                    "author": "KingofTrollenheim",
                                    "id": "gxi78zm",
                                    "parent_id": "t1_gxejf5a",
                                    "score": 1,
                                    "created_utc": 1620573878.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "NeverDieGangGang",
                            "author": "i_Got_Rocks",
                            "id": "gxesiw4",
                            "parent_id": "t1_gxe4uh0",
                            "score": 1,
                            "created_utc": 1620497128.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "God his theme is the best.",
            "author": "SPS_Agent",
            "id": "gxe3rd5",
            "parent_id": "t1_gxdu57f",
            "score": 6,
            "created_utc": 1620484867.0,
            "replies": []
        },
        {
            "body": "It's all fun and games until the organ starts playing",
            "author": "Tsynami",
            "id": "gxe4oer",
            "parent_id": "t1_gxdu57f",
            "score": 6,
            "created_utc": 1620485351.0,
            "replies": [
                {
                    "body": "Lmao yes",
                    "author": "Silent_Sparrow02",
                    "id": "gxe5owo",
                    "parent_id": "t1_gxe4oer",
                    "score": 3,
                    "created_utc": 1620485878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "*ominous hindi chanting over cathedral organ music intensifies*",
            "author": null,
            "id": "gxekyim",
            "parent_id": "t1_gxdu57f",
            "score": 2,
            "created_utc": 1620493469.0,
            "replies": []
        },
        {
            "body": "Fucking seriously. Going back and listening to it now is still horribly unsettling.",
            "author": "Laphing_Drunk",
            "id": "gxespyr",
            "parent_id": "t1_gxdu57f",
            "score": 2,
            "created_utc": 1620497223.0,
            "replies": []
        },
        {
            "body": "I think the soundtracks really make it better Pains theme is incredible which adds to the unknown amounts of power he had.",
            "author": "MoldyToblerone",
            "id": "gxenhom",
            "parent_id": "t1_gxdzpm4",
            "score": 10,
            "created_utc": 1620494676.0,
            "replies": []
        },
        {
            "body": "\"Body Stealing Ninjutsu Michael Jackson\", lol",
            "author": "vokul_vokundova",
            "id": "gxh5l5s",
            "parent_id": "t1_gxdzpm4",
            "score": 2,
            "created_utc": 1620545796.0,
            "replies": []
        },
        {
            "body": "His view and monologues were powerful: Everyone will feel...pain.\n\nHe doesn't want to unify the world in love and peace, but in pain. It's an interesting take on a villain trying to do the \"right\" thing according to their life experience.",
            "author": "i_Got_Rocks",
            "id": "gxess7y",
            "parent_id": "t1_gxdzpm4",
            "score": 1,
            "created_utc": 1620497254.0,
            "replies": [
                {
                    "body": "One of my reactions to stressful situations is to use humor as a coping mechanism, so when Pain said the line \"this world shall know pain\" I just said \"lmao kinky\" and then watched in abject horror as he fucking obliterated the entire village.",
                    "author": "HollyTheMage",
                    "id": "gxh2vdq",
                    "parent_id": "t1_gxess7y",
                    "score": 1,
                    "created_utc": 1620543362.0,
                    "replies": [
                        {
                            "body": "*Everyone dying around you*\n\nPAIN: ...know...Pain. *Akatsuki theme song start*\n\n/u/HollyTheMage : Oh, yeashhhh, Daddy, stomp. ON. MEH!\n\n*Akatsuki theme song goes \"Ouu-ah, oouu-ah\"*\n\n/u/HollyTheMage : YES! YES!!\n\n*Village civilians start to die. Ramen Noodles holding his dead wife in his arms.*\n\n/u/HollyTheMage : OH, no, not like that. No. What is this?! DO SOMETHING SOMEONE! *hunches over on the ground* NARUTOOOOOOOOOOO!",
                            "author": "i_Got_Rocks",
                            "id": "gxhy64i",
                            "parent_id": "t1_gxh2vdq",
                            "score": 2,
                            "created_utc": 1620569214.0,
                            "replies": [
                                {
                                    "body": "Bold of you to assume I would be in the right state of mind to even scream for help.\n\nActually if I keep it up with the obnoxious innuendos maybe the Six Paths will get annoyed with me and start targeting me specifically rather than attacking civilians at random. Hopefully I'll be able to distract them just long enough for some of the non-combatants in the area to be evacuated to the bunkers hidden in the Hokage mountain.\n\nShit, I could probably come up with a comedy routine for each of the Six Paths. For the Animal Path, it will be Pokemon jokes. For the Asura Path, it will be Metal Gear memes. If the Naraka Path pulls out the King of Hell, you can be sure I'll be making Doom Eternal and Devil May Cry references. For the Preta Path, I might humorously refer to them as Dazai Osamu from Bungou Stray Dogs. If the Human Path tries to rip my soul out I'll start singing one of the opening themes of Fullmetal Alchemist as loudly and horribly as I possibly can.\n\nThey probably won't understand any of my references, but my reactions would be unpredictable enough to throw them off their rhythm. All the time they spend bothering to try and parse out some semblance of meaning from my bullshit in order to formulate a more effective argument against my worldviews once it comes time for Pain to lecture me is time they could have otherwise spent murdering innocent people.\n\nEventually they'll get tired of trying to kill me and just send the main Pain over to deal with my shit.\n\nWatch me get pinned down to the ground with a bunch of rods impaled through my limbs like Naruto but every time Pain starts monologuing I just keep interrupting him to make penetration and bondage jokes related to the current situation I am in at the moment. Hell, I'll probably get my head smashed in, but if it buys a little more time for reinforcements to arrive and help evacuate the wounded from ground zero, so be it. \n\nI'm so goddamn obnoxious that most of the village probably wouldn't mind seeing me wiped off the face of the earth, so I won't have to worry about anyone needlessly sacrificing themselves in a suicide mission to save my worthless ass, only to have their memory insulted when I react by making a vine reference to cope with the trauma of witnessing their death.\n\nEventually Pain calls Konan over to try and talk to me because nothing else is working.\n\nIt goes about as well as you'd expect.\n\nNobody:\n\nNot even Danzo:\n\nMe: [https://youtu.be/-sMQpWCNTQw](https://youtu.be/-sMQpWCNTQw)",
                                    "author": "HollyTheMage",
                                    "id": "gxjh17g",
                                    "parent_id": "t1_gxhy64i",
                                    "score": 2,
                                    "created_utc": 1620596218.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "His theme is epiccc. Quality bossfight music.",
            "author": "brobronn17",
            "id": "gxe56r6",
            "parent_id": "t1_gxduqk2",
            "score": 12,
            "created_utc": 1620485615.0,
            "replies": []
        },
        {
            "body": "...",
            "author": "FeelingPrettyChill",
            "id": "gxef9zj",
            "parent_id": "t1_gxdx88j",
            "score": 3,
            "created_utc": 1620490668.0,
            "replies": [
                {
                    "body": "I get where he's coming from that tongue game would *crazy*",
                    "author": "whitey-ofwgkta",
                    "id": "gxeot11",
                    "parent_id": "t1_gxef9zj",
                    "score": 9,
                    "created_utc": 1620495316.0,
                    "replies": [
                        {
                            "body": "Someone understands 😏🤦🏾‍♂️😂😂",
                            "author": "Za106",
                            "id": "gxfbfjz",
                            "parent_id": "t1_gxeot11",
                            "score": 4,
                            "created_utc": 1620506579.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What? I’m deadass 😩😩",
                    "author": "Za106",
                    "id": "gxej6up",
                    "parent_id": "t1_gxef9zj",
                    "score": 6,
                    "created_utc": 1620492606.0,
                    "replies": [
                        {
                            "body": "ok then",
                            "author": "FeelingPrettyChill",
                            "id": "gxej93l",
                            "parent_id": "t1_gxej6up",
                            "score": 3,
                            "created_utc": 1620492636.0,
                            "replies": [
                                {
                                    "body": "😂😂",
                                    "author": "Za106",
                                    "id": "gxek9re",
                                    "parent_id": "t1_gxej93l",
                                    "score": 1,
                                    "created_utc": 1620493134.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He just got bored and decided to watch someone else fuck shit up instead.",
            "author": "HollyTheMage",
            "id": "gxkd45z",
            "parent_id": "t1_gxdq424",
            "score": 1,
            "created_utc": 1620614075.0,
            "replies": []
        },
        {
            "body": "Luffy's mother was never Crocodile.",
            "author": "germanymodsarenazis",
            "id": "gxebfq2",
            "parent_id": "t1_gxe2ca1",
            "score": 1,
            "created_utc": 1620488795.0,
            "replies": []
        },
        {
            "body": "Your friend has bad taste in villains 😤",
            "author": "FeelingPrettyChill",
            "id": "gxefc6h",
            "parent_id": "t1_gxdskko",
            "score": 5,
            "created_utc": 1620490698.0,
            "replies": [
                {
                    "body": "Fuck yea. I was hurt like homie how could u say that to me XD",
                    "author": "Ays_500",
                    "id": "gxefyab",
                    "parent_id": "t1_gxefc6h",
                    "score": 5,
                    "created_utc": 1620490998.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right?\n\nHe might actually be able to claim he is the best candidate for kage. The dude just cannot be defeated in his prime and if he never body switched he would have been able to learn snake sage.",
            "author": "GoodboyGotter",
            "id": "gxedgdn",
            "parent_id": "t1_gxdui0u",
            "score": 4,
            "created_utc": 1620489775.0,
            "replies": [
                {
                    "body": "Well idk about that, Itachi wrecked prime Orochimaru at like 13, and I don’t think Orochimaru could beat Minato either but he’d definitely be a beast",
                    "author": "LazyBriton",
                    "id": "gxegq7z",
                    "parent_id": "t1_gxedgdn",
                    "score": 5,
                    "created_utc": 1620491383.0,
                    "replies": [
                        {
                            "body": "Itachi could have probably beat any of the akatsuki except maybe--MAYBE--nagato though. He is a league of his own. His genjitsu is so powerful it can warp reality and he could kill his entire clan which not even the first 2 kage or other clans seemed competent enough to accomplish with the entire history of the uchiha. \n\nHe is much in a league of his own and we never see madara or obito even flex such a level of mastery over the sharingan with all their power and skill. \n\nSo itachi is in a league uniquely of his own and his friend he took the eye of and put in a bird. \n\nOrochimaru though is probably equal to or stronger than Jariayah at his peak and if he didn't body swap he could have learned snake sage which Mitsuki has already shown to be op and somewhat mysterious in how it works relative to say toad sage form. I would even put peak orochimaru wit sage form higher than kakashi theoretically. Something that was little explored was all the forbidden and new jitsu, novel or forbidden, orochimaru invented or discovered. A better writer would have flexed his strengths like in part 1. Instead we get orochimaru the cripple bitch who dies in 2 and orochimaru the dude who does nothing in Boruto",
                            "author": "GoodboyGotter",
                            "id": "gxeifna",
                            "parent_id": "t1_gxegq7z",
                            "score": 1,
                            "created_utc": 1620492232.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Kaguya \n\nThink of how interesting it would been for Orochimaru subplot--he keeps \"helping\" the good guys, knowing it will lead, eventually to Kaguya being revealed. Knowing damn well Naruto will save everyone. \n\nAnd his entire scheme, we see it play out, and even other characters are suspicious of him--but they leave him alone because he is helping them defeat Pain and others--but then, when Kaguya is revealed, he reveals a new forbidden jutsu where he absorbs Kaguya, forcing her inside of himself like another one of the tailed beasts. He escapes, the Ninja world rebuilds.\n\nThe final arc focuses on what Orochimaru is doing with such power--and how he's using it, not to take over the world, but on taking down individual ninja and stealing their abilities--and yes, this time, he actually kills them. No \"sealing\" or burying, or borrowing their bodies, no nonsense.\n\nPart of his new jutsu requires him to kill and drain life force and chakra in order to survive. This leads to the final 10 or so episodes that could be summed up in a movie later, with better animation budget as a re-release finale a year or so later.\n\nBut in the finale, more ninja die--and it's what forces people to seek the peaceful world Naruto dreams about since day 1. They defeat Orochimaru (or Naruto defeats him, basically) by reaching inside of him, in the same way Sasuke was able to go inside Naruto's mind in early Shippuden and see Kurama. Or maybe, Sasuke teams up with Naruto to show him this technique. Forcing Team 7 to lead the remaining Ninja on a large scale attack against Orochimaru and Kaguya. \n\nThey realize the only way to defeat Orochimaru is to seal up Kaguya. This will lead to a big sacrifice from a lot of Ninja, and we will even lose some Gaaras and big Hokage names. Naruto loses his arm here. They seal up Kaguya deep inside Orochimaru's mind and he cannot access this power anymore. Then, they're able to seal him up. And to be sure, they seal the seal that seals him up further--making sure this isn't a returning villain (it's the end of the series).\n\nAt the end of it, Naruto tells Sasuke he must pay for his crimes against the Ninja world. Sasuke excuse himself by saying he was just another Ninja doing cruel things. Naruto doesn't buy it, proclaims he'll make sure Sasuke pays--it's the only way to redeem him. Sakura, no longer a useless muppet, yells at Sasuke telling him that despite her love for him--she cannot forgive him. And it's because of her love, that she'll ensure he pays his debts for all the fallen lives he caused. Sasuke runs into the forest. Sakura yells super loud that he'll find redemption in prison or by her own hands, tears in her eyes. Naruto looks as a weakened Sasuke runs away; remembering his promise to Itachi, Naruto whispers, \"Sasuke...I'll always love you,\" mirroring Itachi's last words and shipping that hot-hot yaoi relationship some fans can't get enough of (Sorry, Sakura, this is not a war you can win--we gotta sell some merch).\n\nThis is where we end the series. Lives have paid for a better future. Sasuke is no \"magically forgiven\" darling and Naruto is almost ready to become Hokage. Despite being asked to be Hokage already, he must go and find his boyfriend, I mean, best friend before he can feel he has saved his village. To him, his boyfriend, I mean best friend, is his village.\n\nThere could be a theater film finale showing the final battle between Sasuke and Naruto/Sakura, but make it more about how they've grown. In the end, either Sasuke dies, because he still feels his clan was humiliated and destroyed for a village that didn't care about him. Well written, this could a strong film where Sasuke's rage and anger is justified--and Team Seven follows the path of the legendary Sannin, but rather than allow another Orochimaru to survive, Sakura and Naruto agree that they must take him down.\n\nEven though they kill him, they build a minor monument inside Konoha to honor his good deeds. An act that is controversial among Ninja and civilians in Konoha.\n\nSakura ain't got no kids by Sasuke. She has grown up. Naruto is one-armed for life. And the series ends. It ends. It's done. No Boruto kun bullshit.\n\n(Sorry, Sakura ^_^;;)",
            "author": "i_Got_Rocks",
            "id": "gxgda64",
            "parent_id": "t1_gxdvy3q",
            "score": 2,
            "created_utc": 1620526687.0,
            "replies": [
                {
                    "body": "Damn, not bad. I'd watch this over the alternate universe story that played out during Tsunade's dream arc in the Infinite Tsukuyomi.",
                    "author": "HollyTheMage",
                    "id": "gxkeska",
                    "parent_id": "t1_gxgda64",
                    "score": 2,
                    "created_utc": 1620615063.0,
                    "replies": [
                        {
                            "body": "There's so much potential for stories that were never told in Naruto because it focused too heavily on Naruto...gaining another tail or something.\n\nI have a story in mind where Sakura tests her might and goes to find Sasuke alone, when her training with Tsunade is finished, but Naruto is still training. \n\nLong story short: She manages to *almost* beat Sasuke and bring him back due to her advantage of good Chakra control and good wits. She manages to outwit almost every trick Sasuke tries because she realizes that her biggest weakness will be her love for him. And it's in this fight that she realizes Sasuke won't change, and she gives herself the worth she deserves and that life isn't about her--but about the village and all that mushy stuff that she never saw because of Sasuke.\n\nSakura foils so much of Sasuke's tactics so Sasuke leaves because Sakura is able to bluff she has stronger attacks, but in reality, she is drained and out of options. Sasuke is weakened and is not willing to risk it because his bigger goal is to destroy the Leaf village, but he is actually scared that Sakura might be even more powerful than she lets on.\n\nThere's a link between her fight and the training she does with Tsunade where Tsunade forces her to think and not just punch blast everything. The emotional weight of the fight is about Sakura overcoming her own childish love for a guy that isn't interested in redemption.\n\nThis would later resonate again when Sasuke leaves as Orochimaru escapes too. \n\nIn the final arc when they defeat Sasuke, Naruto buries his boyfriend, and Sakura buries a stranger--no longer in love with him, but grateful their paths crossed.  Naruto cries for Sasuke. Sakura cries for the end of a clan. Naruto tells her that of all the Ninja he knows, she is the only one that could stand a chance against him, solely by using her wits. She tells him she knows. Her role at the end, would probably be head of Ambu. Though she's a great medical Ninja, she doesn't want to heal allies when they're broken, she wants to prevent the tragedies from happening in the first place.",
                            "author": "i_Got_Rocks",
                            "id": "gxkh6zd",
                            "parent_id": "t1_gxkeska",
                            "score": 2,
                            "created_utc": 1620616516.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wasn't much scared with gaara bc he was still just a genin and until the revelation about him having a tailed best sealed within him it seemed like kakashi and guy could have easily taken him down especially since he was intimidated into backing down by gai twice already\n\nOrochimaru on the other hand was more craftier and clever than gaara and had managed to kill the 3rd hokage and was able to take on 2 sanins without 2 proper hands which made him more scarier",
            "author": "floral-dawns",
            "id": "gxdx4x3",
            "parent_id": "t1_gxdskfq",
            "score": 12,
            "created_utc": 1620481252.0,
            "replies": []
        },
        {
            "body": "They saw their deaths, even Kakashi was terrified",
            "author": "FeelingPrettyChill",
            "id": "gxefouw",
            "parent_id": "t1_gxdvmyv",
            "score": 2,
            "created_utc": 1620490870.0,
            "replies": [
                {
                    "body": "Oh snap so they literally saw a vision of their death or simply that they felt the fear of death in that moment?",
                    "author": "Vnecktrev09",
                    "id": "gxeit4d",
                    "parent_id": "t1_gxefouw",
                    "score": 3,
                    "created_utc": 1620492417.0,
                    "replies": [
                        {
                            "body": "The best depiction is in the Forest of Death when Sasuke and Sakura see themselves getting headshotted from a couple kunai and then Sasuke puked",
                            "author": "whitey-ofwgkta",
                            "id": "gxeparv",
                            "parent_id": "t1_gxeit4d",
                            "score": 3,
                            "created_utc": 1620495556.0,
                            "replies": []
                        },
                        {
                            "body": "Both",
                            "author": "FeelingPrettyChill",
                            "id": "gxeizfh",
                            "parent_id": "t1_gxeit4d",
                            "score": 1,
                            "created_utc": 1620492504.0,
                            "replies": [
                                {
                                    "body": "I just looked up Orochimaru’s “killer intent” and it’s hard to understand. I guess it’s just sort of a terrifying gengutsu or something.",
                                    "author": "Vnecktrev09",
                                    "id": "gxeoblw",
                                    "parent_id": "t1_gxeizfh",
                                    "score": 2,
                                    "created_utc": 1620495080.0,
                                    "replies": [
                                        {
                                            "body": "Not even a genjutsu. It's just pure, lethal, killing intent. Its more of an anime trope than anything, just done incredibly effectively",
                                            "author": "silverx2000",
                                            "id": "gxeoymp",
                                            "parent_id": "t1_gxeoblw",
                                            "score": 3,
                                            "created_utc": 1620495391.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve been wondering this too.",
            "author": "FeelingPrettyChill",
            "id": "gxhu31t",
            "parent_id": "t1_gxet6l5",
            "score": 2,
            "created_utc": 1620566726.0,
            "replies": []
        },
        {
            "body": "Orochimaru took down the third Hokage. That and Tsunade gave him a beating and he looked like he barely felt much from it.\n\nHow is he \"not much of a threat\" ?",
            "author": null,
            "id": "gxdsvv3",
            "parent_id": "t1_gxdp3lh",
            "score": 12,
            "created_utc": 1620478657.0,
            "replies": []
        },
        {
            "body": "Did.............. did you just say Boruto is better than.......... aight imma head out",
            "author": "howabout24",
            "id": "gxdqj38",
            "parent_id": "t1_gxdp3lh",
            "score": 4,
            "created_utc": 1620477066.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gxdvbzj",
                    "parent_id": "t1_gxdqj38",
                    "score": 9,
                    "created_utc": 1620480186.0,
                    "replies": [
                        {
                            "body": "Oof I suppose my brain just inserted an as. I can feel my reading comprehension falling",
                            "author": "howabout24",
                            "id": "gxdvf8x",
                            "parent_id": "t1_gxdvbzj",
                            "score": 2,
                            "created_utc": 1620480243.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gxdvm1j",
                                    "parent_id": "t1_gxdvf8x",
                                    "score": 1,
                                    "created_utc": 1620480360.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All with his arms sealed until he brought back the Hokage.",
            "author": "danceswithdux",
            "id": "gxdve9m",
            "parent_id": "t1_gxdu9qg",
            "score": 109,
            "created_utc": 1620480227.0,
            "replies": []
        },
        {
            "body": "I will say, if Jiraiya was fighting to kill Naruto I think he wouldnt have taken such a hit.",
            "author": "RickyNixon",
            "id": "gxeczo3",
            "parent_id": "t1_gxdu9qg",
            "score": 68,
            "created_utc": 1620489551.0,
            "replies": [
                {
                    "body": "You also have to take into account that Naruto would’ve kept getting more mad and unleashing more tails like he did against Pain",
                    "author": "FalloutLover7",
                    "id": "gxep88x",
                    "parent_id": "t1_gxeczo3",
                    "score": 27,
                    "created_utc": 1620495522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, you misinterpret strength and atmosphere, they gave off this scary vibe and their strength was not what produced this, it was their motives etc.",
            "author": "Ziggy_the_third",
            "id": "gxe14s4",
            "parent_id": "t1_gxdu9qg",
            "score": 42,
            "created_utc": 1620483464.0,
            "replies": [
                {
                    "body": "The fact that I started watching Naruto after I finished Banana Fish meant that Orochimaru's obsession with Sasuke was setting off alarm bells in my head from day one.",
                    "author": "HollyTheMage",
                    "id": "gxh1u4g",
                    "parent_id": "t1_gxe14s4",
                    "score": 1,
                    "created_utc": 1620542477.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He didn’t really hold his own so much as not die, which is the kind of his whole schtick. Naruto was bullying him right up until Orochimaru used the Grass Longsword, which didn’t really hurt Naruto anyway.",
            "author": "American_Madman",
            "id": "gxee4qu",
            "parent_id": "t1_gxdu9qg",
            "score": 7,
            "created_utc": 1620490105.0,
            "replies": [
                {
                    "body": "He had his arms sealed...",
                    "author": "Crocodile_raper",
                    "id": "gxehtp1",
                    "parent_id": "t1_gxee4qu",
                    "score": 6,
                    "created_utc": 1620491929.0,
                    "replies": [
                        {
                            "body": "Yeah, and having his arms sealed lead to him getting bullied pretty hard. Not saying he wasn’t weakened, just that he didn’t really hold his own.",
                            "author": "American_Madman",
                            "id": "gxeocq7",
                            "parent_id": "t1_gxehtp1",
                            "score": 6,
                            "created_utc": 1620495095.0,
                            "replies": [
                                {
                                    "body": "I'm only at season 8 on Netflix India, so all these happen in the upcoming seasons? Netflix India has only 9 seasons.",
                                    "author": "lockkheart",
                                    "id": "gxeyyh7",
                                    "parent_id": "t1_gxeocq7",
                                    "score": 2,
                                    "created_utc": 1620500267.0,
                                    "replies": [
                                        {
                                            "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
                                            "author": "Majoranza",
                                            "id": "gxf28jv",
                                            "parent_id": "t1_gxeyyh7",
                                            "score": 5,
                                            "created_utc": 1620501926.0,
                                            "replies": [
                                                {
                                                    "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                                                    "author": "American_Madman",
                                                    "id": "gxfhcsj",
                                                    "parent_id": "t1_gxf28jv",
                                                    "score": 2,
                                                    "created_utc": 1620509617.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
                                            "author": "American_Madman",
                                            "id": "gxffle7",
                                            "parent_id": "t1_gxeyyh7",
                                            "score": 2,
                                            "created_utc": 1620508694.0,
                                            "replies": [
                                                {
                                                    "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                                                    "author": "lockkheart",
                                                    "id": "gxg70bd",
                                                    "parent_id": "t1_gxffle7",
                                                    "score": 2,
                                                    "created_utc": 1620523200.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
                                            "author": "Terminal_Monk",
                                            "id": "gxgqsiq",
                                            "parent_id": "t1_gxeyyh7",
                                            "score": 2,
                                            "created_utc": 1620534477.0,
                                            "replies": [
                                                {
                                                    "body": "I guess I'll have to go the other route :)",
                                                    "author": "lockkheart",
                                                    "id": "gxgylbj",
                                                    "parent_id": "t1_gxgqsiq",
                                                    "score": 1,
                                                    "created_utc": 1620539776.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                                                    "author": "lockkheart",
                                                    "id": "gxilqg1",
                                                    "parent_id": "t1_gxgqsiq",
                                                    "score": 1,
                                                    "created_utc": 1620581054.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thoughts were more about the atmosphere, and not really strength related, part 1 Itachi wasn't scary just because he was strong, but the way he used his strength was scary, and types of moves he was employing. It was the personalities we saw more than their strength.",
            "author": "Ziggy_the_third",
            "id": "gxdsi1p",
            "parent_id": "t1_gxds2m9",
            "score": 128,
            "created_utc": 1620478399.0,
            "replies": [
                {
                    "body": "Yeah I can agree there. Itachi oozed this aura of cold, calculated genius killer. No wasted movements, no wasted words, just pure lethality.",
                    "author": "Agorbs",
                    "id": "gxdsx3u",
                    "parent_id": "t1_gxdsi1p",
                    "score": 90,
                    "created_utc": 1620478680.0,
                    "replies": [
                        {
                            "body": "The Itachi vs Kakashi/Asuma/Kurama fight made it seem like the level of ninja that Konoha had was no match for Itachi. You also vaguely knew that 8 more, and assumed they were all like Itachi.\n\nOnce we skip forward, Naruto always seemed capable of protecting himself, and the rest of the Akatsuki were reckless psychos. Only a few even remotely gave the same vibes.",
                            "author": "Harden-Soul",
                            "id": "gxekvdy",
                            "parent_id": "t1_gxdsx3u",
                            "score": 28,
                            "created_utc": 1620493427.0,
                            "replies": [
                                {
                                    "body": "Well yeah, but I’d wager there’s very few Konoha shinobi that could take down anyone in Akatsuki regardless. \n\n\nThe main reason Kakuzu and Hidan got killed was because Shikamaru had god tier planning and even then it was pretty close. If Naruto didn’t roll in with his brand new plot device no jutsu...",
                                    "author": "Agorbs",
                                    "id": "gxenbnk",
                                    "parent_id": "t1_gxekvdy",
                                    "score": 17,
                                    "created_utc": 1620494595.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "They also made Itachi seem a ton more powerful because we had sasuke, who we all felt was pretty damn strong, which is always in fear of Itachi. Then when they finally meet, as expected, Itachi destroys him. Overall Itachi was arguably the big scary guy in pre skip Naruto",
                    "author": "Metalona",
                    "id": "gxe208o",
                    "parent_id": "t1_gxdsi1p",
                    "score": 47,
                    "created_utc": 1620483933.0,
                    "replies": [
                        {
                            "body": "Yeah. Orochimaru was scary, but itachi was more scary. The cold calculated genius psycho killer",
                            "author": null,
                            "id": "gxe2hw7",
                            "parent_id": "t1_gxe208o",
                            "score": 31,
                            "created_utc": 1620484197.0,
                            "replies": [
                                {
                                    "body": "Orochimaru was afraid of Itachi which tells you everything you need to know about him. At the time he was introduced, Orochimaru had killed 2 Kage and traumatized an entire generation of kids. Then when talking about Itachi he was like “Nah fuck that shit he’s way too strong. I’ll gladly take on two whole nations, but not this teenager with the eyes”",
                                    "author": "SeductivePillowcase",
                                    "id": "gxki0kg",
                                    "parent_id": "t1_gxe2hw7",
                                    "score": 7,
                                    "created_utc": 1620617029.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Also he fucking destroyed Kakashi, who we all saw as unbeatable up to this point.",
                            "author": "ItzDrSeuss",
                            "id": "gxe7x5d",
                            "parent_id": "t1_gxe208o",
                            "score": 30,
                            "created_utc": 1620487031.0,
                            "replies": [
                                {
                                    "body": "He didn't even seem to be trying against the lead Jonin. And the idea was that this was just the beginning. We thought the other Akatsuki members would be just as strong, but only Pain was really even close.",
                                    "author": "Harden-Soul",
                                    "id": "gxel5jc",
                                    "parent_id": "t1_gxe7x5d",
                                    "score": 13,
                                    "created_utc": 1620493561.0,
                                    "replies": [
                                        {
                                            "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
                                            "author": "ItzDrSeuss",
                                            "id": "gxevnld",
                                            "parent_id": "t1_gxel5jc",
                                            "score": 9,
                                            "created_utc": 1620498635.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
                                            "author": "SeductivePillowcase",
                                            "id": "gxkjan1",
                                            "parent_id": "t1_gxel5jc",
                                            "score": 1,
                                            "created_utc": 1620617837.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Suigetsu may not be as strong as Orochimaru, but he’s still strong AF. Dealing with genin like Boruto’s friends is never going to a problem for someone of his level. He’s the same level as Karin or higher and she easily outplayed multiple Jonins like Yamato and the others observing the site and Muggi.",
            "author": "Supernova-581",
            "id": "gxdsf9c",
            "parent_id": "t1_gxds2m9",
            "score": 45,
            "created_utc": 1620478348.0,
            "replies": [
                {
                    "body": "People underappreciated suigetsu’s strength, the man tanked a bijuudama and recovered after maybe a week or two",
                    "author": "isaaceyfish",
                    "id": "gxdzgfp",
                    "parent_id": "t1_gxdsf9c",
                    "score": 40,
                    "created_utc": 1620482555.0,
                    "replies": [
                        {
                            "body": "The man was boxing with the Hachibii.",
                            "author": null,
                            "id": "gxekrgz",
                            "parent_id": "t1_gxdzgfp",
                            "score": 9,
                            "created_utc": 1620493375.0,
                            "replies": [
                                {
                                    "body": "Straight facts, not to mention barely anything works on him because he’s made of water",
                                    "author": "isaaceyfish",
                                    "id": "gxem3t7",
                                    "parent_id": "t1_gxekrgz",
                                    "score": 8,
                                    "created_utc": 1620494021.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Considering Orochimaru's ability to body swap, they could have come up with a less powerful being than a god, and he could have taken their body.",
            "author": "Ziggy_the_third",
            "id": "gxet2fl",
            "parent_id": "t1_gxeptrt",
            "score": 4,
            "created_utc": 1620497393.0,
            "replies": [
                {
                    "body": "Imagine the fucking mindgames he could have played, kicking the shit out of the people Naruto cares about while wearing the stolen faces of his dead loved ones. \n\nThat would have been absolutely brutal.",
                    "author": "HollyTheMage",
                    "id": "gxkd08r",
                    "parent_id": "t1_gxet2fl",
                    "score": 3,
                    "created_utc": 1620614011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do u mean u suspect he let sasuke defeat him to push him to his peak? That’s literally what happened in the story.",
            "author": "Smitten130",
            "id": "gxenu72",
            "parent_id": "t1_gxecrf2",
            "score": 3,
            "created_utc": 1620494845.0,
            "replies": [
                {
                    "body": "Well I have an alternate head cannon theory that in the event sasuke didn't live up to itachi's expectations or died during their fight then that would only leave itachi with the option of taking his eyes.\n\nLike imagine if sasuke died so many times what was itachi going to do? Just go blind? Fight obito? \n\nIt's not clear but if itachi's plan had failed at even a single part then his only option would be to take sasuke's  eyes and finish the akatsuki arc himself. Sasuke died to zabuza? Tough fucking luck.\n\nI suppose he could have used the eye he confiscated from shitsuge or whatever his name was but I don't think it would have helped much.",
                    "author": "GoodboyGotter",
                    "id": "gxeqjn5",
                    "parent_id": "t1_gxenu72",
                    "score": 3,
                    "created_utc": 1620496169.0,
                    "replies": [
                        {
                            "body": "Hmm, interesting! I’ve always thought that itachi was already on the verge of death and wanted sasuke to kill him for personal growth.",
                            "author": "Smitten130",
                            "id": "gxeqxjq",
                            "parent_id": "t1_gxeqjn5",
                            "score": 2,
                            "created_utc": 1620496351.0,
                            "replies": [
                                {
                                    "body": "He was quite frail but still powerful.\n\nMy head canon \"what if?\" Is trying to explain what the fuck itachi plans to do if sasuke died. It really changes everything. It's not like itachi was holding his hand after he left the village or protecting him. His entire plan when you think about it was \"sasuke tragedy, sasuke get strong, sasuke kill me get stronger,\" but what if sasuke just fucking died at any point? Like itachi would have to take his eyes and come up with a new plan and with greater urgency.",
                                    "author": "GoodboyGotter",
                                    "id": "gxerh6c",
                                    "parent_id": "t1_gxeqxjq",
                                    "score": 2,
                                    "created_utc": 1620496613.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're saying his OP, prefacing it with he's going blind--and despite us knowing he is literally dying. He is literally a glass cannon. He is literally a balanced power character.\n\nThis is the kind of balancing more characters needed. Naruto and Sasuke being the most OP in the bunch, being able to just learn Jutsu on the fly like no one's business.",
            "author": "i_Got_Rocks",
            "id": "gxeq2kn",
            "parent_id": "t1_gxecrf2",
            "score": 1,
            "created_utc": 1620495935.0,
            "replies": [
                {
                    "body": "Yeah that's why I like arc 2 itachi better than one. More depth.\n\nI only enjoy borutos generation for Saradas potential and the fear/knowledge she might have to take her father's eyes to peak power but with it tragedy. Unfortunately the writer is more concerned with some karma mark garbage and just making the entire previous lore stupid and unimportant",
                    "author": "GoodboyGotter",
                    "id": "gxeqxv6",
                    "parent_id": "t1_gxeq2kn",
                    "score": 1,
                    "created_utc": 1620496355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This! And just to piggy back, this exact feeling also helped make it feel even deeper/heavier when Sasuke began spiraling towards hatred more and more after \"beating\" Itachi and chasing down Danzou/meeting Naruto after he became a Sage. Karin specifically pointed out how dark and cold Sasuke was becoming too. That face when he stabbed thru her was chilling..",
            "author": "CelticDK",
            "id": "gxe52o9",
            "parent_id": "t1_gxdwtbd",
            "score": 18,
            "created_utc": 1620485555.0,
            "replies": [
                {
                    "body": "Follow up to that specific mention of Karin, the fact that Sasuke essentially discarded her after she had outlived her usefulness to him was especially disconcerting because I feel like it parallels the way Danzo would use and throw away his subordinates or really anyone in order to accomplish his goals. \n\nAlso Karin's fucked up backstory makes that scene so much more heartbreaking in retrospect.",
                    "author": "HollyTheMage",
                    "id": "gxh2n4g",
                    "parent_id": "t1_gxe52o9",
                    "score": 1,
                    "created_utc": 1620543160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is what makes him so menacing really. He doesn’t have some grandiose vision for the world. He just wants immortality and  perfection for himself and himself alone. It makes him all the more scary because he isn’t bound by any ideology or code",
            "author": "Calidore_X",
            "id": "gxe0x8p",
            "parent_id": "t1_gxdz3cm",
            "score": 30,
            "created_utc": 1620483350.0,
            "replies": []
        },
        {
            "body": "What made the early arcs awesome was that there was stuff going on--the chuunin exams--and there was world crap going on, Orochimaru and other nations with different goals.\n\nIt made the world feel so big and real. As the series goes on, it becomes more and more about Naruto. It doesn't feel like a big world anymore, it feels like a Naruto world. And the story suffers because of it.",
            "author": "i_Got_Rocks",
            "id": "gxesh5g",
            "parent_id": "t1_gxdyeqz",
            "score": 9,
            "created_utc": 1620497105.0,
            "replies": []
        },
        {
            "body": "Jesus, Voldemort, Orochimaru. \n\nBack to life gang.",
            "author": "brobronn17",
            "id": "gxe4uh0",
            "parent_id": "t1_gxe0npj",
            "score": 18,
            "created_utc": 1620485437.0,
            "replies": [
                {
                    "body": "Voldemort and Orochimaru have so many similarities that it's uncanny. Both snakey sneks, both obsessed with immortality, both passed up for a position they felt they deserved by their mentor, who they then tried to kill.",
                    "author": "WanderingToTheEnd",
                    "id": "gxejf5a",
                    "parent_id": "t1_gxe4uh0",
                    "score": 10,
                    "created_utc": 1620492718.0,
                    "replies": [
                        {
                            "body": "Yeah, makes me wonder if it's some kind of a biblical archetype. I wasn't raised with religion but sometimes I notice these similarities and wish I knew a bit more about the bible and stuff so I could be like \"Aha! That's a Cain and Abel reference!!\" I mean I guess the snake itself is a biblical reference and the idea that knowledge can corrupt?",
                            "author": "brobronn17",
                            "id": "gxeuxrp",
                            "parent_id": "t1_gxejf5a",
                            "score": 3,
                            "created_utc": 1620498293.0,
                            "replies": [
                                {
                                    "body": "It is, but in Orochimaru's case I think he's primarily based off of a Japanese myth involving a snake.",
                                    "author": "WanderingToTheEnd",
                                    "id": "gxewufd",
                                    "parent_id": "t1_gxeuxrp",
                                    "score": 2,
                                    "created_utc": 1620499213.0,
                                    "replies": [
                                        {
                                            "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
                                            "author": "brobronn17",
                                            "id": "gxextdv",
                                            "parent_id": "t1_gxewufd",
                                            "score": 3,
                                            "created_utc": 1620499694.0,
                                            "replies": [
                                                {
                                                    "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                                                    "author": "HollyTheMage",
                                                    "id": "gxh387f",
                                                    "parent_id": "t1_gxextdv",
                                                    "score": 3,
                                                    "created_utc": 1620543675.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">both passed up for a position they felt they deserved by their mentor, who they then tried to kill.\n\nTbf Voldemort only wanted the role some could be closer to control the Basilisk, pick on half bloods and muggleborns and recruit bigoted purebloods to his cause",
                            "author": "KingofTrollenheim",
                            "id": "gxi78zm",
                            "parent_id": "t1_gxejf5a",
                            "score": 1,
                            "created_utc": 1620573878.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "NeverDieGangGang",
                    "author": "i_Got_Rocks",
                    "id": "gxesiw4",
                    "parent_id": "t1_gxe4uh0",
                    "score": 1,
                    "created_utc": 1620497128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao yes",
            "author": "Silent_Sparrow02",
            "id": "gxe5owo",
            "parent_id": "t1_gxe4oer",
            "score": 3,
            "created_utc": 1620485878.0,
            "replies": []
        },
        {
            "body": "One of my reactions to stressful situations is to use humor as a coping mechanism, so when Pain said the line \"this world shall know pain\" I just said \"lmao kinky\" and then watched in abject horror as he fucking obliterated the entire village.",
            "author": "HollyTheMage",
            "id": "gxh2vdq",
            "parent_id": "t1_gxess7y",
            "score": 1,
            "created_utc": 1620543362.0,
            "replies": [
                {
                    "body": "*Everyone dying around you*\n\nPAIN: ...know...Pain. *Akatsuki theme song start*\n\n/u/HollyTheMage : Oh, yeashhhh, Daddy, stomp. ON. MEH!\n\n*Akatsuki theme song goes \"Ouu-ah, oouu-ah\"*\n\n/u/HollyTheMage : YES! YES!!\n\n*Village civilians start to die. Ramen Noodles holding his dead wife in his arms.*\n\n/u/HollyTheMage : OH, no, not like that. No. What is this?! DO SOMETHING SOMEONE! *hunches over on the ground* NARUTOOOOOOOOOOO!",
                    "author": "i_Got_Rocks",
                    "id": "gxhy64i",
                    "parent_id": "t1_gxh2vdq",
                    "score": 2,
                    "created_utc": 1620569214.0,
                    "replies": [
                        {
                            "body": "Bold of you to assume I would be in the right state of mind to even scream for help.\n\nActually if I keep it up with the obnoxious innuendos maybe the Six Paths will get annoyed with me and start targeting me specifically rather than attacking civilians at random. Hopefully I'll be able to distract them just long enough for some of the non-combatants in the area to be evacuated to the bunkers hidden in the Hokage mountain.\n\nShit, I could probably come up with a comedy routine for each of the Six Paths. For the Animal Path, it will be Pokemon jokes. For the Asura Path, it will be Metal Gear memes. If the Naraka Path pulls out the King of Hell, you can be sure I'll be making Doom Eternal and Devil May Cry references. For the Preta Path, I might humorously refer to them as Dazai Osamu from Bungou Stray Dogs. If the Human Path tries to rip my soul out I'll start singing one of the opening themes of Fullmetal Alchemist as loudly and horribly as I possibly can.\n\nThey probably won't understand any of my references, but my reactions would be unpredictable enough to throw them off their rhythm. All the time they spend bothering to try and parse out some semblance of meaning from my bullshit in order to formulate a more effective argument against my worldviews once it comes time for Pain to lecture me is time they could have otherwise spent murdering innocent people.\n\nEventually they'll get tired of trying to kill me and just send the main Pain over to deal with my shit.\n\nWatch me get pinned down to the ground with a bunch of rods impaled through my limbs like Naruto but every time Pain starts monologuing I just keep interrupting him to make penetration and bondage jokes related to the current situation I am in at the moment. Hell, I'll probably get my head smashed in, but if it buys a little more time for reinforcements to arrive and help evacuate the wounded from ground zero, so be it. \n\nI'm so goddamn obnoxious that most of the village probably wouldn't mind seeing me wiped off the face of the earth, so I won't have to worry about anyone needlessly sacrificing themselves in a suicide mission to save my worthless ass, only to have their memory insulted when I react by making a vine reference to cope with the trauma of witnessing their death.\n\nEventually Pain calls Konan over to try and talk to me because nothing else is working.\n\nIt goes about as well as you'd expect.\n\nNobody:\n\nNot even Danzo:\n\nMe: [https://youtu.be/-sMQpWCNTQw](https://youtu.be/-sMQpWCNTQw)",
                            "author": "HollyTheMage",
                            "id": "gxjh17g",
                            "parent_id": "t1_gxhy64i",
                            "score": 2,
                            "created_utc": 1620596218.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get where he's coming from that tongue game would *crazy*",
            "author": "whitey-ofwgkta",
            "id": "gxeot11",
            "parent_id": "t1_gxef9zj",
            "score": 9,
            "created_utc": 1620495316.0,
            "replies": [
                {
                    "body": "Someone understands 😏🤦🏾‍♂️😂😂",
                    "author": "Za106",
                    "id": "gxfbfjz",
                    "parent_id": "t1_gxeot11",
                    "score": 4,
                    "created_utc": 1620506579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What? I’m deadass 😩😩",
            "author": "Za106",
            "id": "gxej6up",
            "parent_id": "t1_gxef9zj",
            "score": 6,
            "created_utc": 1620492606.0,
            "replies": [
                {
                    "body": "ok then",
                    "author": "FeelingPrettyChill",
                    "id": "gxej93l",
                    "parent_id": "t1_gxej6up",
                    "score": 3,
                    "created_utc": 1620492636.0,
                    "replies": [
                        {
                            "body": "😂😂",
                            "author": "Za106",
                            "id": "gxek9re",
                            "parent_id": "t1_gxej93l",
                            "score": 1,
                            "created_utc": 1620493134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fuck yea. I was hurt like homie how could u say that to me XD",
            "author": "Ays_500",
            "id": "gxefyab",
            "parent_id": "t1_gxefc6h",
            "score": 5,
            "created_utc": 1620490998.0,
            "replies": []
        },
        {
            "body": "Well idk about that, Itachi wrecked prime Orochimaru at like 13, and I don’t think Orochimaru could beat Minato either but he’d definitely be a beast",
            "author": "LazyBriton",
            "id": "gxegq7z",
            "parent_id": "t1_gxedgdn",
            "score": 5,
            "created_utc": 1620491383.0,
            "replies": [
                {
                    "body": "Itachi could have probably beat any of the akatsuki except maybe--MAYBE--nagato though. He is a league of his own. His genjitsu is so powerful it can warp reality and he could kill his entire clan which not even the first 2 kage or other clans seemed competent enough to accomplish with the entire history of the uchiha. \n\nHe is much in a league of his own and we never see madara or obito even flex such a level of mastery over the sharingan with all their power and skill. \n\nSo itachi is in a league uniquely of his own and his friend he took the eye of and put in a bird. \n\nOrochimaru though is probably equal to or stronger than Jariayah at his peak and if he didn't body swap he could have learned snake sage which Mitsuki has already shown to be op and somewhat mysterious in how it works relative to say toad sage form. I would even put peak orochimaru wit sage form higher than kakashi theoretically. Something that was little explored was all the forbidden and new jitsu, novel or forbidden, orochimaru invented or discovered. A better writer would have flexed his strengths like in part 1. Instead we get orochimaru the cripple bitch who dies in 2 and orochimaru the dude who does nothing in Boruto",
                    "author": "GoodboyGotter",
                    "id": "gxeifna",
                    "parent_id": "t1_gxegq7z",
                    "score": 1,
                    "created_utc": 1620492232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn, not bad. I'd watch this over the alternate universe story that played out during Tsunade's dream arc in the Infinite Tsukuyomi.",
            "author": "HollyTheMage",
            "id": "gxkeska",
            "parent_id": "t1_gxgda64",
            "score": 2,
            "created_utc": 1620615063.0,
            "replies": [
                {
                    "body": "There's so much potential for stories that were never told in Naruto because it focused too heavily on Naruto...gaining another tail or something.\n\nI have a story in mind where Sakura tests her might and goes to find Sasuke alone, when her training with Tsunade is finished, but Naruto is still training. \n\nLong story short: She manages to *almost* beat Sasuke and bring him back due to her advantage of good Chakra control and good wits. She manages to outwit almost every trick Sasuke tries because she realizes that her biggest weakness will be her love for him. And it's in this fight that she realizes Sasuke won't change, and she gives herself the worth she deserves and that life isn't about her--but about the village and all that mushy stuff that she never saw because of Sasuke.\n\nSakura foils so much of Sasuke's tactics so Sasuke leaves because Sakura is able to bluff she has stronger attacks, but in reality, she is drained and out of options. Sasuke is weakened and is not willing to risk it because his bigger goal is to destroy the Leaf village, but he is actually scared that Sakura might be even more powerful than she lets on.\n\nThere's a link between her fight and the training she does with Tsunade where Tsunade forces her to think and not just punch blast everything. The emotional weight of the fight is about Sakura overcoming her own childish love for a guy that isn't interested in redemption.\n\nThis would later resonate again when Sasuke leaves as Orochimaru escapes too. \n\nIn the final arc when they defeat Sasuke, Naruto buries his boyfriend, and Sakura buries a stranger--no longer in love with him, but grateful their paths crossed.  Naruto cries for Sasuke. Sakura cries for the end of a clan. Naruto tells her that of all the Ninja he knows, she is the only one that could stand a chance against him, solely by using her wits. She tells him she knows. Her role at the end, would probably be head of Ambu. Though she's a great medical Ninja, she doesn't want to heal allies when they're broken, she wants to prevent the tragedies from happening in the first place.",
                    "author": "i_Got_Rocks",
                    "id": "gxkh6zd",
                    "parent_id": "t1_gxkeska",
                    "score": 2,
                    "created_utc": 1620616516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh snap so they literally saw a vision of their death or simply that they felt the fear of death in that moment?",
            "author": "Vnecktrev09",
            "id": "gxeit4d",
            "parent_id": "t1_gxefouw",
            "score": 3,
            "created_utc": 1620492417.0,
            "replies": [
                {
                    "body": "The best depiction is in the Forest of Death when Sasuke and Sakura see themselves getting headshotted from a couple kunai and then Sasuke puked",
                    "author": "whitey-ofwgkta",
                    "id": "gxeparv",
                    "parent_id": "t1_gxeit4d",
                    "score": 3,
                    "created_utc": 1620495556.0,
                    "replies": []
                },
                {
                    "body": "Both",
                    "author": "FeelingPrettyChill",
                    "id": "gxeizfh",
                    "parent_id": "t1_gxeit4d",
                    "score": 1,
                    "created_utc": 1620492504.0,
                    "replies": [
                        {
                            "body": "I just looked up Orochimaru’s “killer intent” and it’s hard to understand. I guess it’s just sort of a terrifying gengutsu or something.",
                            "author": "Vnecktrev09",
                            "id": "gxeoblw",
                            "parent_id": "t1_gxeizfh",
                            "score": 2,
                            "created_utc": 1620495080.0,
                            "replies": [
                                {
                                    "body": "Not even a genjutsu. It's just pure, lethal, killing intent. Its more of an anime trope than anything, just done incredibly effectively",
                                    "author": "silverx2000",
                                    "id": "gxeoymp",
                                    "parent_id": "t1_gxeoblw",
                                    "score": 3,
                                    "created_utc": 1620495391.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gxdvbzj",
            "parent_id": "t1_gxdqj38",
            "score": 9,
            "created_utc": 1620480186.0,
            "replies": [
                {
                    "body": "Oof I suppose my brain just inserted an as. I can feel my reading comprehension falling",
                    "author": "howabout24",
                    "id": "gxdvf8x",
                    "parent_id": "t1_gxdvbzj",
                    "score": 2,
                    "created_utc": 1620480243.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gxdvm1j",
                            "parent_id": "t1_gxdvf8x",
                            "score": 1,
                            "created_utc": 1620480360.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You also have to take into account that Naruto would’ve kept getting more mad and unleashing more tails like he did against Pain",
            "author": "FalloutLover7",
            "id": "gxep88x",
            "parent_id": "t1_gxeczo3",
            "score": 27,
            "created_utc": 1620495522.0,
            "replies": []
        },
        {
            "body": "The fact that I started watching Naruto after I finished Banana Fish meant that Orochimaru's obsession with Sasuke was setting off alarm bells in my head from day one.",
            "author": "HollyTheMage",
            "id": "gxh1u4g",
            "parent_id": "t1_gxe14s4",
            "score": 1,
            "created_utc": 1620542477.0,
            "replies": []
        },
        {
            "body": "He had his arms sealed...",
            "author": "Crocodile_raper",
            "id": "gxehtp1",
            "parent_id": "t1_gxee4qu",
            "score": 6,
            "created_utc": 1620491929.0,
            "replies": [
                {
                    "body": "Yeah, and having his arms sealed lead to him getting bullied pretty hard. Not saying he wasn’t weakened, just that he didn’t really hold his own.",
                    "author": "American_Madman",
                    "id": "gxeocq7",
                    "parent_id": "t1_gxehtp1",
                    "score": 6,
                    "created_utc": 1620495095.0,
                    "replies": [
                        {
                            "body": "I'm only at season 8 on Netflix India, so all these happen in the upcoming seasons? Netflix India has only 9 seasons.",
                            "author": "lockkheart",
                            "id": "gxeyyh7",
                            "parent_id": "t1_gxeocq7",
                            "score": 2,
                            "created_utc": 1620500267.0,
                            "replies": [
                                {
                                    "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
                                    "author": "Majoranza",
                                    "id": "gxf28jv",
                                    "parent_id": "t1_gxeyyh7",
                                    "score": 5,
                                    "created_utc": 1620501926.0,
                                    "replies": [
                                        {
                                            "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                                            "author": "American_Madman",
                                            "id": "gxfhcsj",
                                            "parent_id": "t1_gxf28jv",
                                            "score": 2,
                                            "created_utc": 1620509617.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
                                    "author": "American_Madman",
                                    "id": "gxffle7",
                                    "parent_id": "t1_gxeyyh7",
                                    "score": 2,
                                    "created_utc": 1620508694.0,
                                    "replies": [
                                        {
                                            "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                                            "author": "lockkheart",
                                            "id": "gxg70bd",
                                            "parent_id": "t1_gxffle7",
                                            "score": 2,
                                            "created_utc": 1620523200.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
                                    "author": "Terminal_Monk",
                                    "id": "gxgqsiq",
                                    "parent_id": "t1_gxeyyh7",
                                    "score": 2,
                                    "created_utc": 1620534477.0,
                                    "replies": [
                                        {
                                            "body": "I guess I'll have to go the other route :)",
                                            "author": "lockkheart",
                                            "id": "gxgylbj",
                                            "parent_id": "t1_gxgqsiq",
                                            "score": 1,
                                            "created_utc": 1620539776.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                                            "author": "lockkheart",
                                            "id": "gxilqg1",
                                            "parent_id": "t1_gxgqsiq",
                                            "score": 1,
                                            "created_utc": 1620581054.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I can agree there. Itachi oozed this aura of cold, calculated genius killer. No wasted movements, no wasted words, just pure lethality.",
            "author": "Agorbs",
            "id": "gxdsx3u",
            "parent_id": "t1_gxdsi1p",
            "score": 90,
            "created_utc": 1620478680.0,
            "replies": [
                {
                    "body": "The Itachi vs Kakashi/Asuma/Kurama fight made it seem like the level of ninja that Konoha had was no match for Itachi. You also vaguely knew that 8 more, and assumed they were all like Itachi.\n\nOnce we skip forward, Naruto always seemed capable of protecting himself, and the rest of the Akatsuki were reckless psychos. Only a few even remotely gave the same vibes.",
                    "author": "Harden-Soul",
                    "id": "gxekvdy",
                    "parent_id": "t1_gxdsx3u",
                    "score": 28,
                    "created_utc": 1620493427.0,
                    "replies": [
                        {
                            "body": "Well yeah, but I’d wager there’s very few Konoha shinobi that could take down anyone in Akatsuki regardless. \n\n\nThe main reason Kakuzu and Hidan got killed was because Shikamaru had god tier planning and even then it was pretty close. If Naruto didn’t roll in with his brand new plot device no jutsu...",
                            "author": "Agorbs",
                            "id": "gxenbnk",
                            "parent_id": "t1_gxekvdy",
                            "score": 17,
                            "created_utc": 1620494595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They also made Itachi seem a ton more powerful because we had sasuke, who we all felt was pretty damn strong, which is always in fear of Itachi. Then when they finally meet, as expected, Itachi destroys him. Overall Itachi was arguably the big scary guy in pre skip Naruto",
            "author": "Metalona",
            "id": "gxe208o",
            "parent_id": "t1_gxdsi1p",
            "score": 47,
            "created_utc": 1620483933.0,
            "replies": [
                {
                    "body": "Yeah. Orochimaru was scary, but itachi was more scary. The cold calculated genius psycho killer",
                    "author": null,
                    "id": "gxe2hw7",
                    "parent_id": "t1_gxe208o",
                    "score": 31,
                    "created_utc": 1620484197.0,
                    "replies": [
                        {
                            "body": "Orochimaru was afraid of Itachi which tells you everything you need to know about him. At the time he was introduced, Orochimaru had killed 2 Kage and traumatized an entire generation of kids. Then when talking about Itachi he was like “Nah fuck that shit he’s way too strong. I’ll gladly take on two whole nations, but not this teenager with the eyes”",
                            "author": "SeductivePillowcase",
                            "id": "gxki0kg",
                            "parent_id": "t1_gxe2hw7",
                            "score": 7,
                            "created_utc": 1620617029.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Also he fucking destroyed Kakashi, who we all saw as unbeatable up to this point.",
                    "author": "ItzDrSeuss",
                    "id": "gxe7x5d",
                    "parent_id": "t1_gxe208o",
                    "score": 30,
                    "created_utc": 1620487031.0,
                    "replies": [
                        {
                            "body": "He didn't even seem to be trying against the lead Jonin. And the idea was that this was just the beginning. We thought the other Akatsuki members would be just as strong, but only Pain was really even close.",
                            "author": "Harden-Soul",
                            "id": "gxel5jc",
                            "parent_id": "t1_gxe7x5d",
                            "score": 13,
                            "created_utc": 1620493561.0,
                            "replies": [
                                {
                                    "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
                                    "author": "ItzDrSeuss",
                                    "id": "gxevnld",
                                    "parent_id": "t1_gxel5jc",
                                    "score": 9,
                                    "created_utc": 1620498635.0,
                                    "replies": []
                                },
                                {
                                    "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
                                    "author": "SeductivePillowcase",
                                    "id": "gxkjan1",
                                    "parent_id": "t1_gxel5jc",
                                    "score": 1,
                                    "created_utc": 1620617837.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "People underappreciated suigetsu’s strength, the man tanked a bijuudama and recovered after maybe a week or two",
            "author": "isaaceyfish",
            "id": "gxdzgfp",
            "parent_id": "t1_gxdsf9c",
            "score": 40,
            "created_utc": 1620482555.0,
            "replies": [
                {
                    "body": "The man was boxing with the Hachibii.",
                    "author": null,
                    "id": "gxekrgz",
                    "parent_id": "t1_gxdzgfp",
                    "score": 9,
                    "created_utc": 1620493375.0,
                    "replies": [
                        {
                            "body": "Straight facts, not to mention barely anything works on him because he’s made of water",
                            "author": "isaaceyfish",
                            "id": "gxem3t7",
                            "parent_id": "t1_gxekrgz",
                            "score": 8,
                            "created_utc": 1620494021.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine the fucking mindgames he could have played, kicking the shit out of the people Naruto cares about while wearing the stolen faces of his dead loved ones. \n\nThat would have been absolutely brutal.",
            "author": "HollyTheMage",
            "id": "gxkd08r",
            "parent_id": "t1_gxet2fl",
            "score": 3,
            "created_utc": 1620614011.0,
            "replies": []
        },
        {
            "body": "Well I have an alternate head cannon theory that in the event sasuke didn't live up to itachi's expectations or died during their fight then that would only leave itachi with the option of taking his eyes.\n\nLike imagine if sasuke died so many times what was itachi going to do? Just go blind? Fight obito? \n\nIt's not clear but if itachi's plan had failed at even a single part then his only option would be to take sasuke's  eyes and finish the akatsuki arc himself. Sasuke died to zabuza? Tough fucking luck.\n\nI suppose he could have used the eye he confiscated from shitsuge or whatever his name was but I don't think it would have helped much.",
            "author": "GoodboyGotter",
            "id": "gxeqjn5",
            "parent_id": "t1_gxenu72",
            "score": 3,
            "created_utc": 1620496169.0,
            "replies": [
                {
                    "body": "Hmm, interesting! I’ve always thought that itachi was already on the verge of death and wanted sasuke to kill him for personal growth.",
                    "author": "Smitten130",
                    "id": "gxeqxjq",
                    "parent_id": "t1_gxeqjn5",
                    "score": 2,
                    "created_utc": 1620496351.0,
                    "replies": [
                        {
                            "body": "He was quite frail but still powerful.\n\nMy head canon \"what if?\" Is trying to explain what the fuck itachi plans to do if sasuke died. It really changes everything. It's not like itachi was holding his hand after he left the village or protecting him. His entire plan when you think about it was \"sasuke tragedy, sasuke get strong, sasuke kill me get stronger,\" but what if sasuke just fucking died at any point? Like itachi would have to take his eyes and come up with a new plan and with greater urgency.",
                            "author": "GoodboyGotter",
                            "id": "gxerh6c",
                            "parent_id": "t1_gxeqxjq",
                            "score": 2,
                            "created_utc": 1620496613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah that's why I like arc 2 itachi better than one. More depth.\n\nI only enjoy borutos generation for Saradas potential and the fear/knowledge she might have to take her father's eyes to peak power but with it tragedy. Unfortunately the writer is more concerned with some karma mark garbage and just making the entire previous lore stupid and unimportant",
            "author": "GoodboyGotter",
            "id": "gxeqxv6",
            "parent_id": "t1_gxeq2kn",
            "score": 1,
            "created_utc": 1620496355.0,
            "replies": []
        },
        {
            "body": "Follow up to that specific mention of Karin, the fact that Sasuke essentially discarded her after she had outlived her usefulness to him was especially disconcerting because I feel like it parallels the way Danzo would use and throw away his subordinates or really anyone in order to accomplish his goals. \n\nAlso Karin's fucked up backstory makes that scene so much more heartbreaking in retrospect.",
            "author": "HollyTheMage",
            "id": "gxh2n4g",
            "parent_id": "t1_gxe52o9",
            "score": 1,
            "created_utc": 1620543160.0,
            "replies": []
        },
        {
            "body": "Voldemort and Orochimaru have so many similarities that it's uncanny. Both snakey sneks, both obsessed with immortality, both passed up for a position they felt they deserved by their mentor, who they then tried to kill.",
            "author": "WanderingToTheEnd",
            "id": "gxejf5a",
            "parent_id": "t1_gxe4uh0",
            "score": 10,
            "created_utc": 1620492718.0,
            "replies": [
                {
                    "body": "Yeah, makes me wonder if it's some kind of a biblical archetype. I wasn't raised with religion but sometimes I notice these similarities and wish I knew a bit more about the bible and stuff so I could be like \"Aha! That's a Cain and Abel reference!!\" I mean I guess the snake itself is a biblical reference and the idea that knowledge can corrupt?",
                    "author": "brobronn17",
                    "id": "gxeuxrp",
                    "parent_id": "t1_gxejf5a",
                    "score": 3,
                    "created_utc": 1620498293.0,
                    "replies": [
                        {
                            "body": "It is, but in Orochimaru's case I think he's primarily based off of a Japanese myth involving a snake.",
                            "author": "WanderingToTheEnd",
                            "id": "gxewufd",
                            "parent_id": "t1_gxeuxrp",
                            "score": 2,
                            "created_utc": 1620499213.0,
                            "replies": [
                                {
                                    "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
                                    "author": "brobronn17",
                                    "id": "gxextdv",
                                    "parent_id": "t1_gxewufd",
                                    "score": 3,
                                    "created_utc": 1620499694.0,
                                    "replies": [
                                        {
                                            "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                                            "author": "HollyTheMage",
                                            "id": "gxh387f",
                                            "parent_id": "t1_gxextdv",
                                            "score": 3,
                                            "created_utc": 1620543675.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">both passed up for a position they felt they deserved by their mentor, who they then tried to kill.\n\nTbf Voldemort only wanted the role some could be closer to control the Basilisk, pick on half bloods and muggleborns and recruit bigoted purebloods to his cause",
                    "author": "KingofTrollenheim",
                    "id": "gxi78zm",
                    "parent_id": "t1_gxejf5a",
                    "score": 1,
                    "created_utc": 1620573878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "NeverDieGangGang",
            "author": "i_Got_Rocks",
            "id": "gxesiw4",
            "parent_id": "t1_gxe4uh0",
            "score": 1,
            "created_utc": 1620497128.0,
            "replies": []
        },
        {
            "body": "*Everyone dying around you*\n\nPAIN: ...know...Pain. *Akatsuki theme song start*\n\n/u/HollyTheMage : Oh, yeashhhh, Daddy, stomp. ON. MEH!\n\n*Akatsuki theme song goes \"Ouu-ah, oouu-ah\"*\n\n/u/HollyTheMage : YES! YES!!\n\n*Village civilians start to die. Ramen Noodles holding his dead wife in his arms.*\n\n/u/HollyTheMage : OH, no, not like that. No. What is this?! DO SOMETHING SOMEONE! *hunches over on the ground* NARUTOOOOOOOOOOO!",
            "author": "i_Got_Rocks",
            "id": "gxhy64i",
            "parent_id": "t1_gxh2vdq",
            "score": 2,
            "created_utc": 1620569214.0,
            "replies": [
                {
                    "body": "Bold of you to assume I would be in the right state of mind to even scream for help.\n\nActually if I keep it up with the obnoxious innuendos maybe the Six Paths will get annoyed with me and start targeting me specifically rather than attacking civilians at random. Hopefully I'll be able to distract them just long enough for some of the non-combatants in the area to be evacuated to the bunkers hidden in the Hokage mountain.\n\nShit, I could probably come up with a comedy routine for each of the Six Paths. For the Animal Path, it will be Pokemon jokes. For the Asura Path, it will be Metal Gear memes. If the Naraka Path pulls out the King of Hell, you can be sure I'll be making Doom Eternal and Devil May Cry references. For the Preta Path, I might humorously refer to them as Dazai Osamu from Bungou Stray Dogs. If the Human Path tries to rip my soul out I'll start singing one of the opening themes of Fullmetal Alchemist as loudly and horribly as I possibly can.\n\nThey probably won't understand any of my references, but my reactions would be unpredictable enough to throw them off their rhythm. All the time they spend bothering to try and parse out some semblance of meaning from my bullshit in order to formulate a more effective argument against my worldviews once it comes time for Pain to lecture me is time they could have otherwise spent murdering innocent people.\n\nEventually they'll get tired of trying to kill me and just send the main Pain over to deal with my shit.\n\nWatch me get pinned down to the ground with a bunch of rods impaled through my limbs like Naruto but every time Pain starts monologuing I just keep interrupting him to make penetration and bondage jokes related to the current situation I am in at the moment. Hell, I'll probably get my head smashed in, but if it buys a little more time for reinforcements to arrive and help evacuate the wounded from ground zero, so be it. \n\nI'm so goddamn obnoxious that most of the village probably wouldn't mind seeing me wiped off the face of the earth, so I won't have to worry about anyone needlessly sacrificing themselves in a suicide mission to save my worthless ass, only to have their memory insulted when I react by making a vine reference to cope with the trauma of witnessing their death.\n\nEventually Pain calls Konan over to try and talk to me because nothing else is working.\n\nIt goes about as well as you'd expect.\n\nNobody:\n\nNot even Danzo:\n\nMe: [https://youtu.be/-sMQpWCNTQw](https://youtu.be/-sMQpWCNTQw)",
                    "author": "HollyTheMage",
                    "id": "gxjh17g",
                    "parent_id": "t1_gxhy64i",
                    "score": 2,
                    "created_utc": 1620596218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone understands 😏🤦🏾‍♂️😂😂",
            "author": "Za106",
            "id": "gxfbfjz",
            "parent_id": "t1_gxeot11",
            "score": 4,
            "created_utc": 1620506579.0,
            "replies": []
        },
        {
            "body": "ok then",
            "author": "FeelingPrettyChill",
            "id": "gxej93l",
            "parent_id": "t1_gxej6up",
            "score": 3,
            "created_utc": 1620492636.0,
            "replies": [
                {
                    "body": "😂😂",
                    "author": "Za106",
                    "id": "gxek9re",
                    "parent_id": "t1_gxej93l",
                    "score": 1,
                    "created_utc": 1620493134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Itachi could have probably beat any of the akatsuki except maybe--MAYBE--nagato though. He is a league of his own. His genjitsu is so powerful it can warp reality and he could kill his entire clan which not even the first 2 kage or other clans seemed competent enough to accomplish with the entire history of the uchiha. \n\nHe is much in a league of his own and we never see madara or obito even flex such a level of mastery over the sharingan with all their power and skill. \n\nSo itachi is in a league uniquely of his own and his friend he took the eye of and put in a bird. \n\nOrochimaru though is probably equal to or stronger than Jariayah at his peak and if he didn't body swap he could have learned snake sage which Mitsuki has already shown to be op and somewhat mysterious in how it works relative to say toad sage form. I would even put peak orochimaru wit sage form higher than kakashi theoretically. Something that was little explored was all the forbidden and new jitsu, novel or forbidden, orochimaru invented or discovered. A better writer would have flexed his strengths like in part 1. Instead we get orochimaru the cripple bitch who dies in 2 and orochimaru the dude who does nothing in Boruto",
            "author": "GoodboyGotter",
            "id": "gxeifna",
            "parent_id": "t1_gxegq7z",
            "score": 1,
            "created_utc": 1620492232.0,
            "replies": []
        },
        {
            "body": "There's so much potential for stories that were never told in Naruto because it focused too heavily on Naruto...gaining another tail or something.\n\nI have a story in mind where Sakura tests her might and goes to find Sasuke alone, when her training with Tsunade is finished, but Naruto is still training. \n\nLong story short: She manages to *almost* beat Sasuke and bring him back due to her advantage of good Chakra control and good wits. She manages to outwit almost every trick Sasuke tries because she realizes that her biggest weakness will be her love for him. And it's in this fight that she realizes Sasuke won't change, and she gives herself the worth she deserves and that life isn't about her--but about the village and all that mushy stuff that she never saw because of Sasuke.\n\nSakura foils so much of Sasuke's tactics so Sasuke leaves because Sakura is able to bluff she has stronger attacks, but in reality, she is drained and out of options. Sasuke is weakened and is not willing to risk it because his bigger goal is to destroy the Leaf village, but he is actually scared that Sakura might be even more powerful than she lets on.\n\nThere's a link between her fight and the training she does with Tsunade where Tsunade forces her to think and not just punch blast everything. The emotional weight of the fight is about Sakura overcoming her own childish love for a guy that isn't interested in redemption.\n\nThis would later resonate again when Sasuke leaves as Orochimaru escapes too. \n\nIn the final arc when they defeat Sasuke, Naruto buries his boyfriend, and Sakura buries a stranger--no longer in love with him, but grateful their paths crossed.  Naruto cries for Sasuke. Sakura cries for the end of a clan. Naruto tells her that of all the Ninja he knows, she is the only one that could stand a chance against him, solely by using her wits. She tells him she knows. Her role at the end, would probably be head of Ambu. Though she's a great medical Ninja, she doesn't want to heal allies when they're broken, she wants to prevent the tragedies from happening in the first place.",
            "author": "i_Got_Rocks",
            "id": "gxkh6zd",
            "parent_id": "t1_gxkeska",
            "score": 2,
            "created_utc": 1620616516.0,
            "replies": []
        },
        {
            "body": "The best depiction is in the Forest of Death when Sasuke and Sakura see themselves getting headshotted from a couple kunai and then Sasuke puked",
            "author": "whitey-ofwgkta",
            "id": "gxeparv",
            "parent_id": "t1_gxeit4d",
            "score": 3,
            "created_utc": 1620495556.0,
            "replies": []
        },
        {
            "body": "Both",
            "author": "FeelingPrettyChill",
            "id": "gxeizfh",
            "parent_id": "t1_gxeit4d",
            "score": 1,
            "created_utc": 1620492504.0,
            "replies": [
                {
                    "body": "I just looked up Orochimaru’s “killer intent” and it’s hard to understand. I guess it’s just sort of a terrifying gengutsu or something.",
                    "author": "Vnecktrev09",
                    "id": "gxeoblw",
                    "parent_id": "t1_gxeizfh",
                    "score": 2,
                    "created_utc": 1620495080.0,
                    "replies": [
                        {
                            "body": "Not even a genjutsu. It's just pure, lethal, killing intent. Its more of an anime trope than anything, just done incredibly effectively",
                            "author": "silverx2000",
                            "id": "gxeoymp",
                            "parent_id": "t1_gxeoblw",
                            "score": 3,
                            "created_utc": 1620495391.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oof I suppose my brain just inserted an as. I can feel my reading comprehension falling",
            "author": "howabout24",
            "id": "gxdvf8x",
            "parent_id": "t1_gxdvbzj",
            "score": 2,
            "created_utc": 1620480243.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gxdvm1j",
                    "parent_id": "t1_gxdvf8x",
                    "score": 1,
                    "created_utc": 1620480360.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, and having his arms sealed lead to him getting bullied pretty hard. Not saying he wasn’t weakened, just that he didn’t really hold his own.",
            "author": "American_Madman",
            "id": "gxeocq7",
            "parent_id": "t1_gxehtp1",
            "score": 6,
            "created_utc": 1620495095.0,
            "replies": [
                {
                    "body": "I'm only at season 8 on Netflix India, so all these happen in the upcoming seasons? Netflix India has only 9 seasons.",
                    "author": "lockkheart",
                    "id": "gxeyyh7",
                    "parent_id": "t1_gxeocq7",
                    "score": 2,
                    "created_utc": 1620500267.0,
                    "replies": [
                        {
                            "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
                            "author": "Majoranza",
                            "id": "gxf28jv",
                            "parent_id": "t1_gxeyyh7",
                            "score": 5,
                            "created_utc": 1620501926.0,
                            "replies": [
                                {
                                    "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                                    "author": "American_Madman",
                                    "id": "gxfhcsj",
                                    "parent_id": "t1_gxf28jv",
                                    "score": 2,
                                    "created_utc": 1620509617.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
                            "author": "American_Madman",
                            "id": "gxffle7",
                            "parent_id": "t1_gxeyyh7",
                            "score": 2,
                            "created_utc": 1620508694.0,
                            "replies": [
                                {
                                    "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                                    "author": "lockkheart",
                                    "id": "gxg70bd",
                                    "parent_id": "t1_gxffle7",
                                    "score": 2,
                                    "created_utc": 1620523200.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
                            "author": "Terminal_Monk",
                            "id": "gxgqsiq",
                            "parent_id": "t1_gxeyyh7",
                            "score": 2,
                            "created_utc": 1620534477.0,
                            "replies": [
                                {
                                    "body": "I guess I'll have to go the other route :)",
                                    "author": "lockkheart",
                                    "id": "gxgylbj",
                                    "parent_id": "t1_gxgqsiq",
                                    "score": 1,
                                    "created_utc": 1620539776.0,
                                    "replies": []
                                },
                                {
                                    "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                                    "author": "lockkheart",
                                    "id": "gxilqg1",
                                    "parent_id": "t1_gxgqsiq",
                                    "score": 1,
                                    "created_utc": 1620581054.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Itachi vs Kakashi/Asuma/Kurama fight made it seem like the level of ninja that Konoha had was no match for Itachi. You also vaguely knew that 8 more, and assumed they were all like Itachi.\n\nOnce we skip forward, Naruto always seemed capable of protecting himself, and the rest of the Akatsuki were reckless psychos. Only a few even remotely gave the same vibes.",
            "author": "Harden-Soul",
            "id": "gxekvdy",
            "parent_id": "t1_gxdsx3u",
            "score": 28,
            "created_utc": 1620493427.0,
            "replies": [
                {
                    "body": "Well yeah, but I’d wager there’s very few Konoha shinobi that could take down anyone in Akatsuki regardless. \n\n\nThe main reason Kakuzu and Hidan got killed was because Shikamaru had god tier planning and even then it was pretty close. If Naruto didn’t roll in with his brand new plot device no jutsu...",
                    "author": "Agorbs",
                    "id": "gxenbnk",
                    "parent_id": "t1_gxekvdy",
                    "score": 17,
                    "created_utc": 1620494595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. Orochimaru was scary, but itachi was more scary. The cold calculated genius psycho killer",
            "author": null,
            "id": "gxe2hw7",
            "parent_id": "t1_gxe208o",
            "score": 31,
            "created_utc": 1620484197.0,
            "replies": [
                {
                    "body": "Orochimaru was afraid of Itachi which tells you everything you need to know about him. At the time he was introduced, Orochimaru had killed 2 Kage and traumatized an entire generation of kids. Then when talking about Itachi he was like “Nah fuck that shit he’s way too strong. I’ll gladly take on two whole nations, but not this teenager with the eyes”",
                    "author": "SeductivePillowcase",
                    "id": "gxki0kg",
                    "parent_id": "t1_gxe2hw7",
                    "score": 7,
                    "created_utc": 1620617029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also he fucking destroyed Kakashi, who we all saw as unbeatable up to this point.",
            "author": "ItzDrSeuss",
            "id": "gxe7x5d",
            "parent_id": "t1_gxe208o",
            "score": 30,
            "created_utc": 1620487031.0,
            "replies": [
                {
                    "body": "He didn't even seem to be trying against the lead Jonin. And the idea was that this was just the beginning. We thought the other Akatsuki members would be just as strong, but only Pain was really even close.",
                    "author": "Harden-Soul",
                    "id": "gxel5jc",
                    "parent_id": "t1_gxe7x5d",
                    "score": 13,
                    "created_utc": 1620493561.0,
                    "replies": [
                        {
                            "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
                            "author": "ItzDrSeuss",
                            "id": "gxevnld",
                            "parent_id": "t1_gxel5jc",
                            "score": 9,
                            "created_utc": 1620498635.0,
                            "replies": []
                        },
                        {
                            "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
                            "author": "SeductivePillowcase",
                            "id": "gxkjan1",
                            "parent_id": "t1_gxel5jc",
                            "score": 1,
                            "created_utc": 1620617837.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The man was boxing with the Hachibii.",
            "author": null,
            "id": "gxekrgz",
            "parent_id": "t1_gxdzgfp",
            "score": 9,
            "created_utc": 1620493375.0,
            "replies": [
                {
                    "body": "Straight facts, not to mention barely anything works on him because he’s made of water",
                    "author": "isaaceyfish",
                    "id": "gxem3t7",
                    "parent_id": "t1_gxekrgz",
                    "score": 8,
                    "created_utc": 1620494021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm, interesting! I’ve always thought that itachi was already on the verge of death and wanted sasuke to kill him for personal growth.",
            "author": "Smitten130",
            "id": "gxeqxjq",
            "parent_id": "t1_gxeqjn5",
            "score": 2,
            "created_utc": 1620496351.0,
            "replies": [
                {
                    "body": "He was quite frail but still powerful.\n\nMy head canon \"what if?\" Is trying to explain what the fuck itachi plans to do if sasuke died. It really changes everything. It's not like itachi was holding his hand after he left the village or protecting him. His entire plan when you think about it was \"sasuke tragedy, sasuke get strong, sasuke kill me get stronger,\" but what if sasuke just fucking died at any point? Like itachi would have to take his eyes and come up with a new plan and with greater urgency.",
                    "author": "GoodboyGotter",
                    "id": "gxerh6c",
                    "parent_id": "t1_gxeqxjq",
                    "score": 2,
                    "created_utc": 1620496613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, makes me wonder if it's some kind of a biblical archetype. I wasn't raised with religion but sometimes I notice these similarities and wish I knew a bit more about the bible and stuff so I could be like \"Aha! That's a Cain and Abel reference!!\" I mean I guess the snake itself is a biblical reference and the idea that knowledge can corrupt?",
            "author": "brobronn17",
            "id": "gxeuxrp",
            "parent_id": "t1_gxejf5a",
            "score": 3,
            "created_utc": 1620498293.0,
            "replies": [
                {
                    "body": "It is, but in Orochimaru's case I think he's primarily based off of a Japanese myth involving a snake.",
                    "author": "WanderingToTheEnd",
                    "id": "gxewufd",
                    "parent_id": "t1_gxeuxrp",
                    "score": 2,
                    "created_utc": 1620499213.0,
                    "replies": [
                        {
                            "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
                            "author": "brobronn17",
                            "id": "gxextdv",
                            "parent_id": "t1_gxewufd",
                            "score": 3,
                            "created_utc": 1620499694.0,
                            "replies": [
                                {
                                    "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                                    "author": "HollyTheMage",
                                    "id": "gxh387f",
                                    "parent_id": "t1_gxextdv",
                                    "score": 3,
                                    "created_utc": 1620543675.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">both passed up for a position they felt they deserved by their mentor, who they then tried to kill.\n\nTbf Voldemort only wanted the role some could be closer to control the Basilisk, pick on half bloods and muggleborns and recruit bigoted purebloods to his cause",
            "author": "KingofTrollenheim",
            "id": "gxi78zm",
            "parent_id": "t1_gxejf5a",
            "score": 1,
            "created_utc": 1620573878.0,
            "replies": []
        },
        {
            "body": "Bold of you to assume I would be in the right state of mind to even scream for help.\n\nActually if I keep it up with the obnoxious innuendos maybe the Six Paths will get annoyed with me and start targeting me specifically rather than attacking civilians at random. Hopefully I'll be able to distract them just long enough for some of the non-combatants in the area to be evacuated to the bunkers hidden in the Hokage mountain.\n\nShit, I could probably come up with a comedy routine for each of the Six Paths. For the Animal Path, it will be Pokemon jokes. For the Asura Path, it will be Metal Gear memes. If the Naraka Path pulls out the King of Hell, you can be sure I'll be making Doom Eternal and Devil May Cry references. For the Preta Path, I might humorously refer to them as Dazai Osamu from Bungou Stray Dogs. If the Human Path tries to rip my soul out I'll start singing one of the opening themes of Fullmetal Alchemist as loudly and horribly as I possibly can.\n\nThey probably won't understand any of my references, but my reactions would be unpredictable enough to throw them off their rhythm. All the time they spend bothering to try and parse out some semblance of meaning from my bullshit in order to formulate a more effective argument against my worldviews once it comes time for Pain to lecture me is time they could have otherwise spent murdering innocent people.\n\nEventually they'll get tired of trying to kill me and just send the main Pain over to deal with my shit.\n\nWatch me get pinned down to the ground with a bunch of rods impaled through my limbs like Naruto but every time Pain starts monologuing I just keep interrupting him to make penetration and bondage jokes related to the current situation I am in at the moment. Hell, I'll probably get my head smashed in, but if it buys a little more time for reinforcements to arrive and help evacuate the wounded from ground zero, so be it. \n\nI'm so goddamn obnoxious that most of the village probably wouldn't mind seeing me wiped off the face of the earth, so I won't have to worry about anyone needlessly sacrificing themselves in a suicide mission to save my worthless ass, only to have their memory insulted when I react by making a vine reference to cope with the trauma of witnessing their death.\n\nEventually Pain calls Konan over to try and talk to me because nothing else is working.\n\nIt goes about as well as you'd expect.\n\nNobody:\n\nNot even Danzo:\n\nMe: [https://youtu.be/-sMQpWCNTQw](https://youtu.be/-sMQpWCNTQw)",
            "author": "HollyTheMage",
            "id": "gxjh17g",
            "parent_id": "t1_gxhy64i",
            "score": 2,
            "created_utc": 1620596218.0,
            "replies": []
        },
        {
            "body": "😂😂",
            "author": "Za106",
            "id": "gxek9re",
            "parent_id": "t1_gxej93l",
            "score": 1,
            "created_utc": 1620493134.0,
            "replies": []
        },
        {
            "body": "I just looked up Orochimaru’s “killer intent” and it’s hard to understand. I guess it’s just sort of a terrifying gengutsu or something.",
            "author": "Vnecktrev09",
            "id": "gxeoblw",
            "parent_id": "t1_gxeizfh",
            "score": 2,
            "created_utc": 1620495080.0,
            "replies": [
                {
                    "body": "Not even a genjutsu. It's just pure, lethal, killing intent. Its more of an anime trope than anything, just done incredibly effectively",
                    "author": "silverx2000",
                    "id": "gxeoymp",
                    "parent_id": "t1_gxeoblw",
                    "score": 3,
                    "created_utc": 1620495391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gxdvm1j",
            "parent_id": "t1_gxdvf8x",
            "score": 1,
            "created_utc": 1620480360.0,
            "replies": []
        },
        {
            "body": "I'm only at season 8 on Netflix India, so all these happen in the upcoming seasons? Netflix India has only 9 seasons.",
            "author": "lockkheart",
            "id": "gxeyyh7",
            "parent_id": "t1_gxeocq7",
            "score": 2,
            "created_utc": 1620500267.0,
            "replies": [
                {
                    "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
                    "author": "Majoranza",
                    "id": "gxf28jv",
                    "parent_id": "t1_gxeyyh7",
                    "score": 5,
                    "created_utc": 1620501926.0,
                    "replies": [
                        {
                            "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                            "author": "American_Madman",
                            "id": "gxfhcsj",
                            "parent_id": "t1_gxf28jv",
                            "score": 2,
                            "created_utc": 1620509617.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
                    "author": "American_Madman",
                    "id": "gxffle7",
                    "parent_id": "t1_gxeyyh7",
                    "score": 2,
                    "created_utc": 1620508694.0,
                    "replies": [
                        {
                            "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                            "author": "lockkheart",
                            "id": "gxg70bd",
                            "parent_id": "t1_gxffle7",
                            "score": 2,
                            "created_utc": 1620523200.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
                    "author": "Terminal_Monk",
                    "id": "gxgqsiq",
                    "parent_id": "t1_gxeyyh7",
                    "score": 2,
                    "created_utc": 1620534477.0,
                    "replies": [
                        {
                            "body": "I guess I'll have to go the other route :)",
                            "author": "lockkheart",
                            "id": "gxgylbj",
                            "parent_id": "t1_gxgqsiq",
                            "score": 1,
                            "created_utc": 1620539776.0,
                            "replies": []
                        },
                        {
                            "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                            "author": "lockkheart",
                            "id": "gxilqg1",
                            "parent_id": "t1_gxgqsiq",
                            "score": 1,
                            "created_utc": 1620581054.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well yeah, but I’d wager there’s very few Konoha shinobi that could take down anyone in Akatsuki regardless. \n\n\nThe main reason Kakuzu and Hidan got killed was because Shikamaru had god tier planning and even then it was pretty close. If Naruto didn’t roll in with his brand new plot device no jutsu...",
            "author": "Agorbs",
            "id": "gxenbnk",
            "parent_id": "t1_gxekvdy",
            "score": 17,
            "created_utc": 1620494595.0,
            "replies": []
        },
        {
            "body": "Orochimaru was afraid of Itachi which tells you everything you need to know about him. At the time he was introduced, Orochimaru had killed 2 Kage and traumatized an entire generation of kids. Then when talking about Itachi he was like “Nah fuck that shit he’s way too strong. I’ll gladly take on two whole nations, but not this teenager with the eyes”",
            "author": "SeductivePillowcase",
            "id": "gxki0kg",
            "parent_id": "t1_gxe2hw7",
            "score": 7,
            "created_utc": 1620617029.0,
            "replies": []
        },
        {
            "body": "He didn't even seem to be trying against the lead Jonin. And the idea was that this was just the beginning. We thought the other Akatsuki members would be just as strong, but only Pain was really even close.",
            "author": "Harden-Soul",
            "id": "gxel5jc",
            "parent_id": "t1_gxe7x5d",
            "score": 13,
            "created_utc": 1620493561.0,
            "replies": [
                {
                    "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
                    "author": "ItzDrSeuss",
                    "id": "gxevnld",
                    "parent_id": "t1_gxel5jc",
                    "score": 9,
                    "created_utc": 1620498635.0,
                    "replies": []
                },
                {
                    "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
                    "author": "SeductivePillowcase",
                    "id": "gxkjan1",
                    "parent_id": "t1_gxel5jc",
                    "score": 1,
                    "created_utc": 1620617837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Straight facts, not to mention barely anything works on him because he’s made of water",
            "author": "isaaceyfish",
            "id": "gxem3t7",
            "parent_id": "t1_gxekrgz",
            "score": 8,
            "created_utc": 1620494021.0,
            "replies": []
        },
        {
            "body": "He was quite frail but still powerful.\n\nMy head canon \"what if?\" Is trying to explain what the fuck itachi plans to do if sasuke died. It really changes everything. It's not like itachi was holding his hand after he left the village or protecting him. His entire plan when you think about it was \"sasuke tragedy, sasuke get strong, sasuke kill me get stronger,\" but what if sasuke just fucking died at any point? Like itachi would have to take his eyes and come up with a new plan and with greater urgency.",
            "author": "GoodboyGotter",
            "id": "gxerh6c",
            "parent_id": "t1_gxeqxjq",
            "score": 2,
            "created_utc": 1620496613.0,
            "replies": []
        },
        {
            "body": "It is, but in Orochimaru's case I think he's primarily based off of a Japanese myth involving a snake.",
            "author": "WanderingToTheEnd",
            "id": "gxewufd",
            "parent_id": "t1_gxeuxrp",
            "score": 2,
            "created_utc": 1620499213.0,
            "replies": [
                {
                    "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
                    "author": "brobronn17",
                    "id": "gxextdv",
                    "parent_id": "t1_gxewufd",
                    "score": 3,
                    "created_utc": 1620499694.0,
                    "replies": [
                        {
                            "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                            "author": "HollyTheMage",
                            "id": "gxh387f",
                            "parent_id": "t1_gxextdv",
                            "score": 3,
                            "created_utc": 1620543675.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not even a genjutsu. It's just pure, lethal, killing intent. Its more of an anime trope than anything, just done incredibly effectively",
            "author": "silverx2000",
            "id": "gxeoymp",
            "parent_id": "t1_gxeoblw",
            "score": 3,
            "created_utc": 1620495391.0,
            "replies": []
        },
        {
            "body": "Ummm idk about what seasons are what, but I’m pretty sure 500 episodes (of shippuden alone, though counting filler) can fit into just 9 seasons\n\nEdit: shippuden alone has 21 seasons.... maybe a vpn will help?",
            "author": "Majoranza",
            "id": "gxf28jv",
            "parent_id": "t1_gxeyyh7",
            "score": 5,
            "created_utc": 1620501926.0,
            "replies": [
                {
                    "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
                    "author": "American_Madman",
                    "id": "gxfhcsj",
                    "parent_id": "t1_gxf28jv",
                    "score": 2,
                    "created_utc": 1620509617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, Orochimaru’s fight with 4-Tails Naruto happens in season two of Shippuden, so you should be well past it. And yeah, I don’t think any streaming service has more than nine seasons of any dub. From what I understand they do it like that to encourage/force DVD sales.",
            "author": "American_Madman",
            "id": "gxffle7",
            "parent_id": "t1_gxeyyh7",
            "score": 2,
            "created_utc": 1620508694.0,
            "replies": [
                {
                    "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
                    "author": "lockkheart",
                    "id": "gxg70bd",
                    "parent_id": "t1_gxffle7",
                    "score": 2,
                    "created_utc": 1620523200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "U are probably watching original Naruto. It has 250 so episodes. I don't recall having shippuden in netflix india atleast. Better to watch in some anime site or download it via torrent.",
            "author": "Terminal_Monk",
            "id": "gxgqsiq",
            "parent_id": "t1_gxeyyh7",
            "score": 2,
            "created_utc": 1620534477.0,
            "replies": [
                {
                    "body": "I guess I'll have to go the other route :)",
                    "author": "lockkheart",
                    "id": "gxgylbj",
                    "parent_id": "t1_gxgqsiq",
                    "score": 1,
                    "created_utc": 1620539776.0,
                    "replies": []
                },
                {
                    "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
                    "author": "lockkheart",
                    "id": "gxilqg1",
                    "parent_id": "t1_gxgqsiq",
                    "score": 1,
                    "created_utc": 1620581054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just goes to show how powerful Dojutsu was. Also Deidara was able to bring down a Kage as powerful as Gaara, and he was only ever defeated by people with the Sharingan.",
            "author": "ItzDrSeuss",
            "id": "gxevnld",
            "parent_id": "t1_gxel5jc",
            "score": 9,
            "created_utc": 1620498635.0,
            "replies": []
        },
        {
            "body": "I disagree. Deidara took on an entire nation and kidnapped their leader. Sasori also did something similar with his hundred puppets. Hidan was weak, but the entire Land of Steam had so much trouble with him they had to resort to outside help. Kisame was scaled to tailed beast level as the “Zero Tails”. Kakazu was an international bounty hunter who routinely took on high level assassinations and S rank missions for shits and giggles. I’d say they were all really ridiculously busted. Aside from Deidara and Itachi (which he purposely threw the fight), it took multiple people to wipe out most of their members.",
            "author": "SeductivePillowcase",
            "id": "gxkjan1",
            "parent_id": "t1_gxel5jc",
            "score": 1,
            "created_utc": 1620617837.0,
            "replies": []
        },
        {
            "body": "That's super cool! Found online: \"Orochi usually refers to the Japanese mythological beast, the Yamata no Orochi. It means the eight-headed great snake, though some translations also describes it as a serpent, dragon or a hydra.\" It seems to also symbolize rebirth and transformation, which makes sense it sheds skin + Ouroboros.",
            "author": "brobronn17",
            "id": "gxextdv",
            "parent_id": "t1_gxewufd",
            "score": 3,
            "created_utc": 1620499694.0,
            "replies": [
                {
                    "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
                    "author": "HollyTheMage",
                    "id": "gxh387f",
                    "parent_id": "t1_gxextdv",
                    "score": 3,
                    "created_utc": 1620543675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, nowhere has more than nine of the dubs to encourage DVD sales.",
            "author": "American_Madman",
            "id": "gxfhcsj",
            "parent_id": "t1_gxf28jv",
            "score": 2,
            "created_utc": 1620509617.0,
            "replies": []
        },
        {
            "body": "I guess I'll have find those DVDs and buy them 😁.. thanks for letting know.\n\nAnd yes, for me too Orochimaro is most scariest and the most badass villain in all of Naruto. And Itachi, the first time I saw him use his jutsu on Kakashi I couldn't sleep that night. I had nightmares like I was in it.",
            "author": "lockkheart",
            "id": "gxg70bd",
            "parent_id": "t1_gxffle7",
            "score": 2,
            "created_utc": 1620523200.0,
            "replies": []
        },
        {
            "body": "I guess I'll have to go the other route :)",
            "author": "lockkheart",
            "id": "gxgylbj",
            "parent_id": "t1_gxgqsiq",
            "score": 1,
            "created_utc": 1620539776.0,
            "replies": []
        },
        {
            "body": "Do you guys suggest I finish the 9 seasons on Netflix and move on to Naruto Shippuden?\n\nEDIT: Okay I got the answer. On my way to finish Naruto before I start Naruto Shippuden.",
            "author": "lockkheart",
            "id": "gxilqg1",
            "parent_id": "t1_gxgqsiq",
            "score": 1,
            "created_utc": 1620581054.0,
            "replies": []
        },
        {
            "body": "Oof are we gonna talk about how Orochi was killed by Susanoo, the god of storms and the sea? Or how Naruto's mom is named after the princess who was originally going to be sacrificed to Orochi before Susanoo saved the day? Can we talk about how the sword Susanoo obtained when he killed Orochi was named Kusanagi--and that Sasuke's sword has the exact same name? \n\nCan we talk about how Susanoo, Amaterasu, and Tsukuyomi are all siblings that have gotten into some pretty crazy fights, and that their parents, Izanami and Izanagi, were messed up as well?",
            "author": "HollyTheMage",
            "id": "gxh387f",
            "parent_id": "t1_gxextdv",
            "score": 3,
            "created_utc": 1620543675.0,
            "replies": []
        }
    ]
}