{
    "title": "Naruto's Birthday Be Like",
    "post_id": "kk7ozn",
    "post_url": "https://www.reddit.com/r/dankruto/comments/kk7ozn/narutos_birthday_be_like/",
    "author": "jonandreyuaosuni",
    "body": "",
    "url": "https://i.redd.it/dnq0v1zeye761.jpg",
    "score": 6582,
    "upvote_ratio": 0.97,
    "created_utc": 1608937060.0,
    "num_comments": 108,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Actually all of that happened the day before Naruto’s birthday. He lost an arm fighting his best friend on his birthday",
            "author": "Dier_runner",
            "id": "gh1dvxi",
            "parent_id": "t3_kk7ozn",
            "score": 147,
            "created_utc": 1608948497.0,
            "replies": [
                {
                    "body": "At least he got the most important thing in Naruto afterwards \n\n**Hashirama cells**",
                    "author": "IPlayOnSmartFridge",
                    "id": "gh1gqh3",
                    "parent_id": "t1_gh1dvxi",
                    "score": 129,
                    "created_utc": 1608950535.0,
                    "replies": [
                        {
                            "body": "Them Hashirama cells do be hella OP\n\nImagine a character made entirely of them...would probably have some cool kekkei genkai",
                            "author": "SonicBlur254",
                            "id": "gh1gz8i",
                            "parent_id": "t1_gh1gqh3",
                            "score": 56,
                            "created_utc": 1608950710.0,
                            "replies": [
                                {
                                    "body": ">Imagine a character made entirely of them...would probably have some cool kekkei genkai\n\nI don't think so. It's similar to broccoli, if you eat some of it then nice, but if you are 100% broccoli then you are dead.",
                                    "author": "impersonal66",
                                    "id": "gh1yvkd",
                                    "parent_id": "t1_gh1gz8i",
                                    "score": 25,
                                    "created_utc": 1608965040.0,
                                    "replies": [
                                        {
                                            "body": "No I think it’s just called BEING Hashirama lol",
                                            "author": "Dier_runner",
                                            "id": "gh1zhd0",
                                            "parent_id": "t1_gh1yvkd",
                                            "score": 29,
                                            "created_utc": 1608965668.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Zetsu, hashirama... i dunno man, cant wait for a hashirama cell guy",
                                    "author": "Reddit_User_Of_Self",
                                    "id": "gh2fddo",
                                    "parent_id": "t1_gh1gz8i",
                                    "score": 6,
                                    "created_utc": 1608985217.0,
                                    "replies": []
                                },
                                {
                                    "body": "Did you casually forget about Yamato?",
                                    "author": "Boar_Hat",
                                    "id": "gh2w8yq",
                                    "parent_id": "t1_gh1gz8i",
                                    "score": 3,
                                    "created_utc": 1608999017.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh.. I thought we were going somewhere different with the answer. But yeah Hashirama cells, most important",
                            "author": null,
                            "id": "gh1qxf4",
                            "parent_id": "t1_gh1gqh3",
                            "score": 9,
                            "created_utc": 1608958080.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "At least he got the best present, and that is Sasuke finally coming back to the village",
                    "author": "wisdomsharerv2",
                    "id": "gh1qbjd",
                    "parent_id": "t1_gh1dvxi",
                    "score": 11,
                    "created_utc": 1608957603.0,
                    "replies": [
                        {
                            "body": "Then leaving and not coming back in years.",
                            "author": "Abdur278",
                            "id": "gh2dfol",
                            "parent_id": "t1_gh1qbjd",
                            "score": 7,
                            "created_utc": 1608982784.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Depends on how you want to view his birthday. Do you count it as when the sun is up, or at midnight? It was probably around midnight when Minato arrived on the battlefield, since he did mention wanting to tell Naruto something important, but he'd save it for later",
                    "author": "gotumms146",
                    "id": "gh6tpic",
                    "parent_id": "t1_gh1dvxi",
                    "score": 2,
                    "created_utc": 1609081368.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see this take a lot, and it's funny but I see some people use it to legitimately criticize Boruto the series. In reality, you can't compare struggles very accurately. Yeah technically Naruto went through worse shit, but that doesn't nullify Boruto's troubles. Just cuz your granddaddy fought in WW2 doesn't mean your mental, physical, or financial issues don't matter.\n\nJust wanna keep it real",
            "author": "Rikuskill",
            "id": "gh16qdx",
            "parent_id": "t3_kk7ozn",
            "score": 753,
            "created_utc": 1608943507.0,
            "replies": [
                {
                    "body": "Also I hate this meme, Boruto didn't care for his own birthday, it was because Naruto promised he would be there for Himawari's bday and ruined it by sending a shadow clone that went poof.",
                    "author": "Shrenade514",
                    "id": "gh1a907",
                    "parent_id": "t1_gh16qdx",
                    "score": 436,
                    "created_utc": 1608945914.0,
                    "replies": [
                        {
                            "body": "Yeah man dropped the cake and everything",
                            "author": "Qu1nn1fer",
                            "id": "gh1g3rv",
                            "parent_id": "t1_gh1a907",
                            "score": 226,
                            "created_utc": 1608950085.0,
                            "replies": [
                                {
                                    "body": "The cake though 😱😭😭",
                                    "author": null,
                                    "id": "gh1hupf",
                                    "parent_id": "t1_gh1g3rv",
                                    "score": 119,
                                    "created_utc": 1608951325.0,
                                    "replies": [
                                        {
                                            "body": "It sucks because you think naruto not having a dad would make him want to be the best dad ever but hes just not, would've been some nice character progression for the guy they did his story dirty",
                                            "author": "Qu1nn1fer",
                                            "id": "gh1i2fh",
                                            "parent_id": "t1_gh1hupf",
                                            "score": 105,
                                            "created_utc": 1608951482.0,
                                            "replies": [
                                                {
                                                    "body": "The reason Kishimoto made Sasuke and Naruto bad fathers is because he was projecting himself onto them. He was so busy with the manga, he felt like he missed out on his own kids' childhoods. That is the true explanation for Sasuke being gone all of those years, and Naruto being negligent",
                                                    "author": null,
                                                    "id": "gh1m6ww",
                                                    "parent_id": "t1_gh1i2fh",
                                                    "score": 155,
                                                    "created_utc": 1608954478.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thats... actually really sad",
                                                            "author": "Qu1nn1fer",
                                                            "id": "gh1m8pi",
                                                            "parent_id": "t1_gh1m6ww",
                                                            "score": 124,
                                                            "created_utc": 1608954514.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
                                                            "author": "DonnyProcs",
                                                            "id": "gh1pbxg",
                                                            "parent_id": "t1_gh1m6ww",
                                                            "score": 36,
                                                            "created_utc": 1608956838.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                                                                    "author": null,
                                                                    "id": "gh1ufc2",
                                                                    "parent_id": "t1_gh1pbxg",
                                                                    "score": 50,
                                                                    "created_utc": 1608960937.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                                                                            "author": "DonnyProcs",
                                                                            "id": "gh1v1fj",
                                                                            "parent_id": "t1_gh1ufc2",
                                                                            "score": 13,
                                                                            "created_utc": 1608961460.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                                                                    "author": "revmun",
                                                                                    "id": "gh2yvat",
                                                                                    "parent_id": "t1_gh1v1fj",
                                                                                    "score": 2,
                                                                                    "created_utc": 1609000632.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "We gotta keep some things in mind about naruto\n\n1. Being hokage was always his dream. Sure he wanted to have a family too, but he wasn’t screaming that at his friends or opponents at every opportunity. Not saying he’s giving his family the backseat intentionally, but he finally achieved his dream and likely wants to do it to the best of his abilities. Sending a shadow clone to sing and cut cake prolly seemed pretty justifiable to him considering he wanted to be there but still had duties at the office. the work he’s doing is a far cry from his time as a ninja; he was never studious and when fighting he thrived off being unpredictable so paper work and constant meetings are probably more of a drag for him than anything shikamaru has ever experienced in his life.\n\n2. he never had a good example of a father figure/family man. All of his male role models (jiriyah, kakashi, killer bee even) were single dudes who were extremely dedicated to their work. also, many of the adults in the village didn’t want their kids anywhere near him while he was growing up, so he could barely even steal glances of how a traditional family interacts with each other w/o it backfiring on him. \n\nI think his portrayal so far has been accurate and inline with his continued development. It’s all still pretty new to him and he hasn’t found a balance yet.",
                                                    "author": "ayochaser17",
                                                    "id": "gh250qf",
                                                    "parent_id": "t1_gh1i2fh",
                                                    "score": 26,
                                                    "created_utc": 1608971977.0,
                                                    "replies": [
                                                        {
                                                            "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
                                                            "author": "Blue_Raichu",
                                                            "id": "gh27b1e",
                                                            "parent_id": "t1_gh250qf",
                                                            "score": 10,
                                                            "created_utc": 1608974848.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "He improved after momoshiki arc naruto and boruto are chill as we expected",
                                                    "author": null,
                                                    "id": "gh1inav",
                                                    "parent_id": "t1_gh1i2fh",
                                                    "score": 29,
                                                    "created_utc": 1608951897.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "It makes since because Naruto had no basis for what a father should act like day-to-day.",
                                                    "author": "Blue_Owl2",
                                                    "id": "gh32lc8",
                                                    "parent_id": "t1_gh1i2fh",
                                                    "score": 3,
                                                    "created_utc": 1609002872.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah I just wish we had more footage of the man trying a bit",
                                                            "author": "Qu1nn1fer",
                                                            "id": "gh37ej1",
                                                            "parent_id": "t1_gh32lc8",
                                                            "score": 3,
                                                            "created_utc": 1609005736.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah, I felt really sad for himawari\n\nEven though it's all fictional, it really struck",
                                    "author": "shab-re",
                                    "id": "gh1ym6q",
                                    "parent_id": "t1_gh1g3rv",
                                    "score": 6,
                                    "created_utc": 1608964778.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thanks for writing that...I hope people read this...and the trend changes of hating on boruto...you have my respect sir",
                            "author": "According_Way1560",
                            "id": "gh1ingp",
                            "parent_id": "t1_gh1a907",
                            "score": 19,
                            "created_utc": 1608951900.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah!! He didn't want Himawari to be sad at such . He didn't care if Naruto was there for his birthday. All he cared was about his Younger sister.",
                            "author": "PichKari_KinG",
                            "id": "gh279fj",
                            "parent_id": "t1_gh1a907",
                            "score": 5,
                            "created_utc": 1608974791.0,
                            "replies": []
                        },
                        {
                            "body": "Yea fuck naruto. Forgot his ninja way",
                            "author": "Im_alright_19",
                            "id": "gh1goal",
                            "parent_id": "t1_gh1a907",
                            "score": 14,
                            "created_utc": 1608950492.0,
                            "replies": [
                                {
                                    "body": "Why does it matter. A shallow clone is basically the same thing since you get all the memories",
                                    "author": null,
                                    "id": "gh1xu6l",
                                    "parent_id": "t1_gh1goal",
                                    "score": -4,
                                    "created_utc": 1608964017.0,
                                    "replies": [
                                        {
                                            "body": "Its not the same as actually being there in person.",
                                            "author": "Im_alright_19",
                                            "id": "gh22o5z",
                                            "parent_id": "t1_gh1xu6l",
                                            "score": 13,
                                            "created_utc": 1608969181.0,
                                            "replies": [
                                                {
                                                    "body": "The main reason I fail to relate to Boruto, when I was a kid I would have killed for a shadow clone of my mom/dad since they worked all the time",
                                                    "author": "Ozzymandious",
                                                    "id": "gh24eve",
                                                    "parent_id": "t1_gh22o5z",
                                                    "score": 5,
                                                    "created_utc": 1608971238.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Just saying wouldn't it be worse for him showing up to it? because if he did then if there was an emergency or something people would have to go and ruin the whole party and Naruto would have to cut it short so I think it's better he wasn't there",
                                    "author": "ektdvb2",
                                    "id": "gh2zs0r",
                                    "parent_id": "t1_gh1goal",
                                    "score": 1,
                                    "created_utc": 1609001180.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah but still at least he had a dad, Narutos father and mother was murdered over him and the thing that killed them is inside of him and he got to speak to his parents 3 times in total 1 of them was his mother for a bit then next was his father for a little less then the next time was in battle with his father where they only briefly talked about the fight during the fight so borutos having it alot easier than Naruto, Naruto would be more than happy to even get a shadow clone of his father oh and his mother is alive and taking care of him while Naruto took care of himself, so who has it harder",
                            "author": "ektdvb2",
                            "id": "gh30zrt",
                            "parent_id": "t1_gh1a907",
                            "score": 0,
                            "created_utc": 1609001909.0,
                            "replies": [
                                {
                                    "body": "Cool story but nobody said Boruto had it harder",
                                    "author": "Shrenade514",
                                    "id": "gh320s0",
                                    "parent_id": "t1_gh30zrt",
                                    "score": 3,
                                    "created_utc": 1609002526.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To keep it more real, I'm willing to bet my fellow millenials or even younger people hate when older people judge us because we didn't go to school through a warzone but also don't want our depression and issues delegitimized.\n\nBut these same people will delegitimize Boruto because he didn't go through what Naruto did.",
                    "author": "MarcoMaroon",
                    "id": "gh1eky3",
                    "parent_id": "t1_gh16qdx",
                    "score": 58,
                    "created_utc": 1608948992.0,
                    "replies": []
                },
                {
                    "body": "Gatekeeping basically. Just because Naruto went through some extreme shit, apparently Boruto isn't allowed to feel bad about anything less.\n\nBoruto as a show still sucks tho. Just that this isn't really a valid criticism in my eyes.",
                    "author": "darkblaze76",
                    "id": "gh1nwys",
                    "parent_id": "t1_gh16qdx",
                    "score": 12,
                    "created_utc": 1608955766.0,
                    "replies": []
                },
                {
                    "body": "It's because Reddit is an older site and people here are old enough to begin complaining about youngsters)",
                    "author": "Ezreon",
                    "id": "gh1j5e7",
                    "parent_id": "t1_gh16qdx",
                    "score": 8,
                    "created_utc": 1608952263.0,
                    "replies": [
                        {
                            "body": "Yeah, Millenials and older Gen Z are becoming like boomers lmao",
                            "author": "Aivaras12398",
                            "id": "gh2mflm",
                            "parent_id": "t1_gh1j5e7",
                            "score": 3,
                            "created_utc": 1608992182.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "it's not that they don't matter, but you should not be a bitch about it. if my ancestors went through worst stuff and lived, I can go through my own smaller scale troubles without throwing tantrums.",
                    "author": "orva12",
                    "id": "gh2o35d",
                    "parent_id": "t1_gh16qdx",
                    "score": 3,
                    "created_utc": 1608993499.0,
                    "replies": [
                        {
                            "body": "I shoulda mentioned that Boruto's behavior isn't all justifiable. But his anger and disappointment at his father definitely is",
                            "author": "Rikuskill",
                            "id": "gh2spjg",
                            "parent_id": "t1_gh2o35d",
                            "score": 1,
                            "created_utc": 1608996796.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "True but they’re shit compared to that",
                    "author": "The-dark-lightskin",
                    "id": "gh2z1k9",
                    "parent_id": "t1_gh16qdx",
                    "score": 2,
                    "created_utc": 1609000737.0,
                    "replies": []
                },
                {
                    "body": "No shit, but at the end of the day I know people that were raised in similar situations to Boruto, but the still never displayed shitty behaviour.\n\nI was raised in an environment were I wouldn't have several birthdays, but I always knew that my parents had to work to bring food on the table. Boruto's troubles are nothing in comparison to Naruto and he makes for a shit character if compared to Himawari, Shikadai and Sarada.\n\nEdit: Grammar problems here and there.",
                    "author": "AsuraDeo",
                    "id": "gh1ehzb",
                    "parent_id": "t1_gh16qdx",
                    "score": 5,
                    "created_utc": 1608948932.0,
                    "replies": [
                        {
                            "body": "His bad attitude lasted for less than 10 chapters, idk why people make such a big deal out of it.",
                            "author": "bendstraw",
                            "id": "gh1iaxe",
                            "parent_id": "t1_gh1ehzb",
                            "score": 21,
                            "created_utc": 1608951651.0,
                            "replies": []
                        },
                        {
                            "body": "Oh yeah Boruto has a separate spoiled prodigy brat issue, but I wanted to point out that his relationship with his dad is actually handled pretty well. That said I'm only 50 eps in, so they may fuck it up later and I wouldn't know lol",
                            "author": "Rikuskill",
                            "id": "gh1entv",
                            "parent_id": "t1_gh1ehzb",
                            "score": 30,
                            "created_utc": 1608949049.0,
                            "replies": [
                                {
                                    "body": "That was my problem with him too. Boruto started to  not get as much attention from when he turned 8 years old or so. Naruto did break a promise, but for him his village is his family. Some of the anime is skippable. I tend to fast forward it through some content.",
                                    "author": "AsuraDeo",
                                    "id": "gh1fgp8",
                                    "parent_id": "t1_gh1entv",
                                    "score": 10,
                                    "created_utc": 1608949622.0,
                                    "replies": [
                                        {
                                            "body": "Same about skipping through stuff. Some of the scenes drag their feet so purposefully I can't take it.",
                                            "author": "Rikuskill",
                                            "id": "gh1gsnq",
                                            "parent_id": "t1_gh1fgp8",
                                            "score": 3,
                                            "created_utc": 1608950578.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well Boruto is supposed to be like this. He starts off as this annoying, ignorant brat but he changes. Just look at him in the flashforward scene. He isn't going to stay this way lol. \n\nNaruto went from being an annoying brat in the first few episodes, to bowing down to the Raikage for his own enemy. He went from not understanding revenge, to knowing it. It's called \"character development\"",
                            "author": null,
                            "id": "gh1mlla",
                            "parent_id": "t1_gh1ehzb",
                            "score": 13,
                            "created_utc": 1608954779.0,
                            "replies": []
                        },
                        {
                            "body": "I didnt even get to see my dad for most of my birthdays as a kid and even when I did both my mom and him were busy with a hundred other things",
                            "author": "DonnyProcs",
                            "id": "gh1r0sz",
                            "parent_id": "t1_gh1ehzb",
                            "score": 2,
                            "created_utc": 1608958154.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How could you not compare the struggles between Kid Naruto and Boruto? \n\nNaruto’s childhood was shit while Boruto is spoiled. \n\nNot bashing Boruto, I’m just saying.",
                    "author": "autonomousfailure",
                    "id": "gh1n1n3",
                    "parent_id": "t1_gh16qdx",
                    "score": -3,
                    "created_utc": 1608955113.0,
                    "replies": []
                },
                {
                    "body": "And who in gods name was saying that he nullify Brouto's trouble it's just annoying to see boruto bitch about such minor things compared to naruto",
                    "author": "thepowerfwoth",
                    "id": "gh1mx0a",
                    "parent_id": "t1_gh16qdx",
                    "score": -7,
                    "created_utc": 1608955017.0,
                    "replies": []
                },
                {
                    "body": "You’re right. Boruto has gone through some dark shit like... oh and... And then... uhm... I guess he struggled when he cheated on the Chunin exam and his Dad, the Leader of the entire nation and Hero of the Shinobi World forgot to come home on time for his kids birthday. You’re right. Boruto has it rough.\n\n\n\nOutside or Boruto though. Yes, you can’t compare struggles. But when you are simply evaluating a continuation of an Anime and one is good and the other is fucking boring, then sure.",
                    "author": "KazPrime",
                    "id": "gh1a895",
                    "parent_id": "t1_gh16qdx",
                    "score": -21,
                    "created_utc": 1608945900.0,
                    "replies": [
                        {
                            "body": "Man, the kid's dad didn't show up to his birthday. Shit hurts. You know your dad's job is very important, but he sacrifices his relationship with his family for it. Boruto, as a teen that thinks he knows how the world works, resents his dad for it.\n\nBoruto is really boring, I'll agree though. Then again, Shippuden had a lot of fuckign boring parts. The last like, fourth of the show was a massive slog to get through. There's just a lot of legit flaws with Boruto that I see get overlooked in favor of dumb, sometimes false ones.",
                            "author": "Rikuskill",
                            "id": "gh1aocq",
                            "parent_id": "t1_gh1a895",
                            "score": 25,
                            "created_utc": 1608946217.0,
                            "replies": [
                                {
                                    "body": "Yeah but that is kind of the juxtaposition. Naruto worked and fought hard so that the Children of Konoha wouldn’t have childhood’s like his. The indirect cause is that his kid is spoiled and doesn’t have time for him. An interesting story/story arc. \n\nWhat is done in Boruto the anime (haven’t read the manga yet) is boring as fuck. There are gaping issues with literally everything about it. Really hate what they did to certain characters. Because Boruto doesn’t struggle and just whines about everything there isn’t anything to like him other than he is Naruto/Hinata’s son. I mean the dude is more gifted than most of his peers and he still ends up cheating at the exams. Honestly he would have made a better “foil” arc villain than hero.",
                                    "author": "KazPrime",
                                    "id": "gh1b41a",
                                    "parent_id": "t1_gh1aocq",
                                    "score": -9,
                                    "created_utc": 1608946520.0,
                                    "replies": [
                                        {
                                            "body": "I'm only about halfway thru the anime, but I sorta agree. However, there are some important moments that throw Boruto's shitty smug confidence in his face. When Kakashi pins him down in the Genin exams and shows that he doesn't have enough willpower to break his arm to escape the hold, I was like YOOO YES! But it sorta ended with Boruto just organizing the others to win. Meh.\n\nThere seems to be a pattern of cool setups with really, really meh conclusions. Every villain so far fucking sucks.",
                                            "author": "Rikuskill",
                                            "id": "gh1ejgr",
                                            "parent_id": "t1_gh1b41a",
                                            "score": 9,
                                            "created_utc": 1608948963.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "\"haven't read the manga\" oh, so then you're admitting you have no idea what you're talking about?\n\nYour take on Boruto is not nearly as hot as you think it is. Personally it doesn't matter to me if anyone else likes it or not because I'm over here living my best Boruto life, but everything you just talked about is the entire point of Boruto.\n\nNaruto had nothing, and he got everything. Boruto has everything and he will be left with nothing. If they just rewrote Naruto that shit would be boring af. This is a completely different take on the Naruto universe, and especially with Kishi back at the helm writing the manga we are already moving along swiftly and awesomely.",
                                            "author": "eorabs",
                                            "id": "gh1cnnl",
                                            "parent_id": "t1_gh1b41a",
                                            "score": 8,
                                            "created_utc": 1608947617.0,
                                            "replies": [
                                                {
                                                    "body": "I have read the manga and I still find it boring as fuck\n\nEspecially in comparison to Naruto. The lack of actual techniques, the fact that Naruto and Sasuke got nerfed vastly. The lack of explanation around Kara.\n\nThing is, Boruto's end wouldn't be sad, he will most likely end happy with his family or accomplishing his goals of being a \"Shadow Hokage.\"\n\nNaruto and Sasuke meeting their end is highly unlikely. Boruto is already losing demand among the people in Japan. Anime sales are going well, but manga sales are barely even on par with what Naruto was.",
                                                    "author": "AsuraDeo",
                                                    "id": "gh1euv1",
                                                    "parent_id": "t1_gh1cnnl",
                                                    "score": 0,
                                                    "created_utc": 1608949190.0,
                                                    "replies": [
                                                        {
                                                            "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
                                                            "author": "eorabs",
                                                            "id": "gh1ovd6",
                                                            "parent_id": "t1_gh1euv1",
                                                            "score": 6,
                                                            "created_utc": 1608956485.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
                                                            "author": "According_Way1560",
                                                            "id": "gh1jfeb",
                                                            "parent_id": "t1_gh1euv1",
                                                            "score": 5,
                                                            "created_utc": 1608952459.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "imagine if boruto time travelled to the war arc instead",
            "author": "Hydraahh",
            "id": "gh1ih8h",
            "parent_id": "t3_kk7ozn",
            "score": 60,
            "created_utc": 1608951776.0,
            "replies": [
                {
                    "body": "Imagine adult sasuke vs madara",
                    "author": "mo-did",
                    "id": "gh2myhk",
                    "parent_id": "t1_gh1ih8h",
                    "score": 9,
                    "created_utc": 1608992613.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ghd0g1v",
                            "parent_id": "t1_gh2myhk",
                            "score": 2,
                            "created_utc": 1609215139.0,
                            "replies": [
                                {
                                    "body": "Honestly I Kinda did that as I watch it so long after part 1 I forgot so much",
                                    "author": "mo-did",
                                    "id": "ghe2zt0",
                                    "parent_id": "t1_ghd0g1v",
                                    "score": 1,
                                    "created_utc": 1609249189.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "thats literally what borutos story is gonna be, a kid who had everything except his fathers recognition, and now is losing literally everything",
            "author": "PlsDontBotherMeHere",
            "id": "gh1sr02",
            "parent_id": "t3_kk7ozn",
            "score": 24,
            "created_utc": 1608959542.0,
            "replies": []
        },
        {
            "body": "What is this trope about creating kind natured heroes imto bad fathers. They did same to Aang from Avatar : The Last Airbender.",
            "author": "VampireKing100",
            "id": "gh1pm7g",
            "parent_id": "t3_kk7ozn",
            "score": 21,
            "created_utc": 1608957057.0,
            "replies": [
                {
                    "body": "Basically it's because in a sequel series, you want some sort of story relating back to the old main characters. If you want to do that through the character's kids, you either have to make the parent so perfect that it creates tension for the kids, or you make them flawed in some way. Flawed characters are almost always more interesting.\n\nIt's also just hard to make characters interesting if their backstory is all about how great their parents and childhood were.",
                    "author": "Jeffeffery",
                    "id": "gh20ye5",
                    "parent_id": "t1_gh1pm7g",
                    "score": 17,
                    "created_utc": 1608967242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The 4th Great Ninja War was the day *before* Naruto's birthday. Whole point of the \"happy birthday I'm dying again son\" deal by the 4th Hokage\n\nSo Neji dying and hooking him up with Hinata was an early birthday gift is all /s",
            "author": "Condor193",
            "id": "gh23w5m",
            "parent_id": "t3_kk7ozn",
            "score": 18,
            "created_utc": 1608970607.0,
            "replies": [
                {
                    "body": "The 'happy birthday' bit was just before sunrise, but it has already beem his birthday for a few hpurs after they started 'fighting through the night'. Obito pointed it out during the fighting that it was Naruto' bday",
                    "author": "youmemba",
                    "id": "gh2marg",
                    "parent_id": "t1_gh23w5m",
                    "score": 4,
                    "created_utc": 1608992071.0,
                    "replies": [
                        {
                            "body": "Right, and the finale with Six Paths Obito and Madara and Kaguya would've gone all night. Neji's death was still likely the day before.\n\nBut hey, he got his best friend back as a bday gift lol",
                            "author": "Condor193",
                            "id": "gh3d56f",
                            "parent_id": "t1_gh2marg",
                            "score": 2,
                            "created_utc": 1609008908.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Boruto litteraly didn’t say any of this. He only cares that naruto showed up to himawaris birthday",
            "author": "Nandoski_",
            "id": "gh24w2k",
            "parent_id": "t3_kk7ozn",
            "score": 17,
            "created_utc": 1608971821.0,
            "replies": [
                {
                    "body": "Do you expect Naruto fans to have basic reading comprehension? Half of them can't figure shit out unless it's stated dramatically by a side character after a flashback",
                    "author": "Aivaras12398",
                    "id": "gh2mont",
                    "parent_id": "t1_gh24w2k",
                    "score": 12,
                    "created_utc": 1608992397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Naruto good boruto bad, karma whoring on /dankruto on its finest",
            "author": "Roethen",
            "id": "gh28002",
            "parent_id": "t3_kk7ozn",
            "score": 7,
            "created_utc": 1608975749.0,
            "replies": []
        },
        {
            "body": "I have seen this post 4 times at the very least...it's a repost but got 500 upvotes cuz f boruto...everybody on this subreddit hates Boruto...I wish the trend would change😔",
            "author": "According_Way1560",
            "id": "gh1ije4",
            "parent_id": "t3_kk7ozn",
            "score": 30,
            "created_utc": 1608951819.0,
            "replies": [
                {
                    "body": "This is posted like 18 times a month",
                    "author": "Pac_Zach_Attack",
                    "id": "gh1ka7p",
                    "parent_id": "t1_gh1ije4",
                    "score": 27,
                    "created_utc": 1608953079.0,
                    "replies": []
                },
                {
                    "body": "Every post from dankruto i see on my main page is about shitting on Boruto. Its the easisest way for karma whoring bcs you can literally day after day put here meme \"Naruto good Boruto bad\" And get tons of upvotes. Its exhausting af",
                    "author": "Roethen",
                    "id": "gh284cg",
                    "parent_id": "t1_gh1ije4",
                    "score": 7,
                    "created_utc": 1608975909.0,
                    "replies": [
                        {
                            "body": "Or the sakura useless\nI dont like sakura as a character but she not useless though",
                            "author": "dannylogue",
                            "id": "gh2amon",
                            "parent_id": "t1_gh284cg",
                            "score": 7,
                            "created_utc": 1608979213.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This sub as a whole is garbage, just the same exact memes reposted for the 73rd time every single day to farm karma",
                    "author": "sinisterxx",
                    "id": "gh2ufg1",
                    "parent_id": "t1_gh1ije4",
                    "score": 2,
                    "created_utc": 1608997904.0,
                    "replies": []
                },
                {
                    "body": "Milking the meme is just trashy, but Boruto IS horrible. All Jounins are trash, out of nowhere, kids have op stuff for close to no reason and storytelling is just so much less. If it was at least good on it's own, then maybe.",
                    "author": "Kazmir_here",
                    "id": "gh21mtt",
                    "parent_id": "t1_gh1ije4",
                    "score": -5,
                    "created_utc": 1608968002.0,
                    "replies": [
                        {
                            "body": "\"all jonins are trash\"...you mean shikamaru, sai(leader of anbu), Sakura, ino(leader of inteldevision),etc are trash...well, that's your opinion and I respect it...I just hope you don't go complete 180 when kawaki arrives...have a great day",
                            "author": "According_Way1560",
                            "id": "gh21xk6",
                            "parent_id": "t1_gh21mtt",
                            "score": 5,
                            "created_utc": 1608968335.0,
                            "replies": [
                                {
                                    "body": "I mean they are shown like that in power level. Shino was hellbent on killing Boruto. In a forest. He should've just anihulated him with a flick of his finger. Jonins do nothing and genins suddenly are everything skilled with minor exceptions when plot demands it.",
                                    "author": "Kazmir_here",
                                    "id": "gh221br",
                                    "parent_id": "t1_gh21xk6",
                                    "score": -4,
                                    "created_utc": 1608968450.0,
                                    "replies": [
                                        {
                                            "body": "Lol okay dude😂..it's episode 6 you are talking about here....it's clear to me that you haven't watched half of the anime and just hating on it for the sake of hating on it...if you had read the manga, you would know how important jounins are in the story...let's end this here...have a great day ahead",
                                            "author": "According_Way1560",
                                            "id": "gh2260y",
                                            "parent_id": "t1_gh221br",
                                            "score": 6,
                                            "created_utc": 1608968594.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You guys remember what naruto first did when he saw his dad Minato he punched him in the stomach what if it was different and there was an anime called minato and naruto was just a sequel this is the situation now",
            "author": "Dic-Smasher",
            "id": "gh2giva",
            "parent_id": "t3_kk7ozn",
            "score": 6,
            "created_utc": 1608986543.0,
            "replies": [
                {
                    "body": "Yep, Naruto would be called entitled for being a brat because of his parents sacrifice, Sasuke would be called entitled because of Itachi's sacrifice, and the Konoha 12 would just be called knock-offs of their parents, that are entitled because they live happy lives",
                    "author": "Aivaras12398",
                    "id": "gh2nb5f",
                    "parent_id": "t1_gh2giva",
                    "score": 6,
                    "created_utc": 1608992893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Keep in mind that Boruto's getting better now.",
            "author": "CuteDemonRosa",
            "id": "gh268tv",
            "parent_id": "t3_kk7ozn",
            "score": 4,
            "created_utc": 1608973496.0,
            "replies": []
        },
        {
            "body": "Neji was the day before",
            "author": "mo-did",
            "id": "gh2mbxr",
            "parent_id": "t3_kk7ozn",
            "score": 3,
            "created_utc": 1608992098.0,
            "replies": []
        },
        {
            "body": "I honestly like the series but not boruto himself he spund entitles af however alot of the other characters are not so bad i hope they do somthing that will shock him into accepting reality so he can actually become a Sasuke 2.0",
            "author": "omaritoz",
            "id": "gh2nyej",
            "parent_id": "t3_kk7ozn",
            "score": 2,
            "created_utc": 1608993396.0,
            "replies": []
        },
        {
            "body": "It wasn't about Boruto's birthday, it was about Himawari's. Did you even watch the damn show? I just finished EP. 179 of the anime the other day. The fighting sequences are done really well, and while it does progress slowly it's not really that bad overall. Boruto is an entitled little prick tho. Himawari is probably the best character in the show ngl.",
            "author": "Due-Studio5378",
            "id": "gh30v8m",
            "parent_id": "t3_kk7ozn",
            "score": 2,
            "created_utc": 1609001834.0,
            "replies": []
        },
        {
            "body": "Bro my sister's 7 and she don't give a fuck If one of my parents don't show up to her birthday. She only cares about blowing out the candles and getting a birthday cake. \nMan anime kids are soft and call themselves \"shinobi\".😂",
            "author": null,
            "id": "gh21gt7",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608967814.0,
            "replies": [
                {
                    "body": "Reminder, OPs meme is false. He litteraly told naruto he doesn’t care if he doesn’t come to his birthday, just come for himawaris birthday",
                    "author": "Nandoski_",
                    "id": "gh24yep",
                    "parent_id": "t1_gh21gt7",
                    "score": 8,
                    "created_utc": 1608971900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Accurate",
            "author": "Raffer1234567",
            "id": "gh24mue",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608971507.0,
            "replies": []
        },
        {
            "body": "Spoiled brat",
            "author": "skippingdimensions",
            "id": "gh2h28q",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608987138.0,
            "replies": []
        },
        {
            "body": "repost",
            "author": "UltraMooseMan",
            "id": "gh2xyhc",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1609000077.0,
            "replies": [
                {
                    "body": "The only things you find these days on this sub are reposts",
                    "author": "Densi69",
                    "id": "gh49jnz",
                    "parent_id": "t1_gh2xyhc",
                    "score": 1,
                    "created_utc": 1609027789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Twitter screenshots aren't memes",
            "author": "DerReudenboy",
            "id": "gh2ep36",
            "parent_id": "t3_kk7ozn",
            "score": 0,
            "created_utc": 1608984383.0,
            "replies": []
        },
        {
            "body": "Yeah like wtf",
            "author": "TyDaviesYT",
            "id": "gh1vgsu",
            "parent_id": "t3_kk7ozn",
            "score": -3,
            "created_utc": 1608961838.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gh1guv1",
            "parent_id": "t3_kk7ozn",
            "score": -3,
            "created_utc": 1608950622.0,
            "replies": [
                {
                    "body": "Here have some dislikes🥰",
                    "author": null,
                    "id": "gh1hxl9",
                    "parent_id": "t1_gh1guv1",
                    "score": 10,
                    "created_utc": 1608951382.0,
                    "replies": [
                        {
                            "body": "Anyone wondering what he commented to have disliked,it was a hate comment about boruto",
                            "author": null,
                            "id": "gh1ik68",
                            "parent_id": "t1_gh1hxl9",
                            "score": 8,
                            "created_utc": 1608951834.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "F for the died PLZ",
            "author": "GoZuck",
            "id": "gh1tef0",
            "parent_id": "t3_kk7ozn",
            "score": -9,
            "created_utc": 1608960070.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gh1xiro",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608963710.0,
            "replies": [
                {
                    "body": "I didn't find any posts that meet the matching requirements for r/dankruto. \n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n *Feedback? Hate? Visit r/repostsleuthbot - I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"kk7ozn\", \"meme_template\": null}) ]* \n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=kk7ozn&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=true&targetImageMatch=86&targetImageMemeMatch=96)",
                    "author": "RepostSleuthBot",
                    "id": "gh1xl7b",
                    "parent_id": "t1_gh1xiro",
                    "score": 0,
                    "created_utc": 1608963774.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Usually having a bad childhood incentivizes you to prevent your kids from having the same, but in most of those cases you usually have a bad parent you can learn what not to do from. Naruto never even got that, and went into being a dad completely flying blind. Now that he’s god-tier power level and achieved his ultimate dream of hokage, I’m fine with his last major struggle as a character being how to be a good dad. I have a lot of reasons I don’t really fuck with the Boruto series, but Naruto’s relationship with his son isn’t one of them.",
            "author": "HanataSanchou",
            "id": "gh24wbs",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608971830.0,
            "replies": []
        },
        {
            "body": "Also Naruto: Loves his birthday and Obito.",
            "author": "Th3SmartAlec",
            "id": "gh2fbkh",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608985155.0,
            "replies": []
        },
        {
            "body": "Only 2 of em were like this and those which he celebrated alone but after he turned 12 and became a genin, he got company",
            "author": null,
            "id": "gh2kufd",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608990829.0,
            "replies": []
        },
        {
            "body": "Boruto wouldn’t hang",
            "author": "Jaypurrp",
            "id": "gh2to6g",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1608997436.0,
            "replies": []
        },
        {
            "body": "Idk why I laughed at this!!!",
            "author": "Erzanaa_M",
            "id": "gh6nui5",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1609077360.0,
            "replies": []
        },
        {
            "body": "\\*sadness noise\\*",
            "author": "AsashinTsyuoi",
            "id": "gi73xgp",
            "parent_id": "t3_kk7ozn",
            "score": 1,
            "created_utc": 1609866664.0,
            "replies": []
        },
        {
            "body": "At least he got the most important thing in Naruto afterwards \n\n**Hashirama cells**",
            "author": "IPlayOnSmartFridge",
            "id": "gh1gqh3",
            "parent_id": "t1_gh1dvxi",
            "score": 129,
            "created_utc": 1608950535.0,
            "replies": [
                {
                    "body": "Them Hashirama cells do be hella OP\n\nImagine a character made entirely of them...would probably have some cool kekkei genkai",
                    "author": "SonicBlur254",
                    "id": "gh1gz8i",
                    "parent_id": "t1_gh1gqh3",
                    "score": 56,
                    "created_utc": 1608950710.0,
                    "replies": [
                        {
                            "body": ">Imagine a character made entirely of them...would probably have some cool kekkei genkai\n\nI don't think so. It's similar to broccoli, if you eat some of it then nice, but if you are 100% broccoli then you are dead.",
                            "author": "impersonal66",
                            "id": "gh1yvkd",
                            "parent_id": "t1_gh1gz8i",
                            "score": 25,
                            "created_utc": 1608965040.0,
                            "replies": [
                                {
                                    "body": "No I think it’s just called BEING Hashirama lol",
                                    "author": "Dier_runner",
                                    "id": "gh1zhd0",
                                    "parent_id": "t1_gh1yvkd",
                                    "score": 29,
                                    "created_utc": 1608965668.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Zetsu, hashirama... i dunno man, cant wait for a hashirama cell guy",
                            "author": "Reddit_User_Of_Self",
                            "id": "gh2fddo",
                            "parent_id": "t1_gh1gz8i",
                            "score": 6,
                            "created_utc": 1608985217.0,
                            "replies": []
                        },
                        {
                            "body": "Did you casually forget about Yamato?",
                            "author": "Boar_Hat",
                            "id": "gh2w8yq",
                            "parent_id": "t1_gh1gz8i",
                            "score": 3,
                            "created_utc": 1608999017.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh.. I thought we were going somewhere different with the answer. But yeah Hashirama cells, most important",
                    "author": null,
                    "id": "gh1qxf4",
                    "parent_id": "t1_gh1gqh3",
                    "score": 9,
                    "created_utc": 1608958080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At least he got the best present, and that is Sasuke finally coming back to the village",
            "author": "wisdomsharerv2",
            "id": "gh1qbjd",
            "parent_id": "t1_gh1dvxi",
            "score": 11,
            "created_utc": 1608957603.0,
            "replies": [
                {
                    "body": "Then leaving and not coming back in years.",
                    "author": "Abdur278",
                    "id": "gh2dfol",
                    "parent_id": "t1_gh1qbjd",
                    "score": 7,
                    "created_utc": 1608982784.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Depends on how you want to view his birthday. Do you count it as when the sun is up, or at midnight? It was probably around midnight when Minato arrived on the battlefield, since he did mention wanting to tell Naruto something important, but he'd save it for later",
            "author": "gotumms146",
            "id": "gh6tpic",
            "parent_id": "t1_gh1dvxi",
            "score": 2,
            "created_utc": 1609081368.0,
            "replies": []
        },
        {
            "body": "Also I hate this meme, Boruto didn't care for his own birthday, it was because Naruto promised he would be there for Himawari's bday and ruined it by sending a shadow clone that went poof.",
            "author": "Shrenade514",
            "id": "gh1a907",
            "parent_id": "t1_gh16qdx",
            "score": 436,
            "created_utc": 1608945914.0,
            "replies": [
                {
                    "body": "Yeah man dropped the cake and everything",
                    "author": "Qu1nn1fer",
                    "id": "gh1g3rv",
                    "parent_id": "t1_gh1a907",
                    "score": 226,
                    "created_utc": 1608950085.0,
                    "replies": [
                        {
                            "body": "The cake though 😱😭😭",
                            "author": null,
                            "id": "gh1hupf",
                            "parent_id": "t1_gh1g3rv",
                            "score": 119,
                            "created_utc": 1608951325.0,
                            "replies": [
                                {
                                    "body": "It sucks because you think naruto not having a dad would make him want to be the best dad ever but hes just not, would've been some nice character progression for the guy they did his story dirty",
                                    "author": "Qu1nn1fer",
                                    "id": "gh1i2fh",
                                    "parent_id": "t1_gh1hupf",
                                    "score": 105,
                                    "created_utc": 1608951482.0,
                                    "replies": [
                                        {
                                            "body": "The reason Kishimoto made Sasuke and Naruto bad fathers is because he was projecting himself onto them. He was so busy with the manga, he felt like he missed out on his own kids' childhoods. That is the true explanation for Sasuke being gone all of those years, and Naruto being negligent",
                                            "author": null,
                                            "id": "gh1m6ww",
                                            "parent_id": "t1_gh1i2fh",
                                            "score": 155,
                                            "created_utc": 1608954478.0,
                                            "replies": [
                                                {
                                                    "body": "Thats... actually really sad",
                                                    "author": "Qu1nn1fer",
                                                    "id": "gh1m8pi",
                                                    "parent_id": "t1_gh1m6ww",
                                                    "score": 124,
                                                    "created_utc": 1608954514.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
                                                    "author": "DonnyProcs",
                                                    "id": "gh1pbxg",
                                                    "parent_id": "t1_gh1m6ww",
                                                    "score": 36,
                                                    "created_utc": 1608956838.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                                                            "author": null,
                                                            "id": "gh1ufc2",
                                                            "parent_id": "t1_gh1pbxg",
                                                            "score": 50,
                                                            "created_utc": 1608960937.0,
                                                            "replies": [
                                                                {
                                                                    "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                                                                    "author": "DonnyProcs",
                                                                    "id": "gh1v1fj",
                                                                    "parent_id": "t1_gh1ufc2",
                                                                    "score": 13,
                                                                    "created_utc": 1608961460.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                                                            "author": "revmun",
                                                                            "id": "gh2yvat",
                                                                            "parent_id": "t1_gh1v1fj",
                                                                            "score": 2,
                                                                            "created_utc": 1609000632.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "We gotta keep some things in mind about naruto\n\n1. Being hokage was always his dream. Sure he wanted to have a family too, but he wasn’t screaming that at his friends or opponents at every opportunity. Not saying he’s giving his family the backseat intentionally, but he finally achieved his dream and likely wants to do it to the best of his abilities. Sending a shadow clone to sing and cut cake prolly seemed pretty justifiable to him considering he wanted to be there but still had duties at the office. the work he’s doing is a far cry from his time as a ninja; he was never studious and when fighting he thrived off being unpredictable so paper work and constant meetings are probably more of a drag for him than anything shikamaru has ever experienced in his life.\n\n2. he never had a good example of a father figure/family man. All of his male role models (jiriyah, kakashi, killer bee even) were single dudes who were extremely dedicated to their work. also, many of the adults in the village didn’t want their kids anywhere near him while he was growing up, so he could barely even steal glances of how a traditional family interacts with each other w/o it backfiring on him. \n\nI think his portrayal so far has been accurate and inline with his continued development. It’s all still pretty new to him and he hasn’t found a balance yet.",
                                            "author": "ayochaser17",
                                            "id": "gh250qf",
                                            "parent_id": "t1_gh1i2fh",
                                            "score": 26,
                                            "created_utc": 1608971977.0,
                                            "replies": [
                                                {
                                                    "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
                                                    "author": "Blue_Raichu",
                                                    "id": "gh27b1e",
                                                    "parent_id": "t1_gh250qf",
                                                    "score": 10,
                                                    "created_utc": 1608974848.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "He improved after momoshiki arc naruto and boruto are chill as we expected",
                                            "author": null,
                                            "id": "gh1inav",
                                            "parent_id": "t1_gh1i2fh",
                                            "score": 29,
                                            "created_utc": 1608951897.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It makes since because Naruto had no basis for what a father should act like day-to-day.",
                                            "author": "Blue_Owl2",
                                            "id": "gh32lc8",
                                            "parent_id": "t1_gh1i2fh",
                                            "score": 3,
                                            "created_utc": 1609002872.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah I just wish we had more footage of the man trying a bit",
                                                    "author": "Qu1nn1fer",
                                                    "id": "gh37ej1",
                                                    "parent_id": "t1_gh32lc8",
                                                    "score": 3,
                                                    "created_utc": 1609005736.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah, I felt really sad for himawari\n\nEven though it's all fictional, it really struck",
                            "author": "shab-re",
                            "id": "gh1ym6q",
                            "parent_id": "t1_gh1g3rv",
                            "score": 6,
                            "created_utc": 1608964778.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thanks for writing that...I hope people read this...and the trend changes of hating on boruto...you have my respect sir",
                    "author": "According_Way1560",
                    "id": "gh1ingp",
                    "parent_id": "t1_gh1a907",
                    "score": 19,
                    "created_utc": 1608951900.0,
                    "replies": []
                },
                {
                    "body": "Yeah!! He didn't want Himawari to be sad at such . He didn't care if Naruto was there for his birthday. All he cared was about his Younger sister.",
                    "author": "PichKari_KinG",
                    "id": "gh279fj",
                    "parent_id": "t1_gh1a907",
                    "score": 5,
                    "created_utc": 1608974791.0,
                    "replies": []
                },
                {
                    "body": "Yea fuck naruto. Forgot his ninja way",
                    "author": "Im_alright_19",
                    "id": "gh1goal",
                    "parent_id": "t1_gh1a907",
                    "score": 14,
                    "created_utc": 1608950492.0,
                    "replies": [
                        {
                            "body": "Why does it matter. A shallow clone is basically the same thing since you get all the memories",
                            "author": null,
                            "id": "gh1xu6l",
                            "parent_id": "t1_gh1goal",
                            "score": -4,
                            "created_utc": 1608964017.0,
                            "replies": [
                                {
                                    "body": "Its not the same as actually being there in person.",
                                    "author": "Im_alright_19",
                                    "id": "gh22o5z",
                                    "parent_id": "t1_gh1xu6l",
                                    "score": 13,
                                    "created_utc": 1608969181.0,
                                    "replies": [
                                        {
                                            "body": "The main reason I fail to relate to Boruto, when I was a kid I would have killed for a shadow clone of my mom/dad since they worked all the time",
                                            "author": "Ozzymandious",
                                            "id": "gh24eve",
                                            "parent_id": "t1_gh22o5z",
                                            "score": 5,
                                            "created_utc": 1608971238.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Just saying wouldn't it be worse for him showing up to it? because if he did then if there was an emergency or something people would have to go and ruin the whole party and Naruto would have to cut it short so I think it's better he wasn't there",
                            "author": "ektdvb2",
                            "id": "gh2zs0r",
                            "parent_id": "t1_gh1goal",
                            "score": 1,
                            "created_utc": 1609001180.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah but still at least he had a dad, Narutos father and mother was murdered over him and the thing that killed them is inside of him and he got to speak to his parents 3 times in total 1 of them was his mother for a bit then next was his father for a little less then the next time was in battle with his father where they only briefly talked about the fight during the fight so borutos having it alot easier than Naruto, Naruto would be more than happy to even get a shadow clone of his father oh and his mother is alive and taking care of him while Naruto took care of himself, so who has it harder",
                    "author": "ektdvb2",
                    "id": "gh30zrt",
                    "parent_id": "t1_gh1a907",
                    "score": 0,
                    "created_utc": 1609001909.0,
                    "replies": [
                        {
                            "body": "Cool story but nobody said Boruto had it harder",
                            "author": "Shrenade514",
                            "id": "gh320s0",
                            "parent_id": "t1_gh30zrt",
                            "score": 3,
                            "created_utc": 1609002526.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To keep it more real, I'm willing to bet my fellow millenials or even younger people hate when older people judge us because we didn't go to school through a warzone but also don't want our depression and issues delegitimized.\n\nBut these same people will delegitimize Boruto because he didn't go through what Naruto did.",
            "author": "MarcoMaroon",
            "id": "gh1eky3",
            "parent_id": "t1_gh16qdx",
            "score": 58,
            "created_utc": 1608948992.0,
            "replies": []
        },
        {
            "body": "Gatekeeping basically. Just because Naruto went through some extreme shit, apparently Boruto isn't allowed to feel bad about anything less.\n\nBoruto as a show still sucks tho. Just that this isn't really a valid criticism in my eyes.",
            "author": "darkblaze76",
            "id": "gh1nwys",
            "parent_id": "t1_gh16qdx",
            "score": 12,
            "created_utc": 1608955766.0,
            "replies": []
        },
        {
            "body": "It's because Reddit is an older site and people here are old enough to begin complaining about youngsters)",
            "author": "Ezreon",
            "id": "gh1j5e7",
            "parent_id": "t1_gh16qdx",
            "score": 8,
            "created_utc": 1608952263.0,
            "replies": [
                {
                    "body": "Yeah, Millenials and older Gen Z are becoming like boomers lmao",
                    "author": "Aivaras12398",
                    "id": "gh2mflm",
                    "parent_id": "t1_gh1j5e7",
                    "score": 3,
                    "created_utc": 1608992182.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it's not that they don't matter, but you should not be a bitch about it. if my ancestors went through worst stuff and lived, I can go through my own smaller scale troubles without throwing tantrums.",
            "author": "orva12",
            "id": "gh2o35d",
            "parent_id": "t1_gh16qdx",
            "score": 3,
            "created_utc": 1608993499.0,
            "replies": [
                {
                    "body": "I shoulda mentioned that Boruto's behavior isn't all justifiable. But his anger and disappointment at his father definitely is",
                    "author": "Rikuskill",
                    "id": "gh2spjg",
                    "parent_id": "t1_gh2o35d",
                    "score": 1,
                    "created_utc": 1608996796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True but they’re shit compared to that",
            "author": "The-dark-lightskin",
            "id": "gh2z1k9",
            "parent_id": "t1_gh16qdx",
            "score": 2,
            "created_utc": 1609000737.0,
            "replies": []
        },
        {
            "body": "No shit, but at the end of the day I know people that were raised in similar situations to Boruto, but the still never displayed shitty behaviour.\n\nI was raised in an environment were I wouldn't have several birthdays, but I always knew that my parents had to work to bring food on the table. Boruto's troubles are nothing in comparison to Naruto and he makes for a shit character if compared to Himawari, Shikadai and Sarada.\n\nEdit: Grammar problems here and there.",
            "author": "AsuraDeo",
            "id": "gh1ehzb",
            "parent_id": "t1_gh16qdx",
            "score": 5,
            "created_utc": 1608948932.0,
            "replies": [
                {
                    "body": "His bad attitude lasted for less than 10 chapters, idk why people make such a big deal out of it.",
                    "author": "bendstraw",
                    "id": "gh1iaxe",
                    "parent_id": "t1_gh1ehzb",
                    "score": 21,
                    "created_utc": 1608951651.0,
                    "replies": []
                },
                {
                    "body": "Oh yeah Boruto has a separate spoiled prodigy brat issue, but I wanted to point out that his relationship with his dad is actually handled pretty well. That said I'm only 50 eps in, so they may fuck it up later and I wouldn't know lol",
                    "author": "Rikuskill",
                    "id": "gh1entv",
                    "parent_id": "t1_gh1ehzb",
                    "score": 30,
                    "created_utc": 1608949049.0,
                    "replies": [
                        {
                            "body": "That was my problem with him too. Boruto started to  not get as much attention from when he turned 8 years old or so. Naruto did break a promise, but for him his village is his family. Some of the anime is skippable. I tend to fast forward it through some content.",
                            "author": "AsuraDeo",
                            "id": "gh1fgp8",
                            "parent_id": "t1_gh1entv",
                            "score": 10,
                            "created_utc": 1608949622.0,
                            "replies": [
                                {
                                    "body": "Same about skipping through stuff. Some of the scenes drag their feet so purposefully I can't take it.",
                                    "author": "Rikuskill",
                                    "id": "gh1gsnq",
                                    "parent_id": "t1_gh1fgp8",
                                    "score": 3,
                                    "created_utc": 1608950578.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well Boruto is supposed to be like this. He starts off as this annoying, ignorant brat but he changes. Just look at him in the flashforward scene. He isn't going to stay this way lol. \n\nNaruto went from being an annoying brat in the first few episodes, to bowing down to the Raikage for his own enemy. He went from not understanding revenge, to knowing it. It's called \"character development\"",
                    "author": null,
                    "id": "gh1mlla",
                    "parent_id": "t1_gh1ehzb",
                    "score": 13,
                    "created_utc": 1608954779.0,
                    "replies": []
                },
                {
                    "body": "I didnt even get to see my dad for most of my birthdays as a kid and even when I did both my mom and him were busy with a hundred other things",
                    "author": "DonnyProcs",
                    "id": "gh1r0sz",
                    "parent_id": "t1_gh1ehzb",
                    "score": 2,
                    "created_utc": 1608958154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How could you not compare the struggles between Kid Naruto and Boruto? \n\nNaruto’s childhood was shit while Boruto is spoiled. \n\nNot bashing Boruto, I’m just saying.",
            "author": "autonomousfailure",
            "id": "gh1n1n3",
            "parent_id": "t1_gh16qdx",
            "score": -3,
            "created_utc": 1608955113.0,
            "replies": []
        },
        {
            "body": "And who in gods name was saying that he nullify Brouto's trouble it's just annoying to see boruto bitch about such minor things compared to naruto",
            "author": "thepowerfwoth",
            "id": "gh1mx0a",
            "parent_id": "t1_gh16qdx",
            "score": -7,
            "created_utc": 1608955017.0,
            "replies": []
        },
        {
            "body": "You’re right. Boruto has gone through some dark shit like... oh and... And then... uhm... I guess he struggled when he cheated on the Chunin exam and his Dad, the Leader of the entire nation and Hero of the Shinobi World forgot to come home on time for his kids birthday. You’re right. Boruto has it rough.\n\n\n\nOutside or Boruto though. Yes, you can’t compare struggles. But when you are simply evaluating a continuation of an Anime and one is good and the other is fucking boring, then sure.",
            "author": "KazPrime",
            "id": "gh1a895",
            "parent_id": "t1_gh16qdx",
            "score": -21,
            "created_utc": 1608945900.0,
            "replies": [
                {
                    "body": "Man, the kid's dad didn't show up to his birthday. Shit hurts. You know your dad's job is very important, but he sacrifices his relationship with his family for it. Boruto, as a teen that thinks he knows how the world works, resents his dad for it.\n\nBoruto is really boring, I'll agree though. Then again, Shippuden had a lot of fuckign boring parts. The last like, fourth of the show was a massive slog to get through. There's just a lot of legit flaws with Boruto that I see get overlooked in favor of dumb, sometimes false ones.",
                    "author": "Rikuskill",
                    "id": "gh1aocq",
                    "parent_id": "t1_gh1a895",
                    "score": 25,
                    "created_utc": 1608946217.0,
                    "replies": [
                        {
                            "body": "Yeah but that is kind of the juxtaposition. Naruto worked and fought hard so that the Children of Konoha wouldn’t have childhood’s like his. The indirect cause is that his kid is spoiled and doesn’t have time for him. An interesting story/story arc. \n\nWhat is done in Boruto the anime (haven’t read the manga yet) is boring as fuck. There are gaping issues with literally everything about it. Really hate what they did to certain characters. Because Boruto doesn’t struggle and just whines about everything there isn’t anything to like him other than he is Naruto/Hinata’s son. I mean the dude is more gifted than most of his peers and he still ends up cheating at the exams. Honestly he would have made a better “foil” arc villain than hero.",
                            "author": "KazPrime",
                            "id": "gh1b41a",
                            "parent_id": "t1_gh1aocq",
                            "score": -9,
                            "created_utc": 1608946520.0,
                            "replies": [
                                {
                                    "body": "I'm only about halfway thru the anime, but I sorta agree. However, there are some important moments that throw Boruto's shitty smug confidence in his face. When Kakashi pins him down in the Genin exams and shows that he doesn't have enough willpower to break his arm to escape the hold, I was like YOOO YES! But it sorta ended with Boruto just organizing the others to win. Meh.\n\nThere seems to be a pattern of cool setups with really, really meh conclusions. Every villain so far fucking sucks.",
                                    "author": "Rikuskill",
                                    "id": "gh1ejgr",
                                    "parent_id": "t1_gh1b41a",
                                    "score": 9,
                                    "created_utc": 1608948963.0,
                                    "replies": []
                                },
                                {
                                    "body": "\"haven't read the manga\" oh, so then you're admitting you have no idea what you're talking about?\n\nYour take on Boruto is not nearly as hot as you think it is. Personally it doesn't matter to me if anyone else likes it or not because I'm over here living my best Boruto life, but everything you just talked about is the entire point of Boruto.\n\nNaruto had nothing, and he got everything. Boruto has everything and he will be left with nothing. If they just rewrote Naruto that shit would be boring af. This is a completely different take on the Naruto universe, and especially with Kishi back at the helm writing the manga we are already moving along swiftly and awesomely.",
                                    "author": "eorabs",
                                    "id": "gh1cnnl",
                                    "parent_id": "t1_gh1b41a",
                                    "score": 8,
                                    "created_utc": 1608947617.0,
                                    "replies": [
                                        {
                                            "body": "I have read the manga and I still find it boring as fuck\n\nEspecially in comparison to Naruto. The lack of actual techniques, the fact that Naruto and Sasuke got nerfed vastly. The lack of explanation around Kara.\n\nThing is, Boruto's end wouldn't be sad, he will most likely end happy with his family or accomplishing his goals of being a \"Shadow Hokage.\"\n\nNaruto and Sasuke meeting their end is highly unlikely. Boruto is already losing demand among the people in Japan. Anime sales are going well, but manga sales are barely even on par with what Naruto was.",
                                            "author": "AsuraDeo",
                                            "id": "gh1euv1",
                                            "parent_id": "t1_gh1cnnl",
                                            "score": 0,
                                            "created_utc": 1608949190.0,
                                            "replies": [
                                                {
                                                    "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
                                                    "author": "eorabs",
                                                    "id": "gh1ovd6",
                                                    "parent_id": "t1_gh1euv1",
                                                    "score": 6,
                                                    "created_utc": 1608956485.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
                                                    "author": "According_Way1560",
                                                    "id": "gh1jfeb",
                                                    "parent_id": "t1_gh1euv1",
                                                    "score": 5,
                                                    "created_utc": 1608952459.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Imagine adult sasuke vs madara",
            "author": "mo-did",
            "id": "gh2myhk",
            "parent_id": "t1_gh1ih8h",
            "score": 9,
            "created_utc": 1608992613.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ghd0g1v",
                    "parent_id": "t1_gh2myhk",
                    "score": 2,
                    "created_utc": 1609215139.0,
                    "replies": [
                        {
                            "body": "Honestly I Kinda did that as I watch it so long after part 1 I forgot so much",
                            "author": "mo-did",
                            "id": "ghe2zt0",
                            "parent_id": "t1_ghd0g1v",
                            "score": 1,
                            "created_utc": 1609249189.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Basically it's because in a sequel series, you want some sort of story relating back to the old main characters. If you want to do that through the character's kids, you either have to make the parent so perfect that it creates tension for the kids, or you make them flawed in some way. Flawed characters are almost always more interesting.\n\nIt's also just hard to make characters interesting if their backstory is all about how great their parents and childhood were.",
            "author": "Jeffeffery",
            "id": "gh20ye5",
            "parent_id": "t1_gh1pm7g",
            "score": 17,
            "created_utc": 1608967242.0,
            "replies": []
        },
        {
            "body": "The 'happy birthday' bit was just before sunrise, but it has already beem his birthday for a few hpurs after they started 'fighting through the night'. Obito pointed it out during the fighting that it was Naruto' bday",
            "author": "youmemba",
            "id": "gh2marg",
            "parent_id": "t1_gh23w5m",
            "score": 4,
            "created_utc": 1608992071.0,
            "replies": [
                {
                    "body": "Right, and the finale with Six Paths Obito and Madara and Kaguya would've gone all night. Neji's death was still likely the day before.\n\nBut hey, he got his best friend back as a bday gift lol",
                    "author": "Condor193",
                    "id": "gh3d56f",
                    "parent_id": "t1_gh2marg",
                    "score": 2,
                    "created_utc": 1609008908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you expect Naruto fans to have basic reading comprehension? Half of them can't figure shit out unless it's stated dramatically by a side character after a flashback",
            "author": "Aivaras12398",
            "id": "gh2mont",
            "parent_id": "t1_gh24w2k",
            "score": 12,
            "created_utc": 1608992397.0,
            "replies": []
        },
        {
            "body": "This is posted like 18 times a month",
            "author": "Pac_Zach_Attack",
            "id": "gh1ka7p",
            "parent_id": "t1_gh1ije4",
            "score": 27,
            "created_utc": 1608953079.0,
            "replies": []
        },
        {
            "body": "Every post from dankruto i see on my main page is about shitting on Boruto. Its the easisest way for karma whoring bcs you can literally day after day put here meme \"Naruto good Boruto bad\" And get tons of upvotes. Its exhausting af",
            "author": "Roethen",
            "id": "gh284cg",
            "parent_id": "t1_gh1ije4",
            "score": 7,
            "created_utc": 1608975909.0,
            "replies": [
                {
                    "body": "Or the sakura useless\nI dont like sakura as a character but she not useless though",
                    "author": "dannylogue",
                    "id": "gh2amon",
                    "parent_id": "t1_gh284cg",
                    "score": 7,
                    "created_utc": 1608979213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This sub as a whole is garbage, just the same exact memes reposted for the 73rd time every single day to farm karma",
            "author": "sinisterxx",
            "id": "gh2ufg1",
            "parent_id": "t1_gh1ije4",
            "score": 2,
            "created_utc": 1608997904.0,
            "replies": []
        },
        {
            "body": "Milking the meme is just trashy, but Boruto IS horrible. All Jounins are trash, out of nowhere, kids have op stuff for close to no reason and storytelling is just so much less. If it was at least good on it's own, then maybe.",
            "author": "Kazmir_here",
            "id": "gh21mtt",
            "parent_id": "t1_gh1ije4",
            "score": -5,
            "created_utc": 1608968002.0,
            "replies": [
                {
                    "body": "\"all jonins are trash\"...you mean shikamaru, sai(leader of anbu), Sakura, ino(leader of inteldevision),etc are trash...well, that's your opinion and I respect it...I just hope you don't go complete 180 when kawaki arrives...have a great day",
                    "author": "According_Way1560",
                    "id": "gh21xk6",
                    "parent_id": "t1_gh21mtt",
                    "score": 5,
                    "created_utc": 1608968335.0,
                    "replies": [
                        {
                            "body": "I mean they are shown like that in power level. Shino was hellbent on killing Boruto. In a forest. He should've just anihulated him with a flick of his finger. Jonins do nothing and genins suddenly are everything skilled with minor exceptions when plot demands it.",
                            "author": "Kazmir_here",
                            "id": "gh221br",
                            "parent_id": "t1_gh21xk6",
                            "score": -4,
                            "created_utc": 1608968450.0,
                            "replies": [
                                {
                                    "body": "Lol okay dude😂..it's episode 6 you are talking about here....it's clear to me that you haven't watched half of the anime and just hating on it for the sake of hating on it...if you had read the manga, you would know how important jounins are in the story...let's end this here...have a great day ahead",
                                    "author": "According_Way1560",
                                    "id": "gh2260y",
                                    "parent_id": "t1_gh221br",
                                    "score": 6,
                                    "created_utc": 1608968594.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep, Naruto would be called entitled for being a brat because of his parents sacrifice, Sasuke would be called entitled because of Itachi's sacrifice, and the Konoha 12 would just be called knock-offs of their parents, that are entitled because they live happy lives",
            "author": "Aivaras12398",
            "id": "gh2nb5f",
            "parent_id": "t1_gh2giva",
            "score": 6,
            "created_utc": 1608992893.0,
            "replies": []
        },
        {
            "body": "Reminder, OPs meme is false. He litteraly told naruto he doesn’t care if he doesn’t come to his birthday, just come for himawaris birthday",
            "author": "Nandoski_",
            "id": "gh24yep",
            "parent_id": "t1_gh21gt7",
            "score": 8,
            "created_utc": 1608971900.0,
            "replies": []
        },
        {
            "body": "The only things you find these days on this sub are reposts",
            "author": "Densi69",
            "id": "gh49jnz",
            "parent_id": "t1_gh2xyhc",
            "score": 1,
            "created_utc": 1609027789.0,
            "replies": []
        },
        {
            "body": "Here have some dislikes🥰",
            "author": null,
            "id": "gh1hxl9",
            "parent_id": "t1_gh1guv1",
            "score": 10,
            "created_utc": 1608951382.0,
            "replies": [
                {
                    "body": "Anyone wondering what he commented to have disliked,it was a hate comment about boruto",
                    "author": null,
                    "id": "gh1ik68",
                    "parent_id": "t1_gh1hxl9",
                    "score": 8,
                    "created_utc": 1608951834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't find any posts that meet the matching requirements for r/dankruto. \n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n *Feedback? Hate? Visit r/repostsleuthbot - I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Negative&message={\"post_id\": \"kk7ozn\", \"meme_template\": null}) ]* \n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=kk7ozn&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=true&targetImageMatch=86&targetImageMemeMatch=96)",
            "author": "RepostSleuthBot",
            "id": "gh1xl7b",
            "parent_id": "t1_gh1xiro",
            "score": 0,
            "created_utc": 1608963774.0,
            "replies": []
        },
        {
            "body": "Them Hashirama cells do be hella OP\n\nImagine a character made entirely of them...would probably have some cool kekkei genkai",
            "author": "SonicBlur254",
            "id": "gh1gz8i",
            "parent_id": "t1_gh1gqh3",
            "score": 56,
            "created_utc": 1608950710.0,
            "replies": [
                {
                    "body": ">Imagine a character made entirely of them...would probably have some cool kekkei genkai\n\nI don't think so. It's similar to broccoli, if you eat some of it then nice, but if you are 100% broccoli then you are dead.",
                    "author": "impersonal66",
                    "id": "gh1yvkd",
                    "parent_id": "t1_gh1gz8i",
                    "score": 25,
                    "created_utc": 1608965040.0,
                    "replies": [
                        {
                            "body": "No I think it’s just called BEING Hashirama lol",
                            "author": "Dier_runner",
                            "id": "gh1zhd0",
                            "parent_id": "t1_gh1yvkd",
                            "score": 29,
                            "created_utc": 1608965668.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Zetsu, hashirama... i dunno man, cant wait for a hashirama cell guy",
                    "author": "Reddit_User_Of_Self",
                    "id": "gh2fddo",
                    "parent_id": "t1_gh1gz8i",
                    "score": 6,
                    "created_utc": 1608985217.0,
                    "replies": []
                },
                {
                    "body": "Did you casually forget about Yamato?",
                    "author": "Boar_Hat",
                    "id": "gh2w8yq",
                    "parent_id": "t1_gh1gz8i",
                    "score": 3,
                    "created_utc": 1608999017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh.. I thought we were going somewhere different with the answer. But yeah Hashirama cells, most important",
            "author": null,
            "id": "gh1qxf4",
            "parent_id": "t1_gh1gqh3",
            "score": 9,
            "created_utc": 1608958080.0,
            "replies": []
        },
        {
            "body": "Then leaving and not coming back in years.",
            "author": "Abdur278",
            "id": "gh2dfol",
            "parent_id": "t1_gh1qbjd",
            "score": 7,
            "created_utc": 1608982784.0,
            "replies": []
        },
        {
            "body": "Yeah man dropped the cake and everything",
            "author": "Qu1nn1fer",
            "id": "gh1g3rv",
            "parent_id": "t1_gh1a907",
            "score": 226,
            "created_utc": 1608950085.0,
            "replies": [
                {
                    "body": "The cake though 😱😭😭",
                    "author": null,
                    "id": "gh1hupf",
                    "parent_id": "t1_gh1g3rv",
                    "score": 119,
                    "created_utc": 1608951325.0,
                    "replies": [
                        {
                            "body": "It sucks because you think naruto not having a dad would make him want to be the best dad ever but hes just not, would've been some nice character progression for the guy they did his story dirty",
                            "author": "Qu1nn1fer",
                            "id": "gh1i2fh",
                            "parent_id": "t1_gh1hupf",
                            "score": 105,
                            "created_utc": 1608951482.0,
                            "replies": [
                                {
                                    "body": "The reason Kishimoto made Sasuke and Naruto bad fathers is because he was projecting himself onto them. He was so busy with the manga, he felt like he missed out on his own kids' childhoods. That is the true explanation for Sasuke being gone all of those years, and Naruto being negligent",
                                    "author": null,
                                    "id": "gh1m6ww",
                                    "parent_id": "t1_gh1i2fh",
                                    "score": 155,
                                    "created_utc": 1608954478.0,
                                    "replies": [
                                        {
                                            "body": "Thats... actually really sad",
                                            "author": "Qu1nn1fer",
                                            "id": "gh1m8pi",
                                            "parent_id": "t1_gh1m6ww",
                                            "score": 124,
                                            "created_utc": 1608954514.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
                                            "author": "DonnyProcs",
                                            "id": "gh1pbxg",
                                            "parent_id": "t1_gh1m6ww",
                                            "score": 36,
                                            "created_utc": 1608956838.0,
                                            "replies": [
                                                {
                                                    "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                                                    "author": null,
                                                    "id": "gh1ufc2",
                                                    "parent_id": "t1_gh1pbxg",
                                                    "score": 50,
                                                    "created_utc": 1608960937.0,
                                                    "replies": [
                                                        {
                                                            "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                                                            "author": "DonnyProcs",
                                                            "id": "gh1v1fj",
                                                            "parent_id": "t1_gh1ufc2",
                                                            "score": 13,
                                                            "created_utc": 1608961460.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                                                    "author": "revmun",
                                                                    "id": "gh2yvat",
                                                                    "parent_id": "t1_gh1v1fj",
                                                                    "score": 2,
                                                                    "created_utc": 1609000632.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "We gotta keep some things in mind about naruto\n\n1. Being hokage was always his dream. Sure he wanted to have a family too, but he wasn’t screaming that at his friends or opponents at every opportunity. Not saying he’s giving his family the backseat intentionally, but he finally achieved his dream and likely wants to do it to the best of his abilities. Sending a shadow clone to sing and cut cake prolly seemed pretty justifiable to him considering he wanted to be there but still had duties at the office. the work he’s doing is a far cry from his time as a ninja; he was never studious and when fighting he thrived off being unpredictable so paper work and constant meetings are probably more of a drag for him than anything shikamaru has ever experienced in his life.\n\n2. he never had a good example of a father figure/family man. All of his male role models (jiriyah, kakashi, killer bee even) were single dudes who were extremely dedicated to their work. also, many of the adults in the village didn’t want their kids anywhere near him while he was growing up, so he could barely even steal glances of how a traditional family interacts with each other w/o it backfiring on him. \n\nI think his portrayal so far has been accurate and inline with his continued development. It’s all still pretty new to him and he hasn’t found a balance yet.",
                                    "author": "ayochaser17",
                                    "id": "gh250qf",
                                    "parent_id": "t1_gh1i2fh",
                                    "score": 26,
                                    "created_utc": 1608971977.0,
                                    "replies": [
                                        {
                                            "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
                                            "author": "Blue_Raichu",
                                            "id": "gh27b1e",
                                            "parent_id": "t1_gh250qf",
                                            "score": 10,
                                            "created_utc": 1608974848.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "He improved after momoshiki arc naruto and boruto are chill as we expected",
                                    "author": null,
                                    "id": "gh1inav",
                                    "parent_id": "t1_gh1i2fh",
                                    "score": 29,
                                    "created_utc": 1608951897.0,
                                    "replies": []
                                },
                                {
                                    "body": "It makes since because Naruto had no basis for what a father should act like day-to-day.",
                                    "author": "Blue_Owl2",
                                    "id": "gh32lc8",
                                    "parent_id": "t1_gh1i2fh",
                                    "score": 3,
                                    "created_utc": 1609002872.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I just wish we had more footage of the man trying a bit",
                                            "author": "Qu1nn1fer",
                                            "id": "gh37ej1",
                                            "parent_id": "t1_gh32lc8",
                                            "score": 3,
                                            "created_utc": 1609005736.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah, I felt really sad for himawari\n\nEven though it's all fictional, it really struck",
                    "author": "shab-re",
                    "id": "gh1ym6q",
                    "parent_id": "t1_gh1g3rv",
                    "score": 6,
                    "created_utc": 1608964778.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for writing that...I hope people read this...and the trend changes of hating on boruto...you have my respect sir",
            "author": "According_Way1560",
            "id": "gh1ingp",
            "parent_id": "t1_gh1a907",
            "score": 19,
            "created_utc": 1608951900.0,
            "replies": []
        },
        {
            "body": "Yeah!! He didn't want Himawari to be sad at such . He didn't care if Naruto was there for his birthday. All he cared was about his Younger sister.",
            "author": "PichKari_KinG",
            "id": "gh279fj",
            "parent_id": "t1_gh1a907",
            "score": 5,
            "created_utc": 1608974791.0,
            "replies": []
        },
        {
            "body": "Yea fuck naruto. Forgot his ninja way",
            "author": "Im_alright_19",
            "id": "gh1goal",
            "parent_id": "t1_gh1a907",
            "score": 14,
            "created_utc": 1608950492.0,
            "replies": [
                {
                    "body": "Why does it matter. A shallow clone is basically the same thing since you get all the memories",
                    "author": null,
                    "id": "gh1xu6l",
                    "parent_id": "t1_gh1goal",
                    "score": -4,
                    "created_utc": 1608964017.0,
                    "replies": [
                        {
                            "body": "Its not the same as actually being there in person.",
                            "author": "Im_alright_19",
                            "id": "gh22o5z",
                            "parent_id": "t1_gh1xu6l",
                            "score": 13,
                            "created_utc": 1608969181.0,
                            "replies": [
                                {
                                    "body": "The main reason I fail to relate to Boruto, when I was a kid I would have killed for a shadow clone of my mom/dad since they worked all the time",
                                    "author": "Ozzymandious",
                                    "id": "gh24eve",
                                    "parent_id": "t1_gh22o5z",
                                    "score": 5,
                                    "created_utc": 1608971238.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Just saying wouldn't it be worse for him showing up to it? because if he did then if there was an emergency or something people would have to go and ruin the whole party and Naruto would have to cut it short so I think it's better he wasn't there",
                    "author": "ektdvb2",
                    "id": "gh2zs0r",
                    "parent_id": "t1_gh1goal",
                    "score": 1,
                    "created_utc": 1609001180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah but still at least he had a dad, Narutos father and mother was murdered over him and the thing that killed them is inside of him and he got to speak to his parents 3 times in total 1 of them was his mother for a bit then next was his father for a little less then the next time was in battle with his father where they only briefly talked about the fight during the fight so borutos having it alot easier than Naruto, Naruto would be more than happy to even get a shadow clone of his father oh and his mother is alive and taking care of him while Naruto took care of himself, so who has it harder",
            "author": "ektdvb2",
            "id": "gh30zrt",
            "parent_id": "t1_gh1a907",
            "score": 0,
            "created_utc": 1609001909.0,
            "replies": [
                {
                    "body": "Cool story but nobody said Boruto had it harder",
                    "author": "Shrenade514",
                    "id": "gh320s0",
                    "parent_id": "t1_gh30zrt",
                    "score": 3,
                    "created_utc": 1609002526.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, Millenials and older Gen Z are becoming like boomers lmao",
            "author": "Aivaras12398",
            "id": "gh2mflm",
            "parent_id": "t1_gh1j5e7",
            "score": 3,
            "created_utc": 1608992182.0,
            "replies": []
        },
        {
            "body": "I shoulda mentioned that Boruto's behavior isn't all justifiable. But his anger and disappointment at his father definitely is",
            "author": "Rikuskill",
            "id": "gh2spjg",
            "parent_id": "t1_gh2o35d",
            "score": 1,
            "created_utc": 1608996796.0,
            "replies": []
        },
        {
            "body": "His bad attitude lasted for less than 10 chapters, idk why people make such a big deal out of it.",
            "author": "bendstraw",
            "id": "gh1iaxe",
            "parent_id": "t1_gh1ehzb",
            "score": 21,
            "created_utc": 1608951651.0,
            "replies": []
        },
        {
            "body": "Oh yeah Boruto has a separate spoiled prodigy brat issue, but I wanted to point out that his relationship with his dad is actually handled pretty well. That said I'm only 50 eps in, so they may fuck it up later and I wouldn't know lol",
            "author": "Rikuskill",
            "id": "gh1entv",
            "parent_id": "t1_gh1ehzb",
            "score": 30,
            "created_utc": 1608949049.0,
            "replies": [
                {
                    "body": "That was my problem with him too. Boruto started to  not get as much attention from when he turned 8 years old or so. Naruto did break a promise, but for him his village is his family. Some of the anime is skippable. I tend to fast forward it through some content.",
                    "author": "AsuraDeo",
                    "id": "gh1fgp8",
                    "parent_id": "t1_gh1entv",
                    "score": 10,
                    "created_utc": 1608949622.0,
                    "replies": [
                        {
                            "body": "Same about skipping through stuff. Some of the scenes drag their feet so purposefully I can't take it.",
                            "author": "Rikuskill",
                            "id": "gh1gsnq",
                            "parent_id": "t1_gh1fgp8",
                            "score": 3,
                            "created_utc": 1608950578.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well Boruto is supposed to be like this. He starts off as this annoying, ignorant brat but he changes. Just look at him in the flashforward scene. He isn't going to stay this way lol. \n\nNaruto went from being an annoying brat in the first few episodes, to bowing down to the Raikage for his own enemy. He went from not understanding revenge, to knowing it. It's called \"character development\"",
            "author": null,
            "id": "gh1mlla",
            "parent_id": "t1_gh1ehzb",
            "score": 13,
            "created_utc": 1608954779.0,
            "replies": []
        },
        {
            "body": "I didnt even get to see my dad for most of my birthdays as a kid and even when I did both my mom and him were busy with a hundred other things",
            "author": "DonnyProcs",
            "id": "gh1r0sz",
            "parent_id": "t1_gh1ehzb",
            "score": 2,
            "created_utc": 1608958154.0,
            "replies": []
        },
        {
            "body": "Man, the kid's dad didn't show up to his birthday. Shit hurts. You know your dad's job is very important, but he sacrifices his relationship with his family for it. Boruto, as a teen that thinks he knows how the world works, resents his dad for it.\n\nBoruto is really boring, I'll agree though. Then again, Shippuden had a lot of fuckign boring parts. The last like, fourth of the show was a massive slog to get through. There's just a lot of legit flaws with Boruto that I see get overlooked in favor of dumb, sometimes false ones.",
            "author": "Rikuskill",
            "id": "gh1aocq",
            "parent_id": "t1_gh1a895",
            "score": 25,
            "created_utc": 1608946217.0,
            "replies": [
                {
                    "body": "Yeah but that is kind of the juxtaposition. Naruto worked and fought hard so that the Children of Konoha wouldn’t have childhood’s like his. The indirect cause is that his kid is spoiled and doesn’t have time for him. An interesting story/story arc. \n\nWhat is done in Boruto the anime (haven’t read the manga yet) is boring as fuck. There are gaping issues with literally everything about it. Really hate what they did to certain characters. Because Boruto doesn’t struggle and just whines about everything there isn’t anything to like him other than he is Naruto/Hinata’s son. I mean the dude is more gifted than most of his peers and he still ends up cheating at the exams. Honestly he would have made a better “foil” arc villain than hero.",
                    "author": "KazPrime",
                    "id": "gh1b41a",
                    "parent_id": "t1_gh1aocq",
                    "score": -9,
                    "created_utc": 1608946520.0,
                    "replies": [
                        {
                            "body": "I'm only about halfway thru the anime, but I sorta agree. However, there are some important moments that throw Boruto's shitty smug confidence in his face. When Kakashi pins him down in the Genin exams and shows that he doesn't have enough willpower to break his arm to escape the hold, I was like YOOO YES! But it sorta ended with Boruto just organizing the others to win. Meh.\n\nThere seems to be a pattern of cool setups with really, really meh conclusions. Every villain so far fucking sucks.",
                            "author": "Rikuskill",
                            "id": "gh1ejgr",
                            "parent_id": "t1_gh1b41a",
                            "score": 9,
                            "created_utc": 1608948963.0,
                            "replies": []
                        },
                        {
                            "body": "\"haven't read the manga\" oh, so then you're admitting you have no idea what you're talking about?\n\nYour take on Boruto is not nearly as hot as you think it is. Personally it doesn't matter to me if anyone else likes it or not because I'm over here living my best Boruto life, but everything you just talked about is the entire point of Boruto.\n\nNaruto had nothing, and he got everything. Boruto has everything and he will be left with nothing. If they just rewrote Naruto that shit would be boring af. This is a completely different take on the Naruto universe, and especially with Kishi back at the helm writing the manga we are already moving along swiftly and awesomely.",
                            "author": "eorabs",
                            "id": "gh1cnnl",
                            "parent_id": "t1_gh1b41a",
                            "score": 8,
                            "created_utc": 1608947617.0,
                            "replies": [
                                {
                                    "body": "I have read the manga and I still find it boring as fuck\n\nEspecially in comparison to Naruto. The lack of actual techniques, the fact that Naruto and Sasuke got nerfed vastly. The lack of explanation around Kara.\n\nThing is, Boruto's end wouldn't be sad, he will most likely end happy with his family or accomplishing his goals of being a \"Shadow Hokage.\"\n\nNaruto and Sasuke meeting their end is highly unlikely. Boruto is already losing demand among the people in Japan. Anime sales are going well, but manga sales are barely even on par with what Naruto was.",
                                    "author": "AsuraDeo",
                                    "id": "gh1euv1",
                                    "parent_id": "t1_gh1cnnl",
                                    "score": 0,
                                    "created_utc": 1608949190.0,
                                    "replies": [
                                        {
                                            "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
                                            "author": "eorabs",
                                            "id": "gh1ovd6",
                                            "parent_id": "t1_gh1euv1",
                                            "score": 6,
                                            "created_utc": 1608956485.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
                                            "author": "According_Way1560",
                                            "id": "gh1jfeb",
                                            "parent_id": "t1_gh1euv1",
                                            "score": 5,
                                            "created_utc": 1608952459.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ghd0g1v",
            "parent_id": "t1_gh2myhk",
            "score": 2,
            "created_utc": 1609215139.0,
            "replies": [
                {
                    "body": "Honestly I Kinda did that as I watch it so long after part 1 I forgot so much",
                    "author": "mo-did",
                    "id": "ghe2zt0",
                    "parent_id": "t1_ghd0g1v",
                    "score": 1,
                    "created_utc": 1609249189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right, and the finale with Six Paths Obito and Madara and Kaguya would've gone all night. Neji's death was still likely the day before.\n\nBut hey, he got his best friend back as a bday gift lol",
            "author": "Condor193",
            "id": "gh3d56f",
            "parent_id": "t1_gh2marg",
            "score": 2,
            "created_utc": 1609008908.0,
            "replies": []
        },
        {
            "body": "Or the sakura useless\nI dont like sakura as a character but she not useless though",
            "author": "dannylogue",
            "id": "gh2amon",
            "parent_id": "t1_gh284cg",
            "score": 7,
            "created_utc": 1608979213.0,
            "replies": []
        },
        {
            "body": "\"all jonins are trash\"...you mean shikamaru, sai(leader of anbu), Sakura, ino(leader of inteldevision),etc are trash...well, that's your opinion and I respect it...I just hope you don't go complete 180 when kawaki arrives...have a great day",
            "author": "According_Way1560",
            "id": "gh21xk6",
            "parent_id": "t1_gh21mtt",
            "score": 5,
            "created_utc": 1608968335.0,
            "replies": [
                {
                    "body": "I mean they are shown like that in power level. Shino was hellbent on killing Boruto. In a forest. He should've just anihulated him with a flick of his finger. Jonins do nothing and genins suddenly are everything skilled with minor exceptions when plot demands it.",
                    "author": "Kazmir_here",
                    "id": "gh221br",
                    "parent_id": "t1_gh21xk6",
                    "score": -4,
                    "created_utc": 1608968450.0,
                    "replies": [
                        {
                            "body": "Lol okay dude😂..it's episode 6 you are talking about here....it's clear to me that you haven't watched half of the anime and just hating on it for the sake of hating on it...if you had read the manga, you would know how important jounins are in the story...let's end this here...have a great day ahead",
                            "author": "According_Way1560",
                            "id": "gh2260y",
                            "parent_id": "t1_gh221br",
                            "score": 6,
                            "created_utc": 1608968594.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Anyone wondering what he commented to have disliked,it was a hate comment about boruto",
            "author": null,
            "id": "gh1ik68",
            "parent_id": "t1_gh1hxl9",
            "score": 8,
            "created_utc": 1608951834.0,
            "replies": []
        },
        {
            "body": ">Imagine a character made entirely of them...would probably have some cool kekkei genkai\n\nI don't think so. It's similar to broccoli, if you eat some of it then nice, but if you are 100% broccoli then you are dead.",
            "author": "impersonal66",
            "id": "gh1yvkd",
            "parent_id": "t1_gh1gz8i",
            "score": 25,
            "created_utc": 1608965040.0,
            "replies": [
                {
                    "body": "No I think it’s just called BEING Hashirama lol",
                    "author": "Dier_runner",
                    "id": "gh1zhd0",
                    "parent_id": "t1_gh1yvkd",
                    "score": 29,
                    "created_utc": 1608965668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Zetsu, hashirama... i dunno man, cant wait for a hashirama cell guy",
            "author": "Reddit_User_Of_Self",
            "id": "gh2fddo",
            "parent_id": "t1_gh1gz8i",
            "score": 6,
            "created_utc": 1608985217.0,
            "replies": []
        },
        {
            "body": "Did you casually forget about Yamato?",
            "author": "Boar_Hat",
            "id": "gh2w8yq",
            "parent_id": "t1_gh1gz8i",
            "score": 3,
            "created_utc": 1608999017.0,
            "replies": []
        },
        {
            "body": "The cake though 😱😭😭",
            "author": null,
            "id": "gh1hupf",
            "parent_id": "t1_gh1g3rv",
            "score": 119,
            "created_utc": 1608951325.0,
            "replies": [
                {
                    "body": "It sucks because you think naruto not having a dad would make him want to be the best dad ever but hes just not, would've been some nice character progression for the guy they did his story dirty",
                    "author": "Qu1nn1fer",
                    "id": "gh1i2fh",
                    "parent_id": "t1_gh1hupf",
                    "score": 105,
                    "created_utc": 1608951482.0,
                    "replies": [
                        {
                            "body": "The reason Kishimoto made Sasuke and Naruto bad fathers is because he was projecting himself onto them. He was so busy with the manga, he felt like he missed out on his own kids' childhoods. That is the true explanation for Sasuke being gone all of those years, and Naruto being negligent",
                            "author": null,
                            "id": "gh1m6ww",
                            "parent_id": "t1_gh1i2fh",
                            "score": 155,
                            "created_utc": 1608954478.0,
                            "replies": [
                                {
                                    "body": "Thats... actually really sad",
                                    "author": "Qu1nn1fer",
                                    "id": "gh1m8pi",
                                    "parent_id": "t1_gh1m6ww",
                                    "score": 124,
                                    "created_utc": 1608954514.0,
                                    "replies": []
                                },
                                {
                                    "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
                                    "author": "DonnyProcs",
                                    "id": "gh1pbxg",
                                    "parent_id": "t1_gh1m6ww",
                                    "score": 36,
                                    "created_utc": 1608956838.0,
                                    "replies": [
                                        {
                                            "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                                            "author": null,
                                            "id": "gh1ufc2",
                                            "parent_id": "t1_gh1pbxg",
                                            "score": 50,
                                            "created_utc": 1608960937.0,
                                            "replies": [
                                                {
                                                    "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                                                    "author": "DonnyProcs",
                                                    "id": "gh1v1fj",
                                                    "parent_id": "t1_gh1ufc2",
                                                    "score": 13,
                                                    "created_utc": 1608961460.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                                            "author": "revmun",
                                                            "id": "gh2yvat",
                                                            "parent_id": "t1_gh1v1fj",
                                                            "score": 2,
                                                            "created_utc": 1609000632.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "We gotta keep some things in mind about naruto\n\n1. Being hokage was always his dream. Sure he wanted to have a family too, but he wasn’t screaming that at his friends or opponents at every opportunity. Not saying he’s giving his family the backseat intentionally, but he finally achieved his dream and likely wants to do it to the best of his abilities. Sending a shadow clone to sing and cut cake prolly seemed pretty justifiable to him considering he wanted to be there but still had duties at the office. the work he’s doing is a far cry from his time as a ninja; he was never studious and when fighting he thrived off being unpredictable so paper work and constant meetings are probably more of a drag for him than anything shikamaru has ever experienced in his life.\n\n2. he never had a good example of a father figure/family man. All of his male role models (jiriyah, kakashi, killer bee even) were single dudes who were extremely dedicated to their work. also, many of the adults in the village didn’t want their kids anywhere near him while he was growing up, so he could barely even steal glances of how a traditional family interacts with each other w/o it backfiring on him. \n\nI think his portrayal so far has been accurate and inline with his continued development. It’s all still pretty new to him and he hasn’t found a balance yet.",
                            "author": "ayochaser17",
                            "id": "gh250qf",
                            "parent_id": "t1_gh1i2fh",
                            "score": 26,
                            "created_utc": 1608971977.0,
                            "replies": [
                                {
                                    "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
                                    "author": "Blue_Raichu",
                                    "id": "gh27b1e",
                                    "parent_id": "t1_gh250qf",
                                    "score": 10,
                                    "created_utc": 1608974848.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "He improved after momoshiki arc naruto and boruto are chill as we expected",
                            "author": null,
                            "id": "gh1inav",
                            "parent_id": "t1_gh1i2fh",
                            "score": 29,
                            "created_utc": 1608951897.0,
                            "replies": []
                        },
                        {
                            "body": "It makes since because Naruto had no basis for what a father should act like day-to-day.",
                            "author": "Blue_Owl2",
                            "id": "gh32lc8",
                            "parent_id": "t1_gh1i2fh",
                            "score": 3,
                            "created_utc": 1609002872.0,
                            "replies": [
                                {
                                    "body": "Yeah I just wish we had more footage of the man trying a bit",
                                    "author": "Qu1nn1fer",
                                    "id": "gh37ej1",
                                    "parent_id": "t1_gh32lc8",
                                    "score": 3,
                                    "created_utc": 1609005736.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, I felt really sad for himawari\n\nEven though it's all fictional, it really struck",
            "author": "shab-re",
            "id": "gh1ym6q",
            "parent_id": "t1_gh1g3rv",
            "score": 6,
            "created_utc": 1608964778.0,
            "replies": []
        },
        {
            "body": "Why does it matter. A shallow clone is basically the same thing since you get all the memories",
            "author": null,
            "id": "gh1xu6l",
            "parent_id": "t1_gh1goal",
            "score": -4,
            "created_utc": 1608964017.0,
            "replies": [
                {
                    "body": "Its not the same as actually being there in person.",
                    "author": "Im_alright_19",
                    "id": "gh22o5z",
                    "parent_id": "t1_gh1xu6l",
                    "score": 13,
                    "created_utc": 1608969181.0,
                    "replies": [
                        {
                            "body": "The main reason I fail to relate to Boruto, when I was a kid I would have killed for a shadow clone of my mom/dad since they worked all the time",
                            "author": "Ozzymandious",
                            "id": "gh24eve",
                            "parent_id": "t1_gh22o5z",
                            "score": 5,
                            "created_utc": 1608971238.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just saying wouldn't it be worse for him showing up to it? because if he did then if there was an emergency or something people would have to go and ruin the whole party and Naruto would have to cut it short so I think it's better he wasn't there",
            "author": "ektdvb2",
            "id": "gh2zs0r",
            "parent_id": "t1_gh1goal",
            "score": 1,
            "created_utc": 1609001180.0,
            "replies": []
        },
        {
            "body": "Cool story but nobody said Boruto had it harder",
            "author": "Shrenade514",
            "id": "gh320s0",
            "parent_id": "t1_gh30zrt",
            "score": 3,
            "created_utc": 1609002526.0,
            "replies": []
        },
        {
            "body": "That was my problem with him too. Boruto started to  not get as much attention from when he turned 8 years old or so. Naruto did break a promise, but for him his village is his family. Some of the anime is skippable. I tend to fast forward it through some content.",
            "author": "AsuraDeo",
            "id": "gh1fgp8",
            "parent_id": "t1_gh1entv",
            "score": 10,
            "created_utc": 1608949622.0,
            "replies": [
                {
                    "body": "Same about skipping through stuff. Some of the scenes drag their feet so purposefully I can't take it.",
                    "author": "Rikuskill",
                    "id": "gh1gsnq",
                    "parent_id": "t1_gh1fgp8",
                    "score": 3,
                    "created_utc": 1608950578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah but that is kind of the juxtaposition. Naruto worked and fought hard so that the Children of Konoha wouldn’t have childhood’s like his. The indirect cause is that his kid is spoiled and doesn’t have time for him. An interesting story/story arc. \n\nWhat is done in Boruto the anime (haven’t read the manga yet) is boring as fuck. There are gaping issues with literally everything about it. Really hate what they did to certain characters. Because Boruto doesn’t struggle and just whines about everything there isn’t anything to like him other than he is Naruto/Hinata’s son. I mean the dude is more gifted than most of his peers and he still ends up cheating at the exams. Honestly he would have made a better “foil” arc villain than hero.",
            "author": "KazPrime",
            "id": "gh1b41a",
            "parent_id": "t1_gh1aocq",
            "score": -9,
            "created_utc": 1608946520.0,
            "replies": [
                {
                    "body": "I'm only about halfway thru the anime, but I sorta agree. However, there are some important moments that throw Boruto's shitty smug confidence in his face. When Kakashi pins him down in the Genin exams and shows that he doesn't have enough willpower to break his arm to escape the hold, I was like YOOO YES! But it sorta ended with Boruto just organizing the others to win. Meh.\n\nThere seems to be a pattern of cool setups with really, really meh conclusions. Every villain so far fucking sucks.",
                    "author": "Rikuskill",
                    "id": "gh1ejgr",
                    "parent_id": "t1_gh1b41a",
                    "score": 9,
                    "created_utc": 1608948963.0,
                    "replies": []
                },
                {
                    "body": "\"haven't read the manga\" oh, so then you're admitting you have no idea what you're talking about?\n\nYour take on Boruto is not nearly as hot as you think it is. Personally it doesn't matter to me if anyone else likes it or not because I'm over here living my best Boruto life, but everything you just talked about is the entire point of Boruto.\n\nNaruto had nothing, and he got everything. Boruto has everything and he will be left with nothing. If they just rewrote Naruto that shit would be boring af. This is a completely different take on the Naruto universe, and especially with Kishi back at the helm writing the manga we are already moving along swiftly and awesomely.",
                    "author": "eorabs",
                    "id": "gh1cnnl",
                    "parent_id": "t1_gh1b41a",
                    "score": 8,
                    "created_utc": 1608947617.0,
                    "replies": [
                        {
                            "body": "I have read the manga and I still find it boring as fuck\n\nEspecially in comparison to Naruto. The lack of actual techniques, the fact that Naruto and Sasuke got nerfed vastly. The lack of explanation around Kara.\n\nThing is, Boruto's end wouldn't be sad, he will most likely end happy with his family or accomplishing his goals of being a \"Shadow Hokage.\"\n\nNaruto and Sasuke meeting their end is highly unlikely. Boruto is already losing demand among the people in Japan. Anime sales are going well, but manga sales are barely even on par with what Naruto was.",
                            "author": "AsuraDeo",
                            "id": "gh1euv1",
                            "parent_id": "t1_gh1cnnl",
                            "score": 0,
                            "created_utc": 1608949190.0,
                            "replies": [
                                {
                                    "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
                                    "author": "eorabs",
                                    "id": "gh1ovd6",
                                    "parent_id": "t1_gh1euv1",
                                    "score": 6,
                                    "created_utc": 1608956485.0,
                                    "replies": []
                                },
                                {
                                    "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
                                    "author": "According_Way1560",
                                    "id": "gh1jfeb",
                                    "parent_id": "t1_gh1euv1",
                                    "score": 5,
                                    "created_utc": 1608952459.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly I Kinda did that as I watch it so long after part 1 I forgot so much",
            "author": "mo-did",
            "id": "ghe2zt0",
            "parent_id": "t1_ghd0g1v",
            "score": 1,
            "created_utc": 1609249189.0,
            "replies": []
        },
        {
            "body": "I mean they are shown like that in power level. Shino was hellbent on killing Boruto. In a forest. He should've just anihulated him with a flick of his finger. Jonins do nothing and genins suddenly are everything skilled with minor exceptions when plot demands it.",
            "author": "Kazmir_here",
            "id": "gh221br",
            "parent_id": "t1_gh21xk6",
            "score": -4,
            "created_utc": 1608968450.0,
            "replies": [
                {
                    "body": "Lol okay dude😂..it's episode 6 you are talking about here....it's clear to me that you haven't watched half of the anime and just hating on it for the sake of hating on it...if you had read the manga, you would know how important jounins are in the story...let's end this here...have a great day ahead",
                    "author": "According_Way1560",
                    "id": "gh2260y",
                    "parent_id": "t1_gh221br",
                    "score": 6,
                    "created_utc": 1608968594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No I think it’s just called BEING Hashirama lol",
            "author": "Dier_runner",
            "id": "gh1zhd0",
            "parent_id": "t1_gh1yvkd",
            "score": 29,
            "created_utc": 1608965668.0,
            "replies": []
        },
        {
            "body": "It sucks because you think naruto not having a dad would make him want to be the best dad ever but hes just not, would've been some nice character progression for the guy they did his story dirty",
            "author": "Qu1nn1fer",
            "id": "gh1i2fh",
            "parent_id": "t1_gh1hupf",
            "score": 105,
            "created_utc": 1608951482.0,
            "replies": [
                {
                    "body": "The reason Kishimoto made Sasuke and Naruto bad fathers is because he was projecting himself onto them. He was so busy with the manga, he felt like he missed out on his own kids' childhoods. That is the true explanation for Sasuke being gone all of those years, and Naruto being negligent",
                    "author": null,
                    "id": "gh1m6ww",
                    "parent_id": "t1_gh1i2fh",
                    "score": 155,
                    "created_utc": 1608954478.0,
                    "replies": [
                        {
                            "body": "Thats... actually really sad",
                            "author": "Qu1nn1fer",
                            "id": "gh1m8pi",
                            "parent_id": "t1_gh1m6ww",
                            "score": 124,
                            "created_utc": 1608954514.0,
                            "replies": []
                        },
                        {
                            "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
                            "author": "DonnyProcs",
                            "id": "gh1pbxg",
                            "parent_id": "t1_gh1m6ww",
                            "score": 36,
                            "created_utc": 1608956838.0,
                            "replies": [
                                {
                                    "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                                    "author": null,
                                    "id": "gh1ufc2",
                                    "parent_id": "t1_gh1pbxg",
                                    "score": 50,
                                    "created_utc": 1608960937.0,
                                    "replies": [
                                        {
                                            "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                                            "author": "DonnyProcs",
                                            "id": "gh1v1fj",
                                            "parent_id": "t1_gh1ufc2",
                                            "score": 13,
                                            "created_utc": 1608961460.0,
                                            "replies": [
                                                {
                                                    "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                                    "author": "revmun",
                                                    "id": "gh2yvat",
                                                    "parent_id": "t1_gh1v1fj",
                                                    "score": 2,
                                                    "created_utc": 1609000632.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "We gotta keep some things in mind about naruto\n\n1. Being hokage was always his dream. Sure he wanted to have a family too, but he wasn’t screaming that at his friends or opponents at every opportunity. Not saying he’s giving his family the backseat intentionally, but he finally achieved his dream and likely wants to do it to the best of his abilities. Sending a shadow clone to sing and cut cake prolly seemed pretty justifiable to him considering he wanted to be there but still had duties at the office. the work he’s doing is a far cry from his time as a ninja; he was never studious and when fighting he thrived off being unpredictable so paper work and constant meetings are probably more of a drag for him than anything shikamaru has ever experienced in his life.\n\n2. he never had a good example of a father figure/family man. All of his male role models (jiriyah, kakashi, killer bee even) were single dudes who were extremely dedicated to their work. also, many of the adults in the village didn’t want their kids anywhere near him while he was growing up, so he could barely even steal glances of how a traditional family interacts with each other w/o it backfiring on him. \n\nI think his portrayal so far has been accurate and inline with his continued development. It’s all still pretty new to him and he hasn’t found a balance yet.",
                    "author": "ayochaser17",
                    "id": "gh250qf",
                    "parent_id": "t1_gh1i2fh",
                    "score": 26,
                    "created_utc": 1608971977.0,
                    "replies": [
                        {
                            "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
                            "author": "Blue_Raichu",
                            "id": "gh27b1e",
                            "parent_id": "t1_gh250qf",
                            "score": 10,
                            "created_utc": 1608974848.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He improved after momoshiki arc naruto and boruto are chill as we expected",
                    "author": null,
                    "id": "gh1inav",
                    "parent_id": "t1_gh1i2fh",
                    "score": 29,
                    "created_utc": 1608951897.0,
                    "replies": []
                },
                {
                    "body": "It makes since because Naruto had no basis for what a father should act like day-to-day.",
                    "author": "Blue_Owl2",
                    "id": "gh32lc8",
                    "parent_id": "t1_gh1i2fh",
                    "score": 3,
                    "created_utc": 1609002872.0,
                    "replies": [
                        {
                            "body": "Yeah I just wish we had more footage of the man trying a bit",
                            "author": "Qu1nn1fer",
                            "id": "gh37ej1",
                            "parent_id": "t1_gh32lc8",
                            "score": 3,
                            "created_utc": 1609005736.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its not the same as actually being there in person.",
            "author": "Im_alright_19",
            "id": "gh22o5z",
            "parent_id": "t1_gh1xu6l",
            "score": 13,
            "created_utc": 1608969181.0,
            "replies": [
                {
                    "body": "The main reason I fail to relate to Boruto, when I was a kid I would have killed for a shadow clone of my mom/dad since they worked all the time",
                    "author": "Ozzymandious",
                    "id": "gh24eve",
                    "parent_id": "t1_gh22o5z",
                    "score": 5,
                    "created_utc": 1608971238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same about skipping through stuff. Some of the scenes drag their feet so purposefully I can't take it.",
            "author": "Rikuskill",
            "id": "gh1gsnq",
            "parent_id": "t1_gh1fgp8",
            "score": 3,
            "created_utc": 1608950578.0,
            "replies": []
        },
        {
            "body": "I'm only about halfway thru the anime, but I sorta agree. However, there are some important moments that throw Boruto's shitty smug confidence in his face. When Kakashi pins him down in the Genin exams and shows that he doesn't have enough willpower to break his arm to escape the hold, I was like YOOO YES! But it sorta ended with Boruto just organizing the others to win. Meh.\n\nThere seems to be a pattern of cool setups with really, really meh conclusions. Every villain so far fucking sucks.",
            "author": "Rikuskill",
            "id": "gh1ejgr",
            "parent_id": "t1_gh1b41a",
            "score": 9,
            "created_utc": 1608948963.0,
            "replies": []
        },
        {
            "body": "\"haven't read the manga\" oh, so then you're admitting you have no idea what you're talking about?\n\nYour take on Boruto is not nearly as hot as you think it is. Personally it doesn't matter to me if anyone else likes it or not because I'm over here living my best Boruto life, but everything you just talked about is the entire point of Boruto.\n\nNaruto had nothing, and he got everything. Boruto has everything and he will be left with nothing. If they just rewrote Naruto that shit would be boring af. This is a completely different take on the Naruto universe, and especially with Kishi back at the helm writing the manga we are already moving along swiftly and awesomely.",
            "author": "eorabs",
            "id": "gh1cnnl",
            "parent_id": "t1_gh1b41a",
            "score": 8,
            "created_utc": 1608947617.0,
            "replies": [
                {
                    "body": "I have read the manga and I still find it boring as fuck\n\nEspecially in comparison to Naruto. The lack of actual techniques, the fact that Naruto and Sasuke got nerfed vastly. The lack of explanation around Kara.\n\nThing is, Boruto's end wouldn't be sad, he will most likely end happy with his family or accomplishing his goals of being a \"Shadow Hokage.\"\n\nNaruto and Sasuke meeting their end is highly unlikely. Boruto is already losing demand among the people in Japan. Anime sales are going well, but manga sales are barely even on par with what Naruto was.",
                    "author": "AsuraDeo",
                    "id": "gh1euv1",
                    "parent_id": "t1_gh1cnnl",
                    "score": 0,
                    "created_utc": 1608949190.0,
                    "replies": [
                        {
                            "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
                            "author": "eorabs",
                            "id": "gh1ovd6",
                            "parent_id": "t1_gh1euv1",
                            "score": 6,
                            "created_utc": 1608956485.0,
                            "replies": []
                        },
                        {
                            "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
                            "author": "According_Way1560",
                            "id": "gh1jfeb",
                            "parent_id": "t1_gh1euv1",
                            "score": 5,
                            "created_utc": 1608952459.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol okay dude😂..it's episode 6 you are talking about here....it's clear to me that you haven't watched half of the anime and just hating on it for the sake of hating on it...if you had read the manga, you would know how important jounins are in the story...let's end this here...have a great day ahead",
            "author": "According_Way1560",
            "id": "gh2260y",
            "parent_id": "t1_gh221br",
            "score": 6,
            "created_utc": 1608968594.0,
            "replies": []
        },
        {
            "body": "The reason Kishimoto made Sasuke and Naruto bad fathers is because he was projecting himself onto them. He was so busy with the manga, he felt like he missed out on his own kids' childhoods. That is the true explanation for Sasuke being gone all of those years, and Naruto being negligent",
            "author": null,
            "id": "gh1m6ww",
            "parent_id": "t1_gh1i2fh",
            "score": 155,
            "created_utc": 1608954478.0,
            "replies": [
                {
                    "body": "Thats... actually really sad",
                    "author": "Qu1nn1fer",
                    "id": "gh1m8pi",
                    "parent_id": "t1_gh1m6ww",
                    "score": 124,
                    "created_utc": 1608954514.0,
                    "replies": []
                },
                {
                    "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
                    "author": "DonnyProcs",
                    "id": "gh1pbxg",
                    "parent_id": "t1_gh1m6ww",
                    "score": 36,
                    "created_utc": 1608956838.0,
                    "replies": [
                        {
                            "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                            "author": null,
                            "id": "gh1ufc2",
                            "parent_id": "t1_gh1pbxg",
                            "score": 50,
                            "created_utc": 1608960937.0,
                            "replies": [
                                {
                                    "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                                    "author": "DonnyProcs",
                                    "id": "gh1v1fj",
                                    "parent_id": "t1_gh1ufc2",
                                    "score": 13,
                                    "created_utc": 1608961460.0,
                                    "replies": [
                                        {
                                            "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                            "author": "revmun",
                                            "id": "gh2yvat",
                                            "parent_id": "t1_gh1v1fj",
                                            "score": 2,
                                            "created_utc": 1609000632.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We gotta keep some things in mind about naruto\n\n1. Being hokage was always his dream. Sure he wanted to have a family too, but he wasn’t screaming that at his friends or opponents at every opportunity. Not saying he’s giving his family the backseat intentionally, but he finally achieved his dream and likely wants to do it to the best of his abilities. Sending a shadow clone to sing and cut cake prolly seemed pretty justifiable to him considering he wanted to be there but still had duties at the office. the work he’s doing is a far cry from his time as a ninja; he was never studious and when fighting he thrived off being unpredictable so paper work and constant meetings are probably more of a drag for him than anything shikamaru has ever experienced in his life.\n\n2. he never had a good example of a father figure/family man. All of his male role models (jiriyah, kakashi, killer bee even) were single dudes who were extremely dedicated to their work. also, many of the adults in the village didn’t want their kids anywhere near him while he was growing up, so he could barely even steal glances of how a traditional family interacts with each other w/o it backfiring on him. \n\nI think his portrayal so far has been accurate and inline with his continued development. It’s all still pretty new to him and he hasn’t found a balance yet.",
            "author": "ayochaser17",
            "id": "gh250qf",
            "parent_id": "t1_gh1i2fh",
            "score": 26,
            "created_utc": 1608971977.0,
            "replies": [
                {
                    "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
                    "author": "Blue_Raichu",
                    "id": "gh27b1e",
                    "parent_id": "t1_gh250qf",
                    "score": 10,
                    "created_utc": 1608974848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He improved after momoshiki arc naruto and boruto are chill as we expected",
            "author": null,
            "id": "gh1inav",
            "parent_id": "t1_gh1i2fh",
            "score": 29,
            "created_utc": 1608951897.0,
            "replies": []
        },
        {
            "body": "It makes since because Naruto had no basis for what a father should act like day-to-day.",
            "author": "Blue_Owl2",
            "id": "gh32lc8",
            "parent_id": "t1_gh1i2fh",
            "score": 3,
            "created_utc": 1609002872.0,
            "replies": [
                {
                    "body": "Yeah I just wish we had more footage of the man trying a bit",
                    "author": "Qu1nn1fer",
                    "id": "gh37ej1",
                    "parent_id": "t1_gh32lc8",
                    "score": 3,
                    "created_utc": 1609005736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The main reason I fail to relate to Boruto, when I was a kid I would have killed for a shadow clone of my mom/dad since they worked all the time",
            "author": "Ozzymandious",
            "id": "gh24eve",
            "parent_id": "t1_gh22o5z",
            "score": 5,
            "created_utc": 1608971238.0,
            "replies": []
        },
        {
            "body": "I have read the manga and I still find it boring as fuck\n\nEspecially in comparison to Naruto. The lack of actual techniques, the fact that Naruto and Sasuke got nerfed vastly. The lack of explanation around Kara.\n\nThing is, Boruto's end wouldn't be sad, he will most likely end happy with his family or accomplishing his goals of being a \"Shadow Hokage.\"\n\nNaruto and Sasuke meeting their end is highly unlikely. Boruto is already losing demand among the people in Japan. Anime sales are going well, but manga sales are barely even on par with what Naruto was.",
            "author": "AsuraDeo",
            "id": "gh1euv1",
            "parent_id": "t1_gh1cnnl",
            "score": 0,
            "created_utc": 1608949190.0,
            "replies": [
                {
                    "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
                    "author": "eorabs",
                    "id": "gh1ovd6",
                    "parent_id": "t1_gh1euv1",
                    "score": 6,
                    "created_utc": 1608956485.0,
                    "replies": []
                },
                {
                    "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
                    "author": "According_Way1560",
                    "id": "gh1jfeb",
                    "parent_id": "t1_gh1euv1",
                    "score": 5,
                    "created_utc": 1608952459.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thats... actually really sad",
            "author": "Qu1nn1fer",
            "id": "gh1m8pi",
            "parent_id": "t1_gh1m6ww",
            "score": 124,
            "created_utc": 1608954514.0,
            "replies": []
        },
        {
            "body": "not to hate, but I'd there anything actually backing that or is it just what you're assuming? \n\nThere are a hundred problems with boruto and naruto using shadow clones instead of hanging out with his actual family for a birthday especially is still pretty damn out of character imo",
            "author": "DonnyProcs",
            "id": "gh1pbxg",
            "parent_id": "t1_gh1m6ww",
            "score": 36,
            "created_utc": 1608956838.0,
            "replies": [
                {
                    "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
                    "author": null,
                    "id": "gh1ufc2",
                    "parent_id": "t1_gh1pbxg",
                    "score": 50,
                    "created_utc": 1608960937.0,
                    "replies": [
                        {
                            "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                            "author": "DonnyProcs",
                            "id": "gh1v1fj",
                            "parent_id": "t1_gh1ufc2",
                            "score": 13,
                            "created_utc": 1608961460.0,
                            "replies": [
                                {
                                    "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                                    "author": "revmun",
                                    "id": "gh2yvat",
                                    "parent_id": "t1_gh1v1fj",
                                    "score": 2,
                                    "created_utc": 1609000632.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree completely. A bunch of people say they thought Naruto would/should be a great dad because he didn't have one, but logically speaking the opposite would be more expected. Sasuke's weirder because he actually had a family and knew what it's like to lose that connection. Plus he very clearly knew what was missing from his relationship with his dad. You could say it'd take time for him to overcome being a complete loner, but Naruto and Sakura already broke that barrier, and 12 years is too long for him to adjust to actually being a father.",
            "author": "Blue_Raichu",
            "id": "gh27b1e",
            "parent_id": "t1_gh250qf",
            "score": 10,
            "created_utc": 1608974848.0,
            "replies": []
        },
        {
            "body": "Yeah I just wish we had more footage of the man trying a bit",
            "author": "Qu1nn1fer",
            "id": "gh37ej1",
            "parent_id": "t1_gh32lc8",
            "score": 3,
            "created_utc": 1609005736.0,
            "replies": []
        },
        {
            "body": "Did...did you just say the lack of techniques? You are definitely not reading the Boruto manga if you're talking some nonsense like that.\n\nI love Naruto. It will forever hold a place in my heart and life that nothing can replace. But Naruto had almost no techniques whatsoever so I have no idea what you're on about.",
            "author": "eorabs",
            "id": "gh1ovd6",
            "parent_id": "t1_gh1euv1",
            "score": 6,
            "created_utc": 1608956485.0,
            "replies": []
        },
        {
            "body": "Dude ikemoto writes 40 pages a month...you can't put everything in those 40 pages...yes, boruto manga sales are not doing well...but Boruto manga is one of the most popular mangas digitally",
            "author": "According_Way1560",
            "id": "gh1jfeb",
            "parent_id": "t1_gh1euv1",
            "score": 5,
            "created_utc": 1608952459.0,
            "replies": []
        },
        {
            "body": "I'll have to find the interviews from NF. But [Kishimoto was so busy, it took him 12 years t go on his honey moon.](https://en.wikipedia.org/wiki/Masashi_Kishimoto#Personal_life)",
            "author": null,
            "id": "gh1ufc2",
            "parent_id": "t1_gh1pbxg",
            "score": 50,
            "created_utc": 1608960937.0,
            "replies": [
                {
                    "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
                    "author": "DonnyProcs",
                    "id": "gh1v1fj",
                    "parent_id": "t1_gh1ufc2",
                    "score": 13,
                    "created_utc": 1608961460.0,
                    "replies": [
                        {
                            "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                            "author": "revmun",
                            "id": "gh2yvat",
                            "parent_id": "t1_gh1v1fj",
                            "score": 2,
                            "created_utc": 1609000632.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "good shit, im sad thats the case but at least it makes a little more sense with the random direction he takes Naruto as a parent.\n\nEdit: Also not trying to be that guy, but him not taking his honeymoon has nothing to do with him supposedly missing out on his kids childhood. \n\nNot saying that wasn't the case, just saying there's nothing backing up that \"claim\"\n\nand ultimately, I might get flak for this, but shouldn't you be able to separate yourself from your character? I'm just saying this is Naruto, the guy who formed such a strong bond with Sasuke in a relatively small amount of time that he risked his and everyone lives multiple times to prove it, but this is the same guy who won't actually attend his own child's birthday? \n\nAll I'm saying is regardless of personal issues Kishi was having which are fair and might be genuinely true. That shouldn't necessarily reflect that directly in his work to the point his characters act out of character. \n\nAgain just my opinion",
            "author": "DonnyProcs",
            "id": "gh1v1fj",
            "parent_id": "t1_gh1ufc2",
            "score": 13,
            "created_utc": 1608961460.0,
            "replies": [
                {
                    "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
                    "author": "revmun",
                    "id": "gh2yvat",
                    "parent_id": "t1_gh1v1fj",
                    "score": 2,
                    "created_utc": 1609000632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean they both have reasons that resonate with their character. Sasuke wants to atone for his sins and protect the village, so he takes the roll of a lone protector and investigates aliens, this all to atone for the terrorize he had become. \n\nNaruto on the other hand cares for his family and loves them the most. But to him the whole leaf village is family. He has to much love in his heart for everybody, when at times a kid just wants them to be loved specifically. Both actions are understandable by both characters",
            "author": "revmun",
            "id": "gh2yvat",
            "parent_id": "t1_gh1v1fj",
            "score": 2,
            "created_utc": 1609000632.0,
            "replies": []
        }
    ]
}