{
    "title": "Got raped by my SD last night",
    "post_id": "tjedm7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/tjedm7/got_raped_by_my_sd_last_night/",
    "author": "hadyenc",
    "body": "not really sure what to even say, I never really post anywhere but I wanted to tell someone. \n\nhe pretended that he was super drunk, and i’m dumb and naive and I was also drunk, so I thought I was helping him up to his hotel room. \n\nI went and got a rape kit done, and i’m pressing charges, but that’s probably not going to do anything. oh well.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/tjedm7/got_raped_by_my_sd_last_night/",
    "score": 341,
    "upvote_ratio": 0.93,
    "created_utc": 1647876440.0,
    "num_comments": 121,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It will do something. It will give you some power back. It will show this man there are consequences for his actions. \n\nI highly recommend you seek out counselling once you’re ready, possibly at a centre focused on trauma and sexual assault, even if you think you don’t need it. If you want help finding these places I can do that!\n\nI am so sorry. I know what you are going through, and it will not be easy. 🖤 proud of you you for pressing charges.",
            "author": "Cdnsugarr",
            "id": "i1jjzrj",
            "parent_id": "t3_tjedm7",
            "score": 246,
            "created_utc": 1647877868.0,
            "replies": [
                {
                    "body": "100000000% So proud...that's the hardest part. And she was not dumb & naive. She was kind.",
                    "author": "ShaArt5",
                    "id": "i1jro42",
                    "parent_id": "t1_i1jjzrj",
                    "score": 72,
                    "created_utc": 1647880849.0,
                    "replies": []
                },
                {
                    "body": "Do everything you can to get the DA to go after him criminally.  \n\nIf that doesn’t work, sue him civilly (for money). \n\nThe standard for a civil suit isn’t “beyond a reasonable doubt”. It’s “which side do you believe more?” So you have a great chance of winning there or (more likely) settling for a huge payday.",
                    "author": "ifisch",
                    "id": "i1lrwi3",
                    "parent_id": "t1_i1jjzrj",
                    "score": 22,
                    "created_utc": 1647910721.0,
                    "replies": []
                },
                {
                    "body": "Great advice sorry this happened to you.",
                    "author": "wb19081908",
                    "id": "i1l4bmp",
                    "parent_id": "t1_i1jjzrj",
                    "score": 9,
                    "created_utc": 1647900427.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are neither dumb nor naive. You did what most people would do under the same circumstances. The bad actor was 100% him.\n\n\n [This book helped me better understand my role in my sexual assault and the reactions I got from others](https://www.google.com/search?q=why+women+are+blamed+for+everything&client=ms-android-tmus-us-revc&prmd=sniv&sxsrf=APq-WBuZu_7v1inPKUBP-GXXR2CUKwjXnw:1647880748453&source=lnms&tbm=shop&sa=X&ved=2ahUKEwiD0pKV0tf2AhX8D0QIHUdfAlQQ_AUoAXoECAIQAQ&biw=412&bih=816&dpr=3.5)\n\nOnly listen to people who support you and condem him, and please reach out if you need support.",
            "author": "38_29_41",
            "id": "i1jrvp7",
            "parent_id": "t3_tjedm7",
            "score": 65,
            "created_utc": 1647880931.0,
            "replies": []
        },
        {
            "body": "I'm really very sorry this happened to you.",
            "author": "hone_ypig",
            "id": "i1jhydm",
            "parent_id": "t3_tjedm7",
            "score": 57,
            "created_utc": 1647877050.0,
            "replies": []
        },
        {
            "body": "☹️☹️❤❤❤  make sure to find someone you trust in real life that you can share this with.  You will need the support.  The trauma from something like this is hard.  I'm sorry you had this happen to you.  Regardless if you were drunk, ITS NOT YOUR FAULT.  So don't blame yourself.  No one ever has a right to touch you without consent.  Remember that.  You are brave for pressing charges.  Hugs.",
            "author": "SweetD79",
            "id": "i1jj1cq",
            "parent_id": "t3_tjedm7",
            "score": 44,
            "created_utc": 1647877488.0,
            "replies": []
        },
        {
            "body": "Take a hot bath and really put intent into massaging your soap and lotion in. Rest and stay in cozy clothes and blankets. Eat comforting food. Sit with someone who will let you sit in silence but be present. Sometimes walking, dancing or exercising feels good too. Sit in the sun. Sleep as much as you want. Tell a trusted female friend, more of us have been raped than talk about it. Do anything that feels like it’s feeding and replenishing your body and soul. \n\nIf at any point you decide its less positive or you gain less by pursuing traditional justice, then drop it. You don’t owe anyone anything besides what feels good to you right now and what promotes your emotional and physical healing. I support your decision to tell authorities but also know that there is relief and healing for you outside of that avenue too.",
            "author": "strt31",
            "id": "i1k4jam",
            "parent_id": "t3_tjedm7",
            "score": 99,
            "created_utc": 1647885853.0,
            "replies": [
                {
                    "body": "you’re wonderful, thank you",
                    "author": "hadyenc",
                    "id": "i1k4ral",
                    "parent_id": "t1_i1k4jam",
                    "score": 18,
                    "created_utc": 1647885937.0,
                    "replies": [
                        {
                            "body": "Of course 💕💕 focus on you rn",
                            "author": "strt31",
                            "id": "i1k6g93",
                            "parent_id": "t1_i1k4ral",
                            "score": 9,
                            "created_utc": 1647886592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You did the right thing going to law enforcement.  Please leverage all available community and social services to support you during this traumatic experience",
            "author": "Chill_SD1974",
            "id": "i1jl6oz",
            "parent_id": "t3_tjedm7",
            "score": 45,
            "created_utc": 1647878340.0,
            "replies": []
        },
        {
            "body": "Sorry to hear that it happened to you.\nAnything you do from this point on would be very critical.\n\n- see/talk to a lawyer \n- see/talk to a doctor. Best if test is done at hospital.\n- preserve any data/ conversation with your ex SD.\n- don’t block or delete anything with your SD\n- seek help or find someone you can trust.  You’ll need it go through everything.\n- don’t ever think it’s your fault. It’s his and you need to stop people like him.\n\nGood luck and be strong.",
            "author": "Numerous-Ad3709",
            "id": "i1jwdi9",
            "parent_id": "t3_tjedm7",
            "score": 25,
            "created_utc": 1647882684.0,
            "replies": [
                {
                    "body": "I’d add to this list:\n\nDo not communicate with him at all.",
                    "author": "ORD-inary",
                    "id": "i1lg41c",
                    "parent_id": "t1_i1jwdi9",
                    "score": 9,
                    "created_utc": 1647905445.0,
                    "replies": [
                        {
                            "body": "don’t worry, i absolutely won’t. i’ve already blocked him on everything.",
                            "author": "hadyenc",
                            "id": "i1llwpz",
                            "parent_id": "t1_i1lg41c",
                            "score": 9,
                            "created_utc": 1647908022.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'd also wonder about advising the website where she met him, and asking her lawyer about *their*  liability too.",
                    "author": "Mangotingthroneway",
                    "id": "i1ldttw",
                    "parent_id": "t1_i1jwdi9",
                    "score": 3,
                    "created_utc": 1647904460.0,
                    "replies": [
                        {
                            "body": "Exactly, I am in contact with a lawyer/ advocacy attorney who does this very thing and I direct ladies to her, if they have been assaulted. She allows the women to remain 100% anonymous as well. Those websites can very much be held accountable and women can (and do) receive monetary compensation.",
                            "author": null,
                            "id": "i1x7b0x",
                            "parent_id": "t1_i1ldttw",
                            "score": 2,
                            "created_utc": 1648124669.0,
                            "replies": []
                        },
                        {
                            "body": "I don't see the benefit of going after the website :( They have nothing to do with the predator, what could the owners of the site have done different?",
                            "author": "007selfdestruct",
                            "id": "i1ukbp7",
                            "parent_id": "t1_i1ldttw",
                            "score": 1,
                            "created_utc": 1648070318.0,
                            "replies": [
                                {
                                    "body": "She is 100% correct in that the website CAN be held liable. I am in contact with a non-profit/ advocacy attorney who does this very thing and she allows the girls to stay 100% anonymous...and they can be entitled to monetary compensation through holding the website accountable. This has been done with other 'dating' websites as well.",
                                    "author": null,
                                    "id": "i1x70lg",
                                    "parent_id": "t1_i1ukbp7",
                                    "score": 2,
                                    "created_utc": 1648124509.0,
                                    "replies": []
                                },
                                {
                                    "body": "There's a number of issues. First, cutting the guy from the website. They can do that. Second, cooperation with LE. The site will have details allowing LE to contact the alleged rapist. Third, if the police interview the site, and they aren't cooperative,  or they've had previous reports and done nothing, then there are often possible cases of negligence to pursue.",
                                    "author": "Mangotingthroneway",
                                    "id": "i21wdsl",
                                    "parent_id": "t1_i1ukbp7",
                                    "score": 2,
                                    "created_utc": 1648207902.0,
                                    "replies": [
                                        {
                                            "body": "Absolutely valid points. I am speaking in the past tense - referring to the \"their liability\" part.",
                                            "author": "007selfdestruct",
                                            "id": "i237xvk",
                                            "parent_id": "t1_i21wdsl",
                                            "score": 1,
                                            "created_utc": 1648228813.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honey, I am SO SORRY. I've had the same thing happen to me. Pressing charges is absolutely scary, but also incredibly brave. The system doesn't always make it easy, but stand your ground and don't allow anyone to invalidate your experience.\n\nI went through the process of trying to press charges with the SVU in my city a few years ago. I'll be honest, it was super hard. And I didn't have the support/wasn't in a strong enough mental state to be aggressive about it. I've made my peace with my situation (basically dismissed by the male officer who took my statement and never reached out to the 3 eye witnesses I provided). While I've forgiven myself, there is still a part of me that wishes I'd been in a place to be relentless in pursuing justice, as hard as that may have been.\n\nIf you ever need to talk, please DM me. Whether you want someone to listen to what happened, or just chat about fun random shit as a distraction, I'm here. I am sending so much love.",
            "author": null,
            "id": "i1jtq48",
            "parent_id": "t3_tjedm7",
            "score": 45,
            "created_utc": 1647881643.0,
            "replies": [
                {
                    "body": "i’m sorry that happened to you :( and thank you, a lot",
                    "author": "hadyenc",
                    "id": "i1k0z74",
                    "parent_id": "t1_i1jtq48",
                    "score": 12,
                    "created_utc": 1647884486.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are neither dumb nor naive.  This is in no way your fault, the rapist is the ONLY one responsible for what happened.  It is not on you, the SB to avoid rape.  It is on the SD to be a decent human and not be a rapist.",
            "author": "ShaddyPups",
            "id": "i1jpaxq",
            "parent_id": "t3_tjedm7",
            "score": 39,
            "created_utc": 1647879939.0,
            "replies": []
        },
        {
            "body": "I’m so sorry that this happened to you. You are so brave for taking initiative ❤️",
            "author": "Sugarcookie54321_",
            "id": "i1ji832",
            "parent_id": "t3_tjedm7",
            "score": 19,
            "created_utc": 1647877160.0,
            "replies": []
        },
        {
            "body": "It's not your fault. I wish you all the strength to get through this.",
            "author": "YlangScent",
            "id": "i1jizba",
            "parent_id": "t3_tjedm7",
            "score": 13,
            "created_utc": 1647877465.0,
            "replies": []
        },
        {
            "body": "Hi sweetie, so horrifically sorry this happened to you. Please be gentle with yourself, you are NOT dumb or naive. This was assault, and you are not the perpetrator of your trauma. \n\nThis is on HIM. \n\nHowever, for now, please take care of yourself. I’m a survivor from the vanilla world, and there are days where it’s awful and days where everything is okay. The second one outweighs the first over time. \n\nYou are showing up for yourself, and that is AMAZING. Wish I could hug you, in the meantime sending so much love and girl power and strength your way. Please feel free to DM if you ever want or need, and I’m happy to share any/all resources I used in my own recovery years ago. \n\nHugs, hugs, hugs. ❤️",
            "author": "One-Permission-4184",
            "id": "i1k7tj6",
            "parent_id": "t3_tjedm7",
            "score": 8,
            "created_utc": 1647887118.0,
            "replies": [
                {
                    "body": "you’re lovely, thank you <3",
                    "author": "hadyenc",
                    "id": "i1k8nx0",
                    "parent_id": "t1_i1k7tj6",
                    "score": 3,
                    "created_utc": 1647887445.0,
                    "replies": [
                        {
                            "body": "Always happy to lift my fellow sisters up ❤️ keep going, keep showing up for yourself, and chase the dopamine love",
                            "author": "One-Permission-4184",
                            "id": "i1kwpht",
                            "parent_id": "t1_i1k8nx0",
                            "score": 3,
                            "created_utc": 1647897185.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm so sorry this happened to you. You did not deserve this and you are worth so much more than that POS treated you as. You did the right thing in reporting him. Maybe you saved the next girl from the same. Please if you need to talk I'm here but please also seek out a professional to talk to. 💛💛💛",
            "author": "theghostspider",
            "id": "i1jog9h",
            "parent_id": "t3_tjedm7",
            "score": 8,
            "created_utc": 1647879613.0,
            "replies": []
        },
        {
            "body": "You are absolutely not dumb and did the right thing by thinking quick. Many of us women are sexual assault victims who never acted quick enough to get a rape kit so you did the right thing. You should also give a photo & any personal info you have of this man to the police ASAP. \n\nI highly recommend talking to a counselor on the national sexual abuse hotline. Keeping it bottled up can eat you alive. 1-800-656-4673.\n\nMessage me if you ever want to talk, love. You are not alone 💛",
            "author": "6789998212yes",
            "id": "i1jsii9",
            "parent_id": "t3_tjedm7",
            "score": 7,
            "created_utc": 1647881175.0,
            "replies": []
        },
        {
            "body": "You are so strong for contacting police to press charges. I’m so sorry this happened to you :(",
            "author": "amoonshotgirl",
            "id": "i1jysl9",
            "parent_id": "t3_tjedm7",
            "score": 7,
            "created_utc": 1647883636.0,
            "replies": []
        },
        {
            "body": "Please apply for crime victims compensation in your state, it will help cover therapy and medical bills.",
            "author": "sea87",
            "id": "i1ms0hi",
            "parent_id": "t3_tjedm7",
            "score": 9,
            "created_utc": 1647931258.0,
            "replies": [
                {
                    "body": "Didn't even know that was available. I'm gonna give your comment some more visibility",
                    "author": "Additional-Ability99",
                    "id": "i1n6vns",
                    "parent_id": "t1_i1ms0hi",
                    "score": 2,
                    "created_utc": 1647944226.0,
                    "replies": []
                },
                {
                    "body": "Didn't realize this was possible, either. More people need to know about this.",
                    "author": "bananamoonmilk",
                    "id": "i4vz21k",
                    "parent_id": "t1_i1ms0hi",
                    "score": 0,
                    "created_utc": 1650061619.0,
                    "replies": [
                        {
                            "body": "I agree. It’s not well known. I’ve had absolutely zero luck in my area getting anyone to bill it, besides a massage therapist I was already seeing. She said it was actually pretty simple and paid out quickly.",
                            "author": "sea87",
                            "id": "i4vz7ol",
                            "parent_id": "t1_i4vz21k",
                            "score": 0,
                            "created_utc": 1650061691.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you want to talk I'm here, just message me",
            "author": null,
            "id": "i1jie6r",
            "parent_id": "t3_tjedm7",
            "score": 6,
            "created_utc": 1647877230.0,
            "replies": []
        },
        {
            "body": "Thoughts and prayers to you. That is absolutely terrible. You’re doing the right thing by involving the law, he should be punished. Find your support system and lean on them, as you process this.",
            "author": "ChPh313XX",
            "id": "i1jxp6m",
            "parent_id": "t3_tjedm7",
            "score": 6,
            "created_utc": 1647883205.0,
            "replies": []
        },
        {
            "body": "I'm sorry that happened to you, be careful and do not interact with him. \n\nI am so proud of you for getting it reported and everything. \n\nDon't negate, don't settle. This could help prevent it from happening again to someone else.\n\nAlways carry pepper spray &/or something you can use as a weapon.",
            "author": "MissRoyalBrush",
            "id": "i1jycd6",
            "parent_id": "t3_tjedm7",
            "score": 5,
            "created_utc": 1647883458.0,
            "replies": []
        },
        {
            "body": "What happened was not your fault but the actions of a monster. Thank you for being strong enough to press charges and protect others from him.  Lean on those closest to you for help and seek counseling to get you through this time.",
            "author": "manninc2000",
            "id": "i1jycn2",
            "parent_id": "t3_tjedm7",
            "score": 5,
            "created_utc": 1647883461.0,
            "replies": []
        },
        {
            "body": "I’m sorry this happened to you. ❤️ use all the resources in your community and from this forum to continue to heal.",
            "author": "amazoniandomme",
            "id": "i1jzb40",
            "parent_id": "t3_tjedm7",
            "score": 6,
            "created_utc": 1647883838.0,
            "replies": []
        },
        {
            "body": "I'm so sorry. You're not naive, never let a monster like that make you question your kindness or blame yourself for his actions. Sending love and strength ♡",
            "author": "puppiluvs",
            "id": "i1k8bkc",
            "parent_id": "t3_tjedm7",
            "score": 5,
            "created_utc": 1647887311.0,
            "replies": [
                {
                    "body": "thank you. <3",
                    "author": "hadyenc",
                    "id": "i1k8tib",
                    "parent_id": "t1_i1k8bkc",
                    "score": 3,
                    "created_utc": 1647887508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It feels wrong to upvote something horrible but I'd encourage everyone to do so anyway. This is something that *can* happen and it deserves visibility in this community.  \n\nOP, I'm so sorry this happened. You did the right thing and I hope you know it *will* make a difference.",
            "author": "_CallMeDodge_",
            "id": "i1jzo0e",
            "parent_id": "t3_tjedm7",
            "score": 12,
            "created_utc": 1647883980.0,
            "replies": [
                {
                    "body": "Upvote of solidarity. \n\nSending positive thoughts and vibes for OP, take advantage of the community here and reach out for support. Lots of DM’s are open to you, male and female, in case you need us.",
                    "author": "NuPhoenixX",
                    "id": "i1kh7pg",
                    "parent_id": "t1_i1jzo0e",
                    "score": 4,
                    "created_utc": 1647890870.0,
                    "replies": []
                },
                {
                    "body": "We are upvoting the bravery of this woman to recount her experience to this Forum 👍🏻",
                    "author": "Chill_SD1974",
                    "id": "i1k2w05",
                    "parent_id": "t1_i1jzo0e",
                    "score": 7,
                    "created_utc": 1647885223.0,
                    "replies": []
                },
                {
                    "body": "thank you, i really hope so.",
                    "author": "hadyenc",
                    "id": "i1k1j17",
                    "parent_id": "t1_i1jzo0e",
                    "score": 5,
                    "created_utc": 1647884701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry 🤗 \n\nYou’re a very strong and brave woman for getting the rape kit and pressing charges",
            "author": null,
            "id": "i1jobpv",
            "parent_id": "t3_tjedm7",
            "score": 4,
            "created_utc": 1647879564.0,
            "replies": []
        },
        {
            "body": "very sorry that happened. unfortunately predators exist everywhere. hopefully you can enforce some justice. not your fault at all, he is just evil.",
            "author": "ValueFuck",
            "id": "i1jzf7q",
            "parent_id": "t3_tjedm7",
            "score": 4,
            "created_utc": 1647883884.0,
            "replies": []
        },
        {
            "body": "That's awful, and I'm sorry it happened. Glad you reported it, and I hope the police follow it up.\n\nYou might want to inform the website you met him on. Give them the police reference too.",
            "author": "Mangotingthroneway",
            "id": "i1ldmaw",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647904370.0,
            "replies": []
        },
        {
            "body": "Oh no, so sorry to hear this. 😢\n\nSo many people care about you and want you to be OK. I doubt you want to talk to a guy right now, but if I can ever help I'm a DM away.\n\nI hope somebody ties a bungee cord to his junk and then pushes him off the ledge. Shitty manipulating motherfucker.",
            "author": "quietgrey1",
            "id": "i1kbpic",
            "parent_id": "t3_tjedm7",
            "score": 6,
            "created_utc": 1647888645.0,
            "replies": [
                {
                    "body": "this made me laugh, thank you",
                    "author": "hadyenc",
                    "id": "i1lm0sh",
                    "parent_id": "t1_i1kbpic",
                    "score": 3,
                    "created_utc": 1647908072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is horrible.  I hope he will get what he deserves.",
            "author": "EuropeanDaddyDom",
            "id": "i1jk15f",
            "parent_id": "t3_tjedm7",
            "score": 6,
            "created_utc": 1647877882.0,
            "replies": []
        },
        {
            "body": "The SLF community is behind you!  You’re not at fault in any way.  The fact that you’re strong enough to share this and work with authorities is a sign of strength.\n\nA monster attacked you by preying on your kindness, a violent crime was perpetrated trying to seize your power, but we can all see you’re strong.\n\nWe’re all here to support you.",
            "author": "badmonopoly",
            "id": "i1kf9pd",
            "parent_id": "t3_tjedm7",
            "score": 7,
            "created_utc": 1647890053.0,
            "replies": []
        },
        {
            "body": "Omg!  I'm so sorry to hear that.",
            "author": "MrRhoarke",
            "id": "i1k0wez",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647884457.0,
            "replies": []
        },
        {
            "body": "I'm very sorry this terrible thing happened to you.  If you're in the states look into rainn resources, and planned parenthood has victim advocates.  They provide some very helpful support and help to keep law enforcement accountable.",
            "author": null,
            "id": "i1ka85z",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647888062.0,
            "replies": []
        },
        {
            "body": "So sorry to hear that, and hopefully justice will be served for this buster",
            "author": "LFC4ever2022",
            "id": "i1kpt6m",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647894306.0,
            "replies": []
        },
        {
            "body": "So sorry this happened to you. I hope that her sees justice.",
            "author": "Binnsken",
            "id": "i1krw8z",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647895137.0,
            "replies": []
        },
        {
            "body": "Im very very very sorry. And You’re not that experience 💞",
            "author": "ghettokatniss",
            "id": "i1kujon",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647896201.0,
            "replies": []
        },
        {
            "body": "I don’t wanna upvote cause right now it’s at 111 and I just want you to know the angels are with you and you’re so loved 💕",
            "author": "Anastasiaxoxox",
            "id": "i1l605h",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647901133.0,
            "replies": []
        },
        {
            "body": "Damn.  At least u went and got a kit... what an idiot he is.  Hopefully justice is done.",
            "author": "Mirroruniverseudie",
            "id": "i1l7400",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647901594.0,
            "replies": []
        },
        {
            "body": "Very smart to get a rape kit. I’m sure you’re not the only victim. Hopefully others come forth also.",
            "author": "Last-FroyoYo",
            "id": "i1m1lry",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647915155.0,
            "replies": []
        },
        {
            "body": "I’m so sorry this happened to you.  I’m proud of you for getting a rape kit done.  We don’t excuse drunk people when they get in a bar fight and hurt someone.  We don’t excuse them if they abuse their kids, or when they drive and hit a pedestrian.  Again, I’m sorry this happened to you, pls know we are with you. 🙏🏼🙏🏼🙏🏼",
            "author": "ABCisrising",
            "id": "i1m87gf",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647918353.0,
            "replies": []
        },
        {
            "body": "thank you for taking action to leave a record of his harmful behaviour",
            "author": "play2grow",
            "id": "i1mbf6x",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647920051.0,
            "replies": []
        },
        {
            "body": "Sorry about what happened. You did the right thing, getting it off your chest. Now, you need to seek out a psychologist or support group of people who went through similar to help you through it.",
            "author": "gigsome",
            "id": "i1mn4hq",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647927451.0,
            "replies": []
        },
        {
            "body": "This is awful. Every story of sexual assault is awful, and stories where you trusted the person really hurt to read. What you're going through, I can only begin to imagine.\n\nBy all means, seek to redress this. If you think it's best to pursue criminal charges, I applaud you. That road is horrible, from often being mistreated just at the police report stage to everything that follows. Maybe it will help you heal, and if so go ahead.\n\nOtherwise, as others suggest, consider the civil route. Consider the \"move on\" route. Talk to an expert at RAINN or elsewhere. Don't suffer alone. Heal. Share your story. Don't be a victim, but rather a survivor.\n\nWe are all with you. This was not ok. It will never be ok.",
            "author": "marker3000",
            "id": "i1mqoyx",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647930198.0,
            "replies": []
        },
        {
            "body": "sorry to hear this. this kind of stuff is why SA is going to get shut down sooner or later",
            "author": "vtec__",
            "id": "i1k07ec",
            "parent_id": "t3_tjedm7",
            "score": 5,
            "created_utc": 1647884190.0,
            "replies": []
        },
        {
            "body": "I’m so sorry this happened to you. Was this a SD you had been seeing for a while or was it the first M&G?",
            "author": null,
            "id": "i1jjosq",
            "parent_id": "t3_tjedm7",
            "score": 7,
            "created_utc": 1647877748.0,
            "replies": [
                {
                    "body": "we had been on two dates before this.",
                    "author": "hadyenc",
                    "id": "i1k1kz7",
                    "parent_id": "t1_i1jjosq",
                    "score": 3,
                    "created_utc": 1647884722.0,
                    "replies": [
                        {
                            "body": "First date or fiftieth, he’s a rapist regardless. I’m so sorry you had that experience and I hope the law and karma both catch up to him.  In the meantime, please take care of yourself in whatever ways best work for you personally.",
                            "author": "PlugItWithaBeer",
                            "id": "i1k7791",
                            "parent_id": "t1_i1k1kz7",
                            "score": 13,
                            "created_utc": 1647886880.0,
                            "replies": [
                                {
                                    "body": "thank you <3",
                                    "author": "hadyenc",
                                    "id": "i1k7aa4",
                                    "parent_id": "t1_i1k7791",
                                    "score": 3,
                                    "created_utc": 1647886912.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry this happened to you. This isn’t your fault. My DMs are open if you even need to talk.",
            "author": "c0rnstarr",
            "id": "i1k3tsr",
            "parent_id": "t3_tjedm7",
            "score": 4,
            "created_utc": 1647885583.0,
            "replies": []
        },
        {
            "body": "Fuck, I'm  so sorry to hear. I wish you well",
            "author": "Mr_Curious_Cat",
            "id": "i1ko0u2",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1647893600.0,
            "replies": []
        },
        {
            "body": "Fuck. I am so sorry this happened to you. But girl, I am SO proud of you for being strong enough and brave enough to get a rape kit done!! Fight the fuck back! You may not realize this now but sharing your story is so powerful. Someone else here might find themselves in the same situation and remember reading your story and find solace and going to the police. You did that. Thank you for finding the strength where others couldn’t. You’re doing the right thing. And you ARE doing something. I used to be a sexual assault advocate for survivors and you won’t believe how many options there are for you. They’ll find his dna on your body. And I can even tell you certain procedures and lengths detectives go in order to collect as much evidence as possible. Don’t give up just yet! \n\nI’m really fucking impressed at how strong you are. You’re gonna get through this. Maybe not right now, but you will. There are a lot of wonderful strangers on the internet who are rooting for you. ❤️",
            "author": "JazyZazy",
            "id": "i1rd4yy",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1648012163.0,
            "replies": []
        },
        {
            "body": "My darling you were not dumb maybe naive but unfortunately that's ask of us, he obviously lied and pretended he was incapacitated but this only shows you the monster he always was.  I am sooooo proud of you for speaking up and doing a kit, most of us wish we had done the same but instead we let silence and fear takr over and i will tell you that is way worse.  you got this luv and if you need the girls to be there with you then we'll be there every step of the way to make as much noise as possbile, you are not alone, you are not dumb, you were trusting and naive because you were too pure for that monster which is what he was preying on. these men need to be hold accountable, enough is enough and this was not yur fault. clearly that sicko needs jail so he can see that behavior is never ok and there is consequences....bestie just give me a name and dob and i'll hex him too lol.   he is about to learn what happens when you mess with the feminine energy",
            "author": "Better_Truck_7992",
            "id": "i1t3ymj",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1648050541.0,
            "replies": []
        },
        {
            "body": "i’m so sorry! I hope you’re holding up okay :) i’m here if u ever need to talk",
            "author": "living_as_v",
            "id": "i1whr4w",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1648105221.0,
            "replies": []
        },
        {
            "body": "This is why sugar baby is dangerous",
            "author": "These-Buy-4143",
            "id": "i514ip4",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1650159961.0,
            "replies": [
                {
                    "body": "tell me about it",
                    "author": "hadyenc",
                    "id": "i52myb6",
                    "parent_id": "t1_i514ip4",
                    "score": 1,
                    "created_utc": 1650197370.0,
                    "replies": [
                        {
                            "body": "I really wish more girls would read this forum. The risk is definitely not worth it",
                            "author": "These-Buy-4143",
                            "id": "i52n1vt",
                            "parent_id": "t1_i52myb6",
                            "score": 2,
                            "created_utc": 1650197436.0,
                            "replies": [
                                {
                                    "body": "it doesn’t help much. i had a lot of people private message saying it was my fault it happened, so lots of lovely people here i guess",
                                    "author": "hadyenc",
                                    "id": "i52o3gc",
                                    "parent_id": "t1_i52n1vt",
                                    "score": 1,
                                    "created_utc": 1650198096.0,
                                    "replies": [
                                        {
                                            "body": "Not for the people for the cautionary tales. Society is fucked when you focus on the raped rather than the rapist. But there’s avenues where probably of encountering a rapist is higher… this is one.. Hope you win and put this matter to close the best way you can",
                                            "author": "These-Buy-4143",
                                            "id": "i52oc2e",
                                            "parent_id": "t1_i52o3gc",
                                            "score": 2,
                                            "created_utc": 1650198243.0,
                                            "replies": [
                                                {
                                                    "body": "thank you, lots. and i agree",
                                                    "author": "hadyenc",
                                                    "id": "i52p1e1",
                                                    "parent_id": "t1_i52oc2e",
                                                    "score": 1,
                                                    "created_utc": 1650198681.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank yourself for fighting who am I but a stranger",
                                                            "author": "These-Buy-4143",
                                                            "id": "i5339aq",
                                                            "parent_id": "t1_i52p1e1",
                                                            "score": 2,
                                                            "created_utc": 1650205998.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i am so sorry, i hope you’re doing fine now ):",
            "author": "myownlivinghell",
            "id": "i5drqze",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1650395981.0,
            "replies": []
        },
        {
            "body": "Was just going to post few comforting words. But then saw your post history! And you became someone real, with emotions, beating heart, as if I know you. I cant imaging the monster who did this to you! \n\nMy heart felt condolences! Any way I can help, please ask!",
            "author": "captainIsBack4u",
            "id": "i1kag7v",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647888150.0,
            "replies": []
        },
        {
            "body": "Press charges... rapists pedophiles physically abusive individuals, serial killers...... these types of people always have more victims than they are convicted of... \n\nHe is probably betting you wont press charges due to being afraid of the \"sugar\" part....\n\nF that... be 100% honest with the police and have him charged....",
            "author": "SpaceGuy1968",
            "id": "i1kz671",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647898231.0,
            "replies": []
        },
        {
            "body": "I want to say that you did nothing wrong.\n\nThe rape, the kit, the reporting, the counselling, the case building, the years it takes in court…none of that is the hardest part. The hardest part is living with the trauma that rape causes. Please seek professional support in the form of some sort of therapy. Trauma actually changes the way your brain functions, and the long term effects are terrible, but the good news is that the brain can be trained into functioning the way you want it to. \n\nI agree with another poster that mentioned making a civil claim. Rape is difficult to prosecute criminally. There are legal counsellors who can help explain the process to you, and support you throughout your journey (generally accessible from sexual assault centres).",
            "author": "InnerRadio7",
            "id": "i1n2ssg",
            "parent_id": "t3_tjedm7",
            "score": 3,
            "created_utc": 1647940774.0,
            "replies": []
        },
        {
            "body": "I am so sorry this happened to you. He is a criminal and belongs in jail…or worse.",
            "author": null,
            "id": "i1k50q9",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1647886038.0,
            "replies": []
        },
        {
            "body": "My heart breaks for you.\n\nOne of the challenges of sugaring is that we often don’t have anyone in our real life that we can talk to about it. But you need someone to talk to. Please open up to someone you trust. And if that really isn’t possible please DM one of the amazing women in this thread, I’m sure they will be there for you.\n\nYou are not alone.",
            "author": "TwerkingAvocado",
            "id": "i1nf1ku",
            "parent_id": "t3_tjedm7",
            "score": 2,
            "created_utc": 1647950005.0,
            "replies": []
        },
        {
            "body": "Do you have his name?  \nI JUST WANT TO HAVE A LITTLE TALK",
            "author": "cami_dub",
            "id": "i1nv3nz",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647958092.0,
            "replies": [
                {
                    "body": "oh yeah, i went a little crazy yesterday and found out all his info, including his wife and daughter. i’m not going to do anything, yet, because i don’t want to interfere with the case.",
                    "author": "hadyenc",
                    "id": "i1nvbr1",
                    "parent_id": "t1_i1nv3nz",
                    "score": 1,
                    "created_utc": 1647958189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so incredibly sorry.  Please seek therapy asap. \nWish I had done that sooner. \n\nHas you been in a SR with him long?",
            "author": null,
            "id": "i1jpfc0",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647879986.0,
            "replies": [
                {
                    "body": "about a month",
                    "author": "hadyenc",
                    "id": "i1k1m7e",
                    "parent_id": "t1_i1jpfc0",
                    "score": 0,
                    "created_utc": 1647884734.0,
                    "replies": [
                        {
                            "body": "I’m very sorry. That is a twisted individual who gets off in hurting people like that. I’m\nProud that you pressed charges",
                            "author": null,
                            "id": "i1k29nt",
                            "parent_id": "t1_i1k1m7e",
                            "score": 2,
                            "created_utc": 1647884985.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hope you get that mofo!",
            "author": "Twilight-310",
            "id": "i1lr4ld",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647910373.0,
            "replies": []
        },
        {
            "body": "Serious question -- and I'm not in any way downplaying the horrific experience OP went through. Nor am I wanting to discourage OP. A knowledgeable answer would probably benefit her and others who may go through this.\n\nI'm just really wondering...\n\nHow does one prove rape without witnesses and with someone you've already been on multiple dates?\n\nThe rape kit only proves there was intercourse. His obvious defense is going to be in was concentual. \n\nUnless there are defensive marks, how does one prove this?",
            "author": "matthewjphillips",
            "id": "i1mcgm5",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647920629.0,
            "replies": [
                {
                    "body": "i don’t really know much, but they did take a million pictures of me, everywhere. i have a lot of bruises/scratches.",
                    "author": "hadyenc",
                    "id": "i1med8q",
                    "parent_id": "t1_i1mcgm5",
                    "score": 3,
                    "created_utc": 1647921711.0,
                    "replies": [
                        {
                            "body": "I am happy to help you search for an attorney and other resources like a victims rights advocate if you are interested. Please PM me if you need any support.",
                            "author": "sea87",
                            "id": "i1qkc3u",
                            "parent_id": "t1_i1med8q",
                            "score": 2,
                            "created_utc": 1647997227.0,
                            "replies": [
                                {
                                    "body": "I might end up doing that, thank you for offering",
                                    "author": "hadyenc",
                                    "id": "i1qlldm",
                                    "parent_id": "t1_i1qkc3u",
                                    "score": 2,
                                    "created_utc": 1647997798.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re in my prayers for the upcoming days.  Take care.",
            "author": "JDMultralight",
            "id": "i1mk2jz",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647925280.0,
            "replies": []
        },
        {
            "body": "I'm new to this shit but you've just made me decide that the only way I'm being in a non-public place with a SD is if I've already decided I'm ok with having sex with him.",
            "author": "Additional-Ability99",
            "id": "i1n6hq6",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647943910.0,
            "replies": []
        },
        {
            "body": "The guy isn't smart either unless he already has a criminal history.  Then he knows tackling more points on his record wouldn't dent him.\n\nIf you go to a hotel and he checked in then he's already on record.  It's a matter of the police connecting the dots and he'll be arrested.",
            "author": "MKTekke",
            "id": "i1o5i9l",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647962387.0,
            "replies": []
        },
        {
            "body": "Im soo sorry this happened to you. Please follow through with the charges… He will continue this sick behavior. I wish you healing. Please keep us posted",
            "author": "Good_vibes_mee",
            "id": "i1pow72",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647983833.0,
            "replies": []
        },
        {
            "body": "I am sorry you went through this. \nThis is not going to be easy to prove if you have been paid by this guy before. \n\nHe can claim that you are a prostitute, you can both be in trouble for solicitation. \n\nPlease talk to a lawyer before you do anything. \n\nI hope you get justice.",
            "author": "professorxc",
            "id": "i1k32sb",
            "parent_id": "t3_tjedm7",
            "score": -7,
            "created_utc": 1647885295.0,
            "replies": [
                {
                    "body": "He’s not going to claim she is a prostitute and even so, you can’t charge someone after the fact without evidence. He said she said is circumstantial, much like sexual assault, but with a rape kit she has a better chance. \n\nShe’s stating rape, no priors of soliciting, him claiming prostitution means nothing. It will have zero effect and only serve to make him look worse.\n\nIt’s very important to avoid statements like that because it will make women not come forward. You don’t speak to a lawyer when you get raped. You speak to the police and the hospital.",
                    "author": "Cdnsugarr",
                    "id": "i1k7s63",
                    "parent_id": "t1_i1k32sb",
                    "score": 15,
                    "created_utc": 1647887103.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you feel comfortable, would you mind sharing more details of the story?",
            "author": "femuserhere",
            "id": "i1kf08l",
            "parent_id": "t3_tjedm7",
            "score": -8,
            "created_utc": 1647889944.0,
            "replies": [
                {
                    "body": "it was completely platonic, I was never going to do anything sexual with him. we had only been to dinner twice before this, this was our third date. we had dinner and a couple cocktails. he pretended that he was drunk, i thought he was just a lightweight. looking back, that makes no sense because i drank the same amount as him, and he easily has 150lbs on me. he was stumbling, i told him i would help him up to his room in the hotel. the second he opened the door, he was immediately no longer drunk, he pushed me into the room, shoved me against the bed, and held me down while it happened. i finally was able to push my way out and I ran. is that enough info for you? i’ve had to tell like five different cops, an investigator, and two doctors.",
                    "author": "hadyenc",
                    "id": "i1l7trp",
                    "parent_id": "t1_i1kf08l",
                    "score": 6,
                    "created_utc": 1647901896.0,
                    "replies": [
                        {
                            "body": "Dear God. I'm sorry, that was horrible. Fuck him for taking advantage of your kindness",
                            "author": "Additional-Ability99",
                            "id": "i1n7126",
                            "parent_id": "t1_i1l7trp",
                            "score": 3,
                            "created_utc": 1647944344.0,
                            "replies": []
                        },
                        {
                            "body": "Thank you for sharing your personal story.  \n\nIt must be tiresome to have to explain multiple times and mentally relive that horrible event. I stand by you and this will help others to keep a watch out for these signs. \n\nI wish all the best for you and justice is served.",
                            "author": "femuserhere",
                            "id": "i1l95ia",
                            "parent_id": "t1_i1l7trp",
                            "score": 2,
                            "created_utc": 1647902446.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "More details will bring out people arguing that she was either not raped or some other comments that don’t help the matter.   \n\nIf she feels she was raped and is taking legal recourse then she has done what she can.",
                    "author": "houstonsd",
                    "id": "i1kgdl5",
                    "parent_id": "t1_i1kf08l",
                    "score": 5,
                    "created_utc": 1647890513.0,
                    "replies": [
                        {
                            "body": "I have no intention of causing debates and uproar over this sensitive issue. I just wanted to know so i and maybe other can learn from her story and situation.",
                            "author": "femuserhere",
                            "id": "i1kzoth",
                            "parent_id": "t1_i1kgdl5",
                            "score": 3,
                            "created_utc": 1647898449.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "… why? For what purpose?",
                    "author": "WestCoastCompanion",
                    "id": "i1ku00c",
                    "parent_id": "t1_i1kf08l",
                    "score": 3,
                    "created_utc": 1647895981.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "i1nsqs8",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647957057.0,
            "replies": [
                {
                    "body": "Rule #1: Remember the human\n\nBe respectful to other posters. No name calling, personal attacks, etc. We are all humans here.",
                    "author": "NoLimitLexa",
                    "id": "i1nyojx",
                    "parent_id": "t1_i1nsqs8",
                    "score": 2,
                    "created_utc": 1647959617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sighhhhhhhh",
            "author": "oskih",
            "id": "i1o1wqm",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1647960940.0,
            "replies": []
        },
        {
            "body": "Even if nothing happens still make the effort, it will at least show him what could’ve happened and at least scare him a little to hopefully never do something like that again. You are strong and beautiful and I hope every day gets a little bit better for you",
            "author": "Little-Honey-67",
            "id": "i2xxosg",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1648785931.0,
            "replies": []
        },
        {
            "body": "you’re not dumb or naive for trying to be a good person. some people are just sick, has absolutely nothing to do w you. & ur report will at least put his name in the system, so if he does this again they’ll know he has a history. praying for ur peace <3",
            "author": "carmellanoir",
            "id": "i3aw3v0",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1649038670.0,
            "replies": []
        },
        {
            "body": "The only dumb and naive person is the idiot who decided to make a stupid choice that will destroy his life",
            "author": "Signal-Blacksmith-53",
            "id": "i3cc7ud",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1649073925.0,
            "replies": []
        },
        {
            "body": "I am so sorry let me know I would love to help you and go pound his face in 👊",
            "author": "PaulyOG9305",
            "id": "i4t19do",
            "parent_id": "t3_tjedm7",
            "score": 1,
            "created_utc": 1650008058.0,
            "replies": [
                {
                    "body": "let’s go! i would personally love backup",
                    "author": "hadyenc",
                    "id": "i52n0oi",
                    "parent_id": "t1_i4t19do",
                    "score": 1,
                    "created_utc": 1650197413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100000000% So proud...that's the hardest part. And she was not dumb & naive. She was kind.",
            "author": "ShaArt5",
            "id": "i1jro42",
            "parent_id": "t1_i1jjzrj",
            "score": 72,
            "created_utc": 1647880849.0,
            "replies": []
        },
        {
            "body": "Do everything you can to get the DA to go after him criminally.  \n\nIf that doesn’t work, sue him civilly (for money). \n\nThe standard for a civil suit isn’t “beyond a reasonable doubt”. It’s “which side do you believe more?” So you have a great chance of winning there or (more likely) settling for a huge payday.",
            "author": "ifisch",
            "id": "i1lrwi3",
            "parent_id": "t1_i1jjzrj",
            "score": 22,
            "created_utc": 1647910721.0,
            "replies": []
        },
        {
            "body": "Great advice sorry this happened to you.",
            "author": "wb19081908",
            "id": "i1l4bmp",
            "parent_id": "t1_i1jjzrj",
            "score": 9,
            "created_utc": 1647900427.0,
            "replies": []
        },
        {
            "body": "you’re wonderful, thank you",
            "author": "hadyenc",
            "id": "i1k4ral",
            "parent_id": "t1_i1k4jam",
            "score": 18,
            "created_utc": 1647885937.0,
            "replies": [
                {
                    "body": "Of course 💕💕 focus on you rn",
                    "author": "strt31",
                    "id": "i1k6g93",
                    "parent_id": "t1_i1k4ral",
                    "score": 9,
                    "created_utc": 1647886592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d add to this list:\n\nDo not communicate with him at all.",
            "author": "ORD-inary",
            "id": "i1lg41c",
            "parent_id": "t1_i1jwdi9",
            "score": 9,
            "created_utc": 1647905445.0,
            "replies": [
                {
                    "body": "don’t worry, i absolutely won’t. i’ve already blocked him on everything.",
                    "author": "hadyenc",
                    "id": "i1llwpz",
                    "parent_id": "t1_i1lg41c",
                    "score": 9,
                    "created_utc": 1647908022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd also wonder about advising the website where she met him, and asking her lawyer about *their*  liability too.",
            "author": "Mangotingthroneway",
            "id": "i1ldttw",
            "parent_id": "t1_i1jwdi9",
            "score": 3,
            "created_utc": 1647904460.0,
            "replies": [
                {
                    "body": "Exactly, I am in contact with a lawyer/ advocacy attorney who does this very thing and I direct ladies to her, if they have been assaulted. She allows the women to remain 100% anonymous as well. Those websites can very much be held accountable and women can (and do) receive monetary compensation.",
                    "author": null,
                    "id": "i1x7b0x",
                    "parent_id": "t1_i1ldttw",
                    "score": 2,
                    "created_utc": 1648124669.0,
                    "replies": []
                },
                {
                    "body": "I don't see the benefit of going after the website :( They have nothing to do with the predator, what could the owners of the site have done different?",
                    "author": "007selfdestruct",
                    "id": "i1ukbp7",
                    "parent_id": "t1_i1ldttw",
                    "score": 1,
                    "created_utc": 1648070318.0,
                    "replies": [
                        {
                            "body": "She is 100% correct in that the website CAN be held liable. I am in contact with a non-profit/ advocacy attorney who does this very thing and she allows the girls to stay 100% anonymous...and they can be entitled to monetary compensation through holding the website accountable. This has been done with other 'dating' websites as well.",
                            "author": null,
                            "id": "i1x70lg",
                            "parent_id": "t1_i1ukbp7",
                            "score": 2,
                            "created_utc": 1648124509.0,
                            "replies": []
                        },
                        {
                            "body": "There's a number of issues. First, cutting the guy from the website. They can do that. Second, cooperation with LE. The site will have details allowing LE to contact the alleged rapist. Third, if the police interview the site, and they aren't cooperative,  or they've had previous reports and done nothing, then there are often possible cases of negligence to pursue.",
                            "author": "Mangotingthroneway",
                            "id": "i21wdsl",
                            "parent_id": "t1_i1ukbp7",
                            "score": 2,
                            "created_utc": 1648207902.0,
                            "replies": [
                                {
                                    "body": "Absolutely valid points. I am speaking in the past tense - referring to the \"their liability\" part.",
                                    "author": "007selfdestruct",
                                    "id": "i237xvk",
                                    "parent_id": "t1_i21wdsl",
                                    "score": 1,
                                    "created_utc": 1648228813.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i’m sorry that happened to you :( and thank you, a lot",
            "author": "hadyenc",
            "id": "i1k0z74",
            "parent_id": "t1_i1jtq48",
            "score": 12,
            "created_utc": 1647884486.0,
            "replies": []
        },
        {
            "body": "you’re lovely, thank you <3",
            "author": "hadyenc",
            "id": "i1k8nx0",
            "parent_id": "t1_i1k7tj6",
            "score": 3,
            "created_utc": 1647887445.0,
            "replies": [
                {
                    "body": "Always happy to lift my fellow sisters up ❤️ keep going, keep showing up for yourself, and chase the dopamine love",
                    "author": "One-Permission-4184",
                    "id": "i1kwpht",
                    "parent_id": "t1_i1k8nx0",
                    "score": 3,
                    "created_utc": 1647897185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Didn't even know that was available. I'm gonna give your comment some more visibility",
            "author": "Additional-Ability99",
            "id": "i1n6vns",
            "parent_id": "t1_i1ms0hi",
            "score": 2,
            "created_utc": 1647944226.0,
            "replies": []
        },
        {
            "body": "Didn't realize this was possible, either. More people need to know about this.",
            "author": "bananamoonmilk",
            "id": "i4vz21k",
            "parent_id": "t1_i1ms0hi",
            "score": 0,
            "created_utc": 1650061619.0,
            "replies": [
                {
                    "body": "I agree. It’s not well known. I’ve had absolutely zero luck in my area getting anyone to bill it, besides a massage therapist I was already seeing. She said it was actually pretty simple and paid out quickly.",
                    "author": "sea87",
                    "id": "i4vz7ol",
                    "parent_id": "t1_i4vz21k",
                    "score": 0,
                    "created_utc": 1650061691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thank you. <3",
            "author": "hadyenc",
            "id": "i1k8tib",
            "parent_id": "t1_i1k8bkc",
            "score": 3,
            "created_utc": 1647887508.0,
            "replies": []
        },
        {
            "body": "Upvote of solidarity. \n\nSending positive thoughts and vibes for OP, take advantage of the community here and reach out for support. Lots of DM’s are open to you, male and female, in case you need us.",
            "author": "NuPhoenixX",
            "id": "i1kh7pg",
            "parent_id": "t1_i1jzo0e",
            "score": 4,
            "created_utc": 1647890870.0,
            "replies": []
        },
        {
            "body": "We are upvoting the bravery of this woman to recount her experience to this Forum 👍🏻",
            "author": "Chill_SD1974",
            "id": "i1k2w05",
            "parent_id": "t1_i1jzo0e",
            "score": 7,
            "created_utc": 1647885223.0,
            "replies": []
        },
        {
            "body": "thank you, i really hope so.",
            "author": "hadyenc",
            "id": "i1k1j17",
            "parent_id": "t1_i1jzo0e",
            "score": 5,
            "created_utc": 1647884701.0,
            "replies": []
        },
        {
            "body": "this made me laugh, thank you",
            "author": "hadyenc",
            "id": "i1lm0sh",
            "parent_id": "t1_i1kbpic",
            "score": 3,
            "created_utc": 1647908072.0,
            "replies": []
        },
        {
            "body": "we had been on two dates before this.",
            "author": "hadyenc",
            "id": "i1k1kz7",
            "parent_id": "t1_i1jjosq",
            "score": 3,
            "created_utc": 1647884722.0,
            "replies": [
                {
                    "body": "First date or fiftieth, he’s a rapist regardless. I’m so sorry you had that experience and I hope the law and karma both catch up to him.  In the meantime, please take care of yourself in whatever ways best work for you personally.",
                    "author": "PlugItWithaBeer",
                    "id": "i1k7791",
                    "parent_id": "t1_i1k1kz7",
                    "score": 13,
                    "created_utc": 1647886880.0,
                    "replies": [
                        {
                            "body": "thank you <3",
                            "author": "hadyenc",
                            "id": "i1k7aa4",
                            "parent_id": "t1_i1k7791",
                            "score": 3,
                            "created_utc": 1647886912.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "tell me about it",
            "author": "hadyenc",
            "id": "i52myb6",
            "parent_id": "t1_i514ip4",
            "score": 1,
            "created_utc": 1650197370.0,
            "replies": [
                {
                    "body": "I really wish more girls would read this forum. The risk is definitely not worth it",
                    "author": "These-Buy-4143",
                    "id": "i52n1vt",
                    "parent_id": "t1_i52myb6",
                    "score": 2,
                    "created_utc": 1650197436.0,
                    "replies": [
                        {
                            "body": "it doesn’t help much. i had a lot of people private message saying it was my fault it happened, so lots of lovely people here i guess",
                            "author": "hadyenc",
                            "id": "i52o3gc",
                            "parent_id": "t1_i52n1vt",
                            "score": 1,
                            "created_utc": 1650198096.0,
                            "replies": [
                                {
                                    "body": "Not for the people for the cautionary tales. Society is fucked when you focus on the raped rather than the rapist. But there’s avenues where probably of encountering a rapist is higher… this is one.. Hope you win and put this matter to close the best way you can",
                                    "author": "These-Buy-4143",
                                    "id": "i52oc2e",
                                    "parent_id": "t1_i52o3gc",
                                    "score": 2,
                                    "created_utc": 1650198243.0,
                                    "replies": [
                                        {
                                            "body": "thank you, lots. and i agree",
                                            "author": "hadyenc",
                                            "id": "i52p1e1",
                                            "parent_id": "t1_i52oc2e",
                                            "score": 1,
                                            "created_utc": 1650198681.0,
                                            "replies": [
                                                {
                                                    "body": "Thank yourself for fighting who am I but a stranger",
                                                    "author": "These-Buy-4143",
                                                    "id": "i5339aq",
                                                    "parent_id": "t1_i52p1e1",
                                                    "score": 2,
                                                    "created_utc": 1650205998.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "oh yeah, i went a little crazy yesterday and found out all his info, including his wife and daughter. i’m not going to do anything, yet, because i don’t want to interfere with the case.",
            "author": "hadyenc",
            "id": "i1nvbr1",
            "parent_id": "t1_i1nv3nz",
            "score": 1,
            "created_utc": 1647958189.0,
            "replies": []
        },
        {
            "body": "about a month",
            "author": "hadyenc",
            "id": "i1k1m7e",
            "parent_id": "t1_i1jpfc0",
            "score": 0,
            "created_utc": 1647884734.0,
            "replies": [
                {
                    "body": "I’m very sorry. That is a twisted individual who gets off in hurting people like that. I’m\nProud that you pressed charges",
                    "author": null,
                    "id": "i1k29nt",
                    "parent_id": "t1_i1k1m7e",
                    "score": 2,
                    "created_utc": 1647884985.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i don’t really know much, but they did take a million pictures of me, everywhere. i have a lot of bruises/scratches.",
            "author": "hadyenc",
            "id": "i1med8q",
            "parent_id": "t1_i1mcgm5",
            "score": 3,
            "created_utc": 1647921711.0,
            "replies": [
                {
                    "body": "I am happy to help you search for an attorney and other resources like a victims rights advocate if you are interested. Please PM me if you need any support.",
                    "author": "sea87",
                    "id": "i1qkc3u",
                    "parent_id": "t1_i1med8q",
                    "score": 2,
                    "created_utc": 1647997227.0,
                    "replies": [
                        {
                            "body": "I might end up doing that, thank you for offering",
                            "author": "hadyenc",
                            "id": "i1qlldm",
                            "parent_id": "t1_i1qkc3u",
                            "score": 2,
                            "created_utc": 1647997798.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He’s not going to claim she is a prostitute and even so, you can’t charge someone after the fact without evidence. He said she said is circumstantial, much like sexual assault, but with a rape kit she has a better chance. \n\nShe’s stating rape, no priors of soliciting, him claiming prostitution means nothing. It will have zero effect and only serve to make him look worse.\n\nIt’s very important to avoid statements like that because it will make women not come forward. You don’t speak to a lawyer when you get raped. You speak to the police and the hospital.",
            "author": "Cdnsugarr",
            "id": "i1k7s63",
            "parent_id": "t1_i1k32sb",
            "score": 15,
            "created_utc": 1647887103.0,
            "replies": []
        },
        {
            "body": "it was completely platonic, I was never going to do anything sexual with him. we had only been to dinner twice before this, this was our third date. we had dinner and a couple cocktails. he pretended that he was drunk, i thought he was just a lightweight. looking back, that makes no sense because i drank the same amount as him, and he easily has 150lbs on me. he was stumbling, i told him i would help him up to his room in the hotel. the second he opened the door, he was immediately no longer drunk, he pushed me into the room, shoved me against the bed, and held me down while it happened. i finally was able to push my way out and I ran. is that enough info for you? i’ve had to tell like five different cops, an investigator, and two doctors.",
            "author": "hadyenc",
            "id": "i1l7trp",
            "parent_id": "t1_i1kf08l",
            "score": 6,
            "created_utc": 1647901896.0,
            "replies": [
                {
                    "body": "Dear God. I'm sorry, that was horrible. Fuck him for taking advantage of your kindness",
                    "author": "Additional-Ability99",
                    "id": "i1n7126",
                    "parent_id": "t1_i1l7trp",
                    "score": 3,
                    "created_utc": 1647944344.0,
                    "replies": []
                },
                {
                    "body": "Thank you for sharing your personal story.  \n\nIt must be tiresome to have to explain multiple times and mentally relive that horrible event. I stand by you and this will help others to keep a watch out for these signs. \n\nI wish all the best for you and justice is served.",
                    "author": "femuserhere",
                    "id": "i1l95ia",
                    "parent_id": "t1_i1l7trp",
                    "score": 2,
                    "created_utc": 1647902446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More details will bring out people arguing that she was either not raped or some other comments that don’t help the matter.   \n\nIf she feels she was raped and is taking legal recourse then she has done what she can.",
            "author": "houstonsd",
            "id": "i1kgdl5",
            "parent_id": "t1_i1kf08l",
            "score": 5,
            "created_utc": 1647890513.0,
            "replies": [
                {
                    "body": "I have no intention of causing debates and uproar over this sensitive issue. I just wanted to know so i and maybe other can learn from her story and situation.",
                    "author": "femuserhere",
                    "id": "i1kzoth",
                    "parent_id": "t1_i1kgdl5",
                    "score": 3,
                    "created_utc": 1647898449.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "… why? For what purpose?",
            "author": "WestCoastCompanion",
            "id": "i1ku00c",
            "parent_id": "t1_i1kf08l",
            "score": 3,
            "created_utc": 1647895981.0,
            "replies": []
        },
        {
            "body": "Rule #1: Remember the human\n\nBe respectful to other posters. No name calling, personal attacks, etc. We are all humans here.",
            "author": "NoLimitLexa",
            "id": "i1nyojx",
            "parent_id": "t1_i1nsqs8",
            "score": 2,
            "created_utc": 1647959617.0,
            "replies": []
        },
        {
            "body": "let’s go! i would personally love backup",
            "author": "hadyenc",
            "id": "i52n0oi",
            "parent_id": "t1_i4t19do",
            "score": 1,
            "created_utc": 1650197413.0,
            "replies": []
        },
        {
            "body": "Of course 💕💕 focus on you rn",
            "author": "strt31",
            "id": "i1k6g93",
            "parent_id": "t1_i1k4ral",
            "score": 9,
            "created_utc": 1647886592.0,
            "replies": []
        },
        {
            "body": "don’t worry, i absolutely won’t. i’ve already blocked him on everything.",
            "author": "hadyenc",
            "id": "i1llwpz",
            "parent_id": "t1_i1lg41c",
            "score": 9,
            "created_utc": 1647908022.0,
            "replies": []
        },
        {
            "body": "Exactly, I am in contact with a lawyer/ advocacy attorney who does this very thing and I direct ladies to her, if they have been assaulted. She allows the women to remain 100% anonymous as well. Those websites can very much be held accountable and women can (and do) receive monetary compensation.",
            "author": null,
            "id": "i1x7b0x",
            "parent_id": "t1_i1ldttw",
            "score": 2,
            "created_utc": 1648124669.0,
            "replies": []
        },
        {
            "body": "I don't see the benefit of going after the website :( They have nothing to do with the predator, what could the owners of the site have done different?",
            "author": "007selfdestruct",
            "id": "i1ukbp7",
            "parent_id": "t1_i1ldttw",
            "score": 1,
            "created_utc": 1648070318.0,
            "replies": [
                {
                    "body": "She is 100% correct in that the website CAN be held liable. I am in contact with a non-profit/ advocacy attorney who does this very thing and she allows the girls to stay 100% anonymous...and they can be entitled to monetary compensation through holding the website accountable. This has been done with other 'dating' websites as well.",
                    "author": null,
                    "id": "i1x70lg",
                    "parent_id": "t1_i1ukbp7",
                    "score": 2,
                    "created_utc": 1648124509.0,
                    "replies": []
                },
                {
                    "body": "There's a number of issues. First, cutting the guy from the website. They can do that. Second, cooperation with LE. The site will have details allowing LE to contact the alleged rapist. Third, if the police interview the site, and they aren't cooperative,  or they've had previous reports and done nothing, then there are often possible cases of negligence to pursue.",
                    "author": "Mangotingthroneway",
                    "id": "i21wdsl",
                    "parent_id": "t1_i1ukbp7",
                    "score": 2,
                    "created_utc": 1648207902.0,
                    "replies": [
                        {
                            "body": "Absolutely valid points. I am speaking in the past tense - referring to the \"their liability\" part.",
                            "author": "007selfdestruct",
                            "id": "i237xvk",
                            "parent_id": "t1_i21wdsl",
                            "score": 1,
                            "created_utc": 1648228813.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Always happy to lift my fellow sisters up ❤️ keep going, keep showing up for yourself, and chase the dopamine love",
            "author": "One-Permission-4184",
            "id": "i1kwpht",
            "parent_id": "t1_i1k8nx0",
            "score": 3,
            "created_utc": 1647897185.0,
            "replies": []
        },
        {
            "body": "I agree. It’s not well known. I’ve had absolutely zero luck in my area getting anyone to bill it, besides a massage therapist I was already seeing. She said it was actually pretty simple and paid out quickly.",
            "author": "sea87",
            "id": "i4vz7ol",
            "parent_id": "t1_i4vz21k",
            "score": 0,
            "created_utc": 1650061691.0,
            "replies": []
        },
        {
            "body": "First date or fiftieth, he’s a rapist regardless. I’m so sorry you had that experience and I hope the law and karma both catch up to him.  In the meantime, please take care of yourself in whatever ways best work for you personally.",
            "author": "PlugItWithaBeer",
            "id": "i1k7791",
            "parent_id": "t1_i1k1kz7",
            "score": 13,
            "created_utc": 1647886880.0,
            "replies": [
                {
                    "body": "thank you <3",
                    "author": "hadyenc",
                    "id": "i1k7aa4",
                    "parent_id": "t1_i1k7791",
                    "score": 3,
                    "created_utc": 1647886912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really wish more girls would read this forum. The risk is definitely not worth it",
            "author": "These-Buy-4143",
            "id": "i52n1vt",
            "parent_id": "t1_i52myb6",
            "score": 2,
            "created_utc": 1650197436.0,
            "replies": [
                {
                    "body": "it doesn’t help much. i had a lot of people private message saying it was my fault it happened, so lots of lovely people here i guess",
                    "author": "hadyenc",
                    "id": "i52o3gc",
                    "parent_id": "t1_i52n1vt",
                    "score": 1,
                    "created_utc": 1650198096.0,
                    "replies": [
                        {
                            "body": "Not for the people for the cautionary tales. Society is fucked when you focus on the raped rather than the rapist. But there’s avenues where probably of encountering a rapist is higher… this is one.. Hope you win and put this matter to close the best way you can",
                            "author": "These-Buy-4143",
                            "id": "i52oc2e",
                            "parent_id": "t1_i52o3gc",
                            "score": 2,
                            "created_utc": 1650198243.0,
                            "replies": [
                                {
                                    "body": "thank you, lots. and i agree",
                                    "author": "hadyenc",
                                    "id": "i52p1e1",
                                    "parent_id": "t1_i52oc2e",
                                    "score": 1,
                                    "created_utc": 1650198681.0,
                                    "replies": [
                                        {
                                            "body": "Thank yourself for fighting who am I but a stranger",
                                            "author": "These-Buy-4143",
                                            "id": "i5339aq",
                                            "parent_id": "t1_i52p1e1",
                                            "score": 2,
                                            "created_utc": 1650205998.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m very sorry. That is a twisted individual who gets off in hurting people like that. I’m\nProud that you pressed charges",
            "author": null,
            "id": "i1k29nt",
            "parent_id": "t1_i1k1m7e",
            "score": 2,
            "created_utc": 1647884985.0,
            "replies": []
        },
        {
            "body": "I am happy to help you search for an attorney and other resources like a victims rights advocate if you are interested. Please PM me if you need any support.",
            "author": "sea87",
            "id": "i1qkc3u",
            "parent_id": "t1_i1med8q",
            "score": 2,
            "created_utc": 1647997227.0,
            "replies": [
                {
                    "body": "I might end up doing that, thank you for offering",
                    "author": "hadyenc",
                    "id": "i1qlldm",
                    "parent_id": "t1_i1qkc3u",
                    "score": 2,
                    "created_utc": 1647997798.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dear God. I'm sorry, that was horrible. Fuck him for taking advantage of your kindness",
            "author": "Additional-Ability99",
            "id": "i1n7126",
            "parent_id": "t1_i1l7trp",
            "score": 3,
            "created_utc": 1647944344.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing your personal story.  \n\nIt must be tiresome to have to explain multiple times and mentally relive that horrible event. I stand by you and this will help others to keep a watch out for these signs. \n\nI wish all the best for you and justice is served.",
            "author": "femuserhere",
            "id": "i1l95ia",
            "parent_id": "t1_i1l7trp",
            "score": 2,
            "created_utc": 1647902446.0,
            "replies": []
        },
        {
            "body": "I have no intention of causing debates and uproar over this sensitive issue. I just wanted to know so i and maybe other can learn from her story and situation.",
            "author": "femuserhere",
            "id": "i1kzoth",
            "parent_id": "t1_i1kgdl5",
            "score": 3,
            "created_utc": 1647898449.0,
            "replies": []
        },
        {
            "body": "She is 100% correct in that the website CAN be held liable. I am in contact with a non-profit/ advocacy attorney who does this very thing and she allows the girls to stay 100% anonymous...and they can be entitled to monetary compensation through holding the website accountable. This has been done with other 'dating' websites as well.",
            "author": null,
            "id": "i1x70lg",
            "parent_id": "t1_i1ukbp7",
            "score": 2,
            "created_utc": 1648124509.0,
            "replies": []
        },
        {
            "body": "There's a number of issues. First, cutting the guy from the website. They can do that. Second, cooperation with LE. The site will have details allowing LE to contact the alleged rapist. Third, if the police interview the site, and they aren't cooperative,  or they've had previous reports and done nothing, then there are often possible cases of negligence to pursue.",
            "author": "Mangotingthroneway",
            "id": "i21wdsl",
            "parent_id": "t1_i1ukbp7",
            "score": 2,
            "created_utc": 1648207902.0,
            "replies": [
                {
                    "body": "Absolutely valid points. I am speaking in the past tense - referring to the \"their liability\" part.",
                    "author": "007selfdestruct",
                    "id": "i237xvk",
                    "parent_id": "t1_i21wdsl",
                    "score": 1,
                    "created_utc": 1648228813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thank you <3",
            "author": "hadyenc",
            "id": "i1k7aa4",
            "parent_id": "t1_i1k7791",
            "score": 3,
            "created_utc": 1647886912.0,
            "replies": []
        },
        {
            "body": "it doesn’t help much. i had a lot of people private message saying it was my fault it happened, so lots of lovely people here i guess",
            "author": "hadyenc",
            "id": "i52o3gc",
            "parent_id": "t1_i52n1vt",
            "score": 1,
            "created_utc": 1650198096.0,
            "replies": [
                {
                    "body": "Not for the people for the cautionary tales. Society is fucked when you focus on the raped rather than the rapist. But there’s avenues where probably of encountering a rapist is higher… this is one.. Hope you win and put this matter to close the best way you can",
                    "author": "These-Buy-4143",
                    "id": "i52oc2e",
                    "parent_id": "t1_i52o3gc",
                    "score": 2,
                    "created_utc": 1650198243.0,
                    "replies": [
                        {
                            "body": "thank you, lots. and i agree",
                            "author": "hadyenc",
                            "id": "i52p1e1",
                            "parent_id": "t1_i52oc2e",
                            "score": 1,
                            "created_utc": 1650198681.0,
                            "replies": [
                                {
                                    "body": "Thank yourself for fighting who am I but a stranger",
                                    "author": "These-Buy-4143",
                                    "id": "i5339aq",
                                    "parent_id": "t1_i52p1e1",
                                    "score": 2,
                                    "created_utc": 1650205998.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I might end up doing that, thank you for offering",
            "author": "hadyenc",
            "id": "i1qlldm",
            "parent_id": "t1_i1qkc3u",
            "score": 2,
            "created_utc": 1647997798.0,
            "replies": []
        },
        {
            "body": "Absolutely valid points. I am speaking in the past tense - referring to the \"their liability\" part.",
            "author": "007selfdestruct",
            "id": "i237xvk",
            "parent_id": "t1_i21wdsl",
            "score": 1,
            "created_utc": 1648228813.0,
            "replies": []
        },
        {
            "body": "Not for the people for the cautionary tales. Society is fucked when you focus on the raped rather than the rapist. But there’s avenues where probably of encountering a rapist is higher… this is one.. Hope you win and put this matter to close the best way you can",
            "author": "These-Buy-4143",
            "id": "i52oc2e",
            "parent_id": "t1_i52o3gc",
            "score": 2,
            "created_utc": 1650198243.0,
            "replies": [
                {
                    "body": "thank you, lots. and i agree",
                    "author": "hadyenc",
                    "id": "i52p1e1",
                    "parent_id": "t1_i52oc2e",
                    "score": 1,
                    "created_utc": 1650198681.0,
                    "replies": [
                        {
                            "body": "Thank yourself for fighting who am I but a stranger",
                            "author": "These-Buy-4143",
                            "id": "i5339aq",
                            "parent_id": "t1_i52p1e1",
                            "score": 2,
                            "created_utc": 1650205998.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "thank you, lots. and i agree",
            "author": "hadyenc",
            "id": "i52p1e1",
            "parent_id": "t1_i52oc2e",
            "score": 1,
            "created_utc": 1650198681.0,
            "replies": [
                {
                    "body": "Thank yourself for fighting who am I but a stranger",
                    "author": "These-Buy-4143",
                    "id": "i5339aq",
                    "parent_id": "t1_i52p1e1",
                    "score": 2,
                    "created_utc": 1650205998.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank yourself for fighting who am I but a stranger",
            "author": "These-Buy-4143",
            "id": "i5339aq",
            "parent_id": "t1_i52p1e1",
            "score": 2,
            "created_utc": 1650205998.0,
            "replies": []
        }
    ]
}