{
    "title": "Why I sugar or confessions of a not-so independent woman",
    "post_id": "iq42uo",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/iq42uo/why_i_sugar_or_confessions_of_a_notso_independent/",
    "author": "Layla_Fox2",
    "body": "Lately there have been many posts asking both babies and daddies why they sugar. I’ve been in and out of this beautiful bowl for over 20 years now. After a deep, emotional conversation with one of my closest friends yesterday, I finally have an answer. \n\nIt’s not the money. Yes it’s lovely and helps me live a more comfortable life but it’s never been my primary motivation. I didn’t *need* the money when I started sugaring and I certainly don’t *need* it at my age (41 in case you were wondering). \n\nI sugar because I love gentlemen. And the sugar world is one of the only places to find true gentlemen. Men that will open doors for women, bring flowers and presents just to see me smile, have intelligent conversations, and pick up the check. If you know me in any other aspect of my life, you’d never imagine that an independent girl like me would want that. But I do. I love the idea of having a man provide for me and take care of me. And that is not an easy thing for me to admit.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/iq42uo/why_i_sugar_or_confessions_of_a_notso_independent/",
    "score": 147,
    "upvote_ratio": 0.96,
    "created_utc": 1599747237.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I share your sentiments! And I was fortunate to have vanilla boyfriends who were like that as well. I am constantly in a battle with myself bc I'm an independent woman who doesn't need a man but also love the feeling of being taken care of.",
            "author": "macaroonqueen",
            "id": "g4oo19z",
            "parent_id": "t3_iq42uo",
            "score": 25,
            "created_utc": 1599748035.0,
            "replies": [
                {
                    "body": "You don't need it but you want it. That's the definition of independence. Cause, honey, I can open the door myself, sure, but you know what's wonderful? Having someone else open the door for you.... I always do it for other people. I'm ALWAYS doing stuff for other people. I'd just like it if someone would start doing stuff for me, that's all.",
                    "author": "iismelldaisiesii",
                    "id": "g4osu24",
                    "parent_id": "t1_g4oo19z",
                    "score": 26,
                    "created_utc": 1599749340.0,
                    "replies": [
                        {
                            "body": "I understand that feeling. I’m always doing for others as well. That may be why I desire someone to do that for me.",
                            "author": "Layla_Fox2",
                            "id": "g4p3i2e",
                            "parent_id": "t1_g4osu24",
                            "score": 10,
                            "created_utc": 1599752053.0,
                            "replies": []
                        },
                        {
                            "body": "Is it possible to pin this response to my bio or something? Cause you hit the nail on the head into the damn ground. I enjoy doing things for people but it sure does feel nice to have someone do something nice for you once and a while...",
                            "author": "mellenjs",
                            "id": "g4pvxy6",
                            "parent_id": "t1_g4osu24",
                            "score": 8,
                            "created_utc": 1599761242.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oooh lucky to have vanillas like that for sure!",
                    "author": "Layla_Fox2",
                    "id": "g4p37kt",
                    "parent_id": "t1_g4oo19z",
                    "score": 3,
                    "created_utc": 1599751966.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Saving this post so I remember how to treat my girlfriend. lol. And to add my 2 cents... Women in the sugar bowl are often better too. I’ve met the smartest, most confident, most sexually liberated, kindest and passionate women in the sugar bowl. Trying to vanilla date for the first 36 years of my life and then coming to the bowl was like a spiritual awakening.",
            "author": "orgnohpxf",
            "id": "g4s31m1",
            "parent_id": "t3_iq42uo",
            "score": 8,
            "created_utc": 1599788056.0,
            "replies": [
                {
                    "body": "“Generational” thing do you think? Meaning are women in mid-thirties really possessed of such different outlooks and dispositions regarding these issues than those ten and more years younger??",
                    "author": "jacknjilled",
                    "id": "g4sdia1",
                    "parent_id": "t1_g4s31m1",
                    "score": 5,
                    "created_utc": 1599793698.0,
                    "replies": [
                        {
                            "body": "I don’t necessarily think so. There was something about the “openness” of the women I met in the bowl. Of course I had a few fails, but so often they would meet me with equal excitement. It was like night and day. Definitely the fantasy life coming true.",
                            "author": "orgnohpxf",
                            "id": "g4se5nt",
                            "parent_id": "t1_g4sdia1",
                            "score": 4,
                            "created_utc": 1599794083.0,
                            "replies": [
                                {
                                    "body": "Well the women who are self-selecting for the bowl should be receptive to you after vetting, as the expectations/terms are so different from vanilla dating.",
                                    "author": "jacknjilled",
                                    "id": "g4sep7k",
                                    "parent_id": "t1_g4se5nt",
                                    "score": 6,
                                    "created_utc": 1599794408.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Perhaps it takes some life experience to realize that the world isn't kind.",
                            "author": "TY2022",
                            "id": "g4tlxmy",
                            "parent_id": "t1_g4sdia1",
                            "score": 2,
                            "created_utc": 1599831355.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4pzx4n",
            "parent_id": "t3_iq42uo",
            "score": 9,
            "created_utc": 1599762263.0,
            "replies": [
                {
                    "body": "I’m so happy to hear that you are finding caring gentlemen. It’s such a beautiful difference!",
                    "author": "Layla_Fox2",
                    "id": "g4t5nh3",
                    "parent_id": "t1_g4pzx4n",
                    "score": 1,
                    "created_utc": 1599818189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I find that perfectly reasonable. That is what an SR should be like. A good daddy cares. He looks out for, protects, and is respectful of his SB.  My SB'ss smile at some little gesture on my part makes me feel so good. It's the reason I sugar.",
            "author": "AFSMSgt",
            "id": "g4p3l55",
            "parent_id": "t3_iq42uo",
            "score": 13,
            "created_utc": 1599752082.0,
            "replies": [
                {
                    "body": "Yes a real daddy does care and it is so appreciated!!!!!",
                    "author": "Layla_Fox2",
                    "id": "g4p3v1f",
                    "parent_id": "t1_g4p3l55",
                    "score": 4,
                    "created_utc": 1599752179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What young woman wouldn’t want a fixer?  \n\nMy girls- Lost your sorority pin and need three hund, got it!  Crashed your car and need thousands, covered!  Need a Mega sponsor for the dance-a-thon.  Done!",
            "author": "MidwestAmMan",
            "id": "g4qhtxk",
            "parent_id": "t3_iq42uo",
            "score": 8,
            "created_utc": 1599767182.0,
            "replies": [
                {
                    "body": "I love white knights and men who love to fix things. My daddy did it, and I want that from a partner too. It's what makes me feel cherished and loved.",
                    "author": "clair-cummings",
                    "id": "g4tfaw9",
                    "parent_id": "t1_g4qhtxk",
                    "score": 3,
                    "created_utc": 1599827047.0,
                    "replies": [
                        {
                            "body": "It works well for me esp since I have little personality or interpersonal skills. She can find that stuff from her girls though.",
                            "author": "MidwestAmMan",
                            "id": "g4vptzk",
                            "parent_id": "t1_g4tfaw9",
                            "score": 1,
                            "created_utc": 1599868817.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That is a great point! Every woman should!",
                    "author": "Layla_Fox2",
                    "id": "g4t5ohg",
                    "parent_id": "t1_g4qhtxk",
                    "score": 1,
                    "created_utc": 1599818220.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes THIS. I left the bowl for about a year and had two short lived vanilla relationships. I’m only in my 20s but after being taken care of the way I was in my last SR it was hard to go back. I’m also very independent myself but I missed being with a man who would just pick up the check and not think about it. In one of my vanilla relationships I started picking up the whole check just to show him that we should do that for each other sometimes... it didn’t land. I can’t tell if my expectations are too high now but I miss being with a driven man who makes me feel good. The maturity and the living of our separate lives and not texting every second doesn’t have hidden meanings. The bowl is the only way I know how to meet the type of gentlemen you’re describing",
            "author": "alifitzbarker",
            "id": "g4rz67y",
            "parent_id": "t3_iq42uo",
            "score": 7,
            "created_utc": 1599785993.0,
            "replies": [
                {
                    "body": "A man or boy who allows me to go half (much less the whole check) is then friend zoned - forever and ever after that. Never let any date or boyfriend do that - Sugar or vanilla dating. If a man really cares and is generous, then he will man up and take you on dates where he ALWAYS pays. Money is different for men and them taking you on proper dates and spending money on you, is how you know if he really likes you (and is quality male). Tons of low value douches out there who put in little to no effort, while expecting you to pay. Avoid at ALL costs.",
                    "author": null,
                    "id": "g4sqd6u",
                    "parent_id": "t1_g4rz67y",
                    "score": 6,
                    "created_utc": 1599802616.0,
                    "replies": [
                        {
                            "body": "Absolutely. I could NEVER date a man like that it would be such a turnoff. A real man in my book Absolutely wants to protect and provide for his lady. \nA man that doesn't invest his resources is a man that really isn't in to you that much 🤷‍♀️",
                            "author": "clair-cummings",
                            "id": "g4tflmc",
                            "parent_id": "t1_g4sqd6u",
                            "score": 3,
                            "created_utc": 1599827260.0,
                            "replies": [
                                {
                                    "body": "Yes totally! :-)",
                                    "author": null,
                                    "id": "g5d5e66",
                                    "parent_id": "t1_g4tflmc",
                                    "score": 2,
                                    "created_utc": 1600184025.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m new to the bowl and I 100% relate. I don’t need anyone to take care of me but it’s an amazing feeling to have someone want to take that care and do things just to see you smile - hope to find it soon!",
            "author": "sunrae89",
            "id": "g4qn3w7",
            "parent_id": "t3_iq42uo",
            "score": 6,
            "created_utc": 1599768556.0,
            "replies": [
                {
                    "body": "You will find it. It just takes a little time.",
                    "author": "Layla_Fox2",
                    "id": "g4t5vry",
                    "parent_id": "t1_g4qn3w7",
                    "score": 3,
                    "created_utc": 1599818443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes!This is awesome. Thank you to the wonderful men who support us and help encourage our empowerment",
            "author": "MJline",
            "id": "g4slmg2",
            "parent_id": "t3_iq42uo",
            "score": 5,
            "created_utc": 1599798947.0,
            "replies": [
                {
                    "body": "Yes! Shoutout to all the real daddies out there!!!!!",
                    "author": "Layla_Fox2",
                    "id": "g4t6by8",
                    "parent_id": "t1_g4slmg2",
                    "score": 3,
                    "created_utc": 1599818931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The way I was raised, all the things you mention men doing, is what I was taught they are SUPPOSED to do normally.  It is insane to me that women go out with guys who do not open doors and do not bring them gifts and do not pick up the check for meals.",
            "author": "KeithMiles1977",
            "id": "g4t7hgy",
            "parent_id": "t3_iq42uo",
            "score": 3,
            "created_utc": 1599820168.0,
            "replies": [
                {
                    "body": "I agree! I don’t know when it became acceptable to NOT do all those things. This is why I’ve ALWAYS been into older men not just in the bowl.",
                    "author": "Layla_Fox2",
                    "id": "g4t8cc6",
                    "parent_id": "t1_g4t7hgy",
                    "score": 1,
                    "created_utc": 1599821054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love this.   I doubt that most people outside of a community like this would ever understand what we do.  Or why we do it.\n\nIn my case, I am actually enabling my SB to live in a different city, meaning we see each other less often.   She has dreams she wants to pursue there, and I want to see her happy.  Kind of at my own expense, but not really.  She could not afford to do this without me helping.  At least right now.   You have to dig deeper to understand what this does for me.\n\nI had no agenda when I decided to try and maintain a long distance arrangement. Just that I wanted to keep seeing her, and maximize her happiness.   But she now considers me one of the most important people in her life.  We communicate every day, and she confides in me whenever she needs help.  If she is down or lonely in the new city, we get on FaceTime and talk endlessly.   There is a deep friendship here and beyond.  The things she has told me about how she feels about me, might not be believable with our huge age gap.   Not even here.\n\nIt is not all one directional.   I have a travel partner that Covid has derailed to some degree, but that is temporary.  There are times when life gets the better of me, and she is ALWAYS there.   Sometimes virtually.   Sometimes in person.\n\nShe came back to visit yesterday, and the first person she saw was me.  We are going to spend the afternoon and evening together.   We never count hours, and she is always enthused about meeting.  If someone had told me a while a while back that I would end up in a relationship like this with a young twenty-something, crazy attractive woman, I would have asked them what they were smoking.  But here I am.  \n\nOnce again, loved your “confession”.",
            "author": "MrBuzzard",
            "id": "g4pk7y0",
            "parent_id": "t3_iq42uo",
            "score": 10,
            "created_utc": 1599757755.0,
            "replies": [
                {
                    "body": "I am so glad to hear that you are in such a wonderful relationship with your SB! And thank you for loving my confession 😊",
                    "author": "Layla_Fox2",
                    "id": "g4t5tjg",
                    "parent_id": "t1_g4pk7y0",
                    "score": 1,
                    "created_utc": 1599818375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yes. fucking thank you",
            "author": "ufoundlulu",
            "id": "g4rrc14",
            "parent_id": "t3_iq42uo",
            "score": 3,
            "created_utc": 1599781831.0,
            "replies": [
                {
                    "body": "You are welcome!",
                    "author": "Layla_Fox2",
                    "id": "g4t5w67",
                    "parent_id": "t1_g4rrc14",
                    "score": 1,
                    "created_utc": 1599818454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Glad to know that gents are rare and appreciated! Thank you for your post.",
            "author": "Haffbad",
            "id": "g4shht8",
            "parent_id": "t3_iq42uo",
            "score": 3,
            "created_utc": 1599796132.0,
            "replies": [
                {
                    "body": "Indeed you are becoming a rare breed which is such a shame. You are very much appreciated!",
                    "author": "Layla_Fox2",
                    "id": "g4t5zbv",
                    "parent_id": "t1_g4shht8",
                    "score": 2,
                    "created_utc": 1599818550.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4ow1d1",
            "parent_id": "t3_iq42uo",
            "score": 7,
            "created_utc": 1599750071.0,
            "replies": [
                {
                    "body": "That's why I'm in the sugar bowl. I love my partner but I'm the primary provider. I want to be spoiled by an older gentleman and treated like a queen.",
                    "author": null,
                    "id": "g4rnmcr",
                    "parent_id": "t1_g4ow1d1",
                    "score": 4,
                    "created_utc": 1599779978.0,
                    "replies": []
                },
                {
                    "body": "Ugh I had a vanilla that truly wanted a sugar mama and I was NOT into it",
                    "author": "Layla_Fox2",
                    "id": "g4p3b1j",
                    "parent_id": "t1_g4ow1d1",
                    "score": 5,
                    "created_utc": 1599751994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I somewhat understand that dynamic.  I had a SB that was married to a fairly high powered attorney that probably was on equal financial footing with me but he was a dick and he was kinda cheap.  They were living separate lives but keeping up appearances.  She sure didn’t need money but she also wasn’t the type to date bartender or personal trainer.  You needed a certain level of polish to turn her on.",
            "author": "LotBuilder",
            "id": "g4rnzsk",
            "parent_id": "t3_iq42uo",
            "score": 4,
            "created_utc": 1599780190.0,
            "replies": [
                {
                    "body": "I completely understand that dynamic. I was married to an attorney as well lol. I financially didn’t want for anything. But it didn’t last. We divorced after 7 years. The money was still there - I even had people tell me to stay because of the money - but everything else in the marriage was lacking. It takes more than just the money.",
                    "author": "Layla_Fox2",
                    "id": "g4t7rt1",
                    "parent_id": "t1_g4rnzsk",
                    "score": 3,
                    "created_utc": 1599820470.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone has put it into words! Yes! Im new to this but have always wanted to sugar because I want to meet a vanilla guy who is kind and would share intellectual conversations and treat me kind. I've just found those that want to overpower and it makes me feel bad. I am very independent and I try to prove it especially for my size. I am very prideful like that due to feeling like I have to make up for it. I want to be spoiled but by someone who knows its not because I need things done for me. How do you find vanilla men?",
            "author": "Im-assential",
            "id": "g4rck42",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599775071.0,
            "replies": []
        },
        {
            "body": "Yes! I feel this so much and it’s so hard to find in vanilla dating.",
            "author": "Aphrodisiatic922",
            "id": "g4rfzp7",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599776285.0,
            "replies": [
                {
                    "body": "High value men are more difficult to find but are out there. Sad we have to sometimes go to sugar dating to find men willing to be, well, real men. I blame the women, too for allowing their lazy behavior. We should all cut off the lazy low effort male's access to women, then he will either have to step up his efforts or go without a female in his orbit.",
                    "author": null,
                    "id": "g4sqt6b",
                    "parent_id": "t1_g4rfzp7",
                    "score": 3,
                    "created_utc": 1599802976.0,
                    "replies": [
                        {
                            "body": "I agree that women are partially to blame!",
                            "author": "Layla_Fox2",
                            "id": "g4t6asv",
                            "parent_id": "t1_g4sqt6b",
                            "score": 2,
                            "created_utc": 1599818898.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I feel like it’s become almost impossible to find in vanilla dating!",
                    "author": "Layla_Fox2",
                    "id": "g4t65vz",
                    "parent_id": "t1_g4rfzp7",
                    "score": 1,
                    "created_utc": 1599818749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wonderfully put!",
            "author": "ssaint_evil",
            "id": "g4rluq1",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599779006.0,
            "replies": [
                {
                    "body": "Thank you ☺️",
                    "author": "Layla_Fox2",
                    "id": "g4t6b4y",
                    "parent_id": "t1_g4rluq1",
                    "score": 1,
                    "created_utc": 1599818908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4sytj8",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599810493.0,
            "replies": [
                {
                    "body": "I am sure you will. It just takes time!",
                    "author": "Layla_Fox2",
                    "id": "g4t7sw6",
                    "parent_id": "t1_g4sytj8",
                    "score": 1,
                    "created_utc": 1599820500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love the idea of having a man provide for me and take care of me.\n\nInteresting. To what extent, if any, do you think these sentiments overlap with those of a fin dom? And how much of it that you view male expenditure as an expression of their affection or regard for you versus your appreciation for chivalric behavior?",
            "author": "Brashtard",
            "id": "g4pswc1",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599760433.0,
            "replies": [
                {
                    "body": "I’m not familiar enough with fin dom so I really cannot make a comparison. \n\nWhen I say I love the idea of a man providing for me and taking care of me, I’m not talking about just showering me in a bunch of money and presents. I love the idea of a man that is in a stable position. Solid career, owns his own house (and keeps it clean!), can go out to dinner without looking at cost of everything he orders, etc. \n\nSpending money alone does not translate into affection. I know plenty of men that buy their women everything you can imagine but emotionally treat their women horribly. It is the chivalry that shows the true affection and respect.",
                    "author": "Layla_Fox2",
                    "id": "g4t7fi8",
                    "parent_id": "t1_g4pswc1",
                    "score": 2,
                    "created_utc": 1599820110.0,
                    "replies": [
                        {
                            "body": "Thank you. I certainly can see the appeal of a chivalrous, successful man.\n\nI'm honestly not that familiar with fin dom either but it does seem that some SBs find the receipt of payment and gifts themselves to be a turn on.",
                            "author": "Brashtard",
                            "id": "g4trujk",
                            "parent_id": "t1_g4t7fi8",
                            "score": 2,
                            "created_utc": 1599834621.0,
                            "replies": [
                                {
                                    "body": "Yes that is true. For me the turn is far more complex than money and gifts. Money itself is not a turn on for me.",
                                    "author": "Layla_Fox2",
                                    "id": "g4tv0z8",
                                    "parent_id": "t1_g4trujk",
                                    "score": 2,
                                    "created_utc": 1599836261.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hear you! I love pleasing my woman, and it actually requires someone with a little self-insight to realize she loves that.",
            "author": "thothamon",
            "id": "g4ppm69",
            "parent_id": "t3_iq42uo",
            "score": 3,
            "created_utc": 1599759630.0,
            "replies": []
        },
        {
            "body": "And there goes my answer too..! About why I sugar..? \n\nConversations with my SD is like Brain food for me..! I couldn’t find that in guys of my age!",
            "author": "Want2bSB",
            "id": "g4pmyyk",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599758692.0,
            "replies": [
                {
                    "body": "I’ve always said that if you can’t stimulate my brain, you have no chance of stimulating my body. Smart is sexy.",
                    "author": "Layla_Fox2",
                    "id": "g4t7x5z",
                    "parent_id": "t1_g4pmyyk",
                    "score": 2,
                    "created_utc": 1599820622.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is one of the reasons I like the bowl too. I like doing that sort of stuff",
            "author": "BigBearSD",
            "id": "g4op5qw",
            "parent_id": "t3_iq42uo",
            "score": 1,
            "created_utc": 1599748359.0,
            "replies": [
                {
                    "body": "It’s very much appreciated!!!!!",
                    "author": "Layla_Fox2",
                    "id": "g4p3cjt",
                    "parent_id": "t1_g4op5qw",
                    "score": 1,
                    "created_utc": 1599752007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s no a single woman in the world that doesn’t enjoy being taken care of.  I don’t know any of woman who enjoys taking care of a man.",
            "author": "midwestsweetking",
            "id": "g4p533x",
            "parent_id": "t3_iq42uo",
            "score": 2,
            "created_utc": 1599752524.0,
            "replies": [
                {
                    "body": "Well service submissives. But I get your overall point.",
                    "author": "KnottySexAcct",
                    "id": "g4rhvf9",
                    "parent_id": "t1_g4p533x",
                    "score": 3,
                    "created_utc": 1599777127.0,
                    "replies": [
                        {
                            "body": "Yeh it’s weird.  I’m curious to know if some women disagree or are offended by my comment.  I guess I shouldn’t be speaking in absolutes though.  Just the vast majority",
                            "author": "midwestsweetking",
                            "id": "g4riaio",
                            "parent_id": "t1_g4rhvf9",
                            "score": 2,
                            "created_utc": 1599777325.0,
                            "replies": [
                                {
                                    "body": "I don’t disagree with the comment. But I would say that I enjoy taking care of a man - just in a different way than he takes care of me",
                                    "author": "Layla_Fox2",
                                    "id": "g4t819n",
                                    "parent_id": "t1_g4riaio",
                                    "score": 2,
                                    "created_utc": 1599820741.0,
                                    "replies": [
                                        {
                                            "body": "I can def agree to that.",
                                            "author": "midwestsweetking",
                                            "id": "g4u1rwo",
                                            "parent_id": "t1_g4t819n",
                                            "score": 2,
                                            "created_utc": 1599839596.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes this described why I want to get into this completely! Thank you for helping me find my words",
            "author": null,
            "id": "g4ppcze",
            "parent_id": "t3_iq42uo",
            "score": 1,
            "created_utc": 1599759543.0,
            "replies": [
                {
                    "body": "You’re welcome! I’m glad I finally found them myself!",
                    "author": "Layla_Fox2",
                    "id": "g4t833s",
                    "parent_id": "t1_g4ppcze",
                    "score": 1,
                    "created_utc": 1599820794.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g4oqkr2",
            "parent_id": "t3_iq42uo",
            "score": -2,
            "created_utc": 1599748743.0,
            "replies": [
                {
                    "body": "I'm your age and raised by a single mother. I was never taught by another man how to treat a woman. I was just told they are strong, independent and don't need no man. \n\nDating in my 20s was rough because I was so clueless.",
                    "author": "wasabiflavoredpeas",
                    "id": "g4pwcnc",
                    "parent_id": "t1_g4oqkr2",
                    "score": 6,
                    "created_utc": 1599761365.0,
                    "replies": []
                },
                {
                    "body": "Let’s think about this statement. Women wanting equality killed “good” men?",
                    "author": "alifitzbarker",
                    "id": "g4rzmp4",
                    "parent_id": "t1_g4oqkr2",
                    "score": 3,
                    "created_utc": 1599786240.0,
                    "replies": []
                },
                {
                    "body": "THIS",
                    "author": null,
                    "id": "g4pn59k",
                    "parent_id": "t1_g4oqkr2",
                    "score": 0,
                    "created_utc": 1599758764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You don't need it but you want it. That's the definition of independence. Cause, honey, I can open the door myself, sure, but you know what's wonderful? Having someone else open the door for you.... I always do it for other people. I'm ALWAYS doing stuff for other people. I'd just like it if someone would start doing stuff for me, that's all.",
            "author": "iismelldaisiesii",
            "id": "g4osu24",
            "parent_id": "t1_g4oo19z",
            "score": 26,
            "created_utc": 1599749340.0,
            "replies": [
                {
                    "body": "I understand that feeling. I’m always doing for others as well. That may be why I desire someone to do that for me.",
                    "author": "Layla_Fox2",
                    "id": "g4p3i2e",
                    "parent_id": "t1_g4osu24",
                    "score": 10,
                    "created_utc": 1599752053.0,
                    "replies": []
                },
                {
                    "body": "Is it possible to pin this response to my bio or something? Cause you hit the nail on the head into the damn ground. I enjoy doing things for people but it sure does feel nice to have someone do something nice for you once and a while...",
                    "author": "mellenjs",
                    "id": "g4pvxy6",
                    "parent_id": "t1_g4osu24",
                    "score": 8,
                    "created_utc": 1599761242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oooh lucky to have vanillas like that for sure!",
            "author": "Layla_Fox2",
            "id": "g4p37kt",
            "parent_id": "t1_g4oo19z",
            "score": 3,
            "created_utc": 1599751966.0,
            "replies": []
        },
        {
            "body": "“Generational” thing do you think? Meaning are women in mid-thirties really possessed of such different outlooks and dispositions regarding these issues than those ten and more years younger??",
            "author": "jacknjilled",
            "id": "g4sdia1",
            "parent_id": "t1_g4s31m1",
            "score": 5,
            "created_utc": 1599793698.0,
            "replies": [
                {
                    "body": "I don’t necessarily think so. There was something about the “openness” of the women I met in the bowl. Of course I had a few fails, but so often they would meet me with equal excitement. It was like night and day. Definitely the fantasy life coming true.",
                    "author": "orgnohpxf",
                    "id": "g4se5nt",
                    "parent_id": "t1_g4sdia1",
                    "score": 4,
                    "created_utc": 1599794083.0,
                    "replies": [
                        {
                            "body": "Well the women who are self-selecting for the bowl should be receptive to you after vetting, as the expectations/terms are so different from vanilla dating.",
                            "author": "jacknjilled",
                            "id": "g4sep7k",
                            "parent_id": "t1_g4se5nt",
                            "score": 6,
                            "created_utc": 1599794408.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Perhaps it takes some life experience to realize that the world isn't kind.",
                    "author": "TY2022",
                    "id": "g4tlxmy",
                    "parent_id": "t1_g4sdia1",
                    "score": 2,
                    "created_utc": 1599831355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so happy to hear that you are finding caring gentlemen. It’s such a beautiful difference!",
            "author": "Layla_Fox2",
            "id": "g4t5nh3",
            "parent_id": "t1_g4pzx4n",
            "score": 1,
            "created_utc": 1599818189.0,
            "replies": []
        },
        {
            "body": "Yes a real daddy does care and it is so appreciated!!!!!",
            "author": "Layla_Fox2",
            "id": "g4p3v1f",
            "parent_id": "t1_g4p3l55",
            "score": 4,
            "created_utc": 1599752179.0,
            "replies": []
        },
        {
            "body": "I love white knights and men who love to fix things. My daddy did it, and I want that from a partner too. It's what makes me feel cherished and loved.",
            "author": "clair-cummings",
            "id": "g4tfaw9",
            "parent_id": "t1_g4qhtxk",
            "score": 3,
            "created_utc": 1599827047.0,
            "replies": [
                {
                    "body": "It works well for me esp since I have little personality or interpersonal skills. She can find that stuff from her girls though.",
                    "author": "MidwestAmMan",
                    "id": "g4vptzk",
                    "parent_id": "t1_g4tfaw9",
                    "score": 1,
                    "created_utc": 1599868817.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is a great point! Every woman should!",
            "author": "Layla_Fox2",
            "id": "g4t5ohg",
            "parent_id": "t1_g4qhtxk",
            "score": 1,
            "created_utc": 1599818220.0,
            "replies": []
        },
        {
            "body": "A man or boy who allows me to go half (much less the whole check) is then friend zoned - forever and ever after that. Never let any date or boyfriend do that - Sugar or vanilla dating. If a man really cares and is generous, then he will man up and take you on dates where he ALWAYS pays. Money is different for men and them taking you on proper dates and spending money on you, is how you know if he really likes you (and is quality male). Tons of low value douches out there who put in little to no effort, while expecting you to pay. Avoid at ALL costs.",
            "author": null,
            "id": "g4sqd6u",
            "parent_id": "t1_g4rz67y",
            "score": 6,
            "created_utc": 1599802616.0,
            "replies": [
                {
                    "body": "Absolutely. I could NEVER date a man like that it would be such a turnoff. A real man in my book Absolutely wants to protect and provide for his lady. \nA man that doesn't invest his resources is a man that really isn't in to you that much 🤷‍♀️",
                    "author": "clair-cummings",
                    "id": "g4tflmc",
                    "parent_id": "t1_g4sqd6u",
                    "score": 3,
                    "created_utc": 1599827260.0,
                    "replies": [
                        {
                            "body": "Yes totally! :-)",
                            "author": null,
                            "id": "g5d5e66",
                            "parent_id": "t1_g4tflmc",
                            "score": 2,
                            "created_utc": 1600184025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You will find it. It just takes a little time.",
            "author": "Layla_Fox2",
            "id": "g4t5vry",
            "parent_id": "t1_g4qn3w7",
            "score": 3,
            "created_utc": 1599818443.0,
            "replies": []
        },
        {
            "body": "Yes! Shoutout to all the real daddies out there!!!!!",
            "author": "Layla_Fox2",
            "id": "g4t6by8",
            "parent_id": "t1_g4slmg2",
            "score": 3,
            "created_utc": 1599818931.0,
            "replies": []
        },
        {
            "body": "I agree! I don’t know when it became acceptable to NOT do all those things. This is why I’ve ALWAYS been into older men not just in the bowl.",
            "author": "Layla_Fox2",
            "id": "g4t8cc6",
            "parent_id": "t1_g4t7hgy",
            "score": 1,
            "created_utc": 1599821054.0,
            "replies": []
        },
        {
            "body": "I am so glad to hear that you are in such a wonderful relationship with your SB! And thank you for loving my confession 😊",
            "author": "Layla_Fox2",
            "id": "g4t5tjg",
            "parent_id": "t1_g4pk7y0",
            "score": 1,
            "created_utc": 1599818375.0,
            "replies": []
        },
        {
            "body": "You are welcome!",
            "author": "Layla_Fox2",
            "id": "g4t5w67",
            "parent_id": "t1_g4rrc14",
            "score": 1,
            "created_utc": 1599818454.0,
            "replies": []
        },
        {
            "body": "Indeed you are becoming a rare breed which is such a shame. You are very much appreciated!",
            "author": "Layla_Fox2",
            "id": "g4t5zbv",
            "parent_id": "t1_g4shht8",
            "score": 2,
            "created_utc": 1599818550.0,
            "replies": []
        },
        {
            "body": "That's why I'm in the sugar bowl. I love my partner but I'm the primary provider. I want to be spoiled by an older gentleman and treated like a queen.",
            "author": null,
            "id": "g4rnmcr",
            "parent_id": "t1_g4ow1d1",
            "score": 4,
            "created_utc": 1599779978.0,
            "replies": []
        },
        {
            "body": "Ugh I had a vanilla that truly wanted a sugar mama and I was NOT into it",
            "author": "Layla_Fox2",
            "id": "g4p3b1j",
            "parent_id": "t1_g4ow1d1",
            "score": 5,
            "created_utc": 1599751994.0,
            "replies": []
        },
        {
            "body": "I completely understand that dynamic. I was married to an attorney as well lol. I financially didn’t want for anything. But it didn’t last. We divorced after 7 years. The money was still there - I even had people tell me to stay because of the money - but everything else in the marriage was lacking. It takes more than just the money.",
            "author": "Layla_Fox2",
            "id": "g4t7rt1",
            "parent_id": "t1_g4rnzsk",
            "score": 3,
            "created_utc": 1599820470.0,
            "replies": []
        },
        {
            "body": "High value men are more difficult to find but are out there. Sad we have to sometimes go to sugar dating to find men willing to be, well, real men. I blame the women, too for allowing their lazy behavior. We should all cut off the lazy low effort male's access to women, then he will either have to step up his efforts or go without a female in his orbit.",
            "author": null,
            "id": "g4sqt6b",
            "parent_id": "t1_g4rfzp7",
            "score": 3,
            "created_utc": 1599802976.0,
            "replies": [
                {
                    "body": "I agree that women are partially to blame!",
                    "author": "Layla_Fox2",
                    "id": "g4t6asv",
                    "parent_id": "t1_g4sqt6b",
                    "score": 2,
                    "created_utc": 1599818898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel like it’s become almost impossible to find in vanilla dating!",
            "author": "Layla_Fox2",
            "id": "g4t65vz",
            "parent_id": "t1_g4rfzp7",
            "score": 1,
            "created_utc": 1599818749.0,
            "replies": []
        },
        {
            "body": "Thank you ☺️",
            "author": "Layla_Fox2",
            "id": "g4t6b4y",
            "parent_id": "t1_g4rluq1",
            "score": 1,
            "created_utc": 1599818908.0,
            "replies": []
        },
        {
            "body": "I am sure you will. It just takes time!",
            "author": "Layla_Fox2",
            "id": "g4t7sw6",
            "parent_id": "t1_g4sytj8",
            "score": 1,
            "created_utc": 1599820500.0,
            "replies": []
        },
        {
            "body": "I’m not familiar enough with fin dom so I really cannot make a comparison. \n\nWhen I say I love the idea of a man providing for me and taking care of me, I’m not talking about just showering me in a bunch of money and presents. I love the idea of a man that is in a stable position. Solid career, owns his own house (and keeps it clean!), can go out to dinner without looking at cost of everything he orders, etc. \n\nSpending money alone does not translate into affection. I know plenty of men that buy their women everything you can imagine but emotionally treat their women horribly. It is the chivalry that shows the true affection and respect.",
            "author": "Layla_Fox2",
            "id": "g4t7fi8",
            "parent_id": "t1_g4pswc1",
            "score": 2,
            "created_utc": 1599820110.0,
            "replies": [
                {
                    "body": "Thank you. I certainly can see the appeal of a chivalrous, successful man.\n\nI'm honestly not that familiar with fin dom either but it does seem that some SBs find the receipt of payment and gifts themselves to be a turn on.",
                    "author": "Brashtard",
                    "id": "g4trujk",
                    "parent_id": "t1_g4t7fi8",
                    "score": 2,
                    "created_utc": 1599834621.0,
                    "replies": [
                        {
                            "body": "Yes that is true. For me the turn is far more complex than money and gifts. Money itself is not a turn on for me.",
                            "author": "Layla_Fox2",
                            "id": "g4tv0z8",
                            "parent_id": "t1_g4trujk",
                            "score": 2,
                            "created_utc": 1599836261.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve always said that if you can’t stimulate my brain, you have no chance of stimulating my body. Smart is sexy.",
            "author": "Layla_Fox2",
            "id": "g4t7x5z",
            "parent_id": "t1_g4pmyyk",
            "score": 2,
            "created_utc": 1599820622.0,
            "replies": []
        },
        {
            "body": "It’s very much appreciated!!!!!",
            "author": "Layla_Fox2",
            "id": "g4p3cjt",
            "parent_id": "t1_g4op5qw",
            "score": 1,
            "created_utc": 1599752007.0,
            "replies": []
        },
        {
            "body": "Well service submissives. But I get your overall point.",
            "author": "KnottySexAcct",
            "id": "g4rhvf9",
            "parent_id": "t1_g4p533x",
            "score": 3,
            "created_utc": 1599777127.0,
            "replies": [
                {
                    "body": "Yeh it’s weird.  I’m curious to know if some women disagree or are offended by my comment.  I guess I shouldn’t be speaking in absolutes though.  Just the vast majority",
                    "author": "midwestsweetking",
                    "id": "g4riaio",
                    "parent_id": "t1_g4rhvf9",
                    "score": 2,
                    "created_utc": 1599777325.0,
                    "replies": [
                        {
                            "body": "I don’t disagree with the comment. But I would say that I enjoy taking care of a man - just in a different way than he takes care of me",
                            "author": "Layla_Fox2",
                            "id": "g4t819n",
                            "parent_id": "t1_g4riaio",
                            "score": 2,
                            "created_utc": 1599820741.0,
                            "replies": [
                                {
                                    "body": "I can def agree to that.",
                                    "author": "midwestsweetking",
                                    "id": "g4u1rwo",
                                    "parent_id": "t1_g4t819n",
                                    "score": 2,
                                    "created_utc": 1599839596.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re welcome! I’m glad I finally found them myself!",
            "author": "Layla_Fox2",
            "id": "g4t833s",
            "parent_id": "t1_g4ppcze",
            "score": 1,
            "created_utc": 1599820794.0,
            "replies": []
        },
        {
            "body": "I'm your age and raised by a single mother. I was never taught by another man how to treat a woman. I was just told they are strong, independent and don't need no man. \n\nDating in my 20s was rough because I was so clueless.",
            "author": "wasabiflavoredpeas",
            "id": "g4pwcnc",
            "parent_id": "t1_g4oqkr2",
            "score": 6,
            "created_utc": 1599761365.0,
            "replies": []
        },
        {
            "body": "Let’s think about this statement. Women wanting equality killed “good” men?",
            "author": "alifitzbarker",
            "id": "g4rzmp4",
            "parent_id": "t1_g4oqkr2",
            "score": 3,
            "created_utc": 1599786240.0,
            "replies": []
        },
        {
            "body": "THIS",
            "author": null,
            "id": "g4pn59k",
            "parent_id": "t1_g4oqkr2",
            "score": 0,
            "created_utc": 1599758764.0,
            "replies": []
        },
        {
            "body": "I understand that feeling. I’m always doing for others as well. That may be why I desire someone to do that for me.",
            "author": "Layla_Fox2",
            "id": "g4p3i2e",
            "parent_id": "t1_g4osu24",
            "score": 10,
            "created_utc": 1599752053.0,
            "replies": []
        },
        {
            "body": "Is it possible to pin this response to my bio or something? Cause you hit the nail on the head into the damn ground. I enjoy doing things for people but it sure does feel nice to have someone do something nice for you once and a while...",
            "author": "mellenjs",
            "id": "g4pvxy6",
            "parent_id": "t1_g4osu24",
            "score": 8,
            "created_utc": 1599761242.0,
            "replies": []
        },
        {
            "body": "I don’t necessarily think so. There was something about the “openness” of the women I met in the bowl. Of course I had a few fails, but so often they would meet me with equal excitement. It was like night and day. Definitely the fantasy life coming true.",
            "author": "orgnohpxf",
            "id": "g4se5nt",
            "parent_id": "t1_g4sdia1",
            "score": 4,
            "created_utc": 1599794083.0,
            "replies": [
                {
                    "body": "Well the women who are self-selecting for the bowl should be receptive to you after vetting, as the expectations/terms are so different from vanilla dating.",
                    "author": "jacknjilled",
                    "id": "g4sep7k",
                    "parent_id": "t1_g4se5nt",
                    "score": 6,
                    "created_utc": 1599794408.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perhaps it takes some life experience to realize that the world isn't kind.",
            "author": "TY2022",
            "id": "g4tlxmy",
            "parent_id": "t1_g4sdia1",
            "score": 2,
            "created_utc": 1599831355.0,
            "replies": []
        },
        {
            "body": "It works well for me esp since I have little personality or interpersonal skills. She can find that stuff from her girls though.",
            "author": "MidwestAmMan",
            "id": "g4vptzk",
            "parent_id": "t1_g4tfaw9",
            "score": 1,
            "created_utc": 1599868817.0,
            "replies": []
        },
        {
            "body": "Absolutely. I could NEVER date a man like that it would be such a turnoff. A real man in my book Absolutely wants to protect and provide for his lady. \nA man that doesn't invest his resources is a man that really isn't in to you that much 🤷‍♀️",
            "author": "clair-cummings",
            "id": "g4tflmc",
            "parent_id": "t1_g4sqd6u",
            "score": 3,
            "created_utc": 1599827260.0,
            "replies": [
                {
                    "body": "Yes totally! :-)",
                    "author": null,
                    "id": "g5d5e66",
                    "parent_id": "t1_g4tflmc",
                    "score": 2,
                    "created_utc": 1600184025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree that women are partially to blame!",
            "author": "Layla_Fox2",
            "id": "g4t6asv",
            "parent_id": "t1_g4sqt6b",
            "score": 2,
            "created_utc": 1599818898.0,
            "replies": []
        },
        {
            "body": "Thank you. I certainly can see the appeal of a chivalrous, successful man.\n\nI'm honestly not that familiar with fin dom either but it does seem that some SBs find the receipt of payment and gifts themselves to be a turn on.",
            "author": "Brashtard",
            "id": "g4trujk",
            "parent_id": "t1_g4t7fi8",
            "score": 2,
            "created_utc": 1599834621.0,
            "replies": [
                {
                    "body": "Yes that is true. For me the turn is far more complex than money and gifts. Money itself is not a turn on for me.",
                    "author": "Layla_Fox2",
                    "id": "g4tv0z8",
                    "parent_id": "t1_g4trujk",
                    "score": 2,
                    "created_utc": 1599836261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeh it’s weird.  I’m curious to know if some women disagree or are offended by my comment.  I guess I shouldn’t be speaking in absolutes though.  Just the vast majority",
            "author": "midwestsweetking",
            "id": "g4riaio",
            "parent_id": "t1_g4rhvf9",
            "score": 2,
            "created_utc": 1599777325.0,
            "replies": [
                {
                    "body": "I don’t disagree with the comment. But I would say that I enjoy taking care of a man - just in a different way than he takes care of me",
                    "author": "Layla_Fox2",
                    "id": "g4t819n",
                    "parent_id": "t1_g4riaio",
                    "score": 2,
                    "created_utc": 1599820741.0,
                    "replies": [
                        {
                            "body": "I can def agree to that.",
                            "author": "midwestsweetking",
                            "id": "g4u1rwo",
                            "parent_id": "t1_g4t819n",
                            "score": 2,
                            "created_utc": 1599839596.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well the women who are self-selecting for the bowl should be receptive to you after vetting, as the expectations/terms are so different from vanilla dating.",
            "author": "jacknjilled",
            "id": "g4sep7k",
            "parent_id": "t1_g4se5nt",
            "score": 6,
            "created_utc": 1599794408.0,
            "replies": []
        },
        {
            "body": "Yes totally! :-)",
            "author": null,
            "id": "g5d5e66",
            "parent_id": "t1_g4tflmc",
            "score": 2,
            "created_utc": 1600184025.0,
            "replies": []
        },
        {
            "body": "Yes that is true. For me the turn is far more complex than money and gifts. Money itself is not a turn on for me.",
            "author": "Layla_Fox2",
            "id": "g4tv0z8",
            "parent_id": "t1_g4trujk",
            "score": 2,
            "created_utc": 1599836261.0,
            "replies": []
        },
        {
            "body": "I don’t disagree with the comment. But I would say that I enjoy taking care of a man - just in a different way than he takes care of me",
            "author": "Layla_Fox2",
            "id": "g4t819n",
            "parent_id": "t1_g4riaio",
            "score": 2,
            "created_utc": 1599820741.0,
            "replies": [
                {
                    "body": "I can def agree to that.",
                    "author": "midwestsweetking",
                    "id": "g4u1rwo",
                    "parent_id": "t1_g4t819n",
                    "score": 2,
                    "created_utc": 1599839596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can def agree to that.",
            "author": "midwestsweetking",
            "id": "g4u1rwo",
            "parent_id": "t1_g4t819n",
            "score": 2,
            "created_utc": 1599839596.0,
            "replies": []
        }
    ]
}