{
    "title": "Just found out I’m dating a cop… I can’t tell If I’m over reacting or if this is even worth a reaction",
    "post_id": "mk9ytm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mk9ytm/just_found_out_im_dating_a_cop_i_cant_tell_if_im/",
    "author": "synclaireeebby",
    "body": "\\*\\*sorry in advance for length\n\n**Background info**:\n\nI’m 25 F he’s 40 M. I’m African American. He’s not. I’m from texas. He’s here for business. He found me on SA, met in December and have been together since\n\nThrough initial texting he mentioned starting as PPM and moving to an allowance as things grew which I was fine with. M&G went phenomenal, had a great time we clicked like we had known each other for years. Decided to hang out again the next day as well, had a great time once again. We never ended up talking numbers but i wasn’t pressed about it. I’m not in the bowl bc I need money. I just enjoy older men and use it to beef up my savings account.\n\nOver the last few months I’ve just adopted the role as a SGF. He’s gotten me plenty of gifts, paid to get my windshield fixed on my car, we’ve done overnight stay cations in the city, pays for my massages/facials/mani pedis, covered my travel expenses when I took a trip to Florida to visit friends, etc but also If I’ve had a shitty day he’s all ears. Love our dynamic.\n\nIn the very beginning He told me he’s been in the Army the last 22 years, switched from full active duty to reserves couple years ago. He was called down to texas for a project. While I cant confirm the project, I’ve seen his military ID and seen him in uniform every time I’ve stayed the night with him during the week so it checked out to me. Didn’t feel the need to question his profession more than that\n\n**STORY TIME**:\n\nThis weekend we were having one of our stay cations in the city, started Friday everything was going well per usual. Saturday after dinner he asked if I would ever date a cop.. Being African American the police are one of those touchy subjects I try to avoid so I changed the subject. This morning he bought it up again and said “hey so you never answered my question about dating a cop” And I just explained as a black girl it does make me uneasy, I know all cops aren’t bad but you dont know who’s for you or against you until its too late especially in the south. I would never actively pursue/entertain someone if i knew they were a cop ahead of time. He asked how my friends & family would react/would I tell them If I was. And I said that it would be flag for sure, whether its orange or red I dont know. They would show concern and I would be nervous to share. I Proceeded to ask why he kept pressing the subject.. That’s when he said “when I’m not in a green uniform I’m in a blue one” I just kinda sat there confused and said what do you mean. That’s when he told me that when he’s home and not called to be on duty when the army he’s a cop. Show’d me pictures of him in that uniform and the awards he’s won etc\n\nMy mood did a full 180, I couldn’t bring myself to look at him, didnt want to talk to him. I just told him I needed a minute and paced in the hallway. When I went back into the room he kept apologizing for not being upfront sooner. Told me he was enjoying our time and was unsure of how I would react.\n\nHe’s been so good to me for months, truly my favorite person I’ve ever dated. I’ve never had an off feeling about him, thought I hit the jack pot here But I CANNOT for the life of me shake this feeling. Not sure what the feeling is: am I upset, do I feel betrayed, am I now nervous, who knows. But I’m not sure what to do here. \n\nDo I just tell him I need space to process? Is this a deal breaker? Any advice on how to get over this emotional hesitation?\n\n**Special shout out to To my fellow African American SB’s out there, how would you feel?**",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mk9ytm/just_found_out_im_dating_a_cop_i_cant_tell_if_im/",
    "score": 177,
    "upvote_ratio": 0.9,
    "created_utc": 1617587297.0,
    "num_comments": 113,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Locking as this discussion reached peak productivity a while back. Happy Monday everyone!",
            "author": "SeattleLaserMeteor",
            "id": "gtgq0jz",
            "parent_id": "t3_mk9ytm",
            "score": 1,
            "created_utc": 1617637412.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfz5r6",
            "parent_id": "t3_mk9ytm",
            "score": 54,
            "created_utc": 1617622897.0,
            "replies": [
                {
                    "body": "Nah that’s not a “hint at a serious relationship” . Do you inform your family of your sugar relationships?",
                    "author": "emmdubb22",
                    "id": "gtg63mw",
                    "parent_id": "t1_gtfz5r6",
                    "score": 0,
                    "created_utc": 1617627396.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtgaxy7",
                            "parent_id": "t1_gtg63mw",
                            "score": 21,
                            "created_utc": 1617630095.0,
                            "replies": [
                                {
                                    "body": "Yes!!! Exactly! This is not a vanilla relationship nor did they meet on Hinge or some other traditional dating app. Dating a cop is a good start but *how* we met is even more importantly and under *what* premise.  My reaction would have been: No need to ignore the elephant in the room...we know how we met so why does it matter what my family would think? Would your family or friends see you differently if they knew the backstory on how we met? Would your employer see you differently?  \n\nSometimes it’s more than what’s said, it’s what’s not being said.",
                                    "author": null,
                                    "id": "gtgovun",
                                    "parent_id": "t1_gtgaxy7",
                                    "score": 7,
                                    "created_utc": 1617636904.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think the problem isn't *just* that he's  a cop, it's that he misled and lied to you for months. He knew that if he told you upfront you wouldn't have had anything to do with him, so instead he lied by omission until you were comfortable in the relationship,  and then dropped the bomb on you.\n\nI would take some time to really think things through, think about how the relationship has been, how you see it going if it was to continue, I would probably also find out what his stance is on things like police brutality etc or make a clean break and agree to not talk about his job at all unless it's about his military work.\n\nTake a couple of days to sleep on it and get your thoughts in order, it might even be worth speaking to a therapist or someone with training who can be a neutral 3rd party and help you work through your thoughts and feelings and make the best decision for you. On reddit you're going to get advice coloured by people's opinions and they may not understand the nuance of the situation.\n\nEdited to add a word.",
            "author": "Cats-and-Sunshine",
            "id": "gtfpe73",
            "parent_id": "t3_mk9ytm",
            "score": 67,
            "created_utc": 1617614549.0,
            "replies": [
                {
                    "body": "That’s exactly the problem. That group of professionals are very skilled liars and have almost a inarguably protected status by law. He lied for MONTHS, let her get comfortable in the relationship and then dropped this on her. \n\nI’m almost inclined to say start pulling away now. No telling how much personal info he can pull on her.",
                    "author": "emmdubb22",
                    "id": "gtg4j2s",
                    "parent_id": "t1_gtfpe73",
                    "score": 39,
                    "created_utc": 1617626449.0,
                    "replies": []
                },
                {
                    "body": "I’m reading all the comments and it seems everyone is so focused on money and his generosity yet ignore the fact that not only is he a cop but he lied about it for months...\n\nThat would be a HUGE red flag. If there’s nothing to worry about then why lie about your occupation? \n\n9 out of 10 times, where there’s one lie, there’s several. Between him being a cop and lying about it, there’s something more going on. This is why I mentioned in my post about trust and whether or not he will hold something against her.  \n\nHe’s already broken trust by lying when he should have just been honest and upfront so she can decide on her own how she wants to proceed. Gifts or no gifts I wouldn’t trust him.",
                    "author": null,
                    "id": "gtg1zst",
                    "parent_id": "t1_gtfpe73",
                    "score": 41,
                    "created_utc": 1617624848.0,
                    "replies": [
                        {
                            "body": "Exactly. It feels like this is just the tip of the iceberg and that he's trickle truthing her. What else is going to be revealed further down the line when she's even more invested in the relationship with the excuse that he wasn't sure how she'd react.",
                            "author": "Cats-and-Sunshine",
                            "id": "gtg2clm",
                            "parent_id": "t1_gtg1zst",
                            "score": 18,
                            "created_utc": 1617625075.0,
                            "replies": [
                                {
                                    "body": "I’ve never given merit to someone who justifies their actions and lack of forthcoming with “oh I didn’t know how you would respond”. It’s like a manipulative way of reversing accountability and shifting the issue onto the other person as if they’re (the person who was lied to) not the victim. \n\nPure manipulation, narcissism, and a way to control the situation.\n\nLike I said, ain’t no way I would mess with him. Like HAIL NO 😄",
                                    "author": null,
                                    "id": "gtg3vxy",
                                    "parent_id": "t1_gtg2clm",
                                    "score": 18,
                                    "created_utc": 1617626049.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "true on the lies, but it appears most people lie to one extent or another in the beginning of SR.  And yeah I was in situation where ex sgf lied to me / ommitted things etc and it is tough because you then go back and re question every interaction of the relationship.  I actually found out/caught her in lies but didnt let her know for a bit and even few hints hoping she would come clean with her lies and would have forgave.  But she didnt, she kept on lying.\n\n***However***, In this situation he did not get caught in the lie.  He appears to have gotten to point his feelings for her no longer make it possible to continue the lie.  And least he was man enough to get things out on table now (cant undo the past); despite knowing he would risk loosing her.",
                            "author": "Buckeyechamp21",
                            "id": "gtg4iyr",
                            "parent_id": "t1_gtg1zst",
                            "score": 0,
                            "created_utc": 1617626447.0,
                            "replies": [
                                {
                                    "body": "You must have missed where he asked her a generic question “would you date a cop”. He wasn’t forthcoming and if he was he wouldn’t have presented the truth in that way. He would have said “I’m a cop. How do you feel about dating me now that you know my real occupation”. He was still being misleading and trying to control the narrative.\n\nPeople need to stop making excuses for liars and manipulators at the expense of their own standards. He has issues so now she’s suppose to accept him and lower her standards to make him feel comfortable? NO.",
                                    "author": null,
                                    "id": "gtg4t32",
                                    "parent_id": "t1_gtg4iyr",
                                    "score": 14,
                                    "created_utc": 1617626619.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Seems like he didn’t tell her because he really liked her and he was worried she would STEREOTYPE him.\n\nCan you guess what she did?\n\n🤔🤔🤔🤔\n\nThis is such a stupid thread lol",
                            "author": "HotStool",
                            "id": "gtgku62",
                            "parent_id": "t1_gtg1zst",
                            "score": -10,
                            "created_utc": 1617635059.0,
                            "replies": [
                                {
                                    "body": "If I were a mod, I’d ban you. No further explanation needed.",
                                    "author": null,
                                    "id": "gtglcwy",
                                    "parent_id": "t1_gtgku62",
                                    "score": 8,
                                    "created_utc": 1617635307.0,
                                    "replies": [
                                        {
                                            "body": "I’m guessing they didn’t make you a mod because you would ban people who are against stereotyping of any kind.\n\nWhat a great stance you have. No further explanation needed.",
                                            "author": "HotStool",
                                            "id": "gtgovxh",
                                            "parent_id": "t1_gtglcwy",
                                            "score": -5,
                                            "created_utc": 1617636905.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This would be a hard NO for me. The cop-ness + the lying? No.",
            "author": "twocatsnoheart",
            "id": "gtgbh3d",
            "parent_id": "t3_mk9ytm",
            "score": 30,
            "created_utc": 1617630375.0,
            "replies": []
        },
        {
            "body": "This is such a huge red flag to me. So are all the white SDs in the comments basically saying brutality against BIPOC (and specifically Black people) isn’t real. \nHe lied to you about something very important and there is no telling how much more he will lie to you about. Not to mention if anything goes south you have a very unequal power dynamic going on and he is going to use that to his advantage. \nIf it were me I’d be done ASAP. I had to make a similar decision at the beginning of the pandemic when I was just starting to see a SD. Said he was a former cop but quit. Surprise surprise he still worked there, and I ended it before he was able to get a ton of personal info on me Bc I felt highly uncomfortable w the lies and the possibility of something bad happening to me if he didn’t get his way and his personality flipped a switch as a result",
            "author": "k_autumnal",
            "id": "gtgoz4z",
            "parent_id": "t3_mk9ytm",
            "score": 26,
            "created_utc": 1617636943.0,
            "replies": []
        },
        {
            "body": "I would say this: cops are questionable for any woman considering they have astronomical rates of DV against their own partners(romantic). To me, I’d be pissed he didn’t reveal this earlier. It feels manipulative and misleading. I personally hate feeling robbed of my own autonomy in decision-making. And unfortunately cops are famous for lying to people and become quite skilled at it. So....do what you will with that. And then, when you think of how the profession allows them political coverage to lie. Yikes. \n\nAlso, for me, I tend to avoid people who tend to have malleable ethics. \n\nI’d encourage you to tap into your identity as a woman first and foremost. What is your gut registering? Do you now feel unsafe? Do you feel lied to? \n\nOr:\n\nDo you not care really and still really like him? This is very okay and there is no reason to feel bad about this. Arguably having an “inside man” might be beneficial in the long run, Miss Nova ;) \n\n (Nova is a character from the show Queen Sugar, a Black woman and activist journalist who, *gasp* dates a cop)",
            "author": "emmdubb22",
            "id": "gtg3stn",
            "parent_id": "t3_mk9ytm",
            "score": 37,
            "created_utc": 1617625995.0,
            "replies": []
        },
        {
            "body": "Just want to say I feel for you. Sending you good thoughts no matter what you decide to do.",
            "author": null,
            "id": "gtfpzmx",
            "parent_id": "t3_mk9ytm",
            "score": 14,
            "created_utc": 1617615139.0,
            "replies": [
                {
                    "body": "thank you 💗",
                    "author": "synclaireeebby",
                    "id": "gtgm62q",
                    "parent_id": "t1_gtfpzmx",
                    "score": 7,
                    "created_utc": 1617635684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The fact you went in thinking it would be ppm and now he’s just paying for vanilla boyfriend things is a red flag. The fact he waited to tell you is definitely a red flag. I’d cut it off.",
            "author": "Job_Loud",
            "id": "gtg1t8p",
            "parent_id": "t3_mk9ytm",
            "score": 30,
            "created_utc": 1617624731.0,
            "replies": [
                {
                    "body": "This. How do you go from PPM to vanilla boyfriend? I know it seems like a better gig now but he started scamming from the get go it seems .",
                    "author": "emmdubb22",
                    "id": "gtg68o6",
                    "parent_id": "t1_gtg1t8p",
                    "score": 16,
                    "created_utc": 1617627482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Would just like to highlight the fact that when he asked the question he just said \"would you date a cop\" not \"would you date a *white* cop\" I had NO IDEA when I answered this would be relevant to him. \n\nMy answer was **in general** I'm not sure how I would feel about dating a cop. Yes I highlighted in my answer that you dont know who's for you or against you implying white cops because the majority of the cops in my area are white. *BUT* even if he wasn't I would be uneasy. Cops as a whole have stats on being abusive to women/their families. That is still not a place I would like to be in. Him being white just brought in another level of concern for me personally \n\nBeing a double minority (AA and a woman) is exhausting. So many extra precautions have to be taken to stay safe. Unless you fall into those categories you truly cant understand and I dont expect you to. I really made this post to talk to my fellow SB's and specifically POC. \n\nSeems like a stroke a nerve with a lot of you SD's on this post.. Might be time to do some reflecting. \n\nSure this is \"prejudice\" but I deal with prejudice daily and so does everyone else in the AA community. Its okay when we're judged off a stereotype but let it be the other way around and its an issue. *Make it make sense.*",
            "author": "synclaireeebby",
            "id": "gtfklib",
            "parent_id": "t3_mk9ytm",
            "score": 38,
            "created_utc": 1617609764.0,
            "replies": [
                {
                    "body": "You are totally right about this. I immediately understood your apprehension.",
                    "author": "emmdubb22",
                    "id": "gtg4tgi",
                    "parent_id": "t1_gtfklib",
                    "score": 14,
                    "created_utc": 1617626625.0,
                    "replies": []
                },
                {
                    "body": "It honestly is annoying when you specifically ask *POC women* to share their experience, white men will always try to wiggle their way in. \n\nLike mate nobody asked you, kindly step back and let people have their own space, without feeling the need to insert yourself into everything.",
                    "author": "NihilisticBuddhism",
                    "id": "gtfuvhj",
                    "parent_id": "t1_gtfklib",
                    "score": 31,
                    "created_utc": 1617619589.0,
                    "replies": [
                        {
                            "body": "Ummm history says they’ve been this way for decades on decades...Native Americans were the first victims to white people inserting themselves and taking over.\n\nIt’s the superiority complex.",
                            "author": null,
                            "id": "gtg3dhe",
                            "parent_id": "t1_gtfuvhj",
                            "score": 7,
                            "created_utc": 1617625724.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Based upon your feelings—this entire situation is not what a SR should be about. It should be happy, joyous and a breath of fresh air...unfortunately if you continue you will be suffocating because of feelings of contempt towards him based upon the reasons that compelled you to see advice or gather other perspectives.",
                    "author": null,
                    "id": "gtg36r6",
                    "parent_id": "t1_gtfklib",
                    "score": 5,
                    "created_utc": 1617625606.0,
                    "replies": [
                        {
                            "body": "Agreed that's exactly what it should be *and it was* up until this point. I need to figure out if my emotional reaction was shock or if that's something that is going to continue every time I'm in his presence",
                            "author": "synclaireeebby",
                            "id": "gtglw25",
                            "parent_id": "t1_gtg36r6",
                            "score": 7,
                            "created_utc": 1617635554.0,
                            "replies": [
                                {
                                    "body": "It sounds like you’re being very smart about it by meeting up with him again to gauge how you feel about all of this. It’s your world, continue to own it wisely as you have been. 🙂",
                                    "author": null,
                                    "id": "gtgmcv5",
                                    "parent_id": "t1_gtglw25",
                                    "score": 6,
                                    "created_utc": 1617635771.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you continue seeing this guy, you are allowed to set boundaries. Like if a case of police brutality shows up on the news, you can lay down a hard 'let's not debate/talk/mention you're a cop about this please' boundary. You can also institute a no shop talk rule since you've been able to have convos with him up to this point without bringing up the police thing anyway. \n\nI am not african american, but I do live in a country where cops treat my group as badly as they treat african americans so I can sympathize somewhat. I know if someone I was dating told me they were a cop, it would be hard for me personally to separate him from his job and what the police force as a whole continue to do especially since I hear about police brutality quite frequently. And I really don't like how the police excuse their fellow officers in committing these acts so I question their moral fiber.",
            "author": "iknowwhatiwantbroski",
            "id": "gtett2w",
            "parent_id": "t3_mk9ytm",
            "score": 49,
            "created_utc": 1617589421.0,
            "replies": []
        },
        {
            "body": "If he can lie/withhold info like that, what else will he lie about ? Your gut is telling you something for a reason, leave him sis.",
            "author": "qt4u2nv",
            "id": "gtfruc5",
            "parent_id": "t3_mk9ytm",
            "score": 14,
            "created_utc": 1617616925.0,
            "replies": []
        },
        {
            "body": "Why has he waited so long to mention this unless he knew this was going to be an issue. If this is something that makes you uncomfortable, you don't have to stand by it at all. Lying by omission is still lying.",
            "author": "daisyqueenofflowers",
            "id": "gtfdomi",
            "parent_id": "t3_mk9ytm",
            "score": 22,
            "created_utc": 1617603271.0,
            "replies": [
                {
                    "body": "From what I understood he waited so long because he was nervous to bring it up. Unsure how I would react, knowing how the majority of the AA community feels towards the profession. Do I understand where he's coming from? yes to an extent but it doesn't make me feel any less uneasy. I think some of what I am feeling is shock but I'm going to sleep on it a night or two then maybe do a lunch one day to talk this out. If I am still uncomfortable at that meet I may not be able to shake this and I'll unfortunately have to end it.",
                    "author": "synclaireeebby",
                    "id": "gtfhdlr",
                    "parent_id": "t1_gtfdomi",
                    "score": 16,
                    "created_utc": 1617606597.0,
                    "replies": [
                        {
                            "body": "That’s a cop out “didn’t want to bring it up bc of how AA feel towards the profession” \n\nNo, AA actually call BS on the profession and don’t have a mythical, romanticized image of the profession and are hyper aware of the actual nature of the profession. Also, we pay attention to all those well funded PR programs in the form of nightly television.",
                            "author": "emmdubb22",
                            "id": "gtg58ry",
                            "parent_id": "t1_gtfhdlr",
                            "score": 14,
                            "created_utc": 1617626882.0,
                            "replies": []
                        },
                        {
                            "body": "Of course, do what makes you comfortable above all. If he can't respect that then that'll be just another reason to end it.",
                            "author": "daisyqueenofflowers",
                            "id": "gtfhgsg",
                            "parent_id": "t1_gtfhdlr",
                            "score": 7,
                            "created_utc": 1617606682.0,
                            "replies": []
                        },
                        {
                            "body": "I think sleeping on it is a fantastic idea, when I’m faced with a big decision sometimes it doesn’t feel so big after a few days of rest. Also if you have a trusted friend (someone you trust to be impartial - not everyone has one of these) or better yet a counsellor or psychologist or something TOTALLY tell them - sometimes you just need someone to listen actively to your thought processes in order to clear things up in your head. \n\nEither way, best of luck with your decision, I hope you find the happiness and contentness you seek :-)",
                            "author": "iAmPizzaJohn",
                            "id": "gtfiwe9",
                            "parent_id": "t1_gtfhdlr",
                            "score": 4,
                            "created_utc": 1617608069.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess I’m the only one who is going to say go with your gut and respect your hesitation. First and foremost, will he later hold anything against you? Will there be tension when you discuss the issues we in the AA community have towards cops (specifically white cops). I get not all cops are “bad” but he’s not a black cop...so I think the hesitation you have is warranted.\n\nMaybe I’m the only one with this “unpopular opinion”, but you have doubt and fear for a real reason and I wouldn’t ignore that because 8 people on here said “it’s okay, he’s treating you fine”.",
            "author": null,
            "id": "gtf191i",
            "parent_id": "t3_mk9ytm",
            "score": 29,
            "created_utc": 1617593970.0,
            "replies": [
                {
                    "body": "Yeah it's up to the OP but personally this would hit too close to home. SRs are an escape for me, and this situation is way too loaded for me to really enjoy myself. Especially the part about possible retaliation. Sure we've heard of SDs threatening ex-SBs with lawyers or calling the police. But this guy actually has the power to follow up on that *outside the confines of the law*\n\nIf any other SD threatens you, you can call the cops on them. But if this guy threatens you, who do you turn to?",
                    "author": "iknowwhatiwantbroski",
                    "id": "gtf6jce",
                    "parent_id": "t1_gtf191i",
                    "score": 19,
                    "created_utc": 1617597545.0,
                    "replies": []
                },
                {
                    "body": "Completely agree with this!\n\nOP should definitely step back and take time to think things through. There’s a reason why she feels this way, and that needs to be addressed.",
                    "author": "NihilisticBuddhism",
                    "id": "gtfs7po",
                    "parent_id": "t1_gtf191i",
                    "score": 3,
                    "created_utc": 1617617263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Speaking as a Black woman, I understand your feelings. On dating apps, I admit that if someone mentioned they were a cop or had a picture in uniform I would probably pass. \n\nHowever, if I were dating someone and didn’t know they were a cop until later on, I would continue seeing them regardless. My brother is a cop and although I had thoughts about his career choice, I still respect him and his decision. Honestly, I respect the hell out of good cops because there seems to be too many shitty ones. Not worth leaving him over IMO.",
            "author": "samcrosb",
            "id": "gteu498",
            "parent_id": "t3_mk9ytm",
            "score": 26,
            "created_utc": 1617589603.0,
            "replies": [
                {
                    "body": "Yeah I think this seems like a really fair and balanced assessment. \n\nI listened to this podcast about how, in NYC especially, there was this huge drive to “increase police activity” but also decrease the number of crimes reported and charged for. On the outside this made it so that politicians could say “crime is going down” under their governance, when in reality it was just being underreported (this was SUPER bad - like rape victims were in many cases unable to convict their rapists!!). It also led to police being encouraged/forced by their superiors to arrest people who fitted the visual profile of someone who committed a crime in the area (this disproportionally targeted black people just chilling in public) and then let them go a couple hours later with no charges (this was the “increasing police presence” portion of the requirements) \n\nIt was so devastating to hear from a cop within this system who knew it was unjust but couldn’t change it. No politicians wanted to be the person under whom crime statistics increased, and the public at large wasn’t super aware. It ended up going to trial though. It was such a good listen I highly recommend it \n\n\n[Podcast part one](https://open.spotify.com/episode/7vPVmqFCFxBZJpStDAHl2n?si=KUffn2rWQaCL3t0-kIYosg) and [Podcast part 2 ](https://open.spotify.com/episode/02uhOqpfshGwQZVpYrQFJi?si=LnQ5GBChS-e67YeoA5VRvQ)\n\nEdit: this was a ramble but I think what I was getting at is that it’s totally fair to be wary of cops as a person of colour but also many cops are good people who are doing their best to continue being good people and good cops in a nonsensical and unfair system that disproportionately targets African Americans",
                    "author": "iAmPizzaJohn",
                    "id": "gtfimi8",
                    "parent_id": "t1_gteu498",
                    "score": 2,
                    "created_utc": 1617607798.0,
                    "replies": [
                        {
                            "body": "Sounds interesting and similar to what my city tried doing by increasing police activity. I’ll check out the podcasts, thanks!",
                            "author": "samcrosb",
                            "id": "gtgpknc",
                            "parent_id": "t1_gtfimi8",
                            "score": 2,
                            "created_utc": 1617637210.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Great reply and as always bad apples spoil a bunch. Im sure you and ypur brother could have some interesting conversations.",
                    "author": "bookworm010101",
                    "id": "gtft2of",
                    "parent_id": "t1_gteu498",
                    "score": 1,
                    "created_utc": 1617618029.0,
                    "replies": [
                        {
                            "body": "We’ve had a few conversations already but he lives in a different city than where we’re from. He shares some of his experiences with me though and I’m honestly proud of him.",
                            "author": "samcrosb",
                            "id": "gtgpz5g",
                            "parent_id": "t1_gtft2of",
                            "score": 1,
                            "created_utc": 1617637394.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not black but I do have a fair amount of hesitation w the police force (esp. considering their domestic abuse statistics) so yah definitely a red flag and definitely not cool of him to keep from you",
            "author": "alice414",
            "id": "gter9v9",
            "parent_id": "t3_mk9ytm",
            "score": 27,
            "created_utc": 1617587950.0,
            "replies": [
                {
                    "body": "Also would like to add the fact that he kept it from you for so long implies he knew it would be a problem 🤷🏻‍♀️",
                    "author": "alice414",
                    "id": "gterc9k",
                    "parent_id": "t1_gter9v9",
                    "score": 27,
                    "created_utc": 1617587987.0,
                    "replies": [
                        {
                            "body": "Exactly!",
                            "author": "Cats-and-Sunshine",
                            "id": "gtfpf28",
                            "parent_id": "t1_gterc9k",
                            "score": 5,
                            "created_utc": 1617614574.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gteral6",
            "parent_id": "t3_mk9ytm",
            "score": 52,
            "created_utc": 1617587961.0,
            "replies": [
                {
                    "body": "Cops aren't \"usually\" bad or \"stereotypically\" bad, theyre systemically bad. The dissoance is her relationship with someone active in a system thats perpetuating oppression.",
                    "author": "itsmevajrayogini",
                    "id": "gtes6zu",
                    "parent_id": "t1_gteral6",
                    "score": 58,
                    "created_utc": 1617588480.0,
                    "replies": [
                        {
                            "body": "has their been been improvement or is it worse then ever?\n\nPlease support with data.",
                            "author": "bookworm010101",
                            "id": "gtfsuie",
                            "parent_id": "t1_gtes6zu",
                            "score": 2,
                            "created_utc": 1617617836.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtex2pc",
                            "parent_id": "t1_gtes6zu",
                            "score": 0,
                            "created_utc": 1617591350.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtghjw4",
                                    "parent_id": "t1_gtex2pc",
                                    "score": 10,
                                    "created_utc": 1617633481.0,
                                    "replies": []
                                },
                                {
                                    "body": "It's pretty easy to imagine not having police who do actually policing, and are only a repressive force. This is the experience of some Asian American and black communities in the USA, for example, where the common sense is to never call the police or to expect support from them.",
                                    "author": "Distinct-Animal-9628",
                                    "id": "gtfpvo6",
                                    "parent_id": "t1_gtex2pc",
                                    "score": 20,
                                    "created_utc": 1617615030.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed! As a mixed (part AA SB) I totally get not wanting to date a cop. But if he hasn’t done anything *directly* to upset you relating to his job, maybe ask him to keep that part private? I don’t see any reason why the two of you couldn’t maintain a decent sugar relationship so long as you outline your boundaries (if you choose to have any) and he respects them. Good luck!",
                    "author": "curly_spice",
                    "id": "gtesjyv",
                    "parent_id": "t1_gteral6",
                    "score": 19,
                    "created_utc": 1617588687.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtetatv",
                            "parent_id": "t1_gtesjyv",
                            "score": -5,
                            "created_utc": 1617589124.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtg6c6u",
                                    "parent_id": "t1_gtetatv",
                                    "score": 20,
                                    "created_utc": 1617627540.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hey, for future reference its probably best not to make analogies where you're comparing the theoretical actions of an ethnic group vs. government employees who commit actual systemic abuse",
                                    "author": "paddyspubofficial",
                                    "id": "gtf9qws",
                                    "parent_id": "t1_gtetatv",
                                    "score": 29,
                                    "created_utc": 1617599997.0,
                                    "replies": [
                                        {
                                            "body": "I have no connection to law enforcement other than having spent a lot of time with them trying to improve part of a Pico Union neighborhood in LA  in the middle of a crack epidemic. The kind of neighborhood where the contractors pulled into the secure garage opened their toolboxes and the first \"tool\" out was a large caliber pistol, the utility workers put on flack vests before climbing poles.  The victims were the young and old of all races, white, black, hispanic and asian . We had LAPD off duty officers working security because without them we could not get people to come to the building. The alley behind the building was filled with large cardboard boxes where crack addicted young women , many under 16 lived while they were pimped out by the gangs - tell me about how drug crimes are victimless crimes. \n\nLaw enforcement is not perfect but it is the last chance for many neighborhoods. So much of what you see on TV is driven by politics.  There's no mention of the thousands of small businesses, often owned by minorities,  that have been destroyed in riots across the nation, the many cities where the police are the thin blue line between civility and tribal anarchy. \n\nPolitics drives much of what you see on TV. Take Ferguson, Obama attacked the officer , the police and virtually incited riots that took lives and destroyed property .  Yet one Friday night after reporters had left for the weekend Obama's DOJ released its official report  finding that   \"Hands Up Don't Shoot never happened, the officer only shot when the \"little boy\"  (6'4\" and 290 pounds) advanced again on the officer whom he had attacked and struggled to get the officer's gun. The report further admitted that many of the \"witnesses\" so beloved by CNN and other networks lied and a number admitted that they were not even at the scene.  But the lies scarred our society and a generation's views of the police were moulded through a deliberately false story.  \n\nIf you look at 20 years of records for the 10 million people living in Los Angeles County (LA Times murder report)  a black homicide was less likely to have had any police involvement than a white homicide. What does stand out is the vast disparity in murder rates between races, especially among males.  The briefest review of FBI national crime stats also shows a huge disparity between the murder rates.  Tragically a young black man is probably 6 times more likely to die a violent death than a white male of similar age.  Instead of using fabricated events to divide America (and members of the sugar communities) we should be seeking common ground through looking at reality and asking what needs to be done.",
                                            "author": "pinotandsugar",
                                            "id": "gtgyls0",
                                            "parent_id": "t1_gtf9qws",
                                            "score": -8,
                                            "created_utc": 1617641288.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtfq5ra",
                    "parent_id": "t1_gteral6",
                    "score": -8,
                    "created_utc": 1617615302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " I'm a wealthy white male. By societies rules and stereotypes, I should be a cop supporter. I hate the police. I despise them as violent arrogant pigs who do not realize that they work for the taxpayer, not their egos. I disliked my ex-brother - in-law, before my sister realized what a violent domineering egomaniac cop he was. This is a life long aversion (53), not just since Rodney King aversion. \n\nTo the OP, stay away. He'll be nice as long as you do as he says, when he says, and how he says. And he'll get mad at you anyway for violating some rule that he never told you about. It's in the psychological profile of those who choose to enter law enforcement. It's in the statistics of law enforcement perpetrators of crime.",
            "author": "docrolling",
            "id": "gtf5rak",
            "parent_id": "t3_mk9ytm",
            "score": 21,
            "created_utc": 1617596993.0,
            "replies": []
        },
        {
            "body": "NOOOOOOPE. I know I sound extra, but someone in the comments has to. Aside from the fact that he's a literal cop and could get away with anything (god forbid), he blatantly and intentionally LIED to you about it. Major red flag.\n\nI know it's hard finding out that someone you like is– well, I'll keep my language polite here– a cop, but you gotta stay true to yourself. <3",
            "author": "taylorsthighs",
            "id": "gtfmiqu",
            "parent_id": "t3_mk9ytm",
            "score": 12,
            "created_utc": 1617611678.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gteue80",
            "parent_id": "t3_mk9ytm",
            "score": 43,
            "created_utc": 1617589765.0,
            "replies": [
                {
                    "body": "So...you got out of a scummy business bc your morals didn't line up with it...  \nDo you not realize the irony in that statement? If this guy is ok staying w the police despite clearly knowing & seeing the corruption & awful things police do, what does that say about his character & morals?   \nNot to mention this man \\*lied to her\\* for months about his occupation, because he \\*knew\\* that OP's reaction to the revelation may be negative.   \nYou can absolutely judge people for certain occupations - people who stay cops are part of a corrupt system & support that corruption (willingly or not). OP is very much right to feel the way she does, not just bc of the cop part but bc she was lied to (and he's feeding into a stereotype which is cops are excellent manipulators & liars).",
                    "author": "weenieivy",
                    "id": "gtgorod",
                    "parent_id": "t1_gteue80",
                    "score": 13,
                    "created_utc": 1617636853.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtfku5b",
                    "parent_id": "t1_gteue80",
                    "score": -8,
                    "created_utc": 1617609998.0,
                    "replies": [
                        {
                            "body": "Wow another white guy speaking over BIPOC voices bc he just doesn’t think it could be that bad! Lmao what a joke.",
                            "author": "k_autumnal",
                            "id": "gtgoddq",
                            "parent_id": "t1_gtfku5b",
                            "score": 6,
                            "created_utc": 1617636679.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cops have  high rates of divorce and beating their wives. It usually goes either of 2 ways, someone is with a cop and everything is cherry. They are a normal person and the relationship is no better or worse than the next one. The problems usually occur when things don't work out. The very last person you want to be dating when things go south is a leo , especially in a sugar type of relationship where money has been exchanged. There is no right or wrong answer here, so far his actions have indicated he is a good person. Only time will tell if he continues to be that person or what you see on TV everyday.",
            "author": "throwaway6640",
            "id": "gtez0hw",
            "parent_id": "t3_mk9ytm",
            "score": 15,
            "created_utc": 1617592557.0,
            "replies": []
        },
        {
            "body": "I would be wary, tbh. Even if he's been nice so far, 4 months is still a relatively short time to know someone. What if things go sour? What if the relationship goes downhill? And the issue exists beyond just the two of you - what if a colleague of his commits a racially-motivated crime? The chances of him siding with his coworker is far higher than him siding with you.\n\nI've had SDs with incompatible beliefs from mine, but those were all relationships with a little bit of distance. You being a SPG makes it sound like this is turning into more of an actual relationship. If things go downhill, it'll be much harder for you to get out. There will be very few places in the city for you to escape to. The apprehension you're feeling is completely warranted, imo. It doesn't seem like an overreaction to me. I'm not black, but if I found out that someone I was dating was a cop? I would also be uncomfortable. Also I'm like... why did he wait four months to tell you? That seems like something you'd want to get out of the way first, BEFORE starting a relationship. I get that he might be apprehensive or whatever, but that's all the more reason to be upfront about this.\n\nThere's already an inherent imbalance in sugar relationships. I'm not saying you should break it off with, but anything that tilts the power balance even MORE towards the sd is definitely something to be wary of.",
            "author": "Tribonal",
            "id": "gtfqh9g",
            "parent_id": "t3_mk9ytm",
            "score": 4,
            "created_utc": 1617615616.0,
            "replies": []
        },
        {
            "body": "first and foremost, your feelings are 100% VALID. Scrolling through this has been a bit disturbing as people are trying to invalidate your feelings or belittle them by repeating that “not all cops are bad”. You’ve already mentioned that you think not all cops are bad and yet that hasn’t been enough to get over the fact that he’s a cop.\n\nI’m a POC but I’m not African American, so therefore I will NEVER be able to understand what the AA community is going through in regards to police brutality, and it’s all simply because I’m not AA. If you’re not AA, then what makes you think that you can tell someone who has had to witness the brutal murders of the people of their community in the hands of police officers to not be anxious around the police? With that being said, the amount of people on here who are trying to create “metaphors” based on your issue as if to reduce it down to something smaller is astounding. You’ve had to watch news reports of hate crimes committed by police officers to the people of your community. African Americans have been killed by the police and it has drastically affected you and your community, so, yes, your feelings are valid. The fact that some people think that you don’t have the right to feel even a bit wary is astounding. My best friend is AA and the murder of George Floyd affected her greatly. And I listened to her voice her anger and fear towards cops and never did I think to belittle her concerns. \n\nSo, yeah, my biggest advice here is to embrace your feelings. They exist for a reason. If you want to keep pursuing a relationship with him, then communication is key. As a 19 year old, it’s disappointing to see that there’s full grown adults telling you to ignore it/brush it under the rug and just jump back to how things used to be without addressing this with him. Then again, if you don’t feel comfortable around him anymore, then can things really go back to how they used to be? It’s a sensitive topic, obviously. Getting back together with him and ignoring this big elephant in the room will only lead to it toppling over you both to completely suffocate you under its weight. \n\nIf you decide to continue seeing him, I think that the best thing you can do is meet up some place where YOU feel comfortable and safe and talk it out. Whenever I’m overwhelmed with a problem, I take a blank sheet of paper and just start writing down absolutely anything that comes to mind. It doesn’t have to be perfect but I just like getting it all out of my head and on the paper. The paper’s all messy by the end and yet it doesn’t stop it from giving me an outlet to start connecting things and to form a goal that I want to accomplish and hopefully solve my dilema. Ranting out loud in front of a mirror helps too lol. Get angry. Get sad. It’s a process but taking the first step by doing something small like this can be incredibly relieving and lead to the answer that you’re seeking. I don’t know if you’ve watched Orange is the New Black but the theme song quotes something along the lines of “taking steps is easy, standing still is hard.” \n\nPoint is, get to understand your feelings and what you want to say to him IF you decide to talk to him again. You have to know where you stand first before you decide where he stands in your life. \n\nI wish you the best of luck, honestly! Don’t let anyone make you feel bad for having these doubts. Your feelings are 100% valid.",
            "author": "HoneyBunnyBerry",
            "id": "gtfes0s",
            "parent_id": "t3_mk9ytm",
            "score": 14,
            "created_utc": 1617604221.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtf6z21",
            "parent_id": "t3_mk9ytm",
            "score": 18,
            "created_utc": 1617597866.0,
            "replies": [
                {
                    "body": "It's funny because the fact that people responded to your post thinking it was fake just further proves your point. They are that fucking oblivious to the realities you mentioned when it comes to Cops and POC",
                    "author": "eerriinn_",
                    "id": "gtfjj9c",
                    "parent_id": "t1_gtf6z21",
                    "score": 18,
                    "created_utc": 1617608703.0,
                    "replies": []
                },
                {
                    "body": "I’m not sure if your being sarcastic or this is real - I’m leaning towards sarcasm Bc of the generalizations. \n\nI honestly feel things in America gets exxagerated Bc it’s America.\n\nIf I was a new immigrant coming to America I’d think it was 1939 where a certain race was being target and lynched. Or even that the country is more racist than 50 years ago or that cops are killing black people all the time. But The numbers say something different it’s decreased since it spiked during Obama years and actually the lowest since data was kept during trumps presidency. Not saying that’s ok or deaths of Taylor, Floyd etc I’m just speaking on coverage and positioning by the media..\n\nOr maybe I’m desentesized bc i come from country where police kills three times more (total amount)  people than the United States while only having a third of Americas population with .01 percent of the global coverage of the blacks that get killed in america.",
                    "author": "Former_Baseball8679",
                    "id": "gtfbtps",
                    "parent_id": "t1_gtf6z21",
                    "score": -9,
                    "created_utc": 1617601682.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtfd4bk",
                            "parent_id": "t1_gtfbtps",
                            "score": 9,
                            "created_utc": 1617602773.0,
                            "replies": [
                                {
                                    "body": "I’m from the Philippines.\n\nFBI statistics is my source for police involved homicides in the us by race.  And then i used third grade math and figured out who the president was during the years it was high and who president was during the years it was lower\n\nAs far as the amount of coverage, I don’t have a source. but We both know the coverage spiked during election year while killings did not.\n\nNot trying to argue or debate with you. \n\nYour entitled to your feelings and to debate you (or anyone else) on your feelings is like trying to debate my wife on whether or not she had an orgasm.",
                                    "author": "Former_Baseball8679",
                                    "id": "gtfdkg1",
                                    "parent_id": "t1_gtfd4bk",
                                    "score": -6,
                                    "created_utc": 1617603167.0,
                                    "replies": [
                                        {
                                            "body": "Bruh don't bring the Philippines down like that :/\n\nBeing desensitized does not entitle you to invalidate or belittle other people's experiences with oppression. Sure, america may be a haven to you compared to what you went through here, but don't look down on the very real injustices the AA community continue to face there.",
                                            "author": "iknowwhatiwantbroski",
                                            "id": "gtfh2fu",
                                            "parent_id": "t1_gtfdkg1",
                                            "score": 15,
                                            "created_utc": 1617606296.0,
                                            "replies": [
                                                {
                                                    "body": "I never thought of it in that way and your commentary made me stop and think👍",
                                                    "author": "Former_Baseball8679",
                                                    "id": "gtfh9sl",
                                                    "parent_id": "t1_gtfh2fu",
                                                    "score": 5,
                                                    "created_utc": 1617606493.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fuck 12",
            "author": "complexFLIPPER",
            "id": "gtgeukx",
            "parent_id": "t3_mk9ytm",
            "score": 2,
            "created_utc": 1617632127.0,
            "replies": []
        },
        {
            "body": "I'm a person of color. Solidly in the ACAB camp. Like been physically injured while handcuffed by groups of different law enforcement agencies on different occasions while all the \"good cops\" stood idly by and watched or participated. I watch shit like Fruitvale Station or The Hate U Give and have extremely visceral reactions. \n\nAll of that said, if I met a woman SB who happened to be a cop I wouldn't let her job stop me from pursuing. Maybe that's hypocritical. But I wouldn't feel like I was the apostate in that scenario. I would feel like I was the one proselytizing. I would be the one opening her eyes if we decided to pursue a relationship. And I would be fulfilling my moral obligation by doing so, not jettisoning my beliefs.",
            "author": "OpenAirMarket901",
            "id": "gtf54yi",
            "parent_id": "t3_mk9ytm",
            "score": 1,
            "created_utc": 1617596564.0,
            "replies": []
        },
        {
            "body": "I feel you. That’s messed up.",
            "author": "vagatarian",
            "id": "gtf6f54",
            "parent_id": "t3_mk9ytm",
            "score": 2,
            "created_utc": 1617597461.0,
            "replies": []
        },
        {
            "body": "I can understand and empathize with your confusion. I think with any person, you should judge them by the content of their character, first and foremost. One one hand, there are monstrous assholes like Derek Chauvin, but on the other my aunt is a retired cop who has done immense good in the world. She's one of the most open hearted, open minded, truly good people in the world. She has adopted children who are black, she is white, some had very special needs and she took them in. I know all the bad stereotypes about cops, and have run into many who unfortunately fit the bill. But I also know there are individuals in that profession who got into it for the right reasons and didn't get corrupted or cynical. I can't tell you what to do in your situation, only you can decide based on the character of this guy and the vibe you have together, but I can say it's not cut and dried, and cop does not equal KKK.",
            "author": "Cledaddy23",
            "id": "gtetfqt",
            "parent_id": "t3_mk9ytm",
            "score": 2,
            "created_utc": 1617589204.0,
            "replies": []
        },
        {
            "body": "So he has been treating you well. What's the big problem that he is a cop? Most cops are decent people. There are some bad apples but not all are.",
            "author": "BigBearSD",
            "id": "gteraia",
            "parent_id": "t3_mk9ytm",
            "score": -6,
            "created_utc": 1617587959.0,
            "replies": [
                {
                    "body": "Like I said in my post, I know not all cops are bad and he's given me no real reasons not to trust the character he's shown me but there's an emotional hesitation/feeling out of my control I'm struggling to shake right now. \n\nIf I cant bring myself to shake that off I know its going to be me that ruins the dynamic we have.",
                    "author": "synclaireeebby",
                    "id": "gtesu1q",
                    "parent_id": "t1_gteraia",
                    "score": 21,
                    "created_utc": 1617588851.0,
                    "replies": []
                },
                {
                    "body": "That's your personal experience. Not everyone has that experience. He's obviously ashamed of something otherwise he wouldn't have hid it for 4 months.",
                    "author": "throwaway6640",
                    "id": "gtf1xn4",
                    "parent_id": "t1_gteraia",
                    "score": 14,
                    "created_utc": 1617594419.0,
                    "replies": [
                        {
                            "body": "Or he was just keeping private till he got to know her better. She could probably look him up if she knew his profession and he wasn’t ready to share.",
                            "author": null,
                            "id": "gtfbcwf",
                            "parent_id": "t1_gtf1xn4",
                            "score": 0,
                            "created_utc": 1617601296.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtfdw58",
                                    "parent_id": "t1_gtfbcwf",
                                    "score": 12,
                                    "created_utc": 1617603453.0,
                                    "replies": [
                                        {
                                            "body": "I think this is a hard one. In 4 months if he had that controlling abusive personality she would have seen it by now. If there’s nothing bad in his behavior then maybe his profession shouldn’t define him. This also means he is getting serious feelings for her...don’t a lot of SDs and SBs not even use their real names for many months?",
                                            "author": null,
                                            "id": "gtfeg9b",
                                            "parent_id": "t1_gtfdw58",
                                            "score": -5,
                                            "created_utc": 1617603930.0,
                                            "replies": [
                                                {
                                                    "body": "On that same token couldn't he have seen she was a normal young woman and posed no threat to his career by month 2?  I also don't think there are any confirmed stories of young sbs trying to mess with cops in the first place where there is a huge power imbalance to begin with.  I'm not saying she should or shouldn't be with him. All I'm saying if things go south, the last person you'll want to be involved with is a cop, vanilla or otherwise.",
                                                    "author": "throwaway6640",
                                                    "id": "gtfhw6f",
                                                    "parent_id": "t1_gtfeg9b",
                                                    "score": 14,
                                                    "created_utc": 1617607089.0,
                                                    "replies": [
                                                        {
                                                            "body": "I agree with this.",
                                                            "author": null,
                                                            "id": "gtfmkgn",
                                                            "parent_id": "t1_gtfhw6f",
                                                            "score": 1,
                                                            "created_utc": 1617611725.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Why do you assume that by 4 months you know someone’s character? One of the most common refrains for people in abusive relationships is that the beginning is SO GOOD. Often abuse doesn’t start until the honeymoon period is over. Or until the woman is pregnant. Or tries to leave. I’m not necessarily talking about OP’s situation, but your basic premise is patently false- and a bit victim blame-y.",
                                                    "author": "fashlatebloomer",
                                                    "id": "gtfhpfv",
                                                    "parent_id": "t1_gtfeg9b",
                                                    "score": 9,
                                                    "created_utc": 1617606912.0,
                                                    "replies": [
                                                        {
                                                            "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
                                                            "author": null,
                                                            "id": "gtfmif5",
                                                            "parent_id": "t1_gtfhpfv",
                                                            "score": -2,
                                                            "created_utc": 1617611668.0,
                                                            "replies": [
                                                                {
                                                                    "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                                                                    "author": "fashlatebloomer",
                                                                    "id": "gtfmvxy",
                                                                    "parent_id": "t1_gtfmif5",
                                                                    "score": 7,
                                                                    "created_utc": 1617612045.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                                                                            "author": null,
                                                                            "id": "gtfnaop",
                                                                            "parent_id": "t1_gtfmvxy",
                                                                            "score": 2,
                                                                            "created_utc": 1617612457.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have the right for head space for this to marinate and process.  Only you can say whether it is a deal breaker.  I absolutely understand the hesitation.  Ask for some time to process and let him know you will check in a week or a couple of days.  Given how much you have been communicating a week vs a couple of days may seem like an eternity so just pick a time frame and update but continue to need space if you do need it.  \n\nOnce you settle down decide if it's a deal breaker sounds like a pretty good guy and SD.  You now know him I would try and weigh how much of him and who he is as an individual may outweigh if that makes sense one of his chosen professions.  Good Luck",
            "author": "KittenReigns",
            "id": "gtezhcz",
            "parent_id": "t3_mk9ytm",
            "score": 1,
            "created_utc": 1617592845.0,
            "replies": []
        },
        {
            "body": "I completey understand how you feel, and where you're coming from. \n\n&#x200B;\n\nI do think that there is some cognitive dissonance going on. You met a person you clicked with and thought was wonderful. THEN you found out he was a cop - \"cop\" being a title you have A LOT of associations, feelings, opinions tied to, and all or mostly bad. \n\nIt's like finding out your sweet best friend, your wonderful sibling, your amazing parents are the serial killer you keep hearing about on the news. You can't reconcile the person you know (or thought you knew) with this new information you're getting. You have one reality: my best friend. And then you're hit with another reality: a serial killer. And these two realities seem to inhabit the same person. How can you reconcile that?\n\nI think that in this case, IF you want to continue seeing him, you have to remind yourself that despite all the horrible things that cops CAN do, their sole function isn't to oppress people, especially minorities. Yes, unfortunately, many cops exploit their power, twist it, and use it for bad purposes. But a bad cop is a BAD HUMAN BEING who is exploiting his position of being a cop. Just the position itself does not make a person a violent racist/bigot. The person already has to be bigoted, filled with anger and hate, and have violent tendencies, and THEN when that person gets into the position of cop, he exploits that position to oppress others. What I am trying to get at is that not all cops are bad people, but all of the bad cops are bad people. There are good cops - of all races and genders. The systemic racism goes way above cops. Cops don't write the laws, cops didn't put into law the 1994 crime bill which is the crime laws we have now that disproportionately target minorities for silly violations and expanded the prison and prison-labor system. Of course, racist cops benefit from the system. But there are good cops - people who truly want to serve their communities. \n\nSo just because your SD is a cop, doesn't mean he's a bad person. And it sounds like he's a good person and you have had a wonderful relationship up till now. Of course, if him being a cop bothers you, you are under no obligation to try to \"get over it\" and continue seeing him. You don't have to force yourself to swallow something that is a very touchy subject for you. At the end of the day, it comes down 100% to how you feel - regardless of whether others tell you your feelings are valid or not. If you don't want to be with someone, you don't want to be with them.\n\nHe did lie by omission to you about being a cop, but in SR I feel like lying is kind of par for the course, and is in some ways part of the deal. Only you can decide if this is a lie that was \"part of the sugar relationship deal\" or something more significant to you. \n\nOne thing that I'm a little puzzled by is the fact that you're ok with him being in the military, but not with him being a cop. If cops are an extension of systematic racism, soldiers are even more so. Soldiers, even more so than cops, are part of the \"system\" that we have established is racist and violent. But we as Americans don't really come in contact with the military, because the military tends to do its considerable oppression (including committing crimes against humanity and breaking international war laws) overseas, so I guess it's easy to feel \"ok\" about the military because **we** haven't personally felt (someone else has, in a place far, far away) the brunt of their violence, racism, and misogyny - and the media doesn't report on it. The US military has waged many questionable operations, destabilizing entire regions, wreaking havoc in them and for the native populations, instating US-backed dictators, arming rebels, then fighting those dictators and rebels when the latter turned against US interests, waging regime-change wars for decades, etc. Yeah, you can argue the US had to do that for the good of the US, but the fact remains our military has an enormous amount of blood on its hands. Of course, the US military has done some good, but it certainly is part of systemic oppression. And of course, not all soldiers are bad. Not all soldiers torture, rape (men, women, and children), and kill civilians of other countries while calling them the most horrible racist names. Not all male soldiers rape female military members (rates of rape in the military are astronomical), not all soldiers are homophobic (despite homophobia being systematized in the military). \n\nFrom the little I know of your SD, he seems like a nice man, despite being both a soldier and a cop. But it doesn't matter how \"nice\" or how much of a \"good person\" he is - all that matters is how YOU feel. Relationships aren't jobs - they're based on how you feel. You don't have to rationalize or explain to anyone why you do or don't want to be with someone. I mean, if you decide you can't be with this SD, I do think it would be common courtesy to let him know that you just can't get past his profession. But you don't have to go into long conversations with him, or anyone else about it. You don't owe anyone else an explanation. Ultimately, you have to go with your heart and your gut.",
            "author": null,
            "id": "gtgh1jl",
            "parent_id": "t3_mk9ytm",
            "score": 1,
            "created_utc": 1617633232.0,
            "replies": [
                {
                    "body": "Thank you for your input, I've replied this a couple times to the thread that I am not okay with him being in the military that was already something I've had to come to grips in this SR. Him being a cop on top of that was kinda a double whammy here. \n\nI know Lying is part of the SR, I did the first 2.5months about my name and a good amount of other info so I respect the privacy I just wish he would've told me sooner I guess before I was this emotionally invested. \n\nBUT what you said in the beginning is 100% how I feel. Mentally I can separate the fact that his character has shown me otherwise, only time will tell I suppose if emotionally I'm able to continue if that makes sense. If being in his presence now incites/triggers some anxiety and things (uncontrollably) when I get in his presence I know its going to ruin the Dynamic of things & I'll really have no choice but to end",
                    "author": "synclaireeebby",
                    "id": "gtgjzhj",
                    "parent_id": "t1_gtgh1jl",
                    "score": 7,
                    "created_utc": 1617634654.0,
                    "replies": [
                        {
                            "body": "Ah ok, sorry, I clearly missed you saying that you were also iffy about him being in the military as well. \n\nYes, you are under NO obligation to put yourself in unpleasant situations (especially ones that may trigger anxiety or even symptoms that sound like they might be PTSD, which is a clinically recognized condition - I only say this to underline that this isn't just something that's in your head), just to make someone else feel better or ok, or because \"rationally\" there's no reason to feel anxious/scared/upset. As women we often feel like we have to \"deal with\" things, or that something \"isn't a big deal\" and we should just \"get over it\"  etc. No! You want what you want, and you don't want what you don't want, and you should go by THAT! Most men and probably all sugar daddies go by that - they don't entertain anything that they aren't 100% into, regardless of how rational or irrational it is (and many times, it's something completely silly, whereas women tend to feel like they have to put with more significant issues). You do what's best for you. Sugar relationships are supposed to HELP you, not make you feel worse and acquire even more insecurities, anxiety, etc.\n\nAt the end of the day, you are a young beautiful woman with her future ahead of her. This SD is a tiny part of it, and is from the get-go designed to not be a serious part or stable part of your life. Don't do something that might be harmful to you, just to temporarily get some middle-aged dude's rocks off, especially if all you're getting out of it is some mani-pedis and an occasional trip to another state.",
                            "author": null,
                            "id": "gtglqej",
                            "parent_id": "t1_gtgjzhj",
                            "score": 3,
                            "created_utc": 1617635483.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtf6o06",
            "parent_id": "t3_mk9ytm",
            "score": -9,
            "created_utc": 1617597639.0,
            "replies": [
                {
                    "body": "...bruh",
                    "author": "HoneyBunnyBerry",
                    "id": "gtfazi4",
                    "parent_id": "t1_gtf6o06",
                    "score": 8,
                    "created_utc": 1617600990.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Really? *This* is a problem?  The fact that you're dating someone who ensures an orderly society?",
            "author": "jerdle",
            "id": "gteqyah",
            "parent_id": "t3_mk9ytm",
            "score": -20,
            "created_utc": 1617587763.0,
            "replies": [
                {
                    "body": "You're clearly not black so you're not going to understand what I'm getting at here and that's fine.",
                    "author": "synclaireeebby",
                    "id": "gtesys7",
                    "parent_id": "t1_gteqyah",
                    "score": 16,
                    "created_utc": 1617588929.0,
                    "replies": [
                        {
                            "body": "I don’t understand either but it’s not because I’m not black. It’s because where I live more than half the cops are black. The last two mayors were black. The police chief is a black woman. The district attorney is black \n\n( if he was a district attorney would it be different??)\n\nIs this a money thing? \n\nI’m asking not insinuating anything.",
                            "author": "Former_Baseball8679",
                            "id": "gtfcyt3",
                            "parent_id": "t1_gtesys7",
                            "score": -2,
                            "created_utc": 1617602641.0,
                            "replies": [
                                {
                                    "body": "This is not a money thing, I dont do PPM nor do I get an allowance. Everything I've received is gifts/experiences. Ending this wouldn't impact my life. \n\nIF you dont understand where I am coming from then its 100% because you're not black and I cant make/help you really understand that. \n\nIts not just because he's a cop. I am honestly not crazy about him being in the military, that was something I already have had to come to grips with and learn to be okay with. Government jobs in general are very political and messy and targeting and I'm not a fan. I dont care who's in charge. \n\nJust because someone is black doesnt mean they have my undying support contrary to popular belief. quite honestly even if he was black in this case I would question if I still wanted to date them. That's just my preference. Like I said in the post I wouldn't actively pursue/entertain someone if I knew they were a cop",
                                    "author": "synclaireeebby",
                                    "id": "gtfi91r",
                                    "parent_id": "t1_gtfcyt3",
                                    "score": 10,
                                    "created_utc": 1617607432.0,
                                    "replies": [
                                        {
                                            "body": "I don’t understand YOUR feelings on cops Bc I’m not black ?\n\nwhat does color have to do with it? That’s very arrogant of you.\n\nNot minimizing but \n\nFrom 2016-2020, in America there were an average of 230 blacks killed by police per year (FBI STATISTICS) and this is total deaths by police. Guilt or innocence has nothing to do w stat.\n\nDo you want to know how many people were killed by police in my country for just ONE YEAR?? In 2019,  close to 5,000 were killed by police. and we are the size of florida. 5,000. And That was a down year. \nTell me again how I won’t understand Bc in not black?",
                                            "author": "Former_Baseball8679",
                                            "id": "gtfj2a4",
                                            "parent_id": "t1_gtfi91r",
                                            "score": -2,
                                            "created_utc": 1617608230.0,
                                            "replies": [
                                                {
                                                    "body": "I'm sorry you have to experience that in your country. \n\nI still explained myself further down, refer to that for your answer. Black or not I'm not sure I would want to date a cop. plain and simple. Based off your response I'm surprised you dont agree with me and we're going back in forth here.",
                                                    "author": "synclaireeebby",
                                                    "id": "gtfkzzm",
                                                    "parent_id": "t1_gtfj2a4",
                                                    "score": 10,
                                                    "created_utc": 1617610159.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Smh at you. She’s written a thoughtful and understanding post and you just refuse to see her perspective",
                    "author": "prettylilprostitute",
                    "id": "gtevqkp",
                    "parent_id": "t1_gteqyah",
                    "score": 7,
                    "created_utc": 1617590553.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Anyone see the irony here about prejudice ?  Aren't we all just human beings deep down or aren't we ?",
            "author": "wb19081908",
            "id": "gtfcdgy",
            "parent_id": "t3_mk9ytm",
            "score": -7,
            "created_utc": 1617602136.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtg82bh",
                    "parent_id": "t1_gtfcdgy",
                    "score": 12,
                    "created_utc": 1617628527.0,
                    "replies": [
                        {
                            "body": "Prejudice ...it means to prejudge someone.  Its funny all the people saying they hate cops yet when it they are needed say in a case of domestic violence people have a different view.\n\nCops have a vary hard job especially given how poor their pay is.",
                            "author": "wb19081908",
                            "id": "gtgigcd",
                            "parent_id": "t1_gtg82bh",
                            "score": -4,
                            "created_utc": 1617633921.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's not what certain politicians want and have made it their priority to make sure we hate each other.",
                    "author": "Teejaynj",
                    "id": "gtg6ro8",
                    "parent_id": "t1_gtfcdgy",
                    "score": -1,
                    "created_utc": 1617627791.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "everyone is worried that SD lied about his profession. Well, so what? We instruct people to hide their identity and call it Op Sec. He has a lot to lose if his SB goes postal on him. This is not IRL dating. Stick with the sugar plan and if you want an open book vanilla date.  Besides, it's not like he told her after 4 years as happened to an OP last week.",
            "author": "GSSD",
            "id": "gtg69fu",
            "parent_id": "t3_mk9ytm",
            "score": -3,
            "created_utc": 1617627495.0,
            "replies": []
        },
        {
            "body": "Please help me understand...\n\nIn Philadelphia, Pa. I’d say more than half of the police force are minorities (black Latinos Asian woman). The District attorney and the Mayor was black and the police chief is a black woman.\n\nI would consider those top positions but all make up law enforcement. You can’t feel uneasy bout police offficers  but ok with the police chief or district attorney. Not rationally. (IMO)\n\nSo would you feel the same way if he had a better position in law enforcement rather than just a police officer?\n\nIf not, then is it because of how your family or friends would view you? \n\nOr do you think your not being loyal or betraying a belief?\n\nOr is it the fact that he made it a big deal by keeping it from you??\n\nI’m just trying to understand where it’s coming from....\n\nif it’s the footage of police killing black men but I know you know that not all police kill black men. \n\nPlus he was a marine and I’m sure you’ve seen or heard of soldiers killing innocent people in Vietnam, Afghanistan and Iraq etc and you kept dating a soldier.\n\nAnd it can’t be about seeing black men die Bc over 92% of black men murdered are murdered by a  black men. \n\n Maybe you should watch some videos of white cops saving black people lives to balance things out and lose some of the bias..\n\nThen figure out where that bias comes from and  challenge it’s authenticity\n\nI’m just trying to show how ridiculous your feelings are however, your entitled to it. Just make sure it’s YOUR ridiculous feelings and not one given or handed to you. Check for authenticity",
            "author": "Former_Baseball8679",
            "id": "gtffrvx",
            "parent_id": "t3_mk9ytm",
            "score": -7,
            "created_utc": 1617605121.0,
            "replies": [
                {
                    "body": "Contrary to polular belief just because someone is of my same skin color that doesnt automatically give them my 100% support. Them being the same color gives me more hope that they might be on my side. \n\nI'm not a fan of any government jobs, him being in the Army was something I've already had to learn to be okay with. \n\nMy friends and family dont know anything about him and I dont plan on telling them about this side of my life. BUT the last thing I would want at the same time would be for them to find out on the news because something happened to me. \n\nWhen he asked for my friends and family opinions we were talking in a general sense. I took it as would I date a cop in general as in SR or vanilla and if I would tell. Even if this was vanilla I would be nervous to share simply bc there are stats to back up domestic violence with cops. If he happened to be white on top of that it would just raise more concern. \n\nWhile I do respect privacy, as I kept my real name and other info quiet for the first 2.5months I wouldve appreciated him telling me sooner. Its clear he understood how the AA feels about the profession which is why he was nervous to tell me. He should've just gotten it out of the way before either of us got emotionally invested. \n\nthis bias comes from the every day challenges of not only being a woman but an AA one at that. \n\nI've first hand had bad experiences with cops and they didnt know anything about me. I have opened up parts of my life to him. IF things go south he has a lot more leverage over me than a typical SD would & AA's dont get to go on mass murdering sprees and walk away like we've seen happen multiple times for white males. Black males cant even survive a simple arrest. \n\nYes I know the stats dont apply to everyone. I know plenty of good cops have helped our communities but it only takes one to do damage in my life.  if this SD happens to be that one I'm f*cked. \n\nIf you took a poll asking the AA if law enforcement incited some level of anxiety there would be a small percentage that said no. \n\nMy feelings are not ridiculous. They're backed up just like yours are.",
                    "author": "synclaireeebby",
                    "id": "gtfm3lh",
                    "parent_id": "t1_gtffrvx",
                    "score": 18,
                    "created_utc": 1617611255.0,
                    "replies": [
                        {
                            "body": "Thanks for clarifying. Looking up domestic violence stat w cops because of  what reason ? An experience w him? Or are u just trying to find reasons to end it? \n\nThere will always be another one. No one is irreplaceable and the next one won’t hVe the fears concerns you have with this one. \n\n\nself preservation / defense mechanisms keeps things comfortable and can save your life  BUT  it can also keep you from living your greatest one.\n\n\n.You have some thinking to do. \n\nSounds like u just want to be put at ease and have him tell u things gonna be ok and u freaking out Bc of his style of gathering info/ perspective  by\nasking questions instead of a “F That, everything will be ok, it’s me and you and I got you” type  of handling this is what you’d prefer without actually ever thinking that (don’t know if that makes sense)\n\ngood luck. You seem like a sweet person. Gnight",
                            "author": "Former_Baseball8679",
                            "id": "gtfmwt6",
                            "parent_id": "t1_gtfm3lh",
                            "score": -3,
                            "created_utc": 1617612069.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wow.",
                    "author": "eerriinn_",
                    "id": "gtfja45",
                    "parent_id": "t1_gtffrvx",
                    "score": 10,
                    "created_utc": 1617608449.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtfjogj",
                    "parent_id": "t1_gtffrvx",
                    "score": 2,
                    "created_utc": 1617608848.0,
                    "replies": [
                        {
                            "body": "Shows your privilege and arrogance due to being born in a first world country. \n\nI was born in Philippines, in 2018, 5000+ people were killed by police. In 2019, 4890 were killed by police.\n\nIn America, from 2016-2020 an average of 230 blacks were killed by police a year. Guilty or innocent. Not saying it’s right or minimizing anything\n\nI’m sure this is the first time u saw the numbers Bc u just knew how bad you had it in your first world country and no one else can understand how bad u have it lol.",
                            "author": "Former_Baseball8679",
                            "id": "gtfkc4w",
                            "parent_id": "t1_gtfjogj",
                            "score": 2,
                            "created_utc": 1617609505.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtflcrp",
                                    "parent_id": "t1_gtfkc4w",
                                    "score": 1,
                                    "created_utc": 1617610513.0,
                                    "replies": [
                                        {
                                            "body": "So you think it’s gotten worst here for you since repeal of  Jim Crow laws, desegregation?",
                                            "author": "Former_Baseball8679",
                                            "id": "gtflew3",
                                            "parent_id": "t1_gtflcrp",
                                            "score": 2,
                                            "created_utc": 1617610571.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gtflje0",
                                                    "parent_id": "t1_gtflew3",
                                                    "score": 1,
                                                    "created_utc": 1617610692.0,
                                                    "replies": [
                                                        {
                                                            "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
                                                            "author": "Former_Baseball8679",
                                                            "id": "gtflwyw",
                                                            "parent_id": "t1_gtflje0",
                                                            "score": 2,
                                                            "created_utc": 1617611070.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well beginning of SR both sides keep distance of personal lives in beginning.  Sounds like this has been eating at him keeping up charade and to point he cares about you and had to tell you; which makes it hard given hiding before.\n\nI would say wait a few days then sit down and talk and get out your feelings; questions; etc.\n\nAnd as disclaimer I am not a huge Cop fan; but I have known some good members of police force.  But just like cant judge all people by color of skin; cant judge all people by color of uniform...imho.\n\nAnd when he is concerned about what your family/friends may think.  It appears he may be ready to take things to next level.  You sound like you really care for him.  But only you have the answer.",
            "author": "Buckeyechamp21",
            "id": "gtg3utd",
            "parent_id": "t3_mk9ytm",
            "score": -3,
            "created_utc": 1617626029.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfpybz",
            "parent_id": "t3_mk9ytm",
            "score": -13,
            "created_utc": 1617615103.0,
            "replies": [
                {
                    "body": "Being a cop is not a race.",
                    "author": "pixelated_fun",
                    "id": "gtg42ek",
                    "parent_id": "t1_gtfpybz",
                    "score": 15,
                    "created_utc": 1617626160.0,
                    "replies": []
                },
                {
                    "body": "I'm not a racist I've been fine with him up until this point. This is not my whining I had a genuine emotional reaction to this news. That was out of my control. Being in a cops presence incites a level of anxiety in me, not going to apologize for that. \n\nI've replied to other people and to the thread as a whole I dont care what color he is, as a woman now (forget being AA for a sec) there are stats backing up increased domestic violence for those in a relationship with someone in law enforcement. Do I want to run that risk because we are in a honeymoon phase and everything has been great? I dont know, .",
                    "author": "synclaireeebby",
                    "id": "gtgnk99",
                    "parent_id": "t1_gtfpybz",
                    "score": 11,
                    "created_utc": 1617636316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gtf345w",
            "parent_id": "t3_mk9ytm",
            "score": -4,
            "created_utc": 1617595200.0,
            "replies": [
                {
                    "body": "How does concern about ones occupation make her racist?",
                    "author": "LuluvioletSB",
                    "id": "gtf3agh",
                    "parent_id": "t1_gtf345w",
                    "score": 9,
                    "created_utc": 1617595320.0,
                    "replies": []
                },
                {
                    "body": "Removed for Rule #1:\n\n* Remember the human- Be respectful to other posters. No name calling, personal attacks, etc.",
                    "author": "SeattleLaserMeteor",
                    "id": "gtf4pyx",
                    "parent_id": "t1_gtf345w",
                    "score": 2,
                    "created_utc": 1617596284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gtgkedc",
            "parent_id": "t3_mk9ytm",
            "score": -8,
            "created_utc": 1617634852.0,
            "replies": [
                {
                    "body": "First of all there’s a rule called “remember the human”. There’s a way to express your opposition without calling peoples issues stupid and dumb. You sound extremely childish. \n\nWhy write an entire chapter about your opposing position only for your POV to get drowned by your insults not only to the OP but to others in this thread?\n\nYou’re playing yourself.",
                    "author": null,
                    "id": "gtglxo7",
                    "parent_id": "t1_gtgkedc",
                    "score": 11,
                    "created_utc": 1617635575.0,
                    "replies": [
                        {
                            "body": "Playing myself? I could not care less what the people who aren’t intelligent enough to read my comment for what it is, rather than get fixated on the “mean words” used like a toddler gets fixated by a shiny toy lol.\n\nClearly you’re in this category - which I think I need to dumb this down a bit and spell it out...I don’t care what you think of my post to the OP.\n\nIn fact, I don’t care what anyone who thinks it’s okay to stereotype people thinks about me.",
                            "author": "HotStool",
                            "id": "gtgpi3h",
                            "parent_id": "t1_gtglxo7",
                            "score": -4,
                            "created_utc": 1617637178.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gtf2klc",
            "parent_id": "t3_mk9ytm",
            "score": 1,
            "created_utc": 1617594835.0,
            "replies": [
                {
                    "body": "Removed for Rule #1:\n\n* Remember the human- Be respectful to other posters. No name calling, personal attacks, etc.\n\nLet's discuss & express our opinions without resorting to terms like \"retardedly liberal\" and calling each other insane.",
                    "author": "SeattleLaserMeteor",
                    "id": "gtf3v7p",
                    "parent_id": "t1_gtf2klc",
                    "score": 3,
                    "created_utc": 1617595707.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah that’s not a “hint at a serious relationship” . Do you inform your family of your sugar relationships?",
            "author": "emmdubb22",
            "id": "gtg63mw",
            "parent_id": "t1_gtfz5r6",
            "score": 0,
            "created_utc": 1617627396.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtgaxy7",
                    "parent_id": "t1_gtg63mw",
                    "score": 21,
                    "created_utc": 1617630095.0,
                    "replies": [
                        {
                            "body": "Yes!!! Exactly! This is not a vanilla relationship nor did they meet on Hinge or some other traditional dating app. Dating a cop is a good start but *how* we met is even more importantly and under *what* premise.  My reaction would have been: No need to ignore the elephant in the room...we know how we met so why does it matter what my family would think? Would your family or friends see you differently if they knew the backstory on how we met? Would your employer see you differently?  \n\nSometimes it’s more than what’s said, it’s what’s not being said.",
                            "author": null,
                            "id": "gtgovun",
                            "parent_id": "t1_gtgaxy7",
                            "score": 7,
                            "created_utc": 1617636904.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s exactly the problem. That group of professionals are very skilled liars and have almost a inarguably protected status by law. He lied for MONTHS, let her get comfortable in the relationship and then dropped this on her. \n\nI’m almost inclined to say start pulling away now. No telling how much personal info he can pull on her.",
            "author": "emmdubb22",
            "id": "gtg4j2s",
            "parent_id": "t1_gtfpe73",
            "score": 39,
            "created_utc": 1617626449.0,
            "replies": []
        },
        {
            "body": "I’m reading all the comments and it seems everyone is so focused on money and his generosity yet ignore the fact that not only is he a cop but he lied about it for months...\n\nThat would be a HUGE red flag. If there’s nothing to worry about then why lie about your occupation? \n\n9 out of 10 times, where there’s one lie, there’s several. Between him being a cop and lying about it, there’s something more going on. This is why I mentioned in my post about trust and whether or not he will hold something against her.  \n\nHe’s already broken trust by lying when he should have just been honest and upfront so she can decide on her own how she wants to proceed. Gifts or no gifts I wouldn’t trust him.",
            "author": null,
            "id": "gtg1zst",
            "parent_id": "t1_gtfpe73",
            "score": 41,
            "created_utc": 1617624848.0,
            "replies": [
                {
                    "body": "Exactly. It feels like this is just the tip of the iceberg and that he's trickle truthing her. What else is going to be revealed further down the line when she's even more invested in the relationship with the excuse that he wasn't sure how she'd react.",
                    "author": "Cats-and-Sunshine",
                    "id": "gtg2clm",
                    "parent_id": "t1_gtg1zst",
                    "score": 18,
                    "created_utc": 1617625075.0,
                    "replies": [
                        {
                            "body": "I’ve never given merit to someone who justifies their actions and lack of forthcoming with “oh I didn’t know how you would respond”. It’s like a manipulative way of reversing accountability and shifting the issue onto the other person as if they’re (the person who was lied to) not the victim. \n\nPure manipulation, narcissism, and a way to control the situation.\n\nLike I said, ain’t no way I would mess with him. Like HAIL NO 😄",
                            "author": null,
                            "id": "gtg3vxy",
                            "parent_id": "t1_gtg2clm",
                            "score": 18,
                            "created_utc": 1617626049.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "true on the lies, but it appears most people lie to one extent or another in the beginning of SR.  And yeah I was in situation where ex sgf lied to me / ommitted things etc and it is tough because you then go back and re question every interaction of the relationship.  I actually found out/caught her in lies but didnt let her know for a bit and even few hints hoping she would come clean with her lies and would have forgave.  But she didnt, she kept on lying.\n\n***However***, In this situation he did not get caught in the lie.  He appears to have gotten to point his feelings for her no longer make it possible to continue the lie.  And least he was man enough to get things out on table now (cant undo the past); despite knowing he would risk loosing her.",
                    "author": "Buckeyechamp21",
                    "id": "gtg4iyr",
                    "parent_id": "t1_gtg1zst",
                    "score": 0,
                    "created_utc": 1617626447.0,
                    "replies": [
                        {
                            "body": "You must have missed where he asked her a generic question “would you date a cop”. He wasn’t forthcoming and if he was he wouldn’t have presented the truth in that way. He would have said “I’m a cop. How do you feel about dating me now that you know my real occupation”. He was still being misleading and trying to control the narrative.\n\nPeople need to stop making excuses for liars and manipulators at the expense of their own standards. He has issues so now she’s suppose to accept him and lower her standards to make him feel comfortable? NO.",
                            "author": null,
                            "id": "gtg4t32",
                            "parent_id": "t1_gtg4iyr",
                            "score": 14,
                            "created_utc": 1617626619.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seems like he didn’t tell her because he really liked her and he was worried she would STEREOTYPE him.\n\nCan you guess what she did?\n\n🤔🤔🤔🤔\n\nThis is such a stupid thread lol",
                    "author": "HotStool",
                    "id": "gtgku62",
                    "parent_id": "t1_gtg1zst",
                    "score": -10,
                    "created_utc": 1617635059.0,
                    "replies": [
                        {
                            "body": "If I were a mod, I’d ban you. No further explanation needed.",
                            "author": null,
                            "id": "gtglcwy",
                            "parent_id": "t1_gtgku62",
                            "score": 8,
                            "created_utc": 1617635307.0,
                            "replies": [
                                {
                                    "body": "I’m guessing they didn’t make you a mod because you would ban people who are against stereotyping of any kind.\n\nWhat a great stance you have. No further explanation needed.",
                                    "author": "HotStool",
                                    "id": "gtgovxh",
                                    "parent_id": "t1_gtglcwy",
                                    "score": -5,
                                    "created_utc": 1617636905.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "thank you 💗",
            "author": "synclaireeebby",
            "id": "gtgm62q",
            "parent_id": "t1_gtfpzmx",
            "score": 7,
            "created_utc": 1617635684.0,
            "replies": []
        },
        {
            "body": "This. How do you go from PPM to vanilla boyfriend? I know it seems like a better gig now but he started scamming from the get go it seems .",
            "author": "emmdubb22",
            "id": "gtg68o6",
            "parent_id": "t1_gtg1t8p",
            "score": 16,
            "created_utc": 1617627482.0,
            "replies": []
        },
        {
            "body": "You are totally right about this. I immediately understood your apprehension.",
            "author": "emmdubb22",
            "id": "gtg4tgi",
            "parent_id": "t1_gtfklib",
            "score": 14,
            "created_utc": 1617626625.0,
            "replies": []
        },
        {
            "body": "It honestly is annoying when you specifically ask *POC women* to share their experience, white men will always try to wiggle their way in. \n\nLike mate nobody asked you, kindly step back and let people have their own space, without feeling the need to insert yourself into everything.",
            "author": "NihilisticBuddhism",
            "id": "gtfuvhj",
            "parent_id": "t1_gtfklib",
            "score": 31,
            "created_utc": 1617619589.0,
            "replies": [
                {
                    "body": "Ummm history says they’ve been this way for decades on decades...Native Americans were the first victims to white people inserting themselves and taking over.\n\nIt’s the superiority complex.",
                    "author": null,
                    "id": "gtg3dhe",
                    "parent_id": "t1_gtfuvhj",
                    "score": 7,
                    "created_utc": 1617625724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Based upon your feelings—this entire situation is not what a SR should be about. It should be happy, joyous and a breath of fresh air...unfortunately if you continue you will be suffocating because of feelings of contempt towards him based upon the reasons that compelled you to see advice or gather other perspectives.",
            "author": null,
            "id": "gtg36r6",
            "parent_id": "t1_gtfklib",
            "score": 5,
            "created_utc": 1617625606.0,
            "replies": [
                {
                    "body": "Agreed that's exactly what it should be *and it was* up until this point. I need to figure out if my emotional reaction was shock or if that's something that is going to continue every time I'm in his presence",
                    "author": "synclaireeebby",
                    "id": "gtglw25",
                    "parent_id": "t1_gtg36r6",
                    "score": 7,
                    "created_utc": 1617635554.0,
                    "replies": [
                        {
                            "body": "It sounds like you’re being very smart about it by meeting up with him again to gauge how you feel about all of this. It’s your world, continue to own it wisely as you have been. 🙂",
                            "author": null,
                            "id": "gtgmcv5",
                            "parent_id": "t1_gtglw25",
                            "score": 6,
                            "created_utc": 1617635771.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "From what I understood he waited so long because he was nervous to bring it up. Unsure how I would react, knowing how the majority of the AA community feels towards the profession. Do I understand where he's coming from? yes to an extent but it doesn't make me feel any less uneasy. I think some of what I am feeling is shock but I'm going to sleep on it a night or two then maybe do a lunch one day to talk this out. If I am still uncomfortable at that meet I may not be able to shake this and I'll unfortunately have to end it.",
            "author": "synclaireeebby",
            "id": "gtfhdlr",
            "parent_id": "t1_gtfdomi",
            "score": 16,
            "created_utc": 1617606597.0,
            "replies": [
                {
                    "body": "That’s a cop out “didn’t want to bring it up bc of how AA feel towards the profession” \n\nNo, AA actually call BS on the profession and don’t have a mythical, romanticized image of the profession and are hyper aware of the actual nature of the profession. Also, we pay attention to all those well funded PR programs in the form of nightly television.",
                    "author": "emmdubb22",
                    "id": "gtg58ry",
                    "parent_id": "t1_gtfhdlr",
                    "score": 14,
                    "created_utc": 1617626882.0,
                    "replies": []
                },
                {
                    "body": "Of course, do what makes you comfortable above all. If he can't respect that then that'll be just another reason to end it.",
                    "author": "daisyqueenofflowers",
                    "id": "gtfhgsg",
                    "parent_id": "t1_gtfhdlr",
                    "score": 7,
                    "created_utc": 1617606682.0,
                    "replies": []
                },
                {
                    "body": "I think sleeping on it is a fantastic idea, when I’m faced with a big decision sometimes it doesn’t feel so big after a few days of rest. Also if you have a trusted friend (someone you trust to be impartial - not everyone has one of these) or better yet a counsellor or psychologist or something TOTALLY tell them - sometimes you just need someone to listen actively to your thought processes in order to clear things up in your head. \n\nEither way, best of luck with your decision, I hope you find the happiness and contentness you seek :-)",
                    "author": "iAmPizzaJohn",
                    "id": "gtfiwe9",
                    "parent_id": "t1_gtfhdlr",
                    "score": 4,
                    "created_utc": 1617608069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah it's up to the OP but personally this would hit too close to home. SRs are an escape for me, and this situation is way too loaded for me to really enjoy myself. Especially the part about possible retaliation. Sure we've heard of SDs threatening ex-SBs with lawyers or calling the police. But this guy actually has the power to follow up on that *outside the confines of the law*\n\nIf any other SD threatens you, you can call the cops on them. But if this guy threatens you, who do you turn to?",
            "author": "iknowwhatiwantbroski",
            "id": "gtf6jce",
            "parent_id": "t1_gtf191i",
            "score": 19,
            "created_utc": 1617597545.0,
            "replies": []
        },
        {
            "body": "Completely agree with this!\n\nOP should definitely step back and take time to think things through. There’s a reason why she feels this way, and that needs to be addressed.",
            "author": "NihilisticBuddhism",
            "id": "gtfs7po",
            "parent_id": "t1_gtf191i",
            "score": 3,
            "created_utc": 1617617263.0,
            "replies": []
        },
        {
            "body": "Yeah I think this seems like a really fair and balanced assessment. \n\nI listened to this podcast about how, in NYC especially, there was this huge drive to “increase police activity” but also decrease the number of crimes reported and charged for. On the outside this made it so that politicians could say “crime is going down” under their governance, when in reality it was just being underreported (this was SUPER bad - like rape victims were in many cases unable to convict their rapists!!). It also led to police being encouraged/forced by their superiors to arrest people who fitted the visual profile of someone who committed a crime in the area (this disproportionally targeted black people just chilling in public) and then let them go a couple hours later with no charges (this was the “increasing police presence” portion of the requirements) \n\nIt was so devastating to hear from a cop within this system who knew it was unjust but couldn’t change it. No politicians wanted to be the person under whom crime statistics increased, and the public at large wasn’t super aware. It ended up going to trial though. It was such a good listen I highly recommend it \n\n\n[Podcast part one](https://open.spotify.com/episode/7vPVmqFCFxBZJpStDAHl2n?si=KUffn2rWQaCL3t0-kIYosg) and [Podcast part 2 ](https://open.spotify.com/episode/02uhOqpfshGwQZVpYrQFJi?si=LnQ5GBChS-e67YeoA5VRvQ)\n\nEdit: this was a ramble but I think what I was getting at is that it’s totally fair to be wary of cops as a person of colour but also many cops are good people who are doing their best to continue being good people and good cops in a nonsensical and unfair system that disproportionately targets African Americans",
            "author": "iAmPizzaJohn",
            "id": "gtfimi8",
            "parent_id": "t1_gteu498",
            "score": 2,
            "created_utc": 1617607798.0,
            "replies": [
                {
                    "body": "Sounds interesting and similar to what my city tried doing by increasing police activity. I’ll check out the podcasts, thanks!",
                    "author": "samcrosb",
                    "id": "gtgpknc",
                    "parent_id": "t1_gtfimi8",
                    "score": 2,
                    "created_utc": 1617637210.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great reply and as always bad apples spoil a bunch. Im sure you and ypur brother could have some interesting conversations.",
            "author": "bookworm010101",
            "id": "gtft2of",
            "parent_id": "t1_gteu498",
            "score": 1,
            "created_utc": 1617618029.0,
            "replies": [
                {
                    "body": "We’ve had a few conversations already but he lives in a different city than where we’re from. He shares some of his experiences with me though and I’m honestly proud of him.",
                    "author": "samcrosb",
                    "id": "gtgpz5g",
                    "parent_id": "t1_gtft2of",
                    "score": 1,
                    "created_utc": 1617637394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also would like to add the fact that he kept it from you for so long implies he knew it would be a problem 🤷🏻‍♀️",
            "author": "alice414",
            "id": "gterc9k",
            "parent_id": "t1_gter9v9",
            "score": 27,
            "created_utc": 1617587987.0,
            "replies": [
                {
                    "body": "Exactly!",
                    "author": "Cats-and-Sunshine",
                    "id": "gtfpf28",
                    "parent_id": "t1_gterc9k",
                    "score": 5,
                    "created_utc": 1617614574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cops aren't \"usually\" bad or \"stereotypically\" bad, theyre systemically bad. The dissoance is her relationship with someone active in a system thats perpetuating oppression.",
            "author": "itsmevajrayogini",
            "id": "gtes6zu",
            "parent_id": "t1_gteral6",
            "score": 58,
            "created_utc": 1617588480.0,
            "replies": [
                {
                    "body": "has their been been improvement or is it worse then ever?\n\nPlease support with data.",
                    "author": "bookworm010101",
                    "id": "gtfsuie",
                    "parent_id": "t1_gtes6zu",
                    "score": 2,
                    "created_utc": 1617617836.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtex2pc",
                    "parent_id": "t1_gtes6zu",
                    "score": 0,
                    "created_utc": 1617591350.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtghjw4",
                            "parent_id": "t1_gtex2pc",
                            "score": 10,
                            "created_utc": 1617633481.0,
                            "replies": []
                        },
                        {
                            "body": "It's pretty easy to imagine not having police who do actually policing, and are only a repressive force. This is the experience of some Asian American and black communities in the USA, for example, where the common sense is to never call the police or to expect support from them.",
                            "author": "Distinct-Animal-9628",
                            "id": "gtfpvo6",
                            "parent_id": "t1_gtex2pc",
                            "score": 20,
                            "created_utc": 1617615030.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed! As a mixed (part AA SB) I totally get not wanting to date a cop. But if he hasn’t done anything *directly* to upset you relating to his job, maybe ask him to keep that part private? I don’t see any reason why the two of you couldn’t maintain a decent sugar relationship so long as you outline your boundaries (if you choose to have any) and he respects them. Good luck!",
            "author": "curly_spice",
            "id": "gtesjyv",
            "parent_id": "t1_gteral6",
            "score": 19,
            "created_utc": 1617588687.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtetatv",
                    "parent_id": "t1_gtesjyv",
                    "score": -5,
                    "created_utc": 1617589124.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtg6c6u",
                            "parent_id": "t1_gtetatv",
                            "score": 20,
                            "created_utc": 1617627540.0,
                            "replies": []
                        },
                        {
                            "body": "Hey, for future reference its probably best not to make analogies where you're comparing the theoretical actions of an ethnic group vs. government employees who commit actual systemic abuse",
                            "author": "paddyspubofficial",
                            "id": "gtf9qws",
                            "parent_id": "t1_gtetatv",
                            "score": 29,
                            "created_utc": 1617599997.0,
                            "replies": [
                                {
                                    "body": "I have no connection to law enforcement other than having spent a lot of time with them trying to improve part of a Pico Union neighborhood in LA  in the middle of a crack epidemic. The kind of neighborhood where the contractors pulled into the secure garage opened their toolboxes and the first \"tool\" out was a large caliber pistol, the utility workers put on flack vests before climbing poles.  The victims were the young and old of all races, white, black, hispanic and asian . We had LAPD off duty officers working security because without them we could not get people to come to the building. The alley behind the building was filled with large cardboard boxes where crack addicted young women , many under 16 lived while they were pimped out by the gangs - tell me about how drug crimes are victimless crimes. \n\nLaw enforcement is not perfect but it is the last chance for many neighborhoods. So much of what you see on TV is driven by politics.  There's no mention of the thousands of small businesses, often owned by minorities,  that have been destroyed in riots across the nation, the many cities where the police are the thin blue line between civility and tribal anarchy. \n\nPolitics drives much of what you see on TV. Take Ferguson, Obama attacked the officer , the police and virtually incited riots that took lives and destroyed property .  Yet one Friday night after reporters had left for the weekend Obama's DOJ released its official report  finding that   \"Hands Up Don't Shoot never happened, the officer only shot when the \"little boy\"  (6'4\" and 290 pounds) advanced again on the officer whom he had attacked and struggled to get the officer's gun. The report further admitted that many of the \"witnesses\" so beloved by CNN and other networks lied and a number admitted that they were not even at the scene.  But the lies scarred our society and a generation's views of the police were moulded through a deliberately false story.  \n\nIf you look at 20 years of records for the 10 million people living in Los Angeles County (LA Times murder report)  a black homicide was less likely to have had any police involvement than a white homicide. What does stand out is the vast disparity in murder rates between races, especially among males.  The briefest review of FBI national crime stats also shows a huge disparity between the murder rates.  Tragically a young black man is probably 6 times more likely to die a violent death than a white male of similar age.  Instead of using fabricated events to divide America (and members of the sugar communities) we should be seeking common ground through looking at reality and asking what needs to be done.",
                                    "author": "pinotandsugar",
                                    "id": "gtgyls0",
                                    "parent_id": "t1_gtf9qws",
                                    "score": -8,
                                    "created_utc": 1617641288.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfq5ra",
            "parent_id": "t1_gteral6",
            "score": -8,
            "created_utc": 1617615302.0,
            "replies": []
        },
        {
            "body": "So...you got out of a scummy business bc your morals didn't line up with it...  \nDo you not realize the irony in that statement? If this guy is ok staying w the police despite clearly knowing & seeing the corruption & awful things police do, what does that say about his character & morals?   \nNot to mention this man \\*lied to her\\* for months about his occupation, because he \\*knew\\* that OP's reaction to the revelation may be negative.   \nYou can absolutely judge people for certain occupations - people who stay cops are part of a corrupt system & support that corruption (willingly or not). OP is very much right to feel the way she does, not just bc of the cop part but bc she was lied to (and he's feeding into a stereotype which is cops are excellent manipulators & liars).",
            "author": "weenieivy",
            "id": "gtgorod",
            "parent_id": "t1_gteue80",
            "score": 13,
            "created_utc": 1617636853.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfku5b",
            "parent_id": "t1_gteue80",
            "score": -8,
            "created_utc": 1617609998.0,
            "replies": [
                {
                    "body": "Wow another white guy speaking over BIPOC voices bc he just doesn’t think it could be that bad! Lmao what a joke.",
                    "author": "k_autumnal",
                    "id": "gtgoddq",
                    "parent_id": "t1_gtfku5b",
                    "score": 6,
                    "created_utc": 1617636679.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's funny because the fact that people responded to your post thinking it was fake just further proves your point. They are that fucking oblivious to the realities you mentioned when it comes to Cops and POC",
            "author": "eerriinn_",
            "id": "gtfjj9c",
            "parent_id": "t1_gtf6z21",
            "score": 18,
            "created_utc": 1617608703.0,
            "replies": []
        },
        {
            "body": "I’m not sure if your being sarcastic or this is real - I’m leaning towards sarcasm Bc of the generalizations. \n\nI honestly feel things in America gets exxagerated Bc it’s America.\n\nIf I was a new immigrant coming to America I’d think it was 1939 where a certain race was being target and lynched. Or even that the country is more racist than 50 years ago or that cops are killing black people all the time. But The numbers say something different it’s decreased since it spiked during Obama years and actually the lowest since data was kept during trumps presidency. Not saying that’s ok or deaths of Taylor, Floyd etc I’m just speaking on coverage and positioning by the media..\n\nOr maybe I’m desentesized bc i come from country where police kills three times more (total amount)  people than the United States while only having a third of Americas population with .01 percent of the global coverage of the blacks that get killed in america.",
            "author": "Former_Baseball8679",
            "id": "gtfbtps",
            "parent_id": "t1_gtf6z21",
            "score": -9,
            "created_utc": 1617601682.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtfd4bk",
                    "parent_id": "t1_gtfbtps",
                    "score": 9,
                    "created_utc": 1617602773.0,
                    "replies": [
                        {
                            "body": "I’m from the Philippines.\n\nFBI statistics is my source for police involved homicides in the us by race.  And then i used third grade math and figured out who the president was during the years it was high and who president was during the years it was lower\n\nAs far as the amount of coverage, I don’t have a source. but We both know the coverage spiked during election year while killings did not.\n\nNot trying to argue or debate with you. \n\nYour entitled to your feelings and to debate you (or anyone else) on your feelings is like trying to debate my wife on whether or not she had an orgasm.",
                            "author": "Former_Baseball8679",
                            "id": "gtfdkg1",
                            "parent_id": "t1_gtfd4bk",
                            "score": -6,
                            "created_utc": 1617603167.0,
                            "replies": [
                                {
                                    "body": "Bruh don't bring the Philippines down like that :/\n\nBeing desensitized does not entitle you to invalidate or belittle other people's experiences with oppression. Sure, america may be a haven to you compared to what you went through here, but don't look down on the very real injustices the AA community continue to face there.",
                                    "author": "iknowwhatiwantbroski",
                                    "id": "gtfh2fu",
                                    "parent_id": "t1_gtfdkg1",
                                    "score": 15,
                                    "created_utc": 1617606296.0,
                                    "replies": [
                                        {
                                            "body": "I never thought of it in that way and your commentary made me stop and think👍",
                                            "author": "Former_Baseball8679",
                                            "id": "gtfh9sl",
                                            "parent_id": "t1_gtfh2fu",
                                            "score": 5,
                                            "created_utc": 1617606493.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like I said in my post, I know not all cops are bad and he's given me no real reasons not to trust the character he's shown me but there's an emotional hesitation/feeling out of my control I'm struggling to shake right now. \n\nIf I cant bring myself to shake that off I know its going to be me that ruins the dynamic we have.",
            "author": "synclaireeebby",
            "id": "gtesu1q",
            "parent_id": "t1_gteraia",
            "score": 21,
            "created_utc": 1617588851.0,
            "replies": []
        },
        {
            "body": "That's your personal experience. Not everyone has that experience. He's obviously ashamed of something otherwise he wouldn't have hid it for 4 months.",
            "author": "throwaway6640",
            "id": "gtf1xn4",
            "parent_id": "t1_gteraia",
            "score": 14,
            "created_utc": 1617594419.0,
            "replies": [
                {
                    "body": "Or he was just keeping private till he got to know her better. She could probably look him up if she knew his profession and he wasn’t ready to share.",
                    "author": null,
                    "id": "gtfbcwf",
                    "parent_id": "t1_gtf1xn4",
                    "score": 0,
                    "created_utc": 1617601296.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtfdw58",
                            "parent_id": "t1_gtfbcwf",
                            "score": 12,
                            "created_utc": 1617603453.0,
                            "replies": [
                                {
                                    "body": "I think this is a hard one. In 4 months if he had that controlling abusive personality she would have seen it by now. If there’s nothing bad in his behavior then maybe his profession shouldn’t define him. This also means he is getting serious feelings for her...don’t a lot of SDs and SBs not even use their real names for many months?",
                                    "author": null,
                                    "id": "gtfeg9b",
                                    "parent_id": "t1_gtfdw58",
                                    "score": -5,
                                    "created_utc": 1617603930.0,
                                    "replies": [
                                        {
                                            "body": "On that same token couldn't he have seen she was a normal young woman and posed no threat to his career by month 2?  I also don't think there are any confirmed stories of young sbs trying to mess with cops in the first place where there is a huge power imbalance to begin with.  I'm not saying she should or shouldn't be with him. All I'm saying if things go south, the last person you'll want to be involved with is a cop, vanilla or otherwise.",
                                            "author": "throwaway6640",
                                            "id": "gtfhw6f",
                                            "parent_id": "t1_gtfeg9b",
                                            "score": 14,
                                            "created_utc": 1617607089.0,
                                            "replies": [
                                                {
                                                    "body": "I agree with this.",
                                                    "author": null,
                                                    "id": "gtfmkgn",
                                                    "parent_id": "t1_gtfhw6f",
                                                    "score": 1,
                                                    "created_utc": 1617611725.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Why do you assume that by 4 months you know someone’s character? One of the most common refrains for people in abusive relationships is that the beginning is SO GOOD. Often abuse doesn’t start until the honeymoon period is over. Or until the woman is pregnant. Or tries to leave. I’m not necessarily talking about OP’s situation, but your basic premise is patently false- and a bit victim blame-y.",
                                            "author": "fashlatebloomer",
                                            "id": "gtfhpfv",
                                            "parent_id": "t1_gtfeg9b",
                                            "score": 9,
                                            "created_utc": 1617606912.0,
                                            "replies": [
                                                {
                                                    "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
                                                    "author": null,
                                                    "id": "gtfmif5",
                                                    "parent_id": "t1_gtfhpfv",
                                                    "score": -2,
                                                    "created_utc": 1617611668.0,
                                                    "replies": [
                                                        {
                                                            "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                                                            "author": "fashlatebloomer",
                                                            "id": "gtfmvxy",
                                                            "parent_id": "t1_gtfmif5",
                                                            "score": 7,
                                                            "created_utc": 1617612045.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                                                                    "author": null,
                                                                    "id": "gtfnaop",
                                                                    "parent_id": "t1_gtfmvxy",
                                                                    "score": 2,
                                                                    "created_utc": 1617612457.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for your input, I've replied this a couple times to the thread that I am not okay with him being in the military that was already something I've had to come to grips in this SR. Him being a cop on top of that was kinda a double whammy here. \n\nI know Lying is part of the SR, I did the first 2.5months about my name and a good amount of other info so I respect the privacy I just wish he would've told me sooner I guess before I was this emotionally invested. \n\nBUT what you said in the beginning is 100% how I feel. Mentally I can separate the fact that his character has shown me otherwise, only time will tell I suppose if emotionally I'm able to continue if that makes sense. If being in his presence now incites/triggers some anxiety and things (uncontrollably) when I get in his presence I know its going to ruin the Dynamic of things & I'll really have no choice but to end",
            "author": "synclaireeebby",
            "id": "gtgjzhj",
            "parent_id": "t1_gtgh1jl",
            "score": 7,
            "created_utc": 1617634654.0,
            "replies": [
                {
                    "body": "Ah ok, sorry, I clearly missed you saying that you were also iffy about him being in the military as well. \n\nYes, you are under NO obligation to put yourself in unpleasant situations (especially ones that may trigger anxiety or even symptoms that sound like they might be PTSD, which is a clinically recognized condition - I only say this to underline that this isn't just something that's in your head), just to make someone else feel better or ok, or because \"rationally\" there's no reason to feel anxious/scared/upset. As women we often feel like we have to \"deal with\" things, or that something \"isn't a big deal\" and we should just \"get over it\"  etc. No! You want what you want, and you don't want what you don't want, and you should go by THAT! Most men and probably all sugar daddies go by that - they don't entertain anything that they aren't 100% into, regardless of how rational or irrational it is (and many times, it's something completely silly, whereas women tend to feel like they have to put with more significant issues). You do what's best for you. Sugar relationships are supposed to HELP you, not make you feel worse and acquire even more insecurities, anxiety, etc.\n\nAt the end of the day, you are a young beautiful woman with her future ahead of her. This SD is a tiny part of it, and is from the get-go designed to not be a serious part or stable part of your life. Don't do something that might be harmful to you, just to temporarily get some middle-aged dude's rocks off, especially if all you're getting out of it is some mani-pedis and an occasional trip to another state.",
                    "author": null,
                    "id": "gtglqej",
                    "parent_id": "t1_gtgjzhj",
                    "score": 3,
                    "created_utc": 1617635483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "...bruh",
            "author": "HoneyBunnyBerry",
            "id": "gtfazi4",
            "parent_id": "t1_gtf6o06",
            "score": 8,
            "created_utc": 1617600990.0,
            "replies": []
        },
        {
            "body": "You're clearly not black so you're not going to understand what I'm getting at here and that's fine.",
            "author": "synclaireeebby",
            "id": "gtesys7",
            "parent_id": "t1_gteqyah",
            "score": 16,
            "created_utc": 1617588929.0,
            "replies": [
                {
                    "body": "I don’t understand either but it’s not because I’m not black. It’s because where I live more than half the cops are black. The last two mayors were black. The police chief is a black woman. The district attorney is black \n\n( if he was a district attorney would it be different??)\n\nIs this a money thing? \n\nI’m asking not insinuating anything.",
                    "author": "Former_Baseball8679",
                    "id": "gtfcyt3",
                    "parent_id": "t1_gtesys7",
                    "score": -2,
                    "created_utc": 1617602641.0,
                    "replies": [
                        {
                            "body": "This is not a money thing, I dont do PPM nor do I get an allowance. Everything I've received is gifts/experiences. Ending this wouldn't impact my life. \n\nIF you dont understand where I am coming from then its 100% because you're not black and I cant make/help you really understand that. \n\nIts not just because he's a cop. I am honestly not crazy about him being in the military, that was something I already have had to come to grips with and learn to be okay with. Government jobs in general are very political and messy and targeting and I'm not a fan. I dont care who's in charge. \n\nJust because someone is black doesnt mean they have my undying support contrary to popular belief. quite honestly even if he was black in this case I would question if I still wanted to date them. That's just my preference. Like I said in the post I wouldn't actively pursue/entertain someone if I knew they were a cop",
                            "author": "synclaireeebby",
                            "id": "gtfi91r",
                            "parent_id": "t1_gtfcyt3",
                            "score": 10,
                            "created_utc": 1617607432.0,
                            "replies": [
                                {
                                    "body": "I don’t understand YOUR feelings on cops Bc I’m not black ?\n\nwhat does color have to do with it? That’s very arrogant of you.\n\nNot minimizing but \n\nFrom 2016-2020, in America there were an average of 230 blacks killed by police per year (FBI STATISTICS) and this is total deaths by police. Guilt or innocence has nothing to do w stat.\n\nDo you want to know how many people were killed by police in my country for just ONE YEAR?? In 2019,  close to 5,000 were killed by police. and we are the size of florida. 5,000. And That was a down year. \nTell me again how I won’t understand Bc in not black?",
                                    "author": "Former_Baseball8679",
                                    "id": "gtfj2a4",
                                    "parent_id": "t1_gtfi91r",
                                    "score": -2,
                                    "created_utc": 1617608230.0,
                                    "replies": [
                                        {
                                            "body": "I'm sorry you have to experience that in your country. \n\nI still explained myself further down, refer to that for your answer. Black or not I'm not sure I would want to date a cop. plain and simple. Based off your response I'm surprised you dont agree with me and we're going back in forth here.",
                                            "author": "synclaireeebby",
                                            "id": "gtfkzzm",
                                            "parent_id": "t1_gtfj2a4",
                                            "score": 10,
                                            "created_utc": 1617610159.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Smh at you. She’s written a thoughtful and understanding post and you just refuse to see her perspective",
            "author": "prettylilprostitute",
            "id": "gtevqkp",
            "parent_id": "t1_gteqyah",
            "score": 7,
            "created_utc": 1617590553.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtg82bh",
            "parent_id": "t1_gtfcdgy",
            "score": 12,
            "created_utc": 1617628527.0,
            "replies": [
                {
                    "body": "Prejudice ...it means to prejudge someone.  Its funny all the people saying they hate cops yet when it they are needed say in a case of domestic violence people have a different view.\n\nCops have a vary hard job especially given how poor their pay is.",
                    "author": "wb19081908",
                    "id": "gtgigcd",
                    "parent_id": "t1_gtg82bh",
                    "score": -4,
                    "created_utc": 1617633921.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's not what certain politicians want and have made it their priority to make sure we hate each other.",
            "author": "Teejaynj",
            "id": "gtg6ro8",
            "parent_id": "t1_gtfcdgy",
            "score": -1,
            "created_utc": 1617627791.0,
            "replies": []
        },
        {
            "body": "Contrary to polular belief just because someone is of my same skin color that doesnt automatically give them my 100% support. Them being the same color gives me more hope that they might be on my side. \n\nI'm not a fan of any government jobs, him being in the Army was something I've already had to learn to be okay with. \n\nMy friends and family dont know anything about him and I dont plan on telling them about this side of my life. BUT the last thing I would want at the same time would be for them to find out on the news because something happened to me. \n\nWhen he asked for my friends and family opinions we were talking in a general sense. I took it as would I date a cop in general as in SR or vanilla and if I would tell. Even if this was vanilla I would be nervous to share simply bc there are stats to back up domestic violence with cops. If he happened to be white on top of that it would just raise more concern. \n\nWhile I do respect privacy, as I kept my real name and other info quiet for the first 2.5months I wouldve appreciated him telling me sooner. Its clear he understood how the AA feels about the profession which is why he was nervous to tell me. He should've just gotten it out of the way before either of us got emotionally invested. \n\nthis bias comes from the every day challenges of not only being a woman but an AA one at that. \n\nI've first hand had bad experiences with cops and they didnt know anything about me. I have opened up parts of my life to him. IF things go south he has a lot more leverage over me than a typical SD would & AA's dont get to go on mass murdering sprees and walk away like we've seen happen multiple times for white males. Black males cant even survive a simple arrest. \n\nYes I know the stats dont apply to everyone. I know plenty of good cops have helped our communities but it only takes one to do damage in my life.  if this SD happens to be that one I'm f*cked. \n\nIf you took a poll asking the AA if law enforcement incited some level of anxiety there would be a small percentage that said no. \n\nMy feelings are not ridiculous. They're backed up just like yours are.",
            "author": "synclaireeebby",
            "id": "gtfm3lh",
            "parent_id": "t1_gtffrvx",
            "score": 18,
            "created_utc": 1617611255.0,
            "replies": [
                {
                    "body": "Thanks for clarifying. Looking up domestic violence stat w cops because of  what reason ? An experience w him? Or are u just trying to find reasons to end it? \n\nThere will always be another one. No one is irreplaceable and the next one won’t hVe the fears concerns you have with this one. \n\n\nself preservation / defense mechanisms keeps things comfortable and can save your life  BUT  it can also keep you from living your greatest one.\n\n\n.You have some thinking to do. \n\nSounds like u just want to be put at ease and have him tell u things gonna be ok and u freaking out Bc of his style of gathering info/ perspective  by\nasking questions instead of a “F That, everything will be ok, it’s me and you and I got you” type  of handling this is what you’d prefer without actually ever thinking that (don’t know if that makes sense)\n\ngood luck. You seem like a sweet person. Gnight",
                    "author": "Former_Baseball8679",
                    "id": "gtfmwt6",
                    "parent_id": "t1_gtfm3lh",
                    "score": -3,
                    "created_utc": 1617612069.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow.",
            "author": "eerriinn_",
            "id": "gtfja45",
            "parent_id": "t1_gtffrvx",
            "score": 10,
            "created_utc": 1617608449.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfjogj",
            "parent_id": "t1_gtffrvx",
            "score": 2,
            "created_utc": 1617608848.0,
            "replies": [
                {
                    "body": "Shows your privilege and arrogance due to being born in a first world country. \n\nI was born in Philippines, in 2018, 5000+ people were killed by police. In 2019, 4890 were killed by police.\n\nIn America, from 2016-2020 an average of 230 blacks were killed by police a year. Guilty or innocent. Not saying it’s right or minimizing anything\n\nI’m sure this is the first time u saw the numbers Bc u just knew how bad you had it in your first world country and no one else can understand how bad u have it lol.",
                    "author": "Former_Baseball8679",
                    "id": "gtfkc4w",
                    "parent_id": "t1_gtfjogj",
                    "score": 2,
                    "created_utc": 1617609505.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtflcrp",
                            "parent_id": "t1_gtfkc4w",
                            "score": 1,
                            "created_utc": 1617610513.0,
                            "replies": [
                                {
                                    "body": "So you think it’s gotten worst here for you since repeal of  Jim Crow laws, desegregation?",
                                    "author": "Former_Baseball8679",
                                    "id": "gtflew3",
                                    "parent_id": "t1_gtflcrp",
                                    "score": 2,
                                    "created_utc": 1617610571.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gtflje0",
                                            "parent_id": "t1_gtflew3",
                                            "score": 1,
                                            "created_utc": 1617610692.0,
                                            "replies": [
                                                {
                                                    "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
                                                    "author": "Former_Baseball8679",
                                                    "id": "gtflwyw",
                                                    "parent_id": "t1_gtflje0",
                                                    "score": 2,
                                                    "created_utc": 1617611070.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Being a cop is not a race.",
            "author": "pixelated_fun",
            "id": "gtg42ek",
            "parent_id": "t1_gtfpybz",
            "score": 15,
            "created_utc": 1617626160.0,
            "replies": []
        },
        {
            "body": "I'm not a racist I've been fine with him up until this point. This is not my whining I had a genuine emotional reaction to this news. That was out of my control. Being in a cops presence incites a level of anxiety in me, not going to apologize for that. \n\nI've replied to other people and to the thread as a whole I dont care what color he is, as a woman now (forget being AA for a sec) there are stats backing up increased domestic violence for those in a relationship with someone in law enforcement. Do I want to run that risk because we are in a honeymoon phase and everything has been great? I dont know, .",
            "author": "synclaireeebby",
            "id": "gtgnk99",
            "parent_id": "t1_gtfpybz",
            "score": 11,
            "created_utc": 1617636316.0,
            "replies": []
        },
        {
            "body": "How does concern about ones occupation make her racist?",
            "author": "LuluvioletSB",
            "id": "gtf3agh",
            "parent_id": "t1_gtf345w",
            "score": 9,
            "created_utc": 1617595320.0,
            "replies": []
        },
        {
            "body": "Removed for Rule #1:\n\n* Remember the human- Be respectful to other posters. No name calling, personal attacks, etc.",
            "author": "SeattleLaserMeteor",
            "id": "gtf4pyx",
            "parent_id": "t1_gtf345w",
            "score": 2,
            "created_utc": 1617596284.0,
            "replies": []
        },
        {
            "body": "First of all there’s a rule called “remember the human”. There’s a way to express your opposition without calling peoples issues stupid and dumb. You sound extremely childish. \n\nWhy write an entire chapter about your opposing position only for your POV to get drowned by your insults not only to the OP but to others in this thread?\n\nYou’re playing yourself.",
            "author": null,
            "id": "gtglxo7",
            "parent_id": "t1_gtgkedc",
            "score": 11,
            "created_utc": 1617635575.0,
            "replies": [
                {
                    "body": "Playing myself? I could not care less what the people who aren’t intelligent enough to read my comment for what it is, rather than get fixated on the “mean words” used like a toddler gets fixated by a shiny toy lol.\n\nClearly you’re in this category - which I think I need to dumb this down a bit and spell it out...I don’t care what you think of my post to the OP.\n\nIn fact, I don’t care what anyone who thinks it’s okay to stereotype people thinks about me.",
                    "author": "HotStool",
                    "id": "gtgpi3h",
                    "parent_id": "t1_gtglxo7",
                    "score": -4,
                    "created_utc": 1617637178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Removed for Rule #1:\n\n* Remember the human- Be respectful to other posters. No name calling, personal attacks, etc.\n\nLet's discuss & express our opinions without resorting to terms like \"retardedly liberal\" and calling each other insane.",
            "author": "SeattleLaserMeteor",
            "id": "gtf3v7p",
            "parent_id": "t1_gtf2klc",
            "score": 3,
            "created_utc": 1617595707.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtgaxy7",
            "parent_id": "t1_gtg63mw",
            "score": 21,
            "created_utc": 1617630095.0,
            "replies": [
                {
                    "body": "Yes!!! Exactly! This is not a vanilla relationship nor did they meet on Hinge or some other traditional dating app. Dating a cop is a good start but *how* we met is even more importantly and under *what* premise.  My reaction would have been: No need to ignore the elephant in the room...we know how we met so why does it matter what my family would think? Would your family or friends see you differently if they knew the backstory on how we met? Would your employer see you differently?  \n\nSometimes it’s more than what’s said, it’s what’s not being said.",
                    "author": null,
                    "id": "gtgovun",
                    "parent_id": "t1_gtgaxy7",
                    "score": 7,
                    "created_utc": 1617636904.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. It feels like this is just the tip of the iceberg and that he's trickle truthing her. What else is going to be revealed further down the line when she's even more invested in the relationship with the excuse that he wasn't sure how she'd react.",
            "author": "Cats-and-Sunshine",
            "id": "gtg2clm",
            "parent_id": "t1_gtg1zst",
            "score": 18,
            "created_utc": 1617625075.0,
            "replies": [
                {
                    "body": "I’ve never given merit to someone who justifies their actions and lack of forthcoming with “oh I didn’t know how you would respond”. It’s like a manipulative way of reversing accountability and shifting the issue onto the other person as if they’re (the person who was lied to) not the victim. \n\nPure manipulation, narcissism, and a way to control the situation.\n\nLike I said, ain’t no way I would mess with him. Like HAIL NO 😄",
                    "author": null,
                    "id": "gtg3vxy",
                    "parent_id": "t1_gtg2clm",
                    "score": 18,
                    "created_utc": 1617626049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "true on the lies, but it appears most people lie to one extent or another in the beginning of SR.  And yeah I was in situation where ex sgf lied to me / ommitted things etc and it is tough because you then go back and re question every interaction of the relationship.  I actually found out/caught her in lies but didnt let her know for a bit and even few hints hoping she would come clean with her lies and would have forgave.  But she didnt, she kept on lying.\n\n***However***, In this situation he did not get caught in the lie.  He appears to have gotten to point his feelings for her no longer make it possible to continue the lie.  And least he was man enough to get things out on table now (cant undo the past); despite knowing he would risk loosing her.",
            "author": "Buckeyechamp21",
            "id": "gtg4iyr",
            "parent_id": "t1_gtg1zst",
            "score": 0,
            "created_utc": 1617626447.0,
            "replies": [
                {
                    "body": "You must have missed where he asked her a generic question “would you date a cop”. He wasn’t forthcoming and if he was he wouldn’t have presented the truth in that way. He would have said “I’m a cop. How do you feel about dating me now that you know my real occupation”. He was still being misleading and trying to control the narrative.\n\nPeople need to stop making excuses for liars and manipulators at the expense of their own standards. He has issues so now she’s suppose to accept him and lower her standards to make him feel comfortable? NO.",
                    "author": null,
                    "id": "gtg4t32",
                    "parent_id": "t1_gtg4iyr",
                    "score": 14,
                    "created_utc": 1617626619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seems like he didn’t tell her because he really liked her and he was worried she would STEREOTYPE him.\n\nCan you guess what she did?\n\n🤔🤔🤔🤔\n\nThis is such a stupid thread lol",
            "author": "HotStool",
            "id": "gtgku62",
            "parent_id": "t1_gtg1zst",
            "score": -10,
            "created_utc": 1617635059.0,
            "replies": [
                {
                    "body": "If I were a mod, I’d ban you. No further explanation needed.",
                    "author": null,
                    "id": "gtglcwy",
                    "parent_id": "t1_gtgku62",
                    "score": 8,
                    "created_utc": 1617635307.0,
                    "replies": [
                        {
                            "body": "I’m guessing they didn’t make you a mod because you would ban people who are against stereotyping of any kind.\n\nWhat a great stance you have. No further explanation needed.",
                            "author": "HotStool",
                            "id": "gtgovxh",
                            "parent_id": "t1_gtglcwy",
                            "score": -5,
                            "created_utc": 1617636905.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ummm history says they’ve been this way for decades on decades...Native Americans were the first victims to white people inserting themselves and taking over.\n\nIt’s the superiority complex.",
            "author": null,
            "id": "gtg3dhe",
            "parent_id": "t1_gtfuvhj",
            "score": 7,
            "created_utc": 1617625724.0,
            "replies": []
        },
        {
            "body": "Agreed that's exactly what it should be *and it was* up until this point. I need to figure out if my emotional reaction was shock or if that's something that is going to continue every time I'm in his presence",
            "author": "synclaireeebby",
            "id": "gtglw25",
            "parent_id": "t1_gtg36r6",
            "score": 7,
            "created_utc": 1617635554.0,
            "replies": [
                {
                    "body": "It sounds like you’re being very smart about it by meeting up with him again to gauge how you feel about all of this. It’s your world, continue to own it wisely as you have been. 🙂",
                    "author": null,
                    "id": "gtgmcv5",
                    "parent_id": "t1_gtglw25",
                    "score": 6,
                    "created_utc": 1617635771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s a cop out “didn’t want to bring it up bc of how AA feel towards the profession” \n\nNo, AA actually call BS on the profession and don’t have a mythical, romanticized image of the profession and are hyper aware of the actual nature of the profession. Also, we pay attention to all those well funded PR programs in the form of nightly television.",
            "author": "emmdubb22",
            "id": "gtg58ry",
            "parent_id": "t1_gtfhdlr",
            "score": 14,
            "created_utc": 1617626882.0,
            "replies": []
        },
        {
            "body": "Of course, do what makes you comfortable above all. If he can't respect that then that'll be just another reason to end it.",
            "author": "daisyqueenofflowers",
            "id": "gtfhgsg",
            "parent_id": "t1_gtfhdlr",
            "score": 7,
            "created_utc": 1617606682.0,
            "replies": []
        },
        {
            "body": "I think sleeping on it is a fantastic idea, when I’m faced with a big decision sometimes it doesn’t feel so big after a few days of rest. Also if you have a trusted friend (someone you trust to be impartial - not everyone has one of these) or better yet a counsellor or psychologist or something TOTALLY tell them - sometimes you just need someone to listen actively to your thought processes in order to clear things up in your head. \n\nEither way, best of luck with your decision, I hope you find the happiness and contentness you seek :-)",
            "author": "iAmPizzaJohn",
            "id": "gtfiwe9",
            "parent_id": "t1_gtfhdlr",
            "score": 4,
            "created_utc": 1617608069.0,
            "replies": []
        },
        {
            "body": "Sounds interesting and similar to what my city tried doing by increasing police activity. I’ll check out the podcasts, thanks!",
            "author": "samcrosb",
            "id": "gtgpknc",
            "parent_id": "t1_gtfimi8",
            "score": 2,
            "created_utc": 1617637210.0,
            "replies": []
        },
        {
            "body": "We’ve had a few conversations already but he lives in a different city than where we’re from. He shares some of his experiences with me though and I’m honestly proud of him.",
            "author": "samcrosb",
            "id": "gtgpz5g",
            "parent_id": "t1_gtft2of",
            "score": 1,
            "created_utc": 1617637394.0,
            "replies": []
        },
        {
            "body": "Exactly!",
            "author": "Cats-and-Sunshine",
            "id": "gtfpf28",
            "parent_id": "t1_gterc9k",
            "score": 5,
            "created_utc": 1617614574.0,
            "replies": []
        },
        {
            "body": "has their been been improvement or is it worse then ever?\n\nPlease support with data.",
            "author": "bookworm010101",
            "id": "gtfsuie",
            "parent_id": "t1_gtes6zu",
            "score": 2,
            "created_utc": 1617617836.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtex2pc",
            "parent_id": "t1_gtes6zu",
            "score": 0,
            "created_utc": 1617591350.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtghjw4",
                    "parent_id": "t1_gtex2pc",
                    "score": 10,
                    "created_utc": 1617633481.0,
                    "replies": []
                },
                {
                    "body": "It's pretty easy to imagine not having police who do actually policing, and are only a repressive force. This is the experience of some Asian American and black communities in the USA, for example, where the common sense is to never call the police or to expect support from them.",
                    "author": "Distinct-Animal-9628",
                    "id": "gtfpvo6",
                    "parent_id": "t1_gtex2pc",
                    "score": 20,
                    "created_utc": 1617615030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtetatv",
            "parent_id": "t1_gtesjyv",
            "score": -5,
            "created_utc": 1617589124.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtg6c6u",
                    "parent_id": "t1_gtetatv",
                    "score": 20,
                    "created_utc": 1617627540.0,
                    "replies": []
                },
                {
                    "body": "Hey, for future reference its probably best not to make analogies where you're comparing the theoretical actions of an ethnic group vs. government employees who commit actual systemic abuse",
                    "author": "paddyspubofficial",
                    "id": "gtf9qws",
                    "parent_id": "t1_gtetatv",
                    "score": 29,
                    "created_utc": 1617599997.0,
                    "replies": [
                        {
                            "body": "I have no connection to law enforcement other than having spent a lot of time with them trying to improve part of a Pico Union neighborhood in LA  in the middle of a crack epidemic. The kind of neighborhood where the contractors pulled into the secure garage opened their toolboxes and the first \"tool\" out was a large caliber pistol, the utility workers put on flack vests before climbing poles.  The victims were the young and old of all races, white, black, hispanic and asian . We had LAPD off duty officers working security because without them we could not get people to come to the building. The alley behind the building was filled with large cardboard boxes where crack addicted young women , many under 16 lived while they were pimped out by the gangs - tell me about how drug crimes are victimless crimes. \n\nLaw enforcement is not perfect but it is the last chance for many neighborhoods. So much of what you see on TV is driven by politics.  There's no mention of the thousands of small businesses, often owned by minorities,  that have been destroyed in riots across the nation, the many cities where the police are the thin blue line between civility and tribal anarchy. \n\nPolitics drives much of what you see on TV. Take Ferguson, Obama attacked the officer , the police and virtually incited riots that took lives and destroyed property .  Yet one Friday night after reporters had left for the weekend Obama's DOJ released its official report  finding that   \"Hands Up Don't Shoot never happened, the officer only shot when the \"little boy\"  (6'4\" and 290 pounds) advanced again on the officer whom he had attacked and struggled to get the officer's gun. The report further admitted that many of the \"witnesses\" so beloved by CNN and other networks lied and a number admitted that they were not even at the scene.  But the lies scarred our society and a generation's views of the police were moulded through a deliberately false story.  \n\nIf you look at 20 years of records for the 10 million people living in Los Angeles County (LA Times murder report)  a black homicide was less likely to have had any police involvement than a white homicide. What does stand out is the vast disparity in murder rates between races, especially among males.  The briefest review of FBI national crime stats also shows a huge disparity between the murder rates.  Tragically a young black man is probably 6 times more likely to die a violent death than a white male of similar age.  Instead of using fabricated events to divide America (and members of the sugar communities) we should be seeking common ground through looking at reality and asking what needs to be done.",
                            "author": "pinotandsugar",
                            "id": "gtgyls0",
                            "parent_id": "t1_gtf9qws",
                            "score": -8,
                            "created_utc": 1617641288.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow another white guy speaking over BIPOC voices bc he just doesn’t think it could be that bad! Lmao what a joke.",
            "author": "k_autumnal",
            "id": "gtgoddq",
            "parent_id": "t1_gtfku5b",
            "score": 6,
            "created_utc": 1617636679.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfd4bk",
            "parent_id": "t1_gtfbtps",
            "score": 9,
            "created_utc": 1617602773.0,
            "replies": [
                {
                    "body": "I’m from the Philippines.\n\nFBI statistics is my source for police involved homicides in the us by race.  And then i used third grade math and figured out who the president was during the years it was high and who president was during the years it was lower\n\nAs far as the amount of coverage, I don’t have a source. but We both know the coverage spiked during election year while killings did not.\n\nNot trying to argue or debate with you. \n\nYour entitled to your feelings and to debate you (or anyone else) on your feelings is like trying to debate my wife on whether or not she had an orgasm.",
                    "author": "Former_Baseball8679",
                    "id": "gtfdkg1",
                    "parent_id": "t1_gtfd4bk",
                    "score": -6,
                    "created_utc": 1617603167.0,
                    "replies": [
                        {
                            "body": "Bruh don't bring the Philippines down like that :/\n\nBeing desensitized does not entitle you to invalidate or belittle other people's experiences with oppression. Sure, america may be a haven to you compared to what you went through here, but don't look down on the very real injustices the AA community continue to face there.",
                            "author": "iknowwhatiwantbroski",
                            "id": "gtfh2fu",
                            "parent_id": "t1_gtfdkg1",
                            "score": 15,
                            "created_utc": 1617606296.0,
                            "replies": [
                                {
                                    "body": "I never thought of it in that way and your commentary made me stop and think👍",
                                    "author": "Former_Baseball8679",
                                    "id": "gtfh9sl",
                                    "parent_id": "t1_gtfh2fu",
                                    "score": 5,
                                    "created_utc": 1617606493.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or he was just keeping private till he got to know her better. She could probably look him up if she knew his profession and he wasn’t ready to share.",
            "author": null,
            "id": "gtfbcwf",
            "parent_id": "t1_gtf1xn4",
            "score": 0,
            "created_utc": 1617601296.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtfdw58",
                    "parent_id": "t1_gtfbcwf",
                    "score": 12,
                    "created_utc": 1617603453.0,
                    "replies": [
                        {
                            "body": "I think this is a hard one. In 4 months if he had that controlling abusive personality she would have seen it by now. If there’s nothing bad in his behavior then maybe his profession shouldn’t define him. This also means he is getting serious feelings for her...don’t a lot of SDs and SBs not even use their real names for many months?",
                            "author": null,
                            "id": "gtfeg9b",
                            "parent_id": "t1_gtfdw58",
                            "score": -5,
                            "created_utc": 1617603930.0,
                            "replies": [
                                {
                                    "body": "On that same token couldn't he have seen she was a normal young woman and posed no threat to his career by month 2?  I also don't think there are any confirmed stories of young sbs trying to mess with cops in the first place where there is a huge power imbalance to begin with.  I'm not saying she should or shouldn't be with him. All I'm saying if things go south, the last person you'll want to be involved with is a cop, vanilla or otherwise.",
                                    "author": "throwaway6640",
                                    "id": "gtfhw6f",
                                    "parent_id": "t1_gtfeg9b",
                                    "score": 14,
                                    "created_utc": 1617607089.0,
                                    "replies": [
                                        {
                                            "body": "I agree with this.",
                                            "author": null,
                                            "id": "gtfmkgn",
                                            "parent_id": "t1_gtfhw6f",
                                            "score": 1,
                                            "created_utc": 1617611725.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Why do you assume that by 4 months you know someone’s character? One of the most common refrains for people in abusive relationships is that the beginning is SO GOOD. Often abuse doesn’t start until the honeymoon period is over. Or until the woman is pregnant. Or tries to leave. I’m not necessarily talking about OP’s situation, but your basic premise is patently false- and a bit victim blame-y.",
                                    "author": "fashlatebloomer",
                                    "id": "gtfhpfv",
                                    "parent_id": "t1_gtfeg9b",
                                    "score": 9,
                                    "created_utc": 1617606912.0,
                                    "replies": [
                                        {
                                            "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
                                            "author": null,
                                            "id": "gtfmif5",
                                            "parent_id": "t1_gtfhpfv",
                                            "score": -2,
                                            "created_utc": 1617611668.0,
                                            "replies": [
                                                {
                                                    "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                                                    "author": "fashlatebloomer",
                                                    "id": "gtfmvxy",
                                                    "parent_id": "t1_gtfmif5",
                                                    "score": 7,
                                                    "created_utc": 1617612045.0,
                                                    "replies": [
                                                        {
                                                            "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                                                            "author": null,
                                                            "id": "gtfnaop",
                                                            "parent_id": "t1_gtfmvxy",
                                                            "score": 2,
                                                            "created_utc": 1617612457.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah ok, sorry, I clearly missed you saying that you were also iffy about him being in the military as well. \n\nYes, you are under NO obligation to put yourself in unpleasant situations (especially ones that may trigger anxiety or even symptoms that sound like they might be PTSD, which is a clinically recognized condition - I only say this to underline that this isn't just something that's in your head), just to make someone else feel better or ok, or because \"rationally\" there's no reason to feel anxious/scared/upset. As women we often feel like we have to \"deal with\" things, or that something \"isn't a big deal\" and we should just \"get over it\"  etc. No! You want what you want, and you don't want what you don't want, and you should go by THAT! Most men and probably all sugar daddies go by that - they don't entertain anything that they aren't 100% into, regardless of how rational or irrational it is (and many times, it's something completely silly, whereas women tend to feel like they have to put with more significant issues). You do what's best for you. Sugar relationships are supposed to HELP you, not make you feel worse and acquire even more insecurities, anxiety, etc.\n\nAt the end of the day, you are a young beautiful woman with her future ahead of her. This SD is a tiny part of it, and is from the get-go designed to not be a serious part or stable part of your life. Don't do something that might be harmful to you, just to temporarily get some middle-aged dude's rocks off, especially if all you're getting out of it is some mani-pedis and an occasional trip to another state.",
            "author": null,
            "id": "gtglqej",
            "parent_id": "t1_gtgjzhj",
            "score": 3,
            "created_utc": 1617635483.0,
            "replies": []
        },
        {
            "body": "I don’t understand either but it’s not because I’m not black. It’s because where I live more than half the cops are black. The last two mayors were black. The police chief is a black woman. The district attorney is black \n\n( if he was a district attorney would it be different??)\n\nIs this a money thing? \n\nI’m asking not insinuating anything.",
            "author": "Former_Baseball8679",
            "id": "gtfcyt3",
            "parent_id": "t1_gtesys7",
            "score": -2,
            "created_utc": 1617602641.0,
            "replies": [
                {
                    "body": "This is not a money thing, I dont do PPM nor do I get an allowance. Everything I've received is gifts/experiences. Ending this wouldn't impact my life. \n\nIF you dont understand where I am coming from then its 100% because you're not black and I cant make/help you really understand that. \n\nIts not just because he's a cop. I am honestly not crazy about him being in the military, that was something I already have had to come to grips with and learn to be okay with. Government jobs in general are very political and messy and targeting and I'm not a fan. I dont care who's in charge. \n\nJust because someone is black doesnt mean they have my undying support contrary to popular belief. quite honestly even if he was black in this case I would question if I still wanted to date them. That's just my preference. Like I said in the post I wouldn't actively pursue/entertain someone if I knew they were a cop",
                    "author": "synclaireeebby",
                    "id": "gtfi91r",
                    "parent_id": "t1_gtfcyt3",
                    "score": 10,
                    "created_utc": 1617607432.0,
                    "replies": [
                        {
                            "body": "I don’t understand YOUR feelings on cops Bc I’m not black ?\n\nwhat does color have to do with it? That’s very arrogant of you.\n\nNot minimizing but \n\nFrom 2016-2020, in America there were an average of 230 blacks killed by police per year (FBI STATISTICS) and this is total deaths by police. Guilt or innocence has nothing to do w stat.\n\nDo you want to know how many people were killed by police in my country for just ONE YEAR?? In 2019,  close to 5,000 were killed by police. and we are the size of florida. 5,000. And That was a down year. \nTell me again how I won’t understand Bc in not black?",
                            "author": "Former_Baseball8679",
                            "id": "gtfj2a4",
                            "parent_id": "t1_gtfi91r",
                            "score": -2,
                            "created_utc": 1617608230.0,
                            "replies": [
                                {
                                    "body": "I'm sorry you have to experience that in your country. \n\nI still explained myself further down, refer to that for your answer. Black or not I'm not sure I would want to date a cop. plain and simple. Based off your response I'm surprised you dont agree with me and we're going back in forth here.",
                                    "author": "synclaireeebby",
                                    "id": "gtfkzzm",
                                    "parent_id": "t1_gtfj2a4",
                                    "score": 10,
                                    "created_utc": 1617610159.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Prejudice ...it means to prejudge someone.  Its funny all the people saying they hate cops yet when it they are needed say in a case of domestic violence people have a different view.\n\nCops have a vary hard job especially given how poor their pay is.",
            "author": "wb19081908",
            "id": "gtgigcd",
            "parent_id": "t1_gtg82bh",
            "score": -4,
            "created_utc": 1617633921.0,
            "replies": []
        },
        {
            "body": "Thanks for clarifying. Looking up domestic violence stat w cops because of  what reason ? An experience w him? Or are u just trying to find reasons to end it? \n\nThere will always be another one. No one is irreplaceable and the next one won’t hVe the fears concerns you have with this one. \n\n\nself preservation / defense mechanisms keeps things comfortable and can save your life  BUT  it can also keep you from living your greatest one.\n\n\n.You have some thinking to do. \n\nSounds like u just want to be put at ease and have him tell u things gonna be ok and u freaking out Bc of his style of gathering info/ perspective  by\nasking questions instead of a “F That, everything will be ok, it’s me and you and I got you” type  of handling this is what you’d prefer without actually ever thinking that (don’t know if that makes sense)\n\ngood luck. You seem like a sweet person. Gnight",
            "author": "Former_Baseball8679",
            "id": "gtfmwt6",
            "parent_id": "t1_gtfm3lh",
            "score": -3,
            "created_utc": 1617612069.0,
            "replies": []
        },
        {
            "body": "Shows your privilege and arrogance due to being born in a first world country. \n\nI was born in Philippines, in 2018, 5000+ people were killed by police. In 2019, 4890 were killed by police.\n\nIn America, from 2016-2020 an average of 230 blacks were killed by police a year. Guilty or innocent. Not saying it’s right or minimizing anything\n\nI’m sure this is the first time u saw the numbers Bc u just knew how bad you had it in your first world country and no one else can understand how bad u have it lol.",
            "author": "Former_Baseball8679",
            "id": "gtfkc4w",
            "parent_id": "t1_gtfjogj",
            "score": 2,
            "created_utc": 1617609505.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtflcrp",
                    "parent_id": "t1_gtfkc4w",
                    "score": 1,
                    "created_utc": 1617610513.0,
                    "replies": [
                        {
                            "body": "So you think it’s gotten worst here for you since repeal of  Jim Crow laws, desegregation?",
                            "author": "Former_Baseball8679",
                            "id": "gtflew3",
                            "parent_id": "t1_gtflcrp",
                            "score": 2,
                            "created_utc": 1617610571.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gtflje0",
                                    "parent_id": "t1_gtflew3",
                                    "score": 1,
                                    "created_utc": 1617610692.0,
                                    "replies": [
                                        {
                                            "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
                                            "author": "Former_Baseball8679",
                                            "id": "gtflwyw",
                                            "parent_id": "t1_gtflje0",
                                            "score": 2,
                                            "created_utc": 1617611070.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Playing myself? I could not care less what the people who aren’t intelligent enough to read my comment for what it is, rather than get fixated on the “mean words” used like a toddler gets fixated by a shiny toy lol.\n\nClearly you’re in this category - which I think I need to dumb this down a bit and spell it out...I don’t care what you think of my post to the OP.\n\nIn fact, I don’t care what anyone who thinks it’s okay to stereotype people thinks about me.",
            "author": "HotStool",
            "id": "gtgpi3h",
            "parent_id": "t1_gtglxo7",
            "score": -4,
            "created_utc": 1617637178.0,
            "replies": []
        },
        {
            "body": "Yes!!! Exactly! This is not a vanilla relationship nor did they meet on Hinge or some other traditional dating app. Dating a cop is a good start but *how* we met is even more importantly and under *what* premise.  My reaction would have been: No need to ignore the elephant in the room...we know how we met so why does it matter what my family would think? Would your family or friends see you differently if they knew the backstory on how we met? Would your employer see you differently?  \n\nSometimes it’s more than what’s said, it’s what’s not being said.",
            "author": null,
            "id": "gtgovun",
            "parent_id": "t1_gtgaxy7",
            "score": 7,
            "created_utc": 1617636904.0,
            "replies": []
        },
        {
            "body": "I’ve never given merit to someone who justifies their actions and lack of forthcoming with “oh I didn’t know how you would respond”. It’s like a manipulative way of reversing accountability and shifting the issue onto the other person as if they’re (the person who was lied to) not the victim. \n\nPure manipulation, narcissism, and a way to control the situation.\n\nLike I said, ain’t no way I would mess with him. Like HAIL NO 😄",
            "author": null,
            "id": "gtg3vxy",
            "parent_id": "t1_gtg2clm",
            "score": 18,
            "created_utc": 1617626049.0,
            "replies": []
        },
        {
            "body": "You must have missed where he asked her a generic question “would you date a cop”. He wasn’t forthcoming and if he was he wouldn’t have presented the truth in that way. He would have said “I’m a cop. How do you feel about dating me now that you know my real occupation”. He was still being misleading and trying to control the narrative.\n\nPeople need to stop making excuses for liars and manipulators at the expense of their own standards. He has issues so now she’s suppose to accept him and lower her standards to make him feel comfortable? NO.",
            "author": null,
            "id": "gtg4t32",
            "parent_id": "t1_gtg4iyr",
            "score": 14,
            "created_utc": 1617626619.0,
            "replies": []
        },
        {
            "body": "If I were a mod, I’d ban you. No further explanation needed.",
            "author": null,
            "id": "gtglcwy",
            "parent_id": "t1_gtgku62",
            "score": 8,
            "created_utc": 1617635307.0,
            "replies": [
                {
                    "body": "I’m guessing they didn’t make you a mod because you would ban people who are against stereotyping of any kind.\n\nWhat a great stance you have. No further explanation needed.",
                    "author": "HotStool",
                    "id": "gtgovxh",
                    "parent_id": "t1_gtglcwy",
                    "score": -5,
                    "created_utc": 1617636905.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It sounds like you’re being very smart about it by meeting up with him again to gauge how you feel about all of this. It’s your world, continue to own it wisely as you have been. 🙂",
            "author": null,
            "id": "gtgmcv5",
            "parent_id": "t1_gtglw25",
            "score": 6,
            "created_utc": 1617635771.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtghjw4",
            "parent_id": "t1_gtex2pc",
            "score": 10,
            "created_utc": 1617633481.0,
            "replies": []
        },
        {
            "body": "It's pretty easy to imagine not having police who do actually policing, and are only a repressive force. This is the experience of some Asian American and black communities in the USA, for example, where the common sense is to never call the police or to expect support from them.",
            "author": "Distinct-Animal-9628",
            "id": "gtfpvo6",
            "parent_id": "t1_gtex2pc",
            "score": 20,
            "created_utc": 1617615030.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtg6c6u",
            "parent_id": "t1_gtetatv",
            "score": 20,
            "created_utc": 1617627540.0,
            "replies": []
        },
        {
            "body": "Hey, for future reference its probably best not to make analogies where you're comparing the theoretical actions of an ethnic group vs. government employees who commit actual systemic abuse",
            "author": "paddyspubofficial",
            "id": "gtf9qws",
            "parent_id": "t1_gtetatv",
            "score": 29,
            "created_utc": 1617599997.0,
            "replies": [
                {
                    "body": "I have no connection to law enforcement other than having spent a lot of time with them trying to improve part of a Pico Union neighborhood in LA  in the middle of a crack epidemic. The kind of neighborhood where the contractors pulled into the secure garage opened their toolboxes and the first \"tool\" out was a large caliber pistol, the utility workers put on flack vests before climbing poles.  The victims were the young and old of all races, white, black, hispanic and asian . We had LAPD off duty officers working security because without them we could not get people to come to the building. The alley behind the building was filled with large cardboard boxes where crack addicted young women , many under 16 lived while they were pimped out by the gangs - tell me about how drug crimes are victimless crimes. \n\nLaw enforcement is not perfect but it is the last chance for many neighborhoods. So much of what you see on TV is driven by politics.  There's no mention of the thousands of small businesses, often owned by minorities,  that have been destroyed in riots across the nation, the many cities where the police are the thin blue line between civility and tribal anarchy. \n\nPolitics drives much of what you see on TV. Take Ferguson, Obama attacked the officer , the police and virtually incited riots that took lives and destroyed property .  Yet one Friday night after reporters had left for the weekend Obama's DOJ released its official report  finding that   \"Hands Up Don't Shoot never happened, the officer only shot when the \"little boy\"  (6'4\" and 290 pounds) advanced again on the officer whom he had attacked and struggled to get the officer's gun. The report further admitted that many of the \"witnesses\" so beloved by CNN and other networks lied and a number admitted that they were not even at the scene.  But the lies scarred our society and a generation's views of the police were moulded through a deliberately false story.  \n\nIf you look at 20 years of records for the 10 million people living in Los Angeles County (LA Times murder report)  a black homicide was less likely to have had any police involvement than a white homicide. What does stand out is the vast disparity in murder rates between races, especially among males.  The briefest review of FBI national crime stats also shows a huge disparity between the murder rates.  Tragically a young black man is probably 6 times more likely to die a violent death than a white male of similar age.  Instead of using fabricated events to divide America (and members of the sugar communities) we should be seeking common ground through looking at reality and asking what needs to be done.",
                    "author": "pinotandsugar",
                    "id": "gtgyls0",
                    "parent_id": "t1_gtf9qws",
                    "score": -8,
                    "created_utc": 1617641288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m from the Philippines.\n\nFBI statistics is my source for police involved homicides in the us by race.  And then i used third grade math and figured out who the president was during the years it was high and who president was during the years it was lower\n\nAs far as the amount of coverage, I don’t have a source. but We both know the coverage spiked during election year while killings did not.\n\nNot trying to argue or debate with you. \n\nYour entitled to your feelings and to debate you (or anyone else) on your feelings is like trying to debate my wife on whether or not she had an orgasm.",
            "author": "Former_Baseball8679",
            "id": "gtfdkg1",
            "parent_id": "t1_gtfd4bk",
            "score": -6,
            "created_utc": 1617603167.0,
            "replies": [
                {
                    "body": "Bruh don't bring the Philippines down like that :/\n\nBeing desensitized does not entitle you to invalidate or belittle other people's experiences with oppression. Sure, america may be a haven to you compared to what you went through here, but don't look down on the very real injustices the AA community continue to face there.",
                    "author": "iknowwhatiwantbroski",
                    "id": "gtfh2fu",
                    "parent_id": "t1_gtfdkg1",
                    "score": 15,
                    "created_utc": 1617606296.0,
                    "replies": [
                        {
                            "body": "I never thought of it in that way and your commentary made me stop and think👍",
                            "author": "Former_Baseball8679",
                            "id": "gtfh9sl",
                            "parent_id": "t1_gtfh2fu",
                            "score": 5,
                            "created_utc": 1617606493.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtfdw58",
            "parent_id": "t1_gtfbcwf",
            "score": 12,
            "created_utc": 1617603453.0,
            "replies": [
                {
                    "body": "I think this is a hard one. In 4 months if he had that controlling abusive personality she would have seen it by now. If there’s nothing bad in his behavior then maybe his profession shouldn’t define him. This also means he is getting serious feelings for her...don’t a lot of SDs and SBs not even use their real names for many months?",
                    "author": null,
                    "id": "gtfeg9b",
                    "parent_id": "t1_gtfdw58",
                    "score": -5,
                    "created_utc": 1617603930.0,
                    "replies": [
                        {
                            "body": "On that same token couldn't he have seen she was a normal young woman and posed no threat to his career by month 2?  I also don't think there are any confirmed stories of young sbs trying to mess with cops in the first place where there is a huge power imbalance to begin with.  I'm not saying she should or shouldn't be with him. All I'm saying if things go south, the last person you'll want to be involved with is a cop, vanilla or otherwise.",
                            "author": "throwaway6640",
                            "id": "gtfhw6f",
                            "parent_id": "t1_gtfeg9b",
                            "score": 14,
                            "created_utc": 1617607089.0,
                            "replies": [
                                {
                                    "body": "I agree with this.",
                                    "author": null,
                                    "id": "gtfmkgn",
                                    "parent_id": "t1_gtfhw6f",
                                    "score": 1,
                                    "created_utc": 1617611725.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Why do you assume that by 4 months you know someone’s character? One of the most common refrains for people in abusive relationships is that the beginning is SO GOOD. Often abuse doesn’t start until the honeymoon period is over. Or until the woman is pregnant. Or tries to leave. I’m not necessarily talking about OP’s situation, but your basic premise is patently false- and a bit victim blame-y.",
                            "author": "fashlatebloomer",
                            "id": "gtfhpfv",
                            "parent_id": "t1_gtfeg9b",
                            "score": 9,
                            "created_utc": 1617606912.0,
                            "replies": [
                                {
                                    "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
                                    "author": null,
                                    "id": "gtfmif5",
                                    "parent_id": "t1_gtfhpfv",
                                    "score": -2,
                                    "created_utc": 1617611668.0,
                                    "replies": [
                                        {
                                            "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                                            "author": "fashlatebloomer",
                                            "id": "gtfmvxy",
                                            "parent_id": "t1_gtfmif5",
                                            "score": 7,
                                            "created_utc": 1617612045.0,
                                            "replies": [
                                                {
                                                    "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                                                    "author": null,
                                                    "id": "gtfnaop",
                                                    "parent_id": "t1_gtfmvxy",
                                                    "score": 2,
                                                    "created_utc": 1617612457.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is not a money thing, I dont do PPM nor do I get an allowance. Everything I've received is gifts/experiences. Ending this wouldn't impact my life. \n\nIF you dont understand where I am coming from then its 100% because you're not black and I cant make/help you really understand that. \n\nIts not just because he's a cop. I am honestly not crazy about him being in the military, that was something I already have had to come to grips with and learn to be okay with. Government jobs in general are very political and messy and targeting and I'm not a fan. I dont care who's in charge. \n\nJust because someone is black doesnt mean they have my undying support contrary to popular belief. quite honestly even if he was black in this case I would question if I still wanted to date them. That's just my preference. Like I said in the post I wouldn't actively pursue/entertain someone if I knew they were a cop",
            "author": "synclaireeebby",
            "id": "gtfi91r",
            "parent_id": "t1_gtfcyt3",
            "score": 10,
            "created_utc": 1617607432.0,
            "replies": [
                {
                    "body": "I don’t understand YOUR feelings on cops Bc I’m not black ?\n\nwhat does color have to do with it? That’s very arrogant of you.\n\nNot minimizing but \n\nFrom 2016-2020, in America there were an average of 230 blacks killed by police per year (FBI STATISTICS) and this is total deaths by police. Guilt or innocence has nothing to do w stat.\n\nDo you want to know how many people were killed by police in my country for just ONE YEAR?? In 2019,  close to 5,000 were killed by police. and we are the size of florida. 5,000. And That was a down year. \nTell me again how I won’t understand Bc in not black?",
                    "author": "Former_Baseball8679",
                    "id": "gtfj2a4",
                    "parent_id": "t1_gtfi91r",
                    "score": -2,
                    "created_utc": 1617608230.0,
                    "replies": [
                        {
                            "body": "I'm sorry you have to experience that in your country. \n\nI still explained myself further down, refer to that for your answer. Black or not I'm not sure I would want to date a cop. plain and simple. Based off your response I'm surprised you dont agree with me and we're going back in forth here.",
                            "author": "synclaireeebby",
                            "id": "gtfkzzm",
                            "parent_id": "t1_gtfj2a4",
                            "score": 10,
                            "created_utc": 1617610159.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtflcrp",
            "parent_id": "t1_gtfkc4w",
            "score": 1,
            "created_utc": 1617610513.0,
            "replies": [
                {
                    "body": "So you think it’s gotten worst here for you since repeal of  Jim Crow laws, desegregation?",
                    "author": "Former_Baseball8679",
                    "id": "gtflew3",
                    "parent_id": "t1_gtflcrp",
                    "score": 2,
                    "created_utc": 1617610571.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gtflje0",
                            "parent_id": "t1_gtflew3",
                            "score": 1,
                            "created_utc": 1617610692.0,
                            "replies": [
                                {
                                    "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
                                    "author": "Former_Baseball8679",
                                    "id": "gtflwyw",
                                    "parent_id": "t1_gtflje0",
                                    "score": 2,
                                    "created_utc": 1617611070.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m guessing they didn’t make you a mod because you would ban people who are against stereotyping of any kind.\n\nWhat a great stance you have. No further explanation needed.",
            "author": "HotStool",
            "id": "gtgovxh",
            "parent_id": "t1_gtglcwy",
            "score": -5,
            "created_utc": 1617636905.0,
            "replies": []
        },
        {
            "body": "I have no connection to law enforcement other than having spent a lot of time with them trying to improve part of a Pico Union neighborhood in LA  in the middle of a crack epidemic. The kind of neighborhood where the contractors pulled into the secure garage opened their toolboxes and the first \"tool\" out was a large caliber pistol, the utility workers put on flack vests before climbing poles.  The victims were the young and old of all races, white, black, hispanic and asian . We had LAPD off duty officers working security because without them we could not get people to come to the building. The alley behind the building was filled with large cardboard boxes where crack addicted young women , many under 16 lived while they were pimped out by the gangs - tell me about how drug crimes are victimless crimes. \n\nLaw enforcement is not perfect but it is the last chance for many neighborhoods. So much of what you see on TV is driven by politics.  There's no mention of the thousands of small businesses, often owned by minorities,  that have been destroyed in riots across the nation, the many cities where the police are the thin blue line between civility and tribal anarchy. \n\nPolitics drives much of what you see on TV. Take Ferguson, Obama attacked the officer , the police and virtually incited riots that took lives and destroyed property .  Yet one Friday night after reporters had left for the weekend Obama's DOJ released its official report  finding that   \"Hands Up Don't Shoot never happened, the officer only shot when the \"little boy\"  (6'4\" and 290 pounds) advanced again on the officer whom he had attacked and struggled to get the officer's gun. The report further admitted that many of the \"witnesses\" so beloved by CNN and other networks lied and a number admitted that they were not even at the scene.  But the lies scarred our society and a generation's views of the police were moulded through a deliberately false story.  \n\nIf you look at 20 years of records for the 10 million people living in Los Angeles County (LA Times murder report)  a black homicide was less likely to have had any police involvement than a white homicide. What does stand out is the vast disparity in murder rates between races, especially among males.  The briefest review of FBI national crime stats also shows a huge disparity between the murder rates.  Tragically a young black man is probably 6 times more likely to die a violent death than a white male of similar age.  Instead of using fabricated events to divide America (and members of the sugar communities) we should be seeking common ground through looking at reality and asking what needs to be done.",
            "author": "pinotandsugar",
            "id": "gtgyls0",
            "parent_id": "t1_gtf9qws",
            "score": -8,
            "created_utc": 1617641288.0,
            "replies": []
        },
        {
            "body": "Bruh don't bring the Philippines down like that :/\n\nBeing desensitized does not entitle you to invalidate or belittle other people's experiences with oppression. Sure, america may be a haven to you compared to what you went through here, but don't look down on the very real injustices the AA community continue to face there.",
            "author": "iknowwhatiwantbroski",
            "id": "gtfh2fu",
            "parent_id": "t1_gtfdkg1",
            "score": 15,
            "created_utc": 1617606296.0,
            "replies": [
                {
                    "body": "I never thought of it in that way and your commentary made me stop and think👍",
                    "author": "Former_Baseball8679",
                    "id": "gtfh9sl",
                    "parent_id": "t1_gtfh2fu",
                    "score": 5,
                    "created_utc": 1617606493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is a hard one. In 4 months if he had that controlling abusive personality she would have seen it by now. If there’s nothing bad in his behavior then maybe his profession shouldn’t define him. This also means he is getting serious feelings for her...don’t a lot of SDs and SBs not even use their real names for many months?",
            "author": null,
            "id": "gtfeg9b",
            "parent_id": "t1_gtfdw58",
            "score": -5,
            "created_utc": 1617603930.0,
            "replies": [
                {
                    "body": "On that same token couldn't he have seen she was a normal young woman and posed no threat to his career by month 2?  I also don't think there are any confirmed stories of young sbs trying to mess with cops in the first place where there is a huge power imbalance to begin with.  I'm not saying she should or shouldn't be with him. All I'm saying if things go south, the last person you'll want to be involved with is a cop, vanilla or otherwise.",
                    "author": "throwaway6640",
                    "id": "gtfhw6f",
                    "parent_id": "t1_gtfeg9b",
                    "score": 14,
                    "created_utc": 1617607089.0,
                    "replies": [
                        {
                            "body": "I agree with this.",
                            "author": null,
                            "id": "gtfmkgn",
                            "parent_id": "t1_gtfhw6f",
                            "score": 1,
                            "created_utc": 1617611725.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why do you assume that by 4 months you know someone’s character? One of the most common refrains for people in abusive relationships is that the beginning is SO GOOD. Often abuse doesn’t start until the honeymoon period is over. Or until the woman is pregnant. Or tries to leave. I’m not necessarily talking about OP’s situation, but your basic premise is patently false- and a bit victim blame-y.",
                    "author": "fashlatebloomer",
                    "id": "gtfhpfv",
                    "parent_id": "t1_gtfeg9b",
                    "score": 9,
                    "created_utc": 1617606912.0,
                    "replies": [
                        {
                            "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
                            "author": null,
                            "id": "gtfmif5",
                            "parent_id": "t1_gtfhpfv",
                            "score": -2,
                            "created_utc": 1617611668.0,
                            "replies": [
                                {
                                    "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                                    "author": "fashlatebloomer",
                                    "id": "gtfmvxy",
                                    "parent_id": "t1_gtfmif5",
                                    "score": 7,
                                    "created_utc": 1617612045.0,
                                    "replies": [
                                        {
                                            "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                                            "author": null,
                                            "id": "gtfnaop",
                                            "parent_id": "t1_gtfmvxy",
                                            "score": 2,
                                            "created_utc": 1617612457.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t understand YOUR feelings on cops Bc I’m not black ?\n\nwhat does color have to do with it? That’s very arrogant of you.\n\nNot minimizing but \n\nFrom 2016-2020, in America there were an average of 230 blacks killed by police per year (FBI STATISTICS) and this is total deaths by police. Guilt or innocence has nothing to do w stat.\n\nDo you want to know how many people were killed by police in my country for just ONE YEAR?? In 2019,  close to 5,000 were killed by police. and we are the size of florida. 5,000. And That was a down year. \nTell me again how I won’t understand Bc in not black?",
            "author": "Former_Baseball8679",
            "id": "gtfj2a4",
            "parent_id": "t1_gtfi91r",
            "score": -2,
            "created_utc": 1617608230.0,
            "replies": [
                {
                    "body": "I'm sorry you have to experience that in your country. \n\nI still explained myself further down, refer to that for your answer. Black or not I'm not sure I would want to date a cop. plain and simple. Based off your response I'm surprised you dont agree with me and we're going back in forth here.",
                    "author": "synclaireeebby",
                    "id": "gtfkzzm",
                    "parent_id": "t1_gtfj2a4",
                    "score": 10,
                    "created_utc": 1617610159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So you think it’s gotten worst here for you since repeal of  Jim Crow laws, desegregation?",
            "author": "Former_Baseball8679",
            "id": "gtflew3",
            "parent_id": "t1_gtflcrp",
            "score": 2,
            "created_utc": 1617610571.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gtflje0",
                    "parent_id": "t1_gtflew3",
                    "score": 1,
                    "created_utc": 1617610692.0,
                    "replies": [
                        {
                            "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
                            "author": "Former_Baseball8679",
                            "id": "gtflwyw",
                            "parent_id": "t1_gtflje0",
                            "score": 2,
                            "created_utc": 1617611070.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never thought of it in that way and your commentary made me stop and think👍",
            "author": "Former_Baseball8679",
            "id": "gtfh9sl",
            "parent_id": "t1_gtfh2fu",
            "score": 5,
            "created_utc": 1617606493.0,
            "replies": []
        },
        {
            "body": "On that same token couldn't he have seen she was a normal young woman and posed no threat to his career by month 2?  I also don't think there are any confirmed stories of young sbs trying to mess with cops in the first place where there is a huge power imbalance to begin with.  I'm not saying she should or shouldn't be with him. All I'm saying if things go south, the last person you'll want to be involved with is a cop, vanilla or otherwise.",
            "author": "throwaway6640",
            "id": "gtfhw6f",
            "parent_id": "t1_gtfeg9b",
            "score": 14,
            "created_utc": 1617607089.0,
            "replies": [
                {
                    "body": "I agree with this.",
                    "author": null,
                    "id": "gtfmkgn",
                    "parent_id": "t1_gtfhw6f",
                    "score": 1,
                    "created_utc": 1617611725.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why do you assume that by 4 months you know someone’s character? One of the most common refrains for people in abusive relationships is that the beginning is SO GOOD. Often abuse doesn’t start until the honeymoon period is over. Or until the woman is pregnant. Or tries to leave. I’m not necessarily talking about OP’s situation, but your basic premise is patently false- and a bit victim blame-y.",
            "author": "fashlatebloomer",
            "id": "gtfhpfv",
            "parent_id": "t1_gtfeg9b",
            "score": 9,
            "created_utc": 1617606912.0,
            "replies": [
                {
                    "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
                    "author": null,
                    "id": "gtfmif5",
                    "parent_id": "t1_gtfhpfv",
                    "score": -2,
                    "created_utc": 1617611668.0,
                    "replies": [
                        {
                            "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                            "author": "fashlatebloomer",
                            "id": "gtfmvxy",
                            "parent_id": "t1_gtfmif5",
                            "score": 7,
                            "created_utc": 1617612045.0,
                            "replies": [
                                {
                                    "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                                    "author": null,
                                    "id": "gtfnaop",
                                    "parent_id": "t1_gtfmvxy",
                                    "score": 2,
                                    "created_utc": 1617612457.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sorry you have to experience that in your country. \n\nI still explained myself further down, refer to that for your answer. Black or not I'm not sure I would want to date a cop. plain and simple. Based off your response I'm surprised you dont agree with me and we're going back in forth here.",
            "author": "synclaireeebby",
            "id": "gtfkzzm",
            "parent_id": "t1_gtfj2a4",
            "score": 10,
            "created_utc": 1617610159.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gtflje0",
            "parent_id": "t1_gtflew3",
            "score": 1,
            "created_utc": 1617610692.0,
            "replies": [
                {
                    "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
                    "author": "Former_Baseball8679",
                    "id": "gtflwyw",
                    "parent_id": "t1_gtflje0",
                    "score": 2,
                    "created_utc": 1617611070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with this.",
            "author": null,
            "id": "gtfmkgn",
            "parent_id": "t1_gtfhw6f",
            "score": 1,
            "created_utc": 1617611725.0,
            "replies": []
        },
        {
            "body": "What victim? What are you talking about? I’ve been in relationships like that before and they usually show their colors after a month or two and there are usually red flags before that...but we don’t know anything about this man and as of right now op is not a victim of anything. My only point about the 4 months is that his profession doesn’t make him a bad person and if his behavior hasn’t shown anything negative there’s no reason to assume he will be down the line, at least not any more than any other person in a relationship",
            "author": null,
            "id": "gtfmif5",
            "parent_id": "t1_gtfhpfv",
            "score": -2,
            "created_utc": 1617611668.0,
            "replies": [
                {
                    "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
                    "author": "fashlatebloomer",
                    "id": "gtfmvxy",
                    "parent_id": "t1_gtfmif5",
                    "score": 7,
                    "created_utc": 1617612045.0,
                    "replies": [
                        {
                            "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                            "author": null,
                            "id": "gtfnaop",
                            "parent_id": "t1_gtfmvxy",
                            "score": 2,
                            "created_utc": 1617612457.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Black president and black female Vice President are great achievements.\n\nWe can disagree but this 9 minute on neck comment is so dangerous to believe. Because you basically say you believe that there is a faceless, nameless group that run the system that is out to get you. Specially if I was a young black kid and I believed that.\n\n\n\nAnd it’s  funny U say u don’t want to turn country like mines (I’m American now) but For accuracy, the reason for all these homicides by police was Bc wanting to be like America - and was actually invented in America. It’s called the war on drugs. \n\nHave a good night. Sorry to hi jack \n\nGood luck",
            "author": "Former_Baseball8679",
            "id": "gtflwyw",
            "parent_id": "t1_gtflje0",
            "score": 2,
            "created_utc": 1617611070.0,
            "replies": []
        },
        {
            "body": "My point was just that controlling, abusive people don’t always show their hands at the beginning of a relationship. That’s how they gain control- they lure the other party into a false sense of security. Your own experience is of course valid, but it’s not universal. And I argue lying for the first 4 months of a relationship is a red flag/ control tactic because he knew that OP wouldn’t agree to date him otherwise.",
            "author": "fashlatebloomer",
            "id": "gtfmvxy",
            "parent_id": "t1_gtfmif5",
            "score": 7,
            "created_utc": 1617612045.0,
            "replies": [
                {
                    "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
                    "author": null,
                    "id": "gtfnaop",
                    "parent_id": "t1_gtfmvxy",
                    "score": 2,
                    "created_utc": 1617612457.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s the part I struggle with. In general I agree with you hiding personal info is a red flag, but with today’s climate cops aren’t viewed objectively so he had a reason to want her to know him as a person first without being prejudiced against him because of his career. It’s not like he hid 20 children or something like that.",
            "author": null,
            "id": "gtfnaop",
            "parent_id": "t1_gtfmvxy",
            "score": 2,
            "created_utc": 1617612457.0,
            "replies": []
        }
    ]
}