{
    "title": "On STD testing under age 30 that no one talks about (and your SD is probably clueless about too)",
    "post_id": "je3gh1",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/je3gh1/on_std_testing_under_age_30_that_no_one_talks/",
    "author": "EvaExquisite",
    "body": "I recently got my first pap smear as a 30-something and found out that apparently doctors don't test for HPV until after you turn 30. I initially told her no need because I had the Gardasil vaccine in my teens and she replied that yes, while it blocks the most common ones it doesn't block all high risk strains. That seems like a big freaking deal, so I asked her why I haven't been tested for HPV before then. She told me it's typical for strains of HPV to clear up on its own within 1 to 2 years so they never bother testing 20-somethings other than to see if your pap smear is normal.\n\nA normal pap smear doesn't mean you're HPV negative though. It just means it hasn't evolved into cervical cancer or something indicating it might yet. You can have a normal pap smear and still be HPV positive. I asked her about testing for men (thinking my exes or clients and the likes would have told me) and she said it's wildly inaccurate for men unfortunately and there's other ways to get it other than intercourse.\n\nIdk about you, but this new information scared the shit out of me. My ex SD's primary partner (whom he dated while seeing me) had cervical cancer a year ago. I never made the connection that I might have something too until this all came up. Talking with him about this, it didn't even occur to him to tell me that I should consider looking into testing or that I also might have HPV. It didn't even register that I was also at risk until I called him asking about his partner and such.\n\nThink about the number of times SD's have asked you for bareback, probably saying they're clean but not knowing that they might not be. Think about if YOU might be positive and not know it yet because our medical system doesn't test young women for it below 30 years old. Think about how easy it is to contract HPV, not just with bare sex but even simply rubbing on the outside of our genitals (something that I find so many people like doing but that still transmits disease btw). Think about the heavy risk your married SD might be making for their wife... Because you're in your 20's and can probably clear it easily, but high risk strains could become cervical cancer for her. Or the next person your SD dates that's immunocompromised.\n\nAnd, much like my ex SD, think about the other risks he might have known about but didn't think it was important to tell you.\n\nSafe sex is a gift for you, your sugar daddy, and whomever else they're sexually active with. If they can't handle condoms because it's uncomfortable, they're really saying \"I prioritize my pleasure over your health.\"\n\nThank you for coming to my TED Talk.\n\nEDIT: Thank you angry men in my DM's that are calling me a dumb money grabbing bitch that no one cares about. I put this up to inform women AND men of the risks they take to forego safe sex so they can make a better decision in their relationships. I did this to pass on the medical info that not everyone gets before they're 30 because most women won't talk to their doctors as much as I do and I strive to understand my health more each time I go.\n\nAlso my ex SD and his primary have been super supportive and want to hear back on results once I get them. His primary (whom I'm also friends with) gave him sooo much crap for not taking the lead on telling other partners about what they should do on their end while she was busy kicking the shit out of cancer, so I do feel this was more of an oversight through a dark time in their lives, albeit a grossly neglectful one on my ex SD's part. Despite it all, I do feel supported and cared for by both of them.\n\nEDIT2: The fact that so many of you are arguing that condoms don't 100% prevent HPV as if it's a valid reason not to wear condoms is appalling and disturbing. The fact that so many of you still cling to the idea that it doesn't matter and still put women at risk for so many things in the name of feeling better during sex is terrifying. If you are thinking this, that is literally why I made this post to begin with yo very clearly explain that you are risking more for everyone other than just your own comfort.\n\nEDIT3: Talking with someone here and with my doctor, the gap concern is in HPV vaccines getting updated. In 2014 they came out with a new HPV vaccine that covers many more of the high risk strains. If you had the HPV shot (Gardasil) prior to then but not another one afterwards, you might be at risk and should consider asking your doctor about getting the other dose. As someone mentioned below, you can get this vaccine anytime before the age of 45.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/je3gh1/on_std_testing_under_age_30_that_no_one_talks/",
    "score": 156,
    "upvote_ratio": 0.97,
    "created_utc": 1603120409.0,
    "num_comments": 84,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "THIS !!!!!!!!!!!!! \n\nhad the same appointment as you- had the same reaction as you did & became even safer. Thank you for posting this ! \n\nAlways put yourself and your health first - no SD is worth the risk",
            "author": "checkmeowtpapillon",
            "id": "g9d4i5w",
            "parent_id": "t3_je3gh1",
            "score": 38,
            "created_utc": 1603139150.0,
            "replies": [
                {
                    "body": "Ok but what’s this about testing for HPV after 30? That’s kind of weird. \n\nI’d imagine this is because people over 30 are more likely to be in stable relationships and are less likely to  have been vaccinated.",
                    "author": "ifisch",
                    "id": "g9d7ve2",
                    "parent_id": "t1_g9d4i5w",
                    "score": 4,
                    "created_utc": 1603140820.0,
                    "replies": [
                        {
                            "body": "It's because young people's immune system clears HPV fairly easily.\n\nCancer arises when HPV is not cleared quickly, the viral-infected cells mutate and mutate and eventually (can) turn into cancer.\n\nAs people age, their immune system changes and is not able to so easily clear HPV, and infections last longer and are more likely to turn into cancer.\n\nThat said, there are cases of cervical cancer in very young women.  The statistics aren't perfect.  That, however, is the rationale for not testing <30 as far as I am aware.",
                            "author": "tosler",
                            "id": "g9e262r",
                            "parent_id": "t1_g9d7ve2",
                            "score": 9,
                            "created_utc": 1603157252.0,
                            "replies": []
                        },
                        {
                            "body": "I thought it weird too because, previous to pursuing SD's, I was in various poly relationships in my early 20's and I was VERY open about this with my doctor so that she would order the right tests for me. It's certainly concerning but from what I gathered, it seems it's based on early relationship exposure: you're likely to contract it when younger, but your immune system is likely to clear it before it's a problem. You DO build an immunity to many of these strains once they're cleared, so if your body's just doing that on its own and not causing anything else of concern why test it? At least, that's probably how medical provider look at it on an individual level, not a multiple partners to think about level.",
                            "author": "EvaExquisite",
                            "id": "g9dkdp8",
                            "parent_id": "t1_g9d7ve2",
                            "score": 1,
                            "created_utc": 1603147272.0,
                            "replies": [
                                {
                                    "body": "I've had irregular pap smears since I was 25, two that have ended in colposcopies and then cleared themselves up. You know what's NOT fun? Colposcopies. They pinch off a piece of your cervix to test and that hurts, and then they put something on it to keep it clean and that sloughs off you eventually in a way that looks like a small grey alien slithered out of you and into your underwear. \n\nThis year, at 31, I had an ovarian cancer scare. Everything is fine, thank goodness, but ladies - you HAVE to look out for yourself. My SBF at the time of the colposcopy was great, but didn't understand the feelings I had about it. \n\nMedical providers know they'll have to fight insurance for abnormal tests, and at least I never learned what strain I had, so unless the big bad medical associations and CDC change their reccomendations for it, testing won't change. Be your own best advocate.",
                                    "author": "secretactorian",
                                    "id": "g9e8ezn",
                                    "parent_id": "t1_g9dkdp8",
                                    "score": 5,
                                    "created_utc": 1603160863.0,
                                    "replies": [
                                        {
                                            "body": "My fiance had to do those regularly (biannually maybe? that was a long time ago) having survived vaginal cancer before we met.  She was tougher than nails, and I don't think she was honest about just how rough those days were.",
                                            "author": "RustStainRemover",
                                            "id": "g9f8r58",
                                            "parent_id": "t1_g9e8ezn",
                                            "score": 2,
                                            "created_utc": 1603193492.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yea. Cervical cancer is also the kindof thing that doesnt' really \"sneak up\" on you. \n\nIf you're getting regular pap smears, that's probably a lot more useful than an HPV test.",
                                    "author": "ifisch",
                                    "id": "g9dnoml",
                                    "parent_id": "t1_g9dkdp8",
                                    "score": 1,
                                    "created_utc": 1603149079.0,
                                    "replies": [
                                        {
                                            "body": "The first part of that second sentence bears repeating:\n\nGET REGULAR PAP SMEARS!",
                                            "author": "EvaExquisite",
                                            "id": "g9dnuxe",
                                            "parent_id": "t1_g9dnoml",
                                            "score": 5,
                                            "created_utc": 1603149178.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My mom died from cervical cancer at 41.\n\nThis is true. HPV is not a part of a standard STD panel and men rarely show any symptoms. Fortunately, there are often signs and symptoms of cervical dysplasia (bleeding or pain during sex, abnormal discharge...) that can be addressed prior to it progressing into cervical cancer. \n\nIf you’re having sex, you need to keep up with your sexual health. If something seems off, go to the doctor. Don’t wait.\n\nTake care of yourselves, ladies.",
            "author": "cleanevergreen",
            "id": "g9dtzo9",
            "parent_id": "t3_je3gh1",
            "score": 16,
            "created_utc": 1603152592.0,
            "replies": []
        },
        {
            "body": "To further bum everyone out, HPV is also causing a huge uptick in throat cancer in men.    I think I watched a program with Dr. Drew and he said that it is going to be an epidemic when the millennials reach their 50s.   Don't remember why he said this.",
            "author": "catfarts99",
            "id": "g9dr7xd",
            "parent_id": "t3_je3gh1",
            "score": 9,
            "created_utc": 1603151034.0,
            "replies": [
                {
                    "body": "[**5% of ALL cancers are caused by high-risk HPV.**](https://www.cancer.gov/about-cancer/causes-prevention/risk/infectious-agents/hpv-and-cancer#cancers-caused)  That includes cervical, penile, vaginal, vulvar, anal, and oropharyngeal (throat) cancers.\n\nPeople don't take HPV seriously enough at all.  \n\nIf anyone has the money to sugar, they absolutely have the money to get the new 9-valent Gardasil HPV vaccine even if their insurance might not pay for it.",
                    "author": "sweeterthan_",
                    "id": "g9kdkyg",
                    "parent_id": "t1_g9dr7xd",
                    "score": 6,
                    "created_utc": 1603304501.0,
                    "replies": [
                        {
                            "body": "Are they letting adult males get it yet?  I have tried to get it but they wouldn't give it to me because of my age.",
                            "author": "catfarts99",
                            "id": "g9krt4v",
                            "parent_id": "t1_g9kdkyg",
                            "score": 1,
                            "created_utc": 1603311305.0,
                            "replies": [
                                {
                                    "body": "Older people have always been *allowed* to get it, it just isn't routinely offered because, from a public health perspective, it's more effective to vaccinate young people, and there's a constant global shortage of the vaccine.  That, and that insurances don't want to cover the cost.  (It's about 100/shot USD wholesale, plus there's the cost for administering it.)\n\nHowever, older people with compromised immune systems are sometimes given it to prevent warts on other parts of the body.  (There's some cross-protection for other strains of HPV.)  The only reason someone should not get it is if they have an allergy to the ingredients or Guillaine-Barré",
                                    "author": "sweeterthan_",
                                    "id": "g9kuuia",
                                    "parent_id": "t1_g9krt4v",
                                    "score": 2,
                                    "created_utc": 1603312761.0,
                                    "replies": [
                                        {
                                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                            "author": "AutoModerator",
                                            "id": "g9kv4t0",
                                            "parent_id": "t1_g9kuuia",
                                            "score": 0,
                                            "created_utc": 1603312900.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g9eqxvx",
                    "parent_id": "t1_g9dr7xd",
                    "score": 1,
                    "created_utc": 1603174498.0,
                    "replies": [
                        {
                            "body": "basically, yes.    My friend got throat cancer and the doctor told him that some people are more susceptible to HPV giving them cancer.    So its a genetic crap shoot kind of plus it depend on the specific strain too.   Micheal Douglas got throat cancer from HPV he claims.",
                            "author": "catfarts99",
                            "id": "g9erl84",
                            "parent_id": "t1_g9eqxvx",
                            "score": 2,
                            "created_utc": 1603175122.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for posting this!\n\nAn abnormal pap = Hpv.  It shows abnormal cells, you get that scraped/biopsied (I forget the procedure name). It will tell you if they are pre cancerous or cancerous. \n\nI had it even after gardisil. Worst sex of my life at 19 (no joke! Super weird short scattered rhythm, no foreplay, came almost immediately). They scraped the cells and it was abnormal, not even pre cancerous.  I did a pap every 6 months until they cleared. They do say after you've cleared it, it is only recommended every 3 years. But being sexually active, I still test every year. And more reg. STDs tests more than that.\n\nThe main cause of cervical cancer IS hpv, but it only gets deadly if it goes untreated and undetected for years.  A friends mom died from Hpv because her husband cheated on her and she never got tested during those years. :(\n\nAnd you're absolutely correct in your statement about the shit message that is blared out when men ask for BB. Nope!! Not even worth it to me. No amount of $ is going to make getting an incurable STD worth  it. Never trust when someone stresses that they're safe, and don't opt out of condoms due to pressure, especially it you don't want to. Every man who told me they couldn't come with one.. guess what! They always came at least at least once :) get the thinnest condoms you can and use a sea of lube under and over the condom. If they are a bitch who says they can't maintain an erection with a condom on, just get a cock ring.",
            "author": "kimchi_Queen",
            "id": "g9f0gks",
            "parent_id": "t3_je3gh1",
            "score": 9,
            "created_utc": 1603184675.0,
            "replies": []
        },
        {
            "body": "WTF is with the hateful DMs? This seems like a heartfelt PSA and while opinions may vary, why is it worthy of vile messages? I don't know the OP at all, but that kind of harassment is uncalled for.",
            "author": "Intrepid_Seeker",
            "id": "g9dlkkn",
            "parent_id": "t3_je3gh1",
            "score": 16,
            "created_utc": 1603147923.0,
            "replies": []
        },
        {
            "body": "This! Safe sex is fine, safer sex is better.",
            "author": "curly_spice",
            "id": "g9bzrz8",
            "parent_id": "t3_je3gh1",
            "score": 13,
            "created_utc": 1603120593.0,
            "replies": [
                {
                    "body": "What do you define as safer sex?",
                    "author": "EvaExquisite",
                    "id": "g9c41q5",
                    "parent_id": "t1_g9bzrz8",
                    "score": 1,
                    "created_utc": 1603122432.0,
                    "replies": [
                        {
                            "body": "Safer sex to me means having open communication about health risks, STDs, protection, etc. and making smart choices. Basically what you wrote about here.",
                            "author": "curly_spice",
                            "id": "g9c66c7",
                            "parent_id": "t1_g9c41q5",
                            "score": 14,
                            "created_utc": 1603123321.0,
                            "replies": [
                                {
                                    "body": "Perfect! Yes this should not just be a \"Don't worry, I'm clean\" conversation. Talks about STD's should be normalized.",
                                    "author": "EvaExquisite",
                                    "id": "g9c7o1s",
                                    "parent_id": "t1_g9c66c7",
                                    "score": 8,
                                    "created_utc": 1603123985.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That last paragraph....definitely!!!!  I'm sorry, I will not go without a condom in any relationship.  People cheat all the time, why would you assume you are the only they are sleeping with?  And how many partners do their other partners have??  Getting tested regularly is great but I'm still going to do what I can to protect myself.  And if that mean I get passed by, so be it.  My health means more to me than this.",
            "author": "Occasional_Grlfriend",
            "id": "g9c5407",
            "parent_id": "t3_je3gh1",
            "score": 13,
            "created_utc": 1603122882.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g9dyr7x",
                    "parent_id": "t1_g9c5407",
                    "score": 3,
                    "created_utc": 1603155297.0,
                    "replies": [
                        {
                            "body": "I see one person at a time and will go LONG stretches in between relationships.   My livelihood is not from sugaring.  I don't always need an SD or to be in an SR.  But, I am not so naive to believe that I am the only one he is with.  If he travels, I assume he has a girl each place he travels to.  So, when I am im a relationship,  I will do everything I can to protect myself and if that means the relationship will end, so be it.  I won't lose sleep and my bills will still get paid.",
                            "author": "Occasional_Grlfriend",
                            "id": "g9ei43x",
                            "parent_id": "t1_g9dyr7x",
                            "score": 3,
                            "created_utc": 1603167153.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "With that said.......I know NOBODY IRL RELATONSHIPS that uses condoms with any regularity that is sorta weird.",
                    "author": "bookworm010101",
                    "id": "g9diu2a",
                    "parent_id": "t1_g9c5407",
                    "score": -1,
                    "created_utc": 1603146441.0,
                    "replies": [
                        {
                            "body": "What are you talking about. Plenty of people do this. I don’t like the side effects of birth control, so all of my long term relationships for the last 10 years have almost always exclusively used condoms, at least 80% of the time, both in and out of the sugar bowl. *YOU* just don’t want to use condoms with *your* partners because *you* are the one selfish enough to put your own sexual pleasure over the health or comfort of your partner.. that’s not a universal experience at all 😂",
                            "author": "mattie_east",
                            "id": "g9e876g",
                            "parent_id": "t1_g9diu2a",
                            "score": 11,
                            "created_utc": 1603160737.0,
                            "replies": [
                                {
                                    "body": "I know literally zero 100% zero where the guy uses condoms in a commited longterm relationship.\n\nin the beginning? sure 6 months in NOPE",
                                    "author": "bookworm010101",
                                    "id": "g9hvick",
                                    "parent_id": "t1_g9e876g",
                                    "score": 0,
                                    "created_utc": 1603242351.0,
                                    "replies": [
                                        {
                                            "body": "Again... that’s a *you* thing.",
                                            "author": "mattie_east",
                                            "id": "g9hvt64",
                                            "parent_id": "t1_g9hvick",
                                            "score": 3,
                                            "created_utc": 1603242522.0,
                                            "replies": [
                                                {
                                                    "body": "No it isnt. Go poll 100 married or engaged couples NO guy is using condoms.",
                                                    "author": "bookworm010101",
                                                    "id": "g9hvzxw",
                                                    "parent_id": "t1_g9hvt64",
                                                    "score": 1,
                                                    "created_utc": 1603242631.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And with that said, good for you.   I would never go without.  That's just plain nasty lol. People looking to catch and spread disease!!!  Especially with sugaring.  I see posts all the time about people having multiple SDs or SBs and not telling them about their other sexual.partners.  no way in hell I would go without a condom while sugaring",
                            "author": "Occasional_Grlfriend",
                            "id": "g9egyux",
                            "parent_id": "t1_g9diu2a",
                            "score": 4,
                            "created_utc": 1603166328.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g9ey4j0",
                            "parent_id": "t1_g9diu2a",
                            "score": 2,
                            "created_utc": 1603181987.0,
                            "replies": [
                                {
                                    "body": "I think you misunderstood my meaning of IRL relationships.\n\nSugar, flings, in the beginning, sure condoms, but I know of NO men that are in longterm relatipnships 6 months+ (actual GF commited) using condoms regularly.\n\nMaybe you and your wife or fiance do? That is weird imo.",
                                    "author": "bookworm010101",
                                    "id": "g9hvw44",
                                    "parent_id": "t1_g9ey4j0",
                                    "score": 1,
                                    "created_utc": 1603242570.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. Condoms and safer sex aren’t a chore but are in fact a recognition of everyone’s dignity. I have always thought that and don’t understand why men in particular don’t understand that.",
            "author": "Daddyg2019",
            "id": "g9f19ze",
            "parent_id": "t3_je3gh1",
            "score": 6,
            "created_utc": 1603185630.0,
            "replies": []
        },
        {
            "body": "Wowow!!! I did not know about this!! Thank you for the enlightenment",
            "author": "scarlared",
            "id": "g9d62ur",
            "parent_id": "t3_je3gh1",
            "score": 3,
            "created_utc": 1603139931.0,
            "replies": []
        },
        {
            "body": "Wow EXCELLENT well spoken post and what I've tried to advocate here previously as well. These men don't care about their partners health, they care about how their penis feels. And ladies....your health is more important than how his penis feels for that 5 min 🙄\n\nAnd eva- it doesn't surprise me at all that you are getting DM's like that. How dare you make the penis' feelings less important than the LT health of a woman. Shame on you 🙄🙄🙄🙄",
            "author": "clair-cummings",
            "id": "g9qf0dp",
            "parent_id": "t3_je3gh1",
            "score": 3,
            "created_utc": 1603432140.0,
            "replies": []
        },
        {
            "body": "This is great information. I honestly just assumed I’m being tested for HPV when I do full panels. This makes me so paranoid. Almost every SD relationship I have started, he is ready to try and have unprotected sex. Often he has the condom close by, but seems to just try to see if I’ll insist on it (which I always do). I do not have a guarantee that they’re exclusive with me... and based on how ready they were for unprotected sex, it just makes me think this is how they must be with every SB and makes even more adamant about protection. \n\nI’m calling my gyno tomorrow, I want a pap!!",
            "author": "selena_92",
            "id": "gagsf9q",
            "parent_id": "t3_je3gh1",
            "score": 3,
            "created_utc": 1603952033.0,
            "replies": []
        },
        {
            "body": "Dont research HPV or you will cry yourself to sleep daily and never have sex again.\n\nCDC indicates that at least 75 percent of the reproductive-age population has been exposed to  sexually transmitted HPV.\n\nWith that said I agree!!",
            "author": "bookworm010101",
            "id": "g9dii8g",
            "parent_id": "t3_je3gh1",
            "score": 8,
            "created_utc": 1603146272.0,
            "replies": [
                {
                    "body": "True, but consider:\nThe virus will clear itself out in several years for most people. I had a high risk strain for three years and always disclosed until a year of consistently negative testing. So it’s scary, but not a life sentence. \n\nThere are 150 strains, most of which are low-risk, meaning they are typically asymptomatic or result in warts. (Which aren’t fun but won’t hurt you.) \n\nThe big 9, including the major players for cervical, anal, and throat cancers are covered in the latest HPV vaccine. There’s no reason not to get the vax— even if you have had an HPV strain before, it protects you against reinfection and other strains. If you’re over 45, you might have to pay out of pocket, but it’s so worth it! (Men and women, FYI...) Even if you can only afford the first shot, you’ll be mostly covered.",
                    "author": null,
                    "id": "g9dp0bb",
                    "parent_id": "t1_g9dii8g",
                    "score": 2,
                    "created_utc": 1603149806.0,
                    "replies": [
                        {
                            "body": "No disagreement, but currently there isnt even an approved test for males and HPV.",
                            "author": "bookworm010101",
                            "id": "g9dpkl3",
                            "parent_id": "t1_g9dp0bb",
                            "score": 1,
                            "created_utc": 1603150115.0,
                            "replies": [
                                {
                                    "body": "This is unfortunately true.",
                                    "author": null,
                                    "id": "g9hdc54",
                                    "parent_id": "t1_g9dpkl3",
                                    "score": 0,
                                    "created_utc": 1603232117.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're right Doctors Don't test for HPV if you are under the age of 30.... UNLESS your pap smear comes back abnormal  for whatever reason and that is when they also test you for HPV no matter if you are in your 20's or not.  HPV is wayy more common then you think it is because of the fact that men do not get tested. The only change that you will have now that you know you have HPV is that you will have to get yearly paps and possibly yearly colposcopy's. Also before I end this lol. Cervical cancer is not only from HPV by the way.",
            "author": "JustGiveMeLife",
            "id": "g9e2b63",
            "parent_id": "t3_je3gh1",
            "score": 2,
            "created_utc": 1603157332.0,
            "replies": [
                {
                    "body": "My test hasn't come back yet so hopefully I'm not positive, but here's hoping annual paps/coploscopies aren't in my future.",
                    "author": "EvaExquisite",
                    "id": "g9e63hm",
                    "parent_id": "t1_g9e2b63",
                    "score": 1,
                    "created_utc": 1603159510.0,
                    "replies": [
                        {
                            "body": "Crossing my fingers for good news for you. 🤞🏾",
                            "author": "JustGiveMeLife",
                            "id": "g9e7yve",
                            "parent_id": "t1_g9e63hm",
                            "score": 1,
                            "created_utc": 1603160604.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "our medical system doesn't test young women for it below 30 years old.\n\nAmerican Pap protocols are usually reflex testing. That means that if cytologic signs of HPV are present the Pap reflexes to Hpv typing",
            "author": "GSSD",
            "id": "g9g06qi",
            "parent_id": "t3_je3gh1",
            "score": 2,
            "created_utc": 1603209782.0,
            "replies": []
        },
        {
            "body": "You’re a queen. You’re a regal mfkin QUEEN.",
            "author": "fluffypinkkitties",
            "id": "gen5z80",
            "parent_id": "t3_je3gh1",
            "score": 2,
            "created_utc": 1607121311.0,
            "replies": [
                {
                    "body": "Late to the party with replying, but thank you so much",
                    "author": "EvaExquisite",
                    "id": "gf8bkzl",
                    "parent_id": "t1_gen5z80",
                    "score": 1,
                    "created_utc": 1607562915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being transparent about STI/D status is a part of clear communication and dismantling r*pe culture.",
            "author": "fluffypinkkitties",
            "id": "gen60tn",
            "parent_id": "t3_je3gh1",
            "score": 2,
            "created_utc": 1607121336.0,
            "replies": []
        },
        {
            "body": "It’s a heartfelt PSA but pretty much useless because there is not a good test for men and with women it’s hit or miss.  \n\nHpv is likely the most common of venereal diseases and preventing it is nigh on impossible unless you choose pure abstinence.  Even using condoms isn’t a foolproof measure.",
            "author": "houstonsd",
            "id": "g9drazt",
            "parent_id": "t3_je3gh1",
            "score": 1,
            "created_utc": 1603151083.0,
            "replies": [
                {
                    "body": "Condoms might not be foolproof but do they ever stop a lot. Think of how many babies could have happened without condoms or other contraception. Too bad STDs aren't stopped by the pill.",
                    "author": "EvaExquisite",
                    "id": "g9e5fpx",
                    "parent_id": "t1_g9drazt",
                    "score": 0,
                    "created_utc": 1603159129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HPV is so common that nearly all sexually active men and women get the virus at some point in their lives. [\\~CDC](https://www.cdc.gov/std/hpv/stats.htm)",
            "author": "WI_Gent",
            "id": "g9enann",
            "parent_id": "t3_je3gh1",
            "score": 1,
            "created_utc": 1603171247.0,
            "replies": [
                {
                    "body": "True. Also from your the CDC, [the median age for HPV-related cervical cancer is 49.](https://www.cdc.gov/cancer/hpv/statistics/age.htm)  That may or may not put an older non-SR (i.e spouse) at a much higher risk that they didn't sign up for. Is that really fair to them?",
                    "author": "EvaExquisite",
                    "id": "g9ey4rf",
                    "parent_id": "t1_g9enann",
                    "score": 2,
                    "created_utc": 1603181994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We are all educated adults and we can make our own decisions regarding what risks we are comfortable with.",
            "author": "LotBuilder",
            "id": "g9e5lsn",
            "parent_id": "t3_je3gh1",
            "score": -2,
            "created_utc": 1603159227.0,
            "replies": [
                {
                    "body": "Based on many many conversations I've had with many POT SD's, I strongly disagree",
                    "author": "EvaExquisite",
                    "id": "g9e5tkn",
                    "parent_id": "t1_g9e5lsn",
                    "score": 2,
                    "created_utc": 1603159354.0,
                    "replies": [
                        {
                            "body": "Your body,  your rules.  My arrangement my rules.  We are all grown ups deciding what we are comfortable with.  Condoms and dentals damns don’t stop HPV.  They are not a significant factor.  Skin to skin contact occurs so they are ineffective in stopping HPV, Herpes, syphillis, crabs or Molluscum.   The only foolproof way to never get any type of STD is to not have sex.  If you are going to have sex then there is risk involved.  Statistically the risk for the SD and SB (24+) demographics is not extremely high.   If both partners get tested before hand then it falls within the risk tolerance of many of us.   \n\nYour irrelevant personal story spun into a lecture not backed by any data doesn’t hit home with many of us.   Get over it",
                            "author": "LotBuilder",
                            "id": "g9e83pd",
                            "parent_id": "t1_g9e5tkn",
                            "score": -3,
                            "created_utc": 1603160682.0,
                            "replies": [
                                {
                                    "body": "My story about taking to my doctor about sexual health and the false sense of security of a negative test is irrelevant to condom usage? My reminder to consider that hpv extends beyond the two people having sex, such as nonconsenting wives?\n\nGot it. Thanks for your help dude.",
                                    "author": "EvaExquisite",
                                    "id": "g9eap0t",
                                    "parent_id": "t1_g9e83pd",
                                    "score": 4,
                                    "created_utc": 1603162231.0,
                                    "replies": [
                                        {
                                            "body": "You are an escort (clearly stated in your posting history)  posting in a sugar dating forum pushing an agenda.   Yes,  you should definitely use condoms.  The rest of us will make our own choices.",
                                            "author": "LotBuilder",
                                            "id": "g9ec6br",
                                            "parent_id": "t1_g9eap0t",
                                            "score": -1,
                                            "created_utc": 1603163154.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, I'm pushing one an agenda... For women's health. Why TF wouldn't I? And I've done so since before I was escorting. I'm not letting you try to sex worker shame me because while I'm here on this subreddit with experience as an SB, sex work allowed me to approach sugar dating the empowered way I wish I did when I was in college.\n\nGo ahead and make your own choices, but know that your choices have real consequences whether you choose to be aware of them or purposely try to misinterpret health recommendations for your own benefit.",
                                                    "author": "EvaExquisite",
                                                    "id": "g9ee66k",
                                                    "parent_id": "t1_g9ec6br",
                                                    "score": 8,
                                                    "created_utc": 1603164418.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "HPV spreads with condom use as well.  Same as herpes",
            "author": "TestingTheWater1234",
            "id": "g9e5fit",
            "parent_id": "t3_je3gh1",
            "score": 0,
            "created_utc": 1603159126.0,
            "replies": [
                {
                    "body": "You say that as if wearing a condom makes no difference, which is false. It makes a world of difference for mitigating risk of spread.",
                    "author": "EvaExquisite",
                    "id": "g9e667f",
                    "parent_id": "t1_g9e5fit",
                    "score": 5,
                    "created_utc": 1603159554.0,
                    "replies": [
                        {
                            "body": "No.  I always use condoms but be aware that if you have a lot of partners; you will be infected with both of these diseases and you need to be aware of that.",
                            "author": "TestingTheWater1234",
                            "id": "g9e6bg4",
                            "parent_id": "t1_g9e667f",
                            "score": 2,
                            "created_utc": 1603159638.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As you pointed out, HPV can be spread through sex with a condom and through oral sex, so using this as a “therefore never have bare sex with anyone” argument doesn’t make sense.  If you don’t want to have bare sex, don’t have bare sex, but it isn’t going to prevent you from getting HPV.",
            "author": "UseTheForceRey",
            "id": "g9c2swu",
            "parent_id": "t3_je3gh1",
            "score": -5,
            "created_utc": 1603121892.0,
            "replies": [
                {
                    "body": "That argument doesn't make sense because you heard what you wanted to hear, not what I actually said. Where did I say that you can get it through sex with a condom? I said that there's other ways to get it other than intercourse. That includes rubbing bare genitals together with outercourse, touching infected bodily fluids and then touching yourself, etc. Knowing that condoms can prevent HPV transmission dramatically for the most high risk activity of spreading it, why WOULDN'T you wear a condom?",
                    "author": "EvaExquisite",
                    "id": "g9c408r",
                    "parent_id": "t1_g9c2swu",
                    "score": 9,
                    "created_utc": 1603122413.0,
                    "replies": [
                        {
                            "body": "First of all, thank you for this PSA.\n\nTo be fair, you did not emphasize the fact that condoms do not prevent the spread of HPV.  Yes, the likelihood is reduced, but it still spreads *quite* readily even with excellent condom use.  Specifically, it spreads on skin contact.\n\nIt bears repeating because the idea that condoms are sufficient to protect against HPV is *quite common.*  Such is not true.  **ANY SKIN CONTACT, SEXUAL OR OTHERWISE, CAN SPREAD HPV.** \n\nHerpes, too.  And some people are asymptomatic carriers of HSV.\n\nThanks again for the PSA, a lot of people need to hear this message a few times.",
                            "author": "tosler",
                            "id": "g9e2ndx",
                            "parent_id": "t1_g9c408r",
                            "score": 0,
                            "created_utc": 1603157520.0,
                            "replies": [
                                {
                                    "body": "Yes, condoms are not fail-proof. Nothing is. But boy do they prevent a lot and the fact that they're not fail-proof is NEVER an excuse not to wear one. Not when it's so easy to make everyone's life easier.",
                                    "author": "EvaExquisite",
                                    "id": "g9e5pou",
                                    "parent_id": "t1_g9e2ndx",
                                    "score": 1,
                                    "created_utc": 1603159291.0,
                                    "replies": [
                                        {
                                            "body": "Agreed 1,000%.\n\nI guess my point is, condoms do not negate the need for STD testing if engaging in sexual contact with multiple partners, and also don't be surprised if an STD is acquired despite appropriate barrier usage.",
                                            "author": "tosler",
                                            "id": "g9e9c0t",
                                            "parent_id": "t1_g9e5pou",
                                            "score": 1,
                                            "created_utc": 1603161413.0,
                                            "replies": [
                                                {
                                                    "body": "STD testing doesn't replace condoms and vice versa. Both are important and most effective together. The fact that I have to say that explicitly for many of the people reading this gives me little hope for humanity.",
                                                    "author": "EvaExquisite",
                                                    "id": "g9e9r0a",
                                                    "parent_id": "t1_g9e9c0t",
                                                    "score": 2,
                                                    "created_utc": 1603161663.0,
                                                    "replies": [
                                                        {
                                                            "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
                                                            "author": "tosler",
                                                            "id": "g9hrqz4",
                                                            "parent_id": "t1_g9e9r0a",
                                                            "score": 0,
                                                            "created_utc": 1603240228.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                                                                    "author": "EvaExquisite",
                                                                    "id": "g9l7zvz",
                                                                    "parent_id": "t1_g9hrqz4",
                                                                    "score": 1,
                                                                    "created_utc": 1603318996.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ok, maybe you didn’t say that you can get it through sex with a condom, but you can.   If you have a relatively normal sex life, you will be exposed to HPV.  \n\nAgain, use condoms if you want, but many people (male and female) will choose to enjoy natural sex and the very small additional HPV risk to a vaccinated woman isn’t going to make a difference to most of them.",
                            "author": "UseTheForceRey",
                            "id": "g9c4ek8",
                            "parent_id": "t1_g9c408r",
                            "score": -7,
                            "created_utc": 1603122588.0,
                            "replies": [
                                {
                                    "body": "Exposure to HPV is one thing. High risk HPV strains that lead to 70% of cervical cancer cases? Kind of a different story.\n\nAlso, hi there I am a vaccinated woman and my doctor literally told me I could have contracted the high risk strains that are not covered by the vaccine. This is not a small risk.\n\nBy the logic you're giving me, I should go off of my birth control too because it's a small chance I'll get pregnant 🤷‍♀️",
                                    "author": "EvaExquisite",
                                    "id": "g9c58pp",
                                    "parent_id": "t1_g9c4ek8",
                                    "score": 8,
                                    "created_utc": 1603122935.0,
                                    "replies": [
                                        {
                                            "body": "There is a risk that you can catch one of the strains that cause cancer but are not covered by the vaccine.  I am not going to look up the stats for you but I believe that the relatively low risk multiplied by the relatively small additional protection that using condoms for PIV would add make this a small additional risk.  \n\nYour 70% of cervical cancer cases comment is completely irrelevant to the argument.   It wouldn’t matter if HPV is responsible for 100% of cervical cancer, the added risk to a vaccinated woman of not using condoms for PIV is still low.  And before you turn this into a “SDs don’t care about women” argument, HPV causes penile and anal cancer in men.  That doesn’t change the facts.",
                                            "author": "UseTheForceRey",
                                            "id": "g9c64ql",
                                            "parent_id": "t1_g9c58pp",
                                            "score": -1,
                                            "created_utc": 1603123303.0,
                                            "replies": [
                                                {
                                                    "body": "I'd love to know what your credentials are for saying that because my primary care doctor seems to think there's a chance of HPV in my sexual history since an ex metamour has cervical cancer.\n\nAnd yes, my cervical cases comment IS relevant because the particular strains they test for after age 30 are the ones that are most likely to lead to cancer (hence why I mentioned it in the first place). We're not currently talking about every strain of HPV, I'm specifically talking about the 10-12 ones that are what they specifically tested me for once I was over 30 years old. This is why 70% of cervical cancer cases is relevant. I'm also not here to minimize your risk with HPV either, but the risks you talk about are more likely to happen via HIV for men than HPV, which also may contribute to why you and many other men are minimizing the risk of HPV. [Source here](https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/hpv-and-cancer-info.html)",
                                                    "author": "EvaExquisite",
                                                    "id": "g9c9vfv",
                                                    "parent_id": "t1_g9c64ql",
                                                    "score": 8,
                                                    "created_utc": 1603124933.0,
                                                    "replies": [
                                                        {
                                                            "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
                                                            "author": "UseTheForceRey",
                                                            "id": "g9cav72",
                                                            "parent_id": "t1_g9c9vfv",
                                                            "score": 0,
                                                            "created_utc": 1603125357.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                                                                    "author": "EvaExquisite",
                                                                    "id": "g9cb68q",
                                                                    "parent_id": "t1_g9cav72",
                                                                    "score": 7,
                                                                    "created_utc": 1603125491.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                                                                            "author": null,
                                                                            "id": "g9dpqp0",
                                                                            "parent_id": "t1_g9cb68q",
                                                                            "score": 0,
                                                                            "created_utc": 1603150211.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                                                                    "author": "EvaExquisite",
                                                                                    "id": "g9dq2o5",
                                                                                    "parent_id": "t1_g9dpqp0",
                                                                                    "score": 0,
                                                                                    "created_utc": 1603150397.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                                                                            "author": null,
                                                                                            "id": "g9hdhz3",
                                                                                            "parent_id": "t1_g9dq2o5",
                                                                                            "score": 0,
                                                                                            "created_utc": 1603232203.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                                                                    "author": "EvaExquisite",
                                                                                                    "id": "g9l95jx",
                                                                                                    "parent_id": "t1_g9hdhz3",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1603319626.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                                                                            "author": "sweeterthan_",
                                                                                                            "id": "g9lp34g",
                                                                                                            "parent_id": "t1_g9l95jx",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1603328728.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g9dy8cn",
                            "parent_id": "t1_g9c408r",
                            "score": -2,
                            "created_utc": 1603155004.0,
                            "replies": [
                                {
                                    "body": "First off, if you're posting all of your sources as a reason not to wear a condom, I seriously hope your Sugar Babies are not easily manipulated by you.\n\nSecond of all, your sources say it doesn't prevent HPV because there's other possible infection points, not that wearing a condom doesn't eliminate your penis as a possible (and very viable) infection point. To forego a condom because you think getting or giving HPV is unavoidable even with a condom is irresponsible sex regardless of if that's enough to stop it.\n\nThird of all, this post is a PSA for women who don't know this about their sexual health (because, like me and another person on this post that said it, they don't tell you these things when you're a woman in your 20's) and as a PSA for men that have a false sense of security that bare sex isn't harming their clueless partners they're likely cheating on with their SB because \"you're both clean.\"\n\nDespite all of this, you still want me to consult you through how to approach safer sex with your partners, even though the easiest thing you can do to begin to mitigate risk is figure out what your best condom fit is so you can prevent intercourse as a likely way of spreading it?\n\nThen pay me very well to do that consultation.",
                                    "author": "EvaExquisite",
                                    "id": "g9e56yg",
                                    "parent_id": "t1_g9dy8cn",
                                    "score": 10,
                                    "created_utc": 1603158993.0,
                                    "replies": [
                                        {
                                            "body": "“Obviously get vaccinated and have safe sex” -me \n\nI’m sorry but where am I saying anything about not wearing condoms? I do think that everyone should minimize your risk, but if you are someone that has more than 5 partners in their lifetime, it’s almost certain you will get HPV. 90% of women get it in their lifetime. In the sugar world, even with condoms, there are a lot of people having multiple partners. Condom or not, I think most of us will get some form of it at least temporarily. It’s borderline unavoidable \n\nWear condoms and it’s good you shared this info, but I think we’re really going to have to cut down on our partner number too if we are going to deal with this",
                                            "author": null,
                                            "id": "g9g64lx",
                                            "parent_id": "t1_g9e56yg",
                                            "score": 1,
                                            "created_utc": 1603212643.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are correct, HPV may not be a big deal for most people but there is some people it causes issues in. I think since HPV and cervical cancer is so slow growing they figured unless a pap shows it, issues wont arise and so they don't think its worth it.",
            "author": "DeliciousPhrase7",
            "id": "g9dq4i8",
            "parent_id": "t3_je3gh1",
            "score": 1,
            "created_utc": 1603150426.0,
            "replies": []
        },
        {
            "body": "Thanks for bringing this to light. \n\nAnother common virus that most Dr's will NOT blood tests for is HSV, unless they suspect a viral break- out. The skin and blood tests are not always accurate either. Dr.'s deff don't tell the general public about that. ....Reason #587 why to use protection, for the instances when humans don't know their status.",
            "author": "IAm2Legit2Sit",
            "id": "g9e9i73",
            "parent_id": "t3_je3gh1",
            "score": 1,
            "created_utc": 1603161515.0,
            "replies": []
        },
        {
            "body": "Omg I had no clue. I thought for sure Pap smears are automatically tested for HPV. Like, of course I’d want to know if I have it. Even though I’m 27, they should be testing for it without me asking. The US healthcare system sucks.",
            "author": "nycsugar1993",
            "id": "g9el0dj",
            "parent_id": "t3_je3gh1",
            "score": 1,
            "created_utc": 1603169355.0,
            "replies": []
        },
        {
            "body": "In the UK you start getting Pap smears at 25yrs and the nurse has always asked me if I want to do a hpv test and chlamydia test “while I’m done there”. But they may not be common practice. GP’s generally only offer the common STI check, if you go to sexual health clinics you can get the full pcr panel done which I think covers around 11 STIs including several bacteria’s. \n\nIn the beginning of sugaring I was more adamant about exchanging STI paperwork but have found I’ve become more complacent. I continue to insist on condoms though throughout the SR...but still. \n\nReally this should be practiced in vanilla dating as much as in arrangements.",
            "author": null,
            "id": "g9eurnw",
            "parent_id": "t3_je3gh1",
            "score": 1,
            "created_utc": 1603178305.0,
            "replies": []
        },
        {
            "body": "Ok but what’s this about testing for HPV after 30? That’s kind of weird. \n\nI’d imagine this is because people over 30 are more likely to be in stable relationships and are less likely to  have been vaccinated.",
            "author": "ifisch",
            "id": "g9d7ve2",
            "parent_id": "t1_g9d4i5w",
            "score": 4,
            "created_utc": 1603140820.0,
            "replies": [
                {
                    "body": "It's because young people's immune system clears HPV fairly easily.\n\nCancer arises when HPV is not cleared quickly, the viral-infected cells mutate and mutate and eventually (can) turn into cancer.\n\nAs people age, their immune system changes and is not able to so easily clear HPV, and infections last longer and are more likely to turn into cancer.\n\nThat said, there are cases of cervical cancer in very young women.  The statistics aren't perfect.  That, however, is the rationale for not testing <30 as far as I am aware.",
                    "author": "tosler",
                    "id": "g9e262r",
                    "parent_id": "t1_g9d7ve2",
                    "score": 9,
                    "created_utc": 1603157252.0,
                    "replies": []
                },
                {
                    "body": "I thought it weird too because, previous to pursuing SD's, I was in various poly relationships in my early 20's and I was VERY open about this with my doctor so that she would order the right tests for me. It's certainly concerning but from what I gathered, it seems it's based on early relationship exposure: you're likely to contract it when younger, but your immune system is likely to clear it before it's a problem. You DO build an immunity to many of these strains once they're cleared, so if your body's just doing that on its own and not causing anything else of concern why test it? At least, that's probably how medical provider look at it on an individual level, not a multiple partners to think about level.",
                    "author": "EvaExquisite",
                    "id": "g9dkdp8",
                    "parent_id": "t1_g9d7ve2",
                    "score": 1,
                    "created_utc": 1603147272.0,
                    "replies": [
                        {
                            "body": "I've had irregular pap smears since I was 25, two that have ended in colposcopies and then cleared themselves up. You know what's NOT fun? Colposcopies. They pinch off a piece of your cervix to test and that hurts, and then they put something on it to keep it clean and that sloughs off you eventually in a way that looks like a small grey alien slithered out of you and into your underwear. \n\nThis year, at 31, I had an ovarian cancer scare. Everything is fine, thank goodness, but ladies - you HAVE to look out for yourself. My SBF at the time of the colposcopy was great, but didn't understand the feelings I had about it. \n\nMedical providers know they'll have to fight insurance for abnormal tests, and at least I never learned what strain I had, so unless the big bad medical associations and CDC change their reccomendations for it, testing won't change. Be your own best advocate.",
                            "author": "secretactorian",
                            "id": "g9e8ezn",
                            "parent_id": "t1_g9dkdp8",
                            "score": 5,
                            "created_utc": 1603160863.0,
                            "replies": [
                                {
                                    "body": "My fiance had to do those regularly (biannually maybe? that was a long time ago) having survived vaginal cancer before we met.  She was tougher than nails, and I don't think she was honest about just how rough those days were.",
                                    "author": "RustStainRemover",
                                    "id": "g9f8r58",
                                    "parent_id": "t1_g9e8ezn",
                                    "score": 2,
                                    "created_utc": 1603193492.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yea. Cervical cancer is also the kindof thing that doesnt' really \"sneak up\" on you. \n\nIf you're getting regular pap smears, that's probably a lot more useful than an HPV test.",
                            "author": "ifisch",
                            "id": "g9dnoml",
                            "parent_id": "t1_g9dkdp8",
                            "score": 1,
                            "created_utc": 1603149079.0,
                            "replies": [
                                {
                                    "body": "The first part of that second sentence bears repeating:\n\nGET REGULAR PAP SMEARS!",
                                    "author": "EvaExquisite",
                                    "id": "g9dnuxe",
                                    "parent_id": "t1_g9dnoml",
                                    "score": 5,
                                    "created_utc": 1603149178.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[**5% of ALL cancers are caused by high-risk HPV.**](https://www.cancer.gov/about-cancer/causes-prevention/risk/infectious-agents/hpv-and-cancer#cancers-caused)  That includes cervical, penile, vaginal, vulvar, anal, and oropharyngeal (throat) cancers.\n\nPeople don't take HPV seriously enough at all.  \n\nIf anyone has the money to sugar, they absolutely have the money to get the new 9-valent Gardasil HPV vaccine even if their insurance might not pay for it.",
            "author": "sweeterthan_",
            "id": "g9kdkyg",
            "parent_id": "t1_g9dr7xd",
            "score": 6,
            "created_utc": 1603304501.0,
            "replies": [
                {
                    "body": "Are they letting adult males get it yet?  I have tried to get it but they wouldn't give it to me because of my age.",
                    "author": "catfarts99",
                    "id": "g9krt4v",
                    "parent_id": "t1_g9kdkyg",
                    "score": 1,
                    "created_utc": 1603311305.0,
                    "replies": [
                        {
                            "body": "Older people have always been *allowed* to get it, it just isn't routinely offered because, from a public health perspective, it's more effective to vaccinate young people, and there's a constant global shortage of the vaccine.  That, and that insurances don't want to cover the cost.  (It's about 100/shot USD wholesale, plus there's the cost for administering it.)\n\nHowever, older people with compromised immune systems are sometimes given it to prevent warts on other parts of the body.  (There's some cross-protection for other strains of HPV.)  The only reason someone should not get it is if they have an allergy to the ingredients or Guillaine-Barré",
                            "author": "sweeterthan_",
                            "id": "g9kuuia",
                            "parent_id": "t1_g9krt4v",
                            "score": 2,
                            "created_utc": 1603312761.0,
                            "replies": [
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "g9kv4t0",
                                    "parent_id": "t1_g9kuuia",
                                    "score": 0,
                                    "created_utc": 1603312900.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9eqxvx",
            "parent_id": "t1_g9dr7xd",
            "score": 1,
            "created_utc": 1603174498.0,
            "replies": [
                {
                    "body": "basically, yes.    My friend got throat cancer and the doctor told him that some people are more susceptible to HPV giving them cancer.    So its a genetic crap shoot kind of plus it depend on the specific strain too.   Micheal Douglas got throat cancer from HPV he claims.",
                    "author": "catfarts99",
                    "id": "g9erl84",
                    "parent_id": "t1_g9eqxvx",
                    "score": 2,
                    "created_utc": 1603175122.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you define as safer sex?",
            "author": "EvaExquisite",
            "id": "g9c41q5",
            "parent_id": "t1_g9bzrz8",
            "score": 1,
            "created_utc": 1603122432.0,
            "replies": [
                {
                    "body": "Safer sex to me means having open communication about health risks, STDs, protection, etc. and making smart choices. Basically what you wrote about here.",
                    "author": "curly_spice",
                    "id": "g9c66c7",
                    "parent_id": "t1_g9c41q5",
                    "score": 14,
                    "created_utc": 1603123321.0,
                    "replies": [
                        {
                            "body": "Perfect! Yes this should not just be a \"Don't worry, I'm clean\" conversation. Talks about STD's should be normalized.",
                            "author": "EvaExquisite",
                            "id": "g9c7o1s",
                            "parent_id": "t1_g9c66c7",
                            "score": 8,
                            "created_utc": 1603123985.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9dyr7x",
            "parent_id": "t1_g9c5407",
            "score": 3,
            "created_utc": 1603155297.0,
            "replies": [
                {
                    "body": "I see one person at a time and will go LONG stretches in between relationships.   My livelihood is not from sugaring.  I don't always need an SD or to be in an SR.  But, I am not so naive to believe that I am the only one he is with.  If he travels, I assume he has a girl each place he travels to.  So, when I am im a relationship,  I will do everything I can to protect myself and if that means the relationship will end, so be it.  I won't lose sleep and my bills will still get paid.",
                    "author": "Occasional_Grlfriend",
                    "id": "g9ei43x",
                    "parent_id": "t1_g9dyr7x",
                    "score": 3,
                    "created_utc": 1603167153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "With that said.......I know NOBODY IRL RELATONSHIPS that uses condoms with any regularity that is sorta weird.",
            "author": "bookworm010101",
            "id": "g9diu2a",
            "parent_id": "t1_g9c5407",
            "score": -1,
            "created_utc": 1603146441.0,
            "replies": [
                {
                    "body": "What are you talking about. Plenty of people do this. I don’t like the side effects of birth control, so all of my long term relationships for the last 10 years have almost always exclusively used condoms, at least 80% of the time, both in and out of the sugar bowl. *YOU* just don’t want to use condoms with *your* partners because *you* are the one selfish enough to put your own sexual pleasure over the health or comfort of your partner.. that’s not a universal experience at all 😂",
                    "author": "mattie_east",
                    "id": "g9e876g",
                    "parent_id": "t1_g9diu2a",
                    "score": 11,
                    "created_utc": 1603160737.0,
                    "replies": [
                        {
                            "body": "I know literally zero 100% zero where the guy uses condoms in a commited longterm relationship.\n\nin the beginning? sure 6 months in NOPE",
                            "author": "bookworm010101",
                            "id": "g9hvick",
                            "parent_id": "t1_g9e876g",
                            "score": 0,
                            "created_utc": 1603242351.0,
                            "replies": [
                                {
                                    "body": "Again... that’s a *you* thing.",
                                    "author": "mattie_east",
                                    "id": "g9hvt64",
                                    "parent_id": "t1_g9hvick",
                                    "score": 3,
                                    "created_utc": 1603242522.0,
                                    "replies": [
                                        {
                                            "body": "No it isnt. Go poll 100 married or engaged couples NO guy is using condoms.",
                                            "author": "bookworm010101",
                                            "id": "g9hvzxw",
                                            "parent_id": "t1_g9hvt64",
                                            "score": 1,
                                            "created_utc": 1603242631.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And with that said, good for you.   I would never go without.  That's just plain nasty lol. People looking to catch and spread disease!!!  Especially with sugaring.  I see posts all the time about people having multiple SDs or SBs and not telling them about their other sexual.partners.  no way in hell I would go without a condom while sugaring",
                    "author": "Occasional_Grlfriend",
                    "id": "g9egyux",
                    "parent_id": "t1_g9diu2a",
                    "score": 4,
                    "created_utc": 1603166328.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g9ey4j0",
                    "parent_id": "t1_g9diu2a",
                    "score": 2,
                    "created_utc": 1603181987.0,
                    "replies": [
                        {
                            "body": "I think you misunderstood my meaning of IRL relationships.\n\nSugar, flings, in the beginning, sure condoms, but I know of NO men that are in longterm relatipnships 6 months+ (actual GF commited) using condoms regularly.\n\nMaybe you and your wife or fiance do? That is weird imo.",
                            "author": "bookworm010101",
                            "id": "g9hvw44",
                            "parent_id": "t1_g9ey4j0",
                            "score": 1,
                            "created_utc": 1603242570.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True, but consider:\nThe virus will clear itself out in several years for most people. I had a high risk strain for three years and always disclosed until a year of consistently negative testing. So it’s scary, but not a life sentence. \n\nThere are 150 strains, most of which are low-risk, meaning they are typically asymptomatic or result in warts. (Which aren’t fun but won’t hurt you.) \n\nThe big 9, including the major players for cervical, anal, and throat cancers are covered in the latest HPV vaccine. There’s no reason not to get the vax— even if you have had an HPV strain before, it protects you against reinfection and other strains. If you’re over 45, you might have to pay out of pocket, but it’s so worth it! (Men and women, FYI...) Even if you can only afford the first shot, you’ll be mostly covered.",
            "author": null,
            "id": "g9dp0bb",
            "parent_id": "t1_g9dii8g",
            "score": 2,
            "created_utc": 1603149806.0,
            "replies": [
                {
                    "body": "No disagreement, but currently there isnt even an approved test for males and HPV.",
                    "author": "bookworm010101",
                    "id": "g9dpkl3",
                    "parent_id": "t1_g9dp0bb",
                    "score": 1,
                    "created_utc": 1603150115.0,
                    "replies": [
                        {
                            "body": "This is unfortunately true.",
                            "author": null,
                            "id": "g9hdc54",
                            "parent_id": "t1_g9dpkl3",
                            "score": 0,
                            "created_utc": 1603232117.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My test hasn't come back yet so hopefully I'm not positive, but here's hoping annual paps/coploscopies aren't in my future.",
            "author": "EvaExquisite",
            "id": "g9e63hm",
            "parent_id": "t1_g9e2b63",
            "score": 1,
            "created_utc": 1603159510.0,
            "replies": [
                {
                    "body": "Crossing my fingers for good news for you. 🤞🏾",
                    "author": "JustGiveMeLife",
                    "id": "g9e7yve",
                    "parent_id": "t1_g9e63hm",
                    "score": 1,
                    "created_utc": 1603160604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Late to the party with replying, but thank you so much",
            "author": "EvaExquisite",
            "id": "gf8bkzl",
            "parent_id": "t1_gen5z80",
            "score": 1,
            "created_utc": 1607562915.0,
            "replies": []
        },
        {
            "body": "Condoms might not be foolproof but do they ever stop a lot. Think of how many babies could have happened without condoms or other contraception. Too bad STDs aren't stopped by the pill.",
            "author": "EvaExquisite",
            "id": "g9e5fpx",
            "parent_id": "t1_g9drazt",
            "score": 0,
            "created_utc": 1603159129.0,
            "replies": []
        },
        {
            "body": "True. Also from your the CDC, [the median age for HPV-related cervical cancer is 49.](https://www.cdc.gov/cancer/hpv/statistics/age.htm)  That may or may not put an older non-SR (i.e spouse) at a much higher risk that they didn't sign up for. Is that really fair to them?",
            "author": "EvaExquisite",
            "id": "g9ey4rf",
            "parent_id": "t1_g9enann",
            "score": 2,
            "created_utc": 1603181994.0,
            "replies": []
        },
        {
            "body": "Based on many many conversations I've had with many POT SD's, I strongly disagree",
            "author": "EvaExquisite",
            "id": "g9e5tkn",
            "parent_id": "t1_g9e5lsn",
            "score": 2,
            "created_utc": 1603159354.0,
            "replies": [
                {
                    "body": "Your body,  your rules.  My arrangement my rules.  We are all grown ups deciding what we are comfortable with.  Condoms and dentals damns don’t stop HPV.  They are not a significant factor.  Skin to skin contact occurs so they are ineffective in stopping HPV, Herpes, syphillis, crabs or Molluscum.   The only foolproof way to never get any type of STD is to not have sex.  If you are going to have sex then there is risk involved.  Statistically the risk for the SD and SB (24+) demographics is not extremely high.   If both partners get tested before hand then it falls within the risk tolerance of many of us.   \n\nYour irrelevant personal story spun into a lecture not backed by any data doesn’t hit home with many of us.   Get over it",
                    "author": "LotBuilder",
                    "id": "g9e83pd",
                    "parent_id": "t1_g9e5tkn",
                    "score": -3,
                    "created_utc": 1603160682.0,
                    "replies": [
                        {
                            "body": "My story about taking to my doctor about sexual health and the false sense of security of a negative test is irrelevant to condom usage? My reminder to consider that hpv extends beyond the two people having sex, such as nonconsenting wives?\n\nGot it. Thanks for your help dude.",
                            "author": "EvaExquisite",
                            "id": "g9eap0t",
                            "parent_id": "t1_g9e83pd",
                            "score": 4,
                            "created_utc": 1603162231.0,
                            "replies": [
                                {
                                    "body": "You are an escort (clearly stated in your posting history)  posting in a sugar dating forum pushing an agenda.   Yes,  you should definitely use condoms.  The rest of us will make our own choices.",
                                    "author": "LotBuilder",
                                    "id": "g9ec6br",
                                    "parent_id": "t1_g9eap0t",
                                    "score": -1,
                                    "created_utc": 1603163154.0,
                                    "replies": [
                                        {
                                            "body": "Yes, I'm pushing one an agenda... For women's health. Why TF wouldn't I? And I've done so since before I was escorting. I'm not letting you try to sex worker shame me because while I'm here on this subreddit with experience as an SB, sex work allowed me to approach sugar dating the empowered way I wish I did when I was in college.\n\nGo ahead and make your own choices, but know that your choices have real consequences whether you choose to be aware of them or purposely try to misinterpret health recommendations for your own benefit.",
                                            "author": "EvaExquisite",
                                            "id": "g9ee66k",
                                            "parent_id": "t1_g9ec6br",
                                            "score": 8,
                                            "created_utc": 1603164418.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You say that as if wearing a condom makes no difference, which is false. It makes a world of difference for mitigating risk of spread.",
            "author": "EvaExquisite",
            "id": "g9e667f",
            "parent_id": "t1_g9e5fit",
            "score": 5,
            "created_utc": 1603159554.0,
            "replies": [
                {
                    "body": "No.  I always use condoms but be aware that if you have a lot of partners; you will be infected with both of these diseases and you need to be aware of that.",
                    "author": "TestingTheWater1234",
                    "id": "g9e6bg4",
                    "parent_id": "t1_g9e667f",
                    "score": 2,
                    "created_utc": 1603159638.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That argument doesn't make sense because you heard what you wanted to hear, not what I actually said. Where did I say that you can get it through sex with a condom? I said that there's other ways to get it other than intercourse. That includes rubbing bare genitals together with outercourse, touching infected bodily fluids and then touching yourself, etc. Knowing that condoms can prevent HPV transmission dramatically for the most high risk activity of spreading it, why WOULDN'T you wear a condom?",
            "author": "EvaExquisite",
            "id": "g9c408r",
            "parent_id": "t1_g9c2swu",
            "score": 9,
            "created_utc": 1603122413.0,
            "replies": [
                {
                    "body": "First of all, thank you for this PSA.\n\nTo be fair, you did not emphasize the fact that condoms do not prevent the spread of HPV.  Yes, the likelihood is reduced, but it still spreads *quite* readily even with excellent condom use.  Specifically, it spreads on skin contact.\n\nIt bears repeating because the idea that condoms are sufficient to protect against HPV is *quite common.*  Such is not true.  **ANY SKIN CONTACT, SEXUAL OR OTHERWISE, CAN SPREAD HPV.** \n\nHerpes, too.  And some people are asymptomatic carriers of HSV.\n\nThanks again for the PSA, a lot of people need to hear this message a few times.",
                    "author": "tosler",
                    "id": "g9e2ndx",
                    "parent_id": "t1_g9c408r",
                    "score": 0,
                    "created_utc": 1603157520.0,
                    "replies": [
                        {
                            "body": "Yes, condoms are not fail-proof. Nothing is. But boy do they prevent a lot and the fact that they're not fail-proof is NEVER an excuse not to wear one. Not when it's so easy to make everyone's life easier.",
                            "author": "EvaExquisite",
                            "id": "g9e5pou",
                            "parent_id": "t1_g9e2ndx",
                            "score": 1,
                            "created_utc": 1603159291.0,
                            "replies": [
                                {
                                    "body": "Agreed 1,000%.\n\nI guess my point is, condoms do not negate the need for STD testing if engaging in sexual contact with multiple partners, and also don't be surprised if an STD is acquired despite appropriate barrier usage.",
                                    "author": "tosler",
                                    "id": "g9e9c0t",
                                    "parent_id": "t1_g9e5pou",
                                    "score": 1,
                                    "created_utc": 1603161413.0,
                                    "replies": [
                                        {
                                            "body": "STD testing doesn't replace condoms and vice versa. Both are important and most effective together. The fact that I have to say that explicitly for many of the people reading this gives me little hope for humanity.",
                                            "author": "EvaExquisite",
                                            "id": "g9e9r0a",
                                            "parent_id": "t1_g9e9c0t",
                                            "score": 2,
                                            "created_utc": 1603161663.0,
                                            "replies": [
                                                {
                                                    "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
                                                    "author": "tosler",
                                                    "id": "g9hrqz4",
                                                    "parent_id": "t1_g9e9r0a",
                                                    "score": 0,
                                                    "created_utc": 1603240228.0,
                                                    "replies": [
                                                        {
                                                            "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                                                            "author": "EvaExquisite",
                                                            "id": "g9l7zvz",
                                                            "parent_id": "t1_g9hrqz4",
                                                            "score": 1,
                                                            "created_utc": 1603318996.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ok, maybe you didn’t say that you can get it through sex with a condom, but you can.   If you have a relatively normal sex life, you will be exposed to HPV.  \n\nAgain, use condoms if you want, but many people (male and female) will choose to enjoy natural sex and the very small additional HPV risk to a vaccinated woman isn’t going to make a difference to most of them.",
                    "author": "UseTheForceRey",
                    "id": "g9c4ek8",
                    "parent_id": "t1_g9c408r",
                    "score": -7,
                    "created_utc": 1603122588.0,
                    "replies": [
                        {
                            "body": "Exposure to HPV is one thing. High risk HPV strains that lead to 70% of cervical cancer cases? Kind of a different story.\n\nAlso, hi there I am a vaccinated woman and my doctor literally told me I could have contracted the high risk strains that are not covered by the vaccine. This is not a small risk.\n\nBy the logic you're giving me, I should go off of my birth control too because it's a small chance I'll get pregnant 🤷‍♀️",
                            "author": "EvaExquisite",
                            "id": "g9c58pp",
                            "parent_id": "t1_g9c4ek8",
                            "score": 8,
                            "created_utc": 1603122935.0,
                            "replies": [
                                {
                                    "body": "There is a risk that you can catch one of the strains that cause cancer but are not covered by the vaccine.  I am not going to look up the stats for you but I believe that the relatively low risk multiplied by the relatively small additional protection that using condoms for PIV would add make this a small additional risk.  \n\nYour 70% of cervical cancer cases comment is completely irrelevant to the argument.   It wouldn’t matter if HPV is responsible for 100% of cervical cancer, the added risk to a vaccinated woman of not using condoms for PIV is still low.  And before you turn this into a “SDs don’t care about women” argument, HPV causes penile and anal cancer in men.  That doesn’t change the facts.",
                                    "author": "UseTheForceRey",
                                    "id": "g9c64ql",
                                    "parent_id": "t1_g9c58pp",
                                    "score": -1,
                                    "created_utc": 1603123303.0,
                                    "replies": [
                                        {
                                            "body": "I'd love to know what your credentials are for saying that because my primary care doctor seems to think there's a chance of HPV in my sexual history since an ex metamour has cervical cancer.\n\nAnd yes, my cervical cases comment IS relevant because the particular strains they test for after age 30 are the ones that are most likely to lead to cancer (hence why I mentioned it in the first place). We're not currently talking about every strain of HPV, I'm specifically talking about the 10-12 ones that are what they specifically tested me for once I was over 30 years old. This is why 70% of cervical cancer cases is relevant. I'm also not here to minimize your risk with HPV either, but the risks you talk about are more likely to happen via HIV for men than HPV, which also may contribute to why you and many other men are minimizing the risk of HPV. [Source here](https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/hpv-and-cancer-info.html)",
                                            "author": "EvaExquisite",
                                            "id": "g9c9vfv",
                                            "parent_id": "t1_g9c64ql",
                                            "score": 8,
                                            "created_utc": 1603124933.0,
                                            "replies": [
                                                {
                                                    "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
                                                    "author": "UseTheForceRey",
                                                    "id": "g9cav72",
                                                    "parent_id": "t1_g9c9vfv",
                                                    "score": 0,
                                                    "created_utc": 1603125357.0,
                                                    "replies": [
                                                        {
                                                            "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                                                            "author": "EvaExquisite",
                                                            "id": "g9cb68q",
                                                            "parent_id": "t1_g9cav72",
                                                            "score": 7,
                                                            "created_utc": 1603125491.0,
                                                            "replies": [
                                                                {
                                                                    "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                                                                    "author": null,
                                                                    "id": "g9dpqp0",
                                                                    "parent_id": "t1_g9cb68q",
                                                                    "score": 0,
                                                                    "created_utc": 1603150211.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                                                            "author": "EvaExquisite",
                                                                            "id": "g9dq2o5",
                                                                            "parent_id": "t1_g9dpqp0",
                                                                            "score": 0,
                                                                            "created_utc": 1603150397.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                                                                    "author": null,
                                                                                    "id": "g9hdhz3",
                                                                                    "parent_id": "t1_g9dq2o5",
                                                                                    "score": 0,
                                                                                    "created_utc": 1603232203.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                                                            "author": "EvaExquisite",
                                                                                            "id": "g9l95jx",
                                                                                            "parent_id": "t1_g9hdhz3",
                                                                                            "score": 1,
                                                                                            "created_utc": 1603319626.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                                                                    "author": "sweeterthan_",
                                                                                                    "id": "g9lp34g",
                                                                                                    "parent_id": "t1_g9l95jx",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1603328728.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g9dy8cn",
                    "parent_id": "t1_g9c408r",
                    "score": -2,
                    "created_utc": 1603155004.0,
                    "replies": [
                        {
                            "body": "First off, if you're posting all of your sources as a reason not to wear a condom, I seriously hope your Sugar Babies are not easily manipulated by you.\n\nSecond of all, your sources say it doesn't prevent HPV because there's other possible infection points, not that wearing a condom doesn't eliminate your penis as a possible (and very viable) infection point. To forego a condom because you think getting or giving HPV is unavoidable even with a condom is irresponsible sex regardless of if that's enough to stop it.\n\nThird of all, this post is a PSA for women who don't know this about their sexual health (because, like me and another person on this post that said it, they don't tell you these things when you're a woman in your 20's) and as a PSA for men that have a false sense of security that bare sex isn't harming their clueless partners they're likely cheating on with their SB because \"you're both clean.\"\n\nDespite all of this, you still want me to consult you through how to approach safer sex with your partners, even though the easiest thing you can do to begin to mitigate risk is figure out what your best condom fit is so you can prevent intercourse as a likely way of spreading it?\n\nThen pay me very well to do that consultation.",
                            "author": "EvaExquisite",
                            "id": "g9e56yg",
                            "parent_id": "t1_g9dy8cn",
                            "score": 10,
                            "created_utc": 1603158993.0,
                            "replies": [
                                {
                                    "body": "“Obviously get vaccinated and have safe sex” -me \n\nI’m sorry but where am I saying anything about not wearing condoms? I do think that everyone should minimize your risk, but if you are someone that has more than 5 partners in their lifetime, it’s almost certain you will get HPV. 90% of women get it in their lifetime. In the sugar world, even with condoms, there are a lot of people having multiple partners. Condom or not, I think most of us will get some form of it at least temporarily. It’s borderline unavoidable \n\nWear condoms and it’s good you shared this info, but I think we’re really going to have to cut down on our partner number too if we are going to deal with this",
                                    "author": null,
                                    "id": "g9g64lx",
                                    "parent_id": "t1_g9e56yg",
                                    "score": 1,
                                    "created_utc": 1603212643.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's because young people's immune system clears HPV fairly easily.\n\nCancer arises when HPV is not cleared quickly, the viral-infected cells mutate and mutate and eventually (can) turn into cancer.\n\nAs people age, their immune system changes and is not able to so easily clear HPV, and infections last longer and are more likely to turn into cancer.\n\nThat said, there are cases of cervical cancer in very young women.  The statistics aren't perfect.  That, however, is the rationale for not testing <30 as far as I am aware.",
            "author": "tosler",
            "id": "g9e262r",
            "parent_id": "t1_g9d7ve2",
            "score": 9,
            "created_utc": 1603157252.0,
            "replies": []
        },
        {
            "body": "I thought it weird too because, previous to pursuing SD's, I was in various poly relationships in my early 20's and I was VERY open about this with my doctor so that she would order the right tests for me. It's certainly concerning but from what I gathered, it seems it's based on early relationship exposure: you're likely to contract it when younger, but your immune system is likely to clear it before it's a problem. You DO build an immunity to many of these strains once they're cleared, so if your body's just doing that on its own and not causing anything else of concern why test it? At least, that's probably how medical provider look at it on an individual level, not a multiple partners to think about level.",
            "author": "EvaExquisite",
            "id": "g9dkdp8",
            "parent_id": "t1_g9d7ve2",
            "score": 1,
            "created_utc": 1603147272.0,
            "replies": [
                {
                    "body": "I've had irregular pap smears since I was 25, two that have ended in colposcopies and then cleared themselves up. You know what's NOT fun? Colposcopies. They pinch off a piece of your cervix to test and that hurts, and then they put something on it to keep it clean and that sloughs off you eventually in a way that looks like a small grey alien slithered out of you and into your underwear. \n\nThis year, at 31, I had an ovarian cancer scare. Everything is fine, thank goodness, but ladies - you HAVE to look out for yourself. My SBF at the time of the colposcopy was great, but didn't understand the feelings I had about it. \n\nMedical providers know they'll have to fight insurance for abnormal tests, and at least I never learned what strain I had, so unless the big bad medical associations and CDC change their reccomendations for it, testing won't change. Be your own best advocate.",
                    "author": "secretactorian",
                    "id": "g9e8ezn",
                    "parent_id": "t1_g9dkdp8",
                    "score": 5,
                    "created_utc": 1603160863.0,
                    "replies": [
                        {
                            "body": "My fiance had to do those regularly (biannually maybe? that was a long time ago) having survived vaginal cancer before we met.  She was tougher than nails, and I don't think she was honest about just how rough those days were.",
                            "author": "RustStainRemover",
                            "id": "g9f8r58",
                            "parent_id": "t1_g9e8ezn",
                            "score": 2,
                            "created_utc": 1603193492.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yea. Cervical cancer is also the kindof thing that doesnt' really \"sneak up\" on you. \n\nIf you're getting regular pap smears, that's probably a lot more useful than an HPV test.",
                    "author": "ifisch",
                    "id": "g9dnoml",
                    "parent_id": "t1_g9dkdp8",
                    "score": 1,
                    "created_utc": 1603149079.0,
                    "replies": [
                        {
                            "body": "The first part of that second sentence bears repeating:\n\nGET REGULAR PAP SMEARS!",
                            "author": "EvaExquisite",
                            "id": "g9dnuxe",
                            "parent_id": "t1_g9dnoml",
                            "score": 5,
                            "created_utc": 1603149178.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are they letting adult males get it yet?  I have tried to get it but they wouldn't give it to me because of my age.",
            "author": "catfarts99",
            "id": "g9krt4v",
            "parent_id": "t1_g9kdkyg",
            "score": 1,
            "created_utc": 1603311305.0,
            "replies": [
                {
                    "body": "Older people have always been *allowed* to get it, it just isn't routinely offered because, from a public health perspective, it's more effective to vaccinate young people, and there's a constant global shortage of the vaccine.  That, and that insurances don't want to cover the cost.  (It's about 100/shot USD wholesale, plus there's the cost for administering it.)\n\nHowever, older people with compromised immune systems are sometimes given it to prevent warts on other parts of the body.  (There's some cross-protection for other strains of HPV.)  The only reason someone should not get it is if they have an allergy to the ingredients or Guillaine-Barré",
                    "author": "sweeterthan_",
                    "id": "g9kuuia",
                    "parent_id": "t1_g9krt4v",
                    "score": 2,
                    "created_utc": 1603312761.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "g9kv4t0",
                            "parent_id": "t1_g9kuuia",
                            "score": 0,
                            "created_utc": 1603312900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "basically, yes.    My friend got throat cancer and the doctor told him that some people are more susceptible to HPV giving them cancer.    So its a genetic crap shoot kind of plus it depend on the specific strain too.   Micheal Douglas got throat cancer from HPV he claims.",
            "author": "catfarts99",
            "id": "g9erl84",
            "parent_id": "t1_g9eqxvx",
            "score": 2,
            "created_utc": 1603175122.0,
            "replies": []
        },
        {
            "body": "Safer sex to me means having open communication about health risks, STDs, protection, etc. and making smart choices. Basically what you wrote about here.",
            "author": "curly_spice",
            "id": "g9c66c7",
            "parent_id": "t1_g9c41q5",
            "score": 14,
            "created_utc": 1603123321.0,
            "replies": [
                {
                    "body": "Perfect! Yes this should not just be a \"Don't worry, I'm clean\" conversation. Talks about STD's should be normalized.",
                    "author": "EvaExquisite",
                    "id": "g9c7o1s",
                    "parent_id": "t1_g9c66c7",
                    "score": 8,
                    "created_utc": 1603123985.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see one person at a time and will go LONG stretches in between relationships.   My livelihood is not from sugaring.  I don't always need an SD or to be in an SR.  But, I am not so naive to believe that I am the only one he is with.  If he travels, I assume he has a girl each place he travels to.  So, when I am im a relationship,  I will do everything I can to protect myself and if that means the relationship will end, so be it.  I won't lose sleep and my bills will still get paid.",
            "author": "Occasional_Grlfriend",
            "id": "g9ei43x",
            "parent_id": "t1_g9dyr7x",
            "score": 3,
            "created_utc": 1603167153.0,
            "replies": []
        },
        {
            "body": "What are you talking about. Plenty of people do this. I don’t like the side effects of birth control, so all of my long term relationships for the last 10 years have almost always exclusively used condoms, at least 80% of the time, both in and out of the sugar bowl. *YOU* just don’t want to use condoms with *your* partners because *you* are the one selfish enough to put your own sexual pleasure over the health or comfort of your partner.. that’s not a universal experience at all 😂",
            "author": "mattie_east",
            "id": "g9e876g",
            "parent_id": "t1_g9diu2a",
            "score": 11,
            "created_utc": 1603160737.0,
            "replies": [
                {
                    "body": "I know literally zero 100% zero where the guy uses condoms in a commited longterm relationship.\n\nin the beginning? sure 6 months in NOPE",
                    "author": "bookworm010101",
                    "id": "g9hvick",
                    "parent_id": "t1_g9e876g",
                    "score": 0,
                    "created_utc": 1603242351.0,
                    "replies": [
                        {
                            "body": "Again... that’s a *you* thing.",
                            "author": "mattie_east",
                            "id": "g9hvt64",
                            "parent_id": "t1_g9hvick",
                            "score": 3,
                            "created_utc": 1603242522.0,
                            "replies": [
                                {
                                    "body": "No it isnt. Go poll 100 married or engaged couples NO guy is using condoms.",
                                    "author": "bookworm010101",
                                    "id": "g9hvzxw",
                                    "parent_id": "t1_g9hvt64",
                                    "score": 1,
                                    "created_utc": 1603242631.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And with that said, good for you.   I would never go without.  That's just plain nasty lol. People looking to catch and spread disease!!!  Especially with sugaring.  I see posts all the time about people having multiple SDs or SBs and not telling them about their other sexual.partners.  no way in hell I would go without a condom while sugaring",
            "author": "Occasional_Grlfriend",
            "id": "g9egyux",
            "parent_id": "t1_g9diu2a",
            "score": 4,
            "created_utc": 1603166328.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9ey4j0",
            "parent_id": "t1_g9diu2a",
            "score": 2,
            "created_utc": 1603181987.0,
            "replies": [
                {
                    "body": "I think you misunderstood my meaning of IRL relationships.\n\nSugar, flings, in the beginning, sure condoms, but I know of NO men that are in longterm relatipnships 6 months+ (actual GF commited) using condoms regularly.\n\nMaybe you and your wife or fiance do? That is weird imo.",
                    "author": "bookworm010101",
                    "id": "g9hvw44",
                    "parent_id": "t1_g9ey4j0",
                    "score": 1,
                    "created_utc": 1603242570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No disagreement, but currently there isnt even an approved test for males and HPV.",
            "author": "bookworm010101",
            "id": "g9dpkl3",
            "parent_id": "t1_g9dp0bb",
            "score": 1,
            "created_utc": 1603150115.0,
            "replies": [
                {
                    "body": "This is unfortunately true.",
                    "author": null,
                    "id": "g9hdc54",
                    "parent_id": "t1_g9dpkl3",
                    "score": 0,
                    "created_utc": 1603232117.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Crossing my fingers for good news for you. 🤞🏾",
            "author": "JustGiveMeLife",
            "id": "g9e7yve",
            "parent_id": "t1_g9e63hm",
            "score": 1,
            "created_utc": 1603160604.0,
            "replies": []
        },
        {
            "body": "Your body,  your rules.  My arrangement my rules.  We are all grown ups deciding what we are comfortable with.  Condoms and dentals damns don’t stop HPV.  They are not a significant factor.  Skin to skin contact occurs so they are ineffective in stopping HPV, Herpes, syphillis, crabs or Molluscum.   The only foolproof way to never get any type of STD is to not have sex.  If you are going to have sex then there is risk involved.  Statistically the risk for the SD and SB (24+) demographics is not extremely high.   If both partners get tested before hand then it falls within the risk tolerance of many of us.   \n\nYour irrelevant personal story spun into a lecture not backed by any data doesn’t hit home with many of us.   Get over it",
            "author": "LotBuilder",
            "id": "g9e83pd",
            "parent_id": "t1_g9e5tkn",
            "score": -3,
            "created_utc": 1603160682.0,
            "replies": [
                {
                    "body": "My story about taking to my doctor about sexual health and the false sense of security of a negative test is irrelevant to condom usage? My reminder to consider that hpv extends beyond the two people having sex, such as nonconsenting wives?\n\nGot it. Thanks for your help dude.",
                    "author": "EvaExquisite",
                    "id": "g9eap0t",
                    "parent_id": "t1_g9e83pd",
                    "score": 4,
                    "created_utc": 1603162231.0,
                    "replies": [
                        {
                            "body": "You are an escort (clearly stated in your posting history)  posting in a sugar dating forum pushing an agenda.   Yes,  you should definitely use condoms.  The rest of us will make our own choices.",
                            "author": "LotBuilder",
                            "id": "g9ec6br",
                            "parent_id": "t1_g9eap0t",
                            "score": -1,
                            "created_utc": 1603163154.0,
                            "replies": [
                                {
                                    "body": "Yes, I'm pushing one an agenda... For women's health. Why TF wouldn't I? And I've done so since before I was escorting. I'm not letting you try to sex worker shame me because while I'm here on this subreddit with experience as an SB, sex work allowed me to approach sugar dating the empowered way I wish I did when I was in college.\n\nGo ahead and make your own choices, but know that your choices have real consequences whether you choose to be aware of them or purposely try to misinterpret health recommendations for your own benefit.",
                                    "author": "EvaExquisite",
                                    "id": "g9ee66k",
                                    "parent_id": "t1_g9ec6br",
                                    "score": 8,
                                    "created_utc": 1603164418.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No.  I always use condoms but be aware that if you have a lot of partners; you will be infected with both of these diseases and you need to be aware of that.",
            "author": "TestingTheWater1234",
            "id": "g9e6bg4",
            "parent_id": "t1_g9e667f",
            "score": 2,
            "created_utc": 1603159638.0,
            "replies": []
        },
        {
            "body": "First of all, thank you for this PSA.\n\nTo be fair, you did not emphasize the fact that condoms do not prevent the spread of HPV.  Yes, the likelihood is reduced, but it still spreads *quite* readily even with excellent condom use.  Specifically, it spreads on skin contact.\n\nIt bears repeating because the idea that condoms are sufficient to protect against HPV is *quite common.*  Such is not true.  **ANY SKIN CONTACT, SEXUAL OR OTHERWISE, CAN SPREAD HPV.** \n\nHerpes, too.  And some people are asymptomatic carriers of HSV.\n\nThanks again for the PSA, a lot of people need to hear this message a few times.",
            "author": "tosler",
            "id": "g9e2ndx",
            "parent_id": "t1_g9c408r",
            "score": 0,
            "created_utc": 1603157520.0,
            "replies": [
                {
                    "body": "Yes, condoms are not fail-proof. Nothing is. But boy do they prevent a lot and the fact that they're not fail-proof is NEVER an excuse not to wear one. Not when it's so easy to make everyone's life easier.",
                    "author": "EvaExquisite",
                    "id": "g9e5pou",
                    "parent_id": "t1_g9e2ndx",
                    "score": 1,
                    "created_utc": 1603159291.0,
                    "replies": [
                        {
                            "body": "Agreed 1,000%.\n\nI guess my point is, condoms do not negate the need for STD testing if engaging in sexual contact with multiple partners, and also don't be surprised if an STD is acquired despite appropriate barrier usage.",
                            "author": "tosler",
                            "id": "g9e9c0t",
                            "parent_id": "t1_g9e5pou",
                            "score": 1,
                            "created_utc": 1603161413.0,
                            "replies": [
                                {
                                    "body": "STD testing doesn't replace condoms and vice versa. Both are important and most effective together. The fact that I have to say that explicitly for many of the people reading this gives me little hope for humanity.",
                                    "author": "EvaExquisite",
                                    "id": "g9e9r0a",
                                    "parent_id": "t1_g9e9c0t",
                                    "score": 2,
                                    "created_utc": 1603161663.0,
                                    "replies": [
                                        {
                                            "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
                                            "author": "tosler",
                                            "id": "g9hrqz4",
                                            "parent_id": "t1_g9e9r0a",
                                            "score": 0,
                                            "created_utc": 1603240228.0,
                                            "replies": [
                                                {
                                                    "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                                                    "author": "EvaExquisite",
                                                    "id": "g9l7zvz",
                                                    "parent_id": "t1_g9hrqz4",
                                                    "score": 1,
                                                    "created_utc": 1603318996.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, maybe you didn’t say that you can get it through sex with a condom, but you can.   If you have a relatively normal sex life, you will be exposed to HPV.  \n\nAgain, use condoms if you want, but many people (male and female) will choose to enjoy natural sex and the very small additional HPV risk to a vaccinated woman isn’t going to make a difference to most of them.",
            "author": "UseTheForceRey",
            "id": "g9c4ek8",
            "parent_id": "t1_g9c408r",
            "score": -7,
            "created_utc": 1603122588.0,
            "replies": [
                {
                    "body": "Exposure to HPV is one thing. High risk HPV strains that lead to 70% of cervical cancer cases? Kind of a different story.\n\nAlso, hi there I am a vaccinated woman and my doctor literally told me I could have contracted the high risk strains that are not covered by the vaccine. This is not a small risk.\n\nBy the logic you're giving me, I should go off of my birth control too because it's a small chance I'll get pregnant 🤷‍♀️",
                    "author": "EvaExquisite",
                    "id": "g9c58pp",
                    "parent_id": "t1_g9c4ek8",
                    "score": 8,
                    "created_utc": 1603122935.0,
                    "replies": [
                        {
                            "body": "There is a risk that you can catch one of the strains that cause cancer but are not covered by the vaccine.  I am not going to look up the stats for you but I believe that the relatively low risk multiplied by the relatively small additional protection that using condoms for PIV would add make this a small additional risk.  \n\nYour 70% of cervical cancer cases comment is completely irrelevant to the argument.   It wouldn’t matter if HPV is responsible for 100% of cervical cancer, the added risk to a vaccinated woman of not using condoms for PIV is still low.  And before you turn this into a “SDs don’t care about women” argument, HPV causes penile and anal cancer in men.  That doesn’t change the facts.",
                            "author": "UseTheForceRey",
                            "id": "g9c64ql",
                            "parent_id": "t1_g9c58pp",
                            "score": -1,
                            "created_utc": 1603123303.0,
                            "replies": [
                                {
                                    "body": "I'd love to know what your credentials are for saying that because my primary care doctor seems to think there's a chance of HPV in my sexual history since an ex metamour has cervical cancer.\n\nAnd yes, my cervical cases comment IS relevant because the particular strains they test for after age 30 are the ones that are most likely to lead to cancer (hence why I mentioned it in the first place). We're not currently talking about every strain of HPV, I'm specifically talking about the 10-12 ones that are what they specifically tested me for once I was over 30 years old. This is why 70% of cervical cancer cases is relevant. I'm also not here to minimize your risk with HPV either, but the risks you talk about are more likely to happen via HIV for men than HPV, which also may contribute to why you and many other men are minimizing the risk of HPV. [Source here](https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/hpv-and-cancer-info.html)",
                                    "author": "EvaExquisite",
                                    "id": "g9c9vfv",
                                    "parent_id": "t1_g9c64ql",
                                    "score": 8,
                                    "created_utc": 1603124933.0,
                                    "replies": [
                                        {
                                            "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
                                            "author": "UseTheForceRey",
                                            "id": "g9cav72",
                                            "parent_id": "t1_g9c9vfv",
                                            "score": 0,
                                            "created_utc": 1603125357.0,
                                            "replies": [
                                                {
                                                    "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                                                    "author": "EvaExquisite",
                                                    "id": "g9cb68q",
                                                    "parent_id": "t1_g9cav72",
                                                    "score": 7,
                                                    "created_utc": 1603125491.0,
                                                    "replies": [
                                                        {
                                                            "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                                                            "author": null,
                                                            "id": "g9dpqp0",
                                                            "parent_id": "t1_g9cb68q",
                                                            "score": 0,
                                                            "created_utc": 1603150211.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                                                    "author": "EvaExquisite",
                                                                    "id": "g9dq2o5",
                                                                    "parent_id": "t1_g9dpqp0",
                                                                    "score": 0,
                                                                    "created_utc": 1603150397.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                                                            "author": null,
                                                                            "id": "g9hdhz3",
                                                                            "parent_id": "t1_g9dq2o5",
                                                                            "score": 0,
                                                                            "created_utc": 1603232203.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                                                    "author": "EvaExquisite",
                                                                                    "id": "g9l95jx",
                                                                                    "parent_id": "t1_g9hdhz3",
                                                                                    "score": 1,
                                                                                    "created_utc": 1603319626.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                                                            "author": "sweeterthan_",
                                                                                            "id": "g9lp34g",
                                                                                            "parent_id": "t1_g9l95jx",
                                                                                            "score": 1,
                                                                                            "created_utc": 1603328728.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9dy8cn",
            "parent_id": "t1_g9c408r",
            "score": -2,
            "created_utc": 1603155004.0,
            "replies": [
                {
                    "body": "First off, if you're posting all of your sources as a reason not to wear a condom, I seriously hope your Sugar Babies are not easily manipulated by you.\n\nSecond of all, your sources say it doesn't prevent HPV because there's other possible infection points, not that wearing a condom doesn't eliminate your penis as a possible (and very viable) infection point. To forego a condom because you think getting or giving HPV is unavoidable even with a condom is irresponsible sex regardless of if that's enough to stop it.\n\nThird of all, this post is a PSA for women who don't know this about their sexual health (because, like me and another person on this post that said it, they don't tell you these things when you're a woman in your 20's) and as a PSA for men that have a false sense of security that bare sex isn't harming their clueless partners they're likely cheating on with their SB because \"you're both clean.\"\n\nDespite all of this, you still want me to consult you through how to approach safer sex with your partners, even though the easiest thing you can do to begin to mitigate risk is figure out what your best condom fit is so you can prevent intercourse as a likely way of spreading it?\n\nThen pay me very well to do that consultation.",
                    "author": "EvaExquisite",
                    "id": "g9e56yg",
                    "parent_id": "t1_g9dy8cn",
                    "score": 10,
                    "created_utc": 1603158993.0,
                    "replies": [
                        {
                            "body": "“Obviously get vaccinated and have safe sex” -me \n\nI’m sorry but where am I saying anything about not wearing condoms? I do think that everyone should minimize your risk, but if you are someone that has more than 5 partners in their lifetime, it’s almost certain you will get HPV. 90% of women get it in their lifetime. In the sugar world, even with condoms, there are a lot of people having multiple partners. Condom or not, I think most of us will get some form of it at least temporarily. It’s borderline unavoidable \n\nWear condoms and it’s good you shared this info, but I think we’re really going to have to cut down on our partner number too if we are going to deal with this",
                            "author": null,
                            "id": "g9g64lx",
                            "parent_id": "t1_g9e56yg",
                            "score": 1,
                            "created_utc": 1603212643.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've had irregular pap smears since I was 25, two that have ended in colposcopies and then cleared themselves up. You know what's NOT fun? Colposcopies. They pinch off a piece of your cervix to test and that hurts, and then they put something on it to keep it clean and that sloughs off you eventually in a way that looks like a small grey alien slithered out of you and into your underwear. \n\nThis year, at 31, I had an ovarian cancer scare. Everything is fine, thank goodness, but ladies - you HAVE to look out for yourself. My SBF at the time of the colposcopy was great, but didn't understand the feelings I had about it. \n\nMedical providers know they'll have to fight insurance for abnormal tests, and at least I never learned what strain I had, so unless the big bad medical associations and CDC change their reccomendations for it, testing won't change. Be your own best advocate.",
            "author": "secretactorian",
            "id": "g9e8ezn",
            "parent_id": "t1_g9dkdp8",
            "score": 5,
            "created_utc": 1603160863.0,
            "replies": [
                {
                    "body": "My fiance had to do those regularly (biannually maybe? that was a long time ago) having survived vaginal cancer before we met.  She was tougher than nails, and I don't think she was honest about just how rough those days were.",
                    "author": "RustStainRemover",
                    "id": "g9f8r58",
                    "parent_id": "t1_g9e8ezn",
                    "score": 2,
                    "created_utc": 1603193492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yea. Cervical cancer is also the kindof thing that doesnt' really \"sneak up\" on you. \n\nIf you're getting regular pap smears, that's probably a lot more useful than an HPV test.",
            "author": "ifisch",
            "id": "g9dnoml",
            "parent_id": "t1_g9dkdp8",
            "score": 1,
            "created_utc": 1603149079.0,
            "replies": [
                {
                    "body": "The first part of that second sentence bears repeating:\n\nGET REGULAR PAP SMEARS!",
                    "author": "EvaExquisite",
                    "id": "g9dnuxe",
                    "parent_id": "t1_g9dnoml",
                    "score": 5,
                    "created_utc": 1603149178.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Older people have always been *allowed* to get it, it just isn't routinely offered because, from a public health perspective, it's more effective to vaccinate young people, and there's a constant global shortage of the vaccine.  That, and that insurances don't want to cover the cost.  (It's about 100/shot USD wholesale, plus there's the cost for administering it.)\n\nHowever, older people with compromised immune systems are sometimes given it to prevent warts on other parts of the body.  (There's some cross-protection for other strains of HPV.)  The only reason someone should not get it is if they have an allergy to the ingredients or Guillaine-Barré",
            "author": "sweeterthan_",
            "id": "g9kuuia",
            "parent_id": "t1_g9krt4v",
            "score": 2,
            "created_utc": 1603312761.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "g9kv4t0",
                    "parent_id": "t1_g9kuuia",
                    "score": 0,
                    "created_utc": 1603312900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perfect! Yes this should not just be a \"Don't worry, I'm clean\" conversation. Talks about STD's should be normalized.",
            "author": "EvaExquisite",
            "id": "g9c7o1s",
            "parent_id": "t1_g9c66c7",
            "score": 8,
            "created_utc": 1603123985.0,
            "replies": []
        },
        {
            "body": "I know literally zero 100% zero where the guy uses condoms in a commited longterm relationship.\n\nin the beginning? sure 6 months in NOPE",
            "author": "bookworm010101",
            "id": "g9hvick",
            "parent_id": "t1_g9e876g",
            "score": 0,
            "created_utc": 1603242351.0,
            "replies": [
                {
                    "body": "Again... that’s a *you* thing.",
                    "author": "mattie_east",
                    "id": "g9hvt64",
                    "parent_id": "t1_g9hvick",
                    "score": 3,
                    "created_utc": 1603242522.0,
                    "replies": [
                        {
                            "body": "No it isnt. Go poll 100 married or engaged couples NO guy is using condoms.",
                            "author": "bookworm010101",
                            "id": "g9hvzxw",
                            "parent_id": "t1_g9hvt64",
                            "score": 1,
                            "created_utc": 1603242631.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you misunderstood my meaning of IRL relationships.\n\nSugar, flings, in the beginning, sure condoms, but I know of NO men that are in longterm relatipnships 6 months+ (actual GF commited) using condoms regularly.\n\nMaybe you and your wife or fiance do? That is weird imo.",
            "author": "bookworm010101",
            "id": "g9hvw44",
            "parent_id": "t1_g9ey4j0",
            "score": 1,
            "created_utc": 1603242570.0,
            "replies": []
        },
        {
            "body": "This is unfortunately true.",
            "author": null,
            "id": "g9hdc54",
            "parent_id": "t1_g9dpkl3",
            "score": 0,
            "created_utc": 1603232117.0,
            "replies": []
        },
        {
            "body": "My story about taking to my doctor about sexual health and the false sense of security of a negative test is irrelevant to condom usage? My reminder to consider that hpv extends beyond the two people having sex, such as nonconsenting wives?\n\nGot it. Thanks for your help dude.",
            "author": "EvaExquisite",
            "id": "g9eap0t",
            "parent_id": "t1_g9e83pd",
            "score": 4,
            "created_utc": 1603162231.0,
            "replies": [
                {
                    "body": "You are an escort (clearly stated in your posting history)  posting in a sugar dating forum pushing an agenda.   Yes,  you should definitely use condoms.  The rest of us will make our own choices.",
                    "author": "LotBuilder",
                    "id": "g9ec6br",
                    "parent_id": "t1_g9eap0t",
                    "score": -1,
                    "created_utc": 1603163154.0,
                    "replies": [
                        {
                            "body": "Yes, I'm pushing one an agenda... For women's health. Why TF wouldn't I? And I've done so since before I was escorting. I'm not letting you try to sex worker shame me because while I'm here on this subreddit with experience as an SB, sex work allowed me to approach sugar dating the empowered way I wish I did when I was in college.\n\nGo ahead and make your own choices, but know that your choices have real consequences whether you choose to be aware of them or purposely try to misinterpret health recommendations for your own benefit.",
                            "author": "EvaExquisite",
                            "id": "g9ee66k",
                            "parent_id": "t1_g9ec6br",
                            "score": 8,
                            "created_utc": 1603164418.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, condoms are not fail-proof. Nothing is. But boy do they prevent a lot and the fact that they're not fail-proof is NEVER an excuse not to wear one. Not when it's so easy to make everyone's life easier.",
            "author": "EvaExquisite",
            "id": "g9e5pou",
            "parent_id": "t1_g9e2ndx",
            "score": 1,
            "created_utc": 1603159291.0,
            "replies": [
                {
                    "body": "Agreed 1,000%.\n\nI guess my point is, condoms do not negate the need for STD testing if engaging in sexual contact with multiple partners, and also don't be surprised if an STD is acquired despite appropriate barrier usage.",
                    "author": "tosler",
                    "id": "g9e9c0t",
                    "parent_id": "t1_g9e5pou",
                    "score": 1,
                    "created_utc": 1603161413.0,
                    "replies": [
                        {
                            "body": "STD testing doesn't replace condoms and vice versa. Both are important and most effective together. The fact that I have to say that explicitly for many of the people reading this gives me little hope for humanity.",
                            "author": "EvaExquisite",
                            "id": "g9e9r0a",
                            "parent_id": "t1_g9e9c0t",
                            "score": 2,
                            "created_utc": 1603161663.0,
                            "replies": [
                                {
                                    "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
                                    "author": "tosler",
                                    "id": "g9hrqz4",
                                    "parent_id": "t1_g9e9r0a",
                                    "score": 0,
                                    "created_utc": 1603240228.0,
                                    "replies": [
                                        {
                                            "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                                            "author": "EvaExquisite",
                                            "id": "g9l7zvz",
                                            "parent_id": "t1_g9hrqz4",
                                            "score": 1,
                                            "created_utc": 1603318996.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exposure to HPV is one thing. High risk HPV strains that lead to 70% of cervical cancer cases? Kind of a different story.\n\nAlso, hi there I am a vaccinated woman and my doctor literally told me I could have contracted the high risk strains that are not covered by the vaccine. This is not a small risk.\n\nBy the logic you're giving me, I should go off of my birth control too because it's a small chance I'll get pregnant 🤷‍♀️",
            "author": "EvaExquisite",
            "id": "g9c58pp",
            "parent_id": "t1_g9c4ek8",
            "score": 8,
            "created_utc": 1603122935.0,
            "replies": [
                {
                    "body": "There is a risk that you can catch one of the strains that cause cancer but are not covered by the vaccine.  I am not going to look up the stats for you but I believe that the relatively low risk multiplied by the relatively small additional protection that using condoms for PIV would add make this a small additional risk.  \n\nYour 70% of cervical cancer cases comment is completely irrelevant to the argument.   It wouldn’t matter if HPV is responsible for 100% of cervical cancer, the added risk to a vaccinated woman of not using condoms for PIV is still low.  And before you turn this into a “SDs don’t care about women” argument, HPV causes penile and anal cancer in men.  That doesn’t change the facts.",
                    "author": "UseTheForceRey",
                    "id": "g9c64ql",
                    "parent_id": "t1_g9c58pp",
                    "score": -1,
                    "created_utc": 1603123303.0,
                    "replies": [
                        {
                            "body": "I'd love to know what your credentials are for saying that because my primary care doctor seems to think there's a chance of HPV in my sexual history since an ex metamour has cervical cancer.\n\nAnd yes, my cervical cases comment IS relevant because the particular strains they test for after age 30 are the ones that are most likely to lead to cancer (hence why I mentioned it in the first place). We're not currently talking about every strain of HPV, I'm specifically talking about the 10-12 ones that are what they specifically tested me for once I was over 30 years old. This is why 70% of cervical cancer cases is relevant. I'm also not here to minimize your risk with HPV either, but the risks you talk about are more likely to happen via HIV for men than HPV, which also may contribute to why you and many other men are minimizing the risk of HPV. [Source here](https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/hpv-and-cancer-info.html)",
                            "author": "EvaExquisite",
                            "id": "g9c9vfv",
                            "parent_id": "t1_g9c64ql",
                            "score": 8,
                            "created_utc": 1603124933.0,
                            "replies": [
                                {
                                    "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
                                    "author": "UseTheForceRey",
                                    "id": "g9cav72",
                                    "parent_id": "t1_g9c9vfv",
                                    "score": 0,
                                    "created_utc": 1603125357.0,
                                    "replies": [
                                        {
                                            "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                                            "author": "EvaExquisite",
                                            "id": "g9cb68q",
                                            "parent_id": "t1_g9cav72",
                                            "score": 7,
                                            "created_utc": 1603125491.0,
                                            "replies": [
                                                {
                                                    "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                                                    "author": null,
                                                    "id": "g9dpqp0",
                                                    "parent_id": "t1_g9cb68q",
                                                    "score": 0,
                                                    "created_utc": 1603150211.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                                            "author": "EvaExquisite",
                                                            "id": "g9dq2o5",
                                                            "parent_id": "t1_g9dpqp0",
                                                            "score": 0,
                                                            "created_utc": 1603150397.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                                                    "author": null,
                                                                    "id": "g9hdhz3",
                                                                    "parent_id": "t1_g9dq2o5",
                                                                    "score": 0,
                                                                    "created_utc": 1603232203.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                                            "author": "EvaExquisite",
                                                                            "id": "g9l95jx",
                                                                            "parent_id": "t1_g9hdhz3",
                                                                            "score": 1,
                                                                            "created_utc": 1603319626.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                                                    "author": "sweeterthan_",
                                                                                    "id": "g9lp34g",
                                                                                    "parent_id": "t1_g9l95jx",
                                                                                    "score": 1,
                                                                                    "created_utc": 1603328728.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "First off, if you're posting all of your sources as a reason not to wear a condom, I seriously hope your Sugar Babies are not easily manipulated by you.\n\nSecond of all, your sources say it doesn't prevent HPV because there's other possible infection points, not that wearing a condom doesn't eliminate your penis as a possible (and very viable) infection point. To forego a condom because you think getting or giving HPV is unavoidable even with a condom is irresponsible sex regardless of if that's enough to stop it.\n\nThird of all, this post is a PSA for women who don't know this about their sexual health (because, like me and another person on this post that said it, they don't tell you these things when you're a woman in your 20's) and as a PSA for men that have a false sense of security that bare sex isn't harming their clueless partners they're likely cheating on with their SB because \"you're both clean.\"\n\nDespite all of this, you still want me to consult you through how to approach safer sex with your partners, even though the easiest thing you can do to begin to mitigate risk is figure out what your best condom fit is so you can prevent intercourse as a likely way of spreading it?\n\nThen pay me very well to do that consultation.",
            "author": "EvaExquisite",
            "id": "g9e56yg",
            "parent_id": "t1_g9dy8cn",
            "score": 10,
            "created_utc": 1603158993.0,
            "replies": [
                {
                    "body": "“Obviously get vaccinated and have safe sex” -me \n\nI’m sorry but where am I saying anything about not wearing condoms? I do think that everyone should minimize your risk, but if you are someone that has more than 5 partners in their lifetime, it’s almost certain you will get HPV. 90% of women get it in their lifetime. In the sugar world, even with condoms, there are a lot of people having multiple partners. Condom or not, I think most of us will get some form of it at least temporarily. It’s borderline unavoidable \n\nWear condoms and it’s good you shared this info, but I think we’re really going to have to cut down on our partner number too if we are going to deal with this",
                    "author": null,
                    "id": "g9g64lx",
                    "parent_id": "t1_g9e56yg",
                    "score": 1,
                    "created_utc": 1603212643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My fiance had to do those regularly (biannually maybe? that was a long time ago) having survived vaginal cancer before we met.  She was tougher than nails, and I don't think she was honest about just how rough those days were.",
            "author": "RustStainRemover",
            "id": "g9f8r58",
            "parent_id": "t1_g9e8ezn",
            "score": 2,
            "created_utc": 1603193492.0,
            "replies": []
        },
        {
            "body": "The first part of that second sentence bears repeating:\n\nGET REGULAR PAP SMEARS!",
            "author": "EvaExquisite",
            "id": "g9dnuxe",
            "parent_id": "t1_g9dnoml",
            "score": 5,
            "created_utc": 1603149178.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "g9kv4t0",
            "parent_id": "t1_g9kuuia",
            "score": 0,
            "created_utc": 1603312900.0,
            "replies": []
        },
        {
            "body": "Again... that’s a *you* thing.",
            "author": "mattie_east",
            "id": "g9hvt64",
            "parent_id": "t1_g9hvick",
            "score": 3,
            "created_utc": 1603242522.0,
            "replies": [
                {
                    "body": "No it isnt. Go poll 100 married or engaged couples NO guy is using condoms.",
                    "author": "bookworm010101",
                    "id": "g9hvzxw",
                    "parent_id": "t1_g9hvt64",
                    "score": 1,
                    "created_utc": 1603242631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are an escort (clearly stated in your posting history)  posting in a sugar dating forum pushing an agenda.   Yes,  you should definitely use condoms.  The rest of us will make our own choices.",
            "author": "LotBuilder",
            "id": "g9ec6br",
            "parent_id": "t1_g9eap0t",
            "score": -1,
            "created_utc": 1603163154.0,
            "replies": [
                {
                    "body": "Yes, I'm pushing one an agenda... For women's health. Why TF wouldn't I? And I've done so since before I was escorting. I'm not letting you try to sex worker shame me because while I'm here on this subreddit with experience as an SB, sex work allowed me to approach sugar dating the empowered way I wish I did when I was in college.\n\nGo ahead and make your own choices, but know that your choices have real consequences whether you choose to be aware of them or purposely try to misinterpret health recommendations for your own benefit.",
                    "author": "EvaExquisite",
                    "id": "g9ee66k",
                    "parent_id": "t1_g9ec6br",
                    "score": 8,
                    "created_utc": 1603164418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed 1,000%.\n\nI guess my point is, condoms do not negate the need for STD testing if engaging in sexual contact with multiple partners, and also don't be surprised if an STD is acquired despite appropriate barrier usage.",
            "author": "tosler",
            "id": "g9e9c0t",
            "parent_id": "t1_g9e5pou",
            "score": 1,
            "created_utc": 1603161413.0,
            "replies": [
                {
                    "body": "STD testing doesn't replace condoms and vice versa. Both are important and most effective together. The fact that I have to say that explicitly for many of the people reading this gives me little hope for humanity.",
                    "author": "EvaExquisite",
                    "id": "g9e9r0a",
                    "parent_id": "t1_g9e9c0t",
                    "score": 2,
                    "created_utc": 1603161663.0,
                    "replies": [
                        {
                            "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
                            "author": "tosler",
                            "id": "g9hrqz4",
                            "parent_id": "t1_g9e9r0a",
                            "score": 0,
                            "created_utc": 1603240228.0,
                            "replies": [
                                {
                                    "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                                    "author": "EvaExquisite",
                                    "id": "g9l7zvz",
                                    "parent_id": "t1_g9hrqz4",
                                    "score": 1,
                                    "created_utc": 1603318996.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is a risk that you can catch one of the strains that cause cancer but are not covered by the vaccine.  I am not going to look up the stats for you but I believe that the relatively low risk multiplied by the relatively small additional protection that using condoms for PIV would add make this a small additional risk.  \n\nYour 70% of cervical cancer cases comment is completely irrelevant to the argument.   It wouldn’t matter if HPV is responsible for 100% of cervical cancer, the added risk to a vaccinated woman of not using condoms for PIV is still low.  And before you turn this into a “SDs don’t care about women” argument, HPV causes penile and anal cancer in men.  That doesn’t change the facts.",
            "author": "UseTheForceRey",
            "id": "g9c64ql",
            "parent_id": "t1_g9c58pp",
            "score": -1,
            "created_utc": 1603123303.0,
            "replies": [
                {
                    "body": "I'd love to know what your credentials are for saying that because my primary care doctor seems to think there's a chance of HPV in my sexual history since an ex metamour has cervical cancer.\n\nAnd yes, my cervical cases comment IS relevant because the particular strains they test for after age 30 are the ones that are most likely to lead to cancer (hence why I mentioned it in the first place). We're not currently talking about every strain of HPV, I'm specifically talking about the 10-12 ones that are what they specifically tested me for once I was over 30 years old. This is why 70% of cervical cancer cases is relevant. I'm also not here to minimize your risk with HPV either, but the risks you talk about are more likely to happen via HIV for men than HPV, which also may contribute to why you and many other men are minimizing the risk of HPV. [Source here](https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/hpv-and-cancer-info.html)",
                    "author": "EvaExquisite",
                    "id": "g9c9vfv",
                    "parent_id": "t1_g9c64ql",
                    "score": 8,
                    "created_utc": 1603124933.0,
                    "replies": [
                        {
                            "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
                            "author": "UseTheForceRey",
                            "id": "g9cav72",
                            "parent_id": "t1_g9c9vfv",
                            "score": 0,
                            "created_utc": 1603125357.0,
                            "replies": [
                                {
                                    "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                                    "author": "EvaExquisite",
                                    "id": "g9cb68q",
                                    "parent_id": "t1_g9cav72",
                                    "score": 7,
                                    "created_utc": 1603125491.0,
                                    "replies": [
                                        {
                                            "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                                            "author": null,
                                            "id": "g9dpqp0",
                                            "parent_id": "t1_g9cb68q",
                                            "score": 0,
                                            "created_utc": 1603150211.0,
                                            "replies": [
                                                {
                                                    "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                                    "author": "EvaExquisite",
                                                    "id": "g9dq2o5",
                                                    "parent_id": "t1_g9dpqp0",
                                                    "score": 0,
                                                    "created_utc": 1603150397.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                                            "author": null,
                                                            "id": "g9hdhz3",
                                                            "parent_id": "t1_g9dq2o5",
                                                            "score": 0,
                                                            "created_utc": 1603232203.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                                    "author": "EvaExquisite",
                                                                    "id": "g9l95jx",
                                                                    "parent_id": "t1_g9hdhz3",
                                                                    "score": 1,
                                                                    "created_utc": 1603319626.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                                            "author": "sweeterthan_",
                                                                            "id": "g9lp34g",
                                                                            "parent_id": "t1_g9l95jx",
                                                                            "score": 1,
                                                                            "created_utc": 1603328728.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Obviously get vaccinated and have safe sex” -me \n\nI’m sorry but where am I saying anything about not wearing condoms? I do think that everyone should minimize your risk, but if you are someone that has more than 5 partners in their lifetime, it’s almost certain you will get HPV. 90% of women get it in their lifetime. In the sugar world, even with condoms, there are a lot of people having multiple partners. Condom or not, I think most of us will get some form of it at least temporarily. It’s borderline unavoidable \n\nWear condoms and it’s good you shared this info, but I think we’re really going to have to cut down on our partner number too if we are going to deal with this",
            "author": null,
            "id": "g9g64lx",
            "parent_id": "t1_g9e56yg",
            "score": 1,
            "created_utc": 1603212643.0,
            "replies": []
        },
        {
            "body": "No it isnt. Go poll 100 married or engaged couples NO guy is using condoms.",
            "author": "bookworm010101",
            "id": "g9hvzxw",
            "parent_id": "t1_g9hvt64",
            "score": 1,
            "created_utc": 1603242631.0,
            "replies": []
        },
        {
            "body": "Yes, I'm pushing one an agenda... For women's health. Why TF wouldn't I? And I've done so since before I was escorting. I'm not letting you try to sex worker shame me because while I'm here on this subreddit with experience as an SB, sex work allowed me to approach sugar dating the empowered way I wish I did when I was in college.\n\nGo ahead and make your own choices, but know that your choices have real consequences whether you choose to be aware of them or purposely try to misinterpret health recommendations for your own benefit.",
            "author": "EvaExquisite",
            "id": "g9ee66k",
            "parent_id": "t1_g9ec6br",
            "score": 8,
            "created_utc": 1603164418.0,
            "replies": []
        },
        {
            "body": "STD testing doesn't replace condoms and vice versa. Both are important and most effective together. The fact that I have to say that explicitly for many of the people reading this gives me little hope for humanity.",
            "author": "EvaExquisite",
            "id": "g9e9r0a",
            "parent_id": "t1_g9e9c0t",
            "score": 2,
            "created_utc": 1603161663.0,
            "replies": [
                {
                    "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
                    "author": "tosler",
                    "id": "g9hrqz4",
                    "parent_id": "t1_g9e9r0a",
                    "score": 0,
                    "created_utc": 1603240228.0,
                    "replies": [
                        {
                            "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                            "author": "EvaExquisite",
                            "id": "g9l7zvz",
                            "parent_id": "t1_g9hrqz4",
                            "score": 1,
                            "created_utc": 1603318996.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd love to know what your credentials are for saying that because my primary care doctor seems to think there's a chance of HPV in my sexual history since an ex metamour has cervical cancer.\n\nAnd yes, my cervical cases comment IS relevant because the particular strains they test for after age 30 are the ones that are most likely to lead to cancer (hence why I mentioned it in the first place). We're not currently talking about every strain of HPV, I'm specifically talking about the 10-12 ones that are what they specifically tested me for once I was over 30 years old. This is why 70% of cervical cancer cases is relevant. I'm also not here to minimize your risk with HPV either, but the risks you talk about are more likely to happen via HIV for men than HPV, which also may contribute to why you and many other men are minimizing the risk of HPV. [Source here](https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/hpv-and-cancer-info.html)",
            "author": "EvaExquisite",
            "id": "g9c9vfv",
            "parent_id": "t1_g9c64ql",
            "score": 8,
            "created_utc": 1603124933.0,
            "replies": [
                {
                    "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
                    "author": "UseTheForceRey",
                    "id": "g9cav72",
                    "parent_id": "t1_g9c9vfv",
                    "score": 0,
                    "created_utc": 1603125357.0,
                    "replies": [
                        {
                            "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                            "author": "EvaExquisite",
                            "id": "g9cb68q",
                            "parent_id": "t1_g9cav72",
                            "score": 7,
                            "created_utc": 1603125491.0,
                            "replies": [
                                {
                                    "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                                    "author": null,
                                    "id": "g9dpqp0",
                                    "parent_id": "t1_g9cb68q",
                                    "score": 0,
                                    "created_utc": 1603150211.0,
                                    "replies": [
                                        {
                                            "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                            "author": "EvaExquisite",
                                            "id": "g9dq2o5",
                                            "parent_id": "t1_g9dpqp0",
                                            "score": 0,
                                            "created_utc": 1603150397.0,
                                            "replies": [
                                                {
                                                    "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                                    "author": null,
                                                    "id": "g9hdhz3",
                                                    "parent_id": "t1_g9dq2o5",
                                                    "score": 0,
                                                    "created_utc": 1603232203.0,
                                                    "replies": [
                                                        {
                                                            "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                            "author": "EvaExquisite",
                                                            "id": "g9l95jx",
                                                            "parent_id": "t1_g9hdhz3",
                                                            "score": 1,
                                                            "created_utc": 1603319626.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                                    "author": "sweeterthan_",
                                                                    "id": "g9lp34g",
                                                                    "parent_id": "t1_g9l95jx",
                                                                    "score": 1,
                                                                    "created_utc": 1603328728.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's just that about 3.5 million people turn 18 every year just in the US.  So that's just about 10,000 every day that turn 18.  That is the pace of education that needs to happen just to keep up with the rate of new population.\n\n(Picking age 18 just for convenience of math, the point stands regardless of what age or milestone we pick.  It's a lot of people.)",
            "author": "tosler",
            "id": "g9hrqz4",
            "parent_id": "t1_g9e9r0a",
            "score": 0,
            "created_utc": 1603240228.0,
            "replies": [
                {
                    "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
                    "author": "EvaExquisite",
                    "id": "g9l7zvz",
                    "parent_id": "t1_g9hrqz4",
                    "score": 1,
                    "created_utc": 1603318996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a reading comprehension problem.  I never said you have zero risk.  I’m not going to waste more time arguing with you.",
            "author": "UseTheForceRey",
            "id": "g9cav72",
            "parent_id": "t1_g9c9vfv",
            "score": 0,
            "created_utc": 1603125357.0,
            "replies": [
                {
                    "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
                    "author": "EvaExquisite",
                    "id": "g9cb68q",
                    "parent_id": "t1_g9cav72",
                    "score": 7,
                    "created_utc": 1603125491.0,
                    "replies": [
                        {
                            "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                            "author": null,
                            "id": "g9dpqp0",
                            "parent_id": "t1_g9cb68q",
                            "score": 0,
                            "created_utc": 1603150211.0,
                            "replies": [
                                {
                                    "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                                    "author": "EvaExquisite",
                                    "id": "g9dq2o5",
                                    "parent_id": "t1_g9dpqp0",
                                    "score": 0,
                                    "created_utc": 1603150397.0,
                                    "replies": [
                                        {
                                            "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                            "author": null,
                                            "id": "g9hdhz3",
                                            "parent_id": "t1_g9dq2o5",
                                            "score": 0,
                                            "created_utc": 1603232203.0,
                                            "replies": [
                                                {
                                                    "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                                    "author": "EvaExquisite",
                                                    "id": "g9l95jx",
                                                    "parent_id": "t1_g9hdhz3",
                                                    "score": 1,
                                                    "created_utc": 1603319626.0,
                                                    "replies": [
                                                        {
                                                            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                            "author": "sweeterthan_",
                                                            "id": "g9lp34g",
                                                            "parent_id": "t1_g9l95jx",
                                                            "score": 1,
                                                            "created_utc": 1603328728.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was referring to the fact that I have to say this to men here on this thread that are well over 18. The young women on this thread seem very receptive to the message and/or familiar with this already.\n\nThe problem isn't education. The problem is willingness to accept information, especially when it goes against current beliefs. Sounds like something else we can't get people to wear these days to protect people other than themselves, yes?",
            "author": "EvaExquisite",
            "id": "g9l7zvz",
            "parent_id": "t1_g9hrqz4",
            "score": 1,
            "created_utc": 1603318996.0,
            "replies": []
        },
        {
            "body": "You seem to like putting words into other people's mouths. I never thought you did say zero risk. I'm not going to waste more time arguing with you.",
            "author": "EvaExquisite",
            "id": "g9cb68q",
            "parent_id": "t1_g9cav72",
            "score": 7,
            "created_utc": 1603125491.0,
            "replies": [
                {
                    "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
                    "author": null,
                    "id": "g9dpqp0",
                    "parent_id": "t1_g9cb68q",
                    "score": 0,
                    "created_utc": 1603150211.0,
                    "replies": [
                        {
                            "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                            "author": "EvaExquisite",
                            "id": "g9dq2o5",
                            "parent_id": "t1_g9dpqp0",
                            "score": 0,
                            "created_utc": 1603150397.0,
                            "replies": [
                                {
                                    "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                                    "author": null,
                                    "id": "g9hdhz3",
                                    "parent_id": "t1_g9dq2o5",
                                    "score": 0,
                                    "created_utc": 1603232203.0,
                                    "replies": [
                                        {
                                            "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                            "author": "EvaExquisite",
                                            "id": "g9l95jx",
                                            "parent_id": "t1_g9hdhz3",
                                            "score": 1,
                                            "created_utc": 1603319626.0,
                                            "replies": [
                                                {
                                                    "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                                    "author": "sweeterthan_",
                                                    "id": "g9lp34g",
                                                    "parent_id": "t1_g9l95jx",
                                                    "score": 1,
                                                    "created_utc": 1603328728.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So I’m not taking any side here, but since it’s skin transmission vs fluid, condom use doesn’t present a great protection. (There is some thinking that female condoms may because they cover more area of vulva skin.) I say this as a 100% condom use person, but HPV is a tricky one, as is herpes. \n\nIf you get any flack for asking for the vaccine, stand your ground. Unless there is an arguable reason you shouldn’t (major immunocompromise, etc), the HPV vaccine is worth it. Worst case, it won’t be a panacea for a strain you already have. Especially if you’re under 45, you are within the CDC recommendations as of Oct 2018. Good luck!",
            "author": null,
            "id": "g9dpqp0",
            "parent_id": "t1_g9cb68q",
            "score": 0,
            "created_utc": 1603150211.0,
            "replies": [
                {
                    "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
                    "author": "EvaExquisite",
                    "id": "g9dq2o5",
                    "parent_id": "t1_g9dpqp0",
                    "score": 0,
                    "created_utc": 1603150397.0,
                    "replies": [
                        {
                            "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                            "author": null,
                            "id": "g9hdhz3",
                            "parent_id": "t1_g9dq2o5",
                            "score": 0,
                            "created_utc": 1603232203.0,
                            "replies": [
                                {
                                    "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                                    "author": "EvaExquisite",
                                    "id": "g9l95jx",
                                    "parent_id": "t1_g9hdhz3",
                                    "score": 1,
                                    "created_utc": 1603319626.0,
                                    "replies": [
                                        {
                                            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                            "author": "sweeterthan_",
                                            "id": "g9lp34g",
                                            "parent_id": "t1_g9l95jx",
                                            "score": 1,
                                            "created_utc": 1603328728.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not sure if you were saying that to me, but I already had the vaccine. It doesn't cover all high risk strains.",
            "author": "EvaExquisite",
            "id": "g9dq2o5",
            "parent_id": "t1_g9dpqp0",
            "score": 0,
            "created_utc": 1603150397.0,
            "replies": [
                {
                    "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
                    "author": null,
                    "id": "g9hdhz3",
                    "parent_id": "t1_g9dq2o5",
                    "score": 0,
                    "created_utc": 1603232203.0,
                    "replies": [
                        {
                            "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                            "author": "EvaExquisite",
                            "id": "g9l95jx",
                            "parent_id": "t1_g9hdhz3",
                            "score": 1,
                            "created_utc": 1603319626.0,
                            "replies": [
                                {
                                    "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                                    "author": "sweeterthan_",
                                    "id": "g9lp34g",
                                    "parent_id": "t1_g9l95jx",
                                    "score": 1,
                                    "created_utc": 1603328728.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you got the G4 vaccine several years ago, it won’t, but you can still get the G9, even if you’ve had the first one. The new one covers the four strains that account for up to 80%+ of HPV related cancers.",
            "author": null,
            "id": "g9hdhz3",
            "parent_id": "t1_g9dq2o5",
            "score": 0,
            "created_utc": 1603232203.0,
            "replies": [
                {
                    "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
                    "author": "EvaExquisite",
                    "id": "g9l95jx",
                    "parent_id": "t1_g9hdhz3",
                    "score": 1,
                    "created_utc": 1603319626.0,
                    "replies": [
                        {
                            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                            "author": "sweeterthan_",
                            "id": "g9lp34g",
                            "parent_id": "t1_g9l95jx",
                            "score": 1,
                            "created_utc": 1603328728.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good to know. I'm unsure if I had the G9 or the G4, but if I come back negative I'll talk to my doctor about it. Unfortunately my family was not good about keeping my medical records prior to turning 18 so I have no idea which one I got since the PCP I had growing up retired before I could request them myself.",
            "author": "EvaExquisite",
            "id": "g9l95jx",
            "parent_id": "t1_g9hdhz3",
            "score": 1,
            "created_utc": 1603319626.0,
            "replies": [
                {
                    "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
                    "author": "sweeterthan_",
                    "id": "g9lp34g",
                    "parent_id": "t1_g9l95jx",
                    "score": 1,
                    "created_utc": 1603328728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gardisil 9 came out in late 2014, and was made the only hpv vaccine in the US in 2017.  So, if you were vaccinated before that, you'll want to get the new one too",
            "author": "sweeterthan_",
            "id": "g9lp34g",
            "parent_id": "t1_g9l95jx",
            "score": 1,
            "created_utc": 1603328728.0,
            "replies": []
        }
    ]
}