{
    "title": "Some possibilities of Why you are not having Any Luck SA!",
    "post_id": "hkn5nd",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hkn5nd/some_possibilities_of_why_you_are_not_having_any/",
    "author": "BigBearSD",
    "body": "... on SA!*\n\nSo we see posts multiple times a day asking why someone cant find and SD or SB. Here is a list of common reasons.\n\nFor SBs:\n\n* Not doing any research on this lifestyle/ too lazy to do it and asking for everyone to help you, without any self help first.\n\n* Ghosting and being flakey.\n\n* Location. If you are in a rural, and or economically depressed location you are going to have a harder time than say an SB in a bigger city.\n\n* Location, again. If you are in a huge city with a metric shit ton of competition it may also be harder for you to find an SD, especially given some of following reasons.\n\n* Your profile is horrible. Either it is all about you, and nothing about what you can do. OR it is blank / sparse. Or full of stuff that will turn an SD off to you, such as \"Treat me like the princess I am!\", \"I only do online platonic feet pics!\", \"I deserve to be spoiled!\" Trashing everyone else and just being negative. When in doubt as for a profile review.\n\n* Pics. Your pictures should be flattering, different from one another, show your body and at least private pics of your face. No tounge out snap chat selfie in front of dirty mirror. No drugs... seen pics with needles and spoons in them. When in doubt post here.\n\n* Lack of propper communication. I am a type of guy who can talk to most people, even about random stuff, but if I feel like I am interrogating you. And it takes a week to respond with \"NM HBU?\" I am going to next for someone I can actually talk to. We get you can be busy, but to not respond within  a day or so shows disinterest and SDs will move on to someone who is showing them interests.\n\n* Deviating from conventional standards of beauty. I may get flak for this one, but it is the truth. The heavier / fatter and more conventionally unattractive you are the harder it will be for you to find an SD. Or impossible. These are wealthy men who can pick and choose who they want. Most want thin, athletic and Jessica Rabbit curvy (not fat curvy). There isn't someone for everyone in this lifestyle. Confidence helps, but it can only take you so far in most cases. But of course you may find someone and a few SDs are in to bbw, but most aren't.\n\n* Being too rigid with some standards. Ok, you are in BFE Iowa and demanding a five figure allowance and yet wondering why you cant find an SD. I am not saying sell yourself short, but be reasonable and reasses. Or hold out for the white whale that may never come.  Also this could be used for age or whatever. Say you only want SDs under 40 but a rich and otherwise great and great looking 45 year old guy comes your way, maybe have some wiggle room. Same can be true for younger. Or whatever.\n\n* Only wanting online and blaming Corona. Other women are willing to meet in person now...\n\n* Platonic only. Why do you think a man will pay for just your company because you are cute, when he can have a blast, including intimacy with someone equally or possibly more attractive?\n\n* Escort vibes. If you are treating this purely as sex work and yet wondering why no SD sticks around, or why you are treated like an escort, well.... time to take stock and reevaluate. \n\n* Age. Many SDs prefer younger. I personally prefer in my age range, and many do like SBs in their 30s and 40s, but most prefer women in their 20s. \n\n* Rigidity on what you do behind closed doors. Ok you don't like BDSM, that's fine. But not being comfortable with certain vanilla type stuff will get you nexted most likely. Never compromise on sexual stuff and do stuff you do not want to do though.\n\n* Coming across as way too niave. You will be taken advantage of unless you luck out with a nice guy.\n\n* Falling for Scams / talking about scams in your profile. Makes you look like a mark. \n\n* Being too jaded and bitter. Negativity in the bowl is always a bad thing.\n\n* treating this like a job.\n\n* back to being out of the norm... being too alternative, being a male SB, being trans etc... you are going to have a harder time finding an SD. And this is coming from someone who has had an alternative style SGF and one later who happened to be trans. I am just a realist and take note of what others say and like. I call a spade a spade.\n\n* Not having enough time to do this (for whatever reasons), and only having short immovable windows of time. Life happens. I get it. But there are people who can meet up longer and more often.\n\n* Being desperate. Desperation turns off most SDs, and only attracts the bad ones, and maybe one or two white knight types who feel like they have to save someone... but most don't like it. It will get you taken advantage of.\n\n* Home life. If you have a BF, a Husband etc... most SDs will be turned off by this, or at least be worried by this. Some don't care, but many do.\n\n* Catfishing or Fatfishing\n\n* Talking about other SDs or other Offers\n\n* Constantly glued to your phone while with an SD\n\n* Being ultra political, especially if your politics dont align with SDs. Maybe tone it down?\n\nBut be yourselves just realize there is a lot of competition\n\n-------\n\nFor the SDs\n\n* You come out of the gate swinging promising the moon and the stars, out of lust, but cannot deliver.\n\n* You are a complete pervert immediately. At least wait until the second message guys. ;)\n\n* Making check lists and quiz type stuff for SBs you have never even said hello too. \n\n* Acting like an entitled and controlling dick\n\n* Not bathing or wiping your ass before dates and intimacy\n\n* Acting like a scammer.\n\n* Acting like a stalker.\n\n* Being too jaded\n\n* Not showing a little bit of trust\n\n* Not being honest about your marital status \n\n* Over inflating your disposable income. \n\n* Being a penny pincher\n\n* Falling in love way too quick\n\n*  Not willing to put in some sort of effort in your profile or pictures\n\n* Being creepy at times \n\n* Be able to take hints\n\n* Being unable to hold a normal conversation\n\n* Age. Below 35ish and you may have some more problems, below 28 and you will not be taken seriouslly. Above 60 and your chances also start to diminish. But there is hope.\n\n* Being ultra political. I get it, many of you / us are on the middle to right side of the political spectrum. But many if not most SBs are not. Want to turn her off completely? Talk about politics too much, especially differing ones. Tone it down until you are sure.\n\n* Being too jaded and talking trash about others.\n\n* Comparing POTs to current or former SBs frequently, and or negatively. \n\n* Degrading.\n\n* In to some freaky shit well outside the norm, like scat.\n\n*  Talking down to, or patronizing an SB because she may not be as experienced or old as you. They are adults, if you have to teach, teach by example and in a kind way.\n\n*  Being too clingy and needy, especially early in the morning. Many of us are up and fully awake and at work by or before 8am, do not expect anyone else to hold an in depth conversation by then. \n\n* Catfishing.\n\n* No follow through / flaking.\n\nThoughts?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hkn5nd/some_possibilities_of_why_you_are_not_having_any/",
    "score": 130,
    "upvote_ratio": 0.93,
    "created_utc": 1593797166.0,
    "num_comments": 79,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Well written! The only issue will be that the ones that would need to read this most are the ones most likely not reading this type of advice ...",
            "author": "sdwizard74",
            "id": "fwtnzl8",
            "parent_id": "t3_hkn5nd",
            "score": 38,
            "created_utc": 1593797632.0,
            "replies": [
                {
                    "body": "For an SB, it's an incredibly useless list. Here's the real one\n\n1) Be Attractive\n\n2) Don't be Not Attractive.\n\nA 8.9, & 10 woman can violate every item on the list and still be successful.... which makes the list worthless",
                    "author": "xanfiles",
                    "id": "fwtx0sx",
                    "parent_id": "t1_fwtnzl8",
                    "score": 11,
                    "created_utc": 1593802379.0,
                    "replies": [
                        {
                            "body": "Naw, my wife is very attentive and I hate her with the fury of a thousand burning suns.",
                            "author": "iamjusthonest",
                            "id": "fwusy56",
                            "parent_id": "t1_fwtx0sx",
                            "score": 11,
                            "created_utc": 1593820395.0,
                            "replies": [
                                {
                                    "body": "Username checks out",
                                    "author": "BigMattress269",
                                    "id": "fwvb2ff",
                                    "parent_id": "t1_fwusy56",
                                    "score": 3,
                                    "created_utc": 1593832263.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yet, you married her...which kinda proves my point",
                                    "author": "xanfiles",
                                    "id": "fwy5lgz",
                                    "parent_id": "t1_fwusy56",
                                    "score": 2,
                                    "created_utc": 1593904063.0,
                                    "replies": [
                                        {
                                            "body": "I married her because she had a magical pussy.  Not going to deny that, it had powers I have yet to experience again.  Wasn't her face that got me.  Unfortunately, access to both her lips retired the moment she got that ring.  Moral of the story?  Avoid marriage if possible. \n\nAppearance can gain access, but personality keeps your partner.  I agree with you in terms of looks getting the first initial meet.  However, for longer terms, personality and sexual compatibility definately comes into play (aka allowance).\n\nIf you're wondering why I stayed, well,  I tried divorce once but CA divorce law is very unfriendly towards male bread winners.  My business couldn't survive it.  If I were Jeff Besos rich, I would be divorced by now... \nAs long as I don't embarrass her in front of her group of LV wearing soul suckers, she would let me be.",
                                            "author": "iamjusthonest",
                                            "id": "fwy9d72",
                                            "parent_id": "t1_fwy5lgz",
                                            "score": 5,
                                            "created_utc": 1593906405.0,
                                            "replies": [
                                                {
                                                    "body": "SDs are not looking to get married. They are looking to flirt with hot chicks.The title of this post is \"Some possibilities of why you aren't having any luck\".\n\nShow me a 8, 9, 10 chick (usually white) who is not having any trouble getting SDs and you'll know why that entire list is pointless",
                                                    "author": "xanfiles",
                                                    "id": "fwysssx",
                                                    "parent_id": "t1_fwy9d72",
                                                    "score": 2,
                                                    "created_utc": 1593919925.0,
                                                    "replies": [
                                                        {
                                                            "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
                                                            "author": "iamjusthonest",
                                                            "id": "fwz4azi",
                                                            "parent_id": "t1_fwysssx",
                                                            "score": 4,
                                                            "created_utc": 1593929228.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I disagree.  I've met attractive Pots that did the other things on the do not list, and opted not to proceed further.  There are too many others out there to settle for the behavior noted.",
                            "author": "Boater_88",
                            "id": "fwuakfo",
                            "parent_id": "t1_fwtx0sx",
                            "score": 6,
                            "created_utc": 1593809811.0,
                            "replies": [
                                {
                                    "body": "We are not talking about your choice. We are talking about attributes for success for women. If you are not attractive, none of the things in the list matter. SDs are not looking to marry, they are looking to date hot chicks.\n\nYou don't make a long list without putting that as #1",
                                    "author": "xanfiles",
                                    "id": "fwy6ebk",
                                    "parent_id": "t1_fwuakfo",
                                    "score": 2,
                                    "created_utc": 1593904548.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This is absolutely true for SB's willing to do one time Hookups, but I wouldn't consider them Sugar Babies.   \n\nEven ultra beautiful women get annoying very quickly if they come across entitled, aloof and jaded.  Guys may try for a period of time to \"win over\" a bad attitude or entitlement, but that period won't last long.  Every SD will take an \"8\" or a  \"9\" with sexual compatibility and the \"3A's\" (Attention, Appreciation and Affection) over and entitled and jaded \"10\" every day and all day.  It may just take time to realize how entitled and jaded they may be.",
                            "author": "willfromvb",
                            "id": "fwwgcld",
                            "parent_id": "t1_fwtx0sx",
                            "score": 4,
                            "created_utc": 1593869264.0,
                            "replies": []
                        },
                        {
                            "body": "Also would you keep an SB who was a 10/10 lookswise but was rinsing you, a starfish in bed (the rare times that happened), could not talk about anything, showed 0 interest in you besides your money etc...?\n\nDoubtfully",
                            "author": "BigBearSD",
                            "id": "fwtxkwn",
                            "parent_id": "t1_fwtx0sx",
                            "score": 15,
                            "created_utc": 1593802675.0,
                            "replies": [
                                {
                                    "body": "I think your original question is about having luck and not necessarily about having the right arrangement per what ever you consider to be an ideal arrangement.  I have said this before, the arrangements considered ideal in SLF is a minority of the arrangements that happen on Seeking. So for the majority of the arrangements there, this list is pretty much useless as those SB's are inundated with more than they can deal with.",
                                    "author": "nthcoming",
                                    "id": "fwueeti",
                                    "parent_id": "t1_fwtxkwn",
                                    "score": 3,
                                    "created_utc": 1593811969.0,
                                    "replies": [
                                        {
                                            "body": "I don't think most SB's are inundated with legitimate SD's.  Yes, they are inundated by scammers, Pick Up Artists and Johns, but not real SD's.  There are still way more SB's looking for a legitimate generous SD that are interested in an ongoing Sugar Relationship than there are legitimate generous SD's.\n\nIf I'm seriously interested in a specific SB, I rarely have a problem getting her to meet.  I know my competition can't be that strong.  I'm fit, somewhat good looking, reasonably generous and reasonably personable, but nothing extraordinary.  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together!  lol",
                                            "author": "willfromvb",
                                            "id": "fwwh51q",
                                            "parent_id": "t1_fwueeti",
                                            "score": 0,
                                            "created_utc": 1593869823.0,
                                            "replies": [
                                                {
                                                    "body": ">>  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together! lol\n\n U clearly and quickly went from defending your bullshit list to attacking other SD's and calling them names. Did u take a Selfie?\n\nAlso I am primarily calling bs on your bullshit list for SB's. Did your low self esteem after seeing your selfie clouded your comprehension skills? \n\nSo that this gets into your thick head let me make it simple for u -  your SB list is worthless as a 4 can do all of this and not succeed, but a 8 upwards can ignore every basic rule and can get what she wants.",
                                                    "author": "nthcoming",
                                                    "id": "fwwlg1k",
                                                    "parent_id": "t1_fwwh51q",
                                                    "score": 1,
                                                    "created_utc": 1593872599.0,
                                                    "replies": [
                                                        {
                                                            "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
                                                            "author": "willfromvb",
                                                            "id": "fwwqq4e",
                                                            "parent_id": "t1_fwwlg1k",
                                                            "score": 1,
                                                            "created_utc": 1593875691.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[removed]",
                                                                    "author": null,
                                                                    "id": "fwy0713",
                                                                    "parent_id": "t1_fwwqq4e",
                                                                    "score": 1,
                                                                    "created_utc": 1593900811.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                                                                            "author": "Azurecole",
                                                                            "id": "fwzy9i1",
                                                                            "parent_id": "t1_fwy0713",
                                                                            "score": 1,
                                                                            "created_utc": 1593957503.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Yeah yeah whatever",
                                                                                    "author": "nthcoming",
                                                                                    "id": "fx5mdfe",
                                                                                    "parent_id": "t1_fwzy9i1",
                                                                                    "score": 1,
                                                                                    "created_utc": 1594081371.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "10/10 chicks have no problems in finding SDs, which is kinda point of the post",
                                    "author": "xanfiles",
                                    "id": "fwy6h8i",
                                    "parent_id": "t1_fwtxkwn",
                                    "score": 2,
                                    "created_utc": 1593904597.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yes be attractive. However, attraction only goes so far too. There are attractive women who have great personalities too. This is not just limited to ugly chicks, And vice versa.",
                            "author": "BigBearSD",
                            "id": "fwtxbqp",
                            "parent_id": "t1_fwtx0sx",
                            "score": 11,
                            "created_utc": 1593802539.0,
                            "replies": []
                        },
                        {
                            "body": "We all know looks matter - but, i will shut you down no matter how hot you are if you behave badly.  That is the glory of being an SD.",
                            "author": "Gemini-Fox",
                            "id": "fwuwnhf",
                            "parent_id": "t1_fwtx0sx",
                            "score": 6,
                            "created_utc": 1593822726.0,
                            "replies": [
                                {
                                    "body": "It doesn't matter. Attractive ladies have their pick too and that's what we are discussing.",
                                    "author": "xanfiles",
                                    "id": "fwy6515",
                                    "parent_id": "t1_fwuwnhf",
                                    "score": 1,
                                    "created_utc": 1593904390.0,
                                    "replies": []
                                },
                                {
                                    "body": "I'm not married but as a friend who is and who was an SD noted....  If I wanted drama, chaos and anger  I would simply go home.......",
                                    "author": "pinotandsugar",
                                    "id": "fwvhr6t",
                                    "parent_id": "t1_fwuwnhf",
                                    "score": 1,
                                    "created_utc": 1593837054.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I disagree. This is based on how I roll and my experience. I’ll ditch for topics on this list regardless of looks.",
                            "author": "sdwizard74",
                            "id": "fwu97aw",
                            "parent_id": "t1_fwtx0sx",
                            "score": 3,
                            "created_utc": 1593809051.0,
                            "replies": [
                                {
                                    "body": "We are not talking about you. We are talking about what attributes matter and what doesn't",
                                    "author": "xanfiles",
                                    "id": "fwy5zfp",
                                    "parent_id": "t1_fwu97aw",
                                    "score": 0,
                                    "created_utc": 1593904295.0,
                                    "replies": [
                                        {
                                            "body": "I’m talking about my opinion and experience and I don’t think you get to judge that.",
                                            "author": "sdwizard74",
                                            "id": "fwza6qq",
                                            "parent_id": "t1_fwy5zfp",
                                            "score": 1,
                                            "created_utc": 1593934841.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Attraction goes much deeper than just the physical package, and for me to date someone, a great exterior will not cover up a rotten core.",
                            "author": "Cledaddy23",
                            "id": "fwwtkg5",
                            "parent_id": "t1_fwtx0sx",
                            "score": 3,
                            "created_utc": 1593877275.0,
                            "replies": [
                                {
                                    "body": "Unfortunately, your opinion means diddly-squat in the face of data.\n\nShow me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
                                    "author": "xanfiles",
                                    "id": "fwy5uo2",
                                    "parent_id": "t1_fwwtkg5",
                                    "score": -1,
                                    "created_utc": 1593904216.0,
                                    "replies": [
                                        {
                                            "body": "Show us the data then or stop putting your opinion a above all others.",
                                            "author": "sdwizard74",
                                            "id": "fwzcsup",
                                            "parent_id": "t1_fwy5uo2",
                                            "score": 3,
                                            "created_utc": 1593937507.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Where is your data to back up your opinion?",
                                            "author": "Cledaddy23",
                                            "id": "fx09ppk",
                                            "parent_id": "t1_fwy5uo2",
                                            "score": 2,
                                            "created_utc": 1593964227.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Of the last three POTs I nexted the most attractive two and stuck with the least attractive. The most attractive of them was aggressively contradictory no matter the subject (it's raining out / NO IT ISN'T / ... looks out window at rain and people with umbrellas, uh, yeah it is), the second most was smooth to the point of feeling plastic, almost like you were talking to a flight attendant doing their job, and terrible breath. Third was a normal person, disagreed with me here and there, talked, chatted, had discussions involving different points of view, and in all far more likeable because they were just ... normal. \n\nSo, no it's not just pure attractiveness. As men get older they are less likely to fall into the spell of \"she's hot so acting like a spoiled 11 year old brat is ok.\" SDs have probably had some beautiful girls with them and a wide range of experiences, and once you start feeling that internal groan when she thinks her beauty entitles her to not behave like an adult the feeling of next comes up pretty strong.\n\nHormones drive this for men in their early 20s and to late 20s but after this, that shit gives you a major headache and you no longer have the patience and tolerance for it. \n\nSomeone with whom you can relax, enjoy yourself, play and have fun and who makes you feel good is critical. \n\nNote that if you take care of your body and appearance you just kind of need to meet minimum standards for beauty and it's within reach. Age too is flexible if you are fun as hell. \n\nBut if you come in and you haven't ever gone to the gym, breakfast dinner and lunch are donuts, and you project a political view that this is a real woman's body and men should get used to it, no ... that's going to fail the minimum beauty standard.\n\nI'm in the gym every day doing what I can do. I am not as good as I can be, and I'm trying to be better. For an SB I respect the same thing, I don't expect you to be perfect but pretty good is good, and if you're trying to make yourself better in ANY way (studying, reading, taking classes, going to the gym, just trying) then that bathes you in a hugely positive light.",
                            "author": "amigodeface",
                            "id": "fwviubo",
                            "parent_id": "t1_fwtx0sx",
                            "score": 5,
                            "created_utc": 1593837868.0,
                            "replies": [
                                {
                                    "body": "Show me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
                                    "author": "xanfiles",
                                    "id": "fwy62o7",
                                    "parent_id": "t1_fwviubo",
                                    "score": 1,
                                    "created_utc": 1593904349.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This right here is the truth for over 90% of the SB's on seeking.",
                            "author": "nthcoming",
                            "id": "fwudr8f",
                            "parent_id": "t1_fwtx0sx",
                            "score": 1,
                            "created_utc": 1593811599.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So true!",
                    "author": "EMPOWER_not_enable",
                    "id": "fwu23yn",
                    "parent_id": "t1_fwtnzl8",
                    "score": 2,
                    "created_utc": 1593805127.0,
                    "replies": [
                        {
                            "body": "Two of the fundamentals are understand your product/brand and understand your customer. \n\nMost likely your prospective SD is not the hip 28 year old who although he had a large salary he also has a vast array of IRL opportunities. Most SD's are older, probably more conservative and not the flash-daddys so promoted by SA.  Far too few profiles are aimed at the largest portion of the market.  \n\nMost of these SD's are not looking for more drama in their lives and probably (especially if they are married) place a higher value on reliability ( both in her not cancelling or being very late and in her attitude during the date) .  Few SD are looking for more drama in their life.  \n\nThe best SD's want the SB to have a better life as a result of the relationship.  Not just the financial rewards but in the multitude of other ways a quality SD can help in both the short and long term.   It's one of the rewards,  especially for those SD who are not finding that in IRL . A wise SB subtly speaks to that opportunity  in her profile. \n\nYour profile needs and deserves very careful thought, organization and editing.  Both the text and the pictures should be focused on what you see as the best opportunity and be a carefully edited presentation, not something you threw together after an unhappy IRL date or a call from a creditor.",
                            "author": "pinotandsugar",
                            "id": "fwvhjga",
                            "parent_id": "t1_fwu23yn",
                            "score": 4,
                            "created_utc": 1593836889.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would also add to the SD list that i immediately pass by the bitter profiles. Anything that says \"no, I wont pay you before I meet you. I dont want to buy your feet pics.\" Or a subject line that reads \"why doesn't anyone want to meet me??\". Like, we get it, you've had to wade through scammers just like the rest of us. But the fact is that pic sellers don't read your profile, and the real SBs that actually want to meet you aren't turned on by your nasty side. Also SDs that offer the fraction of typical allowance/ppm",
            "author": "bstractig",
            "id": "fwtsaa3",
            "parent_id": "t3_hkn5nd",
            "score": 23,
            "created_utc": 1593799861.0,
            "replies": [
                {
                    "body": "The above (with a few word changes here and there) applies to SB's too.\n\nWe all need to stop displaying our personal baggage on our profiles - we are trying to court others, not scare them away.",
                    "author": "GDarn",
                    "id": "fwu4gtf",
                    "parent_id": "t1_fwtsaa3",
                    "score": 5,
                    "created_utc": 1593806418.0,
                    "replies": []
                },
                {
                    "body": "Same for SB's for sure. I see so many that say \"Don't waste my time\" (encountered a lot of scammers/flakes) and stuff like \"no I will not sleep with you\" or \"If you're cheap don't message me\". \n\nI guess it is sort of hard for people not to get jaded when they are seeing bad profiles all the time. Seeing someone who seems open to an arrangement and is actually not a negative person is becoming extremely rare. I guess best to avoid those who have been on the site longer than a year?",
                    "author": "UnearthlyDinosaur",
                    "id": "fwx570p",
                    "parent_id": "t1_fwtsaa3",
                    "score": 4,
                    "created_utc": 1593883465.0,
                    "replies": []
                },
                {
                    "body": "I have to admit that the way things are I'm struggling to not add \"won't buy feet pix\" to my profile. But I don't add it for the exact reasons that you say plus it's not going to stop anyone since they don't actually read anything people write. \n\nWhen people add the negative lists to their profile they are venting and unfortunately all of the possible good candidates are the ones who read it and get turned off. The bad candidates don't care.",
                    "author": "amigodeface",
                    "id": "fwvj2e9",
                    "parent_id": "t1_fwtsaa3",
                    "score": 3,
                    "created_utc": 1593838039.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " \"Not bathing or wiping your ass before dates and intimacy\"   WTF?\n\nO\\_O",
            "author": "duckydee543",
            "id": "fwu3uio",
            "parent_id": "t3_hkn5nd",
            "score": 8,
            "created_utc": 1593806074.0,
            "replies": [
                {
                    "body": "There have been inmurous stories here of shit stained sheets, bad breath, stinky dick etc...",
                    "author": "BigBearSD",
                    "id": "fwu5gki",
                    "parent_id": "t1_fwu3uio",
                    "score": 9,
                    "created_utc": 1593806967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwtqlwh",
            "parent_id": "t3_hkn5nd",
            "score": 6,
            "created_utc": 1593798983.0,
            "replies": [
                {
                    "body": "It cycles, towards the end of the month (when rent is coming up) we see an increase. Same around the time colleges start or go on breaks. These tend to be the biggest outside influences when we see complaining a lack of \"good SDs\".",
                    "author": "SD22112211",
                    "id": "fwtr77u",
                    "parent_id": "t1_fwtqlwh",
                    "score": 4,
                    "created_utc": 1593799293.0,
                    "replies": [
                        {
                            "body": "I have also noticed recently it's been a lot of 🎣. Quick post history view and you see they are pic sellers probably coming here hoping to drum up sales under the guise of being SBs. Honestly I report a lot of them lol",
                            "author": "Meowohmeow20",
                            "id": "fwtsg48",
                            "parent_id": "t1_fwtr77u",
                            "score": 4,
                            "created_utc": 1593799943.0,
                            "replies": [
                                {
                                    "body": "Good job on reporting them. I do agree some of them who post with a onlyfan account or the like are fishing. However, I believe a large number of them are just ignorant as to the difference between camming and being a SB. Sadly there are a lot of people giving fake info about this lifestyle without any regard to their actions.",
                                    "author": "SD22112211",
                                    "id": "fwtswfv",
                                    "parent_id": "t1_fwtsg48",
                                    "score": 3,
                                    "created_utc": 1593800183.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A few thoughts...\n\n1) I don't think it's fair to blame a POT SD/SB for not wanting to meet right now during the pandemic. Sure, there are others willing to meet during this time, but at what cost? I know for myself that unless someones been playing it pretty safe, there is no way I'm meeting up with them.\n\n2) Re: body type. I think it's such a personal preference that there is no hard & fast rule when it comes to this. I think it's a stereotype to say most SD's want a certain body type. I'm a size 8/10, honestly sometimes even a 12 in some brands. I've gotten a lot of attention on SA and in real life from POT SD's and I've also had quite a few successful arrangements with attractive, generous men. My body has never been an issue. Ladies if you're reading this and you're not a size 00-6, please don't let this discourage you. \n\n3) On the note of thought #2, I disagree when you say that there isn't \"someone for everyone in this lifestyle.\" I definitely think there is someone for everyone in this lifestyle, it's about finding the right person, just like any other relationship. Yes - looks are a big factor in the bowl, but aren't looks a big factor in most relationships?",
            "author": "shesanewman",
            "id": "fwvi2bm",
            "parent_id": "t3_hkn5nd",
            "score": 6,
            "created_utc": 1593837284.0,
            "replies": [
                {
                    "body": "I agree with this. Girls have enough issues as it is with body image. I haven’t seen many girls I don’t consider attractive (youth is very pretty) the ones that I’m not attracted to I still talk to sometimes and they say their inboxes are full so I learned.",
                    "author": "highjinx411",
                    "id": "fwvkb00",
                    "parent_id": "t1_fwvi2bm",
                    "score": 3,
                    "created_utc": 1593838999.0,
                    "replies": [
                        {
                            "body": "I think that's actually a big part of my appeal to many SD's is the fact that my face looks very young, but my body is 100% womanly i.e. boobs & butt.",
                            "author": "shesanewman",
                            "id": "fwvnj5b",
                            "parent_id": "t1_fwvkb00",
                            "score": 2,
                            "created_utc": 1593841651.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think your #1 is fair. However, do you think it is fair for an SB to ask for an allowance when they are not willing to meet up?",
                    "author": "UnearthlyDinosaur",
                    "id": "fwx5gym",
                    "parent_id": "t1_fwvi2bm",
                    "score": 2,
                    "created_utc": 1593883610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would really like a sugar relationship, like more spoiled gf route. I have met more wealthy/ legit men on Tinder and Bumble. But SA or any of the sugar websites have never really given me any luck despite me following all the guidelines. Not really sure what I’m doing wrong or if SA just isn’t the platform for me.",
            "author": "mochasugarbby",
            "id": "fwunq2e",
            "parent_id": "t3_hkn5nd",
            "score": 5,
            "created_utc": 1593817258.0,
            "replies": []
        },
        {
            "body": "Pretty comprehensive.\n\nThe only quibble would be with the male age range. I'd think the average 20 something or younger SB won't see much difference between forties and anyone older. At that point, it's just \"old\". The difference between 45 and 65 is that the 45 yo still *thinks* he's attractive to someone who is 19, whereas the 65 yo is probably more realistic.\n\nPeople almost always go out with people around their own age. The rest are a small number of outliers. \n\nWhat that means in practical terms is that because guys think they are younger, they need to pay less, and the harder it is for a SB to convince them otherwise. As guys get older and come to terms with the reality that most women are not looking for 65 yo \"silver (or chrome dome) foxes\", it's easier to make the case they need to pay. Plus, generally, the older the richer. \n\nNote, there are obviously exceptions,  but you don't really see many romantic movies or books with big age gaps...there's a reason.",
            "author": "Mangotingthroneway",
            "id": "fwv8t1d",
            "parent_id": "t3_hkn5nd",
            "score": 5,
            "created_utc": 1593830711.0,
            "replies": [
                {
                    "body": "I can say from experience that as I got older I got more attractive to women while what I saw in the mirror was less attractive to me. But there is a peak to that curve. \n\nConfidence and maturity do come naturally to men as they age as they are reflections of experience. Not to say that all men do become mature and confident, but that generally it's your experience that is reflected out of you in those two things.\n\nA super hot guy also has confidence not because he looks in the mirror and knows he's hot, but because he has *experience* of almost every woman he's talked to being charmed by him so that becomes his default attitude that everything is going to go great with this new chat (i.e. confidence).\n\nThe kind of confidence you gain through age is more like, well, nothing terrible is actually going to happen from this chat. You know you can be rejected and it's not the end of the world. You know that though they are stunning they might bore you in 10 minutes so you can't put them on a super high pedestal before you even said hello. You have a lifetime of experience to tap into to judge a situation and to make conversation, and this relaxed state is perceived as well as confidence. \n\nWomen respond negatively to insecurity and positively to confidence in general. So as you age, provided you did something interesting with your life, you just become more attractive as you become more self assured and more interesting. And don't let yourself fall apart.\n\nA guy at 45 who took care of himself, is successful at business, projects confidence and experience, he is very likely close to peak male attractiveness. Think of Brad Pitt or George Clooney at 45. \n\nOptimal male and nobody would be going ewww. Fat, balding, middle manager with no sense of fashion style and no confidence ... everyone will go ew because you see that as someone who failed at the experiment that is their life. They have nothing to offer and you can easily project what the rest of their life is going to look like.",
                    "author": "amigodeface",
                    "id": "fwvjpkr",
                    "parent_id": "t1_fwv8t1d",
                    "score": 5,
                    "created_utc": 1593838532.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can guarantee....three or so posts from this one someone will be posting “why am I having no luck on SA??!!” 🤣🤣",
            "author": "SunnyWinter85",
            "id": "fwtr9az",
            "parent_id": "t3_hkn5nd",
            "score": 7,
            "created_utc": 1593799323.0,
            "replies": [
                {
                    "body": "A few already! This has been posted less than an hour... 😂😂😂",
                    "author": "BigBearSD",
                    "id": "fwts87k",
                    "parent_id": "t1_fwtr9az",
                    "score": 6,
                    "created_utc": 1593799831.0,
                    "replies": [
                        {
                            "body": "Those are just the ones you managed to see before I deleted them",
                            "author": "Azurecole",
                            "id": "fwtztjv",
                            "parent_id": "t1_fwts87k",
                            "score": 3,
                            "created_utc": 1593803880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"Be able to take hints\" should probably be a *do*, not a *don't*.",
            "author": "SeattleLaserMeteor",
            "id": "fwu3g6b",
            "parent_id": "t3_hkn5nd",
            "score": 3,
            "created_utc": 1593805858.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwub07x",
            "parent_id": "t3_hkn5nd",
            "score": 3,
            "created_utc": 1593810059.0,
            "replies": [
                {
                    "body": "That is funny cause it works both ways. I get a ton of just \"request to see your pictures\" while I clearly state that those will be unanswered without any actual message, and I automatically show my pics when I get a nice message from an SB. But I still often have to request for theirs even when I show mine. I actually dislike  requesting them when I have shown mine since it feels like a simple and respectful courtaissy to me, but definitely not always the case.   We all value our privacy but come on.",
                    "author": "noctris1981",
                    "id": "fwuoa3f",
                    "parent_id": "t1_fwub07x",
                    "score": 2,
                    "created_utc": 1593817581.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fwup1pb",
                            "parent_id": "t1_fwuoa3f",
                            "score": 2,
                            "created_utc": 1593818030.0,
                            "replies": [
                                {
                                    "body": "Oh, no judgement there, I identify as a sapio mostly, but let's be honest, looks are a thing, and despite having a little essay on my profile, I get those requests too..it is just part of the game i guess. If her profile has nothing interesting, I ignore it. If it does, I share them and ask something I want to know 🤷‍♂️",
                                    "author": "noctris1981",
                                    "id": "fwuphvq",
                                    "parent_id": "t1_fwup1pb",
                                    "score": 1,
                                    "created_utc": 1593818294.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fwupon9",
                                            "parent_id": "t1_fwuphvq",
                                            "score": 1,
                                            "created_utc": 1593818408.0,
                                            "replies": [
                                                {
                                                    "body": "Ha, assuming that last emoji represents a nerd; yes, and loud and proud 😉",
                                                    "author": "noctris1981",
                                                    "id": "fwupz3p",
                                                    "parent_id": "t1_fwupon9",
                                                    "score": 2,
                                                    "created_utc": 1593818580.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If the person wrote about 1 line of profile text and has hidden pictures, I'll click the photos without saying anything. Have a well written profile with lots to talk about and I'll write and not click the photos. \n\nGotta work with what you have.\n\nIf the person responds and we go back and forth and seem to be hitting it off, then I'll click the pics.\n\nSometimes the no-texter will just open the pictures and never even look at my profile. I'll look at the pictures and move on. Shockingly they are not as interesting as one would hope.",
                    "author": "amigodeface",
                    "id": "fwwt5so",
                    "parent_id": "t1_fwub07x",
                    "score": 0,
                    "created_utc": 1593877049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would add for SBs to post at least more than 3 pics.  Many SB profiles on there  have just 1 or 2 pictures and honestly seem like bot/fake profiles.",
            "author": "Magnolia1008",
            "id": "fwuvwea",
            "parent_id": "t3_hkn5nd",
            "score": 3,
            "created_utc": 1593822244.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwu8zet",
            "parent_id": "t3_hkn5nd",
            "score": 2,
            "created_utc": 1593808929.0,
            "replies": [
                {
                    "body": "That is SDs that use reddit. Most do not.",
                    "author": "BigBearSD",
                    "id": "fwuk2xm",
                    "parent_id": "t1_fwu8zet",
                    "score": 2,
                    "created_utc": 1593815158.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\^ This should be a stickie.",
            "author": "Intrepid_Seeker",
            "id": "fwto3dg",
            "parent_id": "t3_hkn5nd",
            "score": 3,
            "created_utc": 1593797686.0,
            "replies": [
                {
                    "body": "Seconded.  This is a pretty good thread.  Even if you don't agree with every single point.",
                    "author": "duckydee543",
                    "id": "fwu4f37",
                    "parent_id": "t1_fwto3dg",
                    "score": 1,
                    "created_utc": 1593806391.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Excuse me?? Pics with needles and drugs in the photo. What the actual fuck? 🤦🏼‍♀️",
            "author": "bassoonage",
            "id": "fwtxg1g",
            "parent_id": "t3_hkn5nd",
            "score": 2,
            "created_utc": 1593802604.0,
            "replies": [
                {
                    "body": "Yep have seen this a few times. Instant block.",
                    "author": "BigBearSD",
                    "id": "fwtxn6p",
                    "parent_id": "t1_fwtxg1g",
                    "score": 2,
                    "created_utc": 1593802708.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You cant write or be mad “blaming corona, other women are meeting up” ...its a health pandemic \nImagine if your sb decided to meet then your wife, kids, mom get it and die...then with contract tracing your big SB secret is leaked lol\nNow with unprecedented lack of jobs so many more women are going to be turning to prostitution as this is technically a form of prostitution you will see an influx in people on this website all desperately trying to earn money watch and weights I assure you it will happen\n\nMy hypothesis is prostitution is going to go way up and the value and payment sugar babies get is going to go way down due to the sugar daddies earning less money and money many of them being laid off, and many young women being laid off and this is the only opportunity they now have",
            "author": "zspacetrucker",
            "id": "fwumg2f",
            "parent_id": "t3_hkn5nd",
            "score": 3,
            "created_utc": 1593816520.0,
            "replies": []
        },
        {
            "body": "Great post!",
            "author": "EMPOWER_not_enable",
            "id": "fwu29kv",
            "parent_id": "t3_hkn5nd",
            "score": 1,
            "created_utc": 1593805213.0,
            "replies": []
        },
        {
            "body": "I would add for SD’s, your pic and looks are still the most important thing. One would assume as a sugaring website, most girls are more interested in your financial capabilities. However, I’ve found it’s still physical attractiveness that is the first obstacle SDs have to conquer.\n\nI posted a profile review and more than half the criticism was aimed at my pic. I haven’t gotten a chance to take better pictures, but I HAVE made all edits suggested to me on my actual profile. It doesn’t matter. Less than 25% of the SBs I messaged even read my message or looked at my profile. I’m guessing they saw the thumbnail of my pic and nexted me.",
            "author": "mcsylv",
            "id": "fwwrtsk",
            "parent_id": "t3_hkn5nd",
            "score": 1,
            "created_utc": 1593876304.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwux18b",
            "parent_id": "t3_hkn5nd",
            "score": 1,
            "created_utc": 1593822969.0,
            "replies": [
                {
                    "body": "Big mood. You got this though, never forget that :)",
                    "author": "Ipatchcat",
                    "id": "fwuzz13",
                    "parent_id": "t1_fwux18b",
                    "score": 1,
                    "created_utc": 1593824854.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[Can I get an AMEN up in here!](https://media0.giphy.com/media/LqxlJ7XfwalmnjuXLG/giphy.gif)",
            "author": "sdaddy305",
            "id": "fwtor98",
            "parent_id": "t3_hkn5nd",
            "score": 0,
            "created_utc": 1593798026.0,
            "replies": []
        },
        {
            "body": "How do I updoot this more than once",
            "author": "otherwise-sorbet03",
            "id": "fwtuo3u",
            "parent_id": "t3_hkn5nd",
            "score": 0,
            "created_utc": 1593801118.0,
            "replies": [
                {
                    "body": "The same way you get your Reddit account suspended :)",
                    "author": "GDarn",
                    "id": "fwu4lv1",
                    "parent_id": "t1_fwtuo3u",
                    "score": 1,
                    "created_utc": 1593806494.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well written brother!!! Now if only every women joining SA had to read and agree to this before joining 🤣😭",
            "author": "ruphun",
            "id": "fwtsth0",
            "parent_id": "t3_hkn5nd",
            "score": -4,
            "created_utc": 1593800140.0,
            "replies": [
                {
                    "body": "Hahaha and guys! Lol \n\nBut agreed",
                    "author": "BigBearSD",
                    "id": "fwtsxts",
                    "parent_id": "t1_fwtsth0",
                    "score": 4,
                    "created_utc": 1593800203.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a must read, even covers important points that SA blogs don't address",
            "author": "Rich_Wishbone",
            "id": "fwtqjvp",
            "parent_id": "t3_hkn5nd",
            "score": -1,
            "created_utc": 1593798955.0,
            "replies": []
        },
        {
            "body": "For almost $100/month.....WTF is SA doing then if you have to figure all this shit out??!!\n\nLmao that you men torture yourselves by being paying members 🤦‍♂️😆",
            "author": "EnthusiasmHuman957",
            "id": "fwtv1xg",
            "parent_id": "t3_hkn5nd",
            "score": -4,
            "created_utc": 1593801321.0,
            "replies": [
                {
                    "body": "Well, 90 bucks a month isn't that much.  Plus, it is always a good idea to figure things out.  That helps you succeed.  Weeding through scammers, flakes and general shitty people isn't easy sometimes.\n\nBut... Once you figure it out, it's really pretty easy going.",
                    "author": "duckydee543",
                    "id": "fwu4v33",
                    "parent_id": "t1_fwtv1xg",
                    "score": 3,
                    "created_utc": 1593806637.0,
                    "replies": []
                },
                {
                    "body": ">Lmao that you men torture yourselves by being paying members\n\nGlad you are getting a chortle.\n\nI've been getting amazing relationships with people I never would have met without SA.\n\nWe seem to both benefit from SA, if in varied degrees :)",
                    "author": "GDarn",
                    "id": "fwu4s1k",
                    "parent_id": "t1_fwtv1xg",
                    "score": 2,
                    "created_utc": 1593806591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For an SB, it's an incredibly useless list. Here's the real one\n\n1) Be Attractive\n\n2) Don't be Not Attractive.\n\nA 8.9, & 10 woman can violate every item on the list and still be successful.... which makes the list worthless",
            "author": "xanfiles",
            "id": "fwtx0sx",
            "parent_id": "t1_fwtnzl8",
            "score": 11,
            "created_utc": 1593802379.0,
            "replies": [
                {
                    "body": "Naw, my wife is very attentive and I hate her with the fury of a thousand burning suns.",
                    "author": "iamjusthonest",
                    "id": "fwusy56",
                    "parent_id": "t1_fwtx0sx",
                    "score": 11,
                    "created_utc": 1593820395.0,
                    "replies": [
                        {
                            "body": "Username checks out",
                            "author": "BigMattress269",
                            "id": "fwvb2ff",
                            "parent_id": "t1_fwusy56",
                            "score": 3,
                            "created_utc": 1593832263.0,
                            "replies": []
                        },
                        {
                            "body": "Yet, you married her...which kinda proves my point",
                            "author": "xanfiles",
                            "id": "fwy5lgz",
                            "parent_id": "t1_fwusy56",
                            "score": 2,
                            "created_utc": 1593904063.0,
                            "replies": [
                                {
                                    "body": "I married her because she had a magical pussy.  Not going to deny that, it had powers I have yet to experience again.  Wasn't her face that got me.  Unfortunately, access to both her lips retired the moment she got that ring.  Moral of the story?  Avoid marriage if possible. \n\nAppearance can gain access, but personality keeps your partner.  I agree with you in terms of looks getting the first initial meet.  However, for longer terms, personality and sexual compatibility definately comes into play (aka allowance).\n\nIf you're wondering why I stayed, well,  I tried divorce once but CA divorce law is very unfriendly towards male bread winners.  My business couldn't survive it.  If I were Jeff Besos rich, I would be divorced by now... \nAs long as I don't embarrass her in front of her group of LV wearing soul suckers, she would let me be.",
                                    "author": "iamjusthonest",
                                    "id": "fwy9d72",
                                    "parent_id": "t1_fwy5lgz",
                                    "score": 5,
                                    "created_utc": 1593906405.0,
                                    "replies": [
                                        {
                                            "body": "SDs are not looking to get married. They are looking to flirt with hot chicks.The title of this post is \"Some possibilities of why you aren't having any luck\".\n\nShow me a 8, 9, 10 chick (usually white) who is not having any trouble getting SDs and you'll know why that entire list is pointless",
                                            "author": "xanfiles",
                                            "id": "fwysssx",
                                            "parent_id": "t1_fwy9d72",
                                            "score": 2,
                                            "created_utc": 1593919925.0,
                                            "replies": [
                                                {
                                                    "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
                                                    "author": "iamjusthonest",
                                                    "id": "fwz4azi",
                                                    "parent_id": "t1_fwysssx",
                                                    "score": 4,
                                                    "created_utc": 1593929228.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I disagree.  I've met attractive Pots that did the other things on the do not list, and opted not to proceed further.  There are too many others out there to settle for the behavior noted.",
                    "author": "Boater_88",
                    "id": "fwuakfo",
                    "parent_id": "t1_fwtx0sx",
                    "score": 6,
                    "created_utc": 1593809811.0,
                    "replies": [
                        {
                            "body": "We are not talking about your choice. We are talking about attributes for success for women. If you are not attractive, none of the things in the list matter. SDs are not looking to marry, they are looking to date hot chicks.\n\nYou don't make a long list without putting that as #1",
                            "author": "xanfiles",
                            "id": "fwy6ebk",
                            "parent_id": "t1_fwuakfo",
                            "score": 2,
                            "created_utc": 1593904548.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is absolutely true for SB's willing to do one time Hookups, but I wouldn't consider them Sugar Babies.   \n\nEven ultra beautiful women get annoying very quickly if they come across entitled, aloof and jaded.  Guys may try for a period of time to \"win over\" a bad attitude or entitlement, but that period won't last long.  Every SD will take an \"8\" or a  \"9\" with sexual compatibility and the \"3A's\" (Attention, Appreciation and Affection) over and entitled and jaded \"10\" every day and all day.  It may just take time to realize how entitled and jaded they may be.",
                    "author": "willfromvb",
                    "id": "fwwgcld",
                    "parent_id": "t1_fwtx0sx",
                    "score": 4,
                    "created_utc": 1593869264.0,
                    "replies": []
                },
                {
                    "body": "Also would you keep an SB who was a 10/10 lookswise but was rinsing you, a starfish in bed (the rare times that happened), could not talk about anything, showed 0 interest in you besides your money etc...?\n\nDoubtfully",
                    "author": "BigBearSD",
                    "id": "fwtxkwn",
                    "parent_id": "t1_fwtx0sx",
                    "score": 15,
                    "created_utc": 1593802675.0,
                    "replies": [
                        {
                            "body": "I think your original question is about having luck and not necessarily about having the right arrangement per what ever you consider to be an ideal arrangement.  I have said this before, the arrangements considered ideal in SLF is a minority of the arrangements that happen on Seeking. So for the majority of the arrangements there, this list is pretty much useless as those SB's are inundated with more than they can deal with.",
                            "author": "nthcoming",
                            "id": "fwueeti",
                            "parent_id": "t1_fwtxkwn",
                            "score": 3,
                            "created_utc": 1593811969.0,
                            "replies": [
                                {
                                    "body": "I don't think most SB's are inundated with legitimate SD's.  Yes, they are inundated by scammers, Pick Up Artists and Johns, but not real SD's.  There are still way more SB's looking for a legitimate generous SD that are interested in an ongoing Sugar Relationship than there are legitimate generous SD's.\n\nIf I'm seriously interested in a specific SB, I rarely have a problem getting her to meet.  I know my competition can't be that strong.  I'm fit, somewhat good looking, reasonably generous and reasonably personable, but nothing extraordinary.  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together!  lol",
                                    "author": "willfromvb",
                                    "id": "fwwh51q",
                                    "parent_id": "t1_fwueeti",
                                    "score": 0,
                                    "created_utc": 1593869823.0,
                                    "replies": [
                                        {
                                            "body": ">>  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together! lol\n\n U clearly and quickly went from defending your bullshit list to attacking other SD's and calling them names. Did u take a Selfie?\n\nAlso I am primarily calling bs on your bullshit list for SB's. Did your low self esteem after seeing your selfie clouded your comprehension skills? \n\nSo that this gets into your thick head let me make it simple for u -  your SB list is worthless as a 4 can do all of this and not succeed, but a 8 upwards can ignore every basic rule and can get what she wants.",
                                            "author": "nthcoming",
                                            "id": "fwwlg1k",
                                            "parent_id": "t1_fwwh51q",
                                            "score": 1,
                                            "created_utc": 1593872599.0,
                                            "replies": [
                                                {
                                                    "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
                                                    "author": "willfromvb",
                                                    "id": "fwwqq4e",
                                                    "parent_id": "t1_fwwlg1k",
                                                    "score": 1,
                                                    "created_utc": 1593875691.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "fwy0713",
                                                            "parent_id": "t1_fwwqq4e",
                                                            "score": 1,
                                                            "created_utc": 1593900811.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                                                                    "author": "Azurecole",
                                                                    "id": "fwzy9i1",
                                                                    "parent_id": "t1_fwy0713",
                                                                    "score": 1,
                                                                    "created_utc": 1593957503.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah yeah whatever",
                                                                            "author": "nthcoming",
                                                                            "id": "fx5mdfe",
                                                                            "parent_id": "t1_fwzy9i1",
                                                                            "score": 1,
                                                                            "created_utc": 1594081371.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "10/10 chicks have no problems in finding SDs, which is kinda point of the post",
                            "author": "xanfiles",
                            "id": "fwy6h8i",
                            "parent_id": "t1_fwtxkwn",
                            "score": 2,
                            "created_utc": 1593904597.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes be attractive. However, attraction only goes so far too. There are attractive women who have great personalities too. This is not just limited to ugly chicks, And vice versa.",
                    "author": "BigBearSD",
                    "id": "fwtxbqp",
                    "parent_id": "t1_fwtx0sx",
                    "score": 11,
                    "created_utc": 1593802539.0,
                    "replies": []
                },
                {
                    "body": "We all know looks matter - but, i will shut you down no matter how hot you are if you behave badly.  That is the glory of being an SD.",
                    "author": "Gemini-Fox",
                    "id": "fwuwnhf",
                    "parent_id": "t1_fwtx0sx",
                    "score": 6,
                    "created_utc": 1593822726.0,
                    "replies": [
                        {
                            "body": "It doesn't matter. Attractive ladies have their pick too and that's what we are discussing.",
                            "author": "xanfiles",
                            "id": "fwy6515",
                            "parent_id": "t1_fwuwnhf",
                            "score": 1,
                            "created_utc": 1593904390.0,
                            "replies": []
                        },
                        {
                            "body": "I'm not married but as a friend who is and who was an SD noted....  If I wanted drama, chaos and anger  I would simply go home.......",
                            "author": "pinotandsugar",
                            "id": "fwvhr6t",
                            "parent_id": "t1_fwuwnhf",
                            "score": 1,
                            "created_utc": 1593837054.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I disagree. This is based on how I roll and my experience. I’ll ditch for topics on this list regardless of looks.",
                    "author": "sdwizard74",
                    "id": "fwu97aw",
                    "parent_id": "t1_fwtx0sx",
                    "score": 3,
                    "created_utc": 1593809051.0,
                    "replies": [
                        {
                            "body": "We are not talking about you. We are talking about what attributes matter and what doesn't",
                            "author": "xanfiles",
                            "id": "fwy5zfp",
                            "parent_id": "t1_fwu97aw",
                            "score": 0,
                            "created_utc": 1593904295.0,
                            "replies": [
                                {
                                    "body": "I’m talking about my opinion and experience and I don’t think you get to judge that.",
                                    "author": "sdwizard74",
                                    "id": "fwza6qq",
                                    "parent_id": "t1_fwy5zfp",
                                    "score": 1,
                                    "created_utc": 1593934841.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Attraction goes much deeper than just the physical package, and for me to date someone, a great exterior will not cover up a rotten core.",
                    "author": "Cledaddy23",
                    "id": "fwwtkg5",
                    "parent_id": "t1_fwtx0sx",
                    "score": 3,
                    "created_utc": 1593877275.0,
                    "replies": [
                        {
                            "body": "Unfortunately, your opinion means diddly-squat in the face of data.\n\nShow me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
                            "author": "xanfiles",
                            "id": "fwy5uo2",
                            "parent_id": "t1_fwwtkg5",
                            "score": -1,
                            "created_utc": 1593904216.0,
                            "replies": [
                                {
                                    "body": "Show us the data then or stop putting your opinion a above all others.",
                                    "author": "sdwizard74",
                                    "id": "fwzcsup",
                                    "parent_id": "t1_fwy5uo2",
                                    "score": 3,
                                    "created_utc": 1593937507.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where is your data to back up your opinion?",
                                    "author": "Cledaddy23",
                                    "id": "fx09ppk",
                                    "parent_id": "t1_fwy5uo2",
                                    "score": 2,
                                    "created_utc": 1593964227.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Of the last three POTs I nexted the most attractive two and stuck with the least attractive. The most attractive of them was aggressively contradictory no matter the subject (it's raining out / NO IT ISN'T / ... looks out window at rain and people with umbrellas, uh, yeah it is), the second most was smooth to the point of feeling plastic, almost like you were talking to a flight attendant doing their job, and terrible breath. Third was a normal person, disagreed with me here and there, talked, chatted, had discussions involving different points of view, and in all far more likeable because they were just ... normal. \n\nSo, no it's not just pure attractiveness. As men get older they are less likely to fall into the spell of \"she's hot so acting like a spoiled 11 year old brat is ok.\" SDs have probably had some beautiful girls with them and a wide range of experiences, and once you start feeling that internal groan when she thinks her beauty entitles her to not behave like an adult the feeling of next comes up pretty strong.\n\nHormones drive this for men in their early 20s and to late 20s but after this, that shit gives you a major headache and you no longer have the patience and tolerance for it. \n\nSomeone with whom you can relax, enjoy yourself, play and have fun and who makes you feel good is critical. \n\nNote that if you take care of your body and appearance you just kind of need to meet minimum standards for beauty and it's within reach. Age too is flexible if you are fun as hell. \n\nBut if you come in and you haven't ever gone to the gym, breakfast dinner and lunch are donuts, and you project a political view that this is a real woman's body and men should get used to it, no ... that's going to fail the minimum beauty standard.\n\nI'm in the gym every day doing what I can do. I am not as good as I can be, and I'm trying to be better. For an SB I respect the same thing, I don't expect you to be perfect but pretty good is good, and if you're trying to make yourself better in ANY way (studying, reading, taking classes, going to the gym, just trying) then that bathes you in a hugely positive light.",
                    "author": "amigodeface",
                    "id": "fwviubo",
                    "parent_id": "t1_fwtx0sx",
                    "score": 5,
                    "created_utc": 1593837868.0,
                    "replies": [
                        {
                            "body": "Show me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
                            "author": "xanfiles",
                            "id": "fwy62o7",
                            "parent_id": "t1_fwviubo",
                            "score": 1,
                            "created_utc": 1593904349.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This right here is the truth for over 90% of the SB's on seeking.",
                    "author": "nthcoming",
                    "id": "fwudr8f",
                    "parent_id": "t1_fwtx0sx",
                    "score": 1,
                    "created_utc": 1593811599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true!",
            "author": "EMPOWER_not_enable",
            "id": "fwu23yn",
            "parent_id": "t1_fwtnzl8",
            "score": 2,
            "created_utc": 1593805127.0,
            "replies": [
                {
                    "body": "Two of the fundamentals are understand your product/brand and understand your customer. \n\nMost likely your prospective SD is not the hip 28 year old who although he had a large salary he also has a vast array of IRL opportunities. Most SD's are older, probably more conservative and not the flash-daddys so promoted by SA.  Far too few profiles are aimed at the largest portion of the market.  \n\nMost of these SD's are not looking for more drama in their lives and probably (especially if they are married) place a higher value on reliability ( both in her not cancelling or being very late and in her attitude during the date) .  Few SD are looking for more drama in their life.  \n\nThe best SD's want the SB to have a better life as a result of the relationship.  Not just the financial rewards but in the multitude of other ways a quality SD can help in both the short and long term.   It's one of the rewards,  especially for those SD who are not finding that in IRL . A wise SB subtly speaks to that opportunity  in her profile. \n\nYour profile needs and deserves very careful thought, organization and editing.  Both the text and the pictures should be focused on what you see as the best opportunity and be a carefully edited presentation, not something you threw together after an unhappy IRL date or a call from a creditor.",
                    "author": "pinotandsugar",
                    "id": "fwvhjga",
                    "parent_id": "t1_fwu23yn",
                    "score": 4,
                    "created_utc": 1593836889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The above (with a few word changes here and there) applies to SB's too.\n\nWe all need to stop displaying our personal baggage on our profiles - we are trying to court others, not scare them away.",
            "author": "GDarn",
            "id": "fwu4gtf",
            "parent_id": "t1_fwtsaa3",
            "score": 5,
            "created_utc": 1593806418.0,
            "replies": []
        },
        {
            "body": "Same for SB's for sure. I see so many that say \"Don't waste my time\" (encountered a lot of scammers/flakes) and stuff like \"no I will not sleep with you\" or \"If you're cheap don't message me\". \n\nI guess it is sort of hard for people not to get jaded when they are seeing bad profiles all the time. Seeing someone who seems open to an arrangement and is actually not a negative person is becoming extremely rare. I guess best to avoid those who have been on the site longer than a year?",
            "author": "UnearthlyDinosaur",
            "id": "fwx570p",
            "parent_id": "t1_fwtsaa3",
            "score": 4,
            "created_utc": 1593883465.0,
            "replies": []
        },
        {
            "body": "I have to admit that the way things are I'm struggling to not add \"won't buy feet pix\" to my profile. But I don't add it for the exact reasons that you say plus it's not going to stop anyone since they don't actually read anything people write. \n\nWhen people add the negative lists to their profile they are venting and unfortunately all of the possible good candidates are the ones who read it and get turned off. The bad candidates don't care.",
            "author": "amigodeface",
            "id": "fwvj2e9",
            "parent_id": "t1_fwtsaa3",
            "score": 3,
            "created_utc": 1593838039.0,
            "replies": []
        },
        {
            "body": "There have been inmurous stories here of shit stained sheets, bad breath, stinky dick etc...",
            "author": "BigBearSD",
            "id": "fwu5gki",
            "parent_id": "t1_fwu3uio",
            "score": 9,
            "created_utc": 1593806967.0,
            "replies": []
        },
        {
            "body": "It cycles, towards the end of the month (when rent is coming up) we see an increase. Same around the time colleges start or go on breaks. These tend to be the biggest outside influences when we see complaining a lack of \"good SDs\".",
            "author": "SD22112211",
            "id": "fwtr77u",
            "parent_id": "t1_fwtqlwh",
            "score": 4,
            "created_utc": 1593799293.0,
            "replies": [
                {
                    "body": "I have also noticed recently it's been a lot of 🎣. Quick post history view and you see they are pic sellers probably coming here hoping to drum up sales under the guise of being SBs. Honestly I report a lot of them lol",
                    "author": "Meowohmeow20",
                    "id": "fwtsg48",
                    "parent_id": "t1_fwtr77u",
                    "score": 4,
                    "created_utc": 1593799943.0,
                    "replies": [
                        {
                            "body": "Good job on reporting them. I do agree some of them who post with a onlyfan account or the like are fishing. However, I believe a large number of them are just ignorant as to the difference between camming and being a SB. Sadly there are a lot of people giving fake info about this lifestyle without any regard to their actions.",
                            "author": "SD22112211",
                            "id": "fwtswfv",
                            "parent_id": "t1_fwtsg48",
                            "score": 3,
                            "created_utc": 1593800183.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with this. Girls have enough issues as it is with body image. I haven’t seen many girls I don’t consider attractive (youth is very pretty) the ones that I’m not attracted to I still talk to sometimes and they say their inboxes are full so I learned.",
            "author": "highjinx411",
            "id": "fwvkb00",
            "parent_id": "t1_fwvi2bm",
            "score": 3,
            "created_utc": 1593838999.0,
            "replies": [
                {
                    "body": "I think that's actually a big part of my appeal to many SD's is the fact that my face looks very young, but my body is 100% womanly i.e. boobs & butt.",
                    "author": "shesanewman",
                    "id": "fwvnj5b",
                    "parent_id": "t1_fwvkb00",
                    "score": 2,
                    "created_utc": 1593841651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think your #1 is fair. However, do you think it is fair for an SB to ask for an allowance when they are not willing to meet up?",
            "author": "UnearthlyDinosaur",
            "id": "fwx5gym",
            "parent_id": "t1_fwvi2bm",
            "score": 2,
            "created_utc": 1593883610.0,
            "replies": []
        },
        {
            "body": "I can say from experience that as I got older I got more attractive to women while what I saw in the mirror was less attractive to me. But there is a peak to that curve. \n\nConfidence and maturity do come naturally to men as they age as they are reflections of experience. Not to say that all men do become mature and confident, but that generally it's your experience that is reflected out of you in those two things.\n\nA super hot guy also has confidence not because he looks in the mirror and knows he's hot, but because he has *experience* of almost every woman he's talked to being charmed by him so that becomes his default attitude that everything is going to go great with this new chat (i.e. confidence).\n\nThe kind of confidence you gain through age is more like, well, nothing terrible is actually going to happen from this chat. You know you can be rejected and it's not the end of the world. You know that though they are stunning they might bore you in 10 minutes so you can't put them on a super high pedestal before you even said hello. You have a lifetime of experience to tap into to judge a situation and to make conversation, and this relaxed state is perceived as well as confidence. \n\nWomen respond negatively to insecurity and positively to confidence in general. So as you age, provided you did something interesting with your life, you just become more attractive as you become more self assured and more interesting. And don't let yourself fall apart.\n\nA guy at 45 who took care of himself, is successful at business, projects confidence and experience, he is very likely close to peak male attractiveness. Think of Brad Pitt or George Clooney at 45. \n\nOptimal male and nobody would be going ewww. Fat, balding, middle manager with no sense of fashion style and no confidence ... everyone will go ew because you see that as someone who failed at the experiment that is their life. They have nothing to offer and you can easily project what the rest of their life is going to look like.",
            "author": "amigodeface",
            "id": "fwvjpkr",
            "parent_id": "t1_fwv8t1d",
            "score": 5,
            "created_utc": 1593838532.0,
            "replies": []
        },
        {
            "body": "A few already! This has been posted less than an hour... 😂😂😂",
            "author": "BigBearSD",
            "id": "fwts87k",
            "parent_id": "t1_fwtr9az",
            "score": 6,
            "created_utc": 1593799831.0,
            "replies": [
                {
                    "body": "Those are just the ones you managed to see before I deleted them",
                    "author": "Azurecole",
                    "id": "fwtztjv",
                    "parent_id": "t1_fwts87k",
                    "score": 3,
                    "created_utc": 1593803880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is funny cause it works both ways. I get a ton of just \"request to see your pictures\" while I clearly state that those will be unanswered without any actual message, and I automatically show my pics when I get a nice message from an SB. But I still often have to request for theirs even when I show mine. I actually dislike  requesting them when I have shown mine since it feels like a simple and respectful courtaissy to me, but definitely not always the case.   We all value our privacy but come on.",
            "author": "noctris1981",
            "id": "fwuoa3f",
            "parent_id": "t1_fwub07x",
            "score": 2,
            "created_utc": 1593817581.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fwup1pb",
                    "parent_id": "t1_fwuoa3f",
                    "score": 2,
                    "created_utc": 1593818030.0,
                    "replies": [
                        {
                            "body": "Oh, no judgement there, I identify as a sapio mostly, but let's be honest, looks are a thing, and despite having a little essay on my profile, I get those requests too..it is just part of the game i guess. If her profile has nothing interesting, I ignore it. If it does, I share them and ask something I want to know 🤷‍♂️",
                            "author": "noctris1981",
                            "id": "fwuphvq",
                            "parent_id": "t1_fwup1pb",
                            "score": 1,
                            "created_utc": 1593818294.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fwupon9",
                                    "parent_id": "t1_fwuphvq",
                                    "score": 1,
                                    "created_utc": 1593818408.0,
                                    "replies": [
                                        {
                                            "body": "Ha, assuming that last emoji represents a nerd; yes, and loud and proud 😉",
                                            "author": "noctris1981",
                                            "id": "fwupz3p",
                                            "parent_id": "t1_fwupon9",
                                            "score": 2,
                                            "created_utc": 1593818580.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If the person wrote about 1 line of profile text and has hidden pictures, I'll click the photos without saying anything. Have a well written profile with lots to talk about and I'll write and not click the photos. \n\nGotta work with what you have.\n\nIf the person responds and we go back and forth and seem to be hitting it off, then I'll click the pics.\n\nSometimes the no-texter will just open the pictures and never even look at my profile. I'll look at the pictures and move on. Shockingly they are not as interesting as one would hope.",
            "author": "amigodeface",
            "id": "fwwt5so",
            "parent_id": "t1_fwub07x",
            "score": 0,
            "created_utc": 1593877049.0,
            "replies": []
        },
        {
            "body": "That is SDs that use reddit. Most do not.",
            "author": "BigBearSD",
            "id": "fwuk2xm",
            "parent_id": "t1_fwu8zet",
            "score": 2,
            "created_utc": 1593815158.0,
            "replies": []
        },
        {
            "body": "Seconded.  This is a pretty good thread.  Even if you don't agree with every single point.",
            "author": "duckydee543",
            "id": "fwu4f37",
            "parent_id": "t1_fwto3dg",
            "score": 1,
            "created_utc": 1593806391.0,
            "replies": []
        },
        {
            "body": "Yep have seen this a few times. Instant block.",
            "author": "BigBearSD",
            "id": "fwtxn6p",
            "parent_id": "t1_fwtxg1g",
            "score": 2,
            "created_utc": 1593802708.0,
            "replies": []
        },
        {
            "body": "Big mood. You got this though, never forget that :)",
            "author": "Ipatchcat",
            "id": "fwuzz13",
            "parent_id": "t1_fwux18b",
            "score": 1,
            "created_utc": 1593824854.0,
            "replies": []
        },
        {
            "body": "The same way you get your Reddit account suspended :)",
            "author": "GDarn",
            "id": "fwu4lv1",
            "parent_id": "t1_fwtuo3u",
            "score": 1,
            "created_utc": 1593806494.0,
            "replies": []
        },
        {
            "body": "Hahaha and guys! Lol \n\nBut agreed",
            "author": "BigBearSD",
            "id": "fwtsxts",
            "parent_id": "t1_fwtsth0",
            "score": 4,
            "created_utc": 1593800203.0,
            "replies": []
        },
        {
            "body": "Well, 90 bucks a month isn't that much.  Plus, it is always a good idea to figure things out.  That helps you succeed.  Weeding through scammers, flakes and general shitty people isn't easy sometimes.\n\nBut... Once you figure it out, it's really pretty easy going.",
            "author": "duckydee543",
            "id": "fwu4v33",
            "parent_id": "t1_fwtv1xg",
            "score": 3,
            "created_utc": 1593806637.0,
            "replies": []
        },
        {
            "body": ">Lmao that you men torture yourselves by being paying members\n\nGlad you are getting a chortle.\n\nI've been getting amazing relationships with people I never would have met without SA.\n\nWe seem to both benefit from SA, if in varied degrees :)",
            "author": "GDarn",
            "id": "fwu4s1k",
            "parent_id": "t1_fwtv1xg",
            "score": 2,
            "created_utc": 1593806591.0,
            "replies": []
        },
        {
            "body": "Naw, my wife is very attentive and I hate her with the fury of a thousand burning suns.",
            "author": "iamjusthonest",
            "id": "fwusy56",
            "parent_id": "t1_fwtx0sx",
            "score": 11,
            "created_utc": 1593820395.0,
            "replies": [
                {
                    "body": "Username checks out",
                    "author": "BigMattress269",
                    "id": "fwvb2ff",
                    "parent_id": "t1_fwusy56",
                    "score": 3,
                    "created_utc": 1593832263.0,
                    "replies": []
                },
                {
                    "body": "Yet, you married her...which kinda proves my point",
                    "author": "xanfiles",
                    "id": "fwy5lgz",
                    "parent_id": "t1_fwusy56",
                    "score": 2,
                    "created_utc": 1593904063.0,
                    "replies": [
                        {
                            "body": "I married her because she had a magical pussy.  Not going to deny that, it had powers I have yet to experience again.  Wasn't her face that got me.  Unfortunately, access to both her lips retired the moment she got that ring.  Moral of the story?  Avoid marriage if possible. \n\nAppearance can gain access, but personality keeps your partner.  I agree with you in terms of looks getting the first initial meet.  However, for longer terms, personality and sexual compatibility definately comes into play (aka allowance).\n\nIf you're wondering why I stayed, well,  I tried divorce once but CA divorce law is very unfriendly towards male bread winners.  My business couldn't survive it.  If I were Jeff Besos rich, I would be divorced by now... \nAs long as I don't embarrass her in front of her group of LV wearing soul suckers, she would let me be.",
                            "author": "iamjusthonest",
                            "id": "fwy9d72",
                            "parent_id": "t1_fwy5lgz",
                            "score": 5,
                            "created_utc": 1593906405.0,
                            "replies": [
                                {
                                    "body": "SDs are not looking to get married. They are looking to flirt with hot chicks.The title of this post is \"Some possibilities of why you aren't having any luck\".\n\nShow me a 8, 9, 10 chick (usually white) who is not having any trouble getting SDs and you'll know why that entire list is pointless",
                                    "author": "xanfiles",
                                    "id": "fwysssx",
                                    "parent_id": "t1_fwy9d72",
                                    "score": 2,
                                    "created_utc": 1593919925.0,
                                    "replies": [
                                        {
                                            "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
                                            "author": "iamjusthonest",
                                            "id": "fwz4azi",
                                            "parent_id": "t1_fwysssx",
                                            "score": 4,
                                            "created_utc": 1593929228.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I disagree.  I've met attractive Pots that did the other things on the do not list, and opted not to proceed further.  There are too many others out there to settle for the behavior noted.",
            "author": "Boater_88",
            "id": "fwuakfo",
            "parent_id": "t1_fwtx0sx",
            "score": 6,
            "created_utc": 1593809811.0,
            "replies": [
                {
                    "body": "We are not talking about your choice. We are talking about attributes for success for women. If you are not attractive, none of the things in the list matter. SDs are not looking to marry, they are looking to date hot chicks.\n\nYou don't make a long list without putting that as #1",
                    "author": "xanfiles",
                    "id": "fwy6ebk",
                    "parent_id": "t1_fwuakfo",
                    "score": 2,
                    "created_utc": 1593904548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is absolutely true for SB's willing to do one time Hookups, but I wouldn't consider them Sugar Babies.   \n\nEven ultra beautiful women get annoying very quickly if they come across entitled, aloof and jaded.  Guys may try for a period of time to \"win over\" a bad attitude or entitlement, but that period won't last long.  Every SD will take an \"8\" or a  \"9\" with sexual compatibility and the \"3A's\" (Attention, Appreciation and Affection) over and entitled and jaded \"10\" every day and all day.  It may just take time to realize how entitled and jaded they may be.",
            "author": "willfromvb",
            "id": "fwwgcld",
            "parent_id": "t1_fwtx0sx",
            "score": 4,
            "created_utc": 1593869264.0,
            "replies": []
        },
        {
            "body": "Also would you keep an SB who was a 10/10 lookswise but was rinsing you, a starfish in bed (the rare times that happened), could not talk about anything, showed 0 interest in you besides your money etc...?\n\nDoubtfully",
            "author": "BigBearSD",
            "id": "fwtxkwn",
            "parent_id": "t1_fwtx0sx",
            "score": 15,
            "created_utc": 1593802675.0,
            "replies": [
                {
                    "body": "I think your original question is about having luck and not necessarily about having the right arrangement per what ever you consider to be an ideal arrangement.  I have said this before, the arrangements considered ideal in SLF is a minority of the arrangements that happen on Seeking. So for the majority of the arrangements there, this list is pretty much useless as those SB's are inundated with more than they can deal with.",
                    "author": "nthcoming",
                    "id": "fwueeti",
                    "parent_id": "t1_fwtxkwn",
                    "score": 3,
                    "created_utc": 1593811969.0,
                    "replies": [
                        {
                            "body": "I don't think most SB's are inundated with legitimate SD's.  Yes, they are inundated by scammers, Pick Up Artists and Johns, but not real SD's.  There are still way more SB's looking for a legitimate generous SD that are interested in an ongoing Sugar Relationship than there are legitimate generous SD's.\n\nIf I'm seriously interested in a specific SB, I rarely have a problem getting her to meet.  I know my competition can't be that strong.  I'm fit, somewhat good looking, reasonably generous and reasonably personable, but nothing extraordinary.  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together!  lol",
                            "author": "willfromvb",
                            "id": "fwwh51q",
                            "parent_id": "t1_fwueeti",
                            "score": 0,
                            "created_utc": 1593869823.0,
                            "replies": [
                                {
                                    "body": ">>  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together! lol\n\n U clearly and quickly went from defending your bullshit list to attacking other SD's and calling them names. Did u take a Selfie?\n\nAlso I am primarily calling bs on your bullshit list for SB's. Did your low self esteem after seeing your selfie clouded your comprehension skills? \n\nSo that this gets into your thick head let me make it simple for u -  your SB list is worthless as a 4 can do all of this and not succeed, but a 8 upwards can ignore every basic rule and can get what she wants.",
                                    "author": "nthcoming",
                                    "id": "fwwlg1k",
                                    "parent_id": "t1_fwwh51q",
                                    "score": 1,
                                    "created_utc": 1593872599.0,
                                    "replies": [
                                        {
                                            "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
                                            "author": "willfromvb",
                                            "id": "fwwqq4e",
                                            "parent_id": "t1_fwwlg1k",
                                            "score": 1,
                                            "created_utc": 1593875691.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "fwy0713",
                                                    "parent_id": "t1_fwwqq4e",
                                                    "score": 1,
                                                    "created_utc": 1593900811.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                                                            "author": "Azurecole",
                                                            "id": "fwzy9i1",
                                                            "parent_id": "t1_fwy0713",
                                                            "score": 1,
                                                            "created_utc": 1593957503.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah yeah whatever",
                                                                    "author": "nthcoming",
                                                                    "id": "fx5mdfe",
                                                                    "parent_id": "t1_fwzy9i1",
                                                                    "score": 1,
                                                                    "created_utc": 1594081371.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "10/10 chicks have no problems in finding SDs, which is kinda point of the post",
                    "author": "xanfiles",
                    "id": "fwy6h8i",
                    "parent_id": "t1_fwtxkwn",
                    "score": 2,
                    "created_utc": 1593904597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes be attractive. However, attraction only goes so far too. There are attractive women who have great personalities too. This is not just limited to ugly chicks, And vice versa.",
            "author": "BigBearSD",
            "id": "fwtxbqp",
            "parent_id": "t1_fwtx0sx",
            "score": 11,
            "created_utc": 1593802539.0,
            "replies": []
        },
        {
            "body": "We all know looks matter - but, i will shut you down no matter how hot you are if you behave badly.  That is the glory of being an SD.",
            "author": "Gemini-Fox",
            "id": "fwuwnhf",
            "parent_id": "t1_fwtx0sx",
            "score": 6,
            "created_utc": 1593822726.0,
            "replies": [
                {
                    "body": "It doesn't matter. Attractive ladies have their pick too and that's what we are discussing.",
                    "author": "xanfiles",
                    "id": "fwy6515",
                    "parent_id": "t1_fwuwnhf",
                    "score": 1,
                    "created_utc": 1593904390.0,
                    "replies": []
                },
                {
                    "body": "I'm not married but as a friend who is and who was an SD noted....  If I wanted drama, chaos and anger  I would simply go home.......",
                    "author": "pinotandsugar",
                    "id": "fwvhr6t",
                    "parent_id": "t1_fwuwnhf",
                    "score": 1,
                    "created_utc": 1593837054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I disagree. This is based on how I roll and my experience. I’ll ditch for topics on this list regardless of looks.",
            "author": "sdwizard74",
            "id": "fwu97aw",
            "parent_id": "t1_fwtx0sx",
            "score": 3,
            "created_utc": 1593809051.0,
            "replies": [
                {
                    "body": "We are not talking about you. We are talking about what attributes matter and what doesn't",
                    "author": "xanfiles",
                    "id": "fwy5zfp",
                    "parent_id": "t1_fwu97aw",
                    "score": 0,
                    "created_utc": 1593904295.0,
                    "replies": [
                        {
                            "body": "I’m talking about my opinion and experience and I don’t think you get to judge that.",
                            "author": "sdwizard74",
                            "id": "fwza6qq",
                            "parent_id": "t1_fwy5zfp",
                            "score": 1,
                            "created_utc": 1593934841.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Attraction goes much deeper than just the physical package, and for me to date someone, a great exterior will not cover up a rotten core.",
            "author": "Cledaddy23",
            "id": "fwwtkg5",
            "parent_id": "t1_fwtx0sx",
            "score": 3,
            "created_utc": 1593877275.0,
            "replies": [
                {
                    "body": "Unfortunately, your opinion means diddly-squat in the face of data.\n\nShow me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
                    "author": "xanfiles",
                    "id": "fwy5uo2",
                    "parent_id": "t1_fwwtkg5",
                    "score": -1,
                    "created_utc": 1593904216.0,
                    "replies": [
                        {
                            "body": "Show us the data then or stop putting your opinion a above all others.",
                            "author": "sdwizard74",
                            "id": "fwzcsup",
                            "parent_id": "t1_fwy5uo2",
                            "score": 3,
                            "created_utc": 1593937507.0,
                            "replies": []
                        },
                        {
                            "body": "Where is your data to back up your opinion?",
                            "author": "Cledaddy23",
                            "id": "fx09ppk",
                            "parent_id": "t1_fwy5uo2",
                            "score": 2,
                            "created_utc": 1593964227.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of the last three POTs I nexted the most attractive two and stuck with the least attractive. The most attractive of them was aggressively contradictory no matter the subject (it's raining out / NO IT ISN'T / ... looks out window at rain and people with umbrellas, uh, yeah it is), the second most was smooth to the point of feeling plastic, almost like you were talking to a flight attendant doing their job, and terrible breath. Third was a normal person, disagreed with me here and there, talked, chatted, had discussions involving different points of view, and in all far more likeable because they were just ... normal. \n\nSo, no it's not just pure attractiveness. As men get older they are less likely to fall into the spell of \"she's hot so acting like a spoiled 11 year old brat is ok.\" SDs have probably had some beautiful girls with them and a wide range of experiences, and once you start feeling that internal groan when she thinks her beauty entitles her to not behave like an adult the feeling of next comes up pretty strong.\n\nHormones drive this for men in their early 20s and to late 20s but after this, that shit gives you a major headache and you no longer have the patience and tolerance for it. \n\nSomeone with whom you can relax, enjoy yourself, play and have fun and who makes you feel good is critical. \n\nNote that if you take care of your body and appearance you just kind of need to meet minimum standards for beauty and it's within reach. Age too is flexible if you are fun as hell. \n\nBut if you come in and you haven't ever gone to the gym, breakfast dinner and lunch are donuts, and you project a political view that this is a real woman's body and men should get used to it, no ... that's going to fail the minimum beauty standard.\n\nI'm in the gym every day doing what I can do. I am not as good as I can be, and I'm trying to be better. For an SB I respect the same thing, I don't expect you to be perfect but pretty good is good, and if you're trying to make yourself better in ANY way (studying, reading, taking classes, going to the gym, just trying) then that bathes you in a hugely positive light.",
            "author": "amigodeface",
            "id": "fwviubo",
            "parent_id": "t1_fwtx0sx",
            "score": 5,
            "created_utc": 1593837868.0,
            "replies": [
                {
                    "body": "Show me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
                    "author": "xanfiles",
                    "id": "fwy62o7",
                    "parent_id": "t1_fwviubo",
                    "score": 1,
                    "created_utc": 1593904349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This right here is the truth for over 90% of the SB's on seeking.",
            "author": "nthcoming",
            "id": "fwudr8f",
            "parent_id": "t1_fwtx0sx",
            "score": 1,
            "created_utc": 1593811599.0,
            "replies": []
        },
        {
            "body": "Two of the fundamentals are understand your product/brand and understand your customer. \n\nMost likely your prospective SD is not the hip 28 year old who although he had a large salary he also has a vast array of IRL opportunities. Most SD's are older, probably more conservative and not the flash-daddys so promoted by SA.  Far too few profiles are aimed at the largest portion of the market.  \n\nMost of these SD's are not looking for more drama in their lives and probably (especially if they are married) place a higher value on reliability ( both in her not cancelling or being very late and in her attitude during the date) .  Few SD are looking for more drama in their life.  \n\nThe best SD's want the SB to have a better life as a result of the relationship.  Not just the financial rewards but in the multitude of other ways a quality SD can help in both the short and long term.   It's one of the rewards,  especially for those SD who are not finding that in IRL . A wise SB subtly speaks to that opportunity  in her profile. \n\nYour profile needs and deserves very careful thought, organization and editing.  Both the text and the pictures should be focused on what you see as the best opportunity and be a carefully edited presentation, not something you threw together after an unhappy IRL date or a call from a creditor.",
            "author": "pinotandsugar",
            "id": "fwvhjga",
            "parent_id": "t1_fwu23yn",
            "score": 4,
            "created_utc": 1593836889.0,
            "replies": []
        },
        {
            "body": "I have also noticed recently it's been a lot of 🎣. Quick post history view and you see they are pic sellers probably coming here hoping to drum up sales under the guise of being SBs. Honestly I report a lot of them lol",
            "author": "Meowohmeow20",
            "id": "fwtsg48",
            "parent_id": "t1_fwtr77u",
            "score": 4,
            "created_utc": 1593799943.0,
            "replies": [
                {
                    "body": "Good job on reporting them. I do agree some of them who post with a onlyfan account or the like are fishing. However, I believe a large number of them are just ignorant as to the difference between camming and being a SB. Sadly there are a lot of people giving fake info about this lifestyle without any regard to their actions.",
                    "author": "SD22112211",
                    "id": "fwtswfv",
                    "parent_id": "t1_fwtsg48",
                    "score": 3,
                    "created_utc": 1593800183.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think that's actually a big part of my appeal to many SD's is the fact that my face looks very young, but my body is 100% womanly i.e. boobs & butt.",
            "author": "shesanewman",
            "id": "fwvnj5b",
            "parent_id": "t1_fwvkb00",
            "score": 2,
            "created_utc": 1593841651.0,
            "replies": []
        },
        {
            "body": "Those are just the ones you managed to see before I deleted them",
            "author": "Azurecole",
            "id": "fwtztjv",
            "parent_id": "t1_fwts87k",
            "score": 3,
            "created_utc": 1593803880.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwup1pb",
            "parent_id": "t1_fwuoa3f",
            "score": 2,
            "created_utc": 1593818030.0,
            "replies": [
                {
                    "body": "Oh, no judgement there, I identify as a sapio mostly, but let's be honest, looks are a thing, and despite having a little essay on my profile, I get those requests too..it is just part of the game i guess. If her profile has nothing interesting, I ignore it. If it does, I share them and ask something I want to know 🤷‍♂️",
                    "author": "noctris1981",
                    "id": "fwuphvq",
                    "parent_id": "t1_fwup1pb",
                    "score": 1,
                    "created_utc": 1593818294.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fwupon9",
                            "parent_id": "t1_fwuphvq",
                            "score": 1,
                            "created_utc": 1593818408.0,
                            "replies": [
                                {
                                    "body": "Ha, assuming that last emoji represents a nerd; yes, and loud and proud 😉",
                                    "author": "noctris1981",
                                    "id": "fwupz3p",
                                    "parent_id": "t1_fwupon9",
                                    "score": 2,
                                    "created_utc": 1593818580.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Username checks out",
            "author": "BigMattress269",
            "id": "fwvb2ff",
            "parent_id": "t1_fwusy56",
            "score": 3,
            "created_utc": 1593832263.0,
            "replies": []
        },
        {
            "body": "Yet, you married her...which kinda proves my point",
            "author": "xanfiles",
            "id": "fwy5lgz",
            "parent_id": "t1_fwusy56",
            "score": 2,
            "created_utc": 1593904063.0,
            "replies": [
                {
                    "body": "I married her because she had a magical pussy.  Not going to deny that, it had powers I have yet to experience again.  Wasn't her face that got me.  Unfortunately, access to both her lips retired the moment she got that ring.  Moral of the story?  Avoid marriage if possible. \n\nAppearance can gain access, but personality keeps your partner.  I agree with you in terms of looks getting the first initial meet.  However, for longer terms, personality and sexual compatibility definately comes into play (aka allowance).\n\nIf you're wondering why I stayed, well,  I tried divorce once but CA divorce law is very unfriendly towards male bread winners.  My business couldn't survive it.  If I were Jeff Besos rich, I would be divorced by now... \nAs long as I don't embarrass her in front of her group of LV wearing soul suckers, she would let me be.",
                    "author": "iamjusthonest",
                    "id": "fwy9d72",
                    "parent_id": "t1_fwy5lgz",
                    "score": 5,
                    "created_utc": 1593906405.0,
                    "replies": [
                        {
                            "body": "SDs are not looking to get married. They are looking to flirt with hot chicks.The title of this post is \"Some possibilities of why you aren't having any luck\".\n\nShow me a 8, 9, 10 chick (usually white) who is not having any trouble getting SDs and you'll know why that entire list is pointless",
                            "author": "xanfiles",
                            "id": "fwysssx",
                            "parent_id": "t1_fwy9d72",
                            "score": 2,
                            "created_utc": 1593919925.0,
                            "replies": [
                                {
                                    "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
                                    "author": "iamjusthonest",
                                    "id": "fwz4azi",
                                    "parent_id": "t1_fwysssx",
                                    "score": 4,
                                    "created_utc": 1593929228.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We are not talking about your choice. We are talking about attributes for success for women. If you are not attractive, none of the things in the list matter. SDs are not looking to marry, they are looking to date hot chicks.\n\nYou don't make a long list without putting that as #1",
            "author": "xanfiles",
            "id": "fwy6ebk",
            "parent_id": "t1_fwuakfo",
            "score": 2,
            "created_utc": 1593904548.0,
            "replies": []
        },
        {
            "body": "I think your original question is about having luck and not necessarily about having the right arrangement per what ever you consider to be an ideal arrangement.  I have said this before, the arrangements considered ideal in SLF is a minority of the arrangements that happen on Seeking. So for the majority of the arrangements there, this list is pretty much useless as those SB's are inundated with more than they can deal with.",
            "author": "nthcoming",
            "id": "fwueeti",
            "parent_id": "t1_fwtxkwn",
            "score": 3,
            "created_utc": 1593811969.0,
            "replies": [
                {
                    "body": "I don't think most SB's are inundated with legitimate SD's.  Yes, they are inundated by scammers, Pick Up Artists and Johns, but not real SD's.  There are still way more SB's looking for a legitimate generous SD that are interested in an ongoing Sugar Relationship than there are legitimate generous SD's.\n\nIf I'm seriously interested in a specific SB, I rarely have a problem getting her to meet.  I know my competition can't be that strong.  I'm fit, somewhat good looking, reasonably generous and reasonably personable, but nothing extraordinary.  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together!  lol",
                    "author": "willfromvb",
                    "id": "fwwh51q",
                    "parent_id": "t1_fwueeti",
                    "score": 0,
                    "created_utc": 1593869823.0,
                    "replies": [
                        {
                            "body": ">>  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together! lol\n\n U clearly and quickly went from defending your bullshit list to attacking other SD's and calling them names. Did u take a Selfie?\n\nAlso I am primarily calling bs on your bullshit list for SB's. Did your low self esteem after seeing your selfie clouded your comprehension skills? \n\nSo that this gets into your thick head let me make it simple for u -  your SB list is worthless as a 4 can do all of this and not succeed, but a 8 upwards can ignore every basic rule and can get what she wants.",
                            "author": "nthcoming",
                            "id": "fwwlg1k",
                            "parent_id": "t1_fwwh51q",
                            "score": 1,
                            "created_utc": 1593872599.0,
                            "replies": [
                                {
                                    "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
                                    "author": "willfromvb",
                                    "id": "fwwqq4e",
                                    "parent_id": "t1_fwwlg1k",
                                    "score": 1,
                                    "created_utc": 1593875691.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "fwy0713",
                                            "parent_id": "t1_fwwqq4e",
                                            "score": 1,
                                            "created_utc": 1593900811.0,
                                            "replies": [
                                                {
                                                    "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                                                    "author": "Azurecole",
                                                    "id": "fwzy9i1",
                                                    "parent_id": "t1_fwy0713",
                                                    "score": 1,
                                                    "created_utc": 1593957503.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah yeah whatever",
                                                            "author": "nthcoming",
                                                            "id": "fx5mdfe",
                                                            "parent_id": "t1_fwzy9i1",
                                                            "score": 1,
                                                            "created_utc": 1594081371.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "10/10 chicks have no problems in finding SDs, which is kinda point of the post",
            "author": "xanfiles",
            "id": "fwy6h8i",
            "parent_id": "t1_fwtxkwn",
            "score": 2,
            "created_utc": 1593904597.0,
            "replies": []
        },
        {
            "body": "It doesn't matter. Attractive ladies have their pick too and that's what we are discussing.",
            "author": "xanfiles",
            "id": "fwy6515",
            "parent_id": "t1_fwuwnhf",
            "score": 1,
            "created_utc": 1593904390.0,
            "replies": []
        },
        {
            "body": "I'm not married but as a friend who is and who was an SD noted....  If I wanted drama, chaos and anger  I would simply go home.......",
            "author": "pinotandsugar",
            "id": "fwvhr6t",
            "parent_id": "t1_fwuwnhf",
            "score": 1,
            "created_utc": 1593837054.0,
            "replies": []
        },
        {
            "body": "We are not talking about you. We are talking about what attributes matter and what doesn't",
            "author": "xanfiles",
            "id": "fwy5zfp",
            "parent_id": "t1_fwu97aw",
            "score": 0,
            "created_utc": 1593904295.0,
            "replies": [
                {
                    "body": "I’m talking about my opinion and experience and I don’t think you get to judge that.",
                    "author": "sdwizard74",
                    "id": "fwza6qq",
                    "parent_id": "t1_fwy5zfp",
                    "score": 1,
                    "created_utc": 1593934841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately, your opinion means diddly-squat in the face of data.\n\nShow me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
            "author": "xanfiles",
            "id": "fwy5uo2",
            "parent_id": "t1_fwwtkg5",
            "score": -1,
            "created_utc": 1593904216.0,
            "replies": [
                {
                    "body": "Show us the data then or stop putting your opinion a above all others.",
                    "author": "sdwizard74",
                    "id": "fwzcsup",
                    "parent_id": "t1_fwy5uo2",
                    "score": 3,
                    "created_utc": 1593937507.0,
                    "replies": []
                },
                {
                    "body": "Where is your data to back up your opinion?",
                    "author": "Cledaddy23",
                    "id": "fx09ppk",
                    "parent_id": "t1_fwy5uo2",
                    "score": 2,
                    "created_utc": 1593964227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Show me an unsuccessful attractive lady on SA.\n\nI'll show you plenty of unsuccessful \"great-personality\" ladies on SA.",
            "author": "xanfiles",
            "id": "fwy62o7",
            "parent_id": "t1_fwviubo",
            "score": 1,
            "created_utc": 1593904349.0,
            "replies": []
        },
        {
            "body": "Good job on reporting them. I do agree some of them who post with a onlyfan account or the like are fishing. However, I believe a large number of them are just ignorant as to the difference between camming and being a SB. Sadly there are a lot of people giving fake info about this lifestyle without any regard to their actions.",
            "author": "SD22112211",
            "id": "fwtswfv",
            "parent_id": "t1_fwtsg48",
            "score": 3,
            "created_utc": 1593800183.0,
            "replies": []
        },
        {
            "body": "Oh, no judgement there, I identify as a sapio mostly, but let's be honest, looks are a thing, and despite having a little essay on my profile, I get those requests too..it is just part of the game i guess. If her profile has nothing interesting, I ignore it. If it does, I share them and ask something I want to know 🤷‍♂️",
            "author": "noctris1981",
            "id": "fwuphvq",
            "parent_id": "t1_fwup1pb",
            "score": 1,
            "created_utc": 1593818294.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fwupon9",
                    "parent_id": "t1_fwuphvq",
                    "score": 1,
                    "created_utc": 1593818408.0,
                    "replies": [
                        {
                            "body": "Ha, assuming that last emoji represents a nerd; yes, and loud and proud 😉",
                            "author": "noctris1981",
                            "id": "fwupz3p",
                            "parent_id": "t1_fwupon9",
                            "score": 2,
                            "created_utc": 1593818580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I married her because she had a magical pussy.  Not going to deny that, it had powers I have yet to experience again.  Wasn't her face that got me.  Unfortunately, access to both her lips retired the moment she got that ring.  Moral of the story?  Avoid marriage if possible. \n\nAppearance can gain access, but personality keeps your partner.  I agree with you in terms of looks getting the first initial meet.  However, for longer terms, personality and sexual compatibility definately comes into play (aka allowance).\n\nIf you're wondering why I stayed, well,  I tried divorce once but CA divorce law is very unfriendly towards male bread winners.  My business couldn't survive it.  If I were Jeff Besos rich, I would be divorced by now... \nAs long as I don't embarrass her in front of her group of LV wearing soul suckers, she would let me be.",
            "author": "iamjusthonest",
            "id": "fwy9d72",
            "parent_id": "t1_fwy5lgz",
            "score": 5,
            "created_utc": 1593906405.0,
            "replies": [
                {
                    "body": "SDs are not looking to get married. They are looking to flirt with hot chicks.The title of this post is \"Some possibilities of why you aren't having any luck\".\n\nShow me a 8, 9, 10 chick (usually white) who is not having any trouble getting SDs and you'll know why that entire list is pointless",
                    "author": "xanfiles",
                    "id": "fwysssx",
                    "parent_id": "t1_fwy9d72",
                    "score": 2,
                    "created_utc": 1593919925.0,
                    "replies": [
                        {
                            "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
                            "author": "iamjusthonest",
                            "id": "fwz4azi",
                            "parent_id": "t1_fwysssx",
                            "score": 4,
                            "created_utc": 1593929228.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't think most SB's are inundated with legitimate SD's.  Yes, they are inundated by scammers, Pick Up Artists and Johns, but not real SD's.  There are still way more SB's looking for a legitimate generous SD that are interested in an ongoing Sugar Relationship than there are legitimate generous SD's.\n\nIf I'm seriously interested in a specific SB, I rarely have a problem getting her to meet.  I know my competition can't be that strong.  I'm fit, somewhat good looking, reasonably generous and reasonably personable, but nothing extraordinary.  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together!  lol",
            "author": "willfromvb",
            "id": "fwwh51q",
            "parent_id": "t1_fwueeti",
            "score": 0,
            "created_utc": 1593869823.0,
            "replies": [
                {
                    "body": ">>  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together! lol\n\n U clearly and quickly went from defending your bullshit list to attacking other SD's and calling them names. Did u take a Selfie?\n\nAlso I am primarily calling bs on your bullshit list for SB's. Did your low self esteem after seeing your selfie clouded your comprehension skills? \n\nSo that this gets into your thick head let me make it simple for u -  your SB list is worthless as a 4 can do all of this and not succeed, but a 8 upwards can ignore every basic rule and can get what she wants.",
                    "author": "nthcoming",
                    "id": "fwwlg1k",
                    "parent_id": "t1_fwwh51q",
                    "score": 1,
                    "created_utc": 1593872599.0,
                    "replies": [
                        {
                            "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
                            "author": "willfromvb",
                            "id": "fwwqq4e",
                            "parent_id": "t1_fwwlg1k",
                            "score": 1,
                            "created_utc": 1593875691.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "fwy0713",
                                    "parent_id": "t1_fwwqq4e",
                                    "score": 1,
                                    "created_utc": 1593900811.0,
                                    "replies": [
                                        {
                                            "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                                            "author": "Azurecole",
                                            "id": "fwzy9i1",
                                            "parent_id": "t1_fwy0713",
                                            "score": 1,
                                            "created_utc": 1593957503.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah yeah whatever",
                                                    "author": "nthcoming",
                                                    "id": "fx5mdfe",
                                                    "parent_id": "t1_fwzy9i1",
                                                    "score": 1,
                                                    "created_utc": 1594081371.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m talking about my opinion and experience and I don’t think you get to judge that.",
            "author": "sdwizard74",
            "id": "fwza6qq",
            "parent_id": "t1_fwy5zfp",
            "score": 1,
            "created_utc": 1593934841.0,
            "replies": []
        },
        {
            "body": "Show us the data then or stop putting your opinion a above all others.",
            "author": "sdwizard74",
            "id": "fwzcsup",
            "parent_id": "t1_fwy5uo2",
            "score": 3,
            "created_utc": 1593937507.0,
            "replies": []
        },
        {
            "body": "Where is your data to back up your opinion?",
            "author": "Cledaddy23",
            "id": "fx09ppk",
            "parent_id": "t1_fwy5uo2",
            "score": 2,
            "created_utc": 1593964227.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fwupon9",
            "parent_id": "t1_fwuphvq",
            "score": 1,
            "created_utc": 1593818408.0,
            "replies": [
                {
                    "body": "Ha, assuming that last emoji represents a nerd; yes, and loud and proud 😉",
                    "author": "noctris1981",
                    "id": "fwupz3p",
                    "parent_id": "t1_fwupon9",
                    "score": 2,
                    "created_utc": 1593818580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SDs are not looking to get married. They are looking to flirt with hot chicks.The title of this post is \"Some possibilities of why you aren't having any luck\".\n\nShow me a 8, 9, 10 chick (usually white) who is not having any trouble getting SDs and you'll know why that entire list is pointless",
            "author": "xanfiles",
            "id": "fwysssx",
            "parent_id": "t1_fwy9d72",
            "score": 2,
            "created_utc": 1593919925.0,
            "replies": [
                {
                    "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
                    "author": "iamjusthonest",
                    "id": "fwz4azi",
                    "parent_id": "t1_fwysssx",
                    "score": 4,
                    "created_utc": 1593929228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">>  You mainly just need not to be a fat, cheap, fuckwit to succeed, or at least not all three together! lol\n\n U clearly and quickly went from defending your bullshit list to attacking other SD's and calling them names. Did u take a Selfie?\n\nAlso I am primarily calling bs on your bullshit list for SB's. Did your low self esteem after seeing your selfie clouded your comprehension skills? \n\nSo that this gets into your thick head let me make it simple for u -  your SB list is worthless as a 4 can do all of this and not succeed, but a 8 upwards can ignore every basic rule and can get what she wants.",
            "author": "nthcoming",
            "id": "fwwlg1k",
            "parent_id": "t1_fwwh51q",
            "score": 1,
            "created_utc": 1593872599.0,
            "replies": [
                {
                    "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
                    "author": "willfromvb",
                    "id": "fwwqq4e",
                    "parent_id": "t1_fwwlg1k",
                    "score": 1,
                    "created_utc": 1593875691.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "fwy0713",
                            "parent_id": "t1_fwwqq4e",
                            "score": 1,
                            "created_utc": 1593900811.0,
                            "replies": [
                                {
                                    "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                                    "author": "Azurecole",
                                    "id": "fwzy9i1",
                                    "parent_id": "t1_fwy0713",
                                    "score": 1,
                                    "created_utc": 1593957503.0,
                                    "replies": [
                                        {
                                            "body": "Yeah yeah whatever",
                                            "author": "nthcoming",
                                            "id": "fx5mdfe",
                                            "parent_id": "t1_fwzy9i1",
                                            "score": 1,
                                            "created_utc": 1594081371.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ha, assuming that last emoji represents a nerd; yes, and loud and proud 😉",
            "author": "noctris1981",
            "id": "fwupz3p",
            "parent_id": "t1_fwupon9",
            "score": 2,
            "created_utc": 1593818580.0,
            "replies": []
        },
        {
            "body": "Me in a skirt can get a guy.  Getting your worth is in question here.  Just because an attractive girl is always in demand, doesn't mean she is getting her best return.   Why do you think attractive women are the most insecure ones?  \n\nJust be attractive and it will land you an SD is an oversimplification imo.  I know plenty of wealthy SD in LA with average looking SB (and LA is home of the most attractive SBs around).   \n\nBeing an attractive escort will do better than a SB.  Sugaring involves a lot of nonphysical interactions.  The goal of a SB is a long term relationship ($$$).   So it is more like marriage than a one night stand.\n\nBeing attractive definately helps her get her foot in the door, but it hardly guarantees an allowance.",
            "author": "iamjusthonest",
            "id": "fwz4azi",
            "parent_id": "t1_fwysssx",
            "score": 4,
            "created_utc": 1593929228.0,
            "replies": []
        },
        {
            "body": "I in no way attacked or insulted you. I clearly stated my opposing view disagreeing with your assertion, but not attacking you personally. \n\nIf you feel the need to attack me personally, it shows you are admitting you have nothing else of value to add to the discussion. \n\nThank you and good luck!😊",
            "author": "willfromvb",
            "id": "fwwqq4e",
            "parent_id": "t1_fwwlg1k",
            "score": 1,
            "created_utc": 1593875691.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "fwy0713",
                    "parent_id": "t1_fwwqq4e",
                    "score": 1,
                    "created_utc": 1593900811.0,
                    "replies": [
                        {
                            "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                            "author": "Azurecole",
                            "id": "fwzy9i1",
                            "parent_id": "t1_fwy0713",
                            "score": 1,
                            "created_utc": 1593957503.0,
                            "replies": [
                                {
                                    "body": "Yeah yeah whatever",
                                    "author": "nthcoming",
                                    "id": "fx5mdfe",
                                    "parent_id": "t1_fwzy9i1",
                                    "score": 1,
                                    "created_utc": 1594081371.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fwy0713",
            "parent_id": "t1_fwwqq4e",
            "score": 1,
            "created_utc": 1593900811.0,
            "replies": [
                {
                    "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
                    "author": "Azurecole",
                    "id": "fwzy9i1",
                    "parent_id": "t1_fwy0713",
                    "score": 1,
                    "created_utc": 1593957503.0,
                    "replies": [
                        {
                            "body": "Yeah yeah whatever",
                            "author": "nthcoming",
                            "id": "fx5mdfe",
                            "parent_id": "t1_fwzy9i1",
                            "score": 1,
                            "created_utc": 1594081371.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is your one warning. Your message is unacceptable on this subreddit and if you post something like it again you'll be banned.\n\nRule #14: No Trolling, disturbing the peace, or being an ass.\n\nThe deliberate act of making random unsolicited and/or controversial comments with the intent to provoke an emotional knee jerk reaction from unsuspecting readers to engage in a fight or argument.",
            "author": "Azurecole",
            "id": "fwzy9i1",
            "parent_id": "t1_fwy0713",
            "score": 1,
            "created_utc": 1593957503.0,
            "replies": [
                {
                    "body": "Yeah yeah whatever",
                    "author": "nthcoming",
                    "id": "fx5mdfe",
                    "parent_id": "t1_fwzy9i1",
                    "score": 1,
                    "created_utc": 1594081371.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah yeah whatever",
            "author": "nthcoming",
            "id": "fx5mdfe",
            "parent_id": "t1_fwzy9i1",
            "score": 1,
            "created_utc": 1594081371.0,
            "replies": []
        }
    ]
}