{
    "title": "Got a promotion from dishwasher to server at my restaurant. Need to look fresh by Thursday anything to help me rack up some tips ?",
    "post_id": "bbjcig",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/bbjcig/got_a_promotion_from_dishwasher_to_server_at_my/",
    "author": "Helios2678",
    "body": "",
    "url": "https://i.redd.it/5kmkz5c67er21.jpg",
    "score": 398,
    "upvote_ratio": 0.98,
    "created_utc": 1554882746.0,
    "num_comments": 40,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Crew cut",
            "author": "Nickleo17",
            "id": "ekj7pjy",
            "parent_id": "t3_bbjcig",
            "score": 171,
            "created_utc": 1554883301.0,
            "replies": [
                {
                    "body": "Actually yeah. Totally would work.",
                    "author": "FlakeyGhost",
                    "id": "ekjp1vw",
                    "parent_id": "t1_ekj7pjy",
                    "score": 53,
                    "created_utc": 1554904179.0,
                    "replies": []
                },
                {
                    "body": "The term Crew covers a whole host of cuts. Be careful with that one.",
                    "author": "PJlong",
                    "id": "ekkii3e",
                    "parent_id": "t1_ekj7pjy",
                    "score": 16,
                    "created_utc": 1554923330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don’t ever let the refillable drinks go empty. \n\nBe nice everyone, even the rude customers. They’re probably just hungry. \n\nCheck in regularly and grab any finished dish you can. I used to prebus the crap out of my tables which makes the bussers job easier and I could get sat again more quickly. \n\nIf you forgot something, own it, say whoops i forgot, be right back, making it right is the best way to save face. \n\nFor larger parties, ask ahead of time about separate checks as that helps immensely with ringing things in already sorted properly.\n\nHave fun!",
            "author": "Nagadha",
            "id": "ekjl8ar",
            "parent_id": "t3_bbjcig",
            "score": 271,
            "created_utc": 1554901146.0,
            "replies": [
                {
                    "body": "I think he was asking for tips on a fresher appearance but this works too I guess",
                    "author": "izeezusizeezus",
                    "id": "ekk41a8",
                    "parent_id": "t1_ekjl8ar",
                    "score": 83,
                    "created_utc": 1554914514.0,
                    "replies": [
                        {
                            "body": "Nah he wants to earn more tip so any tips should be helpful",
                            "author": "Vinc314",
                            "id": "ekk4eog",
                            "parent_id": "t1_ekk41a8",
                            "score": 45,
                            "created_utc": 1554914755.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think of a table as a spectrum of time. From the moment they sit to the moment they leave they can behave how they like towards me. A lot of people feel anxiety or just aren’t themselves when they’re hungry. I like to joke with servers having a bad night that a lot of people feel better after a bright smile, enduring patience, hot food, and cold drinks. Don’t fail at any one of these things and you will always be tipped and your priorities will always be set. Keep the drinks full. Take things away that aren’t in use (cluttered tables are uncomfortable.). Say you’re new as long as you fuck up new things. People will be more graceful about it. If my coworkers are crabby to me about their tables still then I smile and say the same thing then offer them snack/water/ibuprofen/cover tables for a smoke break/gum. People aren’t themselves all the time. Take them for their best and trust that they aren’t always their worst. Some people are prejudiced against you. These people won’t be pleased except by being Shitty. Ignore them and smile; the next time you have a table you actually like or that does something kind for you, enjoy it all the more, knowing that shitty person isn’t Jading you and you are wonderful. That shitty person didn’t deserve you. Idk. I love the validation from serving. People 100% aren’t themselves when they’re hungry. Also, you’re trying to get ripped right? Make the checkout experience as smooth as possible. Why upset people when they’re about to pay you? This is the moment you’ve been working towards. Make it as pleasant as possible for you and them. ALWAYS thank the customer. Always say goodbye. IF you like them, shake their hand and get their name. Start trying to remember names. Remember your tables and learn from your mistakes. Write everything down. Staples sells 7$ leather notebooks 80pages and no ink will ever bleed. Get a nice pen. Don’t lose it. Write shit down. You might feel weird and people might make fun of you formit. Fuck em. You’re showing you’re serious about the job and the learning part of it. Review the notebook nightly. Write people’s orders down if you get their names. Write down their jobs and when they were in. Make them regulars. \n\nDon’t lose your shit. The night MUST keep moving. If you need help just ask. If you lose your shit you’ll be known as that guy. Be nice to everyone. They are prejudiced against servers. Get them drinks. Take out their trash. Put their needs before yours. You’ll be surprised. It’s Saturday night, 730 pm, 2/3turns of your restaurant. You just got triple sat. You have 7 tables. You need the host to get drinks for one table while you fix an order for another. You need the kitchen to remake something on the fly, you forgot it was a gluten allergy to the pizza bites. What a joke. Two tables are waiting to pay and you don’t remember the last time you felt the urge to do anything other than drink water and smoke a cig. You haven’t peed in 3 hours and won’t for another 3. Smile. People like you. The kitchen makes your order in record time. The table is watered and happy. You drop off the food, drop two checks, greet your table, and get the order from another one. You got this. But you have to front load with people to buy yourself this power. \n\nGood luck! Enjoy your job. Have fun and stay safe. \nPeace",
                    "author": "ben_the_wind",
                    "id": "ekld289",
                    "parent_id": "t1_ekjl8ar",
                    "score": 12,
                    "created_utc": 1554942780.0,
                    "replies": [
                        {
                            "body": "I wish this comment was getting a little more love because it’s a really generous and well-thought out reminder to always give people the benefit of the doubt. You sound like a good person.",
                            "author": "deadeyedog",
                            "id": "ekli8lm",
                            "parent_id": "t1_ekld289",
                            "score": 3,
                            "created_utc": 1554946479.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get a trim, nothing radical.   Maybe loose the scruff. Being a server is 90% attitude 10% looks.  Being honest, intelligent, confident, and attentive and having a smile will get you along way. You already have the good looks.",
            "author": "PJlong",
            "id": "ekjioiy",
            "parent_id": "t3_bbjcig",
            "score": 65,
            "created_utc": 1554898872.0,
            "replies": [
                {
                    "body": "I second this.",
                    "author": "meetmeinthebthrm",
                    "id": "ekkhujv",
                    "parent_id": "t1_ekjioiy",
                    "score": 3,
                    "created_utc": 1554922900.0,
                    "replies": []
                },
                {
                    "body": "More like 80/20",
                    "author": "millioneuroextreme",
                    "id": "eklu8a2",
                    "parent_id": "t1_ekjioiy",
                    "score": 2,
                    "created_utc": 1554956106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shave and bring the sides and back down a bit. Condition your mop and give it a part. This is quick for you for Thursday.",
            "author": null,
            "id": "ekjikl4",
            "parent_id": "t3_bbjcig",
            "score": 89,
            "created_utc": 1554898766.0,
            "replies": [
                {
                    "body": "Could also just trim face hairs down nice and neat. Comb hair back with product maybe. Could definitely get away with styling and not a cut",
                    "author": "Pawtang",
                    "id": "ekjx1ds",
                    "parent_id": "t1_ekjikl4",
                    "score": 24,
                    "created_utc": 1554909878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "With your jaw line; crew cut or something short with a nice fade up the sides.  Just something clean.",
            "author": null,
            "id": "ekjrvvy",
            "parent_id": "t3_bbjcig",
            "score": 18,
            "created_utc": 1554906246.0,
            "replies": []
        },
        {
            "body": "Crew cut but I think you should go to your barber and also ask him to shape your mustache and beard. Also consider getting your eyebrows done and you’ll be golden.\n\nYou are already a pretty handsome guy so not much to change honestly\n\nPlease update us with another pic once you get your cut",
            "author": "PuppiesGoMeow",
            "id": "ekjz4u0",
            "parent_id": "t3_bbjcig",
            "score": 11,
            "created_utc": 1554911276.0,
            "replies": []
        },
        {
            "body": "Conditioner!!",
            "author": "Narhaan",
            "id": "ekji7w3",
            "parent_id": "t3_bbjcig",
            "score": 10,
            "created_utc": 1554898429.0,
            "replies": []
        },
        {
            "body": "Other people left good hair advices; as someone who has been a dishwasher, few years ago, I wanted to say congratulations on promotion.",
            "author": "sl1nky07",
            "id": "ekjnorl",
            "parent_id": "t3_bbjcig",
            "score": 5,
            "created_utc": 1554903147.0,
            "replies": []
        },
        {
            "body": "There is a study out there somewhere that found that servers that said customer orders back to the customer before leaving the table earn higher tips on average.\n\nGood luck bud. I'd agree with the advice about shaving. I'd probably cut the hair short, although I don't know if it's a must. Maybe get those eyebrows toned down some.",
            "author": "ZagRickonZag",
            "id": "ekjtyhq",
            "parent_id": "t3_bbjcig",
            "score": 5,
            "created_utc": 1554907715.0,
            "replies": []
        },
        {
            "body": "The most basic thing I learned when I first started serving was to do as many things as possible(within reason) with every trip you make around the restaurant. I could clock 9 miles in a brunch shift at a very lengthy saloon I worked in my teens. Getting one extra order, or one extra request each trip will cumulatively save you so. much. time. There's no stressing this enough.\n\nIf you get in the weeds, breath.\n\nIf someones an asshole, kill them with kindness in a manner that other tables can observe. (I've gotten some crazy pity tips this way. \"Wow, that guy was an asshole. You handled that incredibly well.\")\n\nWrite down EVERYTHING, at first. Including names if you've all introduced yourselves. A theory I have is that the thing a person likes hearing the most in this world is their own name. Just don't over-do it. Sometimes I'll even pretend that I forgot their name for the duration of their meal, then when I drop the check I say \"Take your time with this, John. Enjoy your wine. There's absolutely no rush.\" A guy will almost always light up when he realizes that you actually do still remember his name. Oftentimes people even tell me their impressed that I did.\n\nAfter dropping food and making sure you've marked all silverware that may have been removed, ask if you can get them anything else(condiments, fresh-cracked pepper, a new car, etc.).  Within the first two minutes of the patron taking a bite, make sure everything is up to their standards taste-wise. If it's not, you have it remade or comp the item. End of discussion. If the kitchen gets mad at you for this(they probably will) have a manager verbal it next time.\n\nAsk things in a way that encourages conversing, rather than asking a yes or no question. This will engage the guest and make them feel that you are being more personable.\n\nBad example:\n\nServer- \"Does everything taste ok?\n\nGuest- \"Yes.\"\n\nGood example:\n\nServer- \"How is everything over here?\n\nGuest- It's delicious! Best meal we've had in this town yet!\"\n\nSell, sell, sell... sell, sell, sell, sell. Don't push something out of the blue, though. Have a good reason to be selling, or up-selling. Up-selling is when someone orders a salad and you say, \"Would you like to add any protein for a few extra dollars? We have the option to add chicken, beef, shrimp, or lobster.\" Also, with something like lobster be careful with the few extra dollars comment, as it is likely more than just a few extra dollars. If applicable, do this with wine every single time. Doesn't matter, bottle or glass. Know your wine and when they ask for something, if you have the knowledge to back it up, recommend something similar but better.\n\nI'm going to stop here, as life is rushing me now. Last thing, and one of the most important. **Save face with the kitchen. RESPECT THE FUCK OUT OF THEM. WHAT THEY DO IS VERY, VERY HARD.** If you're peddling happiness to people, the kitchen is the middle-man. You shouldn't have much trouble with this(in fact, you're a bit lucky to be moving from the kitchen, as many new servers get shit on by cooks and kitchen staff) Good luck man! And clean-up well. Iron, polish, and shave.\n\nEdit: Wow. Didn't read the subreddit :(. Anyway, I'll leave this here lol I would just comb the hair. It's your call(or rather your employers) whether you choose to shave or not. Many employers stick with the rule that if you have a grown beard, it'll ride, if you don't, shave. Most up-scale places I've served, or bartended at will not let you grow facial hair during the work week. As far as hair, I go with a quick, easy part, as well as some product to de-frizz. IMO a clean-cut, well-groomed appearance is always a better look than leaving it shaggy when it comes to looking as presentable as possible. Sorry for the post :0",
            "author": "meetmeinthebthrm",
            "id": "ekkexlh",
            "parent_id": "t3_bbjcig",
            "score": 4,
            "created_utc": 1554921151.0,
            "replies": []
        },
        {
            "body": "Congratulations on your promotion!",
            "author": "Ggoing92",
            "id": "ekjotd4",
            "parent_id": "t3_bbjcig",
            "score": 6,
            "created_utc": 1554904002.0,
            "replies": []
        },
        {
            "body": "Dude I hope you get scouted somehow one day because you could easily become a model",
            "author": "Dark-Clawz",
            "id": "ekjwprc",
            "parent_id": "t3_bbjcig",
            "score": 6,
            "created_utc": 1554909662.0,
            "replies": []
        },
        {
            "body": "Shave all of the facial hair; you have smooth skin so run with it. As someone else suggested, shortening up the sides (A 1-3 clipper would do the trick) alone would even allow you to keep the top as-is while still looking organized.",
            "author": "Eagle115",
            "id": "ekjn8la",
            "parent_id": "t3_bbjcig",
            "score": 3,
            "created_utc": 1554902792.0,
            "replies": []
        },
        {
            "body": "crew cut, closer shave. be as helpful as possible and smile a lot. secure that bag bro",
            "author": "brendenwhiteley",
            "id": "ekk7fjn",
            "parent_id": "t3_bbjcig",
            "score": 3,
            "created_utc": 1554916671.0,
            "replies": []
        },
        {
            "body": "Babe u be cute asf the way u are",
            "author": "Jason197272",
            "id": "ekjw55y",
            "parent_id": "t3_bbjcig",
            "score": 7,
            "created_utc": 1554909266.0,
            "replies": []
        },
        {
            "body": "Shave and assless chaps. Never fails to garner me mad 💰!!",
            "author": "StaresatSound",
            "id": "ekjnmsj",
            "parent_id": "t3_bbjcig",
            "score": 4,
            "created_utc": 1554903104.0,
            "replies": []
        },
        {
            "body": "I don’t have any tips but I have to say regardless of the heart you’re one cute mofo",
            "author": "3ricss0n",
            "id": "ekk5vit",
            "parent_id": "t3_bbjcig",
            "score": 2,
            "created_utc": 1554915685.0,
            "replies": []
        },
        {
            "body": "crew cut or some gel",
            "author": "gonZAA24",
            "id": "ekk7w8h",
            "parent_id": "t3_bbjcig",
            "score": 2,
            "created_utc": 1554916948.0,
            "replies": []
        },
        {
            "body": "Trim, shave facial hair and tidy up your eyebrows",
            "author": "thebritisharecome",
            "id": "ekke7md",
            "parent_id": "t3_bbjcig",
            "score": 2,
            "created_utc": 1554920722.0,
            "replies": []
        },
        {
            "body": "Your hair looks good already imo. Just tidy up your eyebrows and you'll go from cute/presentable to stunning.",
            "author": "devon_price",
            "id": "ekkifoc",
            "parent_id": "t3_bbjcig",
            "score": 2,
            "created_utc": 1554923285.0,
            "replies": []
        },
        {
            "body": "To start with you are handsome AF!!  I agree with most of the rest of the others a crew cut would look awesome on you would really bring out your faculial features!  I kinda dig the facial hair, just make sure yo keep it trimmed and nicely groomed.  Here are some crew cut options to think about:\n\nhttps://pinterest.com/pin/380413499774372263/?source_app=android\n\nhttps://pinterest.com/pin/380413499774340977/?source_app=android\n\nhttps://pinterest.com/pin/380413499774327172/?source_app=android\n\nhttps://pinterest.com/pin/380413499774310034/?source_app=android\n\nhttps://pinterest.com/pin/380413499774237455/?source_app=android\n\nhttps://pinterest.com/pin/380413499774185671/?source_app=android\n\nhttps://pinterest.com/pin/380413499774142803/?source_app=android\n\nhttp://pinterest.com/pin/380413499774142557/?source_app=android\n\nWhatever cut you go with please post a follow up pic!!!",
            "author": "Longislandtea12",
            "id": "ekk72rj",
            "parent_id": "t3_bbjcig",
            "score": 2,
            "created_utc": 1554916451.0,
            "replies": []
        },
        {
            "body": "boobs",
            "author": "PVLVCE",
            "id": "ekjnhos",
            "parent_id": "t3_bbjcig",
            "score": 3,
            "created_utc": 1554902993.0,
            "replies": []
        },
        {
            "body": "Consider shaving... sometimes a youthful look garners sympathy for servers.  Also, congratulations",
            "author": "Imperial_Plastics",
            "id": "ekjphbd",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554904499.0,
            "replies": []
        },
        {
            "body": "Just came over to say congrats on your promotion!",
            "author": "xlyfzox",
            "id": "ekkded6",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554920241.0,
            "replies": []
        },
        {
            "body": "You look like [Amir Arison](http://images6.fanpop.com/image/photos/38300000/Aram-Mojtabai-Season-2-Cast-Photo-the-blacklist-38351121-375-500.jpg)",
            "author": "RaptorCaptain",
            "id": "ekkw1s8",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554931557.0,
            "replies": []
        },
        {
            "body": "I think shave, definitely. Listen to the rest for hair.",
            "author": "Sleambean",
            "id": "ekkxgop",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554932436.0,
            "replies": []
        },
        {
            "body": "Shave your facial hair, and use some pomade on the head hair. You’ll look spiffy. Try the pomade first before shaving to see if you can pull it off. I think it looks too thin and scruffy though.",
            "author": "jzcommunicate",
            "id": "ekkzayq",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554933583.0,
            "replies": []
        },
        {
            "body": "Ditch the facial hair\n\nCrew cut",
            "author": "BaneWraith",
            "id": "ekl23mp",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554935368.0,
            "replies": []
        },
        {
            "body": "Not sure about the hair, but you'd look a lot better if you shave your face in my opinion.",
            "author": null,
            "id": "ekl7em1",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1554938707.0,
            "replies": []
        },
        {
            "body": "Start with a light trim and a fade from 0.5 to 1.5 on the sides with a hard part, then Shave off everything but leave a subtle shape of an arrow across the top of your head going down into your forehead",
            "author": "Sslayer777",
            "id": "el9zhad",
            "parent_id": "t3_bbjcig",
            "score": 1,
            "created_utc": 1555690685.0,
            "replies": []
        },
        {
            "body": "Eat some pussy and let that mustache grow out my boy.",
            "author": "Mr_Makeitwork",
            "id": "ekjr8c1",
            "parent_id": "t3_bbjcig",
            "score": 0,
            "created_utc": 1554905776.0,
            "replies": []
        },
        {
            "body": "Actually yeah. Totally would work.",
            "author": "FlakeyGhost",
            "id": "ekjp1vw",
            "parent_id": "t1_ekj7pjy",
            "score": 53,
            "created_utc": 1554904179.0,
            "replies": []
        },
        {
            "body": "The term Crew covers a whole host of cuts. Be careful with that one.",
            "author": "PJlong",
            "id": "ekkii3e",
            "parent_id": "t1_ekj7pjy",
            "score": 16,
            "created_utc": 1554923330.0,
            "replies": []
        },
        {
            "body": "I think he was asking for tips on a fresher appearance but this works too I guess",
            "author": "izeezusizeezus",
            "id": "ekk41a8",
            "parent_id": "t1_ekjl8ar",
            "score": 83,
            "created_utc": 1554914514.0,
            "replies": [
                {
                    "body": "Nah he wants to earn more tip so any tips should be helpful",
                    "author": "Vinc314",
                    "id": "ekk4eog",
                    "parent_id": "t1_ekk41a8",
                    "score": 45,
                    "created_utc": 1554914755.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think of a table as a spectrum of time. From the moment they sit to the moment they leave they can behave how they like towards me. A lot of people feel anxiety or just aren’t themselves when they’re hungry. I like to joke with servers having a bad night that a lot of people feel better after a bright smile, enduring patience, hot food, and cold drinks. Don’t fail at any one of these things and you will always be tipped and your priorities will always be set. Keep the drinks full. Take things away that aren’t in use (cluttered tables are uncomfortable.). Say you’re new as long as you fuck up new things. People will be more graceful about it. If my coworkers are crabby to me about their tables still then I smile and say the same thing then offer them snack/water/ibuprofen/cover tables for a smoke break/gum. People aren’t themselves all the time. Take them for their best and trust that they aren’t always their worst. Some people are prejudiced against you. These people won’t be pleased except by being Shitty. Ignore them and smile; the next time you have a table you actually like or that does something kind for you, enjoy it all the more, knowing that shitty person isn’t Jading you and you are wonderful. That shitty person didn’t deserve you. Idk. I love the validation from serving. People 100% aren’t themselves when they’re hungry. Also, you’re trying to get ripped right? Make the checkout experience as smooth as possible. Why upset people when they’re about to pay you? This is the moment you’ve been working towards. Make it as pleasant as possible for you and them. ALWAYS thank the customer. Always say goodbye. IF you like them, shake their hand and get their name. Start trying to remember names. Remember your tables and learn from your mistakes. Write everything down. Staples sells 7$ leather notebooks 80pages and no ink will ever bleed. Get a nice pen. Don’t lose it. Write shit down. You might feel weird and people might make fun of you formit. Fuck em. You’re showing you’re serious about the job and the learning part of it. Review the notebook nightly. Write people’s orders down if you get their names. Write down their jobs and when they were in. Make them regulars. \n\nDon’t lose your shit. The night MUST keep moving. If you need help just ask. If you lose your shit you’ll be known as that guy. Be nice to everyone. They are prejudiced against servers. Get them drinks. Take out their trash. Put their needs before yours. You’ll be surprised. It’s Saturday night, 730 pm, 2/3turns of your restaurant. You just got triple sat. You have 7 tables. You need the host to get drinks for one table while you fix an order for another. You need the kitchen to remake something on the fly, you forgot it was a gluten allergy to the pizza bites. What a joke. Two tables are waiting to pay and you don’t remember the last time you felt the urge to do anything other than drink water and smoke a cig. You haven’t peed in 3 hours and won’t for another 3. Smile. People like you. The kitchen makes your order in record time. The table is watered and happy. You drop off the food, drop two checks, greet your table, and get the order from another one. You got this. But you have to front load with people to buy yourself this power. \n\nGood luck! Enjoy your job. Have fun and stay safe. \nPeace",
            "author": "ben_the_wind",
            "id": "ekld289",
            "parent_id": "t1_ekjl8ar",
            "score": 12,
            "created_utc": 1554942780.0,
            "replies": [
                {
                    "body": "I wish this comment was getting a little more love because it’s a really generous and well-thought out reminder to always give people the benefit of the doubt. You sound like a good person.",
                    "author": "deadeyedog",
                    "id": "ekli8lm",
                    "parent_id": "t1_ekld289",
                    "score": 3,
                    "created_utc": 1554946479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I second this.",
            "author": "meetmeinthebthrm",
            "id": "ekkhujv",
            "parent_id": "t1_ekjioiy",
            "score": 3,
            "created_utc": 1554922900.0,
            "replies": []
        },
        {
            "body": "More like 80/20",
            "author": "millioneuroextreme",
            "id": "eklu8a2",
            "parent_id": "t1_ekjioiy",
            "score": 2,
            "created_utc": 1554956106.0,
            "replies": []
        },
        {
            "body": "Could also just trim face hairs down nice and neat. Comb hair back with product maybe. Could definitely get away with styling and not a cut",
            "author": "Pawtang",
            "id": "ekjx1ds",
            "parent_id": "t1_ekjikl4",
            "score": 24,
            "created_utc": 1554909878.0,
            "replies": []
        },
        {
            "body": "Nah he wants to earn more tip so any tips should be helpful",
            "author": "Vinc314",
            "id": "ekk4eog",
            "parent_id": "t1_ekk41a8",
            "score": 45,
            "created_utc": 1554914755.0,
            "replies": []
        },
        {
            "body": "I wish this comment was getting a little more love because it’s a really generous and well-thought out reminder to always give people the benefit of the doubt. You sound like a good person.",
            "author": "deadeyedog",
            "id": "ekli8lm",
            "parent_id": "t1_ekld289",
            "score": 3,
            "created_utc": 1554946479.0,
            "replies": []
        }
    ]
}