{
    "title": "we out here just vibin and chillin",
    "post_id": "k7n4e7",
    "post_url": "https://www.reddit.com/r/dankruto/comments/k7n4e7/we_out_here_just_vibin_and_chillin/",
    "author": "ellinorchase",
    "body": "",
    "url": "https://i.redd.it/72zapr1jxh361.jpg",
    "score": 6915,
    "upvote_ratio": 0.99,
    "created_utc": 1607229692.0,
    "num_comments": 111,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Shippuden had a great start.",
            "author": "TyrionGoldenLion",
            "id": "gesdyvv",
            "parent_id": "t3_k7n4e7",
            "score": 905,
            "created_utc": 1607235645.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gesrb5b",
                    "parent_id": "t1_gesdyvv",
                    "score": 543,
                    "created_utc": 1607242748.0,
                    "replies": [
                        {
                            "body": "I used to like Madara before Kishimoto ruined him.",
                            "author": "TyrionGoldenLion",
                            "id": "gesrveo",
                            "parent_id": "t1_gesrb5b",
                            "score": 167,
                            "created_utc": 1607243022.0,
                            "replies": [
                                {
                                    "body": "What point do you think Kishimoto ruined him?",
                                    "author": "BetaBoy777",
                                    "id": "get23or",
                                    "parent_id": "t1_gesrveo",
                                    "score": 94,
                                    "created_utc": 1607248347.0,
                                    "replies": [
                                        {
                                            "body": "Killing him like a fillers character lmao that was disappointing. And then putting in his aliens thing. Even tho what that represents may be deep and shit, he really did it bc Madara was too OP and he ran out of good ideas.",
                                            "author": "Fuhrer-Duhrer",
                                            "id": "get3bnr",
                                            "parent_id": "t1_get23or",
                                            "score": 206,
                                            "created_utc": 1607248916.0,
                                            "replies": [
                                                {
                                                    "body": ">he really did it bc Madara was too OP and he ran out of good ideas\n\nDid Kishi say this or something because I've never understood why fans think this. Madara was too OP so he replaces him with an even stronger foe? That doesn't make sense. I didn't like the Kaguya twist but Kishi definitley didn't do it because Madara was too OP. He could've easily just wrote his defeat by having Naruto and Sasuke fight hard or seal him exactly like Kaguya.",
                                                    "author": "BetaBoy777",
                                                    "id": "get5q5p",
                                                    "parent_id": "t1_get3bnr",
                                                    "score": 127,
                                                    "created_utc": 1607250086.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
                                                            "author": "Khajiit_Joe_Biden",
                                                            "id": "getkh5m",
                                                            "parent_id": "t1_get5q5p",
                                                            "score": 102,
                                                            "created_utc": 1607257435.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                                                                    "author": "UnfilteredRedditor",
                                                                    "id": "getths4",
                                                                    "parent_id": "t1_getkh5m",
                                                                    "score": 50,
                                                                    "created_utc": 1607261931.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                                                                            "author": "Aivaras12398",
                                                                            "id": "geu24z7",
                                                                            "parent_id": "t1_getths4",
                                                                            "score": 19,
                                                                            "created_utc": 1607265681.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                                                                            "author": "KrackerJoe",
                                                                            "id": "geu9q6v",
                                                                            "parent_id": "t1_getths4",
                                                                            "score": 6,
                                                                            "created_utc": 1607269054.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                                                                    "author": "Rikuskill",
                                                                    "id": "geud0sc",
                                                                    "parent_id": "t1_getkh5m",
                                                                    "score": 13,
                                                                    "created_utc": 1607270904.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                                                                    "author": "AGARAN24",
                                                                    "id": "geux8gd",
                                                                    "parent_id": "t1_getkh5m",
                                                                    "score": 4,
                                                                    "created_utc": 1607280730.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If people didn’t know it kills you then he would have at least 80% lol",
                                                                            "author": "BetaBoy777",
                                                                            "id": "gevb8tc",
                                                                            "parent_id": "t1_geux8gd",
                                                                            "score": 3,
                                                                            "created_utc": 1607286028.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
                                                            "author": "astrapes",
                                                            "id": "geutwcp",
                                                            "parent_id": "t1_get5q5p",
                                                            "score": 4,
                                                            "created_utc": 1607279347.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
                                                            "author": "Fuhrer-Duhrer",
                                                            "id": "get7gnr",
                                                            "parent_id": "t1_get5q5p",
                                                            "score": -6,
                                                            "created_utc": 1607250961.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                                                                    "author": "BetaBoy777",
                                                                    "id": "getbyuk",
                                                                    "parent_id": "t1_get7gnr",
                                                                    "score": 23,
                                                                    "created_utc": 1607253124.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                                                                            "author": "Fuhrer-Duhrer",
                                                                            "id": "gevek4s",
                                                                            "parent_id": "t1_getbyuk",
                                                                            "score": 1,
                                                                            "created_utc": 1607287614.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                                                                    "author": "PatchyThePirate159",
                                                                    "id": "geupmbd",
                                                                    "parent_id": "t1_get7gnr",
                                                                    "score": 3,
                                                                    "created_utc": 1607277378.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Kishi actually said that",
                                                            "author": "omeka_sam",
                                                            "id": "gfpk9x0",
                                                            "parent_id": "t1_get5q5p",
                                                            "score": 1,
                                                            "created_utc": 1607876312.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Wouldn't Naruto and Sasuke have been able to defeat madara?",
                                                    "author": "Xpblast",
                                                    "id": "get58hs",
                                                    "parent_id": "t1_get3bnr",
                                                    "score": 18,
                                                    "created_utc": 1607249839.0,
                                                    "replies": [
                                                        {
                                                            "body": "Only with the help of Sakura\n\n/s",
                                                            "author": "SingSing19",
                                                            "id": "getmvb9",
                                                            "parent_id": "t1_get58hs",
                                                            "score": 20,
                                                            "created_utc": 1607258630.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Kankuro controls Sakura to defeat Madara",
                                                                    "author": "Xpblast",
                                                                    "id": "gety3xk",
                                                                    "parent_id": "t1_getmvb9",
                                                                    "score": 24,
                                                                    "created_utc": 1607264045.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
                                                            "author": "Fuhrer-Duhrer",
                                                            "id": "get7xyw",
                                                            "parent_id": "t1_get58hs",
                                                            "score": 6,
                                                            "created_utc": 1607251183.0,
                                                            "replies": [
                                                                {
                                                                    "body": "They could've done the entire Kaguya fight except it's against Madara",
                                                                    "author": "AlexRagesGames",
                                                                    "id": "getmusv",
                                                                    "parent_id": "t1_get7xyw",
                                                                    "score": 30,
                                                                    "created_utc": 1607258623.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "This!",
                                                                            "author": "G3mipl4fy",
                                                                            "id": "geto44q",
                                                                            "parent_id": "t1_getmusv",
                                                                            "score": 8,
                                                                            "created_utc": 1607259236.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Harem jutsu but its all Hashirama",
                                                                                    "author": "Rikuskill",
                                                                                    "id": "geud4o8",
                                                                                    "parent_id": "t1_geto44q",
                                                                                    "score": 27,
                                                                                    "created_utc": 1607270963.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "You scoundrel, now I have a nosebleed",
                                                                                            "author": "G3mipl4fy",
                                                                                            "id": "gev0r23",
                                                                                            "parent_id": "t1_geud4o8",
                                                                                            "score": 4,
                                                                                            "created_utc": 1607282096.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Yeah I know that’s why it kinda makes no sense.",
                                                                            "author": "Fuhrer-Duhrer",
                                                                            "id": "geveaq9",
                                                                            "parent_id": "t1_getmusv",
                                                                            "score": 1,
                                                                            "created_utc": 1607287492.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                                                                    "author": "Xpblast",
                                                                    "id": "getypn0",
                                                                    "parent_id": "t1_get7xyw",
                                                                    "score": 2,
                                                                    "created_utc": 1607264284.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
                                                            "author": "Twin1Tanaka",
                                                            "id": "geud464",
                                                            "parent_id": "t1_get58hs",
                                                            "score": 2,
                                                            "created_utc": 1607270955.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I like to pretend naruto ended with the death of pain.",
                                                    "author": "cheese4352",
                                                    "id": "getwmrl",
                                                    "parent_id": "t1_get3bnr",
                                                    "score": 8,
                                                    "created_utc": 1607263429.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
                                                            "author": "BetaBoy777",
                                                            "id": "getymhj",
                                                            "parent_id": "t1_getwmrl",
                                                            "score": 11,
                                                            "created_utc": 1607264251.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                                                    "author": "thedizzle11",
                                                                    "id": "geu9ht3",
                                                                    "parent_id": "t1_getymhj",
                                                                    "score": 6,
                                                                    "created_utc": 1607268916.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Most of those were fillers though",
                                                                            "author": "Shrenade514",
                                                                            "id": "geugda3",
                                                                            "parent_id": "t1_geu9ht3",
                                                                            "score": 3,
                                                                            "created_utc": 1607272733.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                                                    "author": "thedizzle11",
                                                                    "id": "geu9k3z",
                                                                    "parent_id": "t1_getymhj",
                                                                    "score": 1,
                                                                    "created_utc": 1607268955.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "The thing about Madara being tricked was an epic plot twist. But Madara wasn't a good character to be tricked like that. It kinda ruined his frame, like this spark of a demigod and ability to walk through impossible like walking through a park didn't match his helplessness in having all of this taken away in a matter of a simple backstab. He should've fought. My friend said: it would be awesome if Madara tried to fight back and help Naruto and Sasuke seal the rabbit Queen. That'd really help rebuild the character.\n\nEDIT: IMO it would be way better to see (even via more fillers) him overcoming Kaguya somewhat the way Obito overcame the 10 tails. Madara was already established, with hints to his existence, a colorful backstory and this frame of being indestructible, beyond humanity and death. Just like Hashirama he was powerful enough to break control of edo tensei. All taken away with what? Black Zetsu going full Kakashi through his back. And poof, replaced with basically a new character. Don't get me wrong, I loved Kaguya. But come on. Imagine he's now in control of all Kaguya's power like: \"Look at me - I'm the chakra goddess now\".",
                                            "author": "G3mipl4fy",
                                            "id": "getobbu",
                                            "parent_id": "t1_get23or",
                                            "score": 13,
                                            "created_utc": 1607259333.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "kishimoto literally created him",
                                            "author": "verifiedjay",
                                            "id": "geupotp",
                                            "parent_id": "t1_get23or",
                                            "score": 3,
                                            "created_utc": 1607277412.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Black Zetsu one handing him",
                                            "author": "ThePsychopaths",
                                            "id": "get2ydp",
                                            "parent_id": "t1_get23or",
                                            "score": 5,
                                            "created_utc": 1607248741.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The hax powerups, his stupid Sasuke knockoff backstory, the fact he was reduced to a Pein wannabe.",
                                            "author": "TyrionGoldenLion",
                                            "id": "getvyns",
                                            "parent_id": "t1_get23or",
                                            "score": 3,
                                            "created_utc": 1607263177.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yup, they should have kept the darker tone it started with. It just became ridiculous at a certain point.",
                    "author": "ASZapata",
                    "id": "gesq2vi",
                    "parent_id": "t1_gesdyvv",
                    "score": 89,
                    "created_utc": 1607242159.0,
                    "replies": []
                },
                {
                    "body": "i think they messed up from the Pains attack arc, everything before was pretty good",
                    "author": "LilQuasar",
                    "id": "geugrpo",
                    "parent_id": "t1_gesdyvv",
                    "score": 9,
                    "created_utc": 1607272947.0,
                    "replies": []
                },
                {
                    "body": "100th upvote! yeah you’re right. that arc was sick af",
                    "author": "claravelle-nazal",
                    "id": "get0mhw",
                    "parent_id": "t1_gesdyvv",
                    "score": 10,
                    "created_utc": 1607247561.0,
                    "replies": []
                },
                {
                    "body": "i’ll never  forget this scene",
                    "author": "verifiedjay",
                    "id": "geupm0y",
                    "parent_id": "t1_gesdyvv",
                    "score": 6,
                    "created_utc": 1607277374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Deidara slapping Gaara’s face in front of Naruto was so damn rage-inducing",
            "author": "CoraxtheRavenLord",
            "id": "gesfu16",
            "parent_id": "t3_k7n4e7",
            "score": 240,
            "created_utc": 1607237083.0,
            "replies": [
                {
                    "body": "Sasuke took revenge for Gaara and Naruto you can say, seeing how he made him feel inferior and drive him to commit suicide.",
                    "author": "Xxhusky69420xX",
                    "id": "gesh3v7",
                    "parent_id": "t1_gesfu16",
                    "score": 69,
                    "created_utc": 1607237958.0,
                    "replies": [
                        {
                            "body": "Sasuke did not do that to avenge Gaara lol",
                            "author": null,
                            "id": "gesxi02",
                            "parent_id": "t1_gesh3v7",
                            "score": 109,
                            "created_utc": 1607245969.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gesrls0",
                            "parent_id": "t1_gesh3v7",
                            "score": 34,
                            "created_utc": 1607242892.0,
                            "replies": [
                                {
                                    "body": "Yes but he made him FEEL inferior which was the whole point to OP’s comment.",
                                    "author": "_whensmahvel_",
                                    "id": "gesyrie",
                                    "parent_id": "t1_gesrls0",
                                    "score": 53,
                                    "created_utc": 1607246603.0,
                                    "replies": []
                                },
                                {
                                    "body": "“ I don’t think Deidara was inferior bc Sasuke had advantages” \n\nDo you know what inferior means?",
                                    "author": "SMaxTH",
                                    "id": "get1955",
                                    "parent_id": "t1_gesrls0",
                                    "score": 31,
                                    "created_utc": 1607247932.0,
                                    "replies": []
                                },
                                {
                                    "body": "Bro why the fuck people always argue against peoples strengths due to some power gained outside of them. The MAIN CHARACTER has the KYUUBI. Madara has hashirama cells. So does obito. So did Danzo. It’s part of the series stop being so fucking dense.",
                                    "author": null,
                                    "id": "geyajgn",
                                    "parent_id": "t1_gesrls0",
                                    "score": 1,
                                    "created_utc": 1607357418.0,
                                    "replies": [
                                        {
                                            "body": "Naruto was always going to be strong though. Kurama was just a bonus.",
                                            "author": "bubblez4eva",
                                            "id": "gglkm2k",
                                            "parent_id": "t1_geyajgn",
                                            "score": 1,
                                            "created_utc": 1608568674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Luckily sasuke gave deidara what he deserved",
                    "author": null,
                    "id": "gesojef",
                    "parent_id": "t1_gesfu16",
                    "score": 7,
                    "created_utc": 1607241431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Deidara: Art is an explosion!\n\nSasori: Art is an eternal beauty!\n\nGaara: Art is dead.",
            "author": "GodofPigz",
            "id": "geskzbf",
            "parent_id": "t3_k7n4e7",
            "score": 314,
            "created_utc": 1607239770.0,
            "replies": [
                {
                    "body": "sasuke: Art is killing Itachi",
                    "author": "rumpyhumpy",
                    "id": "geszr7b",
                    "parent_id": "t1_geskzbf",
                    "score": 73,
                    "created_utc": 1607247144.0,
                    "replies": []
                },
                {
                    "body": "jiraiya: Art is peeking",
                    "author": "ZenXgaming100",
                    "id": "get12bz",
                    "parent_id": "t1_geskzbf",
                    "score": 67,
                    "created_utc": 1607247814.0,
                    "replies": [
                        {
                            "body": "Tsunade: Art is 106cm",
                            "author": "ZenXgaming100",
                            "id": "get2daa",
                            "parent_id": "t1_get12bz",
                            "score": 57,
                            "created_utc": 1607248476.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Orochimaru: Art is little boys",
                    "author": "lordMoonface",
                    "id": "get2grm",
                    "parent_id": "t1_geskzbf",
                    "score": 57,
                    "created_utc": 1607248517.0,
                    "replies": [
                        {
                            "body": "hol up",
                            "author": "SmallerBork",
                            "id": "gkb551m",
                            "parent_id": "t1_get2grm",
                            "score": 4,
                            "created_utc": 1611383292.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Rock Lee : Art is silky brows and skin tight suits",
                    "author": "RedditIsAwesomy",
                    "id": "get5zfy",
                    "parent_id": "t1_geskzbf",
                    "score": 52,
                    "created_utc": 1607250228.0,
                    "replies": [
                        {
                            "body": "Underrated comment",
                            "author": "ChisTurtle",
                            "id": "geudnza",
                            "parent_id": "t1_get5zfy",
                            "score": 7,
                            "created_utc": 1607271254.0,
                            "replies": [
                                {
                                    "body": "We appreciate you taking the time to flag this as an underrated comment.\n\nHowever, this appears to be in error and the comment is already rated according to its quality.",
                                    "author": "RatedCommentBot",
                                    "id": "geuiv0s",
                                    "parent_id": "t1_geudnza",
                                    "score": 4,
                                    "created_utc": 1607274037.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Obito: Art is Rin",
                    "author": "RedShankyMan",
                    "id": "get4bf8",
                    "parent_id": "t1_geskzbf",
                    "score": 42,
                    "created_utc": 1607249410.0,
                    "replies": []
                },
                {
                    "body": "Nagato: Art is Pain",
                    "author": "s4shrish",
                    "id": "get9a7a",
                    "parent_id": "t1_geskzbf",
                    "score": 37,
                    "created_utc": 1607251779.0,
                    "replies": []
                },
                {
                    "body": "sakura: art is sasuke",
                    "author": "claravelle-nazal",
                    "id": "get0nzy",
                    "parent_id": "t1_geskzbf",
                    "score": 71,
                    "created_utc": 1607247585.0,
                    "replies": []
                },
                {
                    "body": "Danzo: Art is sharingan",
                    "author": "claravelle-nazal",
                    "id": "getvwjh",
                    "parent_id": "t1_geskzbf",
                    "score": 30,
                    "created_utc": 1607263154.0,
                    "replies": [
                        {
                            "body": "Ramen Man: Art is Cutlet Pork Ramen!",
                            "author": "Your1AfricanPrince",
                            "id": "geu0i1s",
                            "parent_id": "t1_getvwjh",
                            "score": 17,
                            "created_utc": 1607265028.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Killer Bee: Art is rapping fool, ya fool!",
                    "author": "ChisTurtle",
                    "id": "geue77i",
                    "parent_id": "t1_geskzbf",
                    "score": 23,
                    "created_utc": 1607271545.0,
                    "replies": []
                },
                {
                    "body": "kurenai: art is using genjutsu on itachi",
                    "author": "kgtbffxddx",
                    "id": "get8go8",
                    "parent_id": "t1_geskzbf",
                    "score": 43,
                    "created_utc": 1607251410.0,
                    "replies": []
                },
                {
                    "body": "Hinata: Art is N-n-naruto-kun",
                    "author": "Basic_Username101",
                    "id": "gete662",
                    "parent_id": "t1_geskzbf",
                    "score": 41,
                    "created_utc": 1607254256.0,
                    "replies": []
                },
                {
                    "body": "Kakashi : Art is copying",
                    "author": "koto__amatsukami",
                    "id": "getbjsr",
                    "parent_id": "t1_geskzbf",
                    "score": 34,
                    "created_utc": 1607252917.0,
                    "replies": [
                        {
                            "body": "Tobirama : Art is suppressing Uchihas",
                            "author": "koto__amatsukami",
                            "id": "getnmj7",
                            "parent_id": "t1_getbjsr",
                            "score": 34,
                            "created_utc": 1607258992.0,
                            "replies": []
                        },
                        {
                            "body": "Kiba: art is fang over fang",
                            "author": "sese2003",
                            "id": "getn0sh",
                            "parent_id": "t1_getbjsr",
                            "score": 29,
                            "created_utc": 1607258707.0,
                            "replies": [
                                {
                                    "body": "GATSUGAAA",
                                    "author": "mrpatuti",
                                    "id": "geujdim",
                                    "parent_id": "t1_getn0sh",
                                    "score": 9,
                                    "created_utc": 1607274299.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Kakashi: Art is Icha Icha",
                            "author": "claravelle-nazal",
                            "id": "getvy41",
                            "parent_id": "t1_getbjsr",
                            "score": 12,
                            "created_utc": 1607263171.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Choji: Art is the last chip",
                    "author": "Unknown-uchiha",
                    "id": "geugit7",
                    "parent_id": "t1_geskzbf",
                    "score": 16,
                    "created_utc": 1607272816.0,
                    "replies": [
                        {
                            "body": "Minato: art is ridiculously long jutsu names",
                            "author": null,
                            "id": "geup6qk",
                            "parent_id": "t1_geugit7",
                            "score": 15,
                            "created_utc": 1607277164.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Shikamaru: Art is a drag",
                    "author": "sywy1874",
                    "id": "geurpxl",
                    "parent_id": "t1_geskzbf",
                    "score": 15,
                    "created_utc": 1607278397.0,
                    "replies": []
                },
                {
                    "body": "Orochimaru: Art is immortality",
                    "author": "PreeIsAlive",
                    "id": "get2c3a",
                    "parent_id": "t1_geskzbf",
                    "score": 41,
                    "created_utc": 1607248460.0,
                    "replies": []
                },
                {
                    "body": "Itachi: Art is saying \"foolish little brother\".",
                    "author": "whyAmIHere_11",
                    "id": "gevhut0",
                    "parent_id": "t1_geskzbf",
                    "score": 10,
                    "created_utc": 1607289135.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "getdm7h",
            "parent_id": "t3_k7n4e7",
            "score": 105,
            "created_utc": 1607253990.0,
            "replies": [
                {
                    "body": "Idk if 15 counts as an adult lol",
                    "author": "jaykaysian",
                    "id": "geu8nhq",
                    "parent_id": "t1_getdm7h",
                    "score": 26,
                    "created_utc": 1607268461.0,
                    "replies": [
                        {
                            "body": "It is when you're a child soldier!",
                            "author": "thekingofbeans42",
                            "id": "geudy9c",
                            "parent_id": "t1_geu8nhq",
                            "score": 47,
                            "created_utc": 1607271406.0,
                            "replies": [
                                {
                                    "body": "Now you’re a teen soldier 😎",
                                    "author": "Pac_Zach_Attack",
                                    "id": "geusv0g",
                                    "parent_id": "t1_geudy9c",
                                    "score": 8,
                                    "created_utc": 1607278902.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think people often forget how young they are in the show. It makes me more forgiving for some of their flaws. Tbh this is a anime thing in general",
                            "author": "WindyCityAssasin2",
                            "id": "geut0ev",
                            "parent_id": "t1_geu8nhq",
                            "score": 4,
                            "created_utc": 1607278963.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "the arc would've been great if it wasnt for the 59025692587690567324536345 episode long fight between sakura and gaara",
                    "author": null,
                    "id": "giw4hkm",
                    "parent_id": "t1_getdm7h",
                    "score": 1,
                    "created_utc": 1610379913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good times",
            "author": "Agent_Oxygen",
            "id": "gescnwy",
            "parent_id": "t3_k7n4e7",
            "score": 47,
            "created_utc": 1607234698.0,
            "replies": []
        },
        {
            "body": "Gaara's ghost: ....-_-",
            "author": "Purplegrey_ink",
            "id": "gesh5gu",
            "parent_id": "t3_k7n4e7",
            "score": 38,
            "created_utc": 1607237986.0,
            "replies": []
        },
        {
            "body": "Deidara: ART IS A ONE TIME THING, YOU CAN’T JUST DO IT OVER AND OVER AGAIN IT HAS TO BE INSPIRED!\n\nSasori: I disagree, art is something that is meant to be done repetitively and with each time show your progress in the art",
            "author": "HokageOfReddit",
            "id": "getb4ft",
            "parent_id": "t3_k7n4e7",
            "score": 33,
            "created_utc": 1607252687.0,
            "replies": []
        },
        {
            "body": "\"2 boys siting on a kage, 5 meters appart cause we're not gay\"",
            "author": "IkkiDuPhenix44",
            "id": "geuiiua",
            "parent_id": "t3_k7n4e7",
            "score": 28,
            "created_utc": 1607273861.0,
            "replies": [
                {
                    "body": "5 meters is 5.47 yards",
                    "author": "converter-bot",
                    "id": "geuijxa",
                    "parent_id": "t1_geuiiua",
                    "score": 9,
                    "created_utc": 1607273877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "simpler times",
            "author": "bigflokac",
            "id": "get3wlv",
            "parent_id": "t3_k7n4e7",
            "score": 19,
            "created_utc": 1607249215.0,
            "replies": []
        },
        {
            "body": "Sasori would've been a huge problem if they didn't get that antidote",
            "author": "John_East",
            "id": "get6hfb",
            "parent_id": "t3_k7n4e7",
            "score": 37,
            "created_utc": 1607250506.0,
            "replies": [
                {
                    "body": "*Sasori would've been a*\n\n*Huge problem if they didn't*\n\n*Get that antidote*\n\n\\- John\\_East\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "author": "haikusbot",
                    "id": "get6i5a",
                    "parent_id": "t1_get6hfb",
                    "score": 25,
                    "created_utc": 1607250517.0,
                    "replies": [
                        {
                            "body": "Good bot",
                            "author": "Sunny_Jinn",
                            "id": "getam25",
                            "parent_id": "t1_get6i5a",
                            "score": 11,
                            "created_utc": 1607252442.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“So Sasori, are you a tits or ass man?”\n\n“Feet.”",
            "author": "MirrahPaladin",
            "id": "geufz7r",
            "parent_id": "t3_k7n4e7",
            "score": 17,
            "created_utc": 1607272520.0,
            "replies": [
                {
                    "body": "mm, good choice my man",
                    "author": "SolerFlereTEE",
                    "id": "geuy9k1",
                    "parent_id": "t1_geufz7r",
                    "score": 11,
                    "created_utc": 1607281136.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Easily one of the best arcs in the entire show",
            "author": "RollerCoasterBacon",
            "id": "get3tmq",
            "parent_id": "t3_k7n4e7",
            "score": 28,
            "created_utc": 1607249172.0,
            "replies": []
        },
        {
            "body": "Top 10 flexes in anime",
            "author": "waywrd_son",
            "id": "gesylie",
            "parent_id": "t3_k7n4e7",
            "score": 13,
            "created_utc": 1607246511.0,
            "replies": []
        },
        {
            "body": "The disrespect to my boy 😭",
            "author": "girl-who-waves-hands",
            "id": "gesteuu",
            "parent_id": "t3_k7n4e7",
            "score": 26,
            "created_utc": 1607243783.0,
            "replies": []
        },
        {
            "body": "Makes me sad sasori went out like a bitch, he was so strong",
            "author": "randy-lahey96",
            "id": "geu1wmo",
            "parent_id": "t3_k7n4e7",
            "score": 8,
            "created_utc": 1607265586.0,
            "replies": []
        },
        {
            "body": "this was an interesting moment for me, i was half crying because i thought gaara was dead for good, but half laughing because of deidara and sasori's conversation",
            "author": "LightningMcCarlisle",
            "id": "geum4vx",
            "parent_id": "t3_k7n4e7",
            "score": 10,
            "created_utc": 1607275649.0,
            "replies": []
        },
        {
            "body": "I've been rewatching naruto with my brother and we are about to get here. Now im just excited because I really forgot how good it was.",
            "author": "MinecraftTime1",
            "id": "getwf8i",
            "parent_id": "t3_k7n4e7",
            "score": 7,
            "created_utc": 1607263343.0,
            "replies": [
                {
                    "body": "That's what happens with me too. I'll be scrolling through YT and see a naruto vid in my recommended and then I feel compelled to just watch it all again",
                    "author": "WindyCityAssasin2",
                    "id": "geut7gs",
                    "parent_id": "t1_getwf8i",
                    "score": 6,
                    "created_utc": 1607279043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Relatable",
            "author": "SharkeyBoyo",
            "id": "geszadd",
            "parent_id": "t3_k7n4e7",
            "score": 6,
            "created_utc": 1607246885.0,
            "replies": []
        },
        {
            "body": "This arc was definitely my favorite. We got to see Sakura actually do cool stuff in a fight for once and Deidara is easily my favorite character in Naruto.",
            "author": "KT11616",
            "id": "geviucb",
            "parent_id": "t3_k7n4e7",
            "score": 5,
            "created_utc": 1607289590.0,
            "replies": []
        },
        {
            "body": "So is gaaras foot In sasoris ass?",
            "author": "EmptyEmpathy1",
            "id": "gewi3a1",
            "parent_id": "t3_k7n4e7",
            "score": 3,
            "created_utc": 1607308154.0,
            "replies": []
        },
        {
            "body": "Yeah and when naruto saw that disrespectful shit he went off",
            "author": null,
            "id": "gev78h6",
            "parent_id": "t3_k7n4e7",
            "score": 2,
            "created_utc": 1607284225.0,
            "replies": []
        },
        {
            "body": "Disrespectful to the sand man!",
            "author": "Revolutionary_Dig898",
            "id": "gevsvjg",
            "parent_id": "t3_k7n4e7",
            "score": 2,
            "created_utc": 1607294616.0,
            "replies": []
        },
        {
            "body": "give Gaara back!!!!!!\n\npffft no",
            "author": "yelly27",
            "id": "gew0mvz",
            "parent_id": "t3_k7n4e7",
            "score": 1,
            "created_utc": 1607298634.0,
            "replies": []
        },
        {
            "body": "If only deidara got to see the part where Tobirama had a justu with almost infinite explosions....",
            "author": "Sasuke12187",
            "id": "gew9n0v",
            "parent_id": "t3_k7n4e7",
            "score": 1,
            "created_utc": 1607303462.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gesrb5b",
            "parent_id": "t1_gesdyvv",
            "score": 543,
            "created_utc": 1607242748.0,
            "replies": [
                {
                    "body": "I used to like Madara before Kishimoto ruined him.",
                    "author": "TyrionGoldenLion",
                    "id": "gesrveo",
                    "parent_id": "t1_gesrb5b",
                    "score": 167,
                    "created_utc": 1607243022.0,
                    "replies": [
                        {
                            "body": "What point do you think Kishimoto ruined him?",
                            "author": "BetaBoy777",
                            "id": "get23or",
                            "parent_id": "t1_gesrveo",
                            "score": 94,
                            "created_utc": 1607248347.0,
                            "replies": [
                                {
                                    "body": "Killing him like a fillers character lmao that was disappointing. And then putting in his aliens thing. Even tho what that represents may be deep and shit, he really did it bc Madara was too OP and he ran out of good ideas.",
                                    "author": "Fuhrer-Duhrer",
                                    "id": "get3bnr",
                                    "parent_id": "t1_get23or",
                                    "score": 206,
                                    "created_utc": 1607248916.0,
                                    "replies": [
                                        {
                                            "body": ">he really did it bc Madara was too OP and he ran out of good ideas\n\nDid Kishi say this or something because I've never understood why fans think this. Madara was too OP so he replaces him with an even stronger foe? That doesn't make sense. I didn't like the Kaguya twist but Kishi definitley didn't do it because Madara was too OP. He could've easily just wrote his defeat by having Naruto and Sasuke fight hard or seal him exactly like Kaguya.",
                                            "author": "BetaBoy777",
                                            "id": "get5q5p",
                                            "parent_id": "t1_get3bnr",
                                            "score": 127,
                                            "created_utc": 1607250086.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
                                                    "author": "Khajiit_Joe_Biden",
                                                    "id": "getkh5m",
                                                    "parent_id": "t1_get5q5p",
                                                    "score": 102,
                                                    "created_utc": 1607257435.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                                                            "author": "UnfilteredRedditor",
                                                            "id": "getths4",
                                                            "parent_id": "t1_getkh5m",
                                                            "score": 50,
                                                            "created_utc": 1607261931.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                                                                    "author": "Aivaras12398",
                                                                    "id": "geu24z7",
                                                                    "parent_id": "t1_getths4",
                                                                    "score": 19,
                                                                    "created_utc": 1607265681.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                                                                    "author": "KrackerJoe",
                                                                    "id": "geu9q6v",
                                                                    "parent_id": "t1_getths4",
                                                                    "score": 6,
                                                                    "created_utc": 1607269054.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                                                            "author": "Rikuskill",
                                                            "id": "geud0sc",
                                                            "parent_id": "t1_getkh5m",
                                                            "score": 13,
                                                            "created_utc": 1607270904.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                                                            "author": "AGARAN24",
                                                            "id": "geux8gd",
                                                            "parent_id": "t1_getkh5m",
                                                            "score": 4,
                                                            "created_utc": 1607280730.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If people didn’t know it kills you then he would have at least 80% lol",
                                                                    "author": "BetaBoy777",
                                                                    "id": "gevb8tc",
                                                                    "parent_id": "t1_geux8gd",
                                                                    "score": 3,
                                                                    "created_utc": 1607286028.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
                                                    "author": "astrapes",
                                                    "id": "geutwcp",
                                                    "parent_id": "t1_get5q5p",
                                                    "score": 4,
                                                    "created_utc": 1607279347.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
                                                    "author": "Fuhrer-Duhrer",
                                                    "id": "get7gnr",
                                                    "parent_id": "t1_get5q5p",
                                                    "score": -6,
                                                    "created_utc": 1607250961.0,
                                                    "replies": [
                                                        {
                                                            "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                                                            "author": "BetaBoy777",
                                                            "id": "getbyuk",
                                                            "parent_id": "t1_get7gnr",
                                                            "score": 23,
                                                            "created_utc": 1607253124.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                                                                    "author": "Fuhrer-Duhrer",
                                                                    "id": "gevek4s",
                                                                    "parent_id": "t1_getbyuk",
                                                                    "score": 1,
                                                                    "created_utc": 1607287614.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                                                            "author": "PatchyThePirate159",
                                                            "id": "geupmbd",
                                                            "parent_id": "t1_get7gnr",
                                                            "score": 3,
                                                            "created_utc": 1607277378.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Kishi actually said that",
                                                    "author": "omeka_sam",
                                                    "id": "gfpk9x0",
                                                    "parent_id": "t1_get5q5p",
                                                    "score": 1,
                                                    "created_utc": 1607876312.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Wouldn't Naruto and Sasuke have been able to defeat madara?",
                                            "author": "Xpblast",
                                            "id": "get58hs",
                                            "parent_id": "t1_get3bnr",
                                            "score": 18,
                                            "created_utc": 1607249839.0,
                                            "replies": [
                                                {
                                                    "body": "Only with the help of Sakura\n\n/s",
                                                    "author": "SingSing19",
                                                    "id": "getmvb9",
                                                    "parent_id": "t1_get58hs",
                                                    "score": 20,
                                                    "created_utc": 1607258630.0,
                                                    "replies": [
                                                        {
                                                            "body": "Kankuro controls Sakura to defeat Madara",
                                                            "author": "Xpblast",
                                                            "id": "gety3xk",
                                                            "parent_id": "t1_getmvb9",
                                                            "score": 24,
                                                            "created_utc": 1607264045.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
                                                    "author": "Fuhrer-Duhrer",
                                                    "id": "get7xyw",
                                                    "parent_id": "t1_get58hs",
                                                    "score": 6,
                                                    "created_utc": 1607251183.0,
                                                    "replies": [
                                                        {
                                                            "body": "They could've done the entire Kaguya fight except it's against Madara",
                                                            "author": "AlexRagesGames",
                                                            "id": "getmusv",
                                                            "parent_id": "t1_get7xyw",
                                                            "score": 30,
                                                            "created_utc": 1607258623.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This!",
                                                                    "author": "G3mipl4fy",
                                                                    "id": "geto44q",
                                                                    "parent_id": "t1_getmusv",
                                                                    "score": 8,
                                                                    "created_utc": 1607259236.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Harem jutsu but its all Hashirama",
                                                                            "author": "Rikuskill",
                                                                            "id": "geud4o8",
                                                                            "parent_id": "t1_geto44q",
                                                                            "score": 27,
                                                                            "created_utc": 1607270963.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You scoundrel, now I have a nosebleed",
                                                                                    "author": "G3mipl4fy",
                                                                                    "id": "gev0r23",
                                                                                    "parent_id": "t1_geud4o8",
                                                                                    "score": 4,
                                                                                    "created_utc": 1607282096.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Yeah I know that’s why it kinda makes no sense.",
                                                                    "author": "Fuhrer-Duhrer",
                                                                    "id": "geveaq9",
                                                                    "parent_id": "t1_getmusv",
                                                                    "score": 1,
                                                                    "created_utc": 1607287492.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                                                            "author": "Xpblast",
                                                            "id": "getypn0",
                                                            "parent_id": "t1_get7xyw",
                                                            "score": 2,
                                                            "created_utc": 1607264284.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
                                                    "author": "Twin1Tanaka",
                                                    "id": "geud464",
                                                    "parent_id": "t1_get58hs",
                                                    "score": 2,
                                                    "created_utc": 1607270955.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I like to pretend naruto ended with the death of pain.",
                                            "author": "cheese4352",
                                            "id": "getwmrl",
                                            "parent_id": "t1_get3bnr",
                                            "score": 8,
                                            "created_utc": 1607263429.0,
                                            "replies": [
                                                {
                                                    "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
                                                    "author": "BetaBoy777",
                                                    "id": "getymhj",
                                                    "parent_id": "t1_getwmrl",
                                                    "score": 11,
                                                    "created_utc": 1607264251.0,
                                                    "replies": [
                                                        {
                                                            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                                            "author": "thedizzle11",
                                                            "id": "geu9ht3",
                                                            "parent_id": "t1_getymhj",
                                                            "score": 6,
                                                            "created_utc": 1607268916.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Most of those were fillers though",
                                                                    "author": "Shrenade514",
                                                                    "id": "geugda3",
                                                                    "parent_id": "t1_geu9ht3",
                                                                    "score": 3,
                                                                    "created_utc": 1607272733.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                                            "author": "thedizzle11",
                                                            "id": "geu9k3z",
                                                            "parent_id": "t1_getymhj",
                                                            "score": 1,
                                                            "created_utc": 1607268955.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The thing about Madara being tricked was an epic plot twist. But Madara wasn't a good character to be tricked like that. It kinda ruined his frame, like this spark of a demigod and ability to walk through impossible like walking through a park didn't match his helplessness in having all of this taken away in a matter of a simple backstab. He should've fought. My friend said: it would be awesome if Madara tried to fight back and help Naruto and Sasuke seal the rabbit Queen. That'd really help rebuild the character.\n\nEDIT: IMO it would be way better to see (even via more fillers) him overcoming Kaguya somewhat the way Obito overcame the 10 tails. Madara was already established, with hints to his existence, a colorful backstory and this frame of being indestructible, beyond humanity and death. Just like Hashirama he was powerful enough to break control of edo tensei. All taken away with what? Black Zetsu going full Kakashi through his back. And poof, replaced with basically a new character. Don't get me wrong, I loved Kaguya. But come on. Imagine he's now in control of all Kaguya's power like: \"Look at me - I'm the chakra goddess now\".",
                                    "author": "G3mipl4fy",
                                    "id": "getobbu",
                                    "parent_id": "t1_get23or",
                                    "score": 13,
                                    "created_utc": 1607259333.0,
                                    "replies": []
                                },
                                {
                                    "body": "kishimoto literally created him",
                                    "author": "verifiedjay",
                                    "id": "geupotp",
                                    "parent_id": "t1_get23or",
                                    "score": 3,
                                    "created_utc": 1607277412.0,
                                    "replies": []
                                },
                                {
                                    "body": "Black Zetsu one handing him",
                                    "author": "ThePsychopaths",
                                    "id": "get2ydp",
                                    "parent_id": "t1_get23or",
                                    "score": 5,
                                    "created_utc": 1607248741.0,
                                    "replies": []
                                },
                                {
                                    "body": "The hax powerups, his stupid Sasuke knockoff backstory, the fact he was reduced to a Pein wannabe.",
                                    "author": "TyrionGoldenLion",
                                    "id": "getvyns",
                                    "parent_id": "t1_get23or",
                                    "score": 3,
                                    "created_utc": 1607263177.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, they should have kept the darker tone it started with. It just became ridiculous at a certain point.",
            "author": "ASZapata",
            "id": "gesq2vi",
            "parent_id": "t1_gesdyvv",
            "score": 89,
            "created_utc": 1607242159.0,
            "replies": []
        },
        {
            "body": "i think they messed up from the Pains attack arc, everything before was pretty good",
            "author": "LilQuasar",
            "id": "geugrpo",
            "parent_id": "t1_gesdyvv",
            "score": 9,
            "created_utc": 1607272947.0,
            "replies": []
        },
        {
            "body": "100th upvote! yeah you’re right. that arc was sick af",
            "author": "claravelle-nazal",
            "id": "get0mhw",
            "parent_id": "t1_gesdyvv",
            "score": 10,
            "created_utc": 1607247561.0,
            "replies": []
        },
        {
            "body": "i’ll never  forget this scene",
            "author": "verifiedjay",
            "id": "geupm0y",
            "parent_id": "t1_gesdyvv",
            "score": 6,
            "created_utc": 1607277374.0,
            "replies": []
        },
        {
            "body": "Sasuke took revenge for Gaara and Naruto you can say, seeing how he made him feel inferior and drive him to commit suicide.",
            "author": "Xxhusky69420xX",
            "id": "gesh3v7",
            "parent_id": "t1_gesfu16",
            "score": 69,
            "created_utc": 1607237958.0,
            "replies": [
                {
                    "body": "Sasuke did not do that to avenge Gaara lol",
                    "author": null,
                    "id": "gesxi02",
                    "parent_id": "t1_gesh3v7",
                    "score": 109,
                    "created_utc": 1607245969.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gesrls0",
                    "parent_id": "t1_gesh3v7",
                    "score": 34,
                    "created_utc": 1607242892.0,
                    "replies": [
                        {
                            "body": "Yes but he made him FEEL inferior which was the whole point to OP’s comment.",
                            "author": "_whensmahvel_",
                            "id": "gesyrie",
                            "parent_id": "t1_gesrls0",
                            "score": 53,
                            "created_utc": 1607246603.0,
                            "replies": []
                        },
                        {
                            "body": "“ I don’t think Deidara was inferior bc Sasuke had advantages” \n\nDo you know what inferior means?",
                            "author": "SMaxTH",
                            "id": "get1955",
                            "parent_id": "t1_gesrls0",
                            "score": 31,
                            "created_utc": 1607247932.0,
                            "replies": []
                        },
                        {
                            "body": "Bro why the fuck people always argue against peoples strengths due to some power gained outside of them. The MAIN CHARACTER has the KYUUBI. Madara has hashirama cells. So does obito. So did Danzo. It’s part of the series stop being so fucking dense.",
                            "author": null,
                            "id": "geyajgn",
                            "parent_id": "t1_gesrls0",
                            "score": 1,
                            "created_utc": 1607357418.0,
                            "replies": [
                                {
                                    "body": "Naruto was always going to be strong though. Kurama was just a bonus.",
                                    "author": "bubblez4eva",
                                    "id": "gglkm2k",
                                    "parent_id": "t1_geyajgn",
                                    "score": 1,
                                    "created_utc": 1608568674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Luckily sasuke gave deidara what he deserved",
            "author": null,
            "id": "gesojef",
            "parent_id": "t1_gesfu16",
            "score": 7,
            "created_utc": 1607241431.0,
            "replies": []
        },
        {
            "body": "sasuke: Art is killing Itachi",
            "author": "rumpyhumpy",
            "id": "geszr7b",
            "parent_id": "t1_geskzbf",
            "score": 73,
            "created_utc": 1607247144.0,
            "replies": []
        },
        {
            "body": "jiraiya: Art is peeking",
            "author": "ZenXgaming100",
            "id": "get12bz",
            "parent_id": "t1_geskzbf",
            "score": 67,
            "created_utc": 1607247814.0,
            "replies": [
                {
                    "body": "Tsunade: Art is 106cm",
                    "author": "ZenXgaming100",
                    "id": "get2daa",
                    "parent_id": "t1_get12bz",
                    "score": 57,
                    "created_utc": 1607248476.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Orochimaru: Art is little boys",
            "author": "lordMoonface",
            "id": "get2grm",
            "parent_id": "t1_geskzbf",
            "score": 57,
            "created_utc": 1607248517.0,
            "replies": [
                {
                    "body": "hol up",
                    "author": "SmallerBork",
                    "id": "gkb551m",
                    "parent_id": "t1_get2grm",
                    "score": 4,
                    "created_utc": 1611383292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rock Lee : Art is silky brows and skin tight suits",
            "author": "RedditIsAwesomy",
            "id": "get5zfy",
            "parent_id": "t1_geskzbf",
            "score": 52,
            "created_utc": 1607250228.0,
            "replies": [
                {
                    "body": "Underrated comment",
                    "author": "ChisTurtle",
                    "id": "geudnza",
                    "parent_id": "t1_get5zfy",
                    "score": 7,
                    "created_utc": 1607271254.0,
                    "replies": [
                        {
                            "body": "We appreciate you taking the time to flag this as an underrated comment.\n\nHowever, this appears to be in error and the comment is already rated according to its quality.",
                            "author": "RatedCommentBot",
                            "id": "geuiv0s",
                            "parent_id": "t1_geudnza",
                            "score": 4,
                            "created_utc": 1607274037.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Obito: Art is Rin",
            "author": "RedShankyMan",
            "id": "get4bf8",
            "parent_id": "t1_geskzbf",
            "score": 42,
            "created_utc": 1607249410.0,
            "replies": []
        },
        {
            "body": "Nagato: Art is Pain",
            "author": "s4shrish",
            "id": "get9a7a",
            "parent_id": "t1_geskzbf",
            "score": 37,
            "created_utc": 1607251779.0,
            "replies": []
        },
        {
            "body": "sakura: art is sasuke",
            "author": "claravelle-nazal",
            "id": "get0nzy",
            "parent_id": "t1_geskzbf",
            "score": 71,
            "created_utc": 1607247585.0,
            "replies": []
        },
        {
            "body": "Danzo: Art is sharingan",
            "author": "claravelle-nazal",
            "id": "getvwjh",
            "parent_id": "t1_geskzbf",
            "score": 30,
            "created_utc": 1607263154.0,
            "replies": [
                {
                    "body": "Ramen Man: Art is Cutlet Pork Ramen!",
                    "author": "Your1AfricanPrince",
                    "id": "geu0i1s",
                    "parent_id": "t1_getvwjh",
                    "score": 17,
                    "created_utc": 1607265028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Killer Bee: Art is rapping fool, ya fool!",
            "author": "ChisTurtle",
            "id": "geue77i",
            "parent_id": "t1_geskzbf",
            "score": 23,
            "created_utc": 1607271545.0,
            "replies": []
        },
        {
            "body": "kurenai: art is using genjutsu on itachi",
            "author": "kgtbffxddx",
            "id": "get8go8",
            "parent_id": "t1_geskzbf",
            "score": 43,
            "created_utc": 1607251410.0,
            "replies": []
        },
        {
            "body": "Hinata: Art is N-n-naruto-kun",
            "author": "Basic_Username101",
            "id": "gete662",
            "parent_id": "t1_geskzbf",
            "score": 41,
            "created_utc": 1607254256.0,
            "replies": []
        },
        {
            "body": "Kakashi : Art is copying",
            "author": "koto__amatsukami",
            "id": "getbjsr",
            "parent_id": "t1_geskzbf",
            "score": 34,
            "created_utc": 1607252917.0,
            "replies": [
                {
                    "body": "Tobirama : Art is suppressing Uchihas",
                    "author": "koto__amatsukami",
                    "id": "getnmj7",
                    "parent_id": "t1_getbjsr",
                    "score": 34,
                    "created_utc": 1607258992.0,
                    "replies": []
                },
                {
                    "body": "Kiba: art is fang over fang",
                    "author": "sese2003",
                    "id": "getn0sh",
                    "parent_id": "t1_getbjsr",
                    "score": 29,
                    "created_utc": 1607258707.0,
                    "replies": [
                        {
                            "body": "GATSUGAAA",
                            "author": "mrpatuti",
                            "id": "geujdim",
                            "parent_id": "t1_getn0sh",
                            "score": 9,
                            "created_utc": 1607274299.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Kakashi: Art is Icha Icha",
                    "author": "claravelle-nazal",
                    "id": "getvy41",
                    "parent_id": "t1_getbjsr",
                    "score": 12,
                    "created_utc": 1607263171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Choji: Art is the last chip",
            "author": "Unknown-uchiha",
            "id": "geugit7",
            "parent_id": "t1_geskzbf",
            "score": 16,
            "created_utc": 1607272816.0,
            "replies": [
                {
                    "body": "Minato: art is ridiculously long jutsu names",
                    "author": null,
                    "id": "geup6qk",
                    "parent_id": "t1_geugit7",
                    "score": 15,
                    "created_utc": 1607277164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shikamaru: Art is a drag",
            "author": "sywy1874",
            "id": "geurpxl",
            "parent_id": "t1_geskzbf",
            "score": 15,
            "created_utc": 1607278397.0,
            "replies": []
        },
        {
            "body": "Orochimaru: Art is immortality",
            "author": "PreeIsAlive",
            "id": "get2c3a",
            "parent_id": "t1_geskzbf",
            "score": 41,
            "created_utc": 1607248460.0,
            "replies": []
        },
        {
            "body": "Itachi: Art is saying \"foolish little brother\".",
            "author": "whyAmIHere_11",
            "id": "gevhut0",
            "parent_id": "t1_geskzbf",
            "score": 10,
            "created_utc": 1607289135.0,
            "replies": []
        },
        {
            "body": "Idk if 15 counts as an adult lol",
            "author": "jaykaysian",
            "id": "geu8nhq",
            "parent_id": "t1_getdm7h",
            "score": 26,
            "created_utc": 1607268461.0,
            "replies": [
                {
                    "body": "It is when you're a child soldier!",
                    "author": "thekingofbeans42",
                    "id": "geudy9c",
                    "parent_id": "t1_geu8nhq",
                    "score": 47,
                    "created_utc": 1607271406.0,
                    "replies": [
                        {
                            "body": "Now you’re a teen soldier 😎",
                            "author": "Pac_Zach_Attack",
                            "id": "geusv0g",
                            "parent_id": "t1_geudy9c",
                            "score": 8,
                            "created_utc": 1607278902.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think people often forget how young they are in the show. It makes me more forgiving for some of their flaws. Tbh this is a anime thing in general",
                    "author": "WindyCityAssasin2",
                    "id": "geut0ev",
                    "parent_id": "t1_geu8nhq",
                    "score": 4,
                    "created_utc": 1607278963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "the arc would've been great if it wasnt for the 59025692587690567324536345 episode long fight between sakura and gaara",
            "author": null,
            "id": "giw4hkm",
            "parent_id": "t1_getdm7h",
            "score": 1,
            "created_utc": 1610379913.0,
            "replies": []
        },
        {
            "body": "5 meters is 5.47 yards",
            "author": "converter-bot",
            "id": "geuijxa",
            "parent_id": "t1_geuiiua",
            "score": 9,
            "created_utc": 1607273877.0,
            "replies": []
        },
        {
            "body": "*Sasori would've been a*\n\n*Huge problem if they didn't*\n\n*Get that antidote*\n\n\\- John\\_East\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "author": "haikusbot",
            "id": "get6i5a",
            "parent_id": "t1_get6hfb",
            "score": 25,
            "created_utc": 1607250517.0,
            "replies": [
                {
                    "body": "Good bot",
                    "author": "Sunny_Jinn",
                    "id": "getam25",
                    "parent_id": "t1_get6i5a",
                    "score": 11,
                    "created_utc": 1607252442.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "mm, good choice my man",
            "author": "SolerFlereTEE",
            "id": "geuy9k1",
            "parent_id": "t1_geufz7r",
            "score": 11,
            "created_utc": 1607281136.0,
            "replies": []
        },
        {
            "body": "That's what happens with me too. I'll be scrolling through YT and see a naruto vid in my recommended and then I feel compelled to just watch it all again",
            "author": "WindyCityAssasin2",
            "id": "geut7gs",
            "parent_id": "t1_getwf8i",
            "score": 6,
            "created_utc": 1607279043.0,
            "replies": []
        },
        {
            "body": "I used to like Madara before Kishimoto ruined him.",
            "author": "TyrionGoldenLion",
            "id": "gesrveo",
            "parent_id": "t1_gesrb5b",
            "score": 167,
            "created_utc": 1607243022.0,
            "replies": [
                {
                    "body": "What point do you think Kishimoto ruined him?",
                    "author": "BetaBoy777",
                    "id": "get23or",
                    "parent_id": "t1_gesrveo",
                    "score": 94,
                    "created_utc": 1607248347.0,
                    "replies": [
                        {
                            "body": "Killing him like a fillers character lmao that was disappointing. And then putting in his aliens thing. Even tho what that represents may be deep and shit, he really did it bc Madara was too OP and he ran out of good ideas.",
                            "author": "Fuhrer-Duhrer",
                            "id": "get3bnr",
                            "parent_id": "t1_get23or",
                            "score": 206,
                            "created_utc": 1607248916.0,
                            "replies": [
                                {
                                    "body": ">he really did it bc Madara was too OP and he ran out of good ideas\n\nDid Kishi say this or something because I've never understood why fans think this. Madara was too OP so he replaces him with an even stronger foe? That doesn't make sense. I didn't like the Kaguya twist but Kishi definitley didn't do it because Madara was too OP. He could've easily just wrote his defeat by having Naruto and Sasuke fight hard or seal him exactly like Kaguya.",
                                    "author": "BetaBoy777",
                                    "id": "get5q5p",
                                    "parent_id": "t1_get3bnr",
                                    "score": 127,
                                    "created_utc": 1607250086.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
                                            "author": "Khajiit_Joe_Biden",
                                            "id": "getkh5m",
                                            "parent_id": "t1_get5q5p",
                                            "score": 102,
                                            "created_utc": 1607257435.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                                                    "author": "UnfilteredRedditor",
                                                    "id": "getths4",
                                                    "parent_id": "t1_getkh5m",
                                                    "score": 50,
                                                    "created_utc": 1607261931.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                                                            "author": "Aivaras12398",
                                                            "id": "geu24z7",
                                                            "parent_id": "t1_getths4",
                                                            "score": 19,
                                                            "created_utc": 1607265681.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                                                            "author": "KrackerJoe",
                                                            "id": "geu9q6v",
                                                            "parent_id": "t1_getths4",
                                                            "score": 6,
                                                            "created_utc": 1607269054.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                                                    "author": "Rikuskill",
                                                    "id": "geud0sc",
                                                    "parent_id": "t1_getkh5m",
                                                    "score": 13,
                                                    "created_utc": 1607270904.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                                                    "author": "AGARAN24",
                                                    "id": "geux8gd",
                                                    "parent_id": "t1_getkh5m",
                                                    "score": 4,
                                                    "created_utc": 1607280730.0,
                                                    "replies": [
                                                        {
                                                            "body": "If people didn’t know it kills you then he would have at least 80% lol",
                                                            "author": "BetaBoy777",
                                                            "id": "gevb8tc",
                                                            "parent_id": "t1_geux8gd",
                                                            "score": 3,
                                                            "created_utc": 1607286028.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
                                            "author": "astrapes",
                                            "id": "geutwcp",
                                            "parent_id": "t1_get5q5p",
                                            "score": 4,
                                            "created_utc": 1607279347.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
                                            "author": "Fuhrer-Duhrer",
                                            "id": "get7gnr",
                                            "parent_id": "t1_get5q5p",
                                            "score": -6,
                                            "created_utc": 1607250961.0,
                                            "replies": [
                                                {
                                                    "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                                                    "author": "BetaBoy777",
                                                    "id": "getbyuk",
                                                    "parent_id": "t1_get7gnr",
                                                    "score": 23,
                                                    "created_utc": 1607253124.0,
                                                    "replies": [
                                                        {
                                                            "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                                                            "author": "Fuhrer-Duhrer",
                                                            "id": "gevek4s",
                                                            "parent_id": "t1_getbyuk",
                                                            "score": 1,
                                                            "created_utc": 1607287614.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                                                    "author": "PatchyThePirate159",
                                                    "id": "geupmbd",
                                                    "parent_id": "t1_get7gnr",
                                                    "score": 3,
                                                    "created_utc": 1607277378.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Kishi actually said that",
                                            "author": "omeka_sam",
                                            "id": "gfpk9x0",
                                            "parent_id": "t1_get5q5p",
                                            "score": 1,
                                            "created_utc": 1607876312.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Wouldn't Naruto and Sasuke have been able to defeat madara?",
                                    "author": "Xpblast",
                                    "id": "get58hs",
                                    "parent_id": "t1_get3bnr",
                                    "score": 18,
                                    "created_utc": 1607249839.0,
                                    "replies": [
                                        {
                                            "body": "Only with the help of Sakura\n\n/s",
                                            "author": "SingSing19",
                                            "id": "getmvb9",
                                            "parent_id": "t1_get58hs",
                                            "score": 20,
                                            "created_utc": 1607258630.0,
                                            "replies": [
                                                {
                                                    "body": "Kankuro controls Sakura to defeat Madara",
                                                    "author": "Xpblast",
                                                    "id": "gety3xk",
                                                    "parent_id": "t1_getmvb9",
                                                    "score": 24,
                                                    "created_utc": 1607264045.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
                                            "author": "Fuhrer-Duhrer",
                                            "id": "get7xyw",
                                            "parent_id": "t1_get58hs",
                                            "score": 6,
                                            "created_utc": 1607251183.0,
                                            "replies": [
                                                {
                                                    "body": "They could've done the entire Kaguya fight except it's against Madara",
                                                    "author": "AlexRagesGames",
                                                    "id": "getmusv",
                                                    "parent_id": "t1_get7xyw",
                                                    "score": 30,
                                                    "created_utc": 1607258623.0,
                                                    "replies": [
                                                        {
                                                            "body": "This!",
                                                            "author": "G3mipl4fy",
                                                            "id": "geto44q",
                                                            "parent_id": "t1_getmusv",
                                                            "score": 8,
                                                            "created_utc": 1607259236.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Harem jutsu but its all Hashirama",
                                                                    "author": "Rikuskill",
                                                                    "id": "geud4o8",
                                                                    "parent_id": "t1_geto44q",
                                                                    "score": 27,
                                                                    "created_utc": 1607270963.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You scoundrel, now I have a nosebleed",
                                                                            "author": "G3mipl4fy",
                                                                            "id": "gev0r23",
                                                                            "parent_id": "t1_geud4o8",
                                                                            "score": 4,
                                                                            "created_utc": 1607282096.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Yeah I know that’s why it kinda makes no sense.",
                                                            "author": "Fuhrer-Duhrer",
                                                            "id": "geveaq9",
                                                            "parent_id": "t1_getmusv",
                                                            "score": 1,
                                                            "created_utc": 1607287492.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                                                    "author": "Xpblast",
                                                    "id": "getypn0",
                                                    "parent_id": "t1_get7xyw",
                                                    "score": 2,
                                                    "created_utc": 1607264284.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
                                            "author": "Twin1Tanaka",
                                            "id": "geud464",
                                            "parent_id": "t1_get58hs",
                                            "score": 2,
                                            "created_utc": 1607270955.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I like to pretend naruto ended with the death of pain.",
                                    "author": "cheese4352",
                                    "id": "getwmrl",
                                    "parent_id": "t1_get3bnr",
                                    "score": 8,
                                    "created_utc": 1607263429.0,
                                    "replies": [
                                        {
                                            "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
                                            "author": "BetaBoy777",
                                            "id": "getymhj",
                                            "parent_id": "t1_getwmrl",
                                            "score": 11,
                                            "created_utc": 1607264251.0,
                                            "replies": [
                                                {
                                                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                                    "author": "thedizzle11",
                                                    "id": "geu9ht3",
                                                    "parent_id": "t1_getymhj",
                                                    "score": 6,
                                                    "created_utc": 1607268916.0,
                                                    "replies": [
                                                        {
                                                            "body": "Most of those were fillers though",
                                                            "author": "Shrenade514",
                                                            "id": "geugda3",
                                                            "parent_id": "t1_geu9ht3",
                                                            "score": 3,
                                                            "created_utc": 1607272733.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                                    "author": "thedizzle11",
                                                    "id": "geu9k3z",
                                                    "parent_id": "t1_getymhj",
                                                    "score": 1,
                                                    "created_utc": 1607268955.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The thing about Madara being tricked was an epic plot twist. But Madara wasn't a good character to be tricked like that. It kinda ruined his frame, like this spark of a demigod and ability to walk through impossible like walking through a park didn't match his helplessness in having all of this taken away in a matter of a simple backstab. He should've fought. My friend said: it would be awesome if Madara tried to fight back and help Naruto and Sasuke seal the rabbit Queen. That'd really help rebuild the character.\n\nEDIT: IMO it would be way better to see (even via more fillers) him overcoming Kaguya somewhat the way Obito overcame the 10 tails. Madara was already established, with hints to his existence, a colorful backstory and this frame of being indestructible, beyond humanity and death. Just like Hashirama he was powerful enough to break control of edo tensei. All taken away with what? Black Zetsu going full Kakashi through his back. And poof, replaced with basically a new character. Don't get me wrong, I loved Kaguya. But come on. Imagine he's now in control of all Kaguya's power like: \"Look at me - I'm the chakra goddess now\".",
                            "author": "G3mipl4fy",
                            "id": "getobbu",
                            "parent_id": "t1_get23or",
                            "score": 13,
                            "created_utc": 1607259333.0,
                            "replies": []
                        },
                        {
                            "body": "kishimoto literally created him",
                            "author": "verifiedjay",
                            "id": "geupotp",
                            "parent_id": "t1_get23or",
                            "score": 3,
                            "created_utc": 1607277412.0,
                            "replies": []
                        },
                        {
                            "body": "Black Zetsu one handing him",
                            "author": "ThePsychopaths",
                            "id": "get2ydp",
                            "parent_id": "t1_get23or",
                            "score": 5,
                            "created_utc": 1607248741.0,
                            "replies": []
                        },
                        {
                            "body": "The hax powerups, his stupid Sasuke knockoff backstory, the fact he was reduced to a Pein wannabe.",
                            "author": "TyrionGoldenLion",
                            "id": "getvyns",
                            "parent_id": "t1_get23or",
                            "score": 3,
                            "created_utc": 1607263177.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sasuke did not do that to avenge Gaara lol",
            "author": null,
            "id": "gesxi02",
            "parent_id": "t1_gesh3v7",
            "score": 109,
            "created_utc": 1607245969.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gesrls0",
            "parent_id": "t1_gesh3v7",
            "score": 34,
            "created_utc": 1607242892.0,
            "replies": [
                {
                    "body": "Yes but he made him FEEL inferior which was the whole point to OP’s comment.",
                    "author": "_whensmahvel_",
                    "id": "gesyrie",
                    "parent_id": "t1_gesrls0",
                    "score": 53,
                    "created_utc": 1607246603.0,
                    "replies": []
                },
                {
                    "body": "“ I don’t think Deidara was inferior bc Sasuke had advantages” \n\nDo you know what inferior means?",
                    "author": "SMaxTH",
                    "id": "get1955",
                    "parent_id": "t1_gesrls0",
                    "score": 31,
                    "created_utc": 1607247932.0,
                    "replies": []
                },
                {
                    "body": "Bro why the fuck people always argue against peoples strengths due to some power gained outside of them. The MAIN CHARACTER has the KYUUBI. Madara has hashirama cells. So does obito. So did Danzo. It’s part of the series stop being so fucking dense.",
                    "author": null,
                    "id": "geyajgn",
                    "parent_id": "t1_gesrls0",
                    "score": 1,
                    "created_utc": 1607357418.0,
                    "replies": [
                        {
                            "body": "Naruto was always going to be strong though. Kurama was just a bonus.",
                            "author": "bubblez4eva",
                            "id": "gglkm2k",
                            "parent_id": "t1_geyajgn",
                            "score": 1,
                            "created_utc": 1608568674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tsunade: Art is 106cm",
            "author": "ZenXgaming100",
            "id": "get2daa",
            "parent_id": "t1_get12bz",
            "score": 57,
            "created_utc": 1607248476.0,
            "replies": []
        },
        {
            "body": "hol up",
            "author": "SmallerBork",
            "id": "gkb551m",
            "parent_id": "t1_get2grm",
            "score": 4,
            "created_utc": 1611383292.0,
            "replies": []
        },
        {
            "body": "Underrated comment",
            "author": "ChisTurtle",
            "id": "geudnza",
            "parent_id": "t1_get5zfy",
            "score": 7,
            "created_utc": 1607271254.0,
            "replies": [
                {
                    "body": "We appreciate you taking the time to flag this as an underrated comment.\n\nHowever, this appears to be in error and the comment is already rated according to its quality.",
                    "author": "RatedCommentBot",
                    "id": "geuiv0s",
                    "parent_id": "t1_geudnza",
                    "score": 4,
                    "created_utc": 1607274037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ramen Man: Art is Cutlet Pork Ramen!",
            "author": "Your1AfricanPrince",
            "id": "geu0i1s",
            "parent_id": "t1_getvwjh",
            "score": 17,
            "created_utc": 1607265028.0,
            "replies": []
        },
        {
            "body": "Tobirama : Art is suppressing Uchihas",
            "author": "koto__amatsukami",
            "id": "getnmj7",
            "parent_id": "t1_getbjsr",
            "score": 34,
            "created_utc": 1607258992.0,
            "replies": []
        },
        {
            "body": "Kiba: art is fang over fang",
            "author": "sese2003",
            "id": "getn0sh",
            "parent_id": "t1_getbjsr",
            "score": 29,
            "created_utc": 1607258707.0,
            "replies": [
                {
                    "body": "GATSUGAAA",
                    "author": "mrpatuti",
                    "id": "geujdim",
                    "parent_id": "t1_getn0sh",
                    "score": 9,
                    "created_utc": 1607274299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kakashi: Art is Icha Icha",
            "author": "claravelle-nazal",
            "id": "getvy41",
            "parent_id": "t1_getbjsr",
            "score": 12,
            "created_utc": 1607263171.0,
            "replies": []
        },
        {
            "body": "Minato: art is ridiculously long jutsu names",
            "author": null,
            "id": "geup6qk",
            "parent_id": "t1_geugit7",
            "score": 15,
            "created_utc": 1607277164.0,
            "replies": []
        },
        {
            "body": "It is when you're a child soldier!",
            "author": "thekingofbeans42",
            "id": "geudy9c",
            "parent_id": "t1_geu8nhq",
            "score": 47,
            "created_utc": 1607271406.0,
            "replies": [
                {
                    "body": "Now you’re a teen soldier 😎",
                    "author": "Pac_Zach_Attack",
                    "id": "geusv0g",
                    "parent_id": "t1_geudy9c",
                    "score": 8,
                    "created_utc": 1607278902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think people often forget how young they are in the show. It makes me more forgiving for some of their flaws. Tbh this is a anime thing in general",
            "author": "WindyCityAssasin2",
            "id": "geut0ev",
            "parent_id": "t1_geu8nhq",
            "score": 4,
            "created_utc": 1607278963.0,
            "replies": []
        },
        {
            "body": "Good bot",
            "author": "Sunny_Jinn",
            "id": "getam25",
            "parent_id": "t1_get6i5a",
            "score": 11,
            "created_utc": 1607252442.0,
            "replies": []
        },
        {
            "body": "What point do you think Kishimoto ruined him?",
            "author": "BetaBoy777",
            "id": "get23or",
            "parent_id": "t1_gesrveo",
            "score": 94,
            "created_utc": 1607248347.0,
            "replies": [
                {
                    "body": "Killing him like a fillers character lmao that was disappointing. And then putting in his aliens thing. Even tho what that represents may be deep and shit, he really did it bc Madara was too OP and he ran out of good ideas.",
                    "author": "Fuhrer-Duhrer",
                    "id": "get3bnr",
                    "parent_id": "t1_get23or",
                    "score": 206,
                    "created_utc": 1607248916.0,
                    "replies": [
                        {
                            "body": ">he really did it bc Madara was too OP and he ran out of good ideas\n\nDid Kishi say this or something because I've never understood why fans think this. Madara was too OP so he replaces him with an even stronger foe? That doesn't make sense. I didn't like the Kaguya twist but Kishi definitley didn't do it because Madara was too OP. He could've easily just wrote his defeat by having Naruto and Sasuke fight hard or seal him exactly like Kaguya.",
                            "author": "BetaBoy777",
                            "id": "get5q5p",
                            "parent_id": "t1_get3bnr",
                            "score": 127,
                            "created_utc": 1607250086.0,
                            "replies": [
                                {
                                    "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
                                    "author": "Khajiit_Joe_Biden",
                                    "id": "getkh5m",
                                    "parent_id": "t1_get5q5p",
                                    "score": 102,
                                    "created_utc": 1607257435.0,
                                    "replies": [
                                        {
                                            "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                                            "author": "UnfilteredRedditor",
                                            "id": "getths4",
                                            "parent_id": "t1_getkh5m",
                                            "score": 50,
                                            "created_utc": 1607261931.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                                                    "author": "Aivaras12398",
                                                    "id": "geu24z7",
                                                    "parent_id": "t1_getths4",
                                                    "score": 19,
                                                    "created_utc": 1607265681.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                                                    "author": "KrackerJoe",
                                                    "id": "geu9q6v",
                                                    "parent_id": "t1_getths4",
                                                    "score": 6,
                                                    "created_utc": 1607269054.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                                            "author": "Rikuskill",
                                            "id": "geud0sc",
                                            "parent_id": "t1_getkh5m",
                                            "score": 13,
                                            "created_utc": 1607270904.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                                            "author": "AGARAN24",
                                            "id": "geux8gd",
                                            "parent_id": "t1_getkh5m",
                                            "score": 4,
                                            "created_utc": 1607280730.0,
                                            "replies": [
                                                {
                                                    "body": "If people didn’t know it kills you then he would have at least 80% lol",
                                                    "author": "BetaBoy777",
                                                    "id": "gevb8tc",
                                                    "parent_id": "t1_geux8gd",
                                                    "score": 3,
                                                    "created_utc": 1607286028.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
                                    "author": "astrapes",
                                    "id": "geutwcp",
                                    "parent_id": "t1_get5q5p",
                                    "score": 4,
                                    "created_utc": 1607279347.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
                                    "author": "Fuhrer-Duhrer",
                                    "id": "get7gnr",
                                    "parent_id": "t1_get5q5p",
                                    "score": -6,
                                    "created_utc": 1607250961.0,
                                    "replies": [
                                        {
                                            "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                                            "author": "BetaBoy777",
                                            "id": "getbyuk",
                                            "parent_id": "t1_get7gnr",
                                            "score": 23,
                                            "created_utc": 1607253124.0,
                                            "replies": [
                                                {
                                                    "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                                                    "author": "Fuhrer-Duhrer",
                                                    "id": "gevek4s",
                                                    "parent_id": "t1_getbyuk",
                                                    "score": 1,
                                                    "created_utc": 1607287614.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                                            "author": "PatchyThePirate159",
                                            "id": "geupmbd",
                                            "parent_id": "t1_get7gnr",
                                            "score": 3,
                                            "created_utc": 1607277378.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Kishi actually said that",
                                    "author": "omeka_sam",
                                    "id": "gfpk9x0",
                                    "parent_id": "t1_get5q5p",
                                    "score": 1,
                                    "created_utc": 1607876312.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wouldn't Naruto and Sasuke have been able to defeat madara?",
                            "author": "Xpblast",
                            "id": "get58hs",
                            "parent_id": "t1_get3bnr",
                            "score": 18,
                            "created_utc": 1607249839.0,
                            "replies": [
                                {
                                    "body": "Only with the help of Sakura\n\n/s",
                                    "author": "SingSing19",
                                    "id": "getmvb9",
                                    "parent_id": "t1_get58hs",
                                    "score": 20,
                                    "created_utc": 1607258630.0,
                                    "replies": [
                                        {
                                            "body": "Kankuro controls Sakura to defeat Madara",
                                            "author": "Xpblast",
                                            "id": "gety3xk",
                                            "parent_id": "t1_getmvb9",
                                            "score": 24,
                                            "created_utc": 1607264045.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
                                    "author": "Fuhrer-Duhrer",
                                    "id": "get7xyw",
                                    "parent_id": "t1_get58hs",
                                    "score": 6,
                                    "created_utc": 1607251183.0,
                                    "replies": [
                                        {
                                            "body": "They could've done the entire Kaguya fight except it's against Madara",
                                            "author": "AlexRagesGames",
                                            "id": "getmusv",
                                            "parent_id": "t1_get7xyw",
                                            "score": 30,
                                            "created_utc": 1607258623.0,
                                            "replies": [
                                                {
                                                    "body": "This!",
                                                    "author": "G3mipl4fy",
                                                    "id": "geto44q",
                                                    "parent_id": "t1_getmusv",
                                                    "score": 8,
                                                    "created_utc": 1607259236.0,
                                                    "replies": [
                                                        {
                                                            "body": "Harem jutsu but its all Hashirama",
                                                            "author": "Rikuskill",
                                                            "id": "geud4o8",
                                                            "parent_id": "t1_geto44q",
                                                            "score": 27,
                                                            "created_utc": 1607270963.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You scoundrel, now I have a nosebleed",
                                                                    "author": "G3mipl4fy",
                                                                    "id": "gev0r23",
                                                                    "parent_id": "t1_geud4o8",
                                                                    "score": 4,
                                                                    "created_utc": 1607282096.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yeah I know that’s why it kinda makes no sense.",
                                                    "author": "Fuhrer-Duhrer",
                                                    "id": "geveaq9",
                                                    "parent_id": "t1_getmusv",
                                                    "score": 1,
                                                    "created_utc": 1607287492.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                                            "author": "Xpblast",
                                            "id": "getypn0",
                                            "parent_id": "t1_get7xyw",
                                            "score": 2,
                                            "created_utc": 1607264284.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
                                    "author": "Twin1Tanaka",
                                    "id": "geud464",
                                    "parent_id": "t1_get58hs",
                                    "score": 2,
                                    "created_utc": 1607270955.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I like to pretend naruto ended with the death of pain.",
                            "author": "cheese4352",
                            "id": "getwmrl",
                            "parent_id": "t1_get3bnr",
                            "score": 8,
                            "created_utc": 1607263429.0,
                            "replies": [
                                {
                                    "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
                                    "author": "BetaBoy777",
                                    "id": "getymhj",
                                    "parent_id": "t1_getwmrl",
                                    "score": 11,
                                    "created_utc": 1607264251.0,
                                    "replies": [
                                        {
                                            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                            "author": "thedizzle11",
                                            "id": "geu9ht3",
                                            "parent_id": "t1_getymhj",
                                            "score": 6,
                                            "created_utc": 1607268916.0,
                                            "replies": [
                                                {
                                                    "body": "Most of those were fillers though",
                                                    "author": "Shrenade514",
                                                    "id": "geugda3",
                                                    "parent_id": "t1_geu9ht3",
                                                    "score": 3,
                                                    "created_utc": 1607272733.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                            "author": "thedizzle11",
                                            "id": "geu9k3z",
                                            "parent_id": "t1_getymhj",
                                            "score": 1,
                                            "created_utc": 1607268955.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The thing about Madara being tricked was an epic plot twist. But Madara wasn't a good character to be tricked like that. It kinda ruined his frame, like this spark of a demigod and ability to walk through impossible like walking through a park didn't match his helplessness in having all of this taken away in a matter of a simple backstab. He should've fought. My friend said: it would be awesome if Madara tried to fight back and help Naruto and Sasuke seal the rabbit Queen. That'd really help rebuild the character.\n\nEDIT: IMO it would be way better to see (even via more fillers) him overcoming Kaguya somewhat the way Obito overcame the 10 tails. Madara was already established, with hints to his existence, a colorful backstory and this frame of being indestructible, beyond humanity and death. Just like Hashirama he was powerful enough to break control of edo tensei. All taken away with what? Black Zetsu going full Kakashi through his back. And poof, replaced with basically a new character. Don't get me wrong, I loved Kaguya. But come on. Imagine he's now in control of all Kaguya's power like: \"Look at me - I'm the chakra goddess now\".",
                    "author": "G3mipl4fy",
                    "id": "getobbu",
                    "parent_id": "t1_get23or",
                    "score": 13,
                    "created_utc": 1607259333.0,
                    "replies": []
                },
                {
                    "body": "kishimoto literally created him",
                    "author": "verifiedjay",
                    "id": "geupotp",
                    "parent_id": "t1_get23or",
                    "score": 3,
                    "created_utc": 1607277412.0,
                    "replies": []
                },
                {
                    "body": "Black Zetsu one handing him",
                    "author": "ThePsychopaths",
                    "id": "get2ydp",
                    "parent_id": "t1_get23or",
                    "score": 5,
                    "created_utc": 1607248741.0,
                    "replies": []
                },
                {
                    "body": "The hax powerups, his stupid Sasuke knockoff backstory, the fact he was reduced to a Pein wannabe.",
                    "author": "TyrionGoldenLion",
                    "id": "getvyns",
                    "parent_id": "t1_get23or",
                    "score": 3,
                    "created_utc": 1607263177.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes but he made him FEEL inferior which was the whole point to OP’s comment.",
            "author": "_whensmahvel_",
            "id": "gesyrie",
            "parent_id": "t1_gesrls0",
            "score": 53,
            "created_utc": 1607246603.0,
            "replies": []
        },
        {
            "body": "“ I don’t think Deidara was inferior bc Sasuke had advantages” \n\nDo you know what inferior means?",
            "author": "SMaxTH",
            "id": "get1955",
            "parent_id": "t1_gesrls0",
            "score": 31,
            "created_utc": 1607247932.0,
            "replies": []
        },
        {
            "body": "Bro why the fuck people always argue against peoples strengths due to some power gained outside of them. The MAIN CHARACTER has the KYUUBI. Madara has hashirama cells. So does obito. So did Danzo. It’s part of the series stop being so fucking dense.",
            "author": null,
            "id": "geyajgn",
            "parent_id": "t1_gesrls0",
            "score": 1,
            "created_utc": 1607357418.0,
            "replies": [
                {
                    "body": "Naruto was always going to be strong though. Kurama was just a bonus.",
                    "author": "bubblez4eva",
                    "id": "gglkm2k",
                    "parent_id": "t1_geyajgn",
                    "score": 1,
                    "created_utc": 1608568674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We appreciate you taking the time to flag this as an underrated comment.\n\nHowever, this appears to be in error and the comment is already rated according to its quality.",
            "author": "RatedCommentBot",
            "id": "geuiv0s",
            "parent_id": "t1_geudnza",
            "score": 4,
            "created_utc": 1607274037.0,
            "replies": []
        },
        {
            "body": "GATSUGAAA",
            "author": "mrpatuti",
            "id": "geujdim",
            "parent_id": "t1_getn0sh",
            "score": 9,
            "created_utc": 1607274299.0,
            "replies": []
        },
        {
            "body": "Now you’re a teen soldier 😎",
            "author": "Pac_Zach_Attack",
            "id": "geusv0g",
            "parent_id": "t1_geudy9c",
            "score": 8,
            "created_utc": 1607278902.0,
            "replies": []
        },
        {
            "body": "Killing him like a fillers character lmao that was disappointing. And then putting in his aliens thing. Even tho what that represents may be deep and shit, he really did it bc Madara was too OP and he ran out of good ideas.",
            "author": "Fuhrer-Duhrer",
            "id": "get3bnr",
            "parent_id": "t1_get23or",
            "score": 206,
            "created_utc": 1607248916.0,
            "replies": [
                {
                    "body": ">he really did it bc Madara was too OP and he ran out of good ideas\n\nDid Kishi say this or something because I've never understood why fans think this. Madara was too OP so he replaces him with an even stronger foe? That doesn't make sense. I didn't like the Kaguya twist but Kishi definitley didn't do it because Madara was too OP. He could've easily just wrote his defeat by having Naruto and Sasuke fight hard or seal him exactly like Kaguya.",
                    "author": "BetaBoy777",
                    "id": "get5q5p",
                    "parent_id": "t1_get3bnr",
                    "score": 127,
                    "created_utc": 1607250086.0,
                    "replies": [
                        {
                            "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
                            "author": "Khajiit_Joe_Biden",
                            "id": "getkh5m",
                            "parent_id": "t1_get5q5p",
                            "score": 102,
                            "created_utc": 1607257435.0,
                            "replies": [
                                {
                                    "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                                    "author": "UnfilteredRedditor",
                                    "id": "getths4",
                                    "parent_id": "t1_getkh5m",
                                    "score": 50,
                                    "created_utc": 1607261931.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                                            "author": "Aivaras12398",
                                            "id": "geu24z7",
                                            "parent_id": "t1_getths4",
                                            "score": 19,
                                            "created_utc": 1607265681.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                                            "author": "KrackerJoe",
                                            "id": "geu9q6v",
                                            "parent_id": "t1_getths4",
                                            "score": 6,
                                            "created_utc": 1607269054.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                                    "author": "Rikuskill",
                                    "id": "geud0sc",
                                    "parent_id": "t1_getkh5m",
                                    "score": 13,
                                    "created_utc": 1607270904.0,
                                    "replies": []
                                },
                                {
                                    "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                                    "author": "AGARAN24",
                                    "id": "geux8gd",
                                    "parent_id": "t1_getkh5m",
                                    "score": 4,
                                    "created_utc": 1607280730.0,
                                    "replies": [
                                        {
                                            "body": "If people didn’t know it kills you then he would have at least 80% lol",
                                            "author": "BetaBoy777",
                                            "id": "gevb8tc",
                                            "parent_id": "t1_geux8gd",
                                            "score": 3,
                                            "created_utc": 1607286028.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
                            "author": "astrapes",
                            "id": "geutwcp",
                            "parent_id": "t1_get5q5p",
                            "score": 4,
                            "created_utc": 1607279347.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
                            "author": "Fuhrer-Duhrer",
                            "id": "get7gnr",
                            "parent_id": "t1_get5q5p",
                            "score": -6,
                            "created_utc": 1607250961.0,
                            "replies": [
                                {
                                    "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                                    "author": "BetaBoy777",
                                    "id": "getbyuk",
                                    "parent_id": "t1_get7gnr",
                                    "score": 23,
                                    "created_utc": 1607253124.0,
                                    "replies": [
                                        {
                                            "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                                            "author": "Fuhrer-Duhrer",
                                            "id": "gevek4s",
                                            "parent_id": "t1_getbyuk",
                                            "score": 1,
                                            "created_utc": 1607287614.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                                    "author": "PatchyThePirate159",
                                    "id": "geupmbd",
                                    "parent_id": "t1_get7gnr",
                                    "score": 3,
                                    "created_utc": 1607277378.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Kishi actually said that",
                            "author": "omeka_sam",
                            "id": "gfpk9x0",
                            "parent_id": "t1_get5q5p",
                            "score": 1,
                            "created_utc": 1607876312.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wouldn't Naruto and Sasuke have been able to defeat madara?",
                    "author": "Xpblast",
                    "id": "get58hs",
                    "parent_id": "t1_get3bnr",
                    "score": 18,
                    "created_utc": 1607249839.0,
                    "replies": [
                        {
                            "body": "Only with the help of Sakura\n\n/s",
                            "author": "SingSing19",
                            "id": "getmvb9",
                            "parent_id": "t1_get58hs",
                            "score": 20,
                            "created_utc": 1607258630.0,
                            "replies": [
                                {
                                    "body": "Kankuro controls Sakura to defeat Madara",
                                    "author": "Xpblast",
                                    "id": "gety3xk",
                                    "parent_id": "t1_getmvb9",
                                    "score": 24,
                                    "created_utc": 1607264045.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
                            "author": "Fuhrer-Duhrer",
                            "id": "get7xyw",
                            "parent_id": "t1_get58hs",
                            "score": 6,
                            "created_utc": 1607251183.0,
                            "replies": [
                                {
                                    "body": "They could've done the entire Kaguya fight except it's against Madara",
                                    "author": "AlexRagesGames",
                                    "id": "getmusv",
                                    "parent_id": "t1_get7xyw",
                                    "score": 30,
                                    "created_utc": 1607258623.0,
                                    "replies": [
                                        {
                                            "body": "This!",
                                            "author": "G3mipl4fy",
                                            "id": "geto44q",
                                            "parent_id": "t1_getmusv",
                                            "score": 8,
                                            "created_utc": 1607259236.0,
                                            "replies": [
                                                {
                                                    "body": "Harem jutsu but its all Hashirama",
                                                    "author": "Rikuskill",
                                                    "id": "geud4o8",
                                                    "parent_id": "t1_geto44q",
                                                    "score": 27,
                                                    "created_utc": 1607270963.0,
                                                    "replies": [
                                                        {
                                                            "body": "You scoundrel, now I have a nosebleed",
                                                            "author": "G3mipl4fy",
                                                            "id": "gev0r23",
                                                            "parent_id": "t1_geud4o8",
                                                            "score": 4,
                                                            "created_utc": 1607282096.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yeah I know that’s why it kinda makes no sense.",
                                            "author": "Fuhrer-Duhrer",
                                            "id": "geveaq9",
                                            "parent_id": "t1_getmusv",
                                            "score": 1,
                                            "created_utc": 1607287492.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                                    "author": "Xpblast",
                                    "id": "getypn0",
                                    "parent_id": "t1_get7xyw",
                                    "score": 2,
                                    "created_utc": 1607264284.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
                            "author": "Twin1Tanaka",
                            "id": "geud464",
                            "parent_id": "t1_get58hs",
                            "score": 2,
                            "created_utc": 1607270955.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I like to pretend naruto ended with the death of pain.",
                    "author": "cheese4352",
                    "id": "getwmrl",
                    "parent_id": "t1_get3bnr",
                    "score": 8,
                    "created_utc": 1607263429.0,
                    "replies": [
                        {
                            "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
                            "author": "BetaBoy777",
                            "id": "getymhj",
                            "parent_id": "t1_getwmrl",
                            "score": 11,
                            "created_utc": 1607264251.0,
                            "replies": [
                                {
                                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                    "author": "thedizzle11",
                                    "id": "geu9ht3",
                                    "parent_id": "t1_getymhj",
                                    "score": 6,
                                    "created_utc": 1607268916.0,
                                    "replies": [
                                        {
                                            "body": "Most of those were fillers though",
                                            "author": "Shrenade514",
                                            "id": "geugda3",
                                            "parent_id": "t1_geu9ht3",
                                            "score": 3,
                                            "created_utc": 1607272733.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                                    "author": "thedizzle11",
                                    "id": "geu9k3z",
                                    "parent_id": "t1_getymhj",
                                    "score": 1,
                                    "created_utc": 1607268955.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The thing about Madara being tricked was an epic plot twist. But Madara wasn't a good character to be tricked like that. It kinda ruined his frame, like this spark of a demigod and ability to walk through impossible like walking through a park didn't match his helplessness in having all of this taken away in a matter of a simple backstab. He should've fought. My friend said: it would be awesome if Madara tried to fight back and help Naruto and Sasuke seal the rabbit Queen. That'd really help rebuild the character.\n\nEDIT: IMO it would be way better to see (even via more fillers) him overcoming Kaguya somewhat the way Obito overcame the 10 tails. Madara was already established, with hints to his existence, a colorful backstory and this frame of being indestructible, beyond humanity and death. Just like Hashirama he was powerful enough to break control of edo tensei. All taken away with what? Black Zetsu going full Kakashi through his back. And poof, replaced with basically a new character. Don't get me wrong, I loved Kaguya. But come on. Imagine he's now in control of all Kaguya's power like: \"Look at me - I'm the chakra goddess now\".",
            "author": "G3mipl4fy",
            "id": "getobbu",
            "parent_id": "t1_get23or",
            "score": 13,
            "created_utc": 1607259333.0,
            "replies": []
        },
        {
            "body": "kishimoto literally created him",
            "author": "verifiedjay",
            "id": "geupotp",
            "parent_id": "t1_get23or",
            "score": 3,
            "created_utc": 1607277412.0,
            "replies": []
        },
        {
            "body": "Black Zetsu one handing him",
            "author": "ThePsychopaths",
            "id": "get2ydp",
            "parent_id": "t1_get23or",
            "score": 5,
            "created_utc": 1607248741.0,
            "replies": []
        },
        {
            "body": "The hax powerups, his stupid Sasuke knockoff backstory, the fact he was reduced to a Pein wannabe.",
            "author": "TyrionGoldenLion",
            "id": "getvyns",
            "parent_id": "t1_get23or",
            "score": 3,
            "created_utc": 1607263177.0,
            "replies": []
        },
        {
            "body": "Naruto was always going to be strong though. Kurama was just a bonus.",
            "author": "bubblez4eva",
            "id": "gglkm2k",
            "parent_id": "t1_geyajgn",
            "score": 1,
            "created_utc": 1608568674.0,
            "replies": []
        },
        {
            "body": ">he really did it bc Madara was too OP and he ran out of good ideas\n\nDid Kishi say this or something because I've never understood why fans think this. Madara was too OP so he replaces him with an even stronger foe? That doesn't make sense. I didn't like the Kaguya twist but Kishi definitley didn't do it because Madara was too OP. He could've easily just wrote his defeat by having Naruto and Sasuke fight hard or seal him exactly like Kaguya.",
            "author": "BetaBoy777",
            "id": "get5q5p",
            "parent_id": "t1_get3bnr",
            "score": 127,
            "created_utc": 1607250086.0,
            "replies": [
                {
                    "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
                    "author": "Khajiit_Joe_Biden",
                    "id": "getkh5m",
                    "parent_id": "t1_get5q5p",
                    "score": 102,
                    "created_utc": 1607257435.0,
                    "replies": [
                        {
                            "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                            "author": "UnfilteredRedditor",
                            "id": "getths4",
                            "parent_id": "t1_getkh5m",
                            "score": 50,
                            "created_utc": 1607261931.0,
                            "replies": [
                                {
                                    "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                                    "author": "Aivaras12398",
                                    "id": "geu24z7",
                                    "parent_id": "t1_getths4",
                                    "score": 19,
                                    "created_utc": 1607265681.0,
                                    "replies": []
                                },
                                {
                                    "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                                    "author": "KrackerJoe",
                                    "id": "geu9q6v",
                                    "parent_id": "t1_getths4",
                                    "score": 6,
                                    "created_utc": 1607269054.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                            "author": "Rikuskill",
                            "id": "geud0sc",
                            "parent_id": "t1_getkh5m",
                            "score": 13,
                            "created_utc": 1607270904.0,
                            "replies": []
                        },
                        {
                            "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                            "author": "AGARAN24",
                            "id": "geux8gd",
                            "parent_id": "t1_getkh5m",
                            "score": 4,
                            "created_utc": 1607280730.0,
                            "replies": [
                                {
                                    "body": "If people didn’t know it kills you then he would have at least 80% lol",
                                    "author": "BetaBoy777",
                                    "id": "gevb8tc",
                                    "parent_id": "t1_geux8gd",
                                    "score": 3,
                                    "created_utc": 1607286028.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
                    "author": "astrapes",
                    "id": "geutwcp",
                    "parent_id": "t1_get5q5p",
                    "score": 4,
                    "created_utc": 1607279347.0,
                    "replies": []
                },
                {
                    "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
                    "author": "Fuhrer-Duhrer",
                    "id": "get7gnr",
                    "parent_id": "t1_get5q5p",
                    "score": -6,
                    "created_utc": 1607250961.0,
                    "replies": [
                        {
                            "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                            "author": "BetaBoy777",
                            "id": "getbyuk",
                            "parent_id": "t1_get7gnr",
                            "score": 23,
                            "created_utc": 1607253124.0,
                            "replies": [
                                {
                                    "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                                    "author": "Fuhrer-Duhrer",
                                    "id": "gevek4s",
                                    "parent_id": "t1_getbyuk",
                                    "score": 1,
                                    "created_utc": 1607287614.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                            "author": "PatchyThePirate159",
                            "id": "geupmbd",
                            "parent_id": "t1_get7gnr",
                            "score": 3,
                            "created_utc": 1607277378.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Kishi actually said that",
                    "author": "omeka_sam",
                    "id": "gfpk9x0",
                    "parent_id": "t1_get5q5p",
                    "score": 1,
                    "created_utc": 1607876312.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wouldn't Naruto and Sasuke have been able to defeat madara?",
            "author": "Xpblast",
            "id": "get58hs",
            "parent_id": "t1_get3bnr",
            "score": 18,
            "created_utc": 1607249839.0,
            "replies": [
                {
                    "body": "Only with the help of Sakura\n\n/s",
                    "author": "SingSing19",
                    "id": "getmvb9",
                    "parent_id": "t1_get58hs",
                    "score": 20,
                    "created_utc": 1607258630.0,
                    "replies": [
                        {
                            "body": "Kankuro controls Sakura to defeat Madara",
                            "author": "Xpblast",
                            "id": "gety3xk",
                            "parent_id": "t1_getmvb9",
                            "score": 24,
                            "created_utc": 1607264045.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
                    "author": "Fuhrer-Duhrer",
                    "id": "get7xyw",
                    "parent_id": "t1_get58hs",
                    "score": 6,
                    "created_utc": 1607251183.0,
                    "replies": [
                        {
                            "body": "They could've done the entire Kaguya fight except it's against Madara",
                            "author": "AlexRagesGames",
                            "id": "getmusv",
                            "parent_id": "t1_get7xyw",
                            "score": 30,
                            "created_utc": 1607258623.0,
                            "replies": [
                                {
                                    "body": "This!",
                                    "author": "G3mipl4fy",
                                    "id": "geto44q",
                                    "parent_id": "t1_getmusv",
                                    "score": 8,
                                    "created_utc": 1607259236.0,
                                    "replies": [
                                        {
                                            "body": "Harem jutsu but its all Hashirama",
                                            "author": "Rikuskill",
                                            "id": "geud4o8",
                                            "parent_id": "t1_geto44q",
                                            "score": 27,
                                            "created_utc": 1607270963.0,
                                            "replies": [
                                                {
                                                    "body": "You scoundrel, now I have a nosebleed",
                                                    "author": "G3mipl4fy",
                                                    "id": "gev0r23",
                                                    "parent_id": "t1_geud4o8",
                                                    "score": 4,
                                                    "created_utc": 1607282096.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah I know that’s why it kinda makes no sense.",
                                    "author": "Fuhrer-Duhrer",
                                    "id": "geveaq9",
                                    "parent_id": "t1_getmusv",
                                    "score": 1,
                                    "created_utc": 1607287492.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                            "author": "Xpblast",
                            "id": "getypn0",
                            "parent_id": "t1_get7xyw",
                            "score": 2,
                            "created_utc": 1607264284.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
                    "author": "Twin1Tanaka",
                    "id": "geud464",
                    "parent_id": "t1_get58hs",
                    "score": 2,
                    "created_utc": 1607270955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like to pretend naruto ended with the death of pain.",
            "author": "cheese4352",
            "id": "getwmrl",
            "parent_id": "t1_get3bnr",
            "score": 8,
            "created_utc": 1607263429.0,
            "replies": [
                {
                    "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
                    "author": "BetaBoy777",
                    "id": "getymhj",
                    "parent_id": "t1_getwmrl",
                    "score": 11,
                    "created_utc": 1607264251.0,
                    "replies": [
                        {
                            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                            "author": "thedizzle11",
                            "id": "geu9ht3",
                            "parent_id": "t1_getymhj",
                            "score": 6,
                            "created_utc": 1607268916.0,
                            "replies": [
                                {
                                    "body": "Most of those were fillers though",
                                    "author": "Shrenade514",
                                    "id": "geugda3",
                                    "parent_id": "t1_geu9ht3",
                                    "score": 3,
                                    "created_utc": 1607272733.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                            "author": "thedizzle11",
                            "id": "geu9k3z",
                            "parent_id": "t1_getymhj",
                            "score": 1,
                            "created_utc": 1607268955.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, honestly this. It wasn't because he was too OP. What it actually was, was he wanted to immediately top the main villain and try to write in a wild twist. \n\nThe problem was that he got too carried away with it and the Otsutsuki are just way out of left field. Kaguya was absolutely stronger and more OP, but the implementation into the story was terrible. Kishimoto should have alluded to them far earlier and a bit more intensive, so it didn't feel like some last minute surprise.\n\nI know it's also not a popular opinion, but I didn't like Madara either. He was way to contradictory. \n\n\"I must create a world without violence and suffering... but first let me kill everyone and inflict catastrophic levels of violence and suffering that the world has never seen??? All while laughing manicialy and acting like its a giant game\"",
            "author": "Khajiit_Joe_Biden",
            "id": "getkh5m",
            "parent_id": "t1_get5q5p",
            "score": 102,
            "created_utc": 1607257435.0,
            "replies": [
                {
                    "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
                    "author": "UnfilteredRedditor",
                    "id": "getths4",
                    "parent_id": "t1_getkh5m",
                    "score": 50,
                    "created_utc": 1607261931.0,
                    "replies": [
                        {
                            "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                            "author": "Aivaras12398",
                            "id": "geu24z7",
                            "parent_id": "t1_getths4",
                            "score": 19,
                            "created_utc": 1607265681.0,
                            "replies": []
                        },
                        {
                            "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                            "author": "KrackerJoe",
                            "id": "geu9q6v",
                            "parent_id": "t1_getths4",
                            "score": 6,
                            "created_utc": 1607269054.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
                    "author": "Rikuskill",
                    "id": "geud0sc",
                    "parent_id": "t1_getkh5m",
                    "score": 13,
                    "created_utc": 1607270904.0,
                    "replies": []
                },
                {
                    "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
                    "author": "AGARAN24",
                    "id": "geux8gd",
                    "parent_id": "t1_getkh5m",
                    "score": 4,
                    "created_utc": 1607280730.0,
                    "replies": [
                        {
                            "body": "If people didn’t know it kills you then he would have at least 80% lol",
                            "author": "BetaBoy777",
                            "id": "gevb8tc",
                            "parent_id": "t1_geux8gd",
                            "score": 3,
                            "created_utc": 1607286028.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah he did literally say Madara was too OP and he didn’t know what to do with him and that’s why Kaguya was added. people can downvote because they don’t like it but it’s the truth from the creators own mouth.",
            "author": "astrapes",
            "id": "geutwcp",
            "parent_id": "t1_get5q5p",
            "score": 4,
            "created_utc": 1607279347.0,
            "replies": []
        },
        {
            "body": "Yeah he said it on an interview, try to google it and maybe you’ll find it lol. And I think it’s because the fact that Madara now had BOTH Rinnegan was too much to handle, so they got him backstabbed and pulled out Kaguya, Kishimoto made the Sage of six paths tell them about that sealing jutsu and they used it to seal her. For that kind of dumb shit maybe I want Kodachi to keep doing the manga lol it’s been fire so far.",
            "author": "Fuhrer-Duhrer",
            "id": "get7gnr",
            "parent_id": "t1_get5q5p",
            "score": -6,
            "created_utc": 1607250961.0,
            "replies": [
                {
                    "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
                    "author": "BetaBoy777",
                    "id": "getbyuk",
                    "parent_id": "t1_get7gnr",
                    "score": 23,
                    "created_utc": 1607253124.0,
                    "replies": [
                        {
                            "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                            "author": "Fuhrer-Duhrer",
                            "id": "gevek4s",
                            "parent_id": "t1_getbyuk",
                            "score": 1,
                            "created_utc": 1607287614.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
                    "author": "PatchyThePirate159",
                    "id": "geupmbd",
                    "parent_id": "t1_get7gnr",
                    "score": 3,
                    "created_utc": 1607277378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kishi actually said that",
            "author": "omeka_sam",
            "id": "gfpk9x0",
            "parent_id": "t1_get5q5p",
            "score": 1,
            "created_utc": 1607876312.0,
            "replies": []
        },
        {
            "body": "Only with the help of Sakura\n\n/s",
            "author": "SingSing19",
            "id": "getmvb9",
            "parent_id": "t1_get58hs",
            "score": 20,
            "created_utc": 1607258630.0,
            "replies": [
                {
                    "body": "Kankuro controls Sakura to defeat Madara",
                    "author": "Xpblast",
                    "id": "gety3xk",
                    "parent_id": "t1_getmvb9",
                    "score": 24,
                    "created_utc": 1607264045.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, judging by the fact that Madara just got both Rinnegan at that moment, and that Kishi had to use Black Zetsu to backstab him, they wouldn’t have been able to do it..",
            "author": "Fuhrer-Duhrer",
            "id": "get7xyw",
            "parent_id": "t1_get58hs",
            "score": 6,
            "created_utc": 1607251183.0,
            "replies": [
                {
                    "body": "They could've done the entire Kaguya fight except it's against Madara",
                    "author": "AlexRagesGames",
                    "id": "getmusv",
                    "parent_id": "t1_get7xyw",
                    "score": 30,
                    "created_utc": 1607258623.0,
                    "replies": [
                        {
                            "body": "This!",
                            "author": "G3mipl4fy",
                            "id": "geto44q",
                            "parent_id": "t1_getmusv",
                            "score": 8,
                            "created_utc": 1607259236.0,
                            "replies": [
                                {
                                    "body": "Harem jutsu but its all Hashirama",
                                    "author": "Rikuskill",
                                    "id": "geud4o8",
                                    "parent_id": "t1_geto44q",
                                    "score": 27,
                                    "created_utc": 1607270963.0,
                                    "replies": [
                                        {
                                            "body": "You scoundrel, now I have a nosebleed",
                                            "author": "G3mipl4fy",
                                            "id": "gev0r23",
                                            "parent_id": "t1_geud4o8",
                                            "score": 4,
                                            "created_utc": 1607282096.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah I know that’s why it kinda makes no sense.",
                            "author": "Fuhrer-Duhrer",
                            "id": "geveaq9",
                            "parent_id": "t1_getmusv",
                            "score": 1,
                            "created_utc": 1607287492.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
                    "author": "Xpblast",
                    "id": "getypn0",
                    "parent_id": "t1_get7xyw",
                    "score": 2,
                    "created_utc": 1607264284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Only with their magic bullshit asspull powers from the sage of six paths who randomly showed up",
            "author": "Twin1Tanaka",
            "id": "geud464",
            "parent_id": "t1_get58hs",
            "score": 2,
            "created_utc": 1607270955.0,
            "replies": []
        },
        {
            "body": "Nah, Five Kage Summit and Fourth War: Countdown arcs were amazing. It was the actual war that was hit or miss.",
            "author": "BetaBoy777",
            "id": "getymhj",
            "parent_id": "t1_getwmrl",
            "score": 11,
            "created_utc": 1607264251.0,
            "replies": [
                {
                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                    "author": "thedizzle11",
                    "id": "geu9ht3",
                    "parent_id": "t1_getymhj",
                    "score": 6,
                    "created_utc": 1607268916.0,
                    "replies": [
                        {
                            "body": "Most of those were fillers though",
                            "author": "Shrenade514",
                            "id": "geugda3",
                            "parent_id": "t1_geu9ht3",
                            "score": 3,
                            "created_utc": 1607272733.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
                    "author": "thedizzle11",
                    "id": "geu9k3z",
                    "parent_id": "t1_getymhj",
                    "score": 1,
                    "created_utc": 1607268955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t even think that hinting of the Otsutsuki’s existence earlier on would’ve helped anything. Madara had so much charisma, hype, and power to back it up. Kaguya wasn’t an interesting villain at all. She seemed to just have a massive bitch fit and wanted to take all her chakra back, whatever that meant. Madara being swapped out for Kaguya was what really made the ending disappointing.",
            "author": "UnfilteredRedditor",
            "id": "getths4",
            "parent_id": "t1_getkh5m",
            "score": 50,
            "created_utc": 1607261931.0,
            "replies": [
                {
                    "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
                    "author": "Aivaras12398",
                    "id": "geu24z7",
                    "parent_id": "t1_getths4",
                    "score": 19,
                    "created_utc": 1607265681.0,
                    "replies": []
                },
                {
                    "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
                    "author": "KrackerJoe",
                    "id": "geu9q6v",
                    "parent_id": "t1_getths4",
                    "score": 6,
                    "created_utc": 1607269054.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It may not be the case, but I was reminded heavily of the Android arc in DBZ, where Toriyama was told \"Make better villains than an old guy and a fat guy.\" So he switched it to 17 and 18, to which he was told \"A couple of kids? Really?\" So he switched it to Cell, and was told \"Looks too weird\" and we ended up with Perfect Cell.\n\nBut I don't think anyone would complain about Madara being the villain. But idk, a sudden villain swap for no reason gave me those vibes.",
            "author": "Rikuskill",
            "id": "geud0sc",
            "parent_id": "t1_getkh5m",
            "score": 13,
            "created_utc": 1607270904.0,
            "replies": []
        },
        {
            "body": "I feel like in real life, if madara was real, he would have 50% of population as followers.",
            "author": "AGARAN24",
            "id": "geux8gd",
            "parent_id": "t1_getkh5m",
            "score": 4,
            "created_utc": 1607280730.0,
            "replies": [
                {
                    "body": "If people didn’t know it kills you then he would have at least 80% lol",
                    "author": "BetaBoy777",
                    "id": "gevb8tc",
                    "parent_id": "t1_geux8gd",
                    "score": 3,
                    "created_utc": 1607286028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can’t find an interview, I don’t think he ever said that. They had ways to defeat Madara, im pretty sure Kaguya was just because Kishi wanted one more DANK twist.",
            "author": "BetaBoy777",
            "id": "getbyuk",
            "parent_id": "t1_get7gnr",
            "score": 23,
            "created_utc": 1607253124.0,
            "replies": [
                {
                    "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
                    "author": "Fuhrer-Duhrer",
                    "id": "gevek4s",
                    "parent_id": "t1_getbyuk",
                    "score": 1,
                    "created_utc": 1607287614.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you put up a link? I see people say this all the time but I've never, ever seen any proof of it.",
            "author": "PatchyThePirate159",
            "id": "geupmbd",
            "parent_id": "t1_get7gnr",
            "score": 3,
            "created_utc": 1607277378.0,
            "replies": []
        },
        {
            "body": "Kankuro controls Sakura to defeat Madara",
            "author": "Xpblast",
            "id": "gety3xk",
            "parent_id": "t1_getmvb9",
            "score": 24,
            "created_utc": 1607264045.0,
            "replies": []
        },
        {
            "body": "They could've done the entire Kaguya fight except it's against Madara",
            "author": "AlexRagesGames",
            "id": "getmusv",
            "parent_id": "t1_get7xyw",
            "score": 30,
            "created_utc": 1607258623.0,
            "replies": [
                {
                    "body": "This!",
                    "author": "G3mipl4fy",
                    "id": "geto44q",
                    "parent_id": "t1_getmusv",
                    "score": 8,
                    "created_utc": 1607259236.0,
                    "replies": [
                        {
                            "body": "Harem jutsu but its all Hashirama",
                            "author": "Rikuskill",
                            "id": "geud4o8",
                            "parent_id": "t1_geto44q",
                            "score": 27,
                            "created_utc": 1607270963.0,
                            "replies": [
                                {
                                    "body": "You scoundrel, now I have a nosebleed",
                                    "author": "G3mipl4fy",
                                    "id": "gev0r23",
                                    "parent_id": "t1_geud4o8",
                                    "score": 4,
                                    "created_utc": 1607282096.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah I know that’s why it kinda makes no sense.",
                    "author": "Fuhrer-Duhrer",
                    "id": "geveaq9",
                    "parent_id": "t1_getmusv",
                    "score": 1,
                    "created_utc": 1607287492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My thought is they had already learned madaras weaknesses and how to counter his abilities",
            "author": "Xpblast",
            "id": "getypn0",
            "parent_id": "t1_get7xyw",
            "score": 2,
            "created_utc": 1607264284.0,
            "replies": []
        },
        {
            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
            "author": "thedizzle11",
            "id": "geu9ht3",
            "parent_id": "t1_getymhj",
            "score": 6,
            "created_utc": 1607268916.0,
            "replies": [
                {
                    "body": "Most of those were fillers though",
                    "author": "Shrenade514",
                    "id": "geugda3",
                    "parent_id": "t1_geu9ht3",
                    "score": 3,
                    "created_utc": 1607272733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. The war arc is fun too but kind of starts reading like fan fiction with all the random fight matchups and powers popping up.",
            "author": "thedizzle11",
            "id": "geu9k3z",
            "parent_id": "t1_getymhj",
            "score": 1,
            "created_utc": 1607268955.0,
            "replies": []
        },
        {
            "body": "Yeah, no matter how much build up the Otsutsuki's had, and even if Madara wasn't perfect, Madara was just too much hype. I think that they should've just defeated Madara, who was just like Kaguya, and had Boruto focus on the Otsutsuki's instead.",
            "author": "Aivaras12398",
            "id": "geu24z7",
            "parent_id": "t1_getths4",
            "score": 19,
            "created_utc": 1607265681.0,
            "replies": []
        },
        {
            "body": ">”She seemed to just have a massive bitch fit and wanted to take all her chakra back”\n\nCatchra\n\nFTFY",
            "author": "KrackerJoe",
            "id": "geu9q6v",
            "parent_id": "t1_getths4",
            "score": 6,
            "created_utc": 1607269054.0,
            "replies": []
        },
        {
            "body": "If people didn’t know it kills you then he would have at least 80% lol",
            "author": "BetaBoy777",
            "id": "gevb8tc",
            "parent_id": "t1_geux8gd",
            "score": 3,
            "created_utc": 1607286028.0,
            "replies": []
        },
        {
            "body": "Idk man it’s what I’ve heard. Still I wanted Madara as the final enemy, prolly Kishimoto just wanted some money and pulled out Kaguya lol",
            "author": "Fuhrer-Duhrer",
            "id": "gevek4s",
            "parent_id": "t1_getbyuk",
            "score": 1,
            "created_utc": 1607287614.0,
            "replies": []
        },
        {
            "body": "This!",
            "author": "G3mipl4fy",
            "id": "geto44q",
            "parent_id": "t1_getmusv",
            "score": 8,
            "created_utc": 1607259236.0,
            "replies": [
                {
                    "body": "Harem jutsu but its all Hashirama",
                    "author": "Rikuskill",
                    "id": "geud4o8",
                    "parent_id": "t1_geto44q",
                    "score": 27,
                    "created_utc": 1607270963.0,
                    "replies": [
                        {
                            "body": "You scoundrel, now I have a nosebleed",
                            "author": "G3mipl4fy",
                            "id": "gev0r23",
                            "parent_id": "t1_geud4o8",
                            "score": 4,
                            "created_utc": 1607282096.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I know that’s why it kinda makes no sense.",
            "author": "Fuhrer-Duhrer",
            "id": "geveaq9",
            "parent_id": "t1_getmusv",
            "score": 1,
            "created_utc": 1607287492.0,
            "replies": []
        },
        {
            "body": "Most of those were fillers though",
            "author": "Shrenade514",
            "id": "geugda3",
            "parent_id": "t1_geu9ht3",
            "score": 3,
            "created_utc": 1607272733.0,
            "replies": []
        },
        {
            "body": "Harem jutsu but its all Hashirama",
            "author": "Rikuskill",
            "id": "geud4o8",
            "parent_id": "t1_geto44q",
            "score": 27,
            "created_utc": 1607270963.0,
            "replies": [
                {
                    "body": "You scoundrel, now I have a nosebleed",
                    "author": "G3mipl4fy",
                    "id": "gev0r23",
                    "parent_id": "t1_geud4o8",
                    "score": 4,
                    "created_utc": 1607282096.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You scoundrel, now I have a nosebleed",
            "author": "G3mipl4fy",
            "id": "gev0r23",
            "parent_id": "t1_geud4o8",
            "score": 4,
            "created_utc": 1607282096.0,
            "replies": []
        }
    ]
}