{
    "title": "Dodged a bullet",
    "post_id": "f8rnxy",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f8rnxy/dodged_a_bullet/",
    "author": null,
    "body": "I just wanted to say thanks to this sub, because as a young girl who also has some issues with self esteem I can be pretty naive. Reading the different posts on here (basically everyday) has shown me all the different ways guys do try to manipulate the different situations. \n\nHere’s one that just happened. I went on a M&G with this one guy (not going to call him and SD) and then we planned on meeting after I came back from my university reading week, but when I started discussing allowance with him it was immediate red flags. First he gave me an escort-type of allowance ($XXX for 90 minutes, $XXX for 3 hours, etc). I immediately said no, because I’m NOT an escort and I asked for the allowance that I always ask for. He then said sure, but for the first 2 weeks he would give me a “reduced” PPM (less than half of what I asked for) to see if we have “chemistry”. Lol. I quickly figured out he was definitely just going to give me this low allowance and then ghost me after 2 weeks, and even if he didn’t plan on ghosting me I was not going to take the risk of that happening, or negotiate my worth. \n\nThanks to this sub I can get a pretty good picture of if a guy is planning on using me even if they SEEM really nice. I need to work on just blocking them immediately, instead of continuing to waste my time talking to them.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f8rnxy/dodged_a_bullet/",
    "score": 202,
    "upvote_ratio": 0.98,
    "created_utc": 1582553113.0,
    "num_comments": 30,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It's so nice to hear a newbie who has done her research here and actually executed the advice! Way to go! I remember a guy that also tried to say he'd only give me xxx the first time to see if he \"liked what he was paying for\" 🤮",
            "author": null,
            "id": "fin37a3",
            "parent_id": "t3_f8rnxy",
            "score": 77,
            "created_utc": 1582554655.0,
            "replies": [
                {
                    "body": "I only do SGF but there was this one guy who asked for a \"free sample\".  WTF am I?  Costco?",
                    "author": "whatshouldIdonow8907",
                    "id": "fionjr0",
                    "parent_id": "t1_fin37a3",
                    "score": 12,
                    "created_utc": 1582586738.0,
                    "replies": [
                        {
                            "body": "Costco 🤣💀💀💀",
                            "author": "LikeHoney99",
                            "id": "fiqxaaq",
                            "parent_id": "t1_fionjr0",
                            "score": 2,
                            "created_utc": 1582653290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He's broke end of story, good job picking up the red flags a LOT of players out there.",
            "author": "penthousesuites",
            "id": "fin8vtm",
            "parent_id": "t3_f8rnxy",
            "score": 12,
            "created_utc": 1582558461.0,
            "replies": []
        },
        {
            "body": "It honestly makes me so happy to hear that someone reads and actually learns. It's so exhausting to hear story after story of girls making really stupid and really preventable mistakes. And it's infuriating to hear about the guys that take advantage. I'm so glad you got away from this guy and his nonsense.",
            "author": "MASugarBaby",
            "id": "fin5h29",
            "parent_id": "t3_f8rnxy",
            "score": 27,
            "created_utc": 1582556238.0,
            "replies": [
                {
                    "body": "The supply of pretenders in the bowl is endless.  When you swim in shark infested waters, don't get angry with the sharks.\n\nSLF rules are tried and true.  I get worried when a POT has no clue and no desire to get a clue...like, her rules trump SLF rules.",
                    "author": "sdphilly",
                    "id": "fin7wck",
                    "parent_id": "t1_fin5h29",
                    "score": 3,
                    "created_utc": 1582557836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good job. When you said he wanted to pay you by the length of time that immediately screamed prostitution. I have a friend who does mandate a few reduced ppm \"chemistry\" dates, but she also makes it absolutely clear that they're strictly platonic.",
            "author": "mvastarelli",
            "id": "fin85c7",
            "parent_id": "t3_f8rnxy",
            "score": 7,
            "created_utc": 1582557995.0,
            "replies": []
        },
        {
            "body": "Tbh I would've been a little shit about the half allowance thing and told him that he's only getting half my attention and time then lol you handled that so well honey :) I get having lower self esteem, mine makes it nerve wracking to set boundaries, but you did amazing!",
            "author": "Mopsydoll",
            "id": "fin8anl",
            "parent_id": "t3_f8rnxy",
            "score": 8,
            "created_utc": 1582558089.0,
            "replies": []
        },
        {
            "body": "“chemistry”\n\n-Is the number one red flag word\n\nGood job on paying attention !",
            "author": "GSSD",
            "id": "fin2x7t",
            "parent_id": "t3_f8rnxy",
            "score": 32,
            "created_utc": 1582554459.0,
            "replies": [
                {
                    "body": "I wouldn’t say it’s a red flag itself but using it as an excuse for the arrangement not being mutually favorable is definitely a huge flag. “I get what I want but won’t give you what you want because ‘chemistry’.”",
                    "author": "Throwawaysb2020",
                    "id": "fin96zq",
                    "parent_id": "t1_fin2x7t",
                    "score": 16,
                    "created_utc": 1582558655.0,
                    "replies": []
                },
                {
                    "body": "I often hear POT SB's use the word chemistry in their profile.  I get it.  They understand that sexual intimacy is to be expected but they are not going there unless there is some of that elusive thing that women call chemistry.  They need to be wooed.  This totally makes sense to me. This is how I respond to that.    \n\n\n\"I understand.  You need to be seduced.  Me too.  Your job is to seduce me.  My job is to seduce you. Until we do that, there is no arrangement that makes sense for either of us.\"  \n\n\nBy the way, I will compensate a POT SB for a M&G, but not a whole lot.",
                    "author": "SD1957",
                    "id": "fis30x4",
                    "parent_id": "t1_fin2x7t",
                    "score": 1,
                    "created_utc": 1582676646.0,
                    "replies": []
                },
                {
                    "body": "No it's not.  Should SD's pay the first woman that is willing to go out with them?\n\nI get that for some its just physical but for most of us we need to actually feel a connection on some level (interests, ability to communicate, need, comfort..... in addition to some physical attraction...) before we commit. \n\nToo many wanna be SB's expect to get the bag they ask for no questions asked or we are flakes.  Thats why they \"can't find anyone real\".",
                    "author": "craa141",
                    "id": "fine2gc",
                    "parent_id": "t1_fin2x7t",
                    "score": -1,
                    "created_utc": 1582561650.0,
                    "replies": [
                        {
                            "body": "Do you go to a restaurant and demand to pay only 50% of the price for a meal because you’re not sure you’ll like it?  No, you pay full price and if you don’t like it, you eat elsewhere next time.",
                            "author": "oasismiki",
                            "id": "fiokc4m",
                            "parent_id": "t1_fine2gc",
                            "score": 11,
                            "created_utc": 1582584961.0,
                            "replies": [
                                {
                                    "body": "Made zero sense.",
                                    "author": "craa141",
                                    "id": "fioxsuu",
                                    "parent_id": "t1_fiokc4m",
                                    "score": -2,
                                    "created_utc": 1582593499.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But just the same, she can set her own standards too. There is a middle ground for both sides and she can experiment as can he. The most important thing I’ve realized is that everyone has needs and they should stand by that. If they want to test the waters, hopefully they can encounter someone who will agree to the price they offer.",
                            "author": "msc2zsugar",
                            "id": "finjjte",
                            "parent_id": "t1_fine2gc",
                            "score": 10,
                            "created_utc": 1582564508.0,
                            "replies": [
                                {
                                    "body": "Agree 10000% both parties need to be comfortable with all aspects, $$ time committment, connection or its not going to work.",
                                    "author": "craa141",
                                    "id": "finjosg",
                                    "parent_id": "t1_finjjte",
                                    "score": 4,
                                    "created_utc": 1582564580.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Chemistry is a red flag?",
                    "author": "ruphun",
                    "id": "fin4fu8",
                    "parent_id": "t1_fin2x7t",
                    "score": -2,
                    "created_utc": 1582555529.0,
                    "replies": [
                        {
                            "body": "> he would give me a “reduced” PPM (less than half of what I asked for) to see if we have “chemistry”\n\n \n \n Perhaps I should give the context. Of course chemistry is important,but when a guy wants a free/cheap ride first it is a scam.",
                            "author": "GSSD",
                            "id": "fin5849",
                            "parent_id": "t1_fin4fu8",
                            "score": 13,
                            "created_utc": 1582556068.0,
                            "replies": [
                                {
                                    "body": "The reduced money is the red flag",
                                    "author": "ultrasuperthrowaway",
                                    "id": "fin8lel",
                                    "parent_id": "t1_fin5849",
                                    "score": 11,
                                    "created_utc": 1582558277.0,
                                    "replies": []
                                },
                                {
                                    "body": "gotcha. makes more sense in that context.",
                                    "author": "ruphun",
                                    "id": "finjx8c",
                                    "parent_id": "t1_fin5849",
                                    "score": -1,
                                    "created_utc": 1582564693.0,
                                    "replies": [
                                        {
                                            "body": "Yep,I got lazy.",
                                            "author": "GSSD",
                                            "id": "finlnth",
                                            "parent_id": "t1_finjx8c",
                                            "score": 4,
                                            "created_utc": 1582565582.0,
                                            "replies": [
                                                {
                                                    "body": "No worries! Just wanted to clarify, that way any newbies didn’t get the wrong idea",
                                                    "author": "ruphun",
                                                    "id": "fintjzd",
                                                    "parent_id": "t1_finlnth",
                                                    "score": -1,
                                                    "created_utc": 1582569882.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "My thoughts too. I guess SD's aren't supposed to enjoy the chemistry with thier Sb's and the mindless up and down arrow drones just agree with whatever they are told. So... Chemistry bad now... Got it! /s",
                            "author": "OneMOARPlz",
                            "id": "fiq3r55",
                            "parent_id": "t1_fin4fu8",
                            "score": 0,
                            "created_utc": 1582634136.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are a fucking rockstar. You are incredibly smart girl I am so happy I read this post. Be proud of your logical thinking.",
            "author": "alicia85xxx",
            "id": "fin7r1b",
            "parent_id": "t3_f8rnxy",
            "score": 13,
            "created_utc": 1582557740.0,
            "replies": []
        },
        {
            "body": "Thanks for the feedback.  I appreciate hearing that some of the advice given here reaches the right people.  Good for you to do your homework before being scammed, or worse.  We hear way too many stories of people that have been taken advantage of and come here too late telling their story and asking for help.\n\nGood luck on your search!",
            "author": "willfromvb",
            "id": "fin5zvp",
            "parent_id": "t3_f8rnxy",
            "score": 4,
            "created_utc": 1582556592.0,
            "replies": []
        },
        {
            "body": "Hooray!  Someone who learned from listening and not the hard way ....  Congrats.  You have a SB Diploma now.",
            "author": "whatshouldIdonow8907",
            "id": "fionf3s",
            "parent_id": "t3_f8rnxy",
            "score": 2,
            "created_utc": 1582586659.0,
            "replies": []
        },
        {
            "body": "Good job in researching and doing the best thing for you",
            "author": "JokerCEO",
            "id": "fiovohz",
            "parent_id": "t3_f8rnxy",
            "score": 2,
            "created_utc": 1582592084.0,
            "replies": []
        },
        {
            "body": "The only thing that I would agree with is your naivety...  don't take advice from other SB's and definitely not from an SD either. You ever heard the phrase, \"misery loves company\"? These SB's should be ashamed of yourselves, knowing the torment that being a prostitute has caused you (and yes no matter which way you spin it, its prostitution. maybe a legal loophole, but common sense prevails), you should be advising this young girl to take a different route, not fueling the facade that this is a lavish and high class title. Reality is, these sugar daddies will never care about you if you are not giving them some form of sexual reprieve, and just the same, you don't truly care for the. OP, go live your dreams, right now you're just creating a nightmare. Don't listen to these other girls, they are simply making themselves feel better by trying to grow and normalize this phenomenon but the blind can't lead the blind. I just have one question to anyone who disagrees..... if you are an SD or an SB; and in real life you had a daughter, how would you feel about her being a Sugar Baby?  For those of you who say you don't put out sexually and think they are hustlers as a result.... you're nothing but a beggar, trying to freeload of another man's success.     \n\n&#x200B;\n\nHopefully moderator has a conscious and does't delete this comment that could help someone.",
            "author": "SB_23_",
            "id": "fk081hx",
            "parent_id": "t3_f8rnxy",
            "score": 0,
            "created_utc": 1583746343.0,
            "replies": [
                {
                    "body": "I- what?",
                    "author": null,
                    "id": "fk0j17s",
                    "parent_id": "t1_fk081hx",
                    "score": 1,
                    "created_utc": 1583758380.0,
                    "replies": []
                },
                {
                    "body": "Um...what?",
                    "author": "LikeHoney99",
                    "id": "fk30glm",
                    "parent_id": "t1_fk081hx",
                    "score": 1,
                    "created_utc": 1583813873.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I only do SGF but there was this one guy who asked for a \"free sample\".  WTF am I?  Costco?",
            "author": "whatshouldIdonow8907",
            "id": "fionjr0",
            "parent_id": "t1_fin37a3",
            "score": 12,
            "created_utc": 1582586738.0,
            "replies": [
                {
                    "body": "Costco 🤣💀💀💀",
                    "author": "LikeHoney99",
                    "id": "fiqxaaq",
                    "parent_id": "t1_fionjr0",
                    "score": 2,
                    "created_utc": 1582653290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The supply of pretenders in the bowl is endless.  When you swim in shark infested waters, don't get angry with the sharks.\n\nSLF rules are tried and true.  I get worried when a POT has no clue and no desire to get a clue...like, her rules trump SLF rules.",
            "author": "sdphilly",
            "id": "fin7wck",
            "parent_id": "t1_fin5h29",
            "score": 3,
            "created_utc": 1582557836.0,
            "replies": []
        },
        {
            "body": "I wouldn’t say it’s a red flag itself but using it as an excuse for the arrangement not being mutually favorable is definitely a huge flag. “I get what I want but won’t give you what you want because ‘chemistry’.”",
            "author": "Throwawaysb2020",
            "id": "fin96zq",
            "parent_id": "t1_fin2x7t",
            "score": 16,
            "created_utc": 1582558655.0,
            "replies": []
        },
        {
            "body": "I often hear POT SB's use the word chemistry in their profile.  I get it.  They understand that sexual intimacy is to be expected but they are not going there unless there is some of that elusive thing that women call chemistry.  They need to be wooed.  This totally makes sense to me. This is how I respond to that.    \n\n\n\"I understand.  You need to be seduced.  Me too.  Your job is to seduce me.  My job is to seduce you. Until we do that, there is no arrangement that makes sense for either of us.\"  \n\n\nBy the way, I will compensate a POT SB for a M&G, but not a whole lot.",
            "author": "SD1957",
            "id": "fis30x4",
            "parent_id": "t1_fin2x7t",
            "score": 1,
            "created_utc": 1582676646.0,
            "replies": []
        },
        {
            "body": "No it's not.  Should SD's pay the first woman that is willing to go out with them?\n\nI get that for some its just physical but for most of us we need to actually feel a connection on some level (interests, ability to communicate, need, comfort..... in addition to some physical attraction...) before we commit. \n\nToo many wanna be SB's expect to get the bag they ask for no questions asked or we are flakes.  Thats why they \"can't find anyone real\".",
            "author": "craa141",
            "id": "fine2gc",
            "parent_id": "t1_fin2x7t",
            "score": -1,
            "created_utc": 1582561650.0,
            "replies": [
                {
                    "body": "Do you go to a restaurant and demand to pay only 50% of the price for a meal because you’re not sure you’ll like it?  No, you pay full price and if you don’t like it, you eat elsewhere next time.",
                    "author": "oasismiki",
                    "id": "fiokc4m",
                    "parent_id": "t1_fine2gc",
                    "score": 11,
                    "created_utc": 1582584961.0,
                    "replies": [
                        {
                            "body": "Made zero sense.",
                            "author": "craa141",
                            "id": "fioxsuu",
                            "parent_id": "t1_fiokc4m",
                            "score": -2,
                            "created_utc": 1582593499.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But just the same, she can set her own standards too. There is a middle ground for both sides and she can experiment as can he. The most important thing I’ve realized is that everyone has needs and they should stand by that. If they want to test the waters, hopefully they can encounter someone who will agree to the price they offer.",
                    "author": "msc2zsugar",
                    "id": "finjjte",
                    "parent_id": "t1_fine2gc",
                    "score": 10,
                    "created_utc": 1582564508.0,
                    "replies": [
                        {
                            "body": "Agree 10000% both parties need to be comfortable with all aspects, $$ time committment, connection or its not going to work.",
                            "author": "craa141",
                            "id": "finjosg",
                            "parent_id": "t1_finjjte",
                            "score": 4,
                            "created_utc": 1582564580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Chemistry is a red flag?",
            "author": "ruphun",
            "id": "fin4fu8",
            "parent_id": "t1_fin2x7t",
            "score": -2,
            "created_utc": 1582555529.0,
            "replies": [
                {
                    "body": "> he would give me a “reduced” PPM (less than half of what I asked for) to see if we have “chemistry”\n\n \n \n Perhaps I should give the context. Of course chemistry is important,but when a guy wants a free/cheap ride first it is a scam.",
                    "author": "GSSD",
                    "id": "fin5849",
                    "parent_id": "t1_fin4fu8",
                    "score": 13,
                    "created_utc": 1582556068.0,
                    "replies": [
                        {
                            "body": "The reduced money is the red flag",
                            "author": "ultrasuperthrowaway",
                            "id": "fin8lel",
                            "parent_id": "t1_fin5849",
                            "score": 11,
                            "created_utc": 1582558277.0,
                            "replies": []
                        },
                        {
                            "body": "gotcha. makes more sense in that context.",
                            "author": "ruphun",
                            "id": "finjx8c",
                            "parent_id": "t1_fin5849",
                            "score": -1,
                            "created_utc": 1582564693.0,
                            "replies": [
                                {
                                    "body": "Yep,I got lazy.",
                                    "author": "GSSD",
                                    "id": "finlnth",
                                    "parent_id": "t1_finjx8c",
                                    "score": 4,
                                    "created_utc": 1582565582.0,
                                    "replies": [
                                        {
                                            "body": "No worries! Just wanted to clarify, that way any newbies didn’t get the wrong idea",
                                            "author": "ruphun",
                                            "id": "fintjzd",
                                            "parent_id": "t1_finlnth",
                                            "score": -1,
                                            "created_utc": 1582569882.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "My thoughts too. I guess SD's aren't supposed to enjoy the chemistry with thier Sb's and the mindless up and down arrow drones just agree with whatever they are told. So... Chemistry bad now... Got it! /s",
                    "author": "OneMOARPlz",
                    "id": "fiq3r55",
                    "parent_id": "t1_fin4fu8",
                    "score": 0,
                    "created_utc": 1582634136.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I- what?",
            "author": null,
            "id": "fk0j17s",
            "parent_id": "t1_fk081hx",
            "score": 1,
            "created_utc": 1583758380.0,
            "replies": []
        },
        {
            "body": "Um...what?",
            "author": "LikeHoney99",
            "id": "fk30glm",
            "parent_id": "t1_fk081hx",
            "score": 1,
            "created_utc": 1583813873.0,
            "replies": []
        },
        {
            "body": "Costco 🤣💀💀💀",
            "author": "LikeHoney99",
            "id": "fiqxaaq",
            "parent_id": "t1_fionjr0",
            "score": 2,
            "created_utc": 1582653290.0,
            "replies": []
        },
        {
            "body": "Do you go to a restaurant and demand to pay only 50% of the price for a meal because you’re not sure you’ll like it?  No, you pay full price and if you don’t like it, you eat elsewhere next time.",
            "author": "oasismiki",
            "id": "fiokc4m",
            "parent_id": "t1_fine2gc",
            "score": 11,
            "created_utc": 1582584961.0,
            "replies": [
                {
                    "body": "Made zero sense.",
                    "author": "craa141",
                    "id": "fioxsuu",
                    "parent_id": "t1_fiokc4m",
                    "score": -2,
                    "created_utc": 1582593499.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But just the same, she can set her own standards too. There is a middle ground for both sides and she can experiment as can he. The most important thing I’ve realized is that everyone has needs and they should stand by that. If they want to test the waters, hopefully they can encounter someone who will agree to the price they offer.",
            "author": "msc2zsugar",
            "id": "finjjte",
            "parent_id": "t1_fine2gc",
            "score": 10,
            "created_utc": 1582564508.0,
            "replies": [
                {
                    "body": "Agree 10000% both parties need to be comfortable with all aspects, $$ time committment, connection or its not going to work.",
                    "author": "craa141",
                    "id": "finjosg",
                    "parent_id": "t1_finjjte",
                    "score": 4,
                    "created_utc": 1582564580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> he would give me a “reduced” PPM (less than half of what I asked for) to see if we have “chemistry”\n\n \n \n Perhaps I should give the context. Of course chemistry is important,but when a guy wants a free/cheap ride first it is a scam.",
            "author": "GSSD",
            "id": "fin5849",
            "parent_id": "t1_fin4fu8",
            "score": 13,
            "created_utc": 1582556068.0,
            "replies": [
                {
                    "body": "The reduced money is the red flag",
                    "author": "ultrasuperthrowaway",
                    "id": "fin8lel",
                    "parent_id": "t1_fin5849",
                    "score": 11,
                    "created_utc": 1582558277.0,
                    "replies": []
                },
                {
                    "body": "gotcha. makes more sense in that context.",
                    "author": "ruphun",
                    "id": "finjx8c",
                    "parent_id": "t1_fin5849",
                    "score": -1,
                    "created_utc": 1582564693.0,
                    "replies": [
                        {
                            "body": "Yep,I got lazy.",
                            "author": "GSSD",
                            "id": "finlnth",
                            "parent_id": "t1_finjx8c",
                            "score": 4,
                            "created_utc": 1582565582.0,
                            "replies": [
                                {
                                    "body": "No worries! Just wanted to clarify, that way any newbies didn’t get the wrong idea",
                                    "author": "ruphun",
                                    "id": "fintjzd",
                                    "parent_id": "t1_finlnth",
                                    "score": -1,
                                    "created_utc": 1582569882.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thoughts too. I guess SD's aren't supposed to enjoy the chemistry with thier Sb's and the mindless up and down arrow drones just agree with whatever they are told. So... Chemistry bad now... Got it! /s",
            "author": "OneMOARPlz",
            "id": "fiq3r55",
            "parent_id": "t1_fin4fu8",
            "score": 0,
            "created_utc": 1582634136.0,
            "replies": []
        },
        {
            "body": "Made zero sense.",
            "author": "craa141",
            "id": "fioxsuu",
            "parent_id": "t1_fiokc4m",
            "score": -2,
            "created_utc": 1582593499.0,
            "replies": []
        },
        {
            "body": "Agree 10000% both parties need to be comfortable with all aspects, $$ time committment, connection or its not going to work.",
            "author": "craa141",
            "id": "finjosg",
            "parent_id": "t1_finjjte",
            "score": 4,
            "created_utc": 1582564580.0,
            "replies": []
        },
        {
            "body": "The reduced money is the red flag",
            "author": "ultrasuperthrowaway",
            "id": "fin8lel",
            "parent_id": "t1_fin5849",
            "score": 11,
            "created_utc": 1582558277.0,
            "replies": []
        },
        {
            "body": "gotcha. makes more sense in that context.",
            "author": "ruphun",
            "id": "finjx8c",
            "parent_id": "t1_fin5849",
            "score": -1,
            "created_utc": 1582564693.0,
            "replies": [
                {
                    "body": "Yep,I got lazy.",
                    "author": "GSSD",
                    "id": "finlnth",
                    "parent_id": "t1_finjx8c",
                    "score": 4,
                    "created_utc": 1582565582.0,
                    "replies": [
                        {
                            "body": "No worries! Just wanted to clarify, that way any newbies didn’t get the wrong idea",
                            "author": "ruphun",
                            "id": "fintjzd",
                            "parent_id": "t1_finlnth",
                            "score": -1,
                            "created_utc": 1582569882.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep,I got lazy.",
            "author": "GSSD",
            "id": "finlnth",
            "parent_id": "t1_finjx8c",
            "score": 4,
            "created_utc": 1582565582.0,
            "replies": [
                {
                    "body": "No worries! Just wanted to clarify, that way any newbies didn’t get the wrong idea",
                    "author": "ruphun",
                    "id": "fintjzd",
                    "parent_id": "t1_finlnth",
                    "score": -1,
                    "created_utc": 1582569882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No worries! Just wanted to clarify, that way any newbies didn’t get the wrong idea",
            "author": "ruphun",
            "id": "fintjzd",
            "parent_id": "t1_finlnth",
            "score": -1,
            "created_utc": 1582569882.0,
            "replies": []
        }
    ]
}