{
    "title": "Discretion Advised",
    "post_id": "c2n56y",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/c2n56y/discretion_advised/",
    "author": "jiena-telaqi",
    "body": "I've added the \"Seeking Advice\" flair, not so much to apply to my exact situation, but because I would really like to know what others think/have experienced. \n\n&#x200B;\n\nI'm in the early-to-mid stages of getting settled in a new place, and have a couple of email threads and text conversations with POT SDs currently going. One seemed initially promising---clever, articulate, all the rest. He made a point of asking for \"discretion\" and I am fine with those precautions. I am not looking to upset anyone's life, and I'm definitely not going to get preachy, that's not where my complaint lies. There's not just the scamming side of sugar; as a young woman generally and as a rape survivor personally, I am always aware of what kind of danger might be waiting for me.\n\n&#x200B;\n\nHe was adamant that a public M&G on the other side of the city, and even in the next city over, was too much risk. He offered that I could *get into his car* in the parking lot of a coffee shop, and then said things would be better if he could come straight to my home---again, *as a M&G*. I said flatly that I wasn't going to put my wellbeing at jeopardy. Over and over, he used the word \"discretion.\"  I closed the conversation by emphasizing that, as a young woman, I wouldn't go anywhere without brief public appearances first, and moreover, that I had every intention of sharing the make/model/plate of any vehicle we travelled in with my best friend (The One Hour Check In system. If I don't text her back/reply with a series of old inside jokes, she calls. If I don't answer, she knows something's wrong). It's not about outing whatever naughtiness my SD might be up to, or purposefully and maliciously damaging his reputation or career. It's about my safety. \n\n&#x200B;\n\nHe asked that I \"accommodate this privacy.\" Please accommodate my desire to not be murdered.\n\n&#x200B;\n\n/endrant",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/c2n56y/discretion_advised/",
    "score": 98,
    "upvote_ratio": 0.96,
    "created_utc": 1560980568.0,
    "num_comments": 28,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Ya you made the right call, total red flag. \n\nAs a SD who also values discretion, I would never invite a POT into my car for a M&G, nevermind any of that other crap.\n\nThere's always somewhere you can go to meet and chat, I don't care who or what you are.",
            "author": null,
            "id": "erl8cc1",
            "parent_id": "t3_c2n56y",
            "score": 55,
            "created_utc": 1560980716.0,
            "replies": []
        },
        {
            "body": "This is red flags all over it. You live in a city not a small town I assume so there is no good reason he can’t find somewhere that you won’t run into anyone he knows to sit for 20 minutes and talk. \n\nThe fact that he invited himself over to your house is indicative that he’s either meaning you harm or THE most dense out of touch man on the internet. If he’s too scared to be in public for a few minutes he’ll probably end up flaking on you at some point anyway.\n\nDefinitely do not compromise your safety for this person.",
            "author": "rideamercedez",
            "id": "erl9ctb",
            "parent_id": "t3_c2n56y",
            "score": 31,
            "created_utc": 1560981407.0,
            "replies": []
        },
        {
            "body": "I guess serial killers need a lot of discretion.",
            "author": "TastySpermDispenser",
            "id": "erlem83",
            "parent_id": "t3_c2n56y",
            "score": 20,
            "created_utc": 1560985151.0,
            "replies": []
        },
        {
            "body": "I can’t tell you how many messages I get on reddit asking where I live. I’ve actually posted in the subs of a random major city to throw off any scent they may somehow pick up (this is all another account). I just got a message from a guy saying ‘hey do you also live in X city?’ And I replied ‘give me your social security number and I’ll give you my address’ cmon we ain’t dumb",
            "author": "thehoppiest",
            "id": "erlegkd",
            "parent_id": "t3_c2n56y",
            "score": 8,
            "created_utc": 1560985036.0,
            "replies": [
                {
                    "body": "Off topic but I love your username. I imagine you hopping around the house instead of walking. And these aren't any ordinary hops. They are the hoppiest.",
                    "author": "slfalt",
                    "id": "erlf7k0",
                    "parent_id": "t1_erlegkd",
                    "score": 8,
                    "created_utc": 1560985589.0,
                    "replies": [
                        {
                            "body": "Haha thank you! It’s actually in reference to my favorite type of beer :)",
                            "author": "thehoppiest",
                            "id": "erm7scm",
                            "parent_id": "t1_erlf7k0",
                            "score": 3,
                            "created_utc": 1561009398.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hey do you live in X city ?",
                    "author": "Ttimewellspent",
                    "id": "erlyqnn",
                    "parent_id": "t1_erlegkd",
                    "score": 1,
                    "created_utc": 1561000604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No,  there is nobody too high profile that they can’t chat up a pretty young lady in a coffee shop without it turning into a big issues.   Things are only weird if you make them weird.",
            "author": "LotBuilder",
            "id": "erlktvx",
            "parent_id": "t3_c2n56y",
            "score": 9,
            "created_utc": 1560989874.0,
            "replies": []
        },
        {
            "body": "This is a no brainer.  You made the right call.  \n\nOne thing to think about, and I'll tell it as a true story.  When I first started in the bowl, sometimes SBs would say or propose things that didn't work for me.  I would engage them anyway, although looking back at it, I'm not sure why.  To talk them out of it?  To convince them they're wrong?  To convince them I'm a good guy?  In any case, I started to notice a pattern: when certain types of statements appeared (e.g.,\"I require $X to attend a M&G\" \"I know my worth\") no matter what I said in response, they never changed their mind.  Instead, the conversation ended with me frustrated, irritated, and often having been insulted by them.  In short, once someone says something that is wildly out-of-sync with me, engaging further with them just made my day worse.  And it never got me anywhere -- I literally NEVER talked a \"I require $X to attend a M&G\" POT to drop this requirement.  So, what I do is, as soon as I see this, I wish them good luck and say goodbye, and that's that.  I can't tell you how much more I enjoy my time on SA, it's one of the best decisions I've made.  And it fits into my life philosophy in general -- if you can avoid it, don't interact at all with toxic people.\n\nYou see where I'm going.  You followed this one down the rabbit hole, but next time, as soon as someone suggests getting into his car at the coffee shop, no need to do anything but say goodbye and block him.  I can nearly guarantee you, someone who thinks this is appropriate is not going to come around and see things your way.  There is literally nothing to be gained by engaging further; and dropping them on the spot both feels empowering, and avoid the irritation to come if you actually try to argue with them.",
            "author": "Azurecole",
            "id": "erla0lt",
            "parent_id": "t3_c2n56y",
            "score": 19,
            "created_utc": 1560981865.0,
            "replies": [
                {
                    "body": "Yeah, I emphasized WHY I was saying no, and when he tried to continue talking to me, I said, \"I think we'd best politely part ways.\" He tried to good morning me again today; I blocked his number.",
                    "author": "jiena-telaqi",
                    "id": "erlaaap",
                    "parent_id": "t1_erla0lt",
                    "score": 10,
                    "created_utc": 1560982052.0,
                    "replies": []
                },
                {
                    "body": "This is excellent advice— useful in all parts of life. Akin to the [meme] (https://imgur.com/a/jaKEoY0)  of the man asking the guru—what is the secret of a happy life? “To not argue with fools,” says the guru. “I disagree,” says the man. The guru replies “you’re right!”",
                    "author": "10WiseWords",
                    "id": "erm7oig",
                    "parent_id": "t1_erla0lt",
                    "score": 3,
                    "created_utc": 1561009276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just no.  No man truly worried about discretion is finding women on the internet.   This goes to the whole weird SA anonymous nonsense.",
            "author": "FlexEconGuy",
            "id": "erlnzuj",
            "parent_id": "t3_c2n56y",
            "score": 4,
            "created_utc": 1560992302.0,
            "replies": []
        },
        {
            "body": "I'm a fan of discretion, but not secrecy. I think secrecy is unsafe, for both me and her. Now I don't have a wife in the picture, so I have less to worry about than some other guys. But I use Venmo, not cash, because I want to know the legal name of the woman I am with. (And, frankly, I want authorities to trace and find a real bank account if things go horribly wrong.) She gets the same thing -- knowledge of my real name, ability to subpoena me, and so on.\n\nThe more normal things are, the less likely bullshit will happen.\n\nAlso, OP, I don't think you needed to talk to him over and over. He sounds eminently blockable.",
            "author": "slfalt",
            "id": "erlezwe",
            "parent_id": "t3_c2n56y",
            "score": 12,
            "created_utc": 1560985430.0,
            "replies": [
                {
                    "body": "You don't have to give Venmo a legal name at all",
                    "author": "CrimsonLemur",
                    "id": "erm242a",
                    "parent_id": "t1_erlezwe",
                    "score": 5,
                    "created_utc": 1561003543.0,
                    "replies": [
                        {
                            "body": "100% true. Venmo and Cash app you can use fictitious names.\n\nZelle & Apple Pay will give you real names.",
                            "author": "ruphun",
                            "id": "ermju8p",
                            "parent_id": "t1_erm242a",
                            "score": 3,
                            "created_utc": 1561026519.0,
                            "replies": []
                        },
                        {
                            "body": "There is no such thing as anonymity on the internet, especially when financial transactions are concerned. Could she create a situation where I don't know her name in the short term? Sure. But if the police get involved -- or even just a private investigator -- the anonymity is gone. And the same goes the other direction. She is guaranteed a way to find me if I assault her and disappear.\n\nThat paragraph was pretty dark. The point is, part of the reason it has never gotten bad for me, is because I only date women who are comfortable with non-anonymity. Just like vanilla, but with a sugary twist.",
                            "author": "slfalt",
                            "id": "ermjed9",
                            "parent_id": "t1_erm242a",
                            "score": 1,
                            "created_utc": 1561025879.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i feel you on a thousand levels!!!!!!!",
            "author": null,
            "id": "erlhbkp",
            "parent_id": "t3_c2n56y",
            "score": 4,
            "created_utc": 1560987177.0,
            "replies": []
        },
        {
            "body": "No, no, no, no , no! You were smart to trust your gut. If he can't respect your need for safety, he's not worth anything he's offering.\nStay safe, all you Babes!",
            "author": null,
            "id": "erlyxrv",
            "parent_id": "t3_c2n56y",
            "score": 4,
            "created_utc": 1561000765.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erla0qu",
            "parent_id": "t3_c2n56y",
            "score": 6,
            "created_utc": 1560981868.0,
            "replies": [
                {
                    "body": "He’s probably looking for a lot worse.",
                    "author": null,
                    "id": "erle78k",
                    "parent_id": "t1_erla0qu",
                    "score": 15,
                    "created_utc": 1560984847.0,
                    "replies": []
                },
                {
                    "body": "those were my thoughts too. But I dont even think he's looking for an escort or he would take her to a hotel. He is looking straight up for a street walker, someone who will do car dates.",
                    "author": "ruphun",
                    "id": "ermjwql",
                    "parent_id": "t1_erla0qu",
                    "score": 2,
                    "created_utc": 1561026617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bullet Dodged™",
            "author": "RJFlorida",
            "id": "erlvr7j",
            "parent_id": "t3_c2n56y",
            "score": 3,
            "created_utc": 1560998175.0,
            "replies": []
        },
        {
            "body": "\"I'm a writer for Law and Order: SVU. You just avoided becoming the topic of our next episode.\"",
            "author": null,
            "id": "ermf3dr",
            "parent_id": "t3_c2n56y",
            "score": 3,
            "created_utc": 1561019180.0,
            "replies": []
        },
        {
            "body": "I get it for a guy who has a lot to lose(married,high profile) nowhere seems safe to him. But it is unacceptable for a SB to meet in provate for the first time. He either has to get his Starbucks on or pass on a SB.",
            "author": "GSSD",
            "id": "ermulih",
            "parent_id": "t3_c2n56y",
            "score": 3,
            "created_utc": 1561037499.0,
            "replies": []
        },
        {
            "body": "As a SB and also rape survivor, I completely get where your coming from and honestly I shut the ones down not willing to meet me out in public the first time. I 100% get discretion and if they are a public figure, I might make a certain exception. However I’d NEVER host at my home, I’ve heard over and over never never never bring your SD home. Like ever. Unless he is paying for a place that’s in your name. That’s the only exception. I had a POT come at me with the same exact line-discretion discretion discretion....and we can either meet at his place or mine for a FIRST meet. You have got to be crazy lol. No WAY am I putting myself in that position and no one else should either. I’d never get in a car with a POT either. Now, my current SD I’ve gotten in the car with and gone back to his house (a beautiful home right on the inter coastal) after we got to know each other. But I first met him for lunch at a public place and he has every reason to not want to be seen in public with me as well(he is married). Point is, he totally got the need for safety first and was willing to compromise. We met somewhere that he is confident he wouldn’t see anyone he knew. Girl it makes you wonder what they ARE up to when they come at you like that. I have a great SD and just met my POT second and it’s gone great so far, so I’m not completely jaded but the two ‘good ones’ I have found is after dozens of creeps and weirdos offering me $100 and demanding sexual intimacy the minute we meet-in Private. ARE YOU KIDDING. My first thought is....if your looking for a cheap hooker there’s plenty of places for that....stay off the SD and even the WYP sites because that’s NOT what it’s about. Well, I see it this way. They do YOU a favor. They show their true colors before even meeting so you don’t waste your time with a potential horrible situation to boot. Girl I totally feel you lol",
            "author": "Blondematrix8",
            "id": "erlzm9f",
            "parent_id": "t3_c2n56y",
            "score": 5,
            "created_utc": 1561001338.0,
            "replies": [
                {
                    "body": "My previous SD would regularly drive me places--even just for errands--and more than once he left breakfast or coffee on my porch for me (Thank you, James Bond!) But that was after we'd been seeing each other *for months*, and we knew each other's legal names and workplaces. \n\n&#x200B;\n\nI get so frustrated when I see some of the messages in my inbox, or when I read the profiles of some of these men. They want a sex worker and they're not brave or self aware enough to say that out loud. Also, this guy said that he and his wife \"are separated but live together\" and I was like... that just means you haven't told her to want a divorce.",
                    "author": "jiena-telaqi",
                    "id": "ermw38d",
                    "parent_id": "t1_erlzm9f",
                    "score": 3,
                    "created_utc": 1561038636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fuck that guy. Like seriously if this is what he requires, then as the SD that's his fucking problem to solve. Hire a restaurant for a night for a private event.  Pay for POT's transportation to and from some distant city where he feels safe to meet.\n\nThis is such a classic splenda daddy ask. As the SD, if you have special needs the onus is on you to solve them! FFS",
            "author": null,
            "id": "erm12x7",
            "parent_id": "t3_c2n56y",
            "score": 4,
            "created_utc": 1561002609.0,
            "replies": []
        },
        {
            "body": " Block....",
            "author": "Claudio1948",
            "id": "ermvi03",
            "parent_id": "t3_c2n56y",
            "score": 1,
            "created_utc": 1561038196.0,
            "replies": []
        },
        {
            "body": "two people both with elevated security concerns\n\nsuggest keeping it online for a while Facebook or Skype",
            "author": "doctorcoolpop",
            "id": "erlh1rp",
            "parent_id": "t3_c2n56y",
            "score": -1,
            "created_utc": 1560986972.0,
            "replies": []
        },
        {
            "body": "Off topic but I love your username. I imagine you hopping around the house instead of walking. And these aren't any ordinary hops. They are the hoppiest.",
            "author": "slfalt",
            "id": "erlf7k0",
            "parent_id": "t1_erlegkd",
            "score": 8,
            "created_utc": 1560985589.0,
            "replies": [
                {
                    "body": "Haha thank you! It’s actually in reference to my favorite type of beer :)",
                    "author": "thehoppiest",
                    "id": "erm7scm",
                    "parent_id": "t1_erlf7k0",
                    "score": 3,
                    "created_utc": 1561009398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey do you live in X city ?",
            "author": "Ttimewellspent",
            "id": "erlyqnn",
            "parent_id": "t1_erlegkd",
            "score": 1,
            "created_utc": 1561000604.0,
            "replies": []
        },
        {
            "body": "Yeah, I emphasized WHY I was saying no, and when he tried to continue talking to me, I said, \"I think we'd best politely part ways.\" He tried to good morning me again today; I blocked his number.",
            "author": "jiena-telaqi",
            "id": "erlaaap",
            "parent_id": "t1_erla0lt",
            "score": 10,
            "created_utc": 1560982052.0,
            "replies": []
        },
        {
            "body": "This is excellent advice— useful in all parts of life. Akin to the [meme] (https://imgur.com/a/jaKEoY0)  of the man asking the guru—what is the secret of a happy life? “To not argue with fools,” says the guru. “I disagree,” says the man. The guru replies “you’re right!”",
            "author": "10WiseWords",
            "id": "erm7oig",
            "parent_id": "t1_erla0lt",
            "score": 3,
            "created_utc": 1561009276.0,
            "replies": []
        },
        {
            "body": "You don't have to give Venmo a legal name at all",
            "author": "CrimsonLemur",
            "id": "erm242a",
            "parent_id": "t1_erlezwe",
            "score": 5,
            "created_utc": 1561003543.0,
            "replies": [
                {
                    "body": "100% true. Venmo and Cash app you can use fictitious names.\n\nZelle & Apple Pay will give you real names.",
                    "author": "ruphun",
                    "id": "ermju8p",
                    "parent_id": "t1_erm242a",
                    "score": 3,
                    "created_utc": 1561026519.0,
                    "replies": []
                },
                {
                    "body": "There is no such thing as anonymity on the internet, especially when financial transactions are concerned. Could she create a situation where I don't know her name in the short term? Sure. But if the police get involved -- or even just a private investigator -- the anonymity is gone. And the same goes the other direction. She is guaranteed a way to find me if I assault her and disappear.\n\nThat paragraph was pretty dark. The point is, part of the reason it has never gotten bad for me, is because I only date women who are comfortable with non-anonymity. Just like vanilla, but with a sugary twist.",
                    "author": "slfalt",
                    "id": "ermjed9",
                    "parent_id": "t1_erm242a",
                    "score": 1,
                    "created_utc": 1561025879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s probably looking for a lot worse.",
            "author": null,
            "id": "erle78k",
            "parent_id": "t1_erla0qu",
            "score": 15,
            "created_utc": 1560984847.0,
            "replies": []
        },
        {
            "body": "those were my thoughts too. But I dont even think he's looking for an escort or he would take her to a hotel. He is looking straight up for a street walker, someone who will do car dates.",
            "author": "ruphun",
            "id": "ermjwql",
            "parent_id": "t1_erla0qu",
            "score": 2,
            "created_utc": 1561026617.0,
            "replies": []
        },
        {
            "body": "My previous SD would regularly drive me places--even just for errands--and more than once he left breakfast or coffee on my porch for me (Thank you, James Bond!) But that was after we'd been seeing each other *for months*, and we knew each other's legal names and workplaces. \n\n&#x200B;\n\nI get so frustrated when I see some of the messages in my inbox, or when I read the profiles of some of these men. They want a sex worker and they're not brave or self aware enough to say that out loud. Also, this guy said that he and his wife \"are separated but live together\" and I was like... that just means you haven't told her to want a divorce.",
            "author": "jiena-telaqi",
            "id": "ermw38d",
            "parent_id": "t1_erlzm9f",
            "score": 3,
            "created_utc": 1561038636.0,
            "replies": []
        },
        {
            "body": "Haha thank you! It’s actually in reference to my favorite type of beer :)",
            "author": "thehoppiest",
            "id": "erm7scm",
            "parent_id": "t1_erlf7k0",
            "score": 3,
            "created_utc": 1561009398.0,
            "replies": []
        },
        {
            "body": "100% true. Venmo and Cash app you can use fictitious names.\n\nZelle & Apple Pay will give you real names.",
            "author": "ruphun",
            "id": "ermju8p",
            "parent_id": "t1_erm242a",
            "score": 3,
            "created_utc": 1561026519.0,
            "replies": []
        },
        {
            "body": "There is no such thing as anonymity on the internet, especially when financial transactions are concerned. Could she create a situation where I don't know her name in the short term? Sure. But if the police get involved -- or even just a private investigator -- the anonymity is gone. And the same goes the other direction. She is guaranteed a way to find me if I assault her and disappear.\n\nThat paragraph was pretty dark. The point is, part of the reason it has never gotten bad for me, is because I only date women who are comfortable with non-anonymity. Just like vanilla, but with a sugary twist.",
            "author": "slfalt",
            "id": "ermjed9",
            "parent_id": "t1_erm242a",
            "score": 1,
            "created_utc": 1561025879.0,
            "replies": []
        }
    ]
}