{
    "title": "A Sugar Baby saying “I don’t want anything sexual”, is like a Sugar Daddy saying “I don’t want anything Financial”",
    "post_id": "11ifvdn",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11ifvdn/a_sugar_baby_saying_i_dont_want_anything_sexual/",
    "author": "Canadian_SD",
    "body": "True or False?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/11ifvdn/a_sugar_baby_saying_i_dont_want_anything_sexual/",
    "score": 288,
    "upvote_ratio": 0.91,
    "created_utc": 1677970235.0,
    "num_comments": 158,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "either generally makes one undatable",
            "author": "LazyRainySunday",
            "id": "jayifil",
            "parent_id": "t3_11ifvdn",
            "score": 32,
            "created_utc": 1677979645.0,
            "replies": []
        },
        {
            "body": "Largely true.",
            "author": "FLRAdvocate",
            "id": "jaxyy3l",
            "parent_id": "t3_11ifvdn",
            "score": 87,
            "created_utc": 1677970433.0,
            "replies": [
                {
                    "body": "it might be true from a standpoint of all things being equal, but one is coming from a place of being manipulative and other is just freaking extremely misguided and naive because she has been mislead by social media and other blogs.",
                    "author": "NickPfromYuma",
                    "id": "jaxz8jl",
                    "parent_id": "t1_jaxyy3l",
                    "score": 27,
                    "created_utc": 1677970565.0,
                    "replies": [
                        {
                            "body": "Are you suggesting there are two sides to the \"I don't want anything sexual\" coin or that the SD would be manipulative while the SB is misguided and naïve?  The SD could just want to vanilla date; where is the fault?\n\nI just wish they'd both stay off seeking.",
                            "author": "Beginning_Pear_2231",
                            "id": "jayl8mv",
                            "parent_id": "t1_jaxz8jl",
                            "score": 14,
                            "created_utc": 1677981058.0,
                            "replies": [
                                {
                                    "body": "But Nick is correct.  If you consider that they want to swap sex with no sex, what would you swap money?  No money?  Sex can be enjoyable for both people, but you give money .... Is that enjoyable?  It is a win win for them to not want sex.  Plenty of girls volunteer to be taken out to eat for free and you don't need to be on seeking for that.",
                                    "author": "bthdk85",
                                    "id": "jayny9f",
                                    "parent_id": "t1_jayl8mv",
                                    "score": 8,
                                    "created_utc": 1677982429.0,
                                    "replies": [
                                        {
                                            "body": "Swap money with no money.  Vanilla dates.  Yes.  It is not manipulative for a man to ask a woman out for a non-financial date.  Not what I want to see on seeking, sure.\n\nSBs can manipulate.  SDs can be misguided and naive.\n\nThe suggestion appears to be that the SD will always be the creeper and the SB will always be the innocent.",
                                            "author": "Beginning_Pear_2231",
                                            "id": "jayopem",
                                            "parent_id": "t1_jayny9f",
                                            "score": 10,
                                            "created_utc": 1677982809.0,
                                            "replies": [
                                                {
                                                    "body": "Then you should go on a normal dating website if that's what you want or go creat simping.com \n\nIn one breath you called SD can be manipulative and SB can be naive, then on the same breath being ok with that.  It is a creeper for SD to demand sugar then what do you call SB who is not holding to their end? A gold digger?",
                                                    "author": "bthdk85",
                                                    "id": "jayp7rg",
                                                    "parent_id": "t1_jayopem",
                                                    "score": 0,
                                                    "created_utc": 1677983061.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
                                                            "author": "Beginning_Pear_2231",
                                                            "id": "jayq5o0",
                                                            "parent_id": "t1_jayp7rg",
                                                            "score": 7,
                                                            "created_utc": 1677983526.0,
                                                            "replies": [
                                                                {
                                                                    "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                                                                    "author": "Snoo71180",
                                                                    "id": "jb0e0ol",
                                                                    "parent_id": "t1_jayq5o0",
                                                                    "score": 3,
                                                                    "created_utc": 1678024396.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                                                                    "author": "Glum_Self7991",
                                                                    "id": "jbuz6gu",
                                                                    "parent_id": "t1_jayq5o0",
                                                                    "score": 1,
                                                                    "created_utc": 1678574572.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I genuinely want to be a sugar daddy but more so for a bdsm stuff than a financial investment. Only cause I’m not financially ready. You are suggesting that women would respect that and give me a chance because it isn’t a transactional relationship. Money doesn’t mean sex so I still have a chance. Is that right?!?!?",
                            "author": "nanashi9372",
                            "id": "jb2rfxo",
                            "parent_id": "t1_jaxz8jl",
                            "score": 2,
                            "created_utc": 1678061150.0,
                            "replies": []
                        },
                        {
                            "body": "Well, I didn't assign any context to my answer (and the OP didn't offer any), so it was \"assuming all things being equal.\"",
                            "author": "FLRAdvocate",
                            "id": "jaxzg8y",
                            "parent_id": "t1_jaxz8jl",
                            "score": 2,
                            "created_utc": 1677970662.0,
                            "replies": []
                        },
                        {
                            "body": "This! 🤞🏾",
                            "author": "lirababyxoxo",
                            "id": "jbnnhi1",
                            "parent_id": "t1_jaxz8jl",
                            "score": 1,
                            "created_utc": 1678442295.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pretty darn close to True. \n\n  There are some SD's out there that just want a platonic situation . But not many.   \n\nThere are NO SB's out there that want a situation where they are not getting any money .",
            "author": "15Warrior15",
            "id": "jaybir1",
            "parent_id": "t3_11ifvdn",
            "score": 36,
            "created_utc": 1677976245.0,
            "replies": [
                {
                    "body": "There are SBs who are there for lifestyle augmentation vs income. I’d say 5 percent of them. They are usually older and not easy to find. They have high standards when it comes to SD looks and status. The only hitch there is they can be risky down the road and demand a ring.",
                    "author": null,
                    "id": "jb1356r",
                    "parent_id": "t1_jaybir1",
                    "score": 9,
                    "created_utc": 1678035979.0,
                    "replies": []
                },
                {
                    "body": "True. I can be wrong in my thinking but the entire crux of this “sugar lifestyle” revolves around money for a relationshipy service, be it sexual or platonic. Yes it puts one entity at a disadvantage in terms of having to spend money, but again it’s the money that makes them able to pay for relationshipy things withiut the relationshipy stress in a way",
                    "author": "AdBudget3520",
                    "id": "jayd0at",
                    "parent_id": "t1_jaybir1",
                    "score": 8,
                    "created_utc": 1677976942.0,
                    "replies": []
                },
                {
                    "body": "I'm not sure. In my SR I am not entirely sure who is using who for sex. I think the allowance is largely secondary to SGF in all honesty.",
                    "author": "C12H22O11-EU",
                    "id": "jb118hw",
                    "parent_id": "t1_jaybir1",
                    "score": 2,
                    "created_utc": 1678035207.0,
                    "replies": [
                        {
                            "body": "It's never \"using\" if you're in an arrangement that you both are happy with.",
                            "author": "JustAsk4Alice",
                            "id": "jb1pr36",
                            "parent_id": "t1_jb118hw",
                            "score": 3,
                            "created_utc": 1678044931.0,
                            "replies": [
                                {
                                    "body": "Oh my GOODness! Thank you!!!",
                                    "author": "TheEbonyFemmeFatale",
                                    "id": "jc15pyd",
                                    "parent_id": "t1_jb1pr36",
                                    "score": 3,
                                    "created_utc": 1678694203.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wait……. Have you ever actually been in the sugar bowl? We have seen many examples of SB who said they didn’t want money. Especially in the past few years as seeking has turned into a traditional dating site and you have to agree to no PPM.\n\nI would argue that an SD who wants platonic is rarer than a SB who doesn’t want money.",
                    "author": "UnearthlyDinosaur",
                    "id": "jayesjn",
                    "parent_id": "t1_jaybir1",
                    "score": 6,
                    "created_utc": 1677977816.0,
                    "replies": [
                        {
                            "body": "If they don't want money, what classifies them as a SB?",
                            "author": "matthewjphillips",
                            "id": "jazch5k",
                            "parent_id": "t1_jayesjn",
                            "score": 5,
                            "created_utc": 1677995901.0,
                            "replies": [
                                {
                                    "body": "I think they’re referring to experience- or travel-oriented sugar babies, who want those things rather than money.",
                                    "author": "olivinemultichrome",
                                    "id": "jazgyr9",
                                    "parent_id": "t1_jazch5k",
                                    "score": 6,
                                    "created_utc": 1677998963.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I met a girl on seeking who ended up buying me things",
                    "author": "HighOnGoofballs",
                    "id": "jb020ce",
                    "parent_id": "t1_jaybir1",
                    "score": 1,
                    "created_utc": 1678016400.0,
                    "replies": [
                        {
                            "body": "Then u were the SB :-)",
                            "author": "Quinteman",
                            "id": "jb0lb26",
                            "parent_id": "t1_jb020ce",
                            "score": 7,
                            "created_utc": 1678028075.0,
                            "replies": [
                                {
                                    "body": "I’m totally ok with that",
                                    "author": "HighOnGoofballs",
                                    "id": "jb0m1ms",
                                    "parent_id": "t1_jb0lb26",
                                    "score": 3,
                                    "created_utc": 1678028420.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "There is such a thing as outliers",
                            "author": "nanashi9372",
                            "id": "jb2rtbj",
                            "parent_id": "t1_jb020ce",
                            "score": 3,
                            "created_utc": 1678061324.0,
                            "replies": []
                        },
                        {
                            "body": "Well good, it means she liked you too and/or it may be her way of expressing her love language.\nThis is what I do.\nI'm always listening, and whenever I'm out and about, my mind will usually revolve around \"what can I find, for those I love, who will appreciate it sincerely.\n\nI give very specific and unique gifts...so to me, it's a way of expressing my care for the other person.",
                            "author": "JustAsk4Alice",
                            "id": "jb1pk26",
                            "parent_id": "t1_jb020ce",
                            "score": 2,
                            "created_utc": 1678044852.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Somehow the nothing in return myth has gained a lot of steam and it’s confusing as to how we got here.",
            "author": "CyberDxne",
            "id": "jayf03j",
            "parent_id": "t3_11ifvdn",
            "score": 22,
            "created_utc": 1677977921.0,
            "replies": [
                {
                    "body": "My favorite one is when SBs say “I’ve been scammed before, so I’m not going to meet unless you send me money online”\n\nSomehow they have a risk of getting scammed by meeting for coffee/drink at a public place 🤦‍♂️ but SDs are supposed to send them money along with their first message 🤷‍♂️",
                    "author": "geekxp",
                    "id": "jayqbf8",
                    "parent_id": "t1_jayf03j",
                    "score": 14,
                    "created_utc": 1677983606.0,
                    "replies": [
                        {
                            "body": "So move on.\nThose are OBVIOUSLY the ones that you DONT want to date, bc you dont like the initial set up, so just skip those profiles and look for someone/something genuine.  Believe it or not, there's ppl on there still, who want a real relationship, they are just tired of having to wade through all the sewage to find that someone.",
                            "author": "JustAsk4Alice",
                            "id": "jb1qe88",
                            "parent_id": "t1_jayqbf8",
                            "score": 0,
                            "created_utc": 1678045201.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was an SB who was in multiple no-sex relationships for extended periods. It might be relatively rare but it does happen, it is not a myth. There are older people out there looking for a specific kind of companionship to display to friends, coworkers, etc and they get more out of the perception that other people have of them than they do anything else. \n\nA lot of people automatically boil sugaring down to sex and only sex. Even the SDs/Ms I've had sexual relationships with I actually liked and respected as people, not cash cows. \n\nI get that for a lot of people sugaring has turned into more straightforward give money, get sex but all the relationships I was in, sexual or non, did not have that kind of overt transactional feeling. These were real people that I spent a lot of time with and actually cared about or else I would not have wasted my time and theirs.",
                    "author": "dezeiram",
                    "id": "jazh4wy",
                    "parent_id": "t1_jayf03j",
                    "score": 16,
                    "created_utc": 1677999090.0,
                    "replies": [
                        {
                            "body": "I *wish* I could find a relationship like that. I'm asexual & queer, and between that and my disabilities I've been effectively single for years. I miss the non-sexual closeness of relationships.",
                            "author": "WinterLily86",
                            "id": "jbxpo4q",
                            "parent_id": "t1_jazh4wy",
                            "score": 2,
                            "created_utc": 1678633985.0,
                            "replies": []
                        },
                        {
                            "body": "To your second paragraph, absolutely! I hate it! \n\nSometimes, there’s just more than sex to sugar relationships.",
                            "author": "TheEbonyFemmeFatale",
                            "id": "jc165ga",
                            "parent_id": "t1_jazh4wy",
                            "score": 1,
                            "created_utc": 1678694579.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "A whole lot of Simps on OF claiming they are sugar daddies",
                    "author": "West_Texas_Daddy",
                    "id": "jayl1mm",
                    "parent_id": "t1_jayf03j",
                    "score": 9,
                    "created_utc": 1677980961.0,
                    "replies": [
                        {
                            "body": "Yes, girls told me how guys just send them things from wish list for nothing.  Simps ruin everything.",
                            "author": "bthdk85",
                            "id": "jayo1uq",
                            "parent_id": "t1_jayl1mm",
                            "score": 5,
                            "created_utc": 1677982480.0,
                            "replies": [
                                {
                                    "body": "A fan sending an OnlyFans girl a vibrator doesn’t pay her bills.",
                                    "author": "DumbleSD",
                                    "id": "jayp1fc",
                                    "parent_id": "t1_jayo1uq",
                                    "score": 12,
                                    "created_utc": 1677982973.0,
                                    "replies": [
                                        {
                                            "body": "Why don't you buy her a Tesla? That doesn't pay the bill so it doesn't count. Or buy her a house.  It doesn't pay the bill so it doesn't count.",
                                            "author": "bthdk85",
                                            "id": "jaypc99",
                                            "parent_id": "t1_jayp1fc",
                                            "score": 0,
                                            "created_utc": 1677983124.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not buying an OnlyFans girl a coffee at Panera, because I’m not interested in that, but,again, a couple of losers in their basements buying her low value items has zero to do with sugar.",
                                                    "author": "DumbleSD",
                                                    "id": "jayw9l7",
                                                    "parent_id": "t1_jaypc99",
                                                    "score": 5,
                                                    "created_utc": 1677986658.0,
                                                    "replies": [
                                                        {
                                                            "body": "[removed]",
                                                            "author": null,
                                                            "id": "jaywkj7",
                                                            "parent_id": "t1_jayw9l7",
                                                            "score": -2,
                                                            "created_utc": 1677986818.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                                                                    "author": "Intrepid_Egg_7722",
                                                                    "id": "jaz165w",
                                                                    "parent_id": "t1_jaywkj7",
                                                                    "score": 3,
                                                                    "created_utc": 1677989283.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                                                                    "author": "DumbleSD",
                                                                    "id": "jaz0njq",
                                                                    "parent_id": "t1_jaywkj7",
                                                                    "score": 2,
                                                                    "created_utc": 1677989007.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Not every man is thirsty and too horny for his own good on this sites. Some good men like treating their ladies and get rewarded unlike y’all",
                                    "author": "Nefarious_evee",
                                    "id": "jb19vj2",
                                    "parent_id": "t1_jayo1uq",
                                    "score": 3,
                                    "created_utc": 1678038636.0,
                                    "replies": []
                                },
                                {
                                    "body": "🤣🤣🤣🤣\nOh yes....damn those Simps for sending gifts to chicks that they are interested in.\n\nIt just means YOU actually have to put some work and a little  bit of effort, to get that same level of attn.",
                                    "author": "JustAsk4Alice",
                                    "id": "jb1t8nv",
                                    "parent_id": "t1_jayo1uq",
                                    "score": 2,
                                    "created_utc": 1678046386.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Is it really nothing in return though? I feel like there are situations where it could still be beneficial for both people",
                    "author": "beckiem9",
                    "id": "jcj5ni3",
                    "parent_id": "t1_jayf03j",
                    "score": 1,
                    "created_utc": 1679030417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just because you can point to one or two examples out of a sea of thousands doesn’t mean you can negate the hypothesis. \n\nThe ones who either don’t want intimacy or financial care are a blip in the data - \n\nPeople win the lottery every day - does that mean most people will do so too?\n\nBut also : Just. Move. On. \n\nSo many complaints here when the fix is scroll past. Move on to the next. Find someone who is aligned with your wants and you fit theirs.",
            "author": "thereadinessisall",
            "id": "jaysit1",
            "parent_id": "t3_11ifvdn",
            "score": 12,
            "created_utc": 1677984723.0,
            "replies": [
                {
                    "body": "This is a solid take.",
                    "author": "TK-663",
                    "id": "jazur43",
                    "parent_id": "t1_jaysit1",
                    "score": 1,
                    "created_utc": 1678010168.0,
                    "replies": []
                },
                {
                    "body": "^^^THIS\n\nStop wasting time and energy on ppl who aren't making you their priority.",
                    "author": "JustAsk4Alice",
                    "id": "jb1yf89",
                    "parent_id": "t1_jaysit1",
                    "score": 1,
                    "created_utc": 1678048561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "FALSE\n\nA sugar baby can't say \"I don't want anything sexual\" because by definition, she is no longer a sugar babe. Just as a Sugar Daddy can't say \"I don't want anything financial\" because, by definition, he is no longer a sugar daddy once he says that.",
            "author": "C12H22O11-EU",
            "id": "jb113zd",
            "parent_id": "t3_11ifvdn",
            "score": 3,
            "created_utc": 1678035155.0,
            "replies": [
                {
                    "body": "I disagree with your second comment about SD. By definition a sugar daddy is an older man that spoils a younger woman with gifts shopping and/or experiences. The Financial aspect is not part of every arrangement or relationship. while in the modern sugar bowl must relationships do include allowances, that’s not to say all still do",
                    "author": "NickPfromYuma",
                    "id": "jb1ei98",
                    "parent_id": "t1_jb113zd",
                    "score": 0,
                    "created_utc": 1678040405.0,
                    "replies": [
                        {
                            "body": ">a sugar daddy is an older man that spoils a younger woman with gifts shopping and/or experiences\n\nGifting and experiences are still financial.",
                            "author": "C12H22O11-EU",
                            "id": "jb49nqm",
                            "parent_id": "t1_jb1ei98",
                            "score": 5,
                            "created_utc": 1678093094.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "True. And it’s about time it’s recognized as such.",
            "author": "YourSugarFather",
            "id": "jb0fg54",
            "parent_id": "t3_11ifvdn",
            "score": 3,
            "created_utc": 1678025174.0,
            "replies": []
        },
        {
            "body": "There are men that will agree to pay for platonic relationship.",
            "author": "BruddaMSK",
            "id": "jazluw3",
            "parent_id": "t3_11ifvdn",
            "score": 11,
            "created_utc": 1678002730.0,
            "replies": [
                {
                    "body": "And there are unicorns, right?",
                    "author": "ingallsd",
                    "id": "jb1bocl",
                    "parent_id": "t1_jazluw3",
                    "score": 3,
                    "created_utc": 1678039336.0,
                    "replies": [
                        {
                            "body": "In the SB....FUCK YES THERE ARE!",
                            "author": "JustAsk4Alice",
                            "id": "jb1tl3x",
                            "parent_id": "t1_jb1bocl",
                            "score": 1,
                            "created_utc": 1678046531.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely true",
            "author": "EuropeanDaddyDom",
            "id": "jayawvt",
            "parent_id": "t3_11ifvdn",
            "score": 7,
            "created_utc": 1677975956.0,
            "replies": []
        },
        {
            "body": "False. \n\nThere are Babies who just want company or mentorship and I have had an SB (I am a female, btw) who wanted to keep his Sexual Chastity as part of a Mormon thing he got goin on.",
            "author": "SugarBabeSeeksLuv",
            "id": "jazbif0",
            "parent_id": "t3_11ifvdn",
            "score": 7,
            "created_utc": 1677995349.0,
            "replies": [
                {
                    "body": "Wow",
                    "author": "heycarlos1969",
                    "id": "jb26h2b",
                    "parent_id": "t1_jazbif0",
                    "score": 3,
                    "created_utc": 1678051886.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Does it really matter?  Just next and move on!",
            "author": "NoBagelNoBagel1",
            "id": "jayz4q0",
            "parent_id": "t3_11ifvdn",
            "score": 3,
            "created_utc": 1677988180.0,
            "replies": []
        },
        {
            "body": "In my line of work, I witnessed SR relationships that didn’t involve sex LONG before I ever knew SRs existed.\n\nIt mostly happens with much older gentlemen (sometimes with middle aged gentlemen), but it absolutely does happen. I’ve had SDs that didn’t want anything sexual and mainly wanted someone who could provide a certain level of attention/type of conversation. I can’t tell you how much of a relief it was to finally not feel obligated to be ready for sex or fake ready whenever they were. It really felt like escort work, sometimes, and that’s not what I wanted, so I started to maneuver differently.\n\nSugar Dating is much like Vanilla Dating in the sense that you keep trying until you get someone who’s on the same page with you.",
            "author": "TheEbonyFemmeFatale",
            "id": "jazxklf",
            "parent_id": "t3_11ifvdn",
            "score": 3,
            "created_utc": 1678012634.0,
            "replies": [
                {
                    "body": ">I can’t tell you how much of a relief it was to finally not feel obligated to be ready for sex or fake ready whenever they were.\n\nUgh... I'm sorry for you dating guys you didn't really want sexually or having too different sex drive :(( That sounds like awful SR!",
                    "author": "SeekingInSydney",
                    "id": "jb1s1dq",
                    "parent_id": "t1_jazxklf",
                    "score": 1,
                    "created_utc": 1678045889.0,
                    "replies": [
                        {
                            "body": "I appreciate your sentiment! I was definitely sexually attracted to them, and we generally shared the same sex drive, but every now and then, I’d just prefer quality time minus sex because I actually liked them. The issue was the expectation of sex every time we met because of me receiving gifts and money. Like, we can’t just watch a couple of movies or cook dinner together.\n\nIf this expectation had been explained to me when discussing the arrangement, I could’ve realized we aren’t compatible and suggested that we not waste each other’s time.\n\nI was young and new and without much guidance, so I wasn’t aware of how things can be (I hadn’t done much vanilla dating back then, either lol), and honestly, I wasn’t good at standing up for myself. Error on my part.\n\nAll in all, I had my lessons learned, and I’m a better and more knowledgeable person for it.\n\nAgain, I deeply appreciate your sentiment!",
                            "author": "TheEbonyFemmeFatale",
                            "id": "jb2f49g",
                            "parent_id": "t1_jb1s1dq",
                            "score": 3,
                            "created_utc": 1678055593.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Platonic does absolutely nothing for me. It's a damn scam 🤦‍♂️",
            "author": "Difficult-Machine380",
            "id": "jb0swth",
            "parent_id": "t3_11ifvdn",
            "score": 3,
            "created_utc": 1678031475.0,
            "replies": []
        },
        {
            "body": "An SB who says they do not want a sexual relationship is not really an SB per the definitions we use here for the terms. \n\nA Sugar Baby wants to have an adult relationship with someone who is older, more experienced, more financially successful, and wants to share in that financial success.\n\nA Sugar Daddy is someone who wants to share their financial successes, their knowledge, and even their contacts, with someone with whom they will have an intimate personal relationship. \n\nIt does not 100% have to be sexual - but I would say it is 95%++ likely to involve sexuality of some kind at some point.    \nOtherwise it is Paid Companionship - which is perfectly fine - it is simply not a Sugar Relationship.  \n\nApples are fine - and they are not oranges.",
            "author": "sd424242",
            "id": "jb2wsoo",
            "parent_id": "t3_11ifvdn",
            "score": 3,
            "created_utc": 1678063715.0,
            "replies": []
        },
        {
            "body": "Yes, but what if the SD sends pics and videos of money?",
            "author": "Taurinimi",
            "id": "jaz87z1",
            "parent_id": "t3_11ifvdn",
            "score": 5,
            "created_utc": 1677993357.0,
            "replies": [
                {
                    "body": "Lolz",
                    "author": "ankurtyagi2007",
                    "id": "jduc8wj",
                    "parent_id": "t1_jaz87z1",
                    "score": 1,
                    "created_utc": 1679900318.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True\n\nThe problem is that sugar daddies are shamed for wanting sex while sugar babies are not shamed for wanting money.\n\nBut I feel like if salty people can end up scamming each other then that’s a good thing, it’s the market self correcting.",
            "author": "UnearthlyDinosaur",
            "id": "jaxzbpi",
            "parent_id": "t3_11ifvdn",
            "score": 15,
            "created_utc": 1677970604.0,
            "replies": [
                {
                    "body": "Let's not make this a man vs woman thing-- there is plenty of shame directed at both groups",
                    "author": "HarvardLawSB",
                    "id": "jaxznpt",
                    "parent_id": "t1_jaxzbpi",
                    "score": 14,
                    "created_utc": 1677970758.0,
                    "replies": [
                        {
                            "body": "> Let's not make this a man vs woman thing-\n\nDoes the very subject of the post not already do that to a degree?",
                            "author": "FLRAdvocate",
                            "id": "jay06xo",
                            "parent_id": "t1_jaxznpt",
                            "score": 5,
                            "created_utc": 1677971007.0,
                            "replies": [
                                {
                                    "body": "Yeah. That’s why I didn’t answer the question. But the “problem” isn’t that one group is shamed while the other isn’t. It’s that anyone thinks that shaming is the answer.",
                                    "author": "HarvardLawSB",
                                    "id": "jay0d8b",
                                    "parent_id": "t1_jay06xo",
                                    "score": 12,
                                    "created_utc": 1677971087.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">while sugar babies are not shamed for wanting money.\n\nHere's the link to what I think is the last time you made this ridiculous comment: \n\n[https://www.reddit.com/r/sugarlifestyleforum/comments/10w13yi/hey\\_ladies\\_you\\_need\\_to\\_start\\_calling\\_out\\_bad/](https://www.reddit.com/r/sugarlifestyleforum/comments/10w13yi/hey_ladies_you_need_to_start_calling_out_bad/)\n\n(that link also includes the link to the prior time you made the same ridiculous comment). \n\n&#x200B;\n\nSince this wasn't even a month ago, hopefully you won't again play that \"oh those comments were so long ago\" absurdness.\n\nHere's the link and comments I posted in that thread. Hopefully you'll eventually get tired of posting obvious untrue bullshit and just drop this canard:\n\n&#x200B;\n\nFrom this weekend (most recent one I could find, a lot of them get deleted once the mocking starts):  \n[https://www.reddit.com/r/sugarlifestyleforum/comments/10tp9ai/new\\_sb/](https://www.reddit.com/r/sugarlifestyleforum/comments/10tp9ai/new_sb/)\n\nResponses:  \nBeing a sugar baby = being a friend and LOVER with financial perksDon't wait to find something platonic , maybe get a second job ?  \nGotta love this generation. “I don’t want to do anything, I just want money.”  \nCouldn't have put it better .Like for real ?? Getting paid for what really ??  \nI get a kick out of the ants I see from 18 to 22-year-old saying that they want to mentor their sugar daddy. Wtf  \n“I give really good advice” lol",
                    "author": "NoLimitLexa",
                    "id": "jay16gj",
                    "parent_id": "t1_jaxzbpi",
                    "score": 5,
                    "created_utc": 1677971457.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I slightly disagree.... \n\nA SB saying that has been blinded naively by Social Media, and Blogs that tells lies about platonic SB, that juggle multiple platonic SD and make 20k per month.\n\nA SD saying that is being manipulative, or he's just not a SD, and is an older guy looking to vanilla date.",
            "author": "NickPfromYuma",
            "id": "jaxyzl5",
            "parent_id": "t3_11ifvdn",
            "score": 19,
            "created_utc": 1677970452.0,
            "replies": [
                {
                    "body": "Good post, was going to say same. \n\nMaybe the result of the two scenarios is ultimately similar, but intent matters and naive is not nearly as bad as intentionally manipulative imo",
                    "author": "NoLimitLexa",
                    "id": "jaxzfv5",
                    "parent_id": "t1_jaxyzl5",
                    "score": 11,
                    "created_utc": 1677970657.0,
                    "replies": [
                        {
                            "body": "Well, I think SA's marketing is now creating SDs who aren't intentionally manipulative. The marketing makes it seem like it's just vanilla dating with benefits, but no explicit allowance or PPM. They're advertising a Gifts and Experiences type of dating experience, so it's not going to be long until some of this marketing works on men who don't know SA's past and they come to the site looking for women who want to go out on fancy dates / trips for intimacy...\n\nBut yes, there are still lots of SDs who know about arrangements that still play dumb and try to scam/rinse, which is unfortunate! There's also girls on the other side of this who promise intimacy and don't hold up their end of the deal when they get their allowance. 😕\n\nTWSD",
                            "author": "3WaySD",
                            "id": "jay3iqr",
                            "parent_id": "t1_jaxzfv5",
                            "score": 6,
                            "created_utc": 1677972533.0,
                            "replies": []
                        },
                        {
                            "body": ">Good post, was going to say same.\n\nThanks!\n\n&#x200B;\n\n>Maybe the result of the two scenarios is ultimately similar, but intent matters and naive is not nearly as bad as intentionally manipulative imo\n\nTrue. all things being equal, they have the same context. But digging deeper, the intent is usually different. I've had conversations with so-called platonic SB, some of them so naively believe that all real SR are platonic and that any guy that wants sex and is offering an allowance is looking for a prostitute. Unless thats some type of negging manipulation used by some, it seems to be universally believed by many women that sugar is some type of charity / sponsorship / mentor BS.",
                            "author": "NickPfromYuma",
                            "id": "jay0y6l",
                            "parent_id": "t1_jaxzfv5",
                            "score": 4,
                            "created_utc": 1677971353.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "how is it manipulative if he is being transparent with his intentions?",
                    "author": "TheStoicbrother",
                    "id": "jaymwew",
                    "parent_id": "t1_jaxyzl5",
                    "score": 3,
                    "created_utc": 1677981898.0,
                    "replies": []
                },
                {
                    "body": "We don’t know that all platonic SB are that way because of social media. Some are just scammers by nature.",
                    "author": "UnearthlyDinosaur",
                    "id": "jay06kq",
                    "parent_id": "t1_jaxyzl5",
                    "score": 9,
                    "created_utc": 1677971002.0,
                    "replies": [
                        {
                            "body": "> Some are just scammers by nature.\n\ntrue, but scammers usually imply theres to be intimacy. Unless you're talking about online only scammers.",
                            "author": "NickPfromYuma",
                            "id": "jay0iek",
                            "parent_id": "t1_jay06kq",
                            "score": 10,
                            "created_utc": 1677971152.0,
                            "replies": []
                        },
                        {
                            "body": "I know back when I told my best friend I thought I might do this she send me a ton of videos on how to delay intimacy and manipulate the guy for money. Essentially milking out as much as possible. Has to really question for a while if my own best friend knew me if she thought I could be so fake to someone. \n\nEspecially since these videos were all saying drop them if you couldn’t get anymore without intimacy because they were using it like a carrot on a stick",
                            "author": "ArcadiaFey",
                            "id": "jb08u1c",
                            "parent_id": "t1_jay06kq",
                            "score": 2,
                            "created_utc": 1678021315.0,
                            "replies": [
                                {
                                    "body": "Sex only benefits the Man in these relationships so it’s not a bad idea to make sure you get your needs meet first before letting everyone POT pump & dump you!",
                                    "author": "Nefarious_evee",
                                    "id": "jb1aamj",
                                    "parent_id": "t1_jb08u1c",
                                    "score": 0,
                                    "created_utc": 1678038803.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Both are fools.",
            "author": "marcopoloman",
            "id": "jazopke",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678005069.0,
            "replies": []
        },
        {
            "body": "I would say mostly true. As a human man, I do take care of my friends and acquaintances, but my spend would be tens of dollars as opposed to hundreds of dollars. That is what I would say is fair considering she still spent the time to dress herself up and take the time to meet.",
            "author": "jfgw2",
            "id": "jb0xah1",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678033491.0,
            "replies": []
        },
        {
            "body": "When I see \"Platonic only\" or \"I don’t want anything sexual\" in a Seeking profile, I message, \"Why do people looking for platonic relationships post profiles on SA?\"  What created this naiveté?",
            "author": "ingallsd",
            "id": "jb1b3vg",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678039118.0,
            "replies": [
                {
                    "body": "Because asexual people exist and we can get lonely too?",
                    "author": "WinterLily86",
                    "id": "jbxq20h",
                    "parent_id": "t1_jb1b3vg",
                    "score": 2,
                    "created_utc": 1678634159.0,
                    "replies": [
                        {
                            "body": "And daddy is afinancial - perfect.",
                            "author": "Dry-Hat7524",
                            "id": "jbxvvrr",
                            "parent_id": "t1_jbxq20h",
                            "score": 1,
                            "created_utc": 1678636671.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Iv heard a lot of men say I dnt want transactional. And get upset when u tell them they are looking for the wrong thing 😂😂😂",
            "author": "LunaLotus25",
            "id": "jb1bwn1",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678039423.0,
            "replies": []
        },
        {
            "body": "Just send me the Money , damn you know you love being humiliated you old fart that will be 10,000 us dollars $fyrsage thanks you wrinkled up old skin bag",
            "author": "AdditionalRoyal2112",
            "id": "jb1ohih",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678044405.0,
            "replies": []
        },
        {
            "body": "Everyone wants something different in the bowl, can we stop policing people and telling them how to run their relationships?",
            "author": "GlitterAndSugar",
            "id": "jb2fvwi",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678055930.0,
            "replies": []
        },
        {
            "body": "Different strokes for different folks!",
            "author": "VIPSUITE",
            "id": "jb2wu3l",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678063735.0,
            "replies": []
        },
        {
            "body": "So true. I hate it when SB’s think that the guys are out there working their tail off just so we can hand it all over for the opportunity to deal with your bad attitude.",
            "author": "Glum_Self7991",
            "id": "jbuytwm",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1678574412.0,
            "replies": []
        },
        {
            "body": "To me it's more like a sd saying \"I don't have any money at all\".",
            "author": "VomitOnSweater",
            "id": "jay8poy",
            "parent_id": "t3_11ifvdn",
            "score": 4,
            "created_utc": 1677974929.0,
            "replies": []
        },
        {
            "body": "Half the guys on seeking arrangements do say that tho",
            "author": "heroinebride",
            "id": "jayfvjn",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1677978360.0,
            "replies": [
                {
                    "body": "exactly 😂😭",
                    "author": "exotica3333",
                    "id": "jayhs0b",
                    "parent_id": "t1_jayfvjn",
                    "score": 2,
                    "created_utc": 1677979316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One hundred emoji 💯\n\n\n😬😬😬",
            "author": "disco_doll_",
            "id": "jazb4k0",
            "parent_id": "t3_11ifvdn",
            "score": 2,
            "created_utc": 1677995107.0,
            "replies": []
        },
        {
            "body": "True",
            "author": "SW1981",
            "id": "jay273y",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1677971924.0,
            "replies": []
        },
        {
            "body": "FACTS. Next them tricks.",
            "author": null,
            "id": "jaz8ypi",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1677993796.0,
            "replies": []
        },
        {
            "body": "Largely false. Some sugar daddies just prefer intimate dates over sex or to fulfill their weird fetishes.",
            "author": "exotica3333",
            "id": "jayhpwl",
            "parent_id": "t3_11ifvdn",
            "score": -2,
            "created_utc": 1677979287.0,
            "replies": [
                {
                    "body": "Found the rinser",
                    "author": "Canadian_SD",
                    "id": "jayj50m",
                    "parent_id": "t1_jayhpwl",
                    "score": 7,
                    "created_utc": 1677980002.0,
                    "replies": [
                        {
                            "body": "I see I’ve stroke a nerve on you buddy. I’m actually engaged now to my sugar daddy of 4 years but I’m glad you got that out of your system 🫶🏾",
                            "author": "exotica3333",
                            "id": "jayjjbb",
                            "parent_id": "t1_jayj50m",
                            "score": -1,
                            "created_utc": 1677980202.0,
                            "replies": [
                                {
                                    "body": "Rinser alert. Lol",
                                    "author": "Canadian_SD",
                                    "id": "jaykryb",
                                    "parent_id": "t1_jayjjbb",
                                    "score": 4,
                                    "created_utc": 1677980825.0,
                                    "replies": [
                                        {
                                            "body": "Facts.  Lol. Guys who can't get hard are the ones who CAN'T have sex. \n\nNo man with a hard dick is doing this shit",
                                            "author": null,
                                            "id": "jaz9aty",
                                            "parent_id": "t1_jaykryb",
                                            "score": 1,
                                            "created_utc": 1677993995.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jazmdx6",
                                    "parent_id": "t1_jayjjbb",
                                    "score": 1,
                                    "created_utc": 1678003157.0,
                                    "replies": [
                                        {
                                            "body": "💯",
                                            "author": "Professional-Dirt856",
                                            "id": "jazncxn",
                                            "parent_id": "t1_jazmdx6",
                                            "score": 1,
                                            "created_utc": 1678003945.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "False. In my small RL circle, I know of several men that are no longer interested in sex but still enjoy the close company of a woman. The physical side of the SR extends often just to cuddles, some extend to more but not piv. Yes, I'm aware that anything more than cuddles is sex. One I'm aware of is a man in his late 70's that sees his SB once a week for lunch and a walk/talk for a few hours. In my book (and hers) that's still an SR. Is it common? No but it exists enough imo for the answer to be 'false'. 🤷\n\nEdit: Hmm, not sure I answered the actual question now? 🤷 🤣🤣",
            "author": "Sunhillian",
            "id": "jayozl1",
            "parent_id": "t3_11ifvdn",
            "score": 0,
            "created_utc": 1677982947.0,
            "replies": [
                {
                    "body": "Erectile Dysfunction.",
                    "author": null,
                    "id": "jaz921f",
                    "parent_id": "t1_jayozl1",
                    "score": 2,
                    "created_utc": 1677993850.0,
                    "replies": [
                        {
                            "body": "i’m sorry but even with ED a BJ would still feel amazing 😈😂",
                            "author": "NickPfromYuma",
                            "id": "jb1espl",
                            "parent_id": "t1_jaz921f",
                            "score": 1,
                            "created_utc": 1678040515.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Your buddy in his 70’s isn’t in a SR. Nothing wrong with his situation, as long as all parties involved are content with the situation. \n\nBut that by definition is not a SR, more like a really expensive caregiver.",
                    "author": "Canadian_SD",
                    "id": "jaypo0x",
                    "parent_id": "t1_jayozl1",
                    "score": 1,
                    "created_utc": 1677983286.0,
                    "replies": [
                        {
                            "body": "Surely that's only true if you believe an SR can only be an SR if it includes sex, so I'm wondering why you posted the question?",
                            "author": "Sunhillian",
                            "id": "jayq080",
                            "parent_id": "t1_jaypo0x",
                            "score": 3,
                            "created_utc": 1677983451.0,
                            "replies": [
                                {
                                    "body": "This would be like a SB talking about how she doesn’t get any financial assistance, gifts or mentorship from a guy she sleeps that. But he’s her SD. Uhh nope. That’s a FWB situation, not a SR.\n\nThe word “Sugar” has a meaning in this context. What you described is not an “SR”, plain and simple.",
                                    "author": "Canadian_SD",
                                    "id": "jayskoj",
                                    "parent_id": "t1_jayq080",
                                    "score": -1,
                                    "created_utc": 1677984751.0,
                                    "replies": [
                                        {
                                            "body": "If she's giving sex in exchange for mentorship with no finance, that's an SR in your book? That's the FWB no?\n\nThere are escorts that meet guys often where no sex is involved. Does that mean they're not escorting on that date? \n\nSurely its not the absence of sex that rules it out as an SR, it would be the absence of finance? \n\nGenuine question, not argumentative for the sake of it 🤷",
                                            "author": "Sunhillian",
                                            "id": "jaytxu5",
                                            "parent_id": "t1_jayskoj",
                                            "score": 4,
                                            "created_utc": 1677985451.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, the absence sex makes it not a an SR.\n\nYes, the absence sex makes it not prostitution.\n\nBuddy, this isn’t rocket science",
                                                    "author": "Canadian_SD",
                                                    "id": "jayug0g",
                                                    "parent_id": "t1_jaytxu5",
                                                    "score": 2,
                                                    "created_utc": 1677985711.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "False. You’re way too focused on sex. Hire a prostitute.",
            "author": "Key-Significance-644",
            "id": "jb1o5xp",
            "parent_id": "t3_11ifvdn",
            "score": 0,
            "created_utc": 1678044271.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jay82rd",
            "parent_id": "t3_11ifvdn",
            "score": -2,
            "created_utc": 1677974639.0,
            "replies": [
                {
                    "body": "I am curious what % of POTs block you for that immediately? I know I do",
                    "author": "LazyRainySunday",
                    "id": "jayi13g",
                    "parent_id": "t1_jay82rd",
                    "score": 3,
                    "created_utc": 1677979444.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "jayji5m",
                            "parent_id": "t1_jayi13g",
                            "score": -3,
                            "created_utc": 1677980186.0,
                            "replies": [
                                {
                                    "body": "As long as you're not expecting payment from a SD while you play hard to get. If I wanted a challenge, I'd still be married lol.",
                                    "author": "TexasSD",
                                    "id": "jaz3omv",
                                    "parent_id": "t1_jayji5m",
                                    "score": 2,
                                    "created_utc": 1677990709.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d say it depends. I tend to not mind something sexual if I feel comfortable with the person. However, many SDs I’ve interacted with wanted a prostitute, and I’m not one. If you want to treat a SB like a prostitute, why are you complaining when she treats you like an ATM?",
            "author": "raining_rose",
            "id": "jd52zbs",
            "parent_id": "t3_11ifvdn",
            "score": 0,
            "created_utc": 1679436008.0,
            "replies": []
        },
        {
            "body": "I mean there is such a thing as platonic SRs so…",
            "author": "RevolutionaryTear230",
            "id": "jd5ulpr",
            "parent_id": "t3_11ifvdn",
            "score": 0,
            "created_utc": 1679447735.0,
            "replies": []
        },
        {
            "body": "Bang!",
            "author": "FunInTheSunGuy",
            "id": "jaymprd",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1677981802.0,
            "replies": []
        },
        {
            "body": "Such a Canadian view… 😂",
            "author": "YakiMe",
            "id": "jaytshe",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1677985373.0,
            "replies": []
        },
        {
            "body": "Soooo - it’s sex work, or it isn’t?\n\nIt’s legal, or it isn’t?\n\nAsking for a friend.",
            "author": "mistressita",
            "id": "jb0tufv",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1678031875.0,
            "replies": [
                {
                    "body": "The Sugar Daddy could ask the same thing when you nag him over an “allowance”.",
                    "author": "Canadian_SD",
                    "id": "jb0x5a0",
                    "parent_id": "t1_jb0tufv",
                    "score": 1,
                    "created_utc": 1678033425.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "💯",
            "author": "ecoDieselWV",
            "id": "jb12qug",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1678035819.0,
            "replies": []
        },
        {
            "body": "It's weird to see that openly in profiles now. There's easier and more profitable ways to get that kind of attention. It just makes everybody's days more dreary to hear what's excluded than what's available.",
            "author": "kalkalyan",
            "id": "jblpwmr",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1678402863.0,
            "replies": [
                {
                    "body": "What are the easier ways?",
                    "author": "LehGeek",
                    "id": "jboklyt",
                    "parent_id": "t1_jblpwmr",
                    "score": 1,
                    "created_utc": 1678461246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally True ... Duh",
            "author": "CanYouFeelMe78",
            "id": "jbum9qa",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1678568742.0,
            "replies": []
        },
        {
            "body": "True",
            "author": "chb0reddit",
            "id": "jc92wzw",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1678852921.0,
            "replies": []
        },
        {
            "body": "Lol that is about as funny as assuming that mentorship is really a thing in a sugar relationship.  I’d gladly mentor someone for free but hell if I’d pay to do it.",
            "author": "Notorious931",
            "id": "jci4d4x",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679011467.0,
            "replies": []
        },
        {
            "body": "So true",
            "author": "DCsugar",
            "id": "jcirw6g",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679022357.0,
            "replies": []
        },
        {
            "body": "TRUE!!!",
            "author": "Ornery_Web9273",
            "id": "jcpvvpv",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679159789.0,
            "replies": []
        },
        {
            "body": "Sugar daddy for me",
            "author": "MathHuge7018",
            "id": "jcx2faa",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679290883.0,
            "replies": []
        },
        {
            "body": "It should be in exchange for both, and most sugar baby doesn't accept anything sexual because it's online.",
            "author": "Pablo_231",
            "id": "jcxogdf",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679309683.0,
            "replies": []
        },
        {
            "body": "Very true",
            "author": "Pablo_231",
            "id": "jcxokdm",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679309764.0,
            "replies": []
        },
        {
            "body": "It means she’s not attracted to you.",
            "author": "yourfriendhello",
            "id": "jdaxo2a",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679537201.0,
            "replies": [
                {
                    "body": "SD: “What a coincidence, my wallet isn’t attracted to you either” 😂😂",
                    "author": "Canadian_SD",
                    "id": "jdb0zeb",
                    "parent_id": "t1_jdaxo2a",
                    "score": 2,
                    "created_utc": 1679538708.0,
                    "replies": [
                        {
                            "body": "SB: “What a coincidence, I don’t date unattractive men regardless of their wallet.”",
                            "author": "yourfriendhello",
                            "id": "jdb1p3j",
                            "parent_id": "t1_jdb0zeb",
                            "score": 1,
                            "created_utc": 1679539037.0,
                            "replies": [
                                {
                                    "body": "Then in that case there’s no problem. SD gets no action. SB gets no financial support. Fair and equal.",
                                    "author": "Canadian_SD",
                                    "id": "jdb3937",
                                    "parent_id": "t1_jdb1p3j",
                                    "score": 3,
                                    "created_utc": 1679539777.0,
                                    "replies": [
                                        {
                                            "body": "You’re missing the point.\n\nShe’s platonic for you because she’s not attracted to you.\n\nShe’s obviously having sex with men she’s attracted to.",
                                            "author": "yourfriendhello",
                                            "id": "jdb3mm3",
                                            "parent_id": "t1_jdb3937",
                                            "score": 1,
                                            "created_utc": 1679539956.0,
                                            "replies": [
                                                {
                                                    "body": "You’re missing the point Mr. Troll.\n\nNothing wrong with “platonic”. SB is free to choose platonic. But in response, SD isn’t going to pay. Simple and fair.\n\nThis isn’t Tinder my boy. 50 year old SDs aren’t signing up for seeking-arrangements, because they think some hot 20 year is going to find them attractive. So that’s irrelevant. They are exchanging $ for an arrangement.\n\nI don’t know if my mid 20s SB is “attracted” to me. But she plays her part, and I play mine.",
                                                    "author": "Canadian_SD",
                                                    "id": "jdb8apg",
                                                    "parent_id": "t1_jdb3mm3",
                                                    "score": 2,
                                                    "created_utc": 1679542286.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
                                                            "author": "yourfriendhello",
                                                            "id": "jdb94x5",
                                                            "parent_id": "t1_jdb8apg",
                                                            "score": 1,
                                                            "created_utc": 1679542727.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                                                                    "author": "Canadian_SD",
                                                                    "id": "jdbdcrg",
                                                                    "parent_id": "t1_jdb94x5",
                                                                    "score": 3,
                                                                    "created_utc": 1679545072.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugaring isn't just about the sexual contact or just about money. it's about making the other person feel good. Prioritizing them and then giving them what they need. \n\nI've been a sugar baby with zero sexual contact before. Sometimes, SD or SM enjoy social contact or cuddling and dont even want sexual favors. This can be due to age or personal preferences. \n\nIf you are interested in sugaring, you need to set your boundaries and only look for those who are seeking that kind of thing. You also need to be able to understand that most people who are sugaring are not going to change their style just for you.",
            "author": "EmiliaWilkenson",
            "id": "jdvvg0e",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679933144.0,
            "replies": []
        },
        {
            "body": "I personally would say false. I have met a couple that didn't want sex. I had one that I guess was sexual- he had a foot fettish and I sent feet photos but never my nude body. That's the only one I would consider sexual in my personal experiences. \n\nA large portion of sugar relationships are sexual, but it isn't mandatory. It depends on what both the sb and the sd/sm are looking for. Sexual isn't for everyone just as nonsexual isn't for everyone, yk?",
            "author": "that-0ne-kidd",
            "id": "jdx92qt",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1679952143.0,
            "replies": []
        },
        {
            "body": "Vanilla babies exist and there are daddies who want other things",
            "author": "Asras_wifu",
            "id": "je0otfr",
            "parent_id": "t3_11ifvdn",
            "score": 1,
            "created_utc": 1680019020.0,
            "replies": []
        },
        {
            "body": "it might be true from a standpoint of all things being equal, but one is coming from a place of being manipulative and other is just freaking extremely misguided and naive because she has been mislead by social media and other blogs.",
            "author": "NickPfromYuma",
            "id": "jaxz8jl",
            "parent_id": "t1_jaxyy3l",
            "score": 27,
            "created_utc": 1677970565.0,
            "replies": [
                {
                    "body": "Are you suggesting there are two sides to the \"I don't want anything sexual\" coin or that the SD would be manipulative while the SB is misguided and naïve?  The SD could just want to vanilla date; where is the fault?\n\nI just wish they'd both stay off seeking.",
                    "author": "Beginning_Pear_2231",
                    "id": "jayl8mv",
                    "parent_id": "t1_jaxz8jl",
                    "score": 14,
                    "created_utc": 1677981058.0,
                    "replies": [
                        {
                            "body": "But Nick is correct.  If you consider that they want to swap sex with no sex, what would you swap money?  No money?  Sex can be enjoyable for both people, but you give money .... Is that enjoyable?  It is a win win for them to not want sex.  Plenty of girls volunteer to be taken out to eat for free and you don't need to be on seeking for that.",
                            "author": "bthdk85",
                            "id": "jayny9f",
                            "parent_id": "t1_jayl8mv",
                            "score": 8,
                            "created_utc": 1677982429.0,
                            "replies": [
                                {
                                    "body": "Swap money with no money.  Vanilla dates.  Yes.  It is not manipulative for a man to ask a woman out for a non-financial date.  Not what I want to see on seeking, sure.\n\nSBs can manipulate.  SDs can be misguided and naive.\n\nThe suggestion appears to be that the SD will always be the creeper and the SB will always be the innocent.",
                                    "author": "Beginning_Pear_2231",
                                    "id": "jayopem",
                                    "parent_id": "t1_jayny9f",
                                    "score": 10,
                                    "created_utc": 1677982809.0,
                                    "replies": [
                                        {
                                            "body": "Then you should go on a normal dating website if that's what you want or go creat simping.com \n\nIn one breath you called SD can be manipulative and SB can be naive, then on the same breath being ok with that.  It is a creeper for SD to demand sugar then what do you call SB who is not holding to their end? A gold digger?",
                                            "author": "bthdk85",
                                            "id": "jayp7rg",
                                            "parent_id": "t1_jayopem",
                                            "score": 0,
                                            "created_utc": 1677983061.0,
                                            "replies": [
                                                {
                                                    "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
                                                    "author": "Beginning_Pear_2231",
                                                    "id": "jayq5o0",
                                                    "parent_id": "t1_jayp7rg",
                                                    "score": 7,
                                                    "created_utc": 1677983526.0,
                                                    "replies": [
                                                        {
                                                            "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                                                            "author": "Snoo71180",
                                                            "id": "jb0e0ol",
                                                            "parent_id": "t1_jayq5o0",
                                                            "score": 3,
                                                            "created_utc": 1678024396.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                                                            "author": "Glum_Self7991",
                                                            "id": "jbuz6gu",
                                                            "parent_id": "t1_jayq5o0",
                                                            "score": 1,
                                                            "created_utc": 1678574572.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I genuinely want to be a sugar daddy but more so for a bdsm stuff than a financial investment. Only cause I’m not financially ready. You are suggesting that women would respect that and give me a chance because it isn’t a transactional relationship. Money doesn’t mean sex so I still have a chance. Is that right?!?!?",
                    "author": "nanashi9372",
                    "id": "jb2rfxo",
                    "parent_id": "t1_jaxz8jl",
                    "score": 2,
                    "created_utc": 1678061150.0,
                    "replies": []
                },
                {
                    "body": "Well, I didn't assign any context to my answer (and the OP didn't offer any), so it was \"assuming all things being equal.\"",
                    "author": "FLRAdvocate",
                    "id": "jaxzg8y",
                    "parent_id": "t1_jaxz8jl",
                    "score": 2,
                    "created_utc": 1677970662.0,
                    "replies": []
                },
                {
                    "body": "This! 🤞🏾",
                    "author": "lirababyxoxo",
                    "id": "jbnnhi1",
                    "parent_id": "t1_jaxz8jl",
                    "score": 1,
                    "created_utc": 1678442295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are SBs who are there for lifestyle augmentation vs income. I’d say 5 percent of them. They are usually older and not easy to find. They have high standards when it comes to SD looks and status. The only hitch there is they can be risky down the road and demand a ring.",
            "author": null,
            "id": "jb1356r",
            "parent_id": "t1_jaybir1",
            "score": 9,
            "created_utc": 1678035979.0,
            "replies": []
        },
        {
            "body": "True. I can be wrong in my thinking but the entire crux of this “sugar lifestyle” revolves around money for a relationshipy service, be it sexual or platonic. Yes it puts one entity at a disadvantage in terms of having to spend money, but again it’s the money that makes them able to pay for relationshipy things withiut the relationshipy stress in a way",
            "author": "AdBudget3520",
            "id": "jayd0at",
            "parent_id": "t1_jaybir1",
            "score": 8,
            "created_utc": 1677976942.0,
            "replies": []
        },
        {
            "body": "I'm not sure. In my SR I am not entirely sure who is using who for sex. I think the allowance is largely secondary to SGF in all honesty.",
            "author": "C12H22O11-EU",
            "id": "jb118hw",
            "parent_id": "t1_jaybir1",
            "score": 2,
            "created_utc": 1678035207.0,
            "replies": [
                {
                    "body": "It's never \"using\" if you're in an arrangement that you both are happy with.",
                    "author": "JustAsk4Alice",
                    "id": "jb1pr36",
                    "parent_id": "t1_jb118hw",
                    "score": 3,
                    "created_utc": 1678044931.0,
                    "replies": [
                        {
                            "body": "Oh my GOODness! Thank you!!!",
                            "author": "TheEbonyFemmeFatale",
                            "id": "jc15pyd",
                            "parent_id": "t1_jb1pr36",
                            "score": 3,
                            "created_utc": 1678694203.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wait……. Have you ever actually been in the sugar bowl? We have seen many examples of SB who said they didn’t want money. Especially in the past few years as seeking has turned into a traditional dating site and you have to agree to no PPM.\n\nI would argue that an SD who wants platonic is rarer than a SB who doesn’t want money.",
            "author": "UnearthlyDinosaur",
            "id": "jayesjn",
            "parent_id": "t1_jaybir1",
            "score": 6,
            "created_utc": 1677977816.0,
            "replies": [
                {
                    "body": "If they don't want money, what classifies them as a SB?",
                    "author": "matthewjphillips",
                    "id": "jazch5k",
                    "parent_id": "t1_jayesjn",
                    "score": 5,
                    "created_utc": 1677995901.0,
                    "replies": [
                        {
                            "body": "I think they’re referring to experience- or travel-oriented sugar babies, who want those things rather than money.",
                            "author": "olivinemultichrome",
                            "id": "jazgyr9",
                            "parent_id": "t1_jazch5k",
                            "score": 6,
                            "created_utc": 1677998963.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I met a girl on seeking who ended up buying me things",
            "author": "HighOnGoofballs",
            "id": "jb020ce",
            "parent_id": "t1_jaybir1",
            "score": 1,
            "created_utc": 1678016400.0,
            "replies": [
                {
                    "body": "Then u were the SB :-)",
                    "author": "Quinteman",
                    "id": "jb0lb26",
                    "parent_id": "t1_jb020ce",
                    "score": 7,
                    "created_utc": 1678028075.0,
                    "replies": [
                        {
                            "body": "I’m totally ok with that",
                            "author": "HighOnGoofballs",
                            "id": "jb0m1ms",
                            "parent_id": "t1_jb0lb26",
                            "score": 3,
                            "created_utc": 1678028420.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There is such a thing as outliers",
                    "author": "nanashi9372",
                    "id": "jb2rtbj",
                    "parent_id": "t1_jb020ce",
                    "score": 3,
                    "created_utc": 1678061324.0,
                    "replies": []
                },
                {
                    "body": "Well good, it means she liked you too and/or it may be her way of expressing her love language.\nThis is what I do.\nI'm always listening, and whenever I'm out and about, my mind will usually revolve around \"what can I find, for those I love, who will appreciate it sincerely.\n\nI give very specific and unique gifts...so to me, it's a way of expressing my care for the other person.",
                    "author": "JustAsk4Alice",
                    "id": "jb1pk26",
                    "parent_id": "t1_jb020ce",
                    "score": 2,
                    "created_utc": 1678044852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My favorite one is when SBs say “I’ve been scammed before, so I’m not going to meet unless you send me money online”\n\nSomehow they have a risk of getting scammed by meeting for coffee/drink at a public place 🤦‍♂️ but SDs are supposed to send them money along with their first message 🤷‍♂️",
            "author": "geekxp",
            "id": "jayqbf8",
            "parent_id": "t1_jayf03j",
            "score": 14,
            "created_utc": 1677983606.0,
            "replies": [
                {
                    "body": "So move on.\nThose are OBVIOUSLY the ones that you DONT want to date, bc you dont like the initial set up, so just skip those profiles and look for someone/something genuine.  Believe it or not, there's ppl on there still, who want a real relationship, they are just tired of having to wade through all the sewage to find that someone.",
                    "author": "JustAsk4Alice",
                    "id": "jb1qe88",
                    "parent_id": "t1_jayqbf8",
                    "score": 0,
                    "created_utc": 1678045201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was an SB who was in multiple no-sex relationships for extended periods. It might be relatively rare but it does happen, it is not a myth. There are older people out there looking for a specific kind of companionship to display to friends, coworkers, etc and they get more out of the perception that other people have of them than they do anything else. \n\nA lot of people automatically boil sugaring down to sex and only sex. Even the SDs/Ms I've had sexual relationships with I actually liked and respected as people, not cash cows. \n\nI get that for a lot of people sugaring has turned into more straightforward give money, get sex but all the relationships I was in, sexual or non, did not have that kind of overt transactional feeling. These were real people that I spent a lot of time with and actually cared about or else I would not have wasted my time and theirs.",
            "author": "dezeiram",
            "id": "jazh4wy",
            "parent_id": "t1_jayf03j",
            "score": 16,
            "created_utc": 1677999090.0,
            "replies": [
                {
                    "body": "I *wish* I could find a relationship like that. I'm asexual & queer, and between that and my disabilities I've been effectively single for years. I miss the non-sexual closeness of relationships.",
                    "author": "WinterLily86",
                    "id": "jbxpo4q",
                    "parent_id": "t1_jazh4wy",
                    "score": 2,
                    "created_utc": 1678633985.0,
                    "replies": []
                },
                {
                    "body": "To your second paragraph, absolutely! I hate it! \n\nSometimes, there’s just more than sex to sugar relationships.",
                    "author": "TheEbonyFemmeFatale",
                    "id": "jc165ga",
                    "parent_id": "t1_jazh4wy",
                    "score": 1,
                    "created_utc": 1678694579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A whole lot of Simps on OF claiming they are sugar daddies",
            "author": "West_Texas_Daddy",
            "id": "jayl1mm",
            "parent_id": "t1_jayf03j",
            "score": 9,
            "created_utc": 1677980961.0,
            "replies": [
                {
                    "body": "Yes, girls told me how guys just send them things from wish list for nothing.  Simps ruin everything.",
                    "author": "bthdk85",
                    "id": "jayo1uq",
                    "parent_id": "t1_jayl1mm",
                    "score": 5,
                    "created_utc": 1677982480.0,
                    "replies": [
                        {
                            "body": "A fan sending an OnlyFans girl a vibrator doesn’t pay her bills.",
                            "author": "DumbleSD",
                            "id": "jayp1fc",
                            "parent_id": "t1_jayo1uq",
                            "score": 12,
                            "created_utc": 1677982973.0,
                            "replies": [
                                {
                                    "body": "Why don't you buy her a Tesla? That doesn't pay the bill so it doesn't count. Or buy her a house.  It doesn't pay the bill so it doesn't count.",
                                    "author": "bthdk85",
                                    "id": "jaypc99",
                                    "parent_id": "t1_jayp1fc",
                                    "score": 0,
                                    "created_utc": 1677983124.0,
                                    "replies": [
                                        {
                                            "body": "I’m not buying an OnlyFans girl a coffee at Panera, because I’m not interested in that, but,again, a couple of losers in their basements buying her low value items has zero to do with sugar.",
                                            "author": "DumbleSD",
                                            "id": "jayw9l7",
                                            "parent_id": "t1_jaypc99",
                                            "score": 5,
                                            "created_utc": 1677986658.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "jaywkj7",
                                                    "parent_id": "t1_jayw9l7",
                                                    "score": -2,
                                                    "created_utc": 1677986818.0,
                                                    "replies": [
                                                        {
                                                            "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                                                            "author": "Intrepid_Egg_7722",
                                                            "id": "jaz165w",
                                                            "parent_id": "t1_jaywkj7",
                                                            "score": 3,
                                                            "created_utc": 1677989283.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                                                            "author": "DumbleSD",
                                                            "id": "jaz0njq",
                                                            "parent_id": "t1_jaywkj7",
                                                            "score": 2,
                                                            "created_utc": 1677989007.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not every man is thirsty and too horny for his own good on this sites. Some good men like treating their ladies and get rewarded unlike y’all",
                            "author": "Nefarious_evee",
                            "id": "jb19vj2",
                            "parent_id": "t1_jayo1uq",
                            "score": 3,
                            "created_utc": 1678038636.0,
                            "replies": []
                        },
                        {
                            "body": "🤣🤣🤣🤣\nOh yes....damn those Simps for sending gifts to chicks that they are interested in.\n\nIt just means YOU actually have to put some work and a little  bit of effort, to get that same level of attn.",
                            "author": "JustAsk4Alice",
                            "id": "jb1t8nv",
                            "parent_id": "t1_jayo1uq",
                            "score": 2,
                            "created_utc": 1678046386.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is it really nothing in return though? I feel like there are situations where it could still be beneficial for both people",
            "author": "beckiem9",
            "id": "jcj5ni3",
            "parent_id": "t1_jayf03j",
            "score": 1,
            "created_utc": 1679030417.0,
            "replies": []
        },
        {
            "body": "This is a solid take.",
            "author": "TK-663",
            "id": "jazur43",
            "parent_id": "t1_jaysit1",
            "score": 1,
            "created_utc": 1678010168.0,
            "replies": []
        },
        {
            "body": "^^^THIS\n\nStop wasting time and energy on ppl who aren't making you their priority.",
            "author": "JustAsk4Alice",
            "id": "jb1yf89",
            "parent_id": "t1_jaysit1",
            "score": 1,
            "created_utc": 1678048561.0,
            "replies": []
        },
        {
            "body": "I disagree with your second comment about SD. By definition a sugar daddy is an older man that spoils a younger woman with gifts shopping and/or experiences. The Financial aspect is not part of every arrangement or relationship. while in the modern sugar bowl must relationships do include allowances, that’s not to say all still do",
            "author": "NickPfromYuma",
            "id": "jb1ei98",
            "parent_id": "t1_jb113zd",
            "score": 0,
            "created_utc": 1678040405.0,
            "replies": [
                {
                    "body": ">a sugar daddy is an older man that spoils a younger woman with gifts shopping and/or experiences\n\nGifting and experiences are still financial.",
                    "author": "C12H22O11-EU",
                    "id": "jb49nqm",
                    "parent_id": "t1_jb1ei98",
                    "score": 5,
                    "created_utc": 1678093094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And there are unicorns, right?",
            "author": "ingallsd",
            "id": "jb1bocl",
            "parent_id": "t1_jazluw3",
            "score": 3,
            "created_utc": 1678039336.0,
            "replies": [
                {
                    "body": "In the SB....FUCK YES THERE ARE!",
                    "author": "JustAsk4Alice",
                    "id": "jb1tl3x",
                    "parent_id": "t1_jb1bocl",
                    "score": 1,
                    "created_utc": 1678046531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow",
            "author": "heycarlos1969",
            "id": "jb26h2b",
            "parent_id": "t1_jazbif0",
            "score": 3,
            "created_utc": 1678051886.0,
            "replies": []
        },
        {
            "body": ">I can’t tell you how much of a relief it was to finally not feel obligated to be ready for sex or fake ready whenever they were.\n\nUgh... I'm sorry for you dating guys you didn't really want sexually or having too different sex drive :(( That sounds like awful SR!",
            "author": "SeekingInSydney",
            "id": "jb1s1dq",
            "parent_id": "t1_jazxklf",
            "score": 1,
            "created_utc": 1678045889.0,
            "replies": [
                {
                    "body": "I appreciate your sentiment! I was definitely sexually attracted to them, and we generally shared the same sex drive, but every now and then, I’d just prefer quality time minus sex because I actually liked them. The issue was the expectation of sex every time we met because of me receiving gifts and money. Like, we can’t just watch a couple of movies or cook dinner together.\n\nIf this expectation had been explained to me when discussing the arrangement, I could’ve realized we aren’t compatible and suggested that we not waste each other’s time.\n\nI was young and new and without much guidance, so I wasn’t aware of how things can be (I hadn’t done much vanilla dating back then, either lol), and honestly, I wasn’t good at standing up for myself. Error on my part.\n\nAll in all, I had my lessons learned, and I’m a better and more knowledgeable person for it.\n\nAgain, I deeply appreciate your sentiment!",
                    "author": "TheEbonyFemmeFatale",
                    "id": "jb2f49g",
                    "parent_id": "t1_jb1s1dq",
                    "score": 3,
                    "created_utc": 1678055593.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lolz",
            "author": "ankurtyagi2007",
            "id": "jduc8wj",
            "parent_id": "t1_jaz87z1",
            "score": 1,
            "created_utc": 1679900318.0,
            "replies": []
        },
        {
            "body": "Let's not make this a man vs woman thing-- there is plenty of shame directed at both groups",
            "author": "HarvardLawSB",
            "id": "jaxznpt",
            "parent_id": "t1_jaxzbpi",
            "score": 14,
            "created_utc": 1677970758.0,
            "replies": [
                {
                    "body": "> Let's not make this a man vs woman thing-\n\nDoes the very subject of the post not already do that to a degree?",
                    "author": "FLRAdvocate",
                    "id": "jay06xo",
                    "parent_id": "t1_jaxznpt",
                    "score": 5,
                    "created_utc": 1677971007.0,
                    "replies": [
                        {
                            "body": "Yeah. That’s why I didn’t answer the question. But the “problem” isn’t that one group is shamed while the other isn’t. It’s that anyone thinks that shaming is the answer.",
                            "author": "HarvardLawSB",
                            "id": "jay0d8b",
                            "parent_id": "t1_jay06xo",
                            "score": 12,
                            "created_utc": 1677971087.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">while sugar babies are not shamed for wanting money.\n\nHere's the link to what I think is the last time you made this ridiculous comment: \n\n[https://www.reddit.com/r/sugarlifestyleforum/comments/10w13yi/hey\\_ladies\\_you\\_need\\_to\\_start\\_calling\\_out\\_bad/](https://www.reddit.com/r/sugarlifestyleforum/comments/10w13yi/hey_ladies_you_need_to_start_calling_out_bad/)\n\n(that link also includes the link to the prior time you made the same ridiculous comment). \n\n&#x200B;\n\nSince this wasn't even a month ago, hopefully you won't again play that \"oh those comments were so long ago\" absurdness.\n\nHere's the link and comments I posted in that thread. Hopefully you'll eventually get tired of posting obvious untrue bullshit and just drop this canard:\n\n&#x200B;\n\nFrom this weekend (most recent one I could find, a lot of them get deleted once the mocking starts):  \n[https://www.reddit.com/r/sugarlifestyleforum/comments/10tp9ai/new\\_sb/](https://www.reddit.com/r/sugarlifestyleforum/comments/10tp9ai/new_sb/)\n\nResponses:  \nBeing a sugar baby = being a friend and LOVER with financial perksDon't wait to find something platonic , maybe get a second job ?  \nGotta love this generation. “I don’t want to do anything, I just want money.”  \nCouldn't have put it better .Like for real ?? Getting paid for what really ??  \nI get a kick out of the ants I see from 18 to 22-year-old saying that they want to mentor their sugar daddy. Wtf  \n“I give really good advice” lol",
            "author": "NoLimitLexa",
            "id": "jay16gj",
            "parent_id": "t1_jaxzbpi",
            "score": 5,
            "created_utc": 1677971457.0,
            "replies": []
        },
        {
            "body": "Good post, was going to say same. \n\nMaybe the result of the two scenarios is ultimately similar, but intent matters and naive is not nearly as bad as intentionally manipulative imo",
            "author": "NoLimitLexa",
            "id": "jaxzfv5",
            "parent_id": "t1_jaxyzl5",
            "score": 11,
            "created_utc": 1677970657.0,
            "replies": [
                {
                    "body": "Well, I think SA's marketing is now creating SDs who aren't intentionally manipulative. The marketing makes it seem like it's just vanilla dating with benefits, but no explicit allowance or PPM. They're advertising a Gifts and Experiences type of dating experience, so it's not going to be long until some of this marketing works on men who don't know SA's past and they come to the site looking for women who want to go out on fancy dates / trips for intimacy...\n\nBut yes, there are still lots of SDs who know about arrangements that still play dumb and try to scam/rinse, which is unfortunate! There's also girls on the other side of this who promise intimacy and don't hold up their end of the deal when they get their allowance. 😕\n\nTWSD",
                    "author": "3WaySD",
                    "id": "jay3iqr",
                    "parent_id": "t1_jaxzfv5",
                    "score": 6,
                    "created_utc": 1677972533.0,
                    "replies": []
                },
                {
                    "body": ">Good post, was going to say same.\n\nThanks!\n\n&#x200B;\n\n>Maybe the result of the two scenarios is ultimately similar, but intent matters and naive is not nearly as bad as intentionally manipulative imo\n\nTrue. all things being equal, they have the same context. But digging deeper, the intent is usually different. I've had conversations with so-called platonic SB, some of them so naively believe that all real SR are platonic and that any guy that wants sex and is offering an allowance is looking for a prostitute. Unless thats some type of negging manipulation used by some, it seems to be universally believed by many women that sugar is some type of charity / sponsorship / mentor BS.",
                    "author": "NickPfromYuma",
                    "id": "jay0y6l",
                    "parent_id": "t1_jaxzfv5",
                    "score": 4,
                    "created_utc": 1677971353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "how is it manipulative if he is being transparent with his intentions?",
            "author": "TheStoicbrother",
            "id": "jaymwew",
            "parent_id": "t1_jaxyzl5",
            "score": 3,
            "created_utc": 1677981898.0,
            "replies": []
        },
        {
            "body": "We don’t know that all platonic SB are that way because of social media. Some are just scammers by nature.",
            "author": "UnearthlyDinosaur",
            "id": "jay06kq",
            "parent_id": "t1_jaxyzl5",
            "score": 9,
            "created_utc": 1677971002.0,
            "replies": [
                {
                    "body": "> Some are just scammers by nature.\n\ntrue, but scammers usually imply theres to be intimacy. Unless you're talking about online only scammers.",
                    "author": "NickPfromYuma",
                    "id": "jay0iek",
                    "parent_id": "t1_jay06kq",
                    "score": 10,
                    "created_utc": 1677971152.0,
                    "replies": []
                },
                {
                    "body": "I know back when I told my best friend I thought I might do this she send me a ton of videos on how to delay intimacy and manipulate the guy for money. Essentially milking out as much as possible. Has to really question for a while if my own best friend knew me if she thought I could be so fake to someone. \n\nEspecially since these videos were all saying drop them if you couldn’t get anymore without intimacy because they were using it like a carrot on a stick",
                    "author": "ArcadiaFey",
                    "id": "jb08u1c",
                    "parent_id": "t1_jay06kq",
                    "score": 2,
                    "created_utc": 1678021315.0,
                    "replies": [
                        {
                            "body": "Sex only benefits the Man in these relationships so it’s not a bad idea to make sure you get your needs meet first before letting everyone POT pump & dump you!",
                            "author": "Nefarious_evee",
                            "id": "jb1aamj",
                            "parent_id": "t1_jb08u1c",
                            "score": 0,
                            "created_utc": 1678038803.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because asexual people exist and we can get lonely too?",
            "author": "WinterLily86",
            "id": "jbxq20h",
            "parent_id": "t1_jb1b3vg",
            "score": 2,
            "created_utc": 1678634159.0,
            "replies": [
                {
                    "body": "And daddy is afinancial - perfect.",
                    "author": "Dry-Hat7524",
                    "id": "jbxvvrr",
                    "parent_id": "t1_jbxq20h",
                    "score": 1,
                    "created_utc": 1678636671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "exactly 😂😭",
            "author": "exotica3333",
            "id": "jayhs0b",
            "parent_id": "t1_jayfvjn",
            "score": 2,
            "created_utc": 1677979316.0,
            "replies": []
        },
        {
            "body": "Found the rinser",
            "author": "Canadian_SD",
            "id": "jayj50m",
            "parent_id": "t1_jayhpwl",
            "score": 7,
            "created_utc": 1677980002.0,
            "replies": [
                {
                    "body": "I see I’ve stroke a nerve on you buddy. I’m actually engaged now to my sugar daddy of 4 years but I’m glad you got that out of your system 🫶🏾",
                    "author": "exotica3333",
                    "id": "jayjjbb",
                    "parent_id": "t1_jayj50m",
                    "score": -1,
                    "created_utc": 1677980202.0,
                    "replies": [
                        {
                            "body": "Rinser alert. Lol",
                            "author": "Canadian_SD",
                            "id": "jaykryb",
                            "parent_id": "t1_jayjjbb",
                            "score": 4,
                            "created_utc": 1677980825.0,
                            "replies": [
                                {
                                    "body": "Facts.  Lol. Guys who can't get hard are the ones who CAN'T have sex. \n\nNo man with a hard dick is doing this shit",
                                    "author": null,
                                    "id": "jaz9aty",
                                    "parent_id": "t1_jaykryb",
                                    "score": 1,
                                    "created_utc": 1677993995.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jazmdx6",
                            "parent_id": "t1_jayjjbb",
                            "score": 1,
                            "created_utc": 1678003157.0,
                            "replies": [
                                {
                                    "body": "💯",
                                    "author": "Professional-Dirt856",
                                    "id": "jazncxn",
                                    "parent_id": "t1_jazmdx6",
                                    "score": 1,
                                    "created_utc": 1678003945.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Erectile Dysfunction.",
            "author": null,
            "id": "jaz921f",
            "parent_id": "t1_jayozl1",
            "score": 2,
            "created_utc": 1677993850.0,
            "replies": [
                {
                    "body": "i’m sorry but even with ED a BJ would still feel amazing 😈😂",
                    "author": "NickPfromYuma",
                    "id": "jb1espl",
                    "parent_id": "t1_jaz921f",
                    "score": 1,
                    "created_utc": 1678040515.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your buddy in his 70’s isn’t in a SR. Nothing wrong with his situation, as long as all parties involved are content with the situation. \n\nBut that by definition is not a SR, more like a really expensive caregiver.",
            "author": "Canadian_SD",
            "id": "jaypo0x",
            "parent_id": "t1_jayozl1",
            "score": 1,
            "created_utc": 1677983286.0,
            "replies": [
                {
                    "body": "Surely that's only true if you believe an SR can only be an SR if it includes sex, so I'm wondering why you posted the question?",
                    "author": "Sunhillian",
                    "id": "jayq080",
                    "parent_id": "t1_jaypo0x",
                    "score": 3,
                    "created_utc": 1677983451.0,
                    "replies": [
                        {
                            "body": "This would be like a SB talking about how she doesn’t get any financial assistance, gifts or mentorship from a guy she sleeps that. But he’s her SD. Uhh nope. That’s a FWB situation, not a SR.\n\nThe word “Sugar” has a meaning in this context. What you described is not an “SR”, plain and simple.",
                            "author": "Canadian_SD",
                            "id": "jayskoj",
                            "parent_id": "t1_jayq080",
                            "score": -1,
                            "created_utc": 1677984751.0,
                            "replies": [
                                {
                                    "body": "If she's giving sex in exchange for mentorship with no finance, that's an SR in your book? That's the FWB no?\n\nThere are escorts that meet guys often where no sex is involved. Does that mean they're not escorting on that date? \n\nSurely its not the absence of sex that rules it out as an SR, it would be the absence of finance? \n\nGenuine question, not argumentative for the sake of it 🤷",
                                    "author": "Sunhillian",
                                    "id": "jaytxu5",
                                    "parent_id": "t1_jayskoj",
                                    "score": 4,
                                    "created_utc": 1677985451.0,
                                    "replies": [
                                        {
                                            "body": "Yes, the absence sex makes it not a an SR.\n\nYes, the absence sex makes it not prostitution.\n\nBuddy, this isn’t rocket science",
                                            "author": "Canadian_SD",
                                            "id": "jayug0g",
                                            "parent_id": "t1_jaytxu5",
                                            "score": 2,
                                            "created_utc": 1677985711.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am curious what % of POTs block you for that immediately? I know I do",
            "author": "LazyRainySunday",
            "id": "jayi13g",
            "parent_id": "t1_jay82rd",
            "score": 3,
            "created_utc": 1677979444.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "jayji5m",
                    "parent_id": "t1_jayi13g",
                    "score": -3,
                    "created_utc": 1677980186.0,
                    "replies": [
                        {
                            "body": "As long as you're not expecting payment from a SD while you play hard to get. If I wanted a challenge, I'd still be married lol.",
                            "author": "TexasSD",
                            "id": "jaz3omv",
                            "parent_id": "t1_jayji5m",
                            "score": 2,
                            "created_utc": 1677990709.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Sugar Daddy could ask the same thing when you nag him over an “allowance”.",
            "author": "Canadian_SD",
            "id": "jb0x5a0",
            "parent_id": "t1_jb0tufv",
            "score": 1,
            "created_utc": 1678033425.0,
            "replies": []
        },
        {
            "body": "What are the easier ways?",
            "author": "LehGeek",
            "id": "jboklyt",
            "parent_id": "t1_jblpwmr",
            "score": 1,
            "created_utc": 1678461246.0,
            "replies": []
        },
        {
            "body": "SD: “What a coincidence, my wallet isn’t attracted to you either” 😂😂",
            "author": "Canadian_SD",
            "id": "jdb0zeb",
            "parent_id": "t1_jdaxo2a",
            "score": 2,
            "created_utc": 1679538708.0,
            "replies": [
                {
                    "body": "SB: “What a coincidence, I don’t date unattractive men regardless of their wallet.”",
                    "author": "yourfriendhello",
                    "id": "jdb1p3j",
                    "parent_id": "t1_jdb0zeb",
                    "score": 1,
                    "created_utc": 1679539037.0,
                    "replies": [
                        {
                            "body": "Then in that case there’s no problem. SD gets no action. SB gets no financial support. Fair and equal.",
                            "author": "Canadian_SD",
                            "id": "jdb3937",
                            "parent_id": "t1_jdb1p3j",
                            "score": 3,
                            "created_utc": 1679539777.0,
                            "replies": [
                                {
                                    "body": "You’re missing the point.\n\nShe’s platonic for you because she’s not attracted to you.\n\nShe’s obviously having sex with men she’s attracted to.",
                                    "author": "yourfriendhello",
                                    "id": "jdb3mm3",
                                    "parent_id": "t1_jdb3937",
                                    "score": 1,
                                    "created_utc": 1679539956.0,
                                    "replies": [
                                        {
                                            "body": "You’re missing the point Mr. Troll.\n\nNothing wrong with “platonic”. SB is free to choose platonic. But in response, SD isn’t going to pay. Simple and fair.\n\nThis isn’t Tinder my boy. 50 year old SDs aren’t signing up for seeking-arrangements, because they think some hot 20 year is going to find them attractive. So that’s irrelevant. They are exchanging $ for an arrangement.\n\nI don’t know if my mid 20s SB is “attracted” to me. But she plays her part, and I play mine.",
                                            "author": "Canadian_SD",
                                            "id": "jdb8apg",
                                            "parent_id": "t1_jdb3mm3",
                                            "score": 2,
                                            "created_utc": 1679542286.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
                                                    "author": "yourfriendhello",
                                                    "id": "jdb94x5",
                                                    "parent_id": "t1_jdb8apg",
                                                    "score": 1,
                                                    "created_utc": 1679542727.0,
                                                    "replies": [
                                                        {
                                                            "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                                                            "author": "Canadian_SD",
                                                            "id": "jdbdcrg",
                                                            "parent_id": "t1_jdb94x5",
                                                            "score": 3,
                                                            "created_utc": 1679545072.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you suggesting there are two sides to the \"I don't want anything sexual\" coin or that the SD would be manipulative while the SB is misguided and naïve?  The SD could just want to vanilla date; where is the fault?\n\nI just wish they'd both stay off seeking.",
            "author": "Beginning_Pear_2231",
            "id": "jayl8mv",
            "parent_id": "t1_jaxz8jl",
            "score": 14,
            "created_utc": 1677981058.0,
            "replies": [
                {
                    "body": "But Nick is correct.  If you consider that they want to swap sex with no sex, what would you swap money?  No money?  Sex can be enjoyable for both people, but you give money .... Is that enjoyable?  It is a win win for them to not want sex.  Plenty of girls volunteer to be taken out to eat for free and you don't need to be on seeking for that.",
                    "author": "bthdk85",
                    "id": "jayny9f",
                    "parent_id": "t1_jayl8mv",
                    "score": 8,
                    "created_utc": 1677982429.0,
                    "replies": [
                        {
                            "body": "Swap money with no money.  Vanilla dates.  Yes.  It is not manipulative for a man to ask a woman out for a non-financial date.  Not what I want to see on seeking, sure.\n\nSBs can manipulate.  SDs can be misguided and naive.\n\nThe suggestion appears to be that the SD will always be the creeper and the SB will always be the innocent.",
                            "author": "Beginning_Pear_2231",
                            "id": "jayopem",
                            "parent_id": "t1_jayny9f",
                            "score": 10,
                            "created_utc": 1677982809.0,
                            "replies": [
                                {
                                    "body": "Then you should go on a normal dating website if that's what you want or go creat simping.com \n\nIn one breath you called SD can be manipulative and SB can be naive, then on the same breath being ok with that.  It is a creeper for SD to demand sugar then what do you call SB who is not holding to their end? A gold digger?",
                                    "author": "bthdk85",
                                    "id": "jayp7rg",
                                    "parent_id": "t1_jayopem",
                                    "score": 0,
                                    "created_utc": 1677983061.0,
                                    "replies": [
                                        {
                                            "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
                                            "author": "Beginning_Pear_2231",
                                            "id": "jayq5o0",
                                            "parent_id": "t1_jayp7rg",
                                            "score": 7,
                                            "created_utc": 1677983526.0,
                                            "replies": [
                                                {
                                                    "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                                                    "author": "Snoo71180",
                                                    "id": "jb0e0ol",
                                                    "parent_id": "t1_jayq5o0",
                                                    "score": 3,
                                                    "created_utc": 1678024396.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                                                    "author": "Glum_Self7991",
                                                    "id": "jbuz6gu",
                                                    "parent_id": "t1_jayq5o0",
                                                    "score": 1,
                                                    "created_utc": 1678574572.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I genuinely want to be a sugar daddy but more so for a bdsm stuff than a financial investment. Only cause I’m not financially ready. You are suggesting that women would respect that and give me a chance because it isn’t a transactional relationship. Money doesn’t mean sex so I still have a chance. Is that right?!?!?",
            "author": "nanashi9372",
            "id": "jb2rfxo",
            "parent_id": "t1_jaxz8jl",
            "score": 2,
            "created_utc": 1678061150.0,
            "replies": []
        },
        {
            "body": "Well, I didn't assign any context to my answer (and the OP didn't offer any), so it was \"assuming all things being equal.\"",
            "author": "FLRAdvocate",
            "id": "jaxzg8y",
            "parent_id": "t1_jaxz8jl",
            "score": 2,
            "created_utc": 1677970662.0,
            "replies": []
        },
        {
            "body": "This! 🤞🏾",
            "author": "lirababyxoxo",
            "id": "jbnnhi1",
            "parent_id": "t1_jaxz8jl",
            "score": 1,
            "created_utc": 1678442295.0,
            "replies": []
        },
        {
            "body": "It's never \"using\" if you're in an arrangement that you both are happy with.",
            "author": "JustAsk4Alice",
            "id": "jb1pr36",
            "parent_id": "t1_jb118hw",
            "score": 3,
            "created_utc": 1678044931.0,
            "replies": [
                {
                    "body": "Oh my GOODness! Thank you!!!",
                    "author": "TheEbonyFemmeFatale",
                    "id": "jc15pyd",
                    "parent_id": "t1_jb1pr36",
                    "score": 3,
                    "created_utc": 1678694203.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If they don't want money, what classifies them as a SB?",
            "author": "matthewjphillips",
            "id": "jazch5k",
            "parent_id": "t1_jayesjn",
            "score": 5,
            "created_utc": 1677995901.0,
            "replies": [
                {
                    "body": "I think they’re referring to experience- or travel-oriented sugar babies, who want those things rather than money.",
                    "author": "olivinemultichrome",
                    "id": "jazgyr9",
                    "parent_id": "t1_jazch5k",
                    "score": 6,
                    "created_utc": 1677998963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then u were the SB :-)",
            "author": "Quinteman",
            "id": "jb0lb26",
            "parent_id": "t1_jb020ce",
            "score": 7,
            "created_utc": 1678028075.0,
            "replies": [
                {
                    "body": "I’m totally ok with that",
                    "author": "HighOnGoofballs",
                    "id": "jb0m1ms",
                    "parent_id": "t1_jb0lb26",
                    "score": 3,
                    "created_utc": 1678028420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There is such a thing as outliers",
            "author": "nanashi9372",
            "id": "jb2rtbj",
            "parent_id": "t1_jb020ce",
            "score": 3,
            "created_utc": 1678061324.0,
            "replies": []
        },
        {
            "body": "Well good, it means she liked you too and/or it may be her way of expressing her love language.\nThis is what I do.\nI'm always listening, and whenever I'm out and about, my mind will usually revolve around \"what can I find, for those I love, who will appreciate it sincerely.\n\nI give very specific and unique gifts...so to me, it's a way of expressing my care for the other person.",
            "author": "JustAsk4Alice",
            "id": "jb1pk26",
            "parent_id": "t1_jb020ce",
            "score": 2,
            "created_utc": 1678044852.0,
            "replies": []
        },
        {
            "body": "So move on.\nThose are OBVIOUSLY the ones that you DONT want to date, bc you dont like the initial set up, so just skip those profiles and look for someone/something genuine.  Believe it or not, there's ppl on there still, who want a real relationship, they are just tired of having to wade through all the sewage to find that someone.",
            "author": "JustAsk4Alice",
            "id": "jb1qe88",
            "parent_id": "t1_jayqbf8",
            "score": 0,
            "created_utc": 1678045201.0,
            "replies": []
        },
        {
            "body": "I *wish* I could find a relationship like that. I'm asexual & queer, and between that and my disabilities I've been effectively single for years. I miss the non-sexual closeness of relationships.",
            "author": "WinterLily86",
            "id": "jbxpo4q",
            "parent_id": "t1_jazh4wy",
            "score": 2,
            "created_utc": 1678633985.0,
            "replies": []
        },
        {
            "body": "To your second paragraph, absolutely! I hate it! \n\nSometimes, there’s just more than sex to sugar relationships.",
            "author": "TheEbonyFemmeFatale",
            "id": "jc165ga",
            "parent_id": "t1_jazh4wy",
            "score": 1,
            "created_utc": 1678694579.0,
            "replies": []
        },
        {
            "body": "Yes, girls told me how guys just send them things from wish list for nothing.  Simps ruin everything.",
            "author": "bthdk85",
            "id": "jayo1uq",
            "parent_id": "t1_jayl1mm",
            "score": 5,
            "created_utc": 1677982480.0,
            "replies": [
                {
                    "body": "A fan sending an OnlyFans girl a vibrator doesn’t pay her bills.",
                    "author": "DumbleSD",
                    "id": "jayp1fc",
                    "parent_id": "t1_jayo1uq",
                    "score": 12,
                    "created_utc": 1677982973.0,
                    "replies": [
                        {
                            "body": "Why don't you buy her a Tesla? That doesn't pay the bill so it doesn't count. Or buy her a house.  It doesn't pay the bill so it doesn't count.",
                            "author": "bthdk85",
                            "id": "jaypc99",
                            "parent_id": "t1_jayp1fc",
                            "score": 0,
                            "created_utc": 1677983124.0,
                            "replies": [
                                {
                                    "body": "I’m not buying an OnlyFans girl a coffee at Panera, because I’m not interested in that, but,again, a couple of losers in their basements buying her low value items has zero to do with sugar.",
                                    "author": "DumbleSD",
                                    "id": "jayw9l7",
                                    "parent_id": "t1_jaypc99",
                                    "score": 5,
                                    "created_utc": 1677986658.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "jaywkj7",
                                            "parent_id": "t1_jayw9l7",
                                            "score": -2,
                                            "created_utc": 1677986818.0,
                                            "replies": [
                                                {
                                                    "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                                                    "author": "Intrepid_Egg_7722",
                                                    "id": "jaz165w",
                                                    "parent_id": "t1_jaywkj7",
                                                    "score": 3,
                                                    "created_utc": 1677989283.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                                                    "author": "DumbleSD",
                                                    "id": "jaz0njq",
                                                    "parent_id": "t1_jaywkj7",
                                                    "score": 2,
                                                    "created_utc": 1677989007.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not every man is thirsty and too horny for his own good on this sites. Some good men like treating their ladies and get rewarded unlike y’all",
                    "author": "Nefarious_evee",
                    "id": "jb19vj2",
                    "parent_id": "t1_jayo1uq",
                    "score": 3,
                    "created_utc": 1678038636.0,
                    "replies": []
                },
                {
                    "body": "🤣🤣🤣🤣\nOh yes....damn those Simps for sending gifts to chicks that they are interested in.\n\nIt just means YOU actually have to put some work and a little  bit of effort, to get that same level of attn.",
                    "author": "JustAsk4Alice",
                    "id": "jb1t8nv",
                    "parent_id": "t1_jayo1uq",
                    "score": 2,
                    "created_utc": 1678046386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">a sugar daddy is an older man that spoils a younger woman with gifts shopping and/or experiences\n\nGifting and experiences are still financial.",
            "author": "C12H22O11-EU",
            "id": "jb49nqm",
            "parent_id": "t1_jb1ei98",
            "score": 5,
            "created_utc": 1678093094.0,
            "replies": []
        },
        {
            "body": "In the SB....FUCK YES THERE ARE!",
            "author": "JustAsk4Alice",
            "id": "jb1tl3x",
            "parent_id": "t1_jb1bocl",
            "score": 1,
            "created_utc": 1678046531.0,
            "replies": []
        },
        {
            "body": "I appreciate your sentiment! I was definitely sexually attracted to them, and we generally shared the same sex drive, but every now and then, I’d just prefer quality time minus sex because I actually liked them. The issue was the expectation of sex every time we met because of me receiving gifts and money. Like, we can’t just watch a couple of movies or cook dinner together.\n\nIf this expectation had been explained to me when discussing the arrangement, I could’ve realized we aren’t compatible and suggested that we not waste each other’s time.\n\nI was young and new and without much guidance, so I wasn’t aware of how things can be (I hadn’t done much vanilla dating back then, either lol), and honestly, I wasn’t good at standing up for myself. Error on my part.\n\nAll in all, I had my lessons learned, and I’m a better and more knowledgeable person for it.\n\nAgain, I deeply appreciate your sentiment!",
            "author": "TheEbonyFemmeFatale",
            "id": "jb2f49g",
            "parent_id": "t1_jb1s1dq",
            "score": 3,
            "created_utc": 1678055593.0,
            "replies": []
        },
        {
            "body": "> Let's not make this a man vs woman thing-\n\nDoes the very subject of the post not already do that to a degree?",
            "author": "FLRAdvocate",
            "id": "jay06xo",
            "parent_id": "t1_jaxznpt",
            "score": 5,
            "created_utc": 1677971007.0,
            "replies": [
                {
                    "body": "Yeah. That’s why I didn’t answer the question. But the “problem” isn’t that one group is shamed while the other isn’t. It’s that anyone thinks that shaming is the answer.",
                    "author": "HarvardLawSB",
                    "id": "jay0d8b",
                    "parent_id": "t1_jay06xo",
                    "score": 12,
                    "created_utc": 1677971087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, I think SA's marketing is now creating SDs who aren't intentionally manipulative. The marketing makes it seem like it's just vanilla dating with benefits, but no explicit allowance or PPM. They're advertising a Gifts and Experiences type of dating experience, so it's not going to be long until some of this marketing works on men who don't know SA's past and they come to the site looking for women who want to go out on fancy dates / trips for intimacy...\n\nBut yes, there are still lots of SDs who know about arrangements that still play dumb and try to scam/rinse, which is unfortunate! There's also girls on the other side of this who promise intimacy and don't hold up their end of the deal when they get their allowance. 😕\n\nTWSD",
            "author": "3WaySD",
            "id": "jay3iqr",
            "parent_id": "t1_jaxzfv5",
            "score": 6,
            "created_utc": 1677972533.0,
            "replies": []
        },
        {
            "body": ">Good post, was going to say same.\n\nThanks!\n\n&#x200B;\n\n>Maybe the result of the two scenarios is ultimately similar, but intent matters and naive is not nearly as bad as intentionally manipulative imo\n\nTrue. all things being equal, they have the same context. But digging deeper, the intent is usually different. I've had conversations with so-called platonic SB, some of them so naively believe that all real SR are platonic and that any guy that wants sex and is offering an allowance is looking for a prostitute. Unless thats some type of negging manipulation used by some, it seems to be universally believed by many women that sugar is some type of charity / sponsorship / mentor BS.",
            "author": "NickPfromYuma",
            "id": "jay0y6l",
            "parent_id": "t1_jaxzfv5",
            "score": 4,
            "created_utc": 1677971353.0,
            "replies": []
        },
        {
            "body": "> Some are just scammers by nature.\n\ntrue, but scammers usually imply theres to be intimacy. Unless you're talking about online only scammers.",
            "author": "NickPfromYuma",
            "id": "jay0iek",
            "parent_id": "t1_jay06kq",
            "score": 10,
            "created_utc": 1677971152.0,
            "replies": []
        },
        {
            "body": "I know back when I told my best friend I thought I might do this she send me a ton of videos on how to delay intimacy and manipulate the guy for money. Essentially milking out as much as possible. Has to really question for a while if my own best friend knew me if she thought I could be so fake to someone. \n\nEspecially since these videos were all saying drop them if you couldn’t get anymore without intimacy because they were using it like a carrot on a stick",
            "author": "ArcadiaFey",
            "id": "jb08u1c",
            "parent_id": "t1_jay06kq",
            "score": 2,
            "created_utc": 1678021315.0,
            "replies": [
                {
                    "body": "Sex only benefits the Man in these relationships so it’s not a bad idea to make sure you get your needs meet first before letting everyone POT pump & dump you!",
                    "author": "Nefarious_evee",
                    "id": "jb1aamj",
                    "parent_id": "t1_jb08u1c",
                    "score": 0,
                    "created_utc": 1678038803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And daddy is afinancial - perfect.",
            "author": "Dry-Hat7524",
            "id": "jbxvvrr",
            "parent_id": "t1_jbxq20h",
            "score": 1,
            "created_utc": 1678636671.0,
            "replies": []
        },
        {
            "body": "I see I’ve stroke a nerve on you buddy. I’m actually engaged now to my sugar daddy of 4 years but I’m glad you got that out of your system 🫶🏾",
            "author": "exotica3333",
            "id": "jayjjbb",
            "parent_id": "t1_jayj50m",
            "score": -1,
            "created_utc": 1677980202.0,
            "replies": [
                {
                    "body": "Rinser alert. Lol",
                    "author": "Canadian_SD",
                    "id": "jaykryb",
                    "parent_id": "t1_jayjjbb",
                    "score": 4,
                    "created_utc": 1677980825.0,
                    "replies": [
                        {
                            "body": "Facts.  Lol. Guys who can't get hard are the ones who CAN'T have sex. \n\nNo man with a hard dick is doing this shit",
                            "author": null,
                            "id": "jaz9aty",
                            "parent_id": "t1_jaykryb",
                            "score": 1,
                            "created_utc": 1677993995.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jazmdx6",
                    "parent_id": "t1_jayjjbb",
                    "score": 1,
                    "created_utc": 1678003157.0,
                    "replies": [
                        {
                            "body": "💯",
                            "author": "Professional-Dirt856",
                            "id": "jazncxn",
                            "parent_id": "t1_jazmdx6",
                            "score": 1,
                            "created_utc": 1678003945.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i’m sorry but even with ED a BJ would still feel amazing 😈😂",
            "author": "NickPfromYuma",
            "id": "jb1espl",
            "parent_id": "t1_jaz921f",
            "score": 1,
            "created_utc": 1678040515.0,
            "replies": []
        },
        {
            "body": "Surely that's only true if you believe an SR can only be an SR if it includes sex, so I'm wondering why you posted the question?",
            "author": "Sunhillian",
            "id": "jayq080",
            "parent_id": "t1_jaypo0x",
            "score": 3,
            "created_utc": 1677983451.0,
            "replies": [
                {
                    "body": "This would be like a SB talking about how she doesn’t get any financial assistance, gifts or mentorship from a guy she sleeps that. But he’s her SD. Uhh nope. That’s a FWB situation, not a SR.\n\nThe word “Sugar” has a meaning in this context. What you described is not an “SR”, plain and simple.",
                    "author": "Canadian_SD",
                    "id": "jayskoj",
                    "parent_id": "t1_jayq080",
                    "score": -1,
                    "created_utc": 1677984751.0,
                    "replies": [
                        {
                            "body": "If she's giving sex in exchange for mentorship with no finance, that's an SR in your book? That's the FWB no?\n\nThere are escorts that meet guys often where no sex is involved. Does that mean they're not escorting on that date? \n\nSurely its not the absence of sex that rules it out as an SR, it would be the absence of finance? \n\nGenuine question, not argumentative for the sake of it 🤷",
                            "author": "Sunhillian",
                            "id": "jaytxu5",
                            "parent_id": "t1_jayskoj",
                            "score": 4,
                            "created_utc": 1677985451.0,
                            "replies": [
                                {
                                    "body": "Yes, the absence sex makes it not a an SR.\n\nYes, the absence sex makes it not prostitution.\n\nBuddy, this isn’t rocket science",
                                    "author": "Canadian_SD",
                                    "id": "jayug0g",
                                    "parent_id": "t1_jaytxu5",
                                    "score": 2,
                                    "created_utc": 1677985711.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "jayji5m",
            "parent_id": "t1_jayi13g",
            "score": -3,
            "created_utc": 1677980186.0,
            "replies": [
                {
                    "body": "As long as you're not expecting payment from a SD while you play hard to get. If I wanted a challenge, I'd still be married lol.",
                    "author": "TexasSD",
                    "id": "jaz3omv",
                    "parent_id": "t1_jayji5m",
                    "score": 2,
                    "created_utc": 1677990709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SB: “What a coincidence, I don’t date unattractive men regardless of their wallet.”",
            "author": "yourfriendhello",
            "id": "jdb1p3j",
            "parent_id": "t1_jdb0zeb",
            "score": 1,
            "created_utc": 1679539037.0,
            "replies": [
                {
                    "body": "Then in that case there’s no problem. SD gets no action. SB gets no financial support. Fair and equal.",
                    "author": "Canadian_SD",
                    "id": "jdb3937",
                    "parent_id": "t1_jdb1p3j",
                    "score": 3,
                    "created_utc": 1679539777.0,
                    "replies": [
                        {
                            "body": "You’re missing the point.\n\nShe’s platonic for you because she’s not attracted to you.\n\nShe’s obviously having sex with men she’s attracted to.",
                            "author": "yourfriendhello",
                            "id": "jdb3mm3",
                            "parent_id": "t1_jdb3937",
                            "score": 1,
                            "created_utc": 1679539956.0,
                            "replies": [
                                {
                                    "body": "You’re missing the point Mr. Troll.\n\nNothing wrong with “platonic”. SB is free to choose platonic. But in response, SD isn’t going to pay. Simple and fair.\n\nThis isn’t Tinder my boy. 50 year old SDs aren’t signing up for seeking-arrangements, because they think some hot 20 year is going to find them attractive. So that’s irrelevant. They are exchanging $ for an arrangement.\n\nI don’t know if my mid 20s SB is “attracted” to me. But she plays her part, and I play mine.",
                                    "author": "Canadian_SD",
                                    "id": "jdb8apg",
                                    "parent_id": "t1_jdb3mm3",
                                    "score": 2,
                                    "created_utc": 1679542286.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
                                            "author": "yourfriendhello",
                                            "id": "jdb94x5",
                                            "parent_id": "t1_jdb8apg",
                                            "score": 1,
                                            "created_utc": 1679542727.0,
                                            "replies": [
                                                {
                                                    "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                                                    "author": "Canadian_SD",
                                                    "id": "jdbdcrg",
                                                    "parent_id": "t1_jdb94x5",
                                                    "score": 3,
                                                    "created_utc": 1679545072.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But Nick is correct.  If you consider that they want to swap sex with no sex, what would you swap money?  No money?  Sex can be enjoyable for both people, but you give money .... Is that enjoyable?  It is a win win for them to not want sex.  Plenty of girls volunteer to be taken out to eat for free and you don't need to be on seeking for that.",
            "author": "bthdk85",
            "id": "jayny9f",
            "parent_id": "t1_jayl8mv",
            "score": 8,
            "created_utc": 1677982429.0,
            "replies": [
                {
                    "body": "Swap money with no money.  Vanilla dates.  Yes.  It is not manipulative for a man to ask a woman out for a non-financial date.  Not what I want to see on seeking, sure.\n\nSBs can manipulate.  SDs can be misguided and naive.\n\nThe suggestion appears to be that the SD will always be the creeper and the SB will always be the innocent.",
                    "author": "Beginning_Pear_2231",
                    "id": "jayopem",
                    "parent_id": "t1_jayny9f",
                    "score": 10,
                    "created_utc": 1677982809.0,
                    "replies": [
                        {
                            "body": "Then you should go on a normal dating website if that's what you want or go creat simping.com \n\nIn one breath you called SD can be manipulative and SB can be naive, then on the same breath being ok with that.  It is a creeper for SD to demand sugar then what do you call SB who is not holding to their end? A gold digger?",
                            "author": "bthdk85",
                            "id": "jayp7rg",
                            "parent_id": "t1_jayopem",
                            "score": 0,
                            "created_utc": 1677983061.0,
                            "replies": [
                                {
                                    "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
                                    "author": "Beginning_Pear_2231",
                                    "id": "jayq5o0",
                                    "parent_id": "t1_jayp7rg",
                                    "score": 7,
                                    "created_utc": 1677983526.0,
                                    "replies": [
                                        {
                                            "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                                            "author": "Snoo71180",
                                            "id": "jb0e0ol",
                                            "parent_id": "t1_jayq5o0",
                                            "score": 3,
                                            "created_utc": 1678024396.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                                            "author": "Glum_Self7991",
                                            "id": "jbuz6gu",
                                            "parent_id": "t1_jayq5o0",
                                            "score": 1,
                                            "created_utc": 1678574572.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my GOODness! Thank you!!!",
            "author": "TheEbonyFemmeFatale",
            "id": "jc15pyd",
            "parent_id": "t1_jb1pr36",
            "score": 3,
            "created_utc": 1678694203.0,
            "replies": []
        },
        {
            "body": "I think they’re referring to experience- or travel-oriented sugar babies, who want those things rather than money.",
            "author": "olivinemultichrome",
            "id": "jazgyr9",
            "parent_id": "t1_jazch5k",
            "score": 6,
            "created_utc": 1677998963.0,
            "replies": []
        },
        {
            "body": "I’m totally ok with that",
            "author": "HighOnGoofballs",
            "id": "jb0m1ms",
            "parent_id": "t1_jb0lb26",
            "score": 3,
            "created_utc": 1678028420.0,
            "replies": []
        },
        {
            "body": "A fan sending an OnlyFans girl a vibrator doesn’t pay her bills.",
            "author": "DumbleSD",
            "id": "jayp1fc",
            "parent_id": "t1_jayo1uq",
            "score": 12,
            "created_utc": 1677982973.0,
            "replies": [
                {
                    "body": "Why don't you buy her a Tesla? That doesn't pay the bill so it doesn't count. Or buy her a house.  It doesn't pay the bill so it doesn't count.",
                    "author": "bthdk85",
                    "id": "jaypc99",
                    "parent_id": "t1_jayp1fc",
                    "score": 0,
                    "created_utc": 1677983124.0,
                    "replies": [
                        {
                            "body": "I’m not buying an OnlyFans girl a coffee at Panera, because I’m not interested in that, but,again, a couple of losers in their basements buying her low value items has zero to do with sugar.",
                            "author": "DumbleSD",
                            "id": "jayw9l7",
                            "parent_id": "t1_jaypc99",
                            "score": 5,
                            "created_utc": 1677986658.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "jaywkj7",
                                    "parent_id": "t1_jayw9l7",
                                    "score": -2,
                                    "created_utc": 1677986818.0,
                                    "replies": [
                                        {
                                            "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                                            "author": "Intrepid_Egg_7722",
                                            "id": "jaz165w",
                                            "parent_id": "t1_jaywkj7",
                                            "score": 3,
                                            "created_utc": 1677989283.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                                            "author": "DumbleSD",
                                            "id": "jaz0njq",
                                            "parent_id": "t1_jaywkj7",
                                            "score": 2,
                                            "created_utc": 1677989007.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not every man is thirsty and too horny for his own good on this sites. Some good men like treating their ladies and get rewarded unlike y’all",
            "author": "Nefarious_evee",
            "id": "jb19vj2",
            "parent_id": "t1_jayo1uq",
            "score": 3,
            "created_utc": 1678038636.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣🤣\nOh yes....damn those Simps for sending gifts to chicks that they are interested in.\n\nIt just means YOU actually have to put some work and a little  bit of effort, to get that same level of attn.",
            "author": "JustAsk4Alice",
            "id": "jb1t8nv",
            "parent_id": "t1_jayo1uq",
            "score": 2,
            "created_utc": 1678046386.0,
            "replies": []
        },
        {
            "body": "Yeah. That’s why I didn’t answer the question. But the “problem” isn’t that one group is shamed while the other isn’t. It’s that anyone thinks that shaming is the answer.",
            "author": "HarvardLawSB",
            "id": "jay0d8b",
            "parent_id": "t1_jay06xo",
            "score": 12,
            "created_utc": 1677971087.0,
            "replies": []
        },
        {
            "body": "Sex only benefits the Man in these relationships so it’s not a bad idea to make sure you get your needs meet first before letting everyone POT pump & dump you!",
            "author": "Nefarious_evee",
            "id": "jb1aamj",
            "parent_id": "t1_jb08u1c",
            "score": 0,
            "created_utc": 1678038803.0,
            "replies": []
        },
        {
            "body": "Rinser alert. Lol",
            "author": "Canadian_SD",
            "id": "jaykryb",
            "parent_id": "t1_jayjjbb",
            "score": 4,
            "created_utc": 1677980825.0,
            "replies": [
                {
                    "body": "Facts.  Lol. Guys who can't get hard are the ones who CAN'T have sex. \n\nNo man with a hard dick is doing this shit",
                    "author": null,
                    "id": "jaz9aty",
                    "parent_id": "t1_jaykryb",
                    "score": 1,
                    "created_utc": 1677993995.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jazmdx6",
            "parent_id": "t1_jayjjbb",
            "score": 1,
            "created_utc": 1678003157.0,
            "replies": [
                {
                    "body": "💯",
                    "author": "Professional-Dirt856",
                    "id": "jazncxn",
                    "parent_id": "t1_jazmdx6",
                    "score": 1,
                    "created_utc": 1678003945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This would be like a SB talking about how she doesn’t get any financial assistance, gifts or mentorship from a guy she sleeps that. But he’s her SD. Uhh nope. That’s a FWB situation, not a SR.\n\nThe word “Sugar” has a meaning in this context. What you described is not an “SR”, plain and simple.",
            "author": "Canadian_SD",
            "id": "jayskoj",
            "parent_id": "t1_jayq080",
            "score": -1,
            "created_utc": 1677984751.0,
            "replies": [
                {
                    "body": "If she's giving sex in exchange for mentorship with no finance, that's an SR in your book? That's the FWB no?\n\nThere are escorts that meet guys often where no sex is involved. Does that mean they're not escorting on that date? \n\nSurely its not the absence of sex that rules it out as an SR, it would be the absence of finance? \n\nGenuine question, not argumentative for the sake of it 🤷",
                    "author": "Sunhillian",
                    "id": "jaytxu5",
                    "parent_id": "t1_jayskoj",
                    "score": 4,
                    "created_utc": 1677985451.0,
                    "replies": [
                        {
                            "body": "Yes, the absence sex makes it not a an SR.\n\nYes, the absence sex makes it not prostitution.\n\nBuddy, this isn’t rocket science",
                            "author": "Canadian_SD",
                            "id": "jayug0g",
                            "parent_id": "t1_jaytxu5",
                            "score": 2,
                            "created_utc": 1677985711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As long as you're not expecting payment from a SD while you play hard to get. If I wanted a challenge, I'd still be married lol.",
            "author": "TexasSD",
            "id": "jaz3omv",
            "parent_id": "t1_jayji5m",
            "score": 2,
            "created_utc": 1677990709.0,
            "replies": []
        },
        {
            "body": "Then in that case there’s no problem. SD gets no action. SB gets no financial support. Fair and equal.",
            "author": "Canadian_SD",
            "id": "jdb3937",
            "parent_id": "t1_jdb1p3j",
            "score": 3,
            "created_utc": 1679539777.0,
            "replies": [
                {
                    "body": "You’re missing the point.\n\nShe’s platonic for you because she’s not attracted to you.\n\nShe’s obviously having sex with men she’s attracted to.",
                    "author": "yourfriendhello",
                    "id": "jdb3mm3",
                    "parent_id": "t1_jdb3937",
                    "score": 1,
                    "created_utc": 1679539956.0,
                    "replies": [
                        {
                            "body": "You’re missing the point Mr. Troll.\n\nNothing wrong with “platonic”. SB is free to choose platonic. But in response, SD isn’t going to pay. Simple and fair.\n\nThis isn’t Tinder my boy. 50 year old SDs aren’t signing up for seeking-arrangements, because they think some hot 20 year is going to find them attractive. So that’s irrelevant. They are exchanging $ for an arrangement.\n\nI don’t know if my mid 20s SB is “attracted” to me. But she plays her part, and I play mine.",
                            "author": "Canadian_SD",
                            "id": "jdb8apg",
                            "parent_id": "t1_jdb3mm3",
                            "score": 2,
                            "created_utc": 1679542286.0,
                            "replies": [
                                {
                                    "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
                                    "author": "yourfriendhello",
                                    "id": "jdb94x5",
                                    "parent_id": "t1_jdb8apg",
                                    "score": 1,
                                    "created_utc": 1679542727.0,
                                    "replies": [
                                        {
                                            "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                                            "author": "Canadian_SD",
                                            "id": "jdbdcrg",
                                            "parent_id": "t1_jdb94x5",
                                            "score": 3,
                                            "created_utc": 1679545072.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Swap money with no money.  Vanilla dates.  Yes.  It is not manipulative for a man to ask a woman out for a non-financial date.  Not what I want to see on seeking, sure.\n\nSBs can manipulate.  SDs can be misguided and naive.\n\nThe suggestion appears to be that the SD will always be the creeper and the SB will always be the innocent.",
            "author": "Beginning_Pear_2231",
            "id": "jayopem",
            "parent_id": "t1_jayny9f",
            "score": 10,
            "created_utc": 1677982809.0,
            "replies": [
                {
                    "body": "Then you should go on a normal dating website if that's what you want or go creat simping.com \n\nIn one breath you called SD can be manipulative and SB can be naive, then on the same breath being ok with that.  It is a creeper for SD to demand sugar then what do you call SB who is not holding to their end? A gold digger?",
                    "author": "bthdk85",
                    "id": "jayp7rg",
                    "parent_id": "t1_jayopem",
                    "score": 0,
                    "created_utc": 1677983061.0,
                    "replies": [
                        {
                            "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
                            "author": "Beginning_Pear_2231",
                            "id": "jayq5o0",
                            "parent_id": "t1_jayp7rg",
                            "score": 7,
                            "created_utc": 1677983526.0,
                            "replies": [
                                {
                                    "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                                    "author": "Snoo71180",
                                    "id": "jb0e0ol",
                                    "parent_id": "t1_jayq5o0",
                                    "score": 3,
                                    "created_utc": 1678024396.0,
                                    "replies": []
                                },
                                {
                                    "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                                    "author": "Glum_Self7991",
                                    "id": "jbuz6gu",
                                    "parent_id": "t1_jayq5o0",
                                    "score": 1,
                                    "created_utc": 1678574572.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why don't you buy her a Tesla? That doesn't pay the bill so it doesn't count. Or buy her a house.  It doesn't pay the bill so it doesn't count.",
            "author": "bthdk85",
            "id": "jaypc99",
            "parent_id": "t1_jayp1fc",
            "score": 0,
            "created_utc": 1677983124.0,
            "replies": [
                {
                    "body": "I’m not buying an OnlyFans girl a coffee at Panera, because I’m not interested in that, but,again, a couple of losers in their basements buying her low value items has zero to do with sugar.",
                    "author": "DumbleSD",
                    "id": "jayw9l7",
                    "parent_id": "t1_jaypc99",
                    "score": 5,
                    "created_utc": 1677986658.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "jaywkj7",
                            "parent_id": "t1_jayw9l7",
                            "score": -2,
                            "created_utc": 1677986818.0,
                            "replies": [
                                {
                                    "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                                    "author": "Intrepid_Egg_7722",
                                    "id": "jaz165w",
                                    "parent_id": "t1_jaywkj7",
                                    "score": 3,
                                    "created_utc": 1677989283.0,
                                    "replies": []
                                },
                                {
                                    "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                                    "author": "DumbleSD",
                                    "id": "jaz0njq",
                                    "parent_id": "t1_jaywkj7",
                                    "score": 2,
                                    "created_utc": 1677989007.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Facts.  Lol. Guys who can't get hard are the ones who CAN'T have sex. \n\nNo man with a hard dick is doing this shit",
            "author": null,
            "id": "jaz9aty",
            "parent_id": "t1_jaykryb",
            "score": 1,
            "created_utc": 1677993995.0,
            "replies": []
        },
        {
            "body": "💯",
            "author": "Professional-Dirt856",
            "id": "jazncxn",
            "parent_id": "t1_jazmdx6",
            "score": 1,
            "created_utc": 1678003945.0,
            "replies": []
        },
        {
            "body": "If she's giving sex in exchange for mentorship with no finance, that's an SR in your book? That's the FWB no?\n\nThere are escorts that meet guys often where no sex is involved. Does that mean they're not escorting on that date? \n\nSurely its not the absence of sex that rules it out as an SR, it would be the absence of finance? \n\nGenuine question, not argumentative for the sake of it 🤷",
            "author": "Sunhillian",
            "id": "jaytxu5",
            "parent_id": "t1_jayskoj",
            "score": 4,
            "created_utc": 1677985451.0,
            "replies": [
                {
                    "body": "Yes, the absence sex makes it not a an SR.\n\nYes, the absence sex makes it not prostitution.\n\nBuddy, this isn’t rocket science",
                    "author": "Canadian_SD",
                    "id": "jayug0g",
                    "parent_id": "t1_jaytxu5",
                    "score": 2,
                    "created_utc": 1677985711.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re missing the point.\n\nShe’s platonic for you because she’s not attracted to you.\n\nShe’s obviously having sex with men she’s attracted to.",
            "author": "yourfriendhello",
            "id": "jdb3mm3",
            "parent_id": "t1_jdb3937",
            "score": 1,
            "created_utc": 1679539956.0,
            "replies": [
                {
                    "body": "You’re missing the point Mr. Troll.\n\nNothing wrong with “platonic”. SB is free to choose platonic. But in response, SD isn’t going to pay. Simple and fair.\n\nThis isn’t Tinder my boy. 50 year old SDs aren’t signing up for seeking-arrangements, because they think some hot 20 year is going to find them attractive. So that’s irrelevant. They are exchanging $ for an arrangement.\n\nI don’t know if my mid 20s SB is “attracted” to me. But she plays her part, and I play mine.",
                    "author": "Canadian_SD",
                    "id": "jdb8apg",
                    "parent_id": "t1_jdb3mm3",
                    "score": 2,
                    "created_utc": 1679542286.0,
                    "replies": [
                        {
                            "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
                            "author": "yourfriendhello",
                            "id": "jdb94x5",
                            "parent_id": "t1_jdb8apg",
                            "score": 1,
                            "created_utc": 1679542727.0,
                            "replies": [
                                {
                                    "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                                    "author": "Canadian_SD",
                                    "id": "jdbdcrg",
                                    "parent_id": "t1_jdb94x5",
                                    "score": 3,
                                    "created_utc": 1679545072.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then you should go on a normal dating website if that's what you want or go creat simping.com \n\nIn one breath you called SD can be manipulative and SB can be naive, then on the same breath being ok with that.  It is a creeper for SD to demand sugar then what do you call SB who is not holding to their end? A gold digger?",
            "author": "bthdk85",
            "id": "jayp7rg",
            "parent_id": "t1_jayopem",
            "score": 0,
            "created_utc": 1677983061.0,
            "replies": [
                {
                    "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
                    "author": "Beginning_Pear_2231",
                    "id": "jayq5o0",
                    "parent_id": "t1_jayp7rg",
                    "score": 7,
                    "created_utc": 1677983526.0,
                    "replies": [
                        {
                            "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                            "author": "Snoo71180",
                            "id": "jb0e0ol",
                            "parent_id": "t1_jayq5o0",
                            "score": 3,
                            "created_utc": 1678024396.0,
                            "replies": []
                        },
                        {
                            "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                            "author": "Glum_Self7991",
                            "id": "jbuz6gu",
                            "parent_id": "t1_jayq5o0",
                            "score": 1,
                            "created_utc": 1678574572.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not buying an OnlyFans girl a coffee at Panera, because I’m not interested in that, but,again, a couple of losers in their basements buying her low value items has zero to do with sugar.",
            "author": "DumbleSD",
            "id": "jayw9l7",
            "parent_id": "t1_jaypc99",
            "score": 5,
            "created_utc": 1677986658.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "jaywkj7",
                    "parent_id": "t1_jayw9l7",
                    "score": -2,
                    "created_utc": 1677986818.0,
                    "replies": [
                        {
                            "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                            "author": "Intrepid_Egg_7722",
                            "id": "jaz165w",
                            "parent_id": "t1_jaywkj7",
                            "score": 3,
                            "created_utc": 1677989283.0,
                            "replies": []
                        },
                        {
                            "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                            "author": "DumbleSD",
                            "id": "jaz0njq",
                            "parent_id": "t1_jaywkj7",
                            "score": 2,
                            "created_utc": 1677989007.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, the absence sex makes it not a an SR.\n\nYes, the absence sex makes it not prostitution.\n\nBuddy, this isn’t rocket science",
            "author": "Canadian_SD",
            "id": "jayug0g",
            "parent_id": "t1_jaytxu5",
            "score": 2,
            "created_utc": 1677985711.0,
            "replies": []
        },
        {
            "body": "You’re missing the point Mr. Troll.\n\nNothing wrong with “platonic”. SB is free to choose platonic. But in response, SD isn’t going to pay. Simple and fair.\n\nThis isn’t Tinder my boy. 50 year old SDs aren’t signing up for seeking-arrangements, because they think some hot 20 year is going to find them attractive. So that’s irrelevant. They are exchanging $ for an arrangement.\n\nI don’t know if my mid 20s SB is “attracted” to me. But she plays her part, and I play mine.",
            "author": "Canadian_SD",
            "id": "jdb8apg",
            "parent_id": "t1_jdb3mm3",
            "score": 2,
            "created_utc": 1679542286.0,
            "replies": [
                {
                    "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
                    "author": "yourfriendhello",
                    "id": "jdb94x5",
                    "parent_id": "t1_jdb8apg",
                    "score": 1,
                    "created_utc": 1679542727.0,
                    "replies": [
                        {
                            "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                            "author": "Canadian_SD",
                            "id": "jdbdcrg",
                            "parent_id": "t1_jdb94x5",
                            "score": 3,
                            "created_utc": 1679545072.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry, what?  Nick was saying the SD can be manipulative and the SB can be naïve.  I suggest the flip side can also be true.  Calling \"I don't want anything financial\" as manipulative seemed ludicrous since that's what vanilla dating is.  Simping is giving money with nothing of substance in return.\n\nI am pursuing sugar because I'm not in a place where vanilla fits.  I want to find a complementary arrangement.  I want sex.  I want to provide.  Platonic only on seeking sucks.  Online only on seeking sucks.  Splenda daddies and salt daddies suck.  People who polarize suck.",
            "author": "Beginning_Pear_2231",
            "id": "jayq5o0",
            "parent_id": "t1_jayp7rg",
            "score": 7,
            "created_utc": 1677983526.0,
            "replies": [
                {
                    "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
                    "author": "Snoo71180",
                    "id": "jb0e0ol",
                    "parent_id": "t1_jayq5o0",
                    "score": 3,
                    "created_utc": 1678024396.0,
                    "replies": []
                },
                {
                    "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
                    "author": "Glum_Self7991",
                    "id": "jbuz6gu",
                    "parent_id": "t1_jayq5o0",
                    "score": 1,
                    "created_utc": 1678574572.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "jaywkj7",
            "parent_id": "t1_jayw9l7",
            "score": -2,
            "created_utc": 1677986818.0,
            "replies": [
                {
                    "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
                    "author": "Intrepid_Egg_7722",
                    "id": "jaz165w",
                    "parent_id": "t1_jaywkj7",
                    "score": 3,
                    "created_utc": 1677989283.0,
                    "replies": []
                },
                {
                    "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
                    "author": "DumbleSD",
                    "id": "jaz0njq",
                    "parent_id": "t1_jaywkj7",
                    "score": 2,
                    "created_utc": 1677989007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for conceding.\n\nSeeking is Tinder+ hence your lack of success.",
            "author": "yourfriendhello",
            "id": "jdb94x5",
            "parent_id": "t1_jdb8apg",
            "score": 1,
            "created_utc": 1679542727.0,
            "replies": [
                {
                    "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
                    "author": "Canadian_SD",
                    "id": "jdbdcrg",
                    "parent_id": "t1_jdb94x5",
                    "score": 3,
                    "created_utc": 1679545072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True 100%.  Beginning\\_Pear is right except for staying \"they both should stay off seeking\".  The context is SD's want something sexual and SB's want financial benefit right? That's the foundation of seeking so why would you wish those people would stay off of the site?  That's the basis of the whole thing.\n\nTo clarify for bthdk85 though a SB who doesn't hold up her end of the arrangement is called a fraud and likely is trying to make a living off of extorting men.  A gold digger is a woman who doesn't have an arrangement or some agreed upon financially beneficial situation who  pursues / dates / hooks up with men with a plan to use him for his money only.  SB's are very closely related but it's not the same.  I've come across SB's that made fraud / extortion their full time jobs which was a mistake because they went to jail.  No joke \n\nIt's so simple to the point that if you don't understand the following then your motives & intelligence are very questionable.......... if you're not wanting anything physical as a SB, or not willing to contribute financially as a SD don't get on that site.  It's that basic",
            "author": "Snoo71180",
            "id": "jb0e0ol",
            "parent_id": "t1_jayq5o0",
            "score": 3,
            "created_utc": 1678024396.0,
            "replies": []
        },
        {
            "body": "100% agree pear.  You’re right the manipulation is largely in that direction.  I’m pretty transparent with what I expect and what I provide and I constantly have to deal with manipulation.  But I also try as weed them out as much and quickly as possible.  Very very seldom have I found a good sb that isn’t just constantly trying to get more and more and provide as little as possible",
            "author": "Glum_Self7991",
            "id": "jbuz6gu",
            "parent_id": "t1_jayq5o0",
            "score": 1,
            "created_utc": 1678574572.0,
            "replies": []
        },
        {
            "body": "Holy shit, you really twisted yourself into a pretzel to miss his point, didn't you?",
            "author": "Intrepid_Egg_7722",
            "id": "jaz165w",
            "parent_id": "t1_jaywkj7",
            "score": 3,
            "created_utc": 1677989283.0,
            "replies": []
        },
        {
            "body": "Umm… I don’t know how to more clearly tell you that I’m not a simp or paypig.  When did I say I do either of those things?   Learn to read and maybe someday you’ll have the money to be an SD like a real man.",
            "author": "DumbleSD",
            "id": "jaz0njq",
            "parent_id": "t1_jaywkj7",
            "score": 2,
            "created_utc": 1677989007.0,
            "replies": []
        },
        {
            "body": "Hahahah. My boy, I have no idea what you’re talking. Seeking has been great for me :)\n\nI guess you must be projecting or something. With your attitude, I’m not surprised you’re having difficulty. Lol",
            "author": "Canadian_SD",
            "id": "jdbdcrg",
            "parent_id": "t1_jdb94x5",
            "score": 3,
            "created_utc": 1679545072.0,
            "replies": []
        }
    ]
}