{
    "title": "How to Style an Undercut. Everything You Need: From What to Tell Your Barber to How To Add Volume To Your Hair.",
    "post_id": "63du6f",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/63du6f/how_to_style_an_undercut_everything_you_need_from/",
    "author": "LastToon",
    "body": "",
    "url": "https://enadio.com/mens-short-hairstyles/",
    "score": 335,
    "upvote_ratio": 0.96,
    "created_utc": 1491309440.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Step one .. have a straight hairline.\n\nWelp, I'm out.",
            "author": "dcbrah",
            "id": "dftiafm",
            "parent_id": "t3_63du6f",
            "score": 59,
            "created_utc": 1491320668.0,
            "replies": [
                {
                    "body": "Depends on how uneven your hairline is, but a side part variation of the cut described in the article can work well even with receding hairlines: [1](https://s-media-cache-ak0.pinimg.com/564x/ea/8c/3a/ea8c3a724cd8f181f1e8ededb6650811.jpg), [2](http://tradsalon.website/wp-content/uploads/2016/11/receding-hairline-undercut-with-regard-to-desire-proper-hair-for-official-event.jpg). Or so I tell myself.",
                    "author": "blorgon",
                    "id": "dfuo024",
                    "parent_id": "t1_dftiafm",
                    "score": 8,
                    "created_utc": 1491370372.0,
                    "replies": [
                        {
                            "body": "Yes exactly!",
                            "author": "LastToon",
                            "id": "dfuulqs",
                            "parent_id": "t1_dfuo024",
                            "score": 2,
                            "created_utc": 1491388074.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Don't give up your dreams. Hair science gets better every day :) ",
                    "author": "Undercut_Advocate",
                    "id": "dftis8g",
                    "parent_id": "t1_dftiafm",
                    "score": 6,
                    "created_utc": 1491321191.0,
                    "replies": [
                        {
                            "body": "Not just that but a lot of these problems can be easily fixed by your barber and some are not even a problem. For example, if you are just saying you have a widows peak or another form of \"uneven hairline\" it will still look fine. But if you have a receding hairline there are different options",
                            "author": "LastToon",
                            "id": "dftjmie",
                            "parent_id": "t1_dftis8g",
                            "score": 13,
                            "created_utc": 1491322096.0,
                            "replies": []
                        },
                        {
                            "body": "All my faith in hair science. It's like a some sort of weird hope that is always at least 5 years away. ha.",
                            "author": "RZALECTA",
                            "id": "dftlwwm",
                            "parent_id": "t1_dftis8g",
                            "score": 2,
                            "created_utc": 1491324519.0,
                            "replies": []
                        },
                        {
                            "body": "Just like fusion energy!",
                            "author": "John_Wang",
                            "id": "dftzoeh",
                            "parent_id": "t1_dftis8g",
                            "score": 1,
                            "created_utc": 1491338996.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You don't need a straight hairline by any means, and neither do most people yet it works great for them. If you show me a picture if your hair I can help recommend a style for you. Plus this guide isn't just for one style it teaches techniques that apply to most styles such as adding volume.",
                    "author": "LastToon",
                    "id": "dftiufy",
                    "parent_id": "t1_dftiafm",
                    "score": 4,
                    "created_utc": 1491321256.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Finally a decent submission to this sub! I'm not really a fan of the hair style but these kind of in depth and knowledgeable articles are seriously lacking in this subreddit. ",
            "author": "naturally_paranoid",
            "id": "dfuiqs4",
            "parent_id": "t3_63du6f",
            "score": 9,
            "created_utc": 1491362001.0,
            "replies": [
                {
                    "body": "Thanks I really appreciate that. I always say I don't want to force a style on anyone. I just want to share techniques that will allow men to achieve their own styles and look the way they want.",
                    "author": "LastToon",
                    "id": "dfuj8pc",
                    "parent_id": "t1_dfuiqs4",
                    "score": 2,
                    "created_utc": 1491362678.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dfta39j",
            "parent_id": "t3_63du6f",
            "score": 7,
            "created_utc": 1491310456.0,
            "replies": [
                {
                    "body": "Glad you liked it! Yeah I would consider taking some length off it makes adding volume so much easier. Plus it takes less time to blow dry. ",
                    "author": "LastToon",
                    "id": "dfta9jc",
                    "parent_id": "t1_dfta39j",
                    "score": 1,
                    "created_utc": 1491310735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice",
            "author": "Shacrak4",
            "id": "dftoak1",
            "parent_id": "t3_63du6f",
            "score": 3,
            "created_utc": 1491327037.0,
            "replies": [
                {
                    "body": "Thanks glad you enjoyed it! Let me know if you have any questions or anything you want to know more about.",
                    "author": "LastToon",
                    "id": "dftop73",
                    "parent_id": "t1_dftoak1",
                    "score": 2,
                    "created_utc": 1491327467.0,
                    "replies": [
                        {
                            "body": "Any thoughts on where a guy can get a basic hair brush like [the one here](https://gfycat.com/RecentDemandingFruitfly)? That's my biggest problem right now, I just want a freakin' cheap brush. No where to be found.\n\nGreat article!!",
                            "author": "gyqo0348h",
                            "id": "dg5l1mf",
                            "parent_id": "t1_dftop73",
                            "score": 2,
                            "created_utc": 1491980025.0,
                            "replies": [
                                {
                                    "body": "Yeah you just want to make sure you have a curved vented brush. You can get expensive ones and you can get cheap ones. Honestly you can buy them at Walgreens, or any other store, for a few weeks dollars. Plus they are on amazon really cheap!",
                                    "author": "LastToon",
                                    "id": "dg5s0lt",
                                    "parent_id": "t1_dg5l1mf",
                                    "score": 2,
                                    "created_utc": 1491999269.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is there anyway to style this without all this effort? I was going to make my own post about it but posting it here seems apropos.\n\nI got an undercut by mistake(asked for a regular old fade). My old cut I was able to just brush into place out of the way, this one flops everywhere and generally looks \"off\". I hate pomades, creams, gels, pretty much any product in my hair. I don't have the time, the energy, or the know how. Should I just cut it off?",
            "author": null,
            "id": "dftrzy3",
            "parent_id": "t3_63du6f",
            "score": 3,
            "created_utc": 1491330953.0,
            "replies": [
                {
                    "body": "Yeah if you want absolutely no effort you really only have two options. The first being cutting it short enough where you don't need a blow dryer. This style will let you have air dried hair that just looks good and won't fall in your face all day. About how long is your hair on top right now? \n\nThe second option, and this is if you want absolutely no product, would he to comb or brush your hair straight back after showering. Doing this with wet hair will cause the hair to dry into this place and get a nice hold throughout the day. I do something similar to this on days where I am rushing and it gives a nice look. I would really recommend some product however especially if you are doing any type of manual labor or anything became you don't want your hair falling in your face. Even a little bit of product will go a long way. Let me know if this really answers your question. ",
                    "author": "LastToon",
                    "id": "dftslz8",
                    "parent_id": "t1_dftrzy3",
                    "score": 4,
                    "created_utc": 1491331600.0,
                    "replies": [
                        {
                            "body": "It does, and that's why I asked.\n\nMy old fade I could push the hair back with a bit of water and brush and it would stay. This one flops around. I live in Miami, the humidity is extreme and I don't want runny goop in my hair. My scalp is also extremely sensitive to shampoo and products in general so I prefer not to use them. Most products necessitate shampoo washing to remove them. That's just not an option with me, unfortunately. \n\nI think I'm just gonna cut it shorter. I have no idea how my barber confused a fade with an undercut.",
                            "author": null,
                            "id": "dftsutr",
                            "parent_id": "t1_dftslz8",
                            "score": 3,
                            "created_utc": 1491331861.0,
                            "replies": [
                                {
                                    "body": "Completely understand where you are coming from and yeah I would say the best bet is to cut it down shorter. I completely get what you are saying about being in Miami with product. I've experience very similar problems and a great solution would be water based products. Now these would also be great for you because they can was out with just water. No shampoo needed! Also you will not get that goop feeling if you use a good quality water based clay. Gels and pomades are notorious for being like that especially in humid environments. Again sorry to hear about you cut being messed up, but just try and make the best of it, its hair it will grow back soon enough",
                                    "author": "LastToon",
                                    "id": "dftud0j",
                                    "parent_id": "t1_dftsutr",
                                    "score": 2,
                                    "created_utc": 1491333452.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow this is amazing. Although I see this on many people, very few including barbers know or use proper terms in my experiece, so it becomes difficult explain or get the proper products. This was helpful.",
            "author": "IndianPhDStudent",
            "id": "dfty702",
            "parent_id": "t3_63du6f",
            "score": 3,
            "created_utc": 1491337451.0,
            "replies": [
                {
                    "body": "Thank glad you enjoyed it!",
                    "author": "LastToon",
                    "id": "dfu05vv",
                    "parent_id": "t1_dfty702",
                    "score": 1,
                    "created_utc": 1491339490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have a very large and stubborn cow lick at the very front of my hair, do you think a hairstyle like this would be able to work? Most things I've tried end up not working very well because my hair seems to be very stubborn and won't change the direction it naturally goes, and my hair naturally goes in like opposite directions so it makes doing anything very difficult ",
            "author": "jaskins811",
            "id": "dfuh6sk",
            "parent_id": "t3_63du6f",
            "score": 2,
            "created_utc": 1491360012.0,
            "replies": [
                {
                    "body": "Have you tried any of the techniques I mentioned? And no I honestly do not belive it will he a problem. Look at celebrities who have rocked this hairstyle: Paul Walker, Christian Bale, Brad Pitt, Jake Gyllenhaal, and Chris Hemsworth all of them have major cowlicks on the front of their head. It's all about managing the style and embracing your cowlick to make it work for you. ",
                    "author": "LastToon",
                    "id": "dfuj6x6",
                    "parent_id": "t1_dfuh6sk",
                    "score": 1,
                    "created_utc": 1491362609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So let me get this straight - use gel, heat protectant, and clay? Using so many products like that, styling your hair becomes more like spreading icing on a cake. Heaven forbid you ever have to wear a hat!!",
            "author": "BuboTitan",
            "id": "dfuhzmq",
            "parent_id": "t3_63du6f",
            "score": 2,
            "created_utc": 1491361011.0,
            "replies": [
                {
                    "body": "I honestly use everything I listed everyday and always get asked by guys and girls how my hair looks so natural. These products will not make your hair greasy or crunchy. This style does not even require hairspray so it's very easy to restyle throughout the day. I can completely see where you are coming from though.",
                    "author": "LastToon",
                    "id": "dfujero",
                    "parent_id": "t1_dfuhzmq",
                    "score": 1,
                    "created_utc": 1491362908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been an avid fan of Claymation for a few years now. I've been running a hairstyle like this for about a year now and never thought of using pre-gel. How important would you say that is to the final hair? I have natural volume in my hair so that is not a problem. I think I will definitely invest in the heat protectant tho",
            "author": "ahmedomar2015",
            "id": "dfuich2",
            "parent_id": "t3_63du6f",
            "score": 2,
            "created_utc": 1491361483.0,
            "replies": [
                {
                    "body": "The prestyler is mainly their too help add volume but it adds control too. It helps during the styling process and for me with very thick hair I personally always need some type of prestyler. If you like the way your hair is looking now I would say leave it out though. No reason to use it if you don't need it. But yeah try out the heat protectant you won't regret it!",
                    "author": "LastToon",
                    "id": "dfujbdu",
                    "parent_id": "t1_dfuich2",
                    "score": 2,
                    "created_utc": 1491362779.0,
                    "replies": [
                        {
                            "body": "Thanks man. Yeah I definitely have super thick hair so that's why I require a product such as Claymation with such strong hold. I'll for sure look into the pre styler as well now",
                            "author": "ahmedomar2015",
                            "id": "dfujqs2",
                            "parent_id": "t1_dfujbdu",
                            "score": 2,
                            "created_utc": 1491363380.0,
                            "replies": [
                                {
                                    "body": "No problem let me know how it all turns out!",
                                    "author": "LastToon",
                                    "id": "dfuk03w",
                                    "parent_id": "t1_dfujqs2",
                                    "score": 2,
                                    "created_utc": 1491363750.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some of those gifs were mesmerizing.",
            "author": "Fonzel",
            "id": "dfun3bh",
            "parent_id": "t3_63du6f",
            "score": 2,
            "created_utc": 1491368682.0,
            "replies": [
                {
                    "body": "Glad you enjoyed it!",
                    "author": "LastToon",
                    "id": "dfunaha",
                    "parent_id": "t1_dfun3bh",
                    "score": 1,
                    "created_utc": 1491369036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this! I think I might have a bottle of str8 somewhere which is really exciting.\n\nI have a few questions. My hair is thick, wavy, sometimes frizzy and already has enough body. It's very heavy so it tends to part down the middle half way through the day so I definitely need hairspray. How do you feel about using a flat iron too to keep things under control? Would American Crew fiber or Evo casual act be similar to the beeswax product or is it one of a kind? If it makes all the difference, I'd get the beeswax.",
            "author": "merkedis",
            "id": "dfwdjpo",
            "parent_id": "t3_63du6f",
            "score": 2,
            "created_utc": 1491459234.0,
            "replies": [
                {
                    "body": "No problem! That's great it's a perfect product for your hair type, thick, wavy, and frizzy. For sure try the hairspray and I would only use a flat iron for special occasions where you want to push your hair style to the next level. Not everyday. \n\nAs for the product, I would say hanz de fuko claymation is going to be the best option for you. It is an amazing product that gives you so much hold and texture that your hair will look amazing. There are a lot of alternatives but this will give you the best results. I would stay away from American crew based on what you said about your hair type.",
                    "author": "LastToon",
                    "id": "dfwm4h0",
                    "parent_id": "t1_dfwdjpo",
                    "score": 2,
                    "created_utc": 1491481818.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Question as I didn't see it listed in the blog, how long is the hair up top roughly?",
            "author": "bfrown",
            "id": "dgdfkg8",
            "parent_id": "t3_63du6f",
            "score": 2,
            "created_utc": 1492433115.0,
            "replies": [
                {
                    "body": "About 5-7 inches in the front and it tappers off towards the back",
                    "author": "LastToon",
                    "id": "dgdzjkc",
                    "parent_id": "t1_dgdfkg8",
                    "score": 1,
                    "created_utc": 1492457670.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can anyone attest to the $50 ~~pomade~~? That's pretty steep. \n\nExcuse me: ~ *Hanz de Fuko Claymation* ~",
            "author": "Devario",
            "id": "dfthdkq",
            "parent_id": "t3_63du6f",
            "score": 1,
            "created_utc": 1491319660.0,
            "replies": [
                {
                    "body": "What $50 pomade? There aren't even any pomade recommended haha. Regardless though a fair price for most hair clays is around $15-20 for your standard size jar",
                    "author": "LastToon",
                    "id": "dfthwbc",
                    "parent_id": "t1_dfthdkq",
                    "score": 5,
                    "created_utc": 1491320233.0,
                    "replies": []
                },
                {
                    "body": "A worthwhile investment my friend.",
                    "author": "Undercut_Advocate",
                    "id": "dftiraj",
                    "parent_id": "t1_dfthdkq",
                    "score": 2,
                    "created_utc": 1491321163.0,
                    "replies": [
                        {
                            "body": "While claymation is my favorite product I don't see why anyone would pay more than they need too. And the price is $20 on their website which is what I'd tell you to buy it for. \n\nMany people have told me that with shipping to places like Canada, hanz de fuko is too expensive so I recommend other products. ",
                            "author": "LastToon",
                            "id": "dftj2ix",
                            "parent_id": "t1_dftiraj",
                            "score": 2,
                            "created_utc": 1491321493.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "lol $50 for claymation. ",
                    "author": "dcbrah",
                    "id": "dftijee",
                    "parent_id": "t1_dfthdkq",
                    "score": 1,
                    "created_utc": 1491320930.0,
                    "replies": [
                        {
                            "body": "Claymation is $20 on hanz de fukos website. I don't know what you were seeing unless it was an advertisement which could display anything.",
                            "author": "LastToon",
                            "id": "dftipjy",
                            "parent_id": "t1_dftijee",
                            "score": 1,
                            "created_utc": 1491321111.0,
                            "replies": [
                                {
                                    "body": "There was an add for $50 at bottom of the page lol. I know its $15/-20 on HDF",
                                    "author": "dcbrah",
                                    "id": "dftjxrs",
                                    "parent_id": "t1_dftipjy",
                                    "score": 2,
                                    "created_utc": 1491322434.0,
                                    "replies": [
                                        {
                                            "body": "Probably someone selling it on Amazon for that much then. That's crazy to me though. I'm guessing it's for the reason I said though. Probably the only people that buy it like that are international and buying it through HDG would be more expensive. There are several British and Australian products like that on amazon if you try to buy them in the US",
                                            "author": "LastToon",
                                            "id": "dftkg73",
                                            "parent_id": "t1_dftjxrs",
                                            "score": 1,
                                            "created_utc": 1491322986.0,
                                            "replies": [
                                                {
                                                    "body": "they generally jack the prices up when they run out of inventory so noone buys iut but they still hold their place in the amazon queue",
                                                    "author": "dcbrah",
                                                    "id": "dftmq07",
                                                    "parent_id": "t1_dftkg73",
                                                    "score": 2,
                                                    "created_utc": 1491325369.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[Amazon](https://www.amazon.com/Hanz-Fuko-Claymation/dp/7178679743/ref=sr_1_1?ie=UTF8&qid=1491339829&sr=8-1&keywords=hanz+de+fuko+claymation)",
                                    "author": "Devario",
                                    "id": "dfu0ikm",
                                    "parent_id": "t1_dftipjy",
                                    "score": 1,
                                    "created_utc": 1491339868.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "check out the pomp and one of the best you can buy for 20 or less. I promise its better",
                    "author": "Obi-WanPierogi",
                    "id": "dftlmwo",
                    "parent_id": "t1_dfthdkq",
                    "score": 1,
                    "created_utc": 1491324227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "holy shit so many steps what i just put some claymation in my hair after a shower and shake it around, just knowing when you look good and when you dont look good is the best thing you can do for yourself",
            "author": "Iamnotheattack",
            "id": "dfu8x2c",
            "parent_id": "t3_63du6f",
            "score": -1,
            "created_utc": 1491350042.0,
            "replies": []
        },
        {
            "body": "Depends on how uneven your hairline is, but a side part variation of the cut described in the article can work well even with receding hairlines: [1](https://s-media-cache-ak0.pinimg.com/564x/ea/8c/3a/ea8c3a724cd8f181f1e8ededb6650811.jpg), [2](http://tradsalon.website/wp-content/uploads/2016/11/receding-hairline-undercut-with-regard-to-desire-proper-hair-for-official-event.jpg). Or so I tell myself.",
            "author": "blorgon",
            "id": "dfuo024",
            "parent_id": "t1_dftiafm",
            "score": 8,
            "created_utc": 1491370372.0,
            "replies": [
                {
                    "body": "Yes exactly!",
                    "author": "LastToon",
                    "id": "dfuulqs",
                    "parent_id": "t1_dfuo024",
                    "score": 2,
                    "created_utc": 1491388074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Don't give up your dreams. Hair science gets better every day :) ",
            "author": "Undercut_Advocate",
            "id": "dftis8g",
            "parent_id": "t1_dftiafm",
            "score": 6,
            "created_utc": 1491321191.0,
            "replies": [
                {
                    "body": "Not just that but a lot of these problems can be easily fixed by your barber and some are not even a problem. For example, if you are just saying you have a widows peak or another form of \"uneven hairline\" it will still look fine. But if you have a receding hairline there are different options",
                    "author": "LastToon",
                    "id": "dftjmie",
                    "parent_id": "t1_dftis8g",
                    "score": 13,
                    "created_utc": 1491322096.0,
                    "replies": []
                },
                {
                    "body": "All my faith in hair science. It's like a some sort of weird hope that is always at least 5 years away. ha.",
                    "author": "RZALECTA",
                    "id": "dftlwwm",
                    "parent_id": "t1_dftis8g",
                    "score": 2,
                    "created_utc": 1491324519.0,
                    "replies": []
                },
                {
                    "body": "Just like fusion energy!",
                    "author": "John_Wang",
                    "id": "dftzoeh",
                    "parent_id": "t1_dftis8g",
                    "score": 1,
                    "created_utc": 1491338996.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You don't need a straight hairline by any means, and neither do most people yet it works great for them. If you show me a picture if your hair I can help recommend a style for you. Plus this guide isn't just for one style it teaches techniques that apply to most styles such as adding volume.",
            "author": "LastToon",
            "id": "dftiufy",
            "parent_id": "t1_dftiafm",
            "score": 4,
            "created_utc": 1491321256.0,
            "replies": []
        },
        {
            "body": "Thanks I really appreciate that. I always say I don't want to force a style on anyone. I just want to share techniques that will allow men to achieve their own styles and look the way they want.",
            "author": "LastToon",
            "id": "dfuj8pc",
            "parent_id": "t1_dfuiqs4",
            "score": 2,
            "created_utc": 1491362678.0,
            "replies": []
        },
        {
            "body": "Glad you liked it! Yeah I would consider taking some length off it makes adding volume so much easier. Plus it takes less time to blow dry. ",
            "author": "LastToon",
            "id": "dfta9jc",
            "parent_id": "t1_dfta39j",
            "score": 1,
            "created_utc": 1491310735.0,
            "replies": []
        },
        {
            "body": "Thanks glad you enjoyed it! Let me know if you have any questions or anything you want to know more about.",
            "author": "LastToon",
            "id": "dftop73",
            "parent_id": "t1_dftoak1",
            "score": 2,
            "created_utc": 1491327467.0,
            "replies": [
                {
                    "body": "Any thoughts on where a guy can get a basic hair brush like [the one here](https://gfycat.com/RecentDemandingFruitfly)? That's my biggest problem right now, I just want a freakin' cheap brush. No where to be found.\n\nGreat article!!",
                    "author": "gyqo0348h",
                    "id": "dg5l1mf",
                    "parent_id": "t1_dftop73",
                    "score": 2,
                    "created_utc": 1491980025.0,
                    "replies": [
                        {
                            "body": "Yeah you just want to make sure you have a curved vented brush. You can get expensive ones and you can get cheap ones. Honestly you can buy them at Walgreens, or any other store, for a few weeks dollars. Plus they are on amazon really cheap!",
                            "author": "LastToon",
                            "id": "dg5s0lt",
                            "parent_id": "t1_dg5l1mf",
                            "score": 2,
                            "created_utc": 1491999269.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah if you want absolutely no effort you really only have two options. The first being cutting it short enough where you don't need a blow dryer. This style will let you have air dried hair that just looks good and won't fall in your face all day. About how long is your hair on top right now? \n\nThe second option, and this is if you want absolutely no product, would he to comb or brush your hair straight back after showering. Doing this with wet hair will cause the hair to dry into this place and get a nice hold throughout the day. I do something similar to this on days where I am rushing and it gives a nice look. I would really recommend some product however especially if you are doing any type of manual labor or anything became you don't want your hair falling in your face. Even a little bit of product will go a long way. Let me know if this really answers your question. ",
            "author": "LastToon",
            "id": "dftslz8",
            "parent_id": "t1_dftrzy3",
            "score": 4,
            "created_utc": 1491331600.0,
            "replies": [
                {
                    "body": "It does, and that's why I asked.\n\nMy old fade I could push the hair back with a bit of water and brush and it would stay. This one flops around. I live in Miami, the humidity is extreme and I don't want runny goop in my hair. My scalp is also extremely sensitive to shampoo and products in general so I prefer not to use them. Most products necessitate shampoo washing to remove them. That's just not an option with me, unfortunately. \n\nI think I'm just gonna cut it shorter. I have no idea how my barber confused a fade with an undercut.",
                    "author": null,
                    "id": "dftsutr",
                    "parent_id": "t1_dftslz8",
                    "score": 3,
                    "created_utc": 1491331861.0,
                    "replies": [
                        {
                            "body": "Completely understand where you are coming from and yeah I would say the best bet is to cut it down shorter. I completely get what you are saying about being in Miami with product. I've experience very similar problems and a great solution would be water based products. Now these would also be great for you because they can was out with just water. No shampoo needed! Also you will not get that goop feeling if you use a good quality water based clay. Gels and pomades are notorious for being like that especially in humid environments. Again sorry to hear about you cut being messed up, but just try and make the best of it, its hair it will grow back soon enough",
                            "author": "LastToon",
                            "id": "dftud0j",
                            "parent_id": "t1_dftsutr",
                            "score": 2,
                            "created_utc": 1491333452.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank glad you enjoyed it!",
            "author": "LastToon",
            "id": "dfu05vv",
            "parent_id": "t1_dfty702",
            "score": 1,
            "created_utc": 1491339490.0,
            "replies": []
        },
        {
            "body": "Have you tried any of the techniques I mentioned? And no I honestly do not belive it will he a problem. Look at celebrities who have rocked this hairstyle: Paul Walker, Christian Bale, Brad Pitt, Jake Gyllenhaal, and Chris Hemsworth all of them have major cowlicks on the front of their head. It's all about managing the style and embracing your cowlick to make it work for you. ",
            "author": "LastToon",
            "id": "dfuj6x6",
            "parent_id": "t1_dfuh6sk",
            "score": 1,
            "created_utc": 1491362609.0,
            "replies": []
        },
        {
            "body": "I honestly use everything I listed everyday and always get asked by guys and girls how my hair looks so natural. These products will not make your hair greasy or crunchy. This style does not even require hairspray so it's very easy to restyle throughout the day. I can completely see where you are coming from though.",
            "author": "LastToon",
            "id": "dfujero",
            "parent_id": "t1_dfuhzmq",
            "score": 1,
            "created_utc": 1491362908.0,
            "replies": []
        },
        {
            "body": "The prestyler is mainly their too help add volume but it adds control too. It helps during the styling process and for me with very thick hair I personally always need some type of prestyler. If you like the way your hair is looking now I would say leave it out though. No reason to use it if you don't need it. But yeah try out the heat protectant you won't regret it!",
            "author": "LastToon",
            "id": "dfujbdu",
            "parent_id": "t1_dfuich2",
            "score": 2,
            "created_utc": 1491362779.0,
            "replies": [
                {
                    "body": "Thanks man. Yeah I definitely have super thick hair so that's why I require a product such as Claymation with such strong hold. I'll for sure look into the pre styler as well now",
                    "author": "ahmedomar2015",
                    "id": "dfujqs2",
                    "parent_id": "t1_dfujbdu",
                    "score": 2,
                    "created_utc": 1491363380.0,
                    "replies": [
                        {
                            "body": "No problem let me know how it all turns out!",
                            "author": "LastToon",
                            "id": "dfuk03w",
                            "parent_id": "t1_dfujqs2",
                            "score": 2,
                            "created_utc": 1491363750.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Glad you enjoyed it!",
            "author": "LastToon",
            "id": "dfunaha",
            "parent_id": "t1_dfun3bh",
            "score": 1,
            "created_utc": 1491369036.0,
            "replies": []
        },
        {
            "body": "No problem! That's great it's a perfect product for your hair type, thick, wavy, and frizzy. For sure try the hairspray and I would only use a flat iron for special occasions where you want to push your hair style to the next level. Not everyday. \n\nAs for the product, I would say hanz de fuko claymation is going to be the best option for you. It is an amazing product that gives you so much hold and texture that your hair will look amazing. There are a lot of alternatives but this will give you the best results. I would stay away from American crew based on what you said about your hair type.",
            "author": "LastToon",
            "id": "dfwm4h0",
            "parent_id": "t1_dfwdjpo",
            "score": 2,
            "created_utc": 1491481818.0,
            "replies": []
        },
        {
            "body": "About 5-7 inches in the front and it tappers off towards the back",
            "author": "LastToon",
            "id": "dgdzjkc",
            "parent_id": "t1_dgdfkg8",
            "score": 1,
            "created_utc": 1492457670.0,
            "replies": []
        },
        {
            "body": "What $50 pomade? There aren't even any pomade recommended haha. Regardless though a fair price for most hair clays is around $15-20 for your standard size jar",
            "author": "LastToon",
            "id": "dfthwbc",
            "parent_id": "t1_dfthdkq",
            "score": 5,
            "created_utc": 1491320233.0,
            "replies": []
        },
        {
            "body": "A worthwhile investment my friend.",
            "author": "Undercut_Advocate",
            "id": "dftiraj",
            "parent_id": "t1_dfthdkq",
            "score": 2,
            "created_utc": 1491321163.0,
            "replies": [
                {
                    "body": "While claymation is my favorite product I don't see why anyone would pay more than they need too. And the price is $20 on their website which is what I'd tell you to buy it for. \n\nMany people have told me that with shipping to places like Canada, hanz de fuko is too expensive so I recommend other products. ",
                    "author": "LastToon",
                    "id": "dftj2ix",
                    "parent_id": "t1_dftiraj",
                    "score": 2,
                    "created_utc": 1491321493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol $50 for claymation. ",
            "author": "dcbrah",
            "id": "dftijee",
            "parent_id": "t1_dfthdkq",
            "score": 1,
            "created_utc": 1491320930.0,
            "replies": [
                {
                    "body": "Claymation is $20 on hanz de fukos website. I don't know what you were seeing unless it was an advertisement which could display anything.",
                    "author": "LastToon",
                    "id": "dftipjy",
                    "parent_id": "t1_dftijee",
                    "score": 1,
                    "created_utc": 1491321111.0,
                    "replies": [
                        {
                            "body": "There was an add for $50 at bottom of the page lol. I know its $15/-20 on HDF",
                            "author": "dcbrah",
                            "id": "dftjxrs",
                            "parent_id": "t1_dftipjy",
                            "score": 2,
                            "created_utc": 1491322434.0,
                            "replies": [
                                {
                                    "body": "Probably someone selling it on Amazon for that much then. That's crazy to me though. I'm guessing it's for the reason I said though. Probably the only people that buy it like that are international and buying it through HDG would be more expensive. There are several British and Australian products like that on amazon if you try to buy them in the US",
                                    "author": "LastToon",
                                    "id": "dftkg73",
                                    "parent_id": "t1_dftjxrs",
                                    "score": 1,
                                    "created_utc": 1491322986.0,
                                    "replies": [
                                        {
                                            "body": "they generally jack the prices up when they run out of inventory so noone buys iut but they still hold their place in the amazon queue",
                                            "author": "dcbrah",
                                            "id": "dftmq07",
                                            "parent_id": "t1_dftkg73",
                                            "score": 2,
                                            "created_utc": 1491325369.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[Amazon](https://www.amazon.com/Hanz-Fuko-Claymation/dp/7178679743/ref=sr_1_1?ie=UTF8&qid=1491339829&sr=8-1&keywords=hanz+de+fuko+claymation)",
                            "author": "Devario",
                            "id": "dfu0ikm",
                            "parent_id": "t1_dftipjy",
                            "score": 1,
                            "created_utc": 1491339868.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "check out the pomp and one of the best you can buy for 20 or less. I promise its better",
            "author": "Obi-WanPierogi",
            "id": "dftlmwo",
            "parent_id": "t1_dfthdkq",
            "score": 1,
            "created_utc": 1491324227.0,
            "replies": []
        },
        {
            "body": "Yes exactly!",
            "author": "LastToon",
            "id": "dfuulqs",
            "parent_id": "t1_dfuo024",
            "score": 2,
            "created_utc": 1491388074.0,
            "replies": []
        },
        {
            "body": "Not just that but a lot of these problems can be easily fixed by your barber and some are not even a problem. For example, if you are just saying you have a widows peak or another form of \"uneven hairline\" it will still look fine. But if you have a receding hairline there are different options",
            "author": "LastToon",
            "id": "dftjmie",
            "parent_id": "t1_dftis8g",
            "score": 13,
            "created_utc": 1491322096.0,
            "replies": []
        },
        {
            "body": "All my faith in hair science. It's like a some sort of weird hope that is always at least 5 years away. ha.",
            "author": "RZALECTA",
            "id": "dftlwwm",
            "parent_id": "t1_dftis8g",
            "score": 2,
            "created_utc": 1491324519.0,
            "replies": []
        },
        {
            "body": "Just like fusion energy!",
            "author": "John_Wang",
            "id": "dftzoeh",
            "parent_id": "t1_dftis8g",
            "score": 1,
            "created_utc": 1491338996.0,
            "replies": []
        },
        {
            "body": "Any thoughts on where a guy can get a basic hair brush like [the one here](https://gfycat.com/RecentDemandingFruitfly)? That's my biggest problem right now, I just want a freakin' cheap brush. No where to be found.\n\nGreat article!!",
            "author": "gyqo0348h",
            "id": "dg5l1mf",
            "parent_id": "t1_dftop73",
            "score": 2,
            "created_utc": 1491980025.0,
            "replies": [
                {
                    "body": "Yeah you just want to make sure you have a curved vented brush. You can get expensive ones and you can get cheap ones. Honestly you can buy them at Walgreens, or any other store, for a few weeks dollars. Plus they are on amazon really cheap!",
                    "author": "LastToon",
                    "id": "dg5s0lt",
                    "parent_id": "t1_dg5l1mf",
                    "score": 2,
                    "created_utc": 1491999269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It does, and that's why I asked.\n\nMy old fade I could push the hair back with a bit of water and brush and it would stay. This one flops around. I live in Miami, the humidity is extreme and I don't want runny goop in my hair. My scalp is also extremely sensitive to shampoo and products in general so I prefer not to use them. Most products necessitate shampoo washing to remove them. That's just not an option with me, unfortunately. \n\nI think I'm just gonna cut it shorter. I have no idea how my barber confused a fade with an undercut.",
            "author": null,
            "id": "dftsutr",
            "parent_id": "t1_dftslz8",
            "score": 3,
            "created_utc": 1491331861.0,
            "replies": [
                {
                    "body": "Completely understand where you are coming from and yeah I would say the best bet is to cut it down shorter. I completely get what you are saying about being in Miami with product. I've experience very similar problems and a great solution would be water based products. Now these would also be great for you because they can was out with just water. No shampoo needed! Also you will not get that goop feeling if you use a good quality water based clay. Gels and pomades are notorious for being like that especially in humid environments. Again sorry to hear about you cut being messed up, but just try and make the best of it, its hair it will grow back soon enough",
                    "author": "LastToon",
                    "id": "dftud0j",
                    "parent_id": "t1_dftsutr",
                    "score": 2,
                    "created_utc": 1491333452.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks man. Yeah I definitely have super thick hair so that's why I require a product such as Claymation with such strong hold. I'll for sure look into the pre styler as well now",
            "author": "ahmedomar2015",
            "id": "dfujqs2",
            "parent_id": "t1_dfujbdu",
            "score": 2,
            "created_utc": 1491363380.0,
            "replies": [
                {
                    "body": "No problem let me know how it all turns out!",
                    "author": "LastToon",
                    "id": "dfuk03w",
                    "parent_id": "t1_dfujqs2",
                    "score": 2,
                    "created_utc": 1491363750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While claymation is my favorite product I don't see why anyone would pay more than they need too. And the price is $20 on their website which is what I'd tell you to buy it for. \n\nMany people have told me that with shipping to places like Canada, hanz de fuko is too expensive so I recommend other products. ",
            "author": "LastToon",
            "id": "dftj2ix",
            "parent_id": "t1_dftiraj",
            "score": 2,
            "created_utc": 1491321493.0,
            "replies": []
        },
        {
            "body": "Claymation is $20 on hanz de fukos website. I don't know what you were seeing unless it was an advertisement which could display anything.",
            "author": "LastToon",
            "id": "dftipjy",
            "parent_id": "t1_dftijee",
            "score": 1,
            "created_utc": 1491321111.0,
            "replies": [
                {
                    "body": "There was an add for $50 at bottom of the page lol. I know its $15/-20 on HDF",
                    "author": "dcbrah",
                    "id": "dftjxrs",
                    "parent_id": "t1_dftipjy",
                    "score": 2,
                    "created_utc": 1491322434.0,
                    "replies": [
                        {
                            "body": "Probably someone selling it on Amazon for that much then. That's crazy to me though. I'm guessing it's for the reason I said though. Probably the only people that buy it like that are international and buying it through HDG would be more expensive. There are several British and Australian products like that on amazon if you try to buy them in the US",
                            "author": "LastToon",
                            "id": "dftkg73",
                            "parent_id": "t1_dftjxrs",
                            "score": 1,
                            "created_utc": 1491322986.0,
                            "replies": [
                                {
                                    "body": "they generally jack the prices up when they run out of inventory so noone buys iut but they still hold their place in the amazon queue",
                                    "author": "dcbrah",
                                    "id": "dftmq07",
                                    "parent_id": "t1_dftkg73",
                                    "score": 2,
                                    "created_utc": 1491325369.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[Amazon](https://www.amazon.com/Hanz-Fuko-Claymation/dp/7178679743/ref=sr_1_1?ie=UTF8&qid=1491339829&sr=8-1&keywords=hanz+de+fuko+claymation)",
                    "author": "Devario",
                    "id": "dfu0ikm",
                    "parent_id": "t1_dftipjy",
                    "score": 1,
                    "created_utc": 1491339868.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah you just want to make sure you have a curved vented brush. You can get expensive ones and you can get cheap ones. Honestly you can buy them at Walgreens, or any other store, for a few weeks dollars. Plus they are on amazon really cheap!",
            "author": "LastToon",
            "id": "dg5s0lt",
            "parent_id": "t1_dg5l1mf",
            "score": 2,
            "created_utc": 1491999269.0,
            "replies": []
        },
        {
            "body": "Completely understand where you are coming from and yeah I would say the best bet is to cut it down shorter. I completely get what you are saying about being in Miami with product. I've experience very similar problems and a great solution would be water based products. Now these would also be great for you because they can was out with just water. No shampoo needed! Also you will not get that goop feeling if you use a good quality water based clay. Gels and pomades are notorious for being like that especially in humid environments. Again sorry to hear about you cut being messed up, but just try and make the best of it, its hair it will grow back soon enough",
            "author": "LastToon",
            "id": "dftud0j",
            "parent_id": "t1_dftsutr",
            "score": 2,
            "created_utc": 1491333452.0,
            "replies": []
        },
        {
            "body": "No problem let me know how it all turns out!",
            "author": "LastToon",
            "id": "dfuk03w",
            "parent_id": "t1_dfujqs2",
            "score": 2,
            "created_utc": 1491363750.0,
            "replies": []
        },
        {
            "body": "There was an add for $50 at bottom of the page lol. I know its $15/-20 on HDF",
            "author": "dcbrah",
            "id": "dftjxrs",
            "parent_id": "t1_dftipjy",
            "score": 2,
            "created_utc": 1491322434.0,
            "replies": [
                {
                    "body": "Probably someone selling it on Amazon for that much then. That's crazy to me though. I'm guessing it's for the reason I said though. Probably the only people that buy it like that are international and buying it through HDG would be more expensive. There are several British and Australian products like that on amazon if you try to buy them in the US",
                    "author": "LastToon",
                    "id": "dftkg73",
                    "parent_id": "t1_dftjxrs",
                    "score": 1,
                    "created_utc": 1491322986.0,
                    "replies": [
                        {
                            "body": "they generally jack the prices up when they run out of inventory so noone buys iut but they still hold their place in the amazon queue",
                            "author": "dcbrah",
                            "id": "dftmq07",
                            "parent_id": "t1_dftkg73",
                            "score": 2,
                            "created_utc": 1491325369.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[Amazon](https://www.amazon.com/Hanz-Fuko-Claymation/dp/7178679743/ref=sr_1_1?ie=UTF8&qid=1491339829&sr=8-1&keywords=hanz+de+fuko+claymation)",
            "author": "Devario",
            "id": "dfu0ikm",
            "parent_id": "t1_dftipjy",
            "score": 1,
            "created_utc": 1491339868.0,
            "replies": []
        },
        {
            "body": "Probably someone selling it on Amazon for that much then. That's crazy to me though. I'm guessing it's for the reason I said though. Probably the only people that buy it like that are international and buying it through HDG would be more expensive. There are several British and Australian products like that on amazon if you try to buy them in the US",
            "author": "LastToon",
            "id": "dftkg73",
            "parent_id": "t1_dftjxrs",
            "score": 1,
            "created_utc": 1491322986.0,
            "replies": [
                {
                    "body": "they generally jack the prices up when they run out of inventory so noone buys iut but they still hold their place in the amazon queue",
                    "author": "dcbrah",
                    "id": "dftmq07",
                    "parent_id": "t1_dftkg73",
                    "score": 2,
                    "created_utc": 1491325369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "they generally jack the prices up when they run out of inventory so noone buys iut but they still hold their place in the amazon queue",
            "author": "dcbrah",
            "id": "dftmq07",
            "parent_id": "t1_dftkg73",
            "score": 2,
            "created_utc": 1491325369.0,
            "replies": []
        }
    ]
}