{
    "title": "YJS bags another Daesang! Congratulations to the Nation MC!",
    "post_id": "zo9fx2",
    "post_url": "https://www.reddit.com/r/runningman/comments/zo9fx2/yjs_bags_another_daesang_congratulations_to_the/",
    "author": "Deroucadetoo",
    "body": "",
    "url": "https://www.reddit.com/gallery/zo9fx2",
    "score": 475,
    "upvote_ratio": 0.99,
    "created_utc": 1671293115.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Happy for YJS... but the atmosphere, and even the winner, is not comfortable with the situation.\n\nEdit: [YJS's initial reaction says it all](https://twitter.com/6thousandwon/status/1604146612418121728)",
            "author": "EpikMint",
            "id": "j0ljova",
            "parent_id": "t3_zo9fx2",
            "score": 112,
            "created_utc": 1671293361.0,
            "replies": [
                {
                    "body": "it indeed looks awkward, i was hoping for seokjin also",
                    "author": "shems-2383",
                    "id": "j0nm9w7",
                    "parent_id": "t1_j0ljova",
                    "score": 20,
                    "created_utc": 1671325578.0,
                    "replies": []
                },
                {
                    "body": "That's the point. we all know YJS deserves Daesang every year even last year. If they can give the Daesang to the whole MUD cast last year then it's just appropriate to give it to JSJ this year as ultimate appreciation for his service.\n\nThe whole members and fans were hyping up JSJ this year and SBS know this. SBS know how awkward it will be for JSJ and everyone when another member wins it. They know it will create some news and stories and they love it. \n\nThey just don't take JSJ seriously. Giving a side award last year and this year made JSJ went up on the stage with that ID tag to talk about that award again.",
                    "author": "Pyeonsae",
                    "id": "j0obko0",
                    "parent_id": "t1_j0ljova",
                    "score": 23,
                    "created_utc": 1671338309.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kinda sad that YJS totally deserves this award but he couldn’t even be happy about winning it. The fact that he apologized was heartbreaking. SBS shouldn’t have made things awkward like that, and they should have given JSJ his dues last year.\n\nBut anyways, congratulations to YJS! More to come!",
            "author": "teukkiu",
            "id": "j0m0o2r",
            "parent_id": "t3_zo9fx2",
            "score": 80,
            "created_utc": 1671300541.0,
            "replies": []
        },
        {
            "body": "Honestly the worse part of all of this is the build up and anticipation, considering the fact that his main competition won the producer awards, making it seem like JSJ was gona win it after 30 years in the business only for it to end up in disappointment. You could tell how heartbroken he felt and was on the verge of tears.",
            "author": "EmploymentOk6815",
            "id": "j0loof8",
            "parent_id": "t3_zo9fx2",
            "score": 91,
            "created_utc": 1671295518.0,
            "replies": [
                {
                    "body": "True. Even jihyo hug him.",
                    "author": "Hefty-Association567",
                    "id": "j0lq0jk",
                    "parent_id": "t1_j0loof8",
                    "score": 39,
                    "created_utc": 1671296078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man, it’s not YJS fault, but he must feel really bad for JSJ.",
            "author": "justambrose",
            "id": "j0lkcll",
            "parent_id": "t3_zo9fx2",
            "score": 130,
            "created_utc": 1671293655.0,
            "replies": [
                {
                    "body": "It kinda sucks getting an award and knowing that your colleague deserves it more than you do. Unfortunately, that's just the way awards like this goes :/ \n\nNot discrediting YJS either cause I'm sure he'd love for both him and JSJ to get the award together.",
                    "author": "CoG_Brotato",
                    "id": "j0m7nx1",
                    "parent_id": "t1_j0lkcll",
                    "score": 22,
                    "created_utc": 1671303393.0,
                    "replies": [
                        {
                            "body": "nah i couldnt say that jsj deserves it more from yjs this year but if we talked about last year, jsj is the most deserving. it shouldve been jsj daesang last year",
                            "author": "kentwansue",
                            "id": "j0nspn3",
                            "parent_id": "t1_j0m7nx1",
                            "score": 20,
                            "created_utc": 1671328720.0,
                            "replies": []
                        },
                        {
                            "body": "In terms of deserve, I don't know how you can argue winner shouldn't be yjs every year.  He beats JSJ handily.  \n\nIt feels bad though that you know YJS would much prefer JSJ win.",
                            "author": "Fudouri",
                            "id": "j0ol5ly",
                            "parent_id": "t1_j0m7nx1",
                            "score": 10,
                            "created_utc": 1671344169.0,
                            "replies": [
                                {
                                    "body": "Deserve really wasn't the best word there but my point still stands. Every member on the RM team deserves an award even if it's not the Daesang. YJS is clearly a rank above everyone else but he does so much that we don't see to support the other members.\n\nI do hope JSJ gets his soon though. He honestly deserves it after having to deal with so much and is now having such a good past few years.",
                                    "author": "CoG_Brotato",
                                    "id": "j0px2d2",
                                    "parent_id": "t1_j0ol5ly",
                                    "score": 3,
                                    "created_utc": 1671377369.0,
                                    "replies": [
                                        {
                                            "body": "I think SBS had a choice.  They can treat JSJ as secondary player on a popular show (haha, so min, sechan).  In that case, he shouldn't even be nominated.  \n\nOr they can just give it to him after teasing every year.\n\nI wouldn't react this way if they sent down either of these routes.\n\nTo do this is just mean hearted.",
                                            "author": "Fudouri",
                                            "id": "j0pxir9",
                                            "parent_id": "t1_j0px2d2",
                                            "score": 3,
                                            "created_utc": 1671377572.0,
                                            "replies": [
                                                {
                                                    "body": "Agreed, but we can speculate as much as we want to but it won't matter and is a waste of time to do so. Celebrating the members for receiving awards is obvious but we can show that same energy by enjoying the entertainment they've provided over the years.\n\nIt's one measly award given every year and while it'd be nice for different RM members to receive it, there's no guarantee. I'd rather support them by watching RM and the other shows they're part of.",
                                                    "author": "CoG_Brotato",
                                                    "id": "j0qr6e5",
                                                    "parent_id": "t1_j0pxir9",
                                                    "score": 1,
                                                    "created_utc": 1671388952.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "JSJ isn't anywhere as popular as YJS is by SBS staff and his colleagues! He's demeanor always comes off as fake!",
                    "author": "blaquecousteau",
                    "id": "j0ve5h1",
                    "parent_id": "t1_j0lkcll",
                    "score": 1,
                    "created_utc": 1671474732.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lowkey would have been happier with it going to tak jae hoon or lee sang min (even though i wasn't rooting for them), since at least they'd never won it as an individual before... or even shin dong yup, since he's on many different sbs programs and hasn't won since 2016. this is truly the most bewildering choice.",
            "author": "pondthebrave",
            "id": "j0lkzn8",
            "parent_id": "t3_zo9fx2",
            "score": 59,
            "created_utc": 1671293938.0,
            "replies": [
                {
                    "body": "agreed. happy for YJS but this just creates an awkward tension, couldnt imagine how they will take the daesang joke in the next episodes.",
                    "author": "snekplet",
                    "id": "j0lvpvi",
                    "parent_id": "t1_j0lkzn8",
                    "score": 25,
                    "created_utc": 1671298468.0,
                    "replies": []
                },
                {
                    "body": "Tak jae hoon won daesang as an individual before, but long time ago.",
                    "author": "timematoom",
                    "id": "j0p5br4",
                    "parent_id": "t1_j0lkzn8",
                    "score": 2,
                    "created_utc": 1671360218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even YJS knows sbs is embarassing JSJ.",
            "author": "Hefty-Association567",
            "id": "j0lkyfj",
            "parent_id": "t3_zo9fx2",
            "score": 77,
            "created_utc": 1671293923.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j0loshm",
                    "parent_id": "t1_j0lkyfj",
                    "score": -47,
                    "created_utc": 1671295565.0,
                    "replies": [
                        {
                            "body": "Well if you RM fans you should kbow JSJ equally deserve. But just look last year gave JSJ nonsense award and making false hope its really kind of embarassing him  if you see YJS speech he even feel sorry towards JSJ. even Jihyo hug him. And the atmosphere is really awkard there.",
                            "author": "Hefty-Association567",
                            "id": "j0lpsqz",
                            "parent_id": "t1_j0loshm",
                            "score": 33,
                            "created_utc": 1671295988.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j0lsnnz",
                                    "parent_id": "t1_j0lpsqz",
                                    "score": -34,
                                    "created_utc": 1671297183.0,
                                    "replies": [
                                        {
                                            "body": ">But SBS would risk a lot giving Daesang to JSJ as it represents the best of their company.\n\nIf that's your argument, then SBS could have just gave the award to the entire RM cast instead, just like on what they did to MUD last year. \n\nI'm not saying that YJS doesn't deserve it, but I just hate the build up and anticipation while watching it live, on which YJS is also got flustered and glanced at JSJ first when he was called up for the prize.",
                                            "author": "EpikMint",
                                            "id": "j0lvj4j",
                                            "parent_id": "t1_j0lsnnz",
                                            "score": 16,
                                            "created_utc": 1671298389.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "You will never understand it. You missing the dynamic and atmosphere.",
                                            "author": "Hefty-Association567",
                                            "id": "j0lt274",
                                            "parent_id": "t1_j0lsnnz",
                                            "score": 10,
                                            "created_utc": 1671297350.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Wait, I thought you said the award wasn't a sympathy award, but based on talent and who deserves it? Now you're saying they won't give someone that award because they don't want them representing that company? Well, then clearly it isn't an award based on talent and merits and accomplishments but who the company wants as the face of the brand.",
                                            "author": "Ancient_Reply4583",
                                            "id": "j0lvjgv",
                                            "parent_id": "t1_j0lsnnz",
                                            "score": 3,
                                            "created_utc": 1671298392.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "idk why you got many downvote, you tell the truth, if JSJ win Daesang award, it would make another speculations, and make Daesang Award looks so \"rigid\", but still, i respect him, JSJ is a hardworker man",
                                            "author": "ohiroze",
                                            "id": "j0mb7lr",
                                            "parent_id": "t1_j0lsnnz",
                                            "score": -3,
                                            "created_utc": 1671304847.0,
                                            "replies": [
                                                {
                                                    "body": "Then why not give it to Tak Jae Hoon or Lee Sang Min instead? Other than JSJ, there are viewers who wants the award to go to either TJH and LSM. \n\nSBS already messed up last year for being indecisive and sending the prize to multiple people. They could have redeemed themselves this year for not ignoring JSJ (or the other nominees) but gave it to YJS (whose also expecting his bestfriend to win) instead. \n\nThe aftermath? SBS right now is being criticized by korean netizens again. Most of the comments from the red carpet pre-show @ Youtube are bombarded with disappointments that they snubbed JSJ.\n\nEdit: what's worse is that YJS is getting dragged. SBS really messed up for the 2nd time in a row.",
                                                    "author": "EpikMint",
                                                    "id": "j0mrm1n",
                                                    "parent_id": "t1_j0mb7lr",
                                                    "score": 5,
                                                    "created_utc": 1671311801.0,
                                                    "replies": [
                                                        {
                                                            "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
                                                            "author": "lolminna",
                                                            "id": "j0nkk89",
                                                            "parent_id": "t1_j0mrm1n",
                                                            "score": 6,
                                                            "created_utc": 1671324749.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                                                                    "author": "teukkiu",
                                                                    "id": "j0r327y",
                                                                    "parent_id": "t1_j0nkk89",
                                                                    "score": 2,
                                                                    "created_utc": 1671393439.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
                                                            "author": "slooobs",
                                                            "id": "j0no36f",
                                                            "parent_id": "t1_j0mrm1n",
                                                            "score": 2,
                                                            "created_utc": 1671326469.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
                                                            "author": "ohiroze",
                                                            "id": "j0mupif",
                                                            "parent_id": "t1_j0mrm1n",
                                                            "score": 1,
                                                            "created_utc": 1671313093.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": ">JSJ is a hardworker man\n\nThis is so funny, he literally delegate his job to his colleague during his captaincy because he thinks he worked so hard during that time. \n\nYJS literally did tons of programs and never complaint.\n\nlmao.",
                                                    "author": "kripkrip",
                                                    "id": "j0muuzj",
                                                    "parent_id": "t1_j0mb7lr",
                                                    "score": -1,
                                                    "created_utc": 1671313157.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
                                                            "author": "ohiroze",
                                                            "id": "j0mws2r",
                                                            "parent_id": "t1_j0muuzj",
                                                            "score": 2,
                                                            "created_utc": 1671313985.0,
                                                            "replies": [
                                                                {
                                                                    "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                                                                    "author": "kripkrip",
                                                                    "id": "j0n0x63",
                                                                    "parent_id": "t1_j0mws2r",
                                                                    "score": -2,
                                                                    "created_utc": 1671315764.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                                                                            "author": "ohiroze",
                                                                            "id": "j0n6vkd",
                                                                            "parent_id": "t1_j0n0x63",
                                                                            "score": 3,
                                                                            "created_utc": 1671318417.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Nope. If you really watch the show, you should know that JSJ has improved so much over the year. \nAnd he has been really entertaining and contributing. \nHe's quite an all rounder from entertainment scene, to music to doing his own YouTube channel.",
                            "author": "WangXian97",
                            "id": "j0lr03y",
                            "parent_id": "t1_j0loshm",
                            "score": 24,
                            "created_utc": 1671296486.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If they won't give an individual daesang to JSJ, they could at least give a team daesang to the cast and make it less awkward. It's weird to me that MUD cast received a team daesang before RM who has the best cast chemistry I've seen in variety shows.",
            "author": "fadedcosy",
            "id": "j0lqamn",
            "parent_id": "t3_zo9fx2",
            "score": 55,
            "created_utc": 1671296192.0,
            "replies": [
                {
                    "body": "If you haven't tried it, I think you should try watching MUD. It's one of the funniest shows on TV, like cry laughing, wheezing level of funny. I'm saying this as a fan of running man, that rarely misses an episode. You'd understand why it was reasonable for them to get the daesang last year.",
                    "author": "Few-Particular1780",
                    "id": "j0ovo46",
                    "parent_id": "t1_j0lqamn",
                    "score": 3,
                    "created_utc": 1671352149.0,
                    "replies": [
                        {
                            "body": "That's true. But it kinda felt iffy since they won team daesang, not once, but twice. While the RM never won team daesang during their golden years.",
                            "author": "Kylaste",
                            "id": "j0rorz7",
                            "parent_id": "t1_j0ovo46",
                            "score": 3,
                            "created_utc": 1671402194.0,
                            "replies": []
                        },
                        {
                            "body": "I have tried it before but I don't like the concept or most of the cast.",
                            "author": "fadedcosy",
                            "id": "j0owalk",
                            "parent_id": "t1_j0ovo46",
                            "score": 1,
                            "created_utc": 1671352663.0,
                            "replies": [
                                {
                                    "body": "For me I only watch the highlights in yt…tried to watch also but not my cup of tea…",
                                    "author": "shems-2383",
                                    "id": "j0pnpl3",
                                    "parent_id": "t1_j0owalk",
                                    "score": 4,
                                    "created_utc": 1671372833.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeing SJH![img](emote|t5_2u830|4998) hugging JSJ![img](emote|t5_2u830|4975) in consolation though😭 She embraced him during YJS![img](emote|t5_2u830|5014)' acceptance speech & also when they went up on stage😭 I guess she rly wanted him to win the Daesung. In all honesty, I wanted JSJ![img](emote|t5_2u830|4975) to win too, but I'm equally happy for YJS![img](emote|t5_2u830|5014) as well!\n\nThe fact that YJS![img](emote|t5_2u830|5014) apologised to JSJ![img](emote|t5_2u830|4975) during his acceptance speech showed how much every RM member thought highly of his chances this time around.\n\nKeep fighting JSJ![img](emote|t5_2u830|4976), I believe in you!💪\n\nedit: removed typo",
            "author": "Deroucadetoo",
            "id": "j0lkjwn",
            "parent_id": "t3_zo9fx2",
            "score": 58,
            "created_utc": 1671293744.0,
            "replies": []
        },
        {
            "body": "Both Jaesuk and Sukjin equally deserves the award so there's no need to argue about that. The problem is SBS treatment towards Sukjin, giving him a made-up award last year & false hope that he would win this year.\n\nStill, congratulations to Jaesuk and I hope he won't feel guilty on receiving the award.",
            "author": "Everythingnothing9",
            "id": "j0lxxmy",
            "parent_id": "t3_zo9fx2",
            "score": 40,
            "created_utc": 1671299397.0,
            "replies": [
                {
                    "body": "It wasn’t a made up award. Other people won the honorary employee award before he did",
                    "author": "FlimsyCartographer2",
                    "id": "j0mdzya",
                    "parent_id": "t1_j0lxxmy",
                    "score": 15,
                    "created_utc": 1671306016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cmon guys it is really pretty obvious that JSJ won't win it this year. His best chance is last yr and SBS blew it up. Really don't understand frustration this time. You just saying it should be him because you guys only watch RM. To be fair other nominees are also hard carrying in their respective shows  (2 shows in SBS corresponds to only 1 for JSJ).\n\nIf Jaesuk didn't win it I think it would still not go on JSJ, it will definitely go to Tak Jae Joon who gets the Producers award this time and Lee Sang min in close third.",
            "author": "whitefang0824",
            "id": "j0m49gx",
            "parent_id": "t3_zo9fx2",
            "score": 40,
            "created_utc": 1671302012.0,
            "replies": [
                {
                    "body": "Finally a voice of reason. \n\nTo be honest even last year he was mostly up for it because he blew up from being on MSG Wannabe which was on MBC anyway but it was his best chance for sure",
                    "author": "banethor88",
                    "id": "j0n12td",
                    "parent_id": "t1_j0m49gx",
                    "score": 13,
                    "created_utc": 1671315831.0,
                    "replies": [
                        {
                            "body": "While I see your reasons, I disagree. I think JSJ should've won it this year after the travesty that was last year. Hear me out:\n\nIn the 1997 season of the NBA, Karl Malone won MVP despite Michael Jordan having the best stats. Why? Because of voter fatigue; voter fatigue is when people think a nominee has won enough so they vote for someone else instead.\n\nIn 2008, the MVP race in the NBA was between Chris Paul and Kobe Bryant. Kobe at that point was near mythical; however he hadn't gotten an MVP award. Meanwhile Chris Paul was a superstar PG who was putting slightly superior stats to Kobe. But Kobe won that year, why is that? Because there were many years that he was close to winning them, and he deserved to get one for the performances he had over the years. It's like a respect MVP.\n\nJSJ deserved to get a respect daesang this year. I think the majority of Knetz and RM fans here will agree with me that YJS has enough daesangs, he doesn't need one more, even if he has \"superior stats\" to JSJ. It would also be an apology to the bad taste joke they did last year, and show that SBS is in touch with their audience more than just seeing them through ratings numbers. Sadly that's not the case.",
                            "author": "lolminna",
                            "id": "j0nlv01",
                            "parent_id": "t1_j0n12td",
                            "score": -7,
                            "created_utc": 1671325376.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tbh, I also watch MUD regularly and Bachelors again every now and then. I still think JSJ deserved to be given the daesang, although it won't have been surprising if it when to the MUD cast because MUD was peak comedy this year.",
                    "author": "Few-Particular1780",
                    "id": "j0ovwsc",
                    "parent_id": "t1_j0m49gx",
                    "score": 0,
                    "created_utc": 1671352354.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sucks for SBS. There’s only two or three shows that was even remotely successful for a reward.  \n\nBut SBS execs still hates awarding RM on anything.  So every other year they just toss awards to YJS as safety without giving too much credit to RM.\n\nBet next year is going to be Ugly duckling again. \n\nReason why I love RM but despise SBS. They’ve been soft-killing RM.",
            "author": "gyojoo",
            "id": "j0mj30g",
            "parent_id": "t3_zo9fx2",
            "score": 22,
            "created_utc": 1671308181.0,
            "replies": [
                {
                    "body": "I just feel that they indirectly wants to drop the rm program from now onwards….",
                    "author": "shems-2383",
                    "id": "j0on12f",
                    "parent_id": "t1_j0mj30g",
                    "score": 2,
                    "created_utc": 1671345474.0,
                    "replies": [
                        {
                            "body": "In Korean entertainment PDs almost never leave the program/company because “they want to try something new”, “they found better opportunities”, etc.\n\nThey are forced/coerced to move on.",
                            "author": "gyojoo",
                            "id": "j0qveca",
                            "parent_id": "t1_j0on12f",
                            "score": 2,
                            "created_utc": 1671390456.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At this point, it’s just disrespectful to SJ. Why does SBS hate him? I think the MC even said to let SJ hold the trophy ugghhhh making it all more uncomfortable. He really needed that hug from JH after that mess.",
            "author": "lijiburr",
            "id": "j0ln1ia",
            "parent_id": "t3_zo9fx2",
            "score": 43,
            "created_utc": 1671294835.0,
            "replies": [
                {
                    "body": "Low key the MC part made the whole situation even more awkward",
                    "author": "EmploymentOk6815",
                    "id": "j0loqq1",
                    "parent_id": "t1_j0ln1ia",
                    "score": 41,
                    "created_utc": 1671295544.0,
                    "replies": []
                },
                {
                    "body": "I don’t think SBS hates JSJ. Big Nose deserves more recognition for what he’s done the past two years and especially after LKS left RM, but YJS is still the face of the franchise and the most popular MC in SK. It can be argued JSJ, LKS and Somin all have deserved to win the grand award at some point too but they haven’t/didn’t.",
                    "author": "buddhabear07",
                    "id": "j0lqa00",
                    "parent_id": "t1_j0ln1ia",
                    "score": 16,
                    "created_utc": 1671296185.0,
                    "replies": [
                        {
                            "body": "To compare JSJ with LKS and JSM is a bit ridiculous. The man has been in this industry for 30 years, that's basically all of LKS and JSM's lives! Compared to him, LKS has only been in this industry for 12 and JSM only 5 years. Both LKS and JSM are talented and deserving of recognition, don't get me wrong - but this should've gone to JSJ.",
                            "author": "Ancient_Reply4583",
                            "id": "j0lw2p2",
                            "parent_id": "t1_j0lqa00",
                            "score": 20,
                            "created_utc": 1671298615.0,
                            "replies": [
                                {
                                    "body": "JSJ deserved the Daesang last year. I would have been thrilled if he got it now. Yes, he’s been in the business a long time but it’s not a lifetime achievement award though is it? I thought it was some combination of popularity, impact and talent which both LKS and Somin fit at least for me. I’m okay with YJS winning but SBS seems to have odd way of picking winner here.",
                                    "author": "buddhabear07",
                                    "id": "j0lxk2z",
                                    "parent_id": "t1_j0lw2p2",
                                    "score": 6,
                                    "created_utc": 1671299237.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jaesuk definitely deserved to win this year. I think JSJ was funnier last year, but I didn't like the way they kept teasing him and getting his hopes up. If you watched the sbs entertainment ceremony, you would have thought that JSJ will be the winner. TJH's comment kinda made it worse.",
            "author": "Zarkuine",
            "id": "j0nvqyi",
            "parent_id": "t3_zo9fx2",
            "score": 8,
            "created_utc": 1671330166.0,
            "replies": []
        },
        {
            "body": "Does anyone know who decides who gets the award? Genuinely curious bc idk",
            "author": "generictrashlady",
            "id": "j0lqshr",
            "parent_id": "t3_zo9fx2",
            "score": 14,
            "created_utc": 1671296396.0,
            "replies": []
        },
        {
            "body": "I'm not a fan of award ceremonies and the concept of 'awards' because I think everyone deserves to be celebrated but when I do watch I'm the first to jump all excited when I see Yoo Jae Suk win because he is absolutely brilliant! But this time, this one time, I was also very much rooting for Ji Suk jin to win the Daesang.  Ji Suk Jin is literally one of the legs of RM, without JSJ to me I'm confident to say Running Man wouldnt be the same. From Easy brothers to sunflower JSJ to the \"I swear\" moment which for me created one of the first LOL moments in the show, his comedic timing, his ability to make awkward moments fun and make boring moments exciting, JSJ's presence makes a whole lot of difference in this show.\n\nYoo Jae suk is also a legend and RM wouldnt be the same without him either. Not only is YJS a member but I also think he is  mastermind and a secret staff member lol who also gives ideas and offers constant encouragement to the staff, so that counts too.  I guess to win a daesang is more than what you bring into the show. I'm sad for JSJ but Yoo Jae suk congrats and Good luck for JSJ next year!",
            "author": "Emergency_Actuary217",
            "id": "j0r4j6i",
            "parent_id": "t3_zo9fx2",
            "score": 4,
            "created_utc": 1671394015.0,
            "replies": [
                {
                    "body": "Studies suggest that people who eat 1 ounce (30 grams) of sunflower seeds daily as part of a healthy diet may reduce fasting blood sugar by about 10% within six months, compared to a healthy diet alone. The blood-sugar-lowering effect of sunflower seeds may partially be due to the plant compound chlorogenic acid",
                    "author": "TheSunflowerSeeds",
                    "id": "j0r4kxs",
                    "parent_id": "t1_j0r4j6i",
                    "score": 1,
                    "created_utc": 1671394034.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "JSJ is not even stronger candidate than LSM or TJH. \n\nIdk why people claiming JSJ got robbed, unless he get another show in SBS. SBS will never give daesang to JSJ before LSM or TJH. (Both are leading members of 2 shows with good ratings). SBS is not just running man. \n\nAnd daesang is also most political award on ent awards, being in the same show with two influental figures with KJK and YJS lessen JSJ chance even more.",
            "author": "Moonz92",
            "id": "j0mzeny",
            "parent_id": "t3_zo9fx2",
            "score": 15,
            "created_utc": 1671315097.0,
            "replies": []
        },
        {
            "body": "19th daesang .... the GOAT",
            "author": "jumpybouncinglad",
            "id": "j0lljcm",
            "parent_id": "t3_zo9fx2",
            "score": 8,
            "created_utc": 1671294180.0,
            "replies": []
        },
        {
            "body": "what a robbery, JSJ has been straight up carrying the show this year \n\n&#x200B;\n\nYJS is the goat for immediately honoring the award for JSJ in the speech",
            "author": "MisterNoh",
            "id": "j0mjk05",
            "parent_id": "t3_zo9fx2",
            "score": 12,
            "created_utc": 1671308386.0,
            "replies": []
        },
        {
            "body": "I agree he deserves it, but I wonder if he has a room now full of trophies and plaques, he has been winning awards for decades now, year after year.",
            "author": "PatriceBoivin",
            "id": "j0nnrk5",
            "parent_id": "t3_zo9fx2",
            "score": 3,
            "created_utc": 1671326310.0,
            "replies": []
        },
        {
            "body": "Poor (가자의 쌂) fake life Ji SeokJin. It the the award show hosts SBS,, Shin DongYeop and Tak JaeHoon did our granddad dirty! Making him believe that he was going to win something. Maybe next year, Hyung!\n\nEDIT:: The whole speech was incredibly awkward! YJS spent most of his speech apologizing to JSJ profusely! It made the awkward situation 10x more awkward doing it live. I would've preferred him to do it privately.  But congratulations YJS on setting the gold standard for National MCs! Fighting!",
            "author": "blaquecousteau",
            "id": "j0vcq7e",
            "parent_id": "t3_zo9fx2",
            "score": 3,
            "created_utc": 1671474177.0,
            "replies": []
        },
        {
            "body": "WTF!!!!!!! \nI was hoping for JSJ \nHonestly, who they fk is making the decision to keep giving award to one person? \nAlso, they are really underming the contributions JSJ made to the running man show.",
            "author": "WangXian97",
            "id": "j0lra92",
            "parent_id": "t3_zo9fx2",
            "score": 10,
            "created_utc": 1671296607.0,
            "replies": []
        },
        {
            "body": "he shouldn’t be sorry! i’m so sad for him :(\nhe truly deserved it this year.",
            "author": "moonchildeus",
            "id": "j0ls9qx",
            "parent_id": "t3_zo9fx2",
            "score": 7,
            "created_utc": 1671297018.0,
            "replies": []
        },
        {
            "body": "Does SBS have something personal against JSJ? I know his early RM career was rocky, but I just don't get why he is always snubbed?",
            "author": "kokkirii",
            "id": "j0m0xmn",
            "parent_id": "t3_zo9fx2",
            "score": 6,
            "created_utc": 1671300649.0,
            "replies": [
                {
                    "body": "Closest I can think of is discrimination of age?",
                    "author": "shems-2383",
                    "id": "j0oiuik",
                    "parent_id": "t1_j0m0xmn",
                    "score": 2,
                    "created_utc": 1671342630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "happy for jae suk but suk jin sbs play him dirty again",
            "author": "Yooneunimcrazyfan",
            "id": "j0nu25c",
            "parent_id": "t3_zo9fx2",
            "score": 3,
            "created_utc": 1671329368.0,
            "replies": []
        },
        {
            "body": "This just makes me feel so sad for JSJ.  Why do SBS do this to him?😔😕 \nPs: I don't even think they acknowledged Kwangsoo enough for his contribution to RM through the dark years either.",
            "author": "Mission-Loquat9290",
            "id": "j0m55qc",
            "parent_id": "t3_zo9fx2",
            "score": 5,
            "created_utc": 1671302370.0,
            "replies": []
        },
        {
            "body": "Last year, out of all the nominees including TJH and JSJ, they gave My Little Old Boy, a high rating show a Grand daesang. This year out of all the nominees they decided to give YJS and even the MC said its actually meant for Running Man so they should all come on the stage as well. Probably because of low ratings, they don't dare to it give to the show directly. 🙄 Most awkward Grand Daesang moment again for the SBS. \n\n\nNevertheless congrats to YJS. Hopes running man goes in a good direction with their new time slot. Seems like SBS is giving them a last chance to prove themselves with that golden timeslot. Hope I am wrong. 😭",
            "author": "sonertimotei",
            "id": "j0nhphq",
            "parent_id": "t3_zo9fx2",
            "score": 4,
            "created_utc": 1671323398.0,
            "replies": []
        },
        {
            "body": "Congrats to YJS! He deserves it",
            "author": "FlimsyCartographer2",
            "id": "j0ll5md",
            "parent_id": "t3_zo9fx2",
            "score": 4,
            "created_utc": 1671294011.0,
            "replies": []
        },
        {
            "body": "back to back cringefest failed entertainment award. they shouldve given sukjin the daesang last year when he clearly deserved it. and they repeat the stupid decision again this year by giving daesang to jaesuk instead of tak jaehoon or lee sang min who gives much more contribution to sbs entertainment than jaesuk does. look at jaesuk's expression when his name got called. its like he admits that he didnt deserve the award",
            "author": "monganonga",
            "id": "j0lzjd0",
            "parent_id": "t3_zo9fx2",
            "score": 5,
            "created_utc": 1671300069.0,
            "replies": []
        },
        {
            "body": "I feel bad for JSJ but this year YJS carried RM so he definitely deserved it.",
            "author": "RumblesFish",
            "id": "j0obxmx",
            "parent_id": "t3_zo9fx2",
            "score": 2,
            "created_utc": 1671338502.0,
            "replies": []
        },
        {
            "body": "Absolutely asinine that SBS snubs JSJ again. This man has stepped up hard the last few years and his only consolation was essentially some bs participation award at last year's show.",
            "author": "HorseRadishDX",
            "id": "j0mvx67",
            "parent_id": "t3_zo9fx2",
            "score": 1,
            "created_utc": 1671313616.0,
            "replies": []
        },
        {
            "body": "I was really hoping Seokjin would win it this year. He outdid himself this year with running man and made himself look really stupid. I hope this doesn't kill his spirit and make him resentful.",
            "author": "Few-Particular1780",
            "id": "j0ov8q8",
            "parent_id": "t3_zo9fx2",
            "score": 1,
            "created_utc": 1671351811.0,
            "replies": [
                {
                    "body": "this year is nothing compares to last year. Last year he was doing more than a great job, but this year, Jae Suk is miles ahead",
                    "author": "XperiaSL",
                    "id": "j0p2qtz",
                    "parent_id": "t1_j0ov8q8",
                    "score": 1,
                    "created_utc": 1671358047.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🙌🏾🙌🏾🙌🏾",
            "author": "Puzzleheaded-Park-69",
            "id": "j0m6x51",
            "parent_id": "t3_zo9fx2",
            "score": 1,
            "created_utc": 1671303088.0,
            "replies": []
        },
        {
            "body": "Anyone is aware why haha and sechan is not appearing..?",
            "author": "Yellow0en",
            "id": "j0o90ta",
            "parent_id": "t3_zo9fx2",
            "score": 1,
            "created_utc": 1671336935.0,
            "replies": [
                {
                    "body": "Tested positive for Covid",
                    "author": "RumblesFish",
                    "id": "j0obvom",
                    "parent_id": "t1_j0o90ta",
                    "score": 2,
                    "created_utc": 1671338474.0,
                    "replies": [
                        {
                            "body": "Oh no. Thank you for the update ..",
                            "author": "Yellow0en",
                            "id": "j0obzji",
                            "parent_id": "t1_j0obvom",
                            "score": 1,
                            "created_utc": 1671338531.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "both having covid",
                    "author": "shems-2383",
                    "id": "j0obxka",
                    "parent_id": "t1_j0o90ta",
                    "score": 1,
                    "created_utc": 1671338501.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I may be out of the loop but what's with the JSJ having a chance with Daesang? I have always liked JSJ from star golden bell for his talking skills but I never thought he has any chances to get Daesang, even last year. Most of the time the main host of the show gets it, there are a lot of big names so I have no idea why people are saying JSJ can win it.",
            "author": "Radeon760",
            "id": "j0y2mfe",
            "parent_id": "t3_zo9fx2",
            "score": 0,
            "created_utc": 1671519192.0,
            "replies": []
        },
        {
            "body": "it indeed looks awkward, i was hoping for seokjin also",
            "author": "shems-2383",
            "id": "j0nm9w7",
            "parent_id": "t1_j0ljova",
            "score": 20,
            "created_utc": 1671325578.0,
            "replies": []
        },
        {
            "body": "That's the point. we all know YJS deserves Daesang every year even last year. If they can give the Daesang to the whole MUD cast last year then it's just appropriate to give it to JSJ this year as ultimate appreciation for his service.\n\nThe whole members and fans were hyping up JSJ this year and SBS know this. SBS know how awkward it will be for JSJ and everyone when another member wins it. They know it will create some news and stories and they love it. \n\nThey just don't take JSJ seriously. Giving a side award last year and this year made JSJ went up on the stage with that ID tag to talk about that award again.",
            "author": "Pyeonsae",
            "id": "j0obko0",
            "parent_id": "t1_j0ljova",
            "score": 23,
            "created_utc": 1671338309.0,
            "replies": []
        },
        {
            "body": "True. Even jihyo hug him.",
            "author": "Hefty-Association567",
            "id": "j0lq0jk",
            "parent_id": "t1_j0loof8",
            "score": 39,
            "created_utc": 1671296078.0,
            "replies": []
        },
        {
            "body": "It kinda sucks getting an award and knowing that your colleague deserves it more than you do. Unfortunately, that's just the way awards like this goes :/ \n\nNot discrediting YJS either cause I'm sure he'd love for both him and JSJ to get the award together.",
            "author": "CoG_Brotato",
            "id": "j0m7nx1",
            "parent_id": "t1_j0lkcll",
            "score": 22,
            "created_utc": 1671303393.0,
            "replies": [
                {
                    "body": "nah i couldnt say that jsj deserves it more from yjs this year but if we talked about last year, jsj is the most deserving. it shouldve been jsj daesang last year",
                    "author": "kentwansue",
                    "id": "j0nspn3",
                    "parent_id": "t1_j0m7nx1",
                    "score": 20,
                    "created_utc": 1671328720.0,
                    "replies": []
                },
                {
                    "body": "In terms of deserve, I don't know how you can argue winner shouldn't be yjs every year.  He beats JSJ handily.  \n\nIt feels bad though that you know YJS would much prefer JSJ win.",
                    "author": "Fudouri",
                    "id": "j0ol5ly",
                    "parent_id": "t1_j0m7nx1",
                    "score": 10,
                    "created_utc": 1671344169.0,
                    "replies": [
                        {
                            "body": "Deserve really wasn't the best word there but my point still stands. Every member on the RM team deserves an award even if it's not the Daesang. YJS is clearly a rank above everyone else but he does so much that we don't see to support the other members.\n\nI do hope JSJ gets his soon though. He honestly deserves it after having to deal with so much and is now having such a good past few years.",
                            "author": "CoG_Brotato",
                            "id": "j0px2d2",
                            "parent_id": "t1_j0ol5ly",
                            "score": 3,
                            "created_utc": 1671377369.0,
                            "replies": [
                                {
                                    "body": "I think SBS had a choice.  They can treat JSJ as secondary player on a popular show (haha, so min, sechan).  In that case, he shouldn't even be nominated.  \n\nOr they can just give it to him after teasing every year.\n\nI wouldn't react this way if they sent down either of these routes.\n\nTo do this is just mean hearted.",
                                    "author": "Fudouri",
                                    "id": "j0pxir9",
                                    "parent_id": "t1_j0px2d2",
                                    "score": 3,
                                    "created_utc": 1671377572.0,
                                    "replies": [
                                        {
                                            "body": "Agreed, but we can speculate as much as we want to but it won't matter and is a waste of time to do so. Celebrating the members for receiving awards is obvious but we can show that same energy by enjoying the entertainment they've provided over the years.\n\nIt's one measly award given every year and while it'd be nice for different RM members to receive it, there's no guarantee. I'd rather support them by watching RM and the other shows they're part of.",
                                            "author": "CoG_Brotato",
                                            "id": "j0qr6e5",
                                            "parent_id": "t1_j0pxir9",
                                            "score": 1,
                                            "created_utc": 1671388952.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "JSJ isn't anywhere as popular as YJS is by SBS staff and his colleagues! He's demeanor always comes off as fake!",
            "author": "blaquecousteau",
            "id": "j0ve5h1",
            "parent_id": "t1_j0lkcll",
            "score": 1,
            "created_utc": 1671474732.0,
            "replies": []
        },
        {
            "body": "agreed. happy for YJS but this just creates an awkward tension, couldnt imagine how they will take the daesang joke in the next episodes.",
            "author": "snekplet",
            "id": "j0lvpvi",
            "parent_id": "t1_j0lkzn8",
            "score": 25,
            "created_utc": 1671298468.0,
            "replies": []
        },
        {
            "body": "Tak jae hoon won daesang as an individual before, but long time ago.",
            "author": "timematoom",
            "id": "j0p5br4",
            "parent_id": "t1_j0lkzn8",
            "score": 2,
            "created_utc": 1671360218.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j0loshm",
            "parent_id": "t1_j0lkyfj",
            "score": -47,
            "created_utc": 1671295565.0,
            "replies": [
                {
                    "body": "Well if you RM fans you should kbow JSJ equally deserve. But just look last year gave JSJ nonsense award and making false hope its really kind of embarassing him  if you see YJS speech he even feel sorry towards JSJ. even Jihyo hug him. And the atmosphere is really awkard there.",
                    "author": "Hefty-Association567",
                    "id": "j0lpsqz",
                    "parent_id": "t1_j0loshm",
                    "score": 33,
                    "created_utc": 1671295988.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j0lsnnz",
                            "parent_id": "t1_j0lpsqz",
                            "score": -34,
                            "created_utc": 1671297183.0,
                            "replies": [
                                {
                                    "body": ">But SBS would risk a lot giving Daesang to JSJ as it represents the best of their company.\n\nIf that's your argument, then SBS could have just gave the award to the entire RM cast instead, just like on what they did to MUD last year. \n\nI'm not saying that YJS doesn't deserve it, but I just hate the build up and anticipation while watching it live, on which YJS is also got flustered and glanced at JSJ first when he was called up for the prize.",
                                    "author": "EpikMint",
                                    "id": "j0lvj4j",
                                    "parent_id": "t1_j0lsnnz",
                                    "score": 16,
                                    "created_utc": 1671298389.0,
                                    "replies": []
                                },
                                {
                                    "body": "You will never understand it. You missing the dynamic and atmosphere.",
                                    "author": "Hefty-Association567",
                                    "id": "j0lt274",
                                    "parent_id": "t1_j0lsnnz",
                                    "score": 10,
                                    "created_utc": 1671297350.0,
                                    "replies": []
                                },
                                {
                                    "body": "Wait, I thought you said the award wasn't a sympathy award, but based on talent and who deserves it? Now you're saying they won't give someone that award because they don't want them representing that company? Well, then clearly it isn't an award based on talent and merits and accomplishments but who the company wants as the face of the brand.",
                                    "author": "Ancient_Reply4583",
                                    "id": "j0lvjgv",
                                    "parent_id": "t1_j0lsnnz",
                                    "score": 3,
                                    "created_utc": 1671298392.0,
                                    "replies": []
                                },
                                {
                                    "body": "idk why you got many downvote, you tell the truth, if JSJ win Daesang award, it would make another speculations, and make Daesang Award looks so \"rigid\", but still, i respect him, JSJ is a hardworker man",
                                    "author": "ohiroze",
                                    "id": "j0mb7lr",
                                    "parent_id": "t1_j0lsnnz",
                                    "score": -3,
                                    "created_utc": 1671304847.0,
                                    "replies": [
                                        {
                                            "body": "Then why not give it to Tak Jae Hoon or Lee Sang Min instead? Other than JSJ, there are viewers who wants the award to go to either TJH and LSM. \n\nSBS already messed up last year for being indecisive and sending the prize to multiple people. They could have redeemed themselves this year for not ignoring JSJ (or the other nominees) but gave it to YJS (whose also expecting his bestfriend to win) instead. \n\nThe aftermath? SBS right now is being criticized by korean netizens again. Most of the comments from the red carpet pre-show @ Youtube are bombarded with disappointments that they snubbed JSJ.\n\nEdit: what's worse is that YJS is getting dragged. SBS really messed up for the 2nd time in a row.",
                                            "author": "EpikMint",
                                            "id": "j0mrm1n",
                                            "parent_id": "t1_j0mb7lr",
                                            "score": 5,
                                            "created_utc": 1671311801.0,
                                            "replies": [
                                                {
                                                    "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
                                                    "author": "lolminna",
                                                    "id": "j0nkk89",
                                                    "parent_id": "t1_j0mrm1n",
                                                    "score": 6,
                                                    "created_utc": 1671324749.0,
                                                    "replies": [
                                                        {
                                                            "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                                                            "author": "teukkiu",
                                                            "id": "j0r327y",
                                                            "parent_id": "t1_j0nkk89",
                                                            "score": 2,
                                                            "created_utc": 1671393439.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
                                                    "author": "slooobs",
                                                    "id": "j0no36f",
                                                    "parent_id": "t1_j0mrm1n",
                                                    "score": 2,
                                                    "created_utc": 1671326469.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
                                                    "author": "ohiroze",
                                                    "id": "j0mupif",
                                                    "parent_id": "t1_j0mrm1n",
                                                    "score": 1,
                                                    "created_utc": 1671313093.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">JSJ is a hardworker man\n\nThis is so funny, he literally delegate his job to his colleague during his captaincy because he thinks he worked so hard during that time. \n\nYJS literally did tons of programs and never complaint.\n\nlmao.",
                                            "author": "kripkrip",
                                            "id": "j0muuzj",
                                            "parent_id": "t1_j0mb7lr",
                                            "score": -1,
                                            "created_utc": 1671313157.0,
                                            "replies": [
                                                {
                                                    "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
                                                    "author": "ohiroze",
                                                    "id": "j0mws2r",
                                                    "parent_id": "t1_j0muuzj",
                                                    "score": 2,
                                                    "created_utc": 1671313985.0,
                                                    "replies": [
                                                        {
                                                            "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                                                            "author": "kripkrip",
                                                            "id": "j0n0x63",
                                                            "parent_id": "t1_j0mws2r",
                                                            "score": -2,
                                                            "created_utc": 1671315764.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                                                                    "author": "ohiroze",
                                                                    "id": "j0n6vkd",
                                                                    "parent_id": "t1_j0n0x63",
                                                                    "score": 3,
                                                                    "created_utc": 1671318417.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Nope. If you really watch the show, you should know that JSJ has improved so much over the year. \nAnd he has been really entertaining and contributing. \nHe's quite an all rounder from entertainment scene, to music to doing his own YouTube channel.",
                    "author": "WangXian97",
                    "id": "j0lr03y",
                    "parent_id": "t1_j0loshm",
                    "score": 24,
                    "created_utc": 1671296486.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you haven't tried it, I think you should try watching MUD. It's one of the funniest shows on TV, like cry laughing, wheezing level of funny. I'm saying this as a fan of running man, that rarely misses an episode. You'd understand why it was reasonable for them to get the daesang last year.",
            "author": "Few-Particular1780",
            "id": "j0ovo46",
            "parent_id": "t1_j0lqamn",
            "score": 3,
            "created_utc": 1671352149.0,
            "replies": [
                {
                    "body": "That's true. But it kinda felt iffy since they won team daesang, not once, but twice. While the RM never won team daesang during their golden years.",
                    "author": "Kylaste",
                    "id": "j0rorz7",
                    "parent_id": "t1_j0ovo46",
                    "score": 3,
                    "created_utc": 1671402194.0,
                    "replies": []
                },
                {
                    "body": "I have tried it before but I don't like the concept or most of the cast.",
                    "author": "fadedcosy",
                    "id": "j0owalk",
                    "parent_id": "t1_j0ovo46",
                    "score": 1,
                    "created_utc": 1671352663.0,
                    "replies": [
                        {
                            "body": "For me I only watch the highlights in yt…tried to watch also but not my cup of tea…",
                            "author": "shems-2383",
                            "id": "j0pnpl3",
                            "parent_id": "t1_j0owalk",
                            "score": 4,
                            "created_utc": 1671372833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It wasn’t a made up award. Other people won the honorary employee award before he did",
            "author": "FlimsyCartographer2",
            "id": "j0mdzya",
            "parent_id": "t1_j0lxxmy",
            "score": 15,
            "created_utc": 1671306016.0,
            "replies": []
        },
        {
            "body": "Finally a voice of reason. \n\nTo be honest even last year he was mostly up for it because he blew up from being on MSG Wannabe which was on MBC anyway but it was his best chance for sure",
            "author": "banethor88",
            "id": "j0n12td",
            "parent_id": "t1_j0m49gx",
            "score": 13,
            "created_utc": 1671315831.0,
            "replies": [
                {
                    "body": "While I see your reasons, I disagree. I think JSJ should've won it this year after the travesty that was last year. Hear me out:\n\nIn the 1997 season of the NBA, Karl Malone won MVP despite Michael Jordan having the best stats. Why? Because of voter fatigue; voter fatigue is when people think a nominee has won enough so they vote for someone else instead.\n\nIn 2008, the MVP race in the NBA was between Chris Paul and Kobe Bryant. Kobe at that point was near mythical; however he hadn't gotten an MVP award. Meanwhile Chris Paul was a superstar PG who was putting slightly superior stats to Kobe. But Kobe won that year, why is that? Because there were many years that he was close to winning them, and he deserved to get one for the performances he had over the years. It's like a respect MVP.\n\nJSJ deserved to get a respect daesang this year. I think the majority of Knetz and RM fans here will agree with me that YJS has enough daesangs, he doesn't need one more, even if he has \"superior stats\" to JSJ. It would also be an apology to the bad taste joke they did last year, and show that SBS is in touch with their audience more than just seeing them through ratings numbers. Sadly that's not the case.",
                    "author": "lolminna",
                    "id": "j0nlv01",
                    "parent_id": "t1_j0n12td",
                    "score": -7,
                    "created_utc": 1671325376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tbh, I also watch MUD regularly and Bachelors again every now and then. I still think JSJ deserved to be given the daesang, although it won't have been surprising if it when to the MUD cast because MUD was peak comedy this year.",
            "author": "Few-Particular1780",
            "id": "j0ovwsc",
            "parent_id": "t1_j0m49gx",
            "score": 0,
            "created_utc": 1671352354.0,
            "replies": []
        },
        {
            "body": "I just feel that they indirectly wants to drop the rm program from now onwards….",
            "author": "shems-2383",
            "id": "j0on12f",
            "parent_id": "t1_j0mj30g",
            "score": 2,
            "created_utc": 1671345474.0,
            "replies": [
                {
                    "body": "In Korean entertainment PDs almost never leave the program/company because “they want to try something new”, “they found better opportunities”, etc.\n\nThey are forced/coerced to move on.",
                    "author": "gyojoo",
                    "id": "j0qveca",
                    "parent_id": "t1_j0on12f",
                    "score": 2,
                    "created_utc": 1671390456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Low key the MC part made the whole situation even more awkward",
            "author": "EmploymentOk6815",
            "id": "j0loqq1",
            "parent_id": "t1_j0ln1ia",
            "score": 41,
            "created_utc": 1671295544.0,
            "replies": []
        },
        {
            "body": "I don’t think SBS hates JSJ. Big Nose deserves more recognition for what he’s done the past two years and especially after LKS left RM, but YJS is still the face of the franchise and the most popular MC in SK. It can be argued JSJ, LKS and Somin all have deserved to win the grand award at some point too but they haven’t/didn’t.",
            "author": "buddhabear07",
            "id": "j0lqa00",
            "parent_id": "t1_j0ln1ia",
            "score": 16,
            "created_utc": 1671296185.0,
            "replies": [
                {
                    "body": "To compare JSJ with LKS and JSM is a bit ridiculous. The man has been in this industry for 30 years, that's basically all of LKS and JSM's lives! Compared to him, LKS has only been in this industry for 12 and JSM only 5 years. Both LKS and JSM are talented and deserving of recognition, don't get me wrong - but this should've gone to JSJ.",
                    "author": "Ancient_Reply4583",
                    "id": "j0lw2p2",
                    "parent_id": "t1_j0lqa00",
                    "score": 20,
                    "created_utc": 1671298615.0,
                    "replies": [
                        {
                            "body": "JSJ deserved the Daesang last year. I would have been thrilled if he got it now. Yes, he’s been in the business a long time but it’s not a lifetime achievement award though is it? I thought it was some combination of popularity, impact and talent which both LKS and Somin fit at least for me. I’m okay with YJS winning but SBS seems to have odd way of picking winner here.",
                            "author": "buddhabear07",
                            "id": "j0lxk2z",
                            "parent_id": "t1_j0lw2p2",
                            "score": 6,
                            "created_utc": 1671299237.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Studies suggest that people who eat 1 ounce (30 grams) of sunflower seeds daily as part of a healthy diet may reduce fasting blood sugar by about 10% within six months, compared to a healthy diet alone. The blood-sugar-lowering effect of sunflower seeds may partially be due to the plant compound chlorogenic acid",
            "author": "TheSunflowerSeeds",
            "id": "j0r4kxs",
            "parent_id": "t1_j0r4j6i",
            "score": 1,
            "created_utc": 1671394034.0,
            "replies": []
        },
        {
            "body": "Closest I can think of is discrimination of age?",
            "author": "shems-2383",
            "id": "j0oiuik",
            "parent_id": "t1_j0m0xmn",
            "score": 2,
            "created_utc": 1671342630.0,
            "replies": []
        },
        {
            "body": "this year is nothing compares to last year. Last year he was doing more than a great job, but this year, Jae Suk is miles ahead",
            "author": "XperiaSL",
            "id": "j0p2qtz",
            "parent_id": "t1_j0ov8q8",
            "score": 1,
            "created_utc": 1671358047.0,
            "replies": []
        },
        {
            "body": "Tested positive for Covid",
            "author": "RumblesFish",
            "id": "j0obvom",
            "parent_id": "t1_j0o90ta",
            "score": 2,
            "created_utc": 1671338474.0,
            "replies": [
                {
                    "body": "Oh no. Thank you for the update ..",
                    "author": "Yellow0en",
                    "id": "j0obzji",
                    "parent_id": "t1_j0obvom",
                    "score": 1,
                    "created_utc": 1671338531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "both having covid",
            "author": "shems-2383",
            "id": "j0obxka",
            "parent_id": "t1_j0o90ta",
            "score": 1,
            "created_utc": 1671338501.0,
            "replies": []
        },
        {
            "body": "nah i couldnt say that jsj deserves it more from yjs this year but if we talked about last year, jsj is the most deserving. it shouldve been jsj daesang last year",
            "author": "kentwansue",
            "id": "j0nspn3",
            "parent_id": "t1_j0m7nx1",
            "score": 20,
            "created_utc": 1671328720.0,
            "replies": []
        },
        {
            "body": "In terms of deserve, I don't know how you can argue winner shouldn't be yjs every year.  He beats JSJ handily.  \n\nIt feels bad though that you know YJS would much prefer JSJ win.",
            "author": "Fudouri",
            "id": "j0ol5ly",
            "parent_id": "t1_j0m7nx1",
            "score": 10,
            "created_utc": 1671344169.0,
            "replies": [
                {
                    "body": "Deserve really wasn't the best word there but my point still stands. Every member on the RM team deserves an award even if it's not the Daesang. YJS is clearly a rank above everyone else but he does so much that we don't see to support the other members.\n\nI do hope JSJ gets his soon though. He honestly deserves it after having to deal with so much and is now having such a good past few years.",
                    "author": "CoG_Brotato",
                    "id": "j0px2d2",
                    "parent_id": "t1_j0ol5ly",
                    "score": 3,
                    "created_utc": 1671377369.0,
                    "replies": [
                        {
                            "body": "I think SBS had a choice.  They can treat JSJ as secondary player on a popular show (haha, so min, sechan).  In that case, he shouldn't even be nominated.  \n\nOr they can just give it to him after teasing every year.\n\nI wouldn't react this way if they sent down either of these routes.\n\nTo do this is just mean hearted.",
                            "author": "Fudouri",
                            "id": "j0pxir9",
                            "parent_id": "t1_j0px2d2",
                            "score": 3,
                            "created_utc": 1671377572.0,
                            "replies": [
                                {
                                    "body": "Agreed, but we can speculate as much as we want to but it won't matter and is a waste of time to do so. Celebrating the members for receiving awards is obvious but we can show that same energy by enjoying the entertainment they've provided over the years.\n\nIt's one measly award given every year and while it'd be nice for different RM members to receive it, there's no guarantee. I'd rather support them by watching RM and the other shows they're part of.",
                                    "author": "CoG_Brotato",
                                    "id": "j0qr6e5",
                                    "parent_id": "t1_j0pxir9",
                                    "score": 1,
                                    "created_utc": 1671388952.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well if you RM fans you should kbow JSJ equally deserve. But just look last year gave JSJ nonsense award and making false hope its really kind of embarassing him  if you see YJS speech he even feel sorry towards JSJ. even Jihyo hug him. And the atmosphere is really awkard there.",
            "author": "Hefty-Association567",
            "id": "j0lpsqz",
            "parent_id": "t1_j0loshm",
            "score": 33,
            "created_utc": 1671295988.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j0lsnnz",
                    "parent_id": "t1_j0lpsqz",
                    "score": -34,
                    "created_utc": 1671297183.0,
                    "replies": [
                        {
                            "body": ">But SBS would risk a lot giving Daesang to JSJ as it represents the best of their company.\n\nIf that's your argument, then SBS could have just gave the award to the entire RM cast instead, just like on what they did to MUD last year. \n\nI'm not saying that YJS doesn't deserve it, but I just hate the build up and anticipation while watching it live, on which YJS is also got flustered and glanced at JSJ first when he was called up for the prize.",
                            "author": "EpikMint",
                            "id": "j0lvj4j",
                            "parent_id": "t1_j0lsnnz",
                            "score": 16,
                            "created_utc": 1671298389.0,
                            "replies": []
                        },
                        {
                            "body": "You will never understand it. You missing the dynamic and atmosphere.",
                            "author": "Hefty-Association567",
                            "id": "j0lt274",
                            "parent_id": "t1_j0lsnnz",
                            "score": 10,
                            "created_utc": 1671297350.0,
                            "replies": []
                        },
                        {
                            "body": "Wait, I thought you said the award wasn't a sympathy award, but based on talent and who deserves it? Now you're saying they won't give someone that award because they don't want them representing that company? Well, then clearly it isn't an award based on talent and merits and accomplishments but who the company wants as the face of the brand.",
                            "author": "Ancient_Reply4583",
                            "id": "j0lvjgv",
                            "parent_id": "t1_j0lsnnz",
                            "score": 3,
                            "created_utc": 1671298392.0,
                            "replies": []
                        },
                        {
                            "body": "idk why you got many downvote, you tell the truth, if JSJ win Daesang award, it would make another speculations, and make Daesang Award looks so \"rigid\", but still, i respect him, JSJ is a hardworker man",
                            "author": "ohiroze",
                            "id": "j0mb7lr",
                            "parent_id": "t1_j0lsnnz",
                            "score": -3,
                            "created_utc": 1671304847.0,
                            "replies": [
                                {
                                    "body": "Then why not give it to Tak Jae Hoon or Lee Sang Min instead? Other than JSJ, there are viewers who wants the award to go to either TJH and LSM. \n\nSBS already messed up last year for being indecisive and sending the prize to multiple people. They could have redeemed themselves this year for not ignoring JSJ (or the other nominees) but gave it to YJS (whose also expecting his bestfriend to win) instead. \n\nThe aftermath? SBS right now is being criticized by korean netizens again. Most of the comments from the red carpet pre-show @ Youtube are bombarded with disappointments that they snubbed JSJ.\n\nEdit: what's worse is that YJS is getting dragged. SBS really messed up for the 2nd time in a row.",
                                    "author": "EpikMint",
                                    "id": "j0mrm1n",
                                    "parent_id": "t1_j0mb7lr",
                                    "score": 5,
                                    "created_utc": 1671311801.0,
                                    "replies": [
                                        {
                                            "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
                                            "author": "lolminna",
                                            "id": "j0nkk89",
                                            "parent_id": "t1_j0mrm1n",
                                            "score": 6,
                                            "created_utc": 1671324749.0,
                                            "replies": [
                                                {
                                                    "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                                                    "author": "teukkiu",
                                                    "id": "j0r327y",
                                                    "parent_id": "t1_j0nkk89",
                                                    "score": 2,
                                                    "created_utc": 1671393439.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
                                            "author": "slooobs",
                                            "id": "j0no36f",
                                            "parent_id": "t1_j0mrm1n",
                                            "score": 2,
                                            "created_utc": 1671326469.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
                                            "author": "ohiroze",
                                            "id": "j0mupif",
                                            "parent_id": "t1_j0mrm1n",
                                            "score": 1,
                                            "created_utc": 1671313093.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">JSJ is a hardworker man\n\nThis is so funny, he literally delegate his job to his colleague during his captaincy because he thinks he worked so hard during that time. \n\nYJS literally did tons of programs and never complaint.\n\nlmao.",
                                    "author": "kripkrip",
                                    "id": "j0muuzj",
                                    "parent_id": "t1_j0mb7lr",
                                    "score": -1,
                                    "created_utc": 1671313157.0,
                                    "replies": [
                                        {
                                            "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
                                            "author": "ohiroze",
                                            "id": "j0mws2r",
                                            "parent_id": "t1_j0muuzj",
                                            "score": 2,
                                            "created_utc": 1671313985.0,
                                            "replies": [
                                                {
                                                    "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                                                    "author": "kripkrip",
                                                    "id": "j0n0x63",
                                                    "parent_id": "t1_j0mws2r",
                                                    "score": -2,
                                                    "created_utc": 1671315764.0,
                                                    "replies": [
                                                        {
                                                            "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                                                            "author": "ohiroze",
                                                            "id": "j0n6vkd",
                                                            "parent_id": "t1_j0n0x63",
                                                            "score": 3,
                                                            "created_utc": 1671318417.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nope. If you really watch the show, you should know that JSJ has improved so much over the year. \nAnd he has been really entertaining and contributing. \nHe's quite an all rounder from entertainment scene, to music to doing his own YouTube channel.",
            "author": "WangXian97",
            "id": "j0lr03y",
            "parent_id": "t1_j0loshm",
            "score": 24,
            "created_utc": 1671296486.0,
            "replies": []
        },
        {
            "body": "That's true. But it kinda felt iffy since they won team daesang, not once, but twice. While the RM never won team daesang during their golden years.",
            "author": "Kylaste",
            "id": "j0rorz7",
            "parent_id": "t1_j0ovo46",
            "score": 3,
            "created_utc": 1671402194.0,
            "replies": []
        },
        {
            "body": "I have tried it before but I don't like the concept or most of the cast.",
            "author": "fadedcosy",
            "id": "j0owalk",
            "parent_id": "t1_j0ovo46",
            "score": 1,
            "created_utc": 1671352663.0,
            "replies": [
                {
                    "body": "For me I only watch the highlights in yt…tried to watch also but not my cup of tea…",
                    "author": "shems-2383",
                    "id": "j0pnpl3",
                    "parent_id": "t1_j0owalk",
                    "score": 4,
                    "created_utc": 1671372833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While I see your reasons, I disagree. I think JSJ should've won it this year after the travesty that was last year. Hear me out:\n\nIn the 1997 season of the NBA, Karl Malone won MVP despite Michael Jordan having the best stats. Why? Because of voter fatigue; voter fatigue is when people think a nominee has won enough so they vote for someone else instead.\n\nIn 2008, the MVP race in the NBA was between Chris Paul and Kobe Bryant. Kobe at that point was near mythical; however he hadn't gotten an MVP award. Meanwhile Chris Paul was a superstar PG who was putting slightly superior stats to Kobe. But Kobe won that year, why is that? Because there were many years that he was close to winning them, and he deserved to get one for the performances he had over the years. It's like a respect MVP.\n\nJSJ deserved to get a respect daesang this year. I think the majority of Knetz and RM fans here will agree with me that YJS has enough daesangs, he doesn't need one more, even if he has \"superior stats\" to JSJ. It would also be an apology to the bad taste joke they did last year, and show that SBS is in touch with their audience more than just seeing them through ratings numbers. Sadly that's not the case.",
            "author": "lolminna",
            "id": "j0nlv01",
            "parent_id": "t1_j0n12td",
            "score": -7,
            "created_utc": 1671325376.0,
            "replies": []
        },
        {
            "body": "In Korean entertainment PDs almost never leave the program/company because “they want to try something new”, “they found better opportunities”, etc.\n\nThey are forced/coerced to move on.",
            "author": "gyojoo",
            "id": "j0qveca",
            "parent_id": "t1_j0on12f",
            "score": 2,
            "created_utc": 1671390456.0,
            "replies": []
        },
        {
            "body": "To compare JSJ with LKS and JSM is a bit ridiculous. The man has been in this industry for 30 years, that's basically all of LKS and JSM's lives! Compared to him, LKS has only been in this industry for 12 and JSM only 5 years. Both LKS and JSM are talented and deserving of recognition, don't get me wrong - but this should've gone to JSJ.",
            "author": "Ancient_Reply4583",
            "id": "j0lw2p2",
            "parent_id": "t1_j0lqa00",
            "score": 20,
            "created_utc": 1671298615.0,
            "replies": [
                {
                    "body": "JSJ deserved the Daesang last year. I would have been thrilled if he got it now. Yes, he’s been in the business a long time but it’s not a lifetime achievement award though is it? I thought it was some combination of popularity, impact and talent which both LKS and Somin fit at least for me. I’m okay with YJS winning but SBS seems to have odd way of picking winner here.",
                    "author": "buddhabear07",
                    "id": "j0lxk2z",
                    "parent_id": "t1_j0lw2p2",
                    "score": 6,
                    "created_utc": 1671299237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh no. Thank you for the update ..",
            "author": "Yellow0en",
            "id": "j0obzji",
            "parent_id": "t1_j0obvom",
            "score": 1,
            "created_utc": 1671338531.0,
            "replies": []
        },
        {
            "body": "Deserve really wasn't the best word there but my point still stands. Every member on the RM team deserves an award even if it's not the Daesang. YJS is clearly a rank above everyone else but he does so much that we don't see to support the other members.\n\nI do hope JSJ gets his soon though. He honestly deserves it after having to deal with so much and is now having such a good past few years.",
            "author": "CoG_Brotato",
            "id": "j0px2d2",
            "parent_id": "t1_j0ol5ly",
            "score": 3,
            "created_utc": 1671377369.0,
            "replies": [
                {
                    "body": "I think SBS had a choice.  They can treat JSJ as secondary player on a popular show (haha, so min, sechan).  In that case, he shouldn't even be nominated.  \n\nOr they can just give it to him after teasing every year.\n\nI wouldn't react this way if they sent down either of these routes.\n\nTo do this is just mean hearted.",
                    "author": "Fudouri",
                    "id": "j0pxir9",
                    "parent_id": "t1_j0px2d2",
                    "score": 3,
                    "created_utc": 1671377572.0,
                    "replies": [
                        {
                            "body": "Agreed, but we can speculate as much as we want to but it won't matter and is a waste of time to do so. Celebrating the members for receiving awards is obvious but we can show that same energy by enjoying the entertainment they've provided over the years.\n\nIt's one measly award given every year and while it'd be nice for different RM members to receive it, there's no guarantee. I'd rather support them by watching RM and the other shows they're part of.",
                            "author": "CoG_Brotato",
                            "id": "j0qr6e5",
                            "parent_id": "t1_j0pxir9",
                            "score": 1,
                            "created_utc": 1671388952.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j0lsnnz",
            "parent_id": "t1_j0lpsqz",
            "score": -34,
            "created_utc": 1671297183.0,
            "replies": [
                {
                    "body": ">But SBS would risk a lot giving Daesang to JSJ as it represents the best of their company.\n\nIf that's your argument, then SBS could have just gave the award to the entire RM cast instead, just like on what they did to MUD last year. \n\nI'm not saying that YJS doesn't deserve it, but I just hate the build up and anticipation while watching it live, on which YJS is also got flustered and glanced at JSJ first when he was called up for the prize.",
                    "author": "EpikMint",
                    "id": "j0lvj4j",
                    "parent_id": "t1_j0lsnnz",
                    "score": 16,
                    "created_utc": 1671298389.0,
                    "replies": []
                },
                {
                    "body": "You will never understand it. You missing the dynamic and atmosphere.",
                    "author": "Hefty-Association567",
                    "id": "j0lt274",
                    "parent_id": "t1_j0lsnnz",
                    "score": 10,
                    "created_utc": 1671297350.0,
                    "replies": []
                },
                {
                    "body": "Wait, I thought you said the award wasn't a sympathy award, but based on talent and who deserves it? Now you're saying they won't give someone that award because they don't want them representing that company? Well, then clearly it isn't an award based on talent and merits and accomplishments but who the company wants as the face of the brand.",
                    "author": "Ancient_Reply4583",
                    "id": "j0lvjgv",
                    "parent_id": "t1_j0lsnnz",
                    "score": 3,
                    "created_utc": 1671298392.0,
                    "replies": []
                },
                {
                    "body": "idk why you got many downvote, you tell the truth, if JSJ win Daesang award, it would make another speculations, and make Daesang Award looks so \"rigid\", but still, i respect him, JSJ is a hardworker man",
                    "author": "ohiroze",
                    "id": "j0mb7lr",
                    "parent_id": "t1_j0lsnnz",
                    "score": -3,
                    "created_utc": 1671304847.0,
                    "replies": [
                        {
                            "body": "Then why not give it to Tak Jae Hoon or Lee Sang Min instead? Other than JSJ, there are viewers who wants the award to go to either TJH and LSM. \n\nSBS already messed up last year for being indecisive and sending the prize to multiple people. They could have redeemed themselves this year for not ignoring JSJ (or the other nominees) but gave it to YJS (whose also expecting his bestfriend to win) instead. \n\nThe aftermath? SBS right now is being criticized by korean netizens again. Most of the comments from the red carpet pre-show @ Youtube are bombarded with disappointments that they snubbed JSJ.\n\nEdit: what's worse is that YJS is getting dragged. SBS really messed up for the 2nd time in a row.",
                            "author": "EpikMint",
                            "id": "j0mrm1n",
                            "parent_id": "t1_j0mb7lr",
                            "score": 5,
                            "created_utc": 1671311801.0,
                            "replies": [
                                {
                                    "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
                                    "author": "lolminna",
                                    "id": "j0nkk89",
                                    "parent_id": "t1_j0mrm1n",
                                    "score": 6,
                                    "created_utc": 1671324749.0,
                                    "replies": [
                                        {
                                            "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                                            "author": "teukkiu",
                                            "id": "j0r327y",
                                            "parent_id": "t1_j0nkk89",
                                            "score": 2,
                                            "created_utc": 1671393439.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
                                    "author": "slooobs",
                                    "id": "j0no36f",
                                    "parent_id": "t1_j0mrm1n",
                                    "score": 2,
                                    "created_utc": 1671326469.0,
                                    "replies": []
                                },
                                {
                                    "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
                                    "author": "ohiroze",
                                    "id": "j0mupif",
                                    "parent_id": "t1_j0mrm1n",
                                    "score": 1,
                                    "created_utc": 1671313093.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">JSJ is a hardworker man\n\nThis is so funny, he literally delegate his job to his colleague during his captaincy because he thinks he worked so hard during that time. \n\nYJS literally did tons of programs and never complaint.\n\nlmao.",
                            "author": "kripkrip",
                            "id": "j0muuzj",
                            "parent_id": "t1_j0mb7lr",
                            "score": -1,
                            "created_utc": 1671313157.0,
                            "replies": [
                                {
                                    "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
                                    "author": "ohiroze",
                                    "id": "j0mws2r",
                                    "parent_id": "t1_j0muuzj",
                                    "score": 2,
                                    "created_utc": 1671313985.0,
                                    "replies": [
                                        {
                                            "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                                            "author": "kripkrip",
                                            "id": "j0n0x63",
                                            "parent_id": "t1_j0mws2r",
                                            "score": -2,
                                            "created_utc": 1671315764.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                                                    "author": "ohiroze",
                                                    "id": "j0n6vkd",
                                                    "parent_id": "t1_j0n0x63",
                                                    "score": 3,
                                                    "created_utc": 1671318417.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For me I only watch the highlights in yt…tried to watch also but not my cup of tea…",
            "author": "shems-2383",
            "id": "j0pnpl3",
            "parent_id": "t1_j0owalk",
            "score": 4,
            "created_utc": 1671372833.0,
            "replies": []
        },
        {
            "body": "JSJ deserved the Daesang last year. I would have been thrilled if he got it now. Yes, he’s been in the business a long time but it’s not a lifetime achievement award though is it? I thought it was some combination of popularity, impact and talent which both LKS and Somin fit at least for me. I’m okay with YJS winning but SBS seems to have odd way of picking winner here.",
            "author": "buddhabear07",
            "id": "j0lxk2z",
            "parent_id": "t1_j0lw2p2",
            "score": 6,
            "created_utc": 1671299237.0,
            "replies": []
        },
        {
            "body": "I think SBS had a choice.  They can treat JSJ as secondary player on a popular show (haha, so min, sechan).  In that case, he shouldn't even be nominated.  \n\nOr they can just give it to him after teasing every year.\n\nI wouldn't react this way if they sent down either of these routes.\n\nTo do this is just mean hearted.",
            "author": "Fudouri",
            "id": "j0pxir9",
            "parent_id": "t1_j0px2d2",
            "score": 3,
            "created_utc": 1671377572.0,
            "replies": [
                {
                    "body": "Agreed, but we can speculate as much as we want to but it won't matter and is a waste of time to do so. Celebrating the members for receiving awards is obvious but we can show that same energy by enjoying the entertainment they've provided over the years.\n\nIt's one measly award given every year and while it'd be nice for different RM members to receive it, there's no guarantee. I'd rather support them by watching RM and the other shows they're part of.",
                    "author": "CoG_Brotato",
                    "id": "j0qr6e5",
                    "parent_id": "t1_j0pxir9",
                    "score": 1,
                    "created_utc": 1671388952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">But SBS would risk a lot giving Daesang to JSJ as it represents the best of their company.\n\nIf that's your argument, then SBS could have just gave the award to the entire RM cast instead, just like on what they did to MUD last year. \n\nI'm not saying that YJS doesn't deserve it, but I just hate the build up and anticipation while watching it live, on which YJS is also got flustered and glanced at JSJ first when he was called up for the prize.",
            "author": "EpikMint",
            "id": "j0lvj4j",
            "parent_id": "t1_j0lsnnz",
            "score": 16,
            "created_utc": 1671298389.0,
            "replies": []
        },
        {
            "body": "You will never understand it. You missing the dynamic and atmosphere.",
            "author": "Hefty-Association567",
            "id": "j0lt274",
            "parent_id": "t1_j0lsnnz",
            "score": 10,
            "created_utc": 1671297350.0,
            "replies": []
        },
        {
            "body": "Wait, I thought you said the award wasn't a sympathy award, but based on talent and who deserves it? Now you're saying they won't give someone that award because they don't want them representing that company? Well, then clearly it isn't an award based on talent and merits and accomplishments but who the company wants as the face of the brand.",
            "author": "Ancient_Reply4583",
            "id": "j0lvjgv",
            "parent_id": "t1_j0lsnnz",
            "score": 3,
            "created_utc": 1671298392.0,
            "replies": []
        },
        {
            "body": "idk why you got many downvote, you tell the truth, if JSJ win Daesang award, it would make another speculations, and make Daesang Award looks so \"rigid\", but still, i respect him, JSJ is a hardworker man",
            "author": "ohiroze",
            "id": "j0mb7lr",
            "parent_id": "t1_j0lsnnz",
            "score": -3,
            "created_utc": 1671304847.0,
            "replies": [
                {
                    "body": "Then why not give it to Tak Jae Hoon or Lee Sang Min instead? Other than JSJ, there are viewers who wants the award to go to either TJH and LSM. \n\nSBS already messed up last year for being indecisive and sending the prize to multiple people. They could have redeemed themselves this year for not ignoring JSJ (or the other nominees) but gave it to YJS (whose also expecting his bestfriend to win) instead. \n\nThe aftermath? SBS right now is being criticized by korean netizens again. Most of the comments from the red carpet pre-show @ Youtube are bombarded with disappointments that they snubbed JSJ.\n\nEdit: what's worse is that YJS is getting dragged. SBS really messed up for the 2nd time in a row.",
                    "author": "EpikMint",
                    "id": "j0mrm1n",
                    "parent_id": "t1_j0mb7lr",
                    "score": 5,
                    "created_utc": 1671311801.0,
                    "replies": [
                        {
                            "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
                            "author": "lolminna",
                            "id": "j0nkk89",
                            "parent_id": "t1_j0mrm1n",
                            "score": 6,
                            "created_utc": 1671324749.0,
                            "replies": [
                                {
                                    "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                                    "author": "teukkiu",
                                    "id": "j0r327y",
                                    "parent_id": "t1_j0nkk89",
                                    "score": 2,
                                    "created_utc": 1671393439.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
                            "author": "slooobs",
                            "id": "j0no36f",
                            "parent_id": "t1_j0mrm1n",
                            "score": 2,
                            "created_utc": 1671326469.0,
                            "replies": []
                        },
                        {
                            "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
                            "author": "ohiroze",
                            "id": "j0mupif",
                            "parent_id": "t1_j0mrm1n",
                            "score": 1,
                            "created_utc": 1671313093.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">JSJ is a hardworker man\n\nThis is so funny, he literally delegate his job to his colleague during his captaincy because he thinks he worked so hard during that time. \n\nYJS literally did tons of programs and never complaint.\n\nlmao.",
                    "author": "kripkrip",
                    "id": "j0muuzj",
                    "parent_id": "t1_j0mb7lr",
                    "score": -1,
                    "created_utc": 1671313157.0,
                    "replies": [
                        {
                            "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
                            "author": "ohiroze",
                            "id": "j0mws2r",
                            "parent_id": "t1_j0muuzj",
                            "score": 2,
                            "created_utc": 1671313985.0,
                            "replies": [
                                {
                                    "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                                    "author": "kripkrip",
                                    "id": "j0n0x63",
                                    "parent_id": "t1_j0mws2r",
                                    "score": -2,
                                    "created_utc": 1671315764.0,
                                    "replies": [
                                        {
                                            "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                                            "author": "ohiroze",
                                            "id": "j0n6vkd",
                                            "parent_id": "t1_j0n0x63",
                                            "score": 3,
                                            "created_utc": 1671318417.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed, but we can speculate as much as we want to but it won't matter and is a waste of time to do so. Celebrating the members for receiving awards is obvious but we can show that same energy by enjoying the entertainment they've provided over the years.\n\nIt's one measly award given every year and while it'd be nice for different RM members to receive it, there's no guarantee. I'd rather support them by watching RM and the other shows they're part of.",
            "author": "CoG_Brotato",
            "id": "j0qr6e5",
            "parent_id": "t1_j0pxir9",
            "score": 1,
            "created_utc": 1671388952.0,
            "replies": []
        },
        {
            "body": "Then why not give it to Tak Jae Hoon or Lee Sang Min instead? Other than JSJ, there are viewers who wants the award to go to either TJH and LSM. \n\nSBS already messed up last year for being indecisive and sending the prize to multiple people. They could have redeemed themselves this year for not ignoring JSJ (or the other nominees) but gave it to YJS (whose also expecting his bestfriend to win) instead. \n\nThe aftermath? SBS right now is being criticized by korean netizens again. Most of the comments from the red carpet pre-show @ Youtube are bombarded with disappointments that they snubbed JSJ.\n\nEdit: what's worse is that YJS is getting dragged. SBS really messed up for the 2nd time in a row.",
            "author": "EpikMint",
            "id": "j0mrm1n",
            "parent_id": "t1_j0mb7lr",
            "score": 5,
            "created_utc": 1671311801.0,
            "replies": [
                {
                    "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
                    "author": "lolminna",
                    "id": "j0nkk89",
                    "parent_id": "t1_j0mrm1n",
                    "score": 6,
                    "created_utc": 1671324749.0,
                    "replies": [
                        {
                            "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                            "author": "teukkiu",
                            "id": "j0r327y",
                            "parent_id": "t1_j0nkk89",
                            "score": 2,
                            "created_utc": 1671393439.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
                    "author": "slooobs",
                    "id": "j0no36f",
                    "parent_id": "t1_j0mrm1n",
                    "score": 2,
                    "created_utc": 1671326469.0,
                    "replies": []
                },
                {
                    "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
                    "author": "ohiroze",
                    "id": "j0mupif",
                    "parent_id": "t1_j0mrm1n",
                    "score": 1,
                    "created_utc": 1671313093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">JSJ is a hardworker man\n\nThis is so funny, he literally delegate his job to his colleague during his captaincy because he thinks he worked so hard during that time. \n\nYJS literally did tons of programs and never complaint.\n\nlmao.",
            "author": "kripkrip",
            "id": "j0muuzj",
            "parent_id": "t1_j0mb7lr",
            "score": -1,
            "created_utc": 1671313157.0,
            "replies": [
                {
                    "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
                    "author": "ohiroze",
                    "id": "j0mws2r",
                    "parent_id": "t1_j0muuzj",
                    "score": 2,
                    "created_utc": 1671313985.0,
                    "replies": [
                        {
                            "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                            "author": "kripkrip",
                            "id": "j0n0x63",
                            "parent_id": "t1_j0mws2r",
                            "score": -2,
                            "created_utc": 1671315764.0,
                            "replies": [
                                {
                                    "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                                    "author": "ohiroze",
                                    "id": "j0n6vkd",
                                    "parent_id": "t1_j0n0x63",
                                    "score": 3,
                                    "created_utc": 1671318417.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> SBS really messed up for the 2nd time in a row.\n\nThird time in a row. Chef Baek Jong-won was already refusing SBS's daesang invitations because SBS was running ads heavily hinting Chef's \"destined\" win, even if it put undue pressure on him and the other nominees. So when Lee Seunggi received the award, he got the backlash that YJS is receiving now.",
            "author": "lolminna",
            "id": "j0nkk89",
            "parent_id": "t1_j0mrm1n",
            "score": 6,
            "created_utc": 1671324749.0,
            "replies": [
                {
                    "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
                    "author": "teukkiu",
                    "id": "j0r327y",
                    "parent_id": "t1_j0nkk89",
                    "score": 2,
                    "created_utc": 1671393439.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think they can't give MUD member 3 years in a row, so they give it to YJS, next year most likely TJH/LSM/SDY winning, unless there's another SBS hit variety",
            "author": "slooobs",
            "id": "j0no36f",
            "parent_id": "t1_j0mrm1n",
            "score": 2,
            "created_utc": 1671326469.0,
            "replies": []
        },
        {
            "body": "Tbh i really don't like all of awards show, because this \"case\" can be happened in any awards show, but maybe, if the winners are selected from the open voting results, it looks fair, even it also can be rigged",
            "author": "ohiroze",
            "id": "j0mupif",
            "parent_id": "t1_j0mrm1n",
            "score": 1,
            "created_utc": 1671313093.0,
            "replies": []
        },
        {
            "body": "I don't want to be harsh to him, yeah i know he got complaints from Jihyo and Sechan in eps 598, they had meetings with PD meanwhile he's at home hahaha, bullied by Jaesuk and KJK and he can hold it, is really a pure hard work",
            "author": "ohiroze",
            "id": "j0mws2r",
            "parent_id": "t1_j0muuzj",
            "score": 2,
            "created_utc": 1671313985.0,
            "replies": [
                {
                    "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
                    "author": "kripkrip",
                    "id": "j0n0x63",
                    "parent_id": "t1_j0mws2r",
                    "score": -2,
                    "created_utc": 1671315764.0,
                    "replies": [
                        {
                            "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                            "author": "ohiroze",
                            "id": "j0n6vkd",
                            "parent_id": "t1_j0n0x63",
                            "score": 3,
                            "created_utc": 1671318417.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The YJS vs Lee Seunggi situation is a bit different. YJS isn’t getting backlash. Most people are acknowledging that he deserved the award. They’re just upset with how SBS hinted that JSJ would win and then didn’t give it to him. \n\nIn the Lee Seunggi situation, there was backlash about BJW not winning but people were also saying that LSG did not deserve to win the Daesang yet. But I agree with your overall point. SBS has handled this award show really messily in these three years.",
            "author": "teukkiu",
            "id": "j0r327y",
            "parent_id": "t1_j0nkk89",
            "score": 2,
            "created_utc": 1671393439.0,
            "replies": []
        },
        {
            "body": "RM gave him wings, but he acted like he's a big shot because YJS is his dongsaeng and friend. Rather than being funny i would like him to work harder and being diligent. Not once in 12 years people praise him for that. He is the oldest with experience but no one look up to him is just sad.",
            "author": "kripkrip",
            "id": "j0n0x63",
            "parent_id": "t1_j0mws2r",
            "score": -2,
            "created_utc": 1671315764.0,
            "replies": [
                {
                    "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
                    "author": "ohiroze",
                    "id": "j0n6vkd",
                    "parent_id": "t1_j0n0x63",
                    "score": 3,
                    "created_utc": 1671318417.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe it's difficult for him, his role in RM are always to be co-captain for YJS, he's good for talks, he's good for make a counter-jokes from YJS, but he can't make a skit and he's the weakest amongs the male member (because of his age), tbh i like the way in his role now, he can make laughable scene when he got bullied",
            "author": "ohiroze",
            "id": "j0n6vkd",
            "parent_id": "t1_j0n0x63",
            "score": 3,
            "created_utc": 1671318417.0,
            "replies": []
        }
    ]
}