{
    "title": "Oh sensei, you are so wise.",
    "post_id": "fqgcn4",
    "post_url": "https://www.reddit.com/r/dankruto/comments/fqgcn4/oh_sensei_you_are_so_wise/",
    "author": "Danyboi16",
    "body": "",
    "url": "https://i.redd.it/9yejkk69ldp41.jpg",
    "score": 7958,
    "upvote_ratio": 1.0,
    "created_utc": 1585384733.0,
    "num_comments": 51,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Lmao. \nBut seriously, I love Might Guy and Rock Lee.",
            "author": null,
            "id": "flqcgs5",
            "parent_id": "t3_fqgcn4",
            "score": 285,
            "created_utc": 1585388754.0,
            "replies": [
                {
                    "body": "I haven't met anyone who hates Might Guy or Rock Lee. Sasuke haters yes, Naruto haters few, Sakura haters...lets not go there.\n\nBut Guy and Lee haters? Not yet",
                    "author": "F-Strings",
                    "id": "flqgqkp",
                    "parent_id": "t1_flqcgs5",
                    "score": 202,
                    "created_utc": 1585394099.0,
                    "replies": [
                        {
                            "body": "I mean, sometimes I think some people might think they're cringey, but they're constantly improving themselves.",
                            "author": null,
                            "id": "flqgven",
                            "parent_id": "t1_flqgqkp",
                            "score": 88,
                            "created_utc": 1585394262.0,
                            "replies": []
                        },
                        {
                            "body": "My daughter and I had a conflict early in the manga because I liked Gaara and she was like, HE HURT MY BOY, which was fair. But even I love Guy and Lee, I’m not some sort of moral monster.",
                            "author": "ofBlufftonTown",
                            "id": "flqxnks",
                            "parent_id": "t1_flqgqkp",
                            "score": 57,
                            "created_utc": 1585408598.0,
                            "replies": []
                        },
                        {
                            "body": "Kid Kakashi was a Gai hater. 🙈",
                            "author": "claravelle-nazal",
                            "id": "flso659",
                            "parent_id": "t1_flqgqkp",
                            "score": 17,
                            "created_utc": 1585446675.0,
                            "replies": []
                        },
                        {
                            "body": "I like Lee but he is overrated among the fanbase.\n\nEdit: And point proven",
                            "author": "sonfoa",
                            "id": "fls3yt4",
                            "parent_id": "t1_flqgqkp",
                            "score": -5,
                            "created_utc": 1585433851.0,
                            "replies": [
                                {
                                    "body": "You didn't prove anything tho",
                                    "author": "TheAtomicClock",
                                    "id": "ftka93a",
                                    "parent_id": "t1_fls3yt4",
                                    "score": 6,
                                    "created_utc": 1591773386.0,
                                    "replies": [
                                        {
                                            "body": "well he did tho.\n\nHe gave his opinion respectfully and all of Lee's dick suckers downvoted his comment",
                                            "author": null,
                                            "id": "fxeiesg",
                                            "parent_id": "t1_ftka93a",
                                            "score": 4,
                                            "created_utc": 1594281865.0,
                                            "replies": [
                                                {
                                                    "body": "And they did so using the power of youth while simultaneously improving themselves fucktard, god, i cant believe you. /s",
                                                    "author": "Niigaanii",
                                                    "id": "fyyjo8p",
                                                    "parent_id": "t1_fxeiesg",
                                                    "score": 5,
                                                    "created_utc": 1595489654.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Rock lee is what naruto should have been, based on the message the story wanted to tell.",
                    "author": "Elias_freecss",
                    "id": "flqelds",
                    "parent_id": "t1_flqcgs5",
                    "score": 57,
                    "created_utc": 1585391464.0,
                    "replies": [
                        {
                            "body": "Eh, I don't really think so.\nYou need a mixture of hard work and talent to effect change.\nRock Lee is pretty cool, and he had an interesting arc, but the main focus of the story was really on Kakashi, Rin and Obito and the impact of the fallout of team Minato. \nAnd Naruto is very much linked with that, so I think that's part of why Naruto is the main character. Also, Rock Lee didn't have to deal with nearly as much prejudice, nor did he live all alone for the better part of a decade.\nSo, I think the themes are important, but it wasn't the main focus. It was mostly on the characters and somewhat on the plot, and I think the themes of the series were not as important as some seem to think.\nStories are a mixture of things, and you can change the prevalence of certain ingredients to make it taste the way you prefer.",
                            "author": null,
                            "id": "flqfqjw",
                            "parent_id": "t1_flqelds",
                            "score": 33,
                            "created_utc": 1585392895.0,
                            "replies": [
                                {
                                    "body": "The message is everything, without it, you end up with a space bunny as the last villain, instead of the powerful mastermind that was madara.\n\nAnd naruto defeating him, not only with physical strength, but with the powerful conviction that only someone that trains himself to death can have.\n\nAlso, naruto vs obito would be the ultimate battle, obito being intangible and naruto only using taijutsu. That would have represented something very powerfull, that no matter how much you train, you cannot touch an uchiha, and then, having him defeated. \n\nThroughout the story, we se that uchihas have their powers gifted to them, naruto being the antithesis to that would be really powerful.\n\nThe ultimate outcast, not only he is the jinchuriki of the nine tails, an orphar, everyone hates him, but he cannot perform jutsu as well (maybe as a consequence of the seal) , that would have made him the ultimate outsider of the shinobi world, with an outide perspective, and thus, the only one fit to change it, without any weird prophecy or reincarnation, but with sheer will, as it should be.",
                                    "author": "Elias_freecss",
                                    "id": "flqjy8n",
                                    "parent_id": "t1_flqfqjw",
                                    "score": 21,
                                    "created_utc": 1585397659.0,
                                    "replies": [
                                        {
                                            "body": "It was definitely not perfectly executed, but I think the elements are there to make a fantastic story. I could probably edit it to be better.\nBut I do love it.",
                                            "author": null,
                                            "id": "flqk45i",
                                            "parent_id": "t1_flqjy8n",
                                            "score": 9,
                                            "created_utc": 1585397825.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Neji was right all along",
                            "author": null,
                            "id": "flqjq2k",
                            "parent_id": "t1_flqelds",
                            "score": 34,
                            "created_utc": 1585397425.0,
                            "replies": [
                                {
                                    "body": "Saying everyone follows their destiny is an objective truth. Being so salty about what you perceive to be your destiny that you shit on everyone else's aspirations makes you an asshole.\n\nNeji claimed he knew Naruto's destiny without even properly knowing the dude. That's jaded arrogance not intelligence.",
                                    "author": "sonfoa",
                                    "id": "fls45i2",
                                    "parent_id": "t1_flqjq2k",
                                    "score": 9,
                                    "created_utc": 1585433964.0,
                                    "replies": [
                                        {
                                            "body": "It's just a joke. But the part a lot of people are saying he's right on is that natural born talent wins over hard work and dedication. That naruto wins most of the time through the nine tails that was given to him when he was born and not through his hard work. Whenever naruto tries to win ignoring the nine tails he fails say the rasengan or sage mode he loses that's what people are saying.",
                                            "author": null,
                                            "id": "fls4htg",
                                            "parent_id": "t1_fls45i2",
                                            "score": 6,
                                            "created_utc": 1585434173.0,
                                            "replies": [
                                                {
                                                    "body": "Ok but Naruto was talented from the start though, he just wasn't trained in the right way. I don't get why people try to shove that hardwork vs. talent from Lee to Naruto.\n\nIf Minato and Kushina didn't die, Naruto would crap on the rest of his generation just as Boruto is doing now",
                                                    "author": "Wisterosa",
                                                    "id": "flt2pj8",
                                                    "parent_id": "t1_fls4htg",
                                                    "score": 7,
                                                    "created_utc": 1585457469.0,
                                                    "replies": [
                                                        {
                                                            "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
                                                            "author": null,
                                                            "id": "flta5zm",
                                                            "parent_id": "t1_flt2pj8",
                                                            "score": 2,
                                                            "created_utc": 1585464514.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah, that's the saddest part about it",
                                    "author": "Elias_freecss",
                                    "id": "flqk2v0",
                                    "parent_id": "t1_flqjq2k",
                                    "score": 17,
                                    "created_utc": 1585397789.0,
                                    "replies": []
                                },
                                {
                                    "body": "I mean Naruto still changed and chose his own destiny in the end. Following the destiny, would be killing Sasuke and let cicle of hate flow. When Naruto chooses to talk instead of killing, he's going against destiny.",
                                    "author": "jhoho34",
                                    "id": "flt38vf",
                                    "parent_id": "t1_flqjq2k",
                                    "score": 5,
                                    "created_utc": 1585457918.0,
                                    "replies": [
                                        {
                                            "body": "Was that Naruto's destiny or Asura's. I feel like that was more of Asura's mentality with friends over war and conflict.",
                                            "author": null,
                                            "id": "flt9rxw",
                                            "parent_id": "t1_flt38vf",
                                            "score": 2,
                                            "created_utc": 1585464103.0,
                                            "replies": [
                                                {
                                                    "body": "But Asura fate, is linked to Naruto's fate. So it was Naruto fate to kill Sasuke, just like how Hashirama killed Madara and Asura killed Indra, that's the fate of the reincarnations, to duel until Asura wins. When Naruto accepts Sasuke, he rejects what was decided for him, he creates a new path.",
                                                    "author": "jhoho34",
                                                    "id": "flta3d6",
                                                    "parent_id": "t1_flt9rxw",
                                                    "score": 4,
                                                    "created_utc": 1585464435.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
                                                            "author": null,
                                                            "id": "fltarsh",
                                                            "parent_id": "t1_flta3d6",
                                                            "score": 1,
                                                            "created_utc": 1585465169.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Saitama and Genos be the same",
            "author": "Calen64",
            "id": "flqatl2",
            "parent_id": "t3_fqgcn4",
            "score": 113,
            "created_utc": 1585386599.0,
            "replies": [
                {
                    "body": "https://www.reddit.com/r/OnePunchMan/comments/fpzni8/scribbles_furiously_on_notepad/?utm_medium=android_app&utm_source=share\n\nMade this one first. Then thought of the guy and lee one.",
                    "author": "Danyboi16",
                    "id": "flqazdm",
                    "parent_id": "t1_flqatl2",
                    "score": 47,
                    "created_utc": 1585386806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Springtime of Youth!",
            "author": null,
            "id": "flqchoc",
            "parent_id": "t3_fqgcn4",
            "score": 44,
            "created_utc": 1585388787.0,
            "replies": [
                {
                    "body": "I wonder if he shouts this when fucking tenten",
                    "author": "LurkerPatrol",
                    "id": "flqrxvc",
                    "parent_id": "t1_flqchoc",
                    "score": 19,
                    "created_utc": 1585404662.0,
                    "replies": [
                        {
                            "body": "We don't know if Tenten is Metal Lee's mother. I sure hope she is, but it's not confirmed.",
                            "author": null,
                            "id": "flqtw1v",
                            "parent_id": "t1_flqrxvc",
                            "score": 9,
                            "created_utc": 1585406080.0,
                            "replies": [
                                {
                                    "body": "The theory is that rock lee's reproduce asexually.\n\nAsexually, as it turns out, is Tenten's birth name.",
                                    "author": "LurkerPatrol",
                                    "id": "flqu260",
                                    "parent_id": "t1_flqtw1v",
                                    "score": 31,
                                    "created_utc": 1585406198.0,
                                    "replies": [
                                        {
                                            "body": "Lmao!",
                                            "author": null,
                                            "id": "flqu6wz",
                                            "parent_id": "t1_flqu260",
                                            "score": 4,
                                            "created_utc": 1585406290.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Best scene when Guy and Kakashi race each other and then Kakashi thanks him for being always by his side, man the feels",
            "author": "Aktaii",
            "id": "flrlo5j",
            "parent_id": "t3_fqgcn4",
            "score": 36,
            "created_utc": 1585422770.0,
            "replies": []
        },
        {
            "body": "THE POWER OF YOUTH",
            "author": "The_Demon_Weeb",
            "id": "flqfn8e",
            "parent_id": "t3_fqgcn4",
            "score": 16,
            "created_utc": 1585392779.0,
            "replies": []
        },
        {
            "body": "their relationship is too pure for this world",
            "author": "heyyassbutt",
            "id": "flqv8ew",
            "parent_id": "t3_fqgcn4",
            "score": 10,
            "created_utc": 1585407005.0,
            "replies": []
        },
        {
            "body": "YOOOOSHH!!!",
            "author": "Chibi_Fighter",
            "id": "flqjzcf",
            "parent_id": "t3_fqgcn4",
            "score": 7,
            "created_utc": 1585397690.0,
            "replies": []
        },
        {
            "body": "Open them gates of awesome",
            "author": "IAmYoDaddyDuh",
            "id": "flresw5",
            "parent_id": "t3_fqgcn4",
            "score": 8,
            "created_utc": 1585418731.0,
            "replies": []
        },
        {
            "body": "Noble beasts are too noble",
            "author": "batman_96",
            "id": "flqe9a9",
            "parent_id": "t3_fqgcn4",
            "score": 5,
            "created_utc": 1585391036.0,
            "replies": []
        },
        {
            "body": "Bushy brow",
            "author": "Hyperion1000",
            "id": "flr4yt3",
            "parent_id": "t3_fqgcn4",
            "score": 5,
            "created_utc": 1585413076.0,
            "replies": []
        },
        {
            "body": "The passion of Youth",
            "author": "novatheking127",
            "id": "flsdf9c",
            "parent_id": "t3_fqgcn4",
            "score": 3,
            "created_utc": 1585439659.0,
            "replies": []
        },
        {
            "body": "I don't blame lee, might gai is a legend, even the upvote button on this sub in might gai",
            "author": "MessiToe",
            "id": "flqrp69",
            "parent_id": "t3_fqgcn4",
            "score": 2,
            "created_utc": 1585404480.0,
            "replies": []
        },
        {
            "body": "Never gonna forget when rock lee ran sasukes fade, bro a G",
            "author": "wokealdo",
            "id": "flsttjx",
            "parent_id": "t3_fqgcn4",
            "score": 2,
            "created_utc": 1585450631.0,
            "replies": []
        },
        {
            "body": "GARRA IS THE BEST",
            "author": "AfraidNet1",
            "id": "fm2ol32",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1585701863.0,
            "replies": []
        },
        {
            "body": "Same with Saitama and Genos",
            "author": "Fujiyama_Senju",
            "id": "fnyi8zq",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1587363904.0,
            "replies": []
        },
        {
            "body": "So powerful that make me cry too",
            "author": null,
            "id": "fpyxhtx",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1589010286.0,
            "replies": []
        },
        {
            "body": "Bruh this killed me like Sasuke killed Yoroi",
            "author": null,
            "id": "fv4q2j4",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1592407786.0,
            "replies": []
        },
        {
            "body": "not, any say any s k",
            "author": "bjiwekls32",
            "id": "fwv0rvu",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1593825381.0,
            "replies": []
        },
        {
            "body": "True",
            "author": "fd47OW",
            "id": "fyhxhha",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1595106493.0,
            "replies": []
        },
        {
            "body": " David goggins",
            "author": "return3",
            "id": "g3q7t8z",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1599060002.0,
            "replies": []
        },
        {
            "body": "Is it sad that I can hear rock lee’s voice when saying that",
            "author": "rocker0925",
            "id": "g4007mt",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1599234965.0,
            "replies": []
        },
        {
            "body": "~~Deku to All Might~~",
            "author": "theunicornishere",
            "id": "g5k7qqh",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1600324318.0,
            "replies": []
        },
        {
            "body": "That title is a yikes",
            "author": "Camper7760",
            "id": "flqmcnc",
            "parent_id": "t3_fqgcn4",
            "score": -8,
            "created_utc": 1585399989.0,
            "replies": []
        },
        {
            "body": "Might guy: \"tits\"\nRock lee: *Its enough to make a grown man cry*\nNaruto: *huh*\nSakura: **ready's chakra fist**\nHinata: *huh*",
            "author": "SomeoneSniffMyCock",
            "id": "iglr724",
            "parent_id": "t3_fqgcn4",
            "score": 1,
            "created_utc": 1658118190.0,
            "replies": []
        },
        {
            "body": "I haven't met anyone who hates Might Guy or Rock Lee. Sasuke haters yes, Naruto haters few, Sakura haters...lets not go there.\n\nBut Guy and Lee haters? Not yet",
            "author": "F-Strings",
            "id": "flqgqkp",
            "parent_id": "t1_flqcgs5",
            "score": 202,
            "created_utc": 1585394099.0,
            "replies": [
                {
                    "body": "I mean, sometimes I think some people might think they're cringey, but they're constantly improving themselves.",
                    "author": null,
                    "id": "flqgven",
                    "parent_id": "t1_flqgqkp",
                    "score": 88,
                    "created_utc": 1585394262.0,
                    "replies": []
                },
                {
                    "body": "My daughter and I had a conflict early in the manga because I liked Gaara and she was like, HE HURT MY BOY, which was fair. But even I love Guy and Lee, I’m not some sort of moral monster.",
                    "author": "ofBlufftonTown",
                    "id": "flqxnks",
                    "parent_id": "t1_flqgqkp",
                    "score": 57,
                    "created_utc": 1585408598.0,
                    "replies": []
                },
                {
                    "body": "Kid Kakashi was a Gai hater. 🙈",
                    "author": "claravelle-nazal",
                    "id": "flso659",
                    "parent_id": "t1_flqgqkp",
                    "score": 17,
                    "created_utc": 1585446675.0,
                    "replies": []
                },
                {
                    "body": "I like Lee but he is overrated among the fanbase.\n\nEdit: And point proven",
                    "author": "sonfoa",
                    "id": "fls3yt4",
                    "parent_id": "t1_flqgqkp",
                    "score": -5,
                    "created_utc": 1585433851.0,
                    "replies": [
                        {
                            "body": "You didn't prove anything tho",
                            "author": "TheAtomicClock",
                            "id": "ftka93a",
                            "parent_id": "t1_fls3yt4",
                            "score": 6,
                            "created_utc": 1591773386.0,
                            "replies": [
                                {
                                    "body": "well he did tho.\n\nHe gave his opinion respectfully and all of Lee's dick suckers downvoted his comment",
                                    "author": null,
                                    "id": "fxeiesg",
                                    "parent_id": "t1_ftka93a",
                                    "score": 4,
                                    "created_utc": 1594281865.0,
                                    "replies": [
                                        {
                                            "body": "And they did so using the power of youth while simultaneously improving themselves fucktard, god, i cant believe you. /s",
                                            "author": "Niigaanii",
                                            "id": "fyyjo8p",
                                            "parent_id": "t1_fxeiesg",
                                            "score": 5,
                                            "created_utc": 1595489654.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rock lee is what naruto should have been, based on the message the story wanted to tell.",
            "author": "Elias_freecss",
            "id": "flqelds",
            "parent_id": "t1_flqcgs5",
            "score": 57,
            "created_utc": 1585391464.0,
            "replies": [
                {
                    "body": "Eh, I don't really think so.\nYou need a mixture of hard work and talent to effect change.\nRock Lee is pretty cool, and he had an interesting arc, but the main focus of the story was really on Kakashi, Rin and Obito and the impact of the fallout of team Minato. \nAnd Naruto is very much linked with that, so I think that's part of why Naruto is the main character. Also, Rock Lee didn't have to deal with nearly as much prejudice, nor did he live all alone for the better part of a decade.\nSo, I think the themes are important, but it wasn't the main focus. It was mostly on the characters and somewhat on the plot, and I think the themes of the series were not as important as some seem to think.\nStories are a mixture of things, and you can change the prevalence of certain ingredients to make it taste the way you prefer.",
                    "author": null,
                    "id": "flqfqjw",
                    "parent_id": "t1_flqelds",
                    "score": 33,
                    "created_utc": 1585392895.0,
                    "replies": [
                        {
                            "body": "The message is everything, without it, you end up with a space bunny as the last villain, instead of the powerful mastermind that was madara.\n\nAnd naruto defeating him, not only with physical strength, but with the powerful conviction that only someone that trains himself to death can have.\n\nAlso, naruto vs obito would be the ultimate battle, obito being intangible and naruto only using taijutsu. That would have represented something very powerfull, that no matter how much you train, you cannot touch an uchiha, and then, having him defeated. \n\nThroughout the story, we se that uchihas have their powers gifted to them, naruto being the antithesis to that would be really powerful.\n\nThe ultimate outcast, not only he is the jinchuriki of the nine tails, an orphar, everyone hates him, but he cannot perform jutsu as well (maybe as a consequence of the seal) , that would have made him the ultimate outsider of the shinobi world, with an outide perspective, and thus, the only one fit to change it, without any weird prophecy or reincarnation, but with sheer will, as it should be.",
                            "author": "Elias_freecss",
                            "id": "flqjy8n",
                            "parent_id": "t1_flqfqjw",
                            "score": 21,
                            "created_utc": 1585397659.0,
                            "replies": [
                                {
                                    "body": "It was definitely not perfectly executed, but I think the elements are there to make a fantastic story. I could probably edit it to be better.\nBut I do love it.",
                                    "author": null,
                                    "id": "flqk45i",
                                    "parent_id": "t1_flqjy8n",
                                    "score": 9,
                                    "created_utc": 1585397825.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Neji was right all along",
                    "author": null,
                    "id": "flqjq2k",
                    "parent_id": "t1_flqelds",
                    "score": 34,
                    "created_utc": 1585397425.0,
                    "replies": [
                        {
                            "body": "Saying everyone follows their destiny is an objective truth. Being so salty about what you perceive to be your destiny that you shit on everyone else's aspirations makes you an asshole.\n\nNeji claimed he knew Naruto's destiny without even properly knowing the dude. That's jaded arrogance not intelligence.",
                            "author": "sonfoa",
                            "id": "fls45i2",
                            "parent_id": "t1_flqjq2k",
                            "score": 9,
                            "created_utc": 1585433964.0,
                            "replies": [
                                {
                                    "body": "It's just a joke. But the part a lot of people are saying he's right on is that natural born talent wins over hard work and dedication. That naruto wins most of the time through the nine tails that was given to him when he was born and not through his hard work. Whenever naruto tries to win ignoring the nine tails he fails say the rasengan or sage mode he loses that's what people are saying.",
                                    "author": null,
                                    "id": "fls4htg",
                                    "parent_id": "t1_fls45i2",
                                    "score": 6,
                                    "created_utc": 1585434173.0,
                                    "replies": [
                                        {
                                            "body": "Ok but Naruto was talented from the start though, he just wasn't trained in the right way. I don't get why people try to shove that hardwork vs. talent from Lee to Naruto.\n\nIf Minato and Kushina didn't die, Naruto would crap on the rest of his generation just as Boruto is doing now",
                                            "author": "Wisterosa",
                                            "id": "flt2pj8",
                                            "parent_id": "t1_fls4htg",
                                            "score": 7,
                                            "created_utc": 1585457469.0,
                                            "replies": [
                                                {
                                                    "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
                                                    "author": null,
                                                    "id": "flta5zm",
                                                    "parent_id": "t1_flt2pj8",
                                                    "score": 2,
                                                    "created_utc": 1585464514.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah, that's the saddest part about it",
                            "author": "Elias_freecss",
                            "id": "flqk2v0",
                            "parent_id": "t1_flqjq2k",
                            "score": 17,
                            "created_utc": 1585397789.0,
                            "replies": []
                        },
                        {
                            "body": "I mean Naruto still changed and chose his own destiny in the end. Following the destiny, would be killing Sasuke and let cicle of hate flow. When Naruto chooses to talk instead of killing, he's going against destiny.",
                            "author": "jhoho34",
                            "id": "flt38vf",
                            "parent_id": "t1_flqjq2k",
                            "score": 5,
                            "created_utc": 1585457918.0,
                            "replies": [
                                {
                                    "body": "Was that Naruto's destiny or Asura's. I feel like that was more of Asura's mentality with friends over war and conflict.",
                                    "author": null,
                                    "id": "flt9rxw",
                                    "parent_id": "t1_flt38vf",
                                    "score": 2,
                                    "created_utc": 1585464103.0,
                                    "replies": [
                                        {
                                            "body": "But Asura fate, is linked to Naruto's fate. So it was Naruto fate to kill Sasuke, just like how Hashirama killed Madara and Asura killed Indra, that's the fate of the reincarnations, to duel until Asura wins. When Naruto accepts Sasuke, he rejects what was decided for him, he creates a new path.",
                                            "author": "jhoho34",
                                            "id": "flta3d6",
                                            "parent_id": "t1_flt9rxw",
                                            "score": 4,
                                            "created_utc": 1585464435.0,
                                            "replies": [
                                                {
                                                    "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
                                                    "author": null,
                                                    "id": "fltarsh",
                                                    "parent_id": "t1_flta3d6",
                                                    "score": 1,
                                                    "created_utc": 1585465169.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "https://www.reddit.com/r/OnePunchMan/comments/fpzni8/scribbles_furiously_on_notepad/?utm_medium=android_app&utm_source=share\n\nMade this one first. Then thought of the guy and lee one.",
            "author": "Danyboi16",
            "id": "flqazdm",
            "parent_id": "t1_flqatl2",
            "score": 47,
            "created_utc": 1585386806.0,
            "replies": []
        },
        {
            "body": "I wonder if he shouts this when fucking tenten",
            "author": "LurkerPatrol",
            "id": "flqrxvc",
            "parent_id": "t1_flqchoc",
            "score": 19,
            "created_utc": 1585404662.0,
            "replies": [
                {
                    "body": "We don't know if Tenten is Metal Lee's mother. I sure hope she is, but it's not confirmed.",
                    "author": null,
                    "id": "flqtw1v",
                    "parent_id": "t1_flqrxvc",
                    "score": 9,
                    "created_utc": 1585406080.0,
                    "replies": [
                        {
                            "body": "The theory is that rock lee's reproduce asexually.\n\nAsexually, as it turns out, is Tenten's birth name.",
                            "author": "LurkerPatrol",
                            "id": "flqu260",
                            "parent_id": "t1_flqtw1v",
                            "score": 31,
                            "created_utc": 1585406198.0,
                            "replies": [
                                {
                                    "body": "Lmao!",
                                    "author": null,
                                    "id": "flqu6wz",
                                    "parent_id": "t1_flqu260",
                                    "score": 4,
                                    "created_utc": 1585406290.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, sometimes I think some people might think they're cringey, but they're constantly improving themselves.",
            "author": null,
            "id": "flqgven",
            "parent_id": "t1_flqgqkp",
            "score": 88,
            "created_utc": 1585394262.0,
            "replies": []
        },
        {
            "body": "My daughter and I had a conflict early in the manga because I liked Gaara and she was like, HE HURT MY BOY, which was fair. But even I love Guy and Lee, I’m not some sort of moral monster.",
            "author": "ofBlufftonTown",
            "id": "flqxnks",
            "parent_id": "t1_flqgqkp",
            "score": 57,
            "created_utc": 1585408598.0,
            "replies": []
        },
        {
            "body": "Kid Kakashi was a Gai hater. 🙈",
            "author": "claravelle-nazal",
            "id": "flso659",
            "parent_id": "t1_flqgqkp",
            "score": 17,
            "created_utc": 1585446675.0,
            "replies": []
        },
        {
            "body": "I like Lee but he is overrated among the fanbase.\n\nEdit: And point proven",
            "author": "sonfoa",
            "id": "fls3yt4",
            "parent_id": "t1_flqgqkp",
            "score": -5,
            "created_utc": 1585433851.0,
            "replies": [
                {
                    "body": "You didn't prove anything tho",
                    "author": "TheAtomicClock",
                    "id": "ftka93a",
                    "parent_id": "t1_fls3yt4",
                    "score": 6,
                    "created_utc": 1591773386.0,
                    "replies": [
                        {
                            "body": "well he did tho.\n\nHe gave his opinion respectfully and all of Lee's dick suckers downvoted his comment",
                            "author": null,
                            "id": "fxeiesg",
                            "parent_id": "t1_ftka93a",
                            "score": 4,
                            "created_utc": 1594281865.0,
                            "replies": [
                                {
                                    "body": "And they did so using the power of youth while simultaneously improving themselves fucktard, god, i cant believe you. /s",
                                    "author": "Niigaanii",
                                    "id": "fyyjo8p",
                                    "parent_id": "t1_fxeiesg",
                                    "score": 5,
                                    "created_utc": 1595489654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Eh, I don't really think so.\nYou need a mixture of hard work and talent to effect change.\nRock Lee is pretty cool, and he had an interesting arc, but the main focus of the story was really on Kakashi, Rin and Obito and the impact of the fallout of team Minato. \nAnd Naruto is very much linked with that, so I think that's part of why Naruto is the main character. Also, Rock Lee didn't have to deal with nearly as much prejudice, nor did he live all alone for the better part of a decade.\nSo, I think the themes are important, but it wasn't the main focus. It was mostly on the characters and somewhat on the plot, and I think the themes of the series were not as important as some seem to think.\nStories are a mixture of things, and you can change the prevalence of certain ingredients to make it taste the way you prefer.",
            "author": null,
            "id": "flqfqjw",
            "parent_id": "t1_flqelds",
            "score": 33,
            "created_utc": 1585392895.0,
            "replies": [
                {
                    "body": "The message is everything, without it, you end up with a space bunny as the last villain, instead of the powerful mastermind that was madara.\n\nAnd naruto defeating him, not only with physical strength, but with the powerful conviction that only someone that trains himself to death can have.\n\nAlso, naruto vs obito would be the ultimate battle, obito being intangible and naruto only using taijutsu. That would have represented something very powerfull, that no matter how much you train, you cannot touch an uchiha, and then, having him defeated. \n\nThroughout the story, we se that uchihas have their powers gifted to them, naruto being the antithesis to that would be really powerful.\n\nThe ultimate outcast, not only he is the jinchuriki of the nine tails, an orphar, everyone hates him, but he cannot perform jutsu as well (maybe as a consequence of the seal) , that would have made him the ultimate outsider of the shinobi world, with an outide perspective, and thus, the only one fit to change it, without any weird prophecy or reincarnation, but with sheer will, as it should be.",
                    "author": "Elias_freecss",
                    "id": "flqjy8n",
                    "parent_id": "t1_flqfqjw",
                    "score": 21,
                    "created_utc": 1585397659.0,
                    "replies": [
                        {
                            "body": "It was definitely not perfectly executed, but I think the elements are there to make a fantastic story. I could probably edit it to be better.\nBut I do love it.",
                            "author": null,
                            "id": "flqk45i",
                            "parent_id": "t1_flqjy8n",
                            "score": 9,
                            "created_utc": 1585397825.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neji was right all along",
            "author": null,
            "id": "flqjq2k",
            "parent_id": "t1_flqelds",
            "score": 34,
            "created_utc": 1585397425.0,
            "replies": [
                {
                    "body": "Saying everyone follows their destiny is an objective truth. Being so salty about what you perceive to be your destiny that you shit on everyone else's aspirations makes you an asshole.\n\nNeji claimed he knew Naruto's destiny without even properly knowing the dude. That's jaded arrogance not intelligence.",
                    "author": "sonfoa",
                    "id": "fls45i2",
                    "parent_id": "t1_flqjq2k",
                    "score": 9,
                    "created_utc": 1585433964.0,
                    "replies": [
                        {
                            "body": "It's just a joke. But the part a lot of people are saying he's right on is that natural born talent wins over hard work and dedication. That naruto wins most of the time through the nine tails that was given to him when he was born and not through his hard work. Whenever naruto tries to win ignoring the nine tails he fails say the rasengan or sage mode he loses that's what people are saying.",
                            "author": null,
                            "id": "fls4htg",
                            "parent_id": "t1_fls45i2",
                            "score": 6,
                            "created_utc": 1585434173.0,
                            "replies": [
                                {
                                    "body": "Ok but Naruto was talented from the start though, he just wasn't trained in the right way. I don't get why people try to shove that hardwork vs. talent from Lee to Naruto.\n\nIf Minato and Kushina didn't die, Naruto would crap on the rest of his generation just as Boruto is doing now",
                                    "author": "Wisterosa",
                                    "id": "flt2pj8",
                                    "parent_id": "t1_fls4htg",
                                    "score": 7,
                                    "created_utc": 1585457469.0,
                                    "replies": [
                                        {
                                            "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
                                            "author": null,
                                            "id": "flta5zm",
                                            "parent_id": "t1_flt2pj8",
                                            "score": 2,
                                            "created_utc": 1585464514.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah, that's the saddest part about it",
                    "author": "Elias_freecss",
                    "id": "flqk2v0",
                    "parent_id": "t1_flqjq2k",
                    "score": 17,
                    "created_utc": 1585397789.0,
                    "replies": []
                },
                {
                    "body": "I mean Naruto still changed and chose his own destiny in the end. Following the destiny, would be killing Sasuke and let cicle of hate flow. When Naruto chooses to talk instead of killing, he's going against destiny.",
                    "author": "jhoho34",
                    "id": "flt38vf",
                    "parent_id": "t1_flqjq2k",
                    "score": 5,
                    "created_utc": 1585457918.0,
                    "replies": [
                        {
                            "body": "Was that Naruto's destiny or Asura's. I feel like that was more of Asura's mentality with friends over war and conflict.",
                            "author": null,
                            "id": "flt9rxw",
                            "parent_id": "t1_flt38vf",
                            "score": 2,
                            "created_utc": 1585464103.0,
                            "replies": [
                                {
                                    "body": "But Asura fate, is linked to Naruto's fate. So it was Naruto fate to kill Sasuke, just like how Hashirama killed Madara and Asura killed Indra, that's the fate of the reincarnations, to duel until Asura wins. When Naruto accepts Sasuke, he rejects what was decided for him, he creates a new path.",
                                    "author": "jhoho34",
                                    "id": "flta3d6",
                                    "parent_id": "t1_flt9rxw",
                                    "score": 4,
                                    "created_utc": 1585464435.0,
                                    "replies": [
                                        {
                                            "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
                                            "author": null,
                                            "id": "fltarsh",
                                            "parent_id": "t1_flta3d6",
                                            "score": 1,
                                            "created_utc": 1585465169.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We don't know if Tenten is Metal Lee's mother. I sure hope she is, but it's not confirmed.",
            "author": null,
            "id": "flqtw1v",
            "parent_id": "t1_flqrxvc",
            "score": 9,
            "created_utc": 1585406080.0,
            "replies": [
                {
                    "body": "The theory is that rock lee's reproduce asexually.\n\nAsexually, as it turns out, is Tenten's birth name.",
                    "author": "LurkerPatrol",
                    "id": "flqu260",
                    "parent_id": "t1_flqtw1v",
                    "score": 31,
                    "created_utc": 1585406198.0,
                    "replies": [
                        {
                            "body": "Lmao!",
                            "author": null,
                            "id": "flqu6wz",
                            "parent_id": "t1_flqu260",
                            "score": 4,
                            "created_utc": 1585406290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You didn't prove anything tho",
            "author": "TheAtomicClock",
            "id": "ftka93a",
            "parent_id": "t1_fls3yt4",
            "score": 6,
            "created_utc": 1591773386.0,
            "replies": [
                {
                    "body": "well he did tho.\n\nHe gave his opinion respectfully and all of Lee's dick suckers downvoted his comment",
                    "author": null,
                    "id": "fxeiesg",
                    "parent_id": "t1_ftka93a",
                    "score": 4,
                    "created_utc": 1594281865.0,
                    "replies": [
                        {
                            "body": "And they did so using the power of youth while simultaneously improving themselves fucktard, god, i cant believe you. /s",
                            "author": "Niigaanii",
                            "id": "fyyjo8p",
                            "parent_id": "t1_fxeiesg",
                            "score": 5,
                            "created_utc": 1595489654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The message is everything, without it, you end up with a space bunny as the last villain, instead of the powerful mastermind that was madara.\n\nAnd naruto defeating him, not only with physical strength, but with the powerful conviction that only someone that trains himself to death can have.\n\nAlso, naruto vs obito would be the ultimate battle, obito being intangible and naruto only using taijutsu. That would have represented something very powerfull, that no matter how much you train, you cannot touch an uchiha, and then, having him defeated. \n\nThroughout the story, we se that uchihas have their powers gifted to them, naruto being the antithesis to that would be really powerful.\n\nThe ultimate outcast, not only he is the jinchuriki of the nine tails, an orphar, everyone hates him, but he cannot perform jutsu as well (maybe as a consequence of the seal) , that would have made him the ultimate outsider of the shinobi world, with an outide perspective, and thus, the only one fit to change it, without any weird prophecy or reincarnation, but with sheer will, as it should be.",
            "author": "Elias_freecss",
            "id": "flqjy8n",
            "parent_id": "t1_flqfqjw",
            "score": 21,
            "created_utc": 1585397659.0,
            "replies": [
                {
                    "body": "It was definitely not perfectly executed, but I think the elements are there to make a fantastic story. I could probably edit it to be better.\nBut I do love it.",
                    "author": null,
                    "id": "flqk45i",
                    "parent_id": "t1_flqjy8n",
                    "score": 9,
                    "created_utc": 1585397825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Saying everyone follows their destiny is an objective truth. Being so salty about what you perceive to be your destiny that you shit on everyone else's aspirations makes you an asshole.\n\nNeji claimed he knew Naruto's destiny without even properly knowing the dude. That's jaded arrogance not intelligence.",
            "author": "sonfoa",
            "id": "fls45i2",
            "parent_id": "t1_flqjq2k",
            "score": 9,
            "created_utc": 1585433964.0,
            "replies": [
                {
                    "body": "It's just a joke. But the part a lot of people are saying he's right on is that natural born talent wins over hard work and dedication. That naruto wins most of the time through the nine tails that was given to him when he was born and not through his hard work. Whenever naruto tries to win ignoring the nine tails he fails say the rasengan or sage mode he loses that's what people are saying.",
                    "author": null,
                    "id": "fls4htg",
                    "parent_id": "t1_fls45i2",
                    "score": 6,
                    "created_utc": 1585434173.0,
                    "replies": [
                        {
                            "body": "Ok but Naruto was talented from the start though, he just wasn't trained in the right way. I don't get why people try to shove that hardwork vs. talent from Lee to Naruto.\n\nIf Minato and Kushina didn't die, Naruto would crap on the rest of his generation just as Boruto is doing now",
                            "author": "Wisterosa",
                            "id": "flt2pj8",
                            "parent_id": "t1_fls4htg",
                            "score": 7,
                            "created_utc": 1585457469.0,
                            "replies": [
                                {
                                    "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
                                    "author": null,
                                    "id": "flta5zm",
                                    "parent_id": "t1_flt2pj8",
                                    "score": 2,
                                    "created_utc": 1585464514.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, that's the saddest part about it",
            "author": "Elias_freecss",
            "id": "flqk2v0",
            "parent_id": "t1_flqjq2k",
            "score": 17,
            "created_utc": 1585397789.0,
            "replies": []
        },
        {
            "body": "I mean Naruto still changed and chose his own destiny in the end. Following the destiny, would be killing Sasuke and let cicle of hate flow. When Naruto chooses to talk instead of killing, he's going against destiny.",
            "author": "jhoho34",
            "id": "flt38vf",
            "parent_id": "t1_flqjq2k",
            "score": 5,
            "created_utc": 1585457918.0,
            "replies": [
                {
                    "body": "Was that Naruto's destiny or Asura's. I feel like that was more of Asura's mentality with friends over war and conflict.",
                    "author": null,
                    "id": "flt9rxw",
                    "parent_id": "t1_flt38vf",
                    "score": 2,
                    "created_utc": 1585464103.0,
                    "replies": [
                        {
                            "body": "But Asura fate, is linked to Naruto's fate. So it was Naruto fate to kill Sasuke, just like how Hashirama killed Madara and Asura killed Indra, that's the fate of the reincarnations, to duel until Asura wins. When Naruto accepts Sasuke, he rejects what was decided for him, he creates a new path.",
                            "author": "jhoho34",
                            "id": "flta3d6",
                            "parent_id": "t1_flt9rxw",
                            "score": 4,
                            "created_utc": 1585464435.0,
                            "replies": [
                                {
                                    "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
                                    "author": null,
                                    "id": "fltarsh",
                                    "parent_id": "t1_flta3d6",
                                    "score": 1,
                                    "created_utc": 1585465169.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The theory is that rock lee's reproduce asexually.\n\nAsexually, as it turns out, is Tenten's birth name.",
            "author": "LurkerPatrol",
            "id": "flqu260",
            "parent_id": "t1_flqtw1v",
            "score": 31,
            "created_utc": 1585406198.0,
            "replies": [
                {
                    "body": "Lmao!",
                    "author": null,
                    "id": "flqu6wz",
                    "parent_id": "t1_flqu260",
                    "score": 4,
                    "created_utc": 1585406290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "well he did tho.\n\nHe gave his opinion respectfully and all of Lee's dick suckers downvoted his comment",
            "author": null,
            "id": "fxeiesg",
            "parent_id": "t1_ftka93a",
            "score": 4,
            "created_utc": 1594281865.0,
            "replies": [
                {
                    "body": "And they did so using the power of youth while simultaneously improving themselves fucktard, god, i cant believe you. /s",
                    "author": "Niigaanii",
                    "id": "fyyjo8p",
                    "parent_id": "t1_fxeiesg",
                    "score": 5,
                    "created_utc": 1595489654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was definitely not perfectly executed, but I think the elements are there to make a fantastic story. I could probably edit it to be better.\nBut I do love it.",
            "author": null,
            "id": "flqk45i",
            "parent_id": "t1_flqjy8n",
            "score": 9,
            "created_utc": 1585397825.0,
            "replies": []
        },
        {
            "body": "It's just a joke. But the part a lot of people are saying he's right on is that natural born talent wins over hard work and dedication. That naruto wins most of the time through the nine tails that was given to him when he was born and not through his hard work. Whenever naruto tries to win ignoring the nine tails he fails say the rasengan or sage mode he loses that's what people are saying.",
            "author": null,
            "id": "fls4htg",
            "parent_id": "t1_fls45i2",
            "score": 6,
            "created_utc": 1585434173.0,
            "replies": [
                {
                    "body": "Ok but Naruto was talented from the start though, he just wasn't trained in the right way. I don't get why people try to shove that hardwork vs. talent from Lee to Naruto.\n\nIf Minato and Kushina didn't die, Naruto would crap on the rest of his generation just as Boruto is doing now",
                    "author": "Wisterosa",
                    "id": "flt2pj8",
                    "parent_id": "t1_fls4htg",
                    "score": 7,
                    "created_utc": 1585457469.0,
                    "replies": [
                        {
                            "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
                            "author": null,
                            "id": "flta5zm",
                            "parent_id": "t1_flt2pj8",
                            "score": 2,
                            "created_utc": 1585464514.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Was that Naruto's destiny or Asura's. I feel like that was more of Asura's mentality with friends over war and conflict.",
            "author": null,
            "id": "flt9rxw",
            "parent_id": "t1_flt38vf",
            "score": 2,
            "created_utc": 1585464103.0,
            "replies": [
                {
                    "body": "But Asura fate, is linked to Naruto's fate. So it was Naruto fate to kill Sasuke, just like how Hashirama killed Madara and Asura killed Indra, that's the fate of the reincarnations, to duel until Asura wins. When Naruto accepts Sasuke, he rejects what was decided for him, he creates a new path.",
                    "author": "jhoho34",
                    "id": "flta3d6",
                    "parent_id": "t1_flt9rxw",
                    "score": 4,
                    "created_utc": 1585464435.0,
                    "replies": [
                        {
                            "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
                            "author": null,
                            "id": "fltarsh",
                            "parent_id": "t1_flta3d6",
                            "score": 1,
                            "created_utc": 1585465169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lmao!",
            "author": null,
            "id": "flqu6wz",
            "parent_id": "t1_flqu260",
            "score": 4,
            "created_utc": 1585406290.0,
            "replies": []
        },
        {
            "body": "And they did so using the power of youth while simultaneously improving themselves fucktard, god, i cant believe you. /s",
            "author": "Niigaanii",
            "id": "fyyjo8p",
            "parent_id": "t1_fxeiesg",
            "score": 5,
            "created_utc": 1595489654.0,
            "replies": []
        },
        {
            "body": "Ok but Naruto was talented from the start though, he just wasn't trained in the right way. I don't get why people try to shove that hardwork vs. talent from Lee to Naruto.\n\nIf Minato and Kushina didn't die, Naruto would crap on the rest of his generation just as Boruto is doing now",
            "author": "Wisterosa",
            "id": "flt2pj8",
            "parent_id": "t1_fls4htg",
            "score": 7,
            "created_utc": 1585457469.0,
            "replies": [
                {
                    "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
                    "author": null,
                    "id": "flta5zm",
                    "parent_id": "t1_flt2pj8",
                    "score": 2,
                    "created_utc": 1585464514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But Asura fate, is linked to Naruto's fate. So it was Naruto fate to kill Sasuke, just like how Hashirama killed Madara and Asura killed Indra, that's the fate of the reincarnations, to duel until Asura wins. When Naruto accepts Sasuke, he rejects what was decided for him, he creates a new path.",
            "author": "jhoho34",
            "id": "flta3d6",
            "parent_id": "t1_flt9rxw",
            "score": 4,
            "created_utc": 1585464435.0,
            "replies": [
                {
                    "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
                    "author": null,
                    "id": "fltarsh",
                    "parent_id": "t1_flta3d6",
                    "score": 1,
                    "created_utc": 1585465169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because Neji lumped him in there till Naruto changed his mind. That's what I was saying Naruto was basically talented from the start. Take the nine tails away he still is Asura reincarnated. What Neji couldn't see with his eyes though was the Nine Tails hindering him from doing what others could do easily.",
            "author": null,
            "id": "flta5zm",
            "parent_id": "t1_flt2pj8",
            "score": 2,
            "created_utc": 1585464514.0,
            "replies": []
        },
        {
            "body": "I mean that's not what I meant by Neji was right but I see what you are saying. At the same time Asura, Hashirama, and Naruto never wanted conflict they wanted to end it. If destiny wins out in the end then sure Indras side will always win out. In my opinion I think Naruto was fated to go on that path but that's just my opinion I didnt write the story. Remember Hashirama won his battle with Madara but didnt change him. Naruto took it a step further and changed Sasuke",
            "author": null,
            "id": "fltarsh",
            "parent_id": "t1_flta3d6",
            "score": 1,
            "created_utc": 1585465169.0,
            "replies": []
        }
    ]
}