{
    "title": "Pushy SD",
    "post_id": "xtvk8l",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xtvk8l/pushy_sd/",
    "author": null,
    "body": "I’m sharing this mostly for newer SB’s/SB’s having a hard time in the bowl. I get so sad reading all the SLF posts about salt daddies & abusers. There **are** good SD’s out there. \n\n\nMy SD went on a 3 day work trip and when he got back asked to see me. It was my time of the month, so I told him. I was expecting him to say nvm/want to reschedule because intimacy was off the table.. Instead, he said he still missed me and thought I should come over anyway. Half of me was confused if he understood. He sent another text saying he’d make me a steak with mashed potatoes and had some chocolate candy from his kids if I wanted it. I said “ ok :) “.  When I made it to his house we had dinner, watched a movie, cuddled and he rubbed my back and we fell asleep. The next morning I had to leave for work and wasn’t expecting my allowance. I gave him a kiss goodbye, and he gave me the usual ppm. He said he understands women need a break sometimes, and would never push me or coerce me. Ladies, this is what a good SD looks like. They should care about you inside AND outside the bedroom!\n\n-Edit: Some people are missing the point! It’s not about bare minimum. (Unless you want me to brag about all the gifts, trips and how much allowance I get) 🙄 The point is, my SD knew it would be a platonic meet but still catered to me & gave me the full ppm. Don’t settle for pushy SD’s or salt daddies.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xtvk8l/pushy_sd/",
    "score": 265,
    "upvote_ratio": 0.98,
    "created_utc": 1664734297.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Congratulations on finding a real and wonderful Sugar Relationship! \n\nThis is exactly what we all hope for here.\n\nThis is what makes all the scammers and entitled types worth getting past.",
            "author": "sd424242",
            "id": "iqsizj7",
            "parent_id": "t3_xtvk8l",
            "score": 35,
            "created_utc": 1664740064.0,
            "replies": []
        },
        {
            "body": ">The next morning I had to leave for work and wasn’t expecting my allowance. \n\nYou get what you give. Judging you from this statement alone, we can tell that you're not trying to take advantage of him and probably treat him well, which should and does get reciprocated often. \n\nGood job. You two seem like a good match.",
            "author": "non_giant_panda",
            "id": "iqs5awz",
            "parent_id": "t3_xtvk8l",
            "score": 40,
            "created_utc": 1664735045.0,
            "replies": [
                {
                    "body": "100%. Neither of them are trying to maximise their own interests at the cost of the other person.",
                    "author": "evad111",
                    "id": "iqs5y20",
                    "parent_id": "t1_iqs5awz",
                    "score": 12,
                    "created_utc": 1664735285.0,
                    "replies": []
                },
                {
                    "body": "This. Most SB’s aren’t like the OP, they wouldn’t have gone over if they weren’t expecting a ppm. The OP is a gem for sure.",
                    "author": null,
                    "id": "iqsfjeb",
                    "parent_id": "t1_iqs5awz",
                    "score": 9,
                    "created_utc": 1664738819.0,
                    "replies": [
                        {
                            "body": "that's the real story for me as an SD, and exactly why she deserved the gift. She went there to be there for him. That's what both people do in a relationship. This sounds like a good relationship",
                            "author": "Fabulous_Storm2437",
                            "id": "iqu8t6v",
                            "parent_id": "t1_iqsfjeb",
                            "score": 8,
                            "created_utc": 1664766541.0,
                            "replies": [
                                {
                                    "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
                                    "author": "WhisperingPetals",
                                    "id": "iqvac7z",
                                    "parent_id": "t1_iqu8t6v",
                                    "score": 2,
                                    "created_utc": 1664794885.0,
                                    "replies": []
                                },
                                {
                                    "body": "100%",
                                    "author": null,
                                    "id": "iqu98eg",
                                    "parent_id": "t1_iqu8t6v",
                                    "score": 2,
                                    "created_utc": 1664766758.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
                            "author": "WhisperingPetals",
                            "id": "iqvaaw3",
                            "parent_id": "t1_iqsfjeb",
                            "score": 3,
                            "created_utc": 1664794861.0,
                            "replies": [
                                {
                                    "body": "I agree. In fact this is why sugar girls get taken advantage off. The salts are quick to say they don't want an escort but then don't want to give you an allowance without getting intimacy.  If SD ASKED for your attention and YOUR time regardless if your mentrating or not you should most definitely expect in return the ppm allowance.. its literally plain and simple.  They ask and you expect!",
                                    "author": "Aromatic_Handle2743",
                                    "id": "iqxsow1",
                                    "parent_id": "t1_iqvaaw3",
                                    "score": 7,
                                    "created_utc": 1664833322.0,
                                    "replies": []
                                },
                                {
                                    "body": "Call it what you want. But most men will expect something in return if they are giving a ppm/allowance. We all know what that something in return is. And it isn’t a good conversation lol.",
                                    "author": null,
                                    "id": "iqvar8v",
                                    "parent_id": "t1_iqvaaw3",
                                    "score": 3,
                                    "created_utc": 1664795179.0,
                                    "replies": [
                                        {
                                            "body": "Most MEN???. MOST experienced realSD's should understand that if you're asking for attention From  WOMAN then you should most definitely do your part and give her the value she's Wortham any given time. If you just want to give for intimacy then hop on to a site that you can pay for that on... PERIOD!",
                                            "author": "Aromatic_Handle2743",
                                            "id": "iqxt4ox",
                                            "parent_id": "t1_iqvar8v",
                                            "score": 4,
                                            "created_utc": 1664833506.0,
                                            "replies": [
                                                {
                                                    "body": "So it’s just a one sided thing. You get all the benefit and not us? Your time is more valuable than ours? No thanks!",
                                                    "author": null,
                                                    "id": "iqxtb46",
                                                    "parent_id": "t1_iqxt4ox",
                                                    "score": 2,
                                                    "created_utc": 1664833581.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
                                                            "author": "Aromatic_Handle2743",
                                                            "id": "iqxu8a8",
                                                            "parent_id": "t1_iqxtb46",
                                                            "score": 4,
                                                            "created_utc": 1664833971.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                                                                    "author": null,
                                                                    "id": "iqxy1hx",
                                                                    "parent_id": "t1_iqxu8a8",
                                                                    "score": 1,
                                                                    "created_utc": 1664835615.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "She likes him. Simple.",
                            "author": "261chameleons",
                            "id": "ir0s5p4",
                            "parent_id": "t1_iqsfjeb",
                            "score": 5,
                            "created_utc": 1664894497.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so heart warming. ❤️",
            "author": null,
            "id": "iqsb0w4",
            "parent_id": "t3_xtvk8l",
            "score": 11,
            "created_utc": 1664737185.0,
            "replies": []
        },
        {
            "body": "Love this post! There’s definitely good and bad out here! I love hearing stories like this though because it’s really how it is supposed to be, and your last comment on your post as well ! 💜",
            "author": "starsdesires",
            "id": "iqtleuj",
            "parent_id": "t3_xtvk8l",
            "score": 3,
            "created_utc": 1664755582.0,
            "replies": []
        },
        {
            "body": "Yep this is a good SB and a good SD combo. Instead of each one with their own agenda trying to maximize their sugar intake while minimizing the sugar export.",
            "author": "Federal_Garage_4307",
            "id": "iquys3g",
            "parent_id": "t3_xtvk8l",
            "score": 4,
            "created_utc": 1664784951.0,
            "replies": []
        },
        {
            "body": "Great story - need to hear the sometimes - seems genuine and Mayes me want to find more if that !!! Vs. get the bag and run stories or creepy predators - these stories fuck it up for everybody",
            "author": "AbsolutePepper",
            "id": "iqtnb5f",
            "parent_id": "t3_xtvk8l",
            "score": 3,
            "created_utc": 1664756460.0,
            "replies": []
        },
        {
            "body": "This 😘",
            "author": "Awkward_Pop_3996",
            "id": "iqsvsbr",
            "parent_id": "t3_xtvk8l",
            "score": 2,
            "created_utc": 1664744837.0,
            "replies": []
        },
        {
            "body": "good story:)",
            "author": null,
            "id": "iqt8zgs",
            "parent_id": "t3_xtvk8l",
            "score": 2,
            "created_utc": 1664750199.0,
            "replies": []
        },
        {
            "body": "And I want to say I don’t like when SB’s put all SD’s in the same group that got burned in the past.",
            "author": "Alive-Worldliness-27",
            "id": "iqs4ocd",
            "parent_id": "t3_xtvk8l",
            "score": 4,
            "created_utc": 1664734817.0,
            "replies": [
                {
                    "body": "I used to think the same but then you hear stories which are heartbreaking. I rather all SBs lump us together until we prove otherwise. I am totally okay to jump through the hoops for them to not to go through that. \n\nDon’t get me wrong, I ain’t no simp and can be total asshole when needed but when you hear stories you sometimes feel ashamed to be sharing same domain as some of them.",
                    "author": null,
                    "id": "iqs63s7",
                    "parent_id": "t1_iqs4ocd",
                    "score": 20,
                    "created_utc": 1664735346.0,
                    "replies": [
                        {
                            "body": "THIS RIGHT HERE.\nIf you knew what some of these women have been through, with fakers, scams, salt/Splenda Daddies, you'd understand why a lot of women develop that thought process.\n\nI'll prove myself to my POT SD, just as I expect the same, but I don't expect you to have \"endless faith\" in me, before we even hit the M&G stage.",
                            "author": "JustAsk4Alice",
                            "id": "iqtmmgv",
                            "parent_id": "t1_iqs63s7",
                            "score": 10,
                            "created_utc": 1664756144.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Dude SA is so full of predators and creeps Im down with getting pigeonholed at first.  I just hear about so many bad experiences on SA from every one of my SBs.  Every single one.",
                    "author": "JDMultralight",
                    "id": "iqs96vo",
                    "parent_id": "t1_iqs4ocd",
                    "score": 15,
                    "created_utc": 1664736506.0,
                    "replies": [
                        {
                            "body": "👏 👏 👏",
                            "author": null,
                            "id": "iqsgq7r",
                            "parent_id": "t1_iqs96vo",
                            "score": 5,
                            "created_utc": 1664739238.0,
                            "replies": []
                        },
                        {
                            "body": "That’s sad hopefully is good SD’s can turn that around",
                            "author": "Alive-Worldliness-27",
                            "id": "iqs9lu0",
                            "parent_id": "t1_iqs96vo",
                            "score": 2,
                            "created_utc": 1664736658.0,
                            "replies": [
                                {
                                    "body": "We're outnumbered a hundred to one by predators",
                                    "author": "Daddy_Dom_47",
                                    "id": "iqshbc1",
                                    "parent_id": "t1_iqs9lu0",
                                    "score": 7,
                                    "created_utc": 1664739450.0,
                                    "replies": []
                                },
                                {
                                    "body": "I hope to try!  But it’s an uphill battle.",
                                    "author": "JDMultralight",
                                    "id": "iqtms51",
                                    "parent_id": "t1_iqs9lu0",
                                    "score": 4,
                                    "created_utc": 1664756216.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Right, It's also my impression that many SB's get taken in by big promises and get burned, instead of putting in more work and time to find someone good.  Anything worthwhile takes effort.  Goes for SD's too.",
                    "author": "nerojt",
                    "id": "iqt7n3k",
                    "parent_id": "t1_iqs4ocd",
                    "score": 3,
                    "created_utc": 1664749621.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He did his part! Now it’s your turn to do something special for him. A lot of SBs at this stage start to think that they have the SD cornered and start taking undue advantage and then quickly get fired.",
            "author": null,
            "id": "iqsle67",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664740924.0,
            "replies": [
                {
                    "body": "I did! This took place around 2 weeks ago. Before our next meet, I stopped at a store & picked out the funniest thank you card I could find. It had a joke about age.. I wrote a cute paragraph and signed it. He keeps it on a magnet on his refrigerator 🤣",
                    "author": null,
                    "id": "iqsmde6",
                    "parent_id": "t1_iqsle67",
                    "score": 12,
                    "created_utc": 1664741279.0,
                    "replies": [
                        {
                            "body": "Unfortunately, there will always be 1 secret hater in the group that’s never happy for you. Clearly it’s @WhisperingPetals 😏",
                            "author": null,
                            "id": "iqvjg3o",
                            "parent_id": "t1_iqsmde6",
                            "score": 3,
                            "created_utc": 1664800480.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "He did the most basic thing a guy would do in a relationship. If he personally cooked for her and brought her bfast in bed and bought her a box of chocolates now that is him doing something 'special' and worth reciprocating. \n\nOtherwise she already did the equal amount by coming over and spending time with him, cuddling with him, watching a movie with him.",
                    "author": "WhisperingPetals",
                    "id": "iqvba8y",
                    "parent_id": "t1_iqsle67",
                    "score": 3,
                    "created_utc": 1664795547.0,
                    "replies": [
                        {
                            "body": "This.  It's a relationship right.  She gave him the gift of her time and energy.",
                            "author": "Unlikely_Shower_1521",
                            "id": "iqw84d4",
                            "parent_id": "t1_iqvba8y",
                            "score": 5,
                            "created_utc": 1664811477.0,
                            "replies": []
                        },
                        {
                            "body": "I looked at your post history, you’re crazy\n\nEvery girl in that other sub is crazy as well. You guys need serious help",
                            "author": "innight41",
                            "id": "iqxzri0",
                            "parent_id": "t1_iqvba8y",
                            "score": 1,
                            "created_utc": 1664836381.0,
                            "replies": [
                                {
                                    "body": "She's not crazy :) A bit delusional for sure, but overall seems to be a cute person.",
                                    "author": "SeekingInSydney",
                                    "id": "iqza95i",
                                    "parent_id": "t1_iqxzri0",
                                    "score": 1,
                                    "created_utc": 1664858987.0,
                                    "replies": [
                                        {
                                            "body": "Those girls in that sub are literally mental\n\nLike they need serious help",
                                            "author": "innight41",
                                            "id": "iqzd3bt",
                                            "parent_id": "t1_iqza95i",
                                            "score": 1,
                                            "created_utc": 1664860877.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You need to seriously stop trolling, you have issues. It’s called projection and they have therapy for that. \n\nI looked at your post history and realize you are just here to be toxic - You bring no value to this forum. Account from yesterday - shockingly low value",
                                    "author": "JSBelle",
                                    "id": "ir0mafw",
                                    "parent_id": "t1_iqxzri0",
                                    "score": 1,
                                    "created_utc": 1664892046.0,
                                    "replies": [
                                        {
                                            "body": "I looked at your profile and you seem to call everyone a troll who doesn’t agree with you. You’re getting out of control for no reason",
                                            "author": "innight41",
                                            "id": "ir0nfor",
                                            "parent_id": "t1_ir0mafw",
                                            "score": 1,
                                            "created_utc": 1664892542.0,
                                            "replies": [
                                                {
                                                    "body": "Blockity block.",
                                                    "author": "JSBelle",
                                                    "id": "ir0nva2",
                                                    "parent_id": "t1_ir0nfor",
                                                    "score": 2,
                                                    "created_utc": 1664892728.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Except he paid her in cash at the end, which you conveniently ignored. Why are you trying to shit on this guy? If he was having temporary bank issues and she still was intimate knowing he wouldn't pay her, would you still think that it's nothing special or worth reciprocating?",
                            "author": "maosaysmiao",
                            "id": "iqvikzo",
                            "parent_id": "t1_iqvba8y",
                            "score": 1,
                            "created_utc": 1664799997.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What makes you think she didn’t do/doesn’t do/hasn’t done special things for him?  🤦🏻‍♂️",
                    "author": "Chill_SD1974",
                    "id": "iqwbjte",
                    "parent_id": "t1_iqsle67",
                    "score": 2,
                    "created_utc": 1664812836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You get what you give. Good on him for treating you like a human being",
            "author": "Pretend-Musician-912",
            "id": "iqs85g4",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664736113.0,
            "replies": []
        },
        {
            "body": "and i have had platonic SBs ask for 50% raise in allowance after a few weeks of dates like you just described - minus the spending the night part. (i left them over that, too)",
            "author": "Fabulous_Storm2437",
            "id": "iqu94fo",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664766700.0,
            "replies": []
        },
        {
            "body": "If you're going to be in a sugar relationship you need to learn not to be naive and not only expect you're going to get money when you have sex with a guy. That's escorting. \n\nA guy should def still hang out with you when you are ending your cycle and still give you the same amount. That's why it's a relationship. \n\nThis is normal SD behavior. Let's not give him extra points for doing the most basic thing that all should. Let's not set the bar so low. \n\nThat's good that you found a decent SD that behaves like a normal human being and not a douchebag. \n\nSave the bonus points for the ones that go above and beyond. \n\nAnd thanks for pointing out that decent human beings exist.",
            "author": "WhisperingPetals",
            "id": "iqvautm",
            "parent_id": "t3_xtvk8l",
            "score": 0,
            "created_utc": 1664795249.0,
            "replies": [
                {
                    "body": "There will always be that one negative Nancy or nitpicker, so here we go! \n\nI’ve been in the sugar bowl on/off for 3 years, so I don’t need the unsolicited lecture. (Reread the first two sentences of the post to understand why I even uploaded it.. it’s to uplift the SB’s who haven’t had any good experiences. & clearly you haven’t been keeping up with the SLF, or you’d see why this post was needed. I’m actually well aware this behavior is “normal”.. Where in my post did I claim it was “above & beyond?” You can’t judge my SD based off one snippet I decided to share.. the bar with him is definitely not low. Or would you rather hear about all the good sex, trips we take, and money he spends? 🙄 moral of the story, SD’s should see us as human and treat us accordingly, but it’s a matter of do they?",
                    "author": null,
                    "id": "iqvi7ul",
                    "parent_id": "t1_iqvautm",
                    "score": 4,
                    "created_utc": 1664799794.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good story - you guys both are model citizens here. This is how it should be",
            "author": "OCbird22",
            "id": "iqsjq4v",
            "parent_id": "t3_xtvk8l",
            "score": 0,
            "created_utc": 1664740327.0,
            "replies": []
        },
        {
            "body": "How much average ppm should be ????\nDoes SD have to pay ppm everytime even On just normal 1 2 hours dinner date ?",
            "author": "Tigerfly-007",
            "id": "iqsskr8",
            "parent_id": "t3_xtvk8l",
            "score": 0,
            "created_utc": 1664743608.0,
            "replies": [
                {
                    "body": "If you're in a sugar relationship yes.",
                    "author": "WhisperingPetals",
                    "id": "iqvbjnk",
                    "parent_id": "t1_iqsskr8",
                    "score": 0,
                    "created_utc": 1664795728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A nice story, but if you go on a date you should absolutely except your \"ppm\", sex or not.\n\nThat's like the bare minimum.",
            "author": "Unlikely_Shower_1521",
            "id": "iqw7p38",
            "parent_id": "t3_xtvk8l",
            "score": 0,
            "created_utc": 1664811307.0,
            "replies": [
                {
                    "body": "You mean “accept” not “except” and the SD did provide the usual financial support. Pay tf attention.",
                    "author": "Chill_SD1974",
                    "id": "irrs3e0",
                    "parent_id": "t1_iqw7p38",
                    "score": 3,
                    "created_utc": 1665415816.0,
                    "replies": [
                        {
                            "body": "Aww, is someone desperate for some attention today.\n\nAnd actually I meant expect, but thanks for taking the time out of what must be a very full and busy life to attempt to correct a woman's grammar ; )",
                            "author": "Unlikely_Shower_1521",
                            "id": "irt5e6n",
                            "parent_id": "t1_irrs3e0",
                            "score": -2,
                            "created_utc": 1665435761.0,
                            "replies": [
                                {
                                    "body": "I didn’t choose to comment because of your misspelling. Happens to all of us. \n\nYou know the gif that shows the words “THE POINT” floating past the stick figure head of someone cluelessly looking up?  Well that’s you. \nBecause my main point was that the OP had a wonderful experience including receiving full financial support and you had to minimize it by saying she got just the bare minimum. \n\nThanks for your concern about my schedule. I had a spare moment to catch up on SLF as today is a federal holiday. Sorry if I took you away from crapping on someone else’s post. \n\nBtw, I didn’t care about or notice your gender. You don’t use a flair and most people don’t put too much thought into designing their Reddit avatar.",
                                    "author": "Chill_SD1974",
                                    "id": "irtbzaj",
                                    "parent_id": "t1_irt5e6n",
                                    "score": 2,
                                    "created_utc": 1665438604.0,
                                    "replies": [
                                        {
                                            "body": "Wow, that's an odd takeaway from my comment.\n\nI'm happy OP is happy, however holding up behaviour that is the bare minimum as something unbelievable just works to drive SB's low expectations ever lower.\n\nI hope one day the SD's of reddit will be confident enough in their bona fides that women with high expectations wont be soo scary and rage inducing.\n\nBe better and you won't feel soo threatened in the future.",
                                            "author": "Unlikely_Shower_1521",
                                            "id": "iryd7kb",
                                            "parent_id": "t1_irtbzaj",
                                            "score": 0,
                                            "created_utc": 1665530246.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Girl the best advice I can give you is to OWN your worth. Expect something all the time if your giving your time. That's why you're in the bowel. If you want someone to rub your back and feed you chocolate there's a dime a dozen for that! Own your confidence at any level and be sure to understand your worth before agreeing to spending the night and giving any attention. HE DIDNT DO ANYTHING EVEN WORTH APLAUDING he acted accordingly to the life he chooses to have  as He should. You should never expect to give your attention for a pice of chocolate and a back rub you're definitely making it harder for the ones doing this for the reasons we are in this to begin with.",
            "author": "Aromatic_Handle2743",
            "id": "iqxtuot",
            "parent_id": "t3_xtvk8l",
            "score": 0,
            "created_utc": 1664833812.0,
            "replies": [
                {
                    "body": " You either lack basic reading comprehension skills, or didn’t read the entire post. I went over to his house for ONE **platonic** hangout while he catered to me. If you don’t enjoy your SD’s company enough for that, that’s sad on YOUR part & you should choose better!  Still got my full ppm & didn’t need to take my clothes off 😏",
                    "author": null,
                    "id": "iqxuol2",
                    "parent_id": "t1_iqxtuot",
                    "score": 3,
                    "created_utc": 1664834164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would gladly do the same for my SB 😀. We have sex during her  period - she doesn’t mind and there is a weird couples intimacy to it but if she didn’t want to, I would be okay with it.",
            "author": "vikamb137",
            "id": "ir2dshs",
            "parent_id": "t3_xtvk8l",
            "score": 0,
            "created_utc": 1664916269.0,
            "replies": []
        },
        {
            "body": "Why is period sex off the table?",
            "author": "NotARussianBot1984",
            "id": "iqs91yc",
            "parent_id": "t3_xtvk8l",
            "score": -13,
            "created_utc": 1664736456.0,
            "replies": [
                {
                    "body": "This is the only thing you felt was worth commenting? Damn I feel sorry for your SB. 😂 Based off your response I highly doubt she “enjoys” it as much as you think she does. She probably needs the money or feels she has no choice.",
                    "author": null,
                    "id": "iqspe0m",
                    "parent_id": "t1_iqs91yc",
                    "score": 9,
                    "created_utc": 1664742389.0,
                    "replies": [
                        {
                            "body": "She requests it, helps relieve her cramps.   \n\n\nTo me, it's the same just add a towel and less position changes.  \n\n\nIt was the only thing I had a question for. I didn't comment on anything.",
                            "author": "NotARussianBot1984",
                            "id": "iqsqdpc",
                            "parent_id": "t1_iqspe0m",
                            "score": -7,
                            "created_utc": 1664742769.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Typical tone deaf male. Well, SHE enjoys it so All females must want it 🤡🙄",
                    "author": "Zia19",
                    "id": "iqsh8h5",
                    "parent_id": "t1_iqs91yc",
                    "score": 8,
                    "created_utc": 1664739421.0,
                    "replies": [
                        {
                            "body": "Always seems weird when women are called 'females.'   That's for studying fruit flies.",
                            "author": "nerojt",
                            "id": "iqt7rm2",
                            "parent_id": "t1_iqsh8h5",
                            "score": 4,
                            "created_utc": 1664749674.0,
                            "replies": []
                        },
                        {
                            "body": "You assume all men want period sex. Many don't. Not sure why you jumped to assume it's her boundary.",
                            "author": "NotARussianBot1984",
                            "id": "iqsqiit",
                            "parent_id": "t1_iqsh8h5",
                            "score": 0,
                            "created_utc": 1664742819.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Cuz she didn't fucking want it?",
                    "author": null,
                    "id": "iqsgsdj",
                    "parent_id": "t1_iqs91yc",
                    "score": 7,
                    "created_utc": 1664739260.0,
                    "replies": []
                },
                {
                    "body": "Not everyone is into it…your SB is not other SBs.",
                    "author": "No-Letterhead5328",
                    "id": "iqsrthm",
                    "parent_id": "t1_iqs91yc",
                    "score": 3,
                    "created_utc": 1664743312.0,
                    "replies": []
                },
                {
                    "body": "Some don't like it, I find it kind of gross if it's super heavy",
                    "author": "Daddy_Dom_47",
                    "id": "iqshesm",
                    "parent_id": "t1_iqs91yc",
                    "score": 5,
                    "created_utc": 1664739486.0,
                    "replies": [
                        {
                            "body": "I know some men don't, hence why I asked if it was his choice or hers.",
                            "author": "NotARussianBot1984",
                            "id": "iqsqlw2",
                            "parent_id": "t1_iqshesm",
                            "score": -1,
                            "created_utc": 1664742856.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This isn’t about you",
                    "author": "Toojew4u",
                    "id": "iqtdv74",
                    "parent_id": "t1_iqs91yc",
                    "score": 2,
                    "created_utc": 1664752250.0,
                    "replies": [
                        {
                            "body": "I asked a question, not about myself.",
                            "author": "NotARussianBot1984",
                            "id": "iqttq31",
                            "parent_id": "t1_iqtdv74",
                            "score": 0,
                            "created_utc": 1664759381.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The point is you shouldn't have sex with your SB on every single date. Whether she's ending her cycle or not.",
                    "author": "WhisperingPetals",
                    "id": "iqvbpc0",
                    "parent_id": "t1_iqs91yc",
                    "score": 2,
                    "created_utc": 1664795836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a good ending. Truly.",
            "author": "Frosty-Notice-5575",
            "id": "iqsm7ex",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664741216.0,
            "replies": []
        },
        {
            "body": "So cute!!!",
            "author": "eshtahnohs",
            "id": "iqttr4z",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664759395.0,
            "replies": []
        },
        {
            "body": "I wish, still keep finding salt step parents out here",
            "author": "slowfadinglight",
            "id": "iqupnq2",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664777195.0,
            "replies": []
        },
        {
            "body": "He is a lucky man 👨 ❤️.",
            "author": "Automatic_Joke_4414",
            "id": "iqv44ky",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664789846.0,
            "replies": []
        },
        {
            "body": "Thought you was going to tell us an example of a bad situation 😂 \nGlad it ended well.",
            "author": "Random-Generosity",
            "id": "iqvq2jm",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664803806.0,
            "replies": []
        },
        {
            "body": "Sounds like you two are a great match. Enjoy whatever amount of time you have together.",
            "author": "Ssd4me408",
            "id": "iqw9x8y",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664812198.0,
            "replies": []
        },
        {
            "body": "This is what me and my SBF’s relationship is like 🥰 it’s nice to feel taken care of. This should be the standard for all SRs",
            "author": "Putrid_Bread",
            "id": "iqwep72",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664814070.0,
            "replies": []
        },
        {
            "body": "sounds like a gentleman. congrats",
            "author": "davitech73",
            "id": "iqwrheb",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1664818983.0,
            "replies": []
        },
        {
            "body": "Lovely example of chivalry and your SD sounds like a real catch. I think spoiling each other makes for a good relationship. It makes you feel special to give and recieve simple pleasures. Thanks for sharing.",
            "author": "BABYgirl869",
            "id": "ir91e1f",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1665037205.0,
            "replies": []
        },
        {
            "body": "To anyone who knows u/Unlikely_Shower_1521, please tell her that the height of ineffective Reddit commentary is to reply to someone and then immediately block them. They can’t read the snappy reply. \n\nPresumably she was doubling down on her trivializing of the OP SB’s sharing her positive experience, calling it the “bare minimum” to be expected in an SR.  \n\nAs much as we always hope for the best in any relationship, vanilla or sugar, sometimes our SD/SB partners let us down. When they do come through when it counts, it’s always something to be celebrated. \n\nThank you",
            "author": "Chill_SD1974",
            "id": "iryfetf",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1665531241.0,
            "replies": []
        },
        {
            "body": "Love this story!",
            "author": "SDinAsia",
            "id": "irz0hfa",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1665541021.0,
            "replies": []
        },
        {
            "body": "kinda bait and switch title. but happy for ya regardless lol",
            "author": "Kind_Imagination5199",
            "id": "jij7pyf",
            "parent_id": "t3_xtvk8l",
            "score": 1,
            "created_utc": 1683009065.0,
            "replies": []
        },
        {
            "body": "100%. Neither of them are trying to maximise their own interests at the cost of the other person.",
            "author": "evad111",
            "id": "iqs5y20",
            "parent_id": "t1_iqs5awz",
            "score": 12,
            "created_utc": 1664735285.0,
            "replies": []
        },
        {
            "body": "This. Most SB’s aren’t like the OP, they wouldn’t have gone over if they weren’t expecting a ppm. The OP is a gem for sure.",
            "author": null,
            "id": "iqsfjeb",
            "parent_id": "t1_iqs5awz",
            "score": 9,
            "created_utc": 1664738819.0,
            "replies": [
                {
                    "body": "that's the real story for me as an SD, and exactly why she deserved the gift. She went there to be there for him. That's what both people do in a relationship. This sounds like a good relationship",
                    "author": "Fabulous_Storm2437",
                    "id": "iqu8t6v",
                    "parent_id": "t1_iqsfjeb",
                    "score": 8,
                    "created_utc": 1664766541.0,
                    "replies": [
                        {
                            "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
                            "author": "WhisperingPetals",
                            "id": "iqvac7z",
                            "parent_id": "t1_iqu8t6v",
                            "score": 2,
                            "created_utc": 1664794885.0,
                            "replies": []
                        },
                        {
                            "body": "100%",
                            "author": null,
                            "id": "iqu98eg",
                            "parent_id": "t1_iqu8t6v",
                            "score": 2,
                            "created_utc": 1664766758.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
                    "author": "WhisperingPetals",
                    "id": "iqvaaw3",
                    "parent_id": "t1_iqsfjeb",
                    "score": 3,
                    "created_utc": 1664794861.0,
                    "replies": [
                        {
                            "body": "I agree. In fact this is why sugar girls get taken advantage off. The salts are quick to say they don't want an escort but then don't want to give you an allowance without getting intimacy.  If SD ASKED for your attention and YOUR time regardless if your mentrating or not you should most definitely expect in return the ppm allowance.. its literally plain and simple.  They ask and you expect!",
                            "author": "Aromatic_Handle2743",
                            "id": "iqxsow1",
                            "parent_id": "t1_iqvaaw3",
                            "score": 7,
                            "created_utc": 1664833322.0,
                            "replies": []
                        },
                        {
                            "body": "Call it what you want. But most men will expect something in return if they are giving a ppm/allowance. We all know what that something in return is. And it isn’t a good conversation lol.",
                            "author": null,
                            "id": "iqvar8v",
                            "parent_id": "t1_iqvaaw3",
                            "score": 3,
                            "created_utc": 1664795179.0,
                            "replies": [
                                {
                                    "body": "Most MEN???. MOST experienced realSD's should understand that if you're asking for attention From  WOMAN then you should most definitely do your part and give her the value she's Wortham any given time. If you just want to give for intimacy then hop on to a site that you can pay for that on... PERIOD!",
                                    "author": "Aromatic_Handle2743",
                                    "id": "iqxt4ox",
                                    "parent_id": "t1_iqvar8v",
                                    "score": 4,
                                    "created_utc": 1664833506.0,
                                    "replies": [
                                        {
                                            "body": "So it’s just a one sided thing. You get all the benefit and not us? Your time is more valuable than ours? No thanks!",
                                            "author": null,
                                            "id": "iqxtb46",
                                            "parent_id": "t1_iqxt4ox",
                                            "score": 2,
                                            "created_utc": 1664833581.0,
                                            "replies": [
                                                {
                                                    "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
                                                    "author": "Aromatic_Handle2743",
                                                    "id": "iqxu8a8",
                                                    "parent_id": "t1_iqxtb46",
                                                    "score": 4,
                                                    "created_utc": 1664833971.0,
                                                    "replies": [
                                                        {
                                                            "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                                                            "author": null,
                                                            "id": "iqxy1hx",
                                                            "parent_id": "t1_iqxu8a8",
                                                            "score": 1,
                                                            "created_utc": 1664835615.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She likes him. Simple.",
                    "author": "261chameleons",
                    "id": "ir0s5p4",
                    "parent_id": "t1_iqsfjeb",
                    "score": 5,
                    "created_utc": 1664894497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I used to think the same but then you hear stories which are heartbreaking. I rather all SBs lump us together until we prove otherwise. I am totally okay to jump through the hoops for them to not to go through that. \n\nDon’t get me wrong, I ain’t no simp and can be total asshole when needed but when you hear stories you sometimes feel ashamed to be sharing same domain as some of them.",
            "author": null,
            "id": "iqs63s7",
            "parent_id": "t1_iqs4ocd",
            "score": 20,
            "created_utc": 1664735346.0,
            "replies": [
                {
                    "body": "THIS RIGHT HERE.\nIf you knew what some of these women have been through, with fakers, scams, salt/Splenda Daddies, you'd understand why a lot of women develop that thought process.\n\nI'll prove myself to my POT SD, just as I expect the same, but I don't expect you to have \"endless faith\" in me, before we even hit the M&G stage.",
                    "author": "JustAsk4Alice",
                    "id": "iqtmmgv",
                    "parent_id": "t1_iqs63s7",
                    "score": 10,
                    "created_utc": 1664756144.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude SA is so full of predators and creeps Im down with getting pigeonholed at first.  I just hear about so many bad experiences on SA from every one of my SBs.  Every single one.",
            "author": "JDMultralight",
            "id": "iqs96vo",
            "parent_id": "t1_iqs4ocd",
            "score": 15,
            "created_utc": 1664736506.0,
            "replies": [
                {
                    "body": "👏 👏 👏",
                    "author": null,
                    "id": "iqsgq7r",
                    "parent_id": "t1_iqs96vo",
                    "score": 5,
                    "created_utc": 1664739238.0,
                    "replies": []
                },
                {
                    "body": "That’s sad hopefully is good SD’s can turn that around",
                    "author": "Alive-Worldliness-27",
                    "id": "iqs9lu0",
                    "parent_id": "t1_iqs96vo",
                    "score": 2,
                    "created_utc": 1664736658.0,
                    "replies": [
                        {
                            "body": "We're outnumbered a hundred to one by predators",
                            "author": "Daddy_Dom_47",
                            "id": "iqshbc1",
                            "parent_id": "t1_iqs9lu0",
                            "score": 7,
                            "created_utc": 1664739450.0,
                            "replies": []
                        },
                        {
                            "body": "I hope to try!  But it’s an uphill battle.",
                            "author": "JDMultralight",
                            "id": "iqtms51",
                            "parent_id": "t1_iqs9lu0",
                            "score": 4,
                            "created_utc": 1664756216.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right, It's also my impression that many SB's get taken in by big promises and get burned, instead of putting in more work and time to find someone good.  Anything worthwhile takes effort.  Goes for SD's too.",
            "author": "nerojt",
            "id": "iqt7n3k",
            "parent_id": "t1_iqs4ocd",
            "score": 3,
            "created_utc": 1664749621.0,
            "replies": []
        },
        {
            "body": "I did! This took place around 2 weeks ago. Before our next meet, I stopped at a store & picked out the funniest thank you card I could find. It had a joke about age.. I wrote a cute paragraph and signed it. He keeps it on a magnet on his refrigerator 🤣",
            "author": null,
            "id": "iqsmde6",
            "parent_id": "t1_iqsle67",
            "score": 12,
            "created_utc": 1664741279.0,
            "replies": [
                {
                    "body": "Unfortunately, there will always be 1 secret hater in the group that’s never happy for you. Clearly it’s @WhisperingPetals 😏",
                    "author": null,
                    "id": "iqvjg3o",
                    "parent_id": "t1_iqsmde6",
                    "score": 3,
                    "created_utc": 1664800480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He did the most basic thing a guy would do in a relationship. If he personally cooked for her and brought her bfast in bed and bought her a box of chocolates now that is him doing something 'special' and worth reciprocating. \n\nOtherwise she already did the equal amount by coming over and spending time with him, cuddling with him, watching a movie with him.",
            "author": "WhisperingPetals",
            "id": "iqvba8y",
            "parent_id": "t1_iqsle67",
            "score": 3,
            "created_utc": 1664795547.0,
            "replies": [
                {
                    "body": "This.  It's a relationship right.  She gave him the gift of her time and energy.",
                    "author": "Unlikely_Shower_1521",
                    "id": "iqw84d4",
                    "parent_id": "t1_iqvba8y",
                    "score": 5,
                    "created_utc": 1664811477.0,
                    "replies": []
                },
                {
                    "body": "I looked at your post history, you’re crazy\n\nEvery girl in that other sub is crazy as well. You guys need serious help",
                    "author": "innight41",
                    "id": "iqxzri0",
                    "parent_id": "t1_iqvba8y",
                    "score": 1,
                    "created_utc": 1664836381.0,
                    "replies": [
                        {
                            "body": "She's not crazy :) A bit delusional for sure, but overall seems to be a cute person.",
                            "author": "SeekingInSydney",
                            "id": "iqza95i",
                            "parent_id": "t1_iqxzri0",
                            "score": 1,
                            "created_utc": 1664858987.0,
                            "replies": [
                                {
                                    "body": "Those girls in that sub are literally mental\n\nLike they need serious help",
                                    "author": "innight41",
                                    "id": "iqzd3bt",
                                    "parent_id": "t1_iqza95i",
                                    "score": 1,
                                    "created_utc": 1664860877.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You need to seriously stop trolling, you have issues. It’s called projection and they have therapy for that. \n\nI looked at your post history and realize you are just here to be toxic - You bring no value to this forum. Account from yesterday - shockingly low value",
                            "author": "JSBelle",
                            "id": "ir0mafw",
                            "parent_id": "t1_iqxzri0",
                            "score": 1,
                            "created_utc": 1664892046.0,
                            "replies": [
                                {
                                    "body": "I looked at your profile and you seem to call everyone a troll who doesn’t agree with you. You’re getting out of control for no reason",
                                    "author": "innight41",
                                    "id": "ir0nfor",
                                    "parent_id": "t1_ir0mafw",
                                    "score": 1,
                                    "created_utc": 1664892542.0,
                                    "replies": [
                                        {
                                            "body": "Blockity block.",
                                            "author": "JSBelle",
                                            "id": "ir0nva2",
                                            "parent_id": "t1_ir0nfor",
                                            "score": 2,
                                            "created_utc": 1664892728.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Except he paid her in cash at the end, which you conveniently ignored. Why are you trying to shit on this guy? If he was having temporary bank issues and she still was intimate knowing he wouldn't pay her, would you still think that it's nothing special or worth reciprocating?",
                    "author": "maosaysmiao",
                    "id": "iqvikzo",
                    "parent_id": "t1_iqvba8y",
                    "score": 1,
                    "created_utc": 1664799997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What makes you think she didn’t do/doesn’t do/hasn’t done special things for him?  🤦🏻‍♂️",
            "author": "Chill_SD1974",
            "id": "iqwbjte",
            "parent_id": "t1_iqsle67",
            "score": 2,
            "created_utc": 1664812836.0,
            "replies": []
        },
        {
            "body": "There will always be that one negative Nancy or nitpicker, so here we go! \n\nI’ve been in the sugar bowl on/off for 3 years, so I don’t need the unsolicited lecture. (Reread the first two sentences of the post to understand why I even uploaded it.. it’s to uplift the SB’s who haven’t had any good experiences. & clearly you haven’t been keeping up with the SLF, or you’d see why this post was needed. I’m actually well aware this behavior is “normal”.. Where in my post did I claim it was “above & beyond?” You can’t judge my SD based off one snippet I decided to share.. the bar with him is definitely not low. Or would you rather hear about all the good sex, trips we take, and money he spends? 🙄 moral of the story, SD’s should see us as human and treat us accordingly, but it’s a matter of do they?",
            "author": null,
            "id": "iqvi7ul",
            "parent_id": "t1_iqvautm",
            "score": 4,
            "created_utc": 1664799794.0,
            "replies": []
        },
        {
            "body": "If you're in a sugar relationship yes.",
            "author": "WhisperingPetals",
            "id": "iqvbjnk",
            "parent_id": "t1_iqsskr8",
            "score": 0,
            "created_utc": 1664795728.0,
            "replies": []
        },
        {
            "body": "You mean “accept” not “except” and the SD did provide the usual financial support. Pay tf attention.",
            "author": "Chill_SD1974",
            "id": "irrs3e0",
            "parent_id": "t1_iqw7p38",
            "score": 3,
            "created_utc": 1665415816.0,
            "replies": [
                {
                    "body": "Aww, is someone desperate for some attention today.\n\nAnd actually I meant expect, but thanks for taking the time out of what must be a very full and busy life to attempt to correct a woman's grammar ; )",
                    "author": "Unlikely_Shower_1521",
                    "id": "irt5e6n",
                    "parent_id": "t1_irrs3e0",
                    "score": -2,
                    "created_utc": 1665435761.0,
                    "replies": [
                        {
                            "body": "I didn’t choose to comment because of your misspelling. Happens to all of us. \n\nYou know the gif that shows the words “THE POINT” floating past the stick figure head of someone cluelessly looking up?  Well that’s you. \nBecause my main point was that the OP had a wonderful experience including receiving full financial support and you had to minimize it by saying she got just the bare minimum. \n\nThanks for your concern about my schedule. I had a spare moment to catch up on SLF as today is a federal holiday. Sorry if I took you away from crapping on someone else’s post. \n\nBtw, I didn’t care about or notice your gender. You don’t use a flair and most people don’t put too much thought into designing their Reddit avatar.",
                            "author": "Chill_SD1974",
                            "id": "irtbzaj",
                            "parent_id": "t1_irt5e6n",
                            "score": 2,
                            "created_utc": 1665438604.0,
                            "replies": [
                                {
                                    "body": "Wow, that's an odd takeaway from my comment.\n\nI'm happy OP is happy, however holding up behaviour that is the bare minimum as something unbelievable just works to drive SB's low expectations ever lower.\n\nI hope one day the SD's of reddit will be confident enough in their bona fides that women with high expectations wont be soo scary and rage inducing.\n\nBe better and you won't feel soo threatened in the future.",
                                    "author": "Unlikely_Shower_1521",
                                    "id": "iryd7kb",
                                    "parent_id": "t1_irtbzaj",
                                    "score": 0,
                                    "created_utc": 1665530246.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": " You either lack basic reading comprehension skills, or didn’t read the entire post. I went over to his house for ONE **platonic** hangout while he catered to me. If you don’t enjoy your SD’s company enough for that, that’s sad on YOUR part & you should choose better!  Still got my full ppm & didn’t need to take my clothes off 😏",
            "author": null,
            "id": "iqxuol2",
            "parent_id": "t1_iqxtuot",
            "score": 3,
            "created_utc": 1664834164.0,
            "replies": []
        },
        {
            "body": "This is the only thing you felt was worth commenting? Damn I feel sorry for your SB. 😂 Based off your response I highly doubt she “enjoys” it as much as you think she does. She probably needs the money or feels she has no choice.",
            "author": null,
            "id": "iqspe0m",
            "parent_id": "t1_iqs91yc",
            "score": 9,
            "created_utc": 1664742389.0,
            "replies": [
                {
                    "body": "She requests it, helps relieve her cramps.   \n\n\nTo me, it's the same just add a towel and less position changes.  \n\n\nIt was the only thing I had a question for. I didn't comment on anything.",
                    "author": "NotARussianBot1984",
                    "id": "iqsqdpc",
                    "parent_id": "t1_iqspe0m",
                    "score": -7,
                    "created_utc": 1664742769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Typical tone deaf male. Well, SHE enjoys it so All females must want it 🤡🙄",
            "author": "Zia19",
            "id": "iqsh8h5",
            "parent_id": "t1_iqs91yc",
            "score": 8,
            "created_utc": 1664739421.0,
            "replies": [
                {
                    "body": "Always seems weird when women are called 'females.'   That's for studying fruit flies.",
                    "author": "nerojt",
                    "id": "iqt7rm2",
                    "parent_id": "t1_iqsh8h5",
                    "score": 4,
                    "created_utc": 1664749674.0,
                    "replies": []
                },
                {
                    "body": "You assume all men want period sex. Many don't. Not sure why you jumped to assume it's her boundary.",
                    "author": "NotARussianBot1984",
                    "id": "iqsqiit",
                    "parent_id": "t1_iqsh8h5",
                    "score": 0,
                    "created_utc": 1664742819.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cuz she didn't fucking want it?",
            "author": null,
            "id": "iqsgsdj",
            "parent_id": "t1_iqs91yc",
            "score": 7,
            "created_utc": 1664739260.0,
            "replies": []
        },
        {
            "body": "Not everyone is into it…your SB is not other SBs.",
            "author": "No-Letterhead5328",
            "id": "iqsrthm",
            "parent_id": "t1_iqs91yc",
            "score": 3,
            "created_utc": 1664743312.0,
            "replies": []
        },
        {
            "body": "Some don't like it, I find it kind of gross if it's super heavy",
            "author": "Daddy_Dom_47",
            "id": "iqshesm",
            "parent_id": "t1_iqs91yc",
            "score": 5,
            "created_utc": 1664739486.0,
            "replies": [
                {
                    "body": "I know some men don't, hence why I asked if it was his choice or hers.",
                    "author": "NotARussianBot1984",
                    "id": "iqsqlw2",
                    "parent_id": "t1_iqshesm",
                    "score": -1,
                    "created_utc": 1664742856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This isn’t about you",
            "author": "Toojew4u",
            "id": "iqtdv74",
            "parent_id": "t1_iqs91yc",
            "score": 2,
            "created_utc": 1664752250.0,
            "replies": [
                {
                    "body": "I asked a question, not about myself.",
                    "author": "NotARussianBot1984",
                    "id": "iqttq31",
                    "parent_id": "t1_iqtdv74",
                    "score": 0,
                    "created_utc": 1664759381.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The point is you shouldn't have sex with your SB on every single date. Whether she's ending her cycle or not.",
            "author": "WhisperingPetals",
            "id": "iqvbpc0",
            "parent_id": "t1_iqs91yc",
            "score": 2,
            "created_utc": 1664795836.0,
            "replies": []
        },
        {
            "body": "that's the real story for me as an SD, and exactly why she deserved the gift. She went there to be there for him. That's what both people do in a relationship. This sounds like a good relationship",
            "author": "Fabulous_Storm2437",
            "id": "iqu8t6v",
            "parent_id": "t1_iqsfjeb",
            "score": 8,
            "created_utc": 1664766541.0,
            "replies": [
                {
                    "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
                    "author": "WhisperingPetals",
                    "id": "iqvac7z",
                    "parent_id": "t1_iqu8t6v",
                    "score": 2,
                    "created_utc": 1664794885.0,
                    "replies": []
                },
                {
                    "body": "100%",
                    "author": null,
                    "id": "iqu98eg",
                    "parent_id": "t1_iqu8t6v",
                    "score": 2,
                    "created_utc": 1664766758.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
            "author": "WhisperingPetals",
            "id": "iqvaaw3",
            "parent_id": "t1_iqsfjeb",
            "score": 3,
            "created_utc": 1664794861.0,
            "replies": [
                {
                    "body": "I agree. In fact this is why sugar girls get taken advantage off. The salts are quick to say they don't want an escort but then don't want to give you an allowance without getting intimacy.  If SD ASKED for your attention and YOUR time regardless if your mentrating or not you should most definitely expect in return the ppm allowance.. its literally plain and simple.  They ask and you expect!",
                    "author": "Aromatic_Handle2743",
                    "id": "iqxsow1",
                    "parent_id": "t1_iqvaaw3",
                    "score": 7,
                    "created_utc": 1664833322.0,
                    "replies": []
                },
                {
                    "body": "Call it what you want. But most men will expect something in return if they are giving a ppm/allowance. We all know what that something in return is. And it isn’t a good conversation lol.",
                    "author": null,
                    "id": "iqvar8v",
                    "parent_id": "t1_iqvaaw3",
                    "score": 3,
                    "created_utc": 1664795179.0,
                    "replies": [
                        {
                            "body": "Most MEN???. MOST experienced realSD's should understand that if you're asking for attention From  WOMAN then you should most definitely do your part and give her the value she's Wortham any given time. If you just want to give for intimacy then hop on to a site that you can pay for that on... PERIOD!",
                            "author": "Aromatic_Handle2743",
                            "id": "iqxt4ox",
                            "parent_id": "t1_iqvar8v",
                            "score": 4,
                            "created_utc": 1664833506.0,
                            "replies": [
                                {
                                    "body": "So it’s just a one sided thing. You get all the benefit and not us? Your time is more valuable than ours? No thanks!",
                                    "author": null,
                                    "id": "iqxtb46",
                                    "parent_id": "t1_iqxt4ox",
                                    "score": 2,
                                    "created_utc": 1664833581.0,
                                    "replies": [
                                        {
                                            "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
                                            "author": "Aromatic_Handle2743",
                                            "id": "iqxu8a8",
                                            "parent_id": "t1_iqxtb46",
                                            "score": 4,
                                            "created_utc": 1664833971.0,
                                            "replies": [
                                                {
                                                    "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                                                    "author": null,
                                                    "id": "iqxy1hx",
                                                    "parent_id": "t1_iqxu8a8",
                                                    "score": 1,
                                                    "created_utc": 1664835615.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She likes him. Simple.",
            "author": "261chameleons",
            "id": "ir0s5p4",
            "parent_id": "t1_iqsfjeb",
            "score": 5,
            "created_utc": 1664894497.0,
            "replies": []
        },
        {
            "body": "THIS RIGHT HERE.\nIf you knew what some of these women have been through, with fakers, scams, salt/Splenda Daddies, you'd understand why a lot of women develop that thought process.\n\nI'll prove myself to my POT SD, just as I expect the same, but I don't expect you to have \"endless faith\" in me, before we even hit the M&G stage.",
            "author": "JustAsk4Alice",
            "id": "iqtmmgv",
            "parent_id": "t1_iqs63s7",
            "score": 10,
            "created_utc": 1664756144.0,
            "replies": []
        },
        {
            "body": "👏 👏 👏",
            "author": null,
            "id": "iqsgq7r",
            "parent_id": "t1_iqs96vo",
            "score": 5,
            "created_utc": 1664739238.0,
            "replies": []
        },
        {
            "body": "That’s sad hopefully is good SD’s can turn that around",
            "author": "Alive-Worldliness-27",
            "id": "iqs9lu0",
            "parent_id": "t1_iqs96vo",
            "score": 2,
            "created_utc": 1664736658.0,
            "replies": [
                {
                    "body": "We're outnumbered a hundred to one by predators",
                    "author": "Daddy_Dom_47",
                    "id": "iqshbc1",
                    "parent_id": "t1_iqs9lu0",
                    "score": 7,
                    "created_utc": 1664739450.0,
                    "replies": []
                },
                {
                    "body": "I hope to try!  But it’s an uphill battle.",
                    "author": "JDMultralight",
                    "id": "iqtms51",
                    "parent_id": "t1_iqs9lu0",
                    "score": 4,
                    "created_utc": 1664756216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately, there will always be 1 secret hater in the group that’s never happy for you. Clearly it’s @WhisperingPetals 😏",
            "author": null,
            "id": "iqvjg3o",
            "parent_id": "t1_iqsmde6",
            "score": 3,
            "created_utc": 1664800480.0,
            "replies": []
        },
        {
            "body": "This.  It's a relationship right.  She gave him the gift of her time and energy.",
            "author": "Unlikely_Shower_1521",
            "id": "iqw84d4",
            "parent_id": "t1_iqvba8y",
            "score": 5,
            "created_utc": 1664811477.0,
            "replies": []
        },
        {
            "body": "I looked at your post history, you’re crazy\n\nEvery girl in that other sub is crazy as well. You guys need serious help",
            "author": "innight41",
            "id": "iqxzri0",
            "parent_id": "t1_iqvba8y",
            "score": 1,
            "created_utc": 1664836381.0,
            "replies": [
                {
                    "body": "She's not crazy :) A bit delusional for sure, but overall seems to be a cute person.",
                    "author": "SeekingInSydney",
                    "id": "iqza95i",
                    "parent_id": "t1_iqxzri0",
                    "score": 1,
                    "created_utc": 1664858987.0,
                    "replies": [
                        {
                            "body": "Those girls in that sub are literally mental\n\nLike they need serious help",
                            "author": "innight41",
                            "id": "iqzd3bt",
                            "parent_id": "t1_iqza95i",
                            "score": 1,
                            "created_utc": 1664860877.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You need to seriously stop trolling, you have issues. It’s called projection and they have therapy for that. \n\nI looked at your post history and realize you are just here to be toxic - You bring no value to this forum. Account from yesterday - shockingly low value",
                    "author": "JSBelle",
                    "id": "ir0mafw",
                    "parent_id": "t1_iqxzri0",
                    "score": 1,
                    "created_utc": 1664892046.0,
                    "replies": [
                        {
                            "body": "I looked at your profile and you seem to call everyone a troll who doesn’t agree with you. You’re getting out of control for no reason",
                            "author": "innight41",
                            "id": "ir0nfor",
                            "parent_id": "t1_ir0mafw",
                            "score": 1,
                            "created_utc": 1664892542.0,
                            "replies": [
                                {
                                    "body": "Blockity block.",
                                    "author": "JSBelle",
                                    "id": "ir0nva2",
                                    "parent_id": "t1_ir0nfor",
                                    "score": 2,
                                    "created_utc": 1664892728.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Except he paid her in cash at the end, which you conveniently ignored. Why are you trying to shit on this guy? If he was having temporary bank issues and she still was intimate knowing he wouldn't pay her, would you still think that it's nothing special or worth reciprocating?",
            "author": "maosaysmiao",
            "id": "iqvikzo",
            "parent_id": "t1_iqvba8y",
            "score": 1,
            "created_utc": 1664799997.0,
            "replies": []
        },
        {
            "body": "Aww, is someone desperate for some attention today.\n\nAnd actually I meant expect, but thanks for taking the time out of what must be a very full and busy life to attempt to correct a woman's grammar ; )",
            "author": "Unlikely_Shower_1521",
            "id": "irt5e6n",
            "parent_id": "t1_irrs3e0",
            "score": -2,
            "created_utc": 1665435761.0,
            "replies": [
                {
                    "body": "I didn’t choose to comment because of your misspelling. Happens to all of us. \n\nYou know the gif that shows the words “THE POINT” floating past the stick figure head of someone cluelessly looking up?  Well that’s you. \nBecause my main point was that the OP had a wonderful experience including receiving full financial support and you had to minimize it by saying she got just the bare minimum. \n\nThanks for your concern about my schedule. I had a spare moment to catch up on SLF as today is a federal holiday. Sorry if I took you away from crapping on someone else’s post. \n\nBtw, I didn’t care about or notice your gender. You don’t use a flair and most people don’t put too much thought into designing their Reddit avatar.",
                    "author": "Chill_SD1974",
                    "id": "irtbzaj",
                    "parent_id": "t1_irt5e6n",
                    "score": 2,
                    "created_utc": 1665438604.0,
                    "replies": [
                        {
                            "body": "Wow, that's an odd takeaway from my comment.\n\nI'm happy OP is happy, however holding up behaviour that is the bare minimum as something unbelievable just works to drive SB's low expectations ever lower.\n\nI hope one day the SD's of reddit will be confident enough in their bona fides that women with high expectations wont be soo scary and rage inducing.\n\nBe better and you won't feel soo threatened in the future.",
                            "author": "Unlikely_Shower_1521",
                            "id": "iryd7kb",
                            "parent_id": "t1_irtbzaj",
                            "score": 0,
                            "created_utc": 1665530246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She requests it, helps relieve her cramps.   \n\n\nTo me, it's the same just add a towel and less position changes.  \n\n\nIt was the only thing I had a question for. I didn't comment on anything.",
            "author": "NotARussianBot1984",
            "id": "iqsqdpc",
            "parent_id": "t1_iqspe0m",
            "score": -7,
            "created_utc": 1664742769.0,
            "replies": []
        },
        {
            "body": "Always seems weird when women are called 'females.'   That's for studying fruit flies.",
            "author": "nerojt",
            "id": "iqt7rm2",
            "parent_id": "t1_iqsh8h5",
            "score": 4,
            "created_utc": 1664749674.0,
            "replies": []
        },
        {
            "body": "You assume all men want period sex. Many don't. Not sure why you jumped to assume it's her boundary.",
            "author": "NotARussianBot1984",
            "id": "iqsqiit",
            "parent_id": "t1_iqsh8h5",
            "score": 0,
            "created_utc": 1664742819.0,
            "replies": []
        },
        {
            "body": "I know some men don't, hence why I asked if it was his choice or hers.",
            "author": "NotARussianBot1984",
            "id": "iqsqlw2",
            "parent_id": "t1_iqshesm",
            "score": -1,
            "created_utc": 1664742856.0,
            "replies": []
        },
        {
            "body": "I asked a question, not about myself.",
            "author": "NotARussianBot1984",
            "id": "iqttq31",
            "parent_id": "t1_iqtdv74",
            "score": 0,
            "created_utc": 1664759381.0,
            "replies": []
        },
        {
            "body": "No girl should expect money in exchange for sex. That's escorting. \n\nA girl in a sugar relationship should def know she doesn't only get money when she has sex with a guy.",
            "author": "WhisperingPetals",
            "id": "iqvac7z",
            "parent_id": "t1_iqu8t6v",
            "score": 2,
            "created_utc": 1664794885.0,
            "replies": []
        },
        {
            "body": "100%",
            "author": null,
            "id": "iqu98eg",
            "parent_id": "t1_iqu8t6v",
            "score": 2,
            "created_utc": 1664766758.0,
            "replies": []
        },
        {
            "body": "I agree. In fact this is why sugar girls get taken advantage off. The salts are quick to say they don't want an escort but then don't want to give you an allowance without getting intimacy.  If SD ASKED for your attention and YOUR time regardless if your mentrating or not you should most definitely expect in return the ppm allowance.. its literally plain and simple.  They ask and you expect!",
            "author": "Aromatic_Handle2743",
            "id": "iqxsow1",
            "parent_id": "t1_iqvaaw3",
            "score": 7,
            "created_utc": 1664833322.0,
            "replies": []
        },
        {
            "body": "Call it what you want. But most men will expect something in return if they are giving a ppm/allowance. We all know what that something in return is. And it isn’t a good conversation lol.",
            "author": null,
            "id": "iqvar8v",
            "parent_id": "t1_iqvaaw3",
            "score": 3,
            "created_utc": 1664795179.0,
            "replies": [
                {
                    "body": "Most MEN???. MOST experienced realSD's should understand that if you're asking for attention From  WOMAN then you should most definitely do your part and give her the value she's Wortham any given time. If you just want to give for intimacy then hop on to a site that you can pay for that on... PERIOD!",
                    "author": "Aromatic_Handle2743",
                    "id": "iqxt4ox",
                    "parent_id": "t1_iqvar8v",
                    "score": 4,
                    "created_utc": 1664833506.0,
                    "replies": [
                        {
                            "body": "So it’s just a one sided thing. You get all the benefit and not us? Your time is more valuable than ours? No thanks!",
                            "author": null,
                            "id": "iqxtb46",
                            "parent_id": "t1_iqxt4ox",
                            "score": 2,
                            "created_utc": 1664833581.0,
                            "replies": [
                                {
                                    "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
                                    "author": "Aromatic_Handle2743",
                                    "id": "iqxu8a8",
                                    "parent_id": "t1_iqxtb46",
                                    "score": 4,
                                    "created_utc": 1664833971.0,
                                    "replies": [
                                        {
                                            "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                                            "author": null,
                                            "id": "iqxy1hx",
                                            "parent_id": "t1_iqxu8a8",
                                            "score": 1,
                                            "created_utc": 1664835615.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We're outnumbered a hundred to one by predators",
            "author": "Daddy_Dom_47",
            "id": "iqshbc1",
            "parent_id": "t1_iqs9lu0",
            "score": 7,
            "created_utc": 1664739450.0,
            "replies": []
        },
        {
            "body": "I hope to try!  But it’s an uphill battle.",
            "author": "JDMultralight",
            "id": "iqtms51",
            "parent_id": "t1_iqs9lu0",
            "score": 4,
            "created_utc": 1664756216.0,
            "replies": []
        },
        {
            "body": "She's not crazy :) A bit delusional for sure, but overall seems to be a cute person.",
            "author": "SeekingInSydney",
            "id": "iqza95i",
            "parent_id": "t1_iqxzri0",
            "score": 1,
            "created_utc": 1664858987.0,
            "replies": [
                {
                    "body": "Those girls in that sub are literally mental\n\nLike they need serious help",
                    "author": "innight41",
                    "id": "iqzd3bt",
                    "parent_id": "t1_iqza95i",
                    "score": 1,
                    "created_utc": 1664860877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You need to seriously stop trolling, you have issues. It’s called projection and they have therapy for that. \n\nI looked at your post history and realize you are just here to be toxic - You bring no value to this forum. Account from yesterday - shockingly low value",
            "author": "JSBelle",
            "id": "ir0mafw",
            "parent_id": "t1_iqxzri0",
            "score": 1,
            "created_utc": 1664892046.0,
            "replies": [
                {
                    "body": "I looked at your profile and you seem to call everyone a troll who doesn’t agree with you. You’re getting out of control for no reason",
                    "author": "innight41",
                    "id": "ir0nfor",
                    "parent_id": "t1_ir0mafw",
                    "score": 1,
                    "created_utc": 1664892542.0,
                    "replies": [
                        {
                            "body": "Blockity block.",
                            "author": "JSBelle",
                            "id": "ir0nva2",
                            "parent_id": "t1_ir0nfor",
                            "score": 2,
                            "created_utc": 1664892728.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn’t choose to comment because of your misspelling. Happens to all of us. \n\nYou know the gif that shows the words “THE POINT” floating past the stick figure head of someone cluelessly looking up?  Well that’s you. \nBecause my main point was that the OP had a wonderful experience including receiving full financial support and you had to minimize it by saying she got just the bare minimum. \n\nThanks for your concern about my schedule. I had a spare moment to catch up on SLF as today is a federal holiday. Sorry if I took you away from crapping on someone else’s post. \n\nBtw, I didn’t care about or notice your gender. You don’t use a flair and most people don’t put too much thought into designing their Reddit avatar.",
            "author": "Chill_SD1974",
            "id": "irtbzaj",
            "parent_id": "t1_irt5e6n",
            "score": 2,
            "created_utc": 1665438604.0,
            "replies": [
                {
                    "body": "Wow, that's an odd takeaway from my comment.\n\nI'm happy OP is happy, however holding up behaviour that is the bare minimum as something unbelievable just works to drive SB's low expectations ever lower.\n\nI hope one day the SD's of reddit will be confident enough in their bona fides that women with high expectations wont be soo scary and rage inducing.\n\nBe better and you won't feel soo threatened in the future.",
                    "author": "Unlikely_Shower_1521",
                    "id": "iryd7kb",
                    "parent_id": "t1_irtbzaj",
                    "score": 0,
                    "created_utc": 1665530246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most MEN???. MOST experienced realSD's should understand that if you're asking for attention From  WOMAN then you should most definitely do your part and give her the value she's Wortham any given time. If you just want to give for intimacy then hop on to a site that you can pay for that on... PERIOD!",
            "author": "Aromatic_Handle2743",
            "id": "iqxt4ox",
            "parent_id": "t1_iqvar8v",
            "score": 4,
            "created_utc": 1664833506.0,
            "replies": [
                {
                    "body": "So it’s just a one sided thing. You get all the benefit and not us? Your time is more valuable than ours? No thanks!",
                    "author": null,
                    "id": "iqxtb46",
                    "parent_id": "t1_iqxt4ox",
                    "score": 2,
                    "created_utc": 1664833581.0,
                    "replies": [
                        {
                            "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
                            "author": "Aromatic_Handle2743",
                            "id": "iqxu8a8",
                            "parent_id": "t1_iqxtb46",
                            "score": 4,
                            "created_utc": 1664833971.0,
                            "replies": [
                                {
                                    "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                                    "author": null,
                                    "id": "iqxy1hx",
                                    "parent_id": "t1_iqxu8a8",
                                    "score": 1,
                                    "created_utc": 1664835615.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those girls in that sub are literally mental\n\nLike they need serious help",
            "author": "innight41",
            "id": "iqzd3bt",
            "parent_id": "t1_iqza95i",
            "score": 1,
            "created_utc": 1664860877.0,
            "replies": []
        },
        {
            "body": "I looked at your profile and you seem to call everyone a troll who doesn’t agree with you. You’re getting out of control for no reason",
            "author": "innight41",
            "id": "ir0nfor",
            "parent_id": "t1_ir0mafw",
            "score": 1,
            "created_utc": 1664892542.0,
            "replies": [
                {
                    "body": "Blockity block.",
                    "author": "JSBelle",
                    "id": "ir0nva2",
                    "parent_id": "t1_ir0nfor",
                    "score": 2,
                    "created_utc": 1664892728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, that's an odd takeaway from my comment.\n\nI'm happy OP is happy, however holding up behaviour that is the bare minimum as something unbelievable just works to drive SB's low expectations ever lower.\n\nI hope one day the SD's of reddit will be confident enough in their bona fides that women with high expectations wont be soo scary and rage inducing.\n\nBe better and you won't feel soo threatened in the future.",
            "author": "Unlikely_Shower_1521",
            "id": "iryd7kb",
            "parent_id": "t1_irtbzaj",
            "score": 0,
            "created_utc": 1665530246.0,
            "replies": []
        },
        {
            "body": "So it’s just a one sided thing. You get all the benefit and not us? Your time is more valuable than ours? No thanks!",
            "author": null,
            "id": "iqxtb46",
            "parent_id": "t1_iqxt4ox",
            "score": 2,
            "created_utc": 1664833581.0,
            "replies": [
                {
                    "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
                    "author": "Aromatic_Handle2743",
                    "id": "iqxu8a8",
                    "parent_id": "t1_iqxtb46",
                    "score": 4,
                    "created_utc": 1664833971.0,
                    "replies": [
                        {
                            "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                            "author": null,
                            "id": "iqxy1hx",
                            "parent_id": "t1_iqxu8a8",
                            "score": 1,
                            "created_utc": 1664835615.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Blockity block.",
            "author": "JSBelle",
            "id": "ir0nva2",
            "parent_id": "t1_ir0nfor",
            "score": 2,
            "created_utc": 1664892728.0,
            "replies": []
        },
        {
            "body": "If you're reaching out for attention then as an SD be ready to suit up for what your swimming in this bowel for. You want compassion and companionship we deliver ... so then you deliver. C'mon you know that! You're not on tinder looking for a needle in any stack. You should definitely understand what you're doing In here ...",
            "author": "Aromatic_Handle2743",
            "id": "iqxu8a8",
            "parent_id": "t1_iqxtb46",
            "score": 4,
            "created_utc": 1664833971.0,
            "replies": [
                {
                    "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
                    "author": null,
                    "id": "iqxy1hx",
                    "parent_id": "t1_iqxu8a8",
                    "score": 1,
                    "created_utc": 1664835615.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Umm I’ve been sugar dating successfully for years and have had tons of arrangements. Im not looking for advice lol. Never once have I paid ppm for a M&G or been asked to by a POT SB. \n\nIm not paying for companionship, nor do I need to :)",
            "author": null,
            "id": "iqxy1hx",
            "parent_id": "t1_iqxu8a8",
            "score": 1,
            "created_utc": 1664835615.0,
            "replies": []
        }
    ]
}