{
    "title": "Why SBs shouldn't accept allowance at the end of the month",
    "post_id": "qun982",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/qun982/why_sbs_shouldnt_accept_allowance_at_the_end_of/",
    "author": null,
    "body": "Trying again without short links:\n\nThere was [a post from an SD recently](https://www.reddit.com/r/sugarlifestyleforum/comments/qoja68/why_is_allowance_always_prepaid/?utm_source=share&amp;utm_medium=web2x&amp;context=3) about why SDs should just offer allowances at the end of the month, because you know, that's how jobs pay their employees. A lively debate ensued. Many pointed out that doing this places a \\*lot\\* of risk on the SB of seeing a man for a month, having sex with them, literally giving him her body, and then potentially never getting whatever financial component was agreed to at the onset of the SR/arrangement.\n\n[This post is a reflection of exactly why SBs should never accept that](https://www.reddit.com/r/PurplePillDebate/comments/pzix9g/im_a_salt_daddy_ama/?utm_source=share&amp;utm_medium=web2x&amp;context=3). This post shows that there truly are absolute shitbird \"SD\"s out there who maliciously set out take advantage of SBs with no intention of ever supporting them. The OP in that post explicitly says that he makes arrangements with women saying he will provide allowance at the end of the month, has sex with them, [then ghosts at the end of the month](https://imgur.com/gRQDoRV) without providing said allowance. He doesn't even do dinners. (Screenshots in that last link, for when the douche canoe OP inevitably deletes his post.)\n\nThis, my dear SDs, is why you should be providing an allowance upfront, at the beginning of the month, if you are on an allowance with your SB. This is also why you should provide PPM upfront, at the beginning of the date, if you are on a PPM basis. It feels just as shitty for a woman to have this happen to her a single time as it does to have it happen for a month. Don't put this kind of risk on your SB. Yes, that poster is a special kind of douche canoe, but there are many like him in the bowl posing as SDs to take advantage of SBs. I would guess a large portion of the women here have come across these men. **Please, be a decent human being**, and consider how this feels for us. I promise, it's a lot worse than you losing a few Benjamins here and there.\n\nSBs: Please, please don't accept post-paid allowance offers from POTs or SDs.\n\nEdit: Because y’all are focusing on simply sticking with PPM and not doing any allowance—as I said, **if** you are on allowance, please make it a beginning of the month (or week) allowance. If you are on PPM, please provide it at the start of the date. I have nothing against anyone wanting to do PPMs, and I agree that it can help protect all parties involved *until trust is built.*\n\n**PPM vs allowance is NOT the point of this post.**",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/qun982/why_sbs_shouldnt_accept_allowance_at_the_end_of/",
    "score": 162,
    "upvote_ratio": 0.91,
    "created_utc": 1637001759.0,
    "num_comments": 63,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/qoja68/why_is_allowance_always_prepaid/?utm_source=share&utm_medium=web2x&context=3",
            "https://www.reddit.com/r/PurplePillDebate/comments/pzix9g/im_a_salt_daddy_ama/?utm_source=share&utm_medium=web2x&context=3",
            "https://imgur.com/gRQDoRV"
        ]
    ],
    "comments": [
        {
            "body": "Jesus Christ, there are some evil people in the world",
            "author": "robhudsondfw",
            "id": "hkrfd0z",
            "parent_id": "t3_qun982",
            "score": 40,
            "created_utc": 1637007084.0,
            "replies": []
        },
        {
            "body": "Assertions that SB's  \"just like employees\" are BS for so many different reasons a) employees are protected by aggressive enforcement by state labor boards when there is a failure to compensate and such,  b) Just as the gentleman opens the door for the woman,  waits for her to commence eating,  the gentleman SD removes doubts by taking care of the finances.   You no longer board an airplane without your boarding pass.",
            "author": "pinotandsugar",
            "id": "hkrc2h7",
            "parent_id": "t3_qun982",
            "score": 60,
            "created_utc": 1637005784.0,
            "replies": [
                {
                    "body": "👏🏼👏🏼👏🏼👏🏼👏🏼",
                    "author": "ExExpectations",
                    "id": "hkrfypq",
                    "parent_id": "t1_hkrc2h7",
                    "score": 4,
                    "created_utc": 1637007326.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you're worried about it, just do PPM. Simple.",
            "author": "KPackCorey",
            "id": "hkr6bt4",
            "parent_id": "t3_qun982",
            "score": 20,
            "created_utc": 1637003516.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkr8jii",
                    "parent_id": "t1_hkr6bt4",
                    "score": 28,
                    "created_utc": 1637004396.0,
                    "replies": [
                        {
                            "body": "I personally provide after and have never had it be an issue. \n\nBut I'm curious, why would a bad actor SD who you are worried about hurting you if you insisted on PPM after the meet not be a threat to you after he's paid upfront and just take the PPM back after making you feel comfortable and getting what he wanted from you? Only in that case the physical altercation is almost guaranteed since the PPM is physically in your possession. \n\nWhereas a bad actor SB is generally going to be completely deterred if they don't get the money up front as we're a sexually dimorphic species. Unless she's escalating to armed robbery or they're outliers. \n\nLike we're dealing with a piece of shit dude here. He's trying to scam you. Why would he draw the line at scamming? Clearly he's already comfortable with a serious conflict at the meet as he's going to tell you he can't pay you after you've already had the meet and expects you won't just be cool with it. So why not soft extortion? Stand in front of the door and say he actually really needs that money for his mom's medication they only take cash at her pharmacy. But he'll send the money to you on (insert app). What are you gonna do? Physically assault him? Call him the cops? If you're willing to escalate like that then what's stopping you from escalating if he refuses PPM after just the same?",
                            "author": "KPackCorey",
                            "id": "hkrcbfh",
                            "parent_id": "t1_hkr8jii",
                            "score": -11,
                            "created_utc": 1637005883.0,
                            "replies": [
                                {
                                    "body": ">*I personally provide after and have never had it be an issue.*\n\nWhy not take away eventual disturbing thoughts off a woman you want to have passionate and enthusiastic sex with?\n\nWhat do you win by taking the risk she will be worrying through the whole intimate time?\n\nWhy make us having to ask for it upfront and make us feel like prostitutes?\n\nWhy let it even *become* an issue?\n\nDo you really lack the empathy to imagine why most women hate to ask? And it *NOT* being an issue maybe only plays in *YOUR* mind?\n\nWhy not let her feel taken care of and relax?!\n\nIs it really so hard to buy a nice card, write her name on it, and put it on the nightstand or in her purse before the clothes come off, and take away the slightest chance on it even *being* an issue for her?\n\n*> Stand in front of the door and say he actually really needs that money* \n\nAnd yes, there is always the risk he takes it back with force, but most scammers are cowards and telling someone that you didn't had time to go to an ATM but will cash app later requires a whole different (and more common) kind of 'courage' than robbing someone with force.",
                                    "author": "A-touchofreality",
                                    "id": "hkrhbaa",
                                    "parent_id": "t1_hkrcbfh",
                                    "score": 38,
                                    "created_utc": 1637007855.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hkrdmlj",
                                    "parent_id": "t1_hkrcbfh",
                                    "score": 20,
                                    "created_utc": 1637006398.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I learned this the hard way early on. Luckily, it only took 2 SDs to teach me that it wasn't a unique thing. They need skin in the game as much as I do.",
            "author": "LadyMorgan2018",
            "id": "hkri1ez",
            "parent_id": "t3_qun982",
            "score": 12,
            "created_utc": 1637008133.0,
            "replies": []
        },
        {
            "body": "Agreed.\n\n>Please, be a decent human being, and consider how this feels for us. I promise, it's a lot worse than you losing a few Benjamins here and there.\n\nI've posted before about how an SD (by definition) can afford to 'lose' the allowance/gift/PPM. As a result, it is always less of a risk for an SD to provide the benefits first. Yes, it sucks to get rinsed, but the impact is inherently less than a PnD for an SB.",
            "author": "sfwinefan",
            "id": "hkr3v94",
            "parent_id": "t3_qun982",
            "score": 58,
            "created_utc": 1637002537.0,
            "replies": [
                {
                    "body": "Ripping either the SD or SB off its totally not ok. You shouldn’t even be suggesting that.",
                    "author": "401kisfun",
                    "id": "hkrfgvl",
                    "parent_id": "t1_hkr3v94",
                    "score": -14,
                    "created_utc": 1637007128.0,
                    "replies": [
                        {
                            "body": "Well good thing that's not what they said, then.",
                            "author": "oneangstybiscuit",
                            "id": "hkrgtrs",
                            "parent_id": "t1_hkrfgvl",
                            "score": 38,
                            "created_utc": 1637007670.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Everyone always thinks money stops mattering at some point and/or it never stops feeling shitty to get ripped off.I once quit ordering takeout from a favorite restaurant because they charged me 50¢ for a \"to-go charge\" without telling me that was the new policy. I don't want to be ripped off any more than you do.",
                    "author": "This_is_Not_My_Handl",
                    "id": "hkr6csv",
                    "parent_id": "t1_hkr3v94",
                    "score": -22,
                    "created_utc": 1637003526.0,
                    "replies": [
                        {
                            "body": "HUGE RED FLAG 🚩🚩🚩🚩",
                            "author": "LibrarianWonderful52",
                            "id": "hkr7utk",
                            "parent_id": "t1_hkr6csv",
                            "score": 25,
                            "created_utc": 1637004122.0,
                            "replies": [
                                {
                                    "body": "Yes. Huge red flag that I don't want to get ripped off any more than an SB wants to get ripped off. Equality be like that sometimes.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "hkr8kx5",
                                    "parent_id": "t1_hkr7utk",
                                    "score": -2,
                                    "created_utc": 1637004412.0,
                                    "replies": [
                                        {
                                            "body": " it seems like youre not understanding if the fundamental difference between you as an SD getting \"ripped off\" and an SB getting \"ripped off\".\n\nSD: potentially loses a little bit of money that should not burn a hole in their pocket. its annoying\n\nSB: gets taken advantage of after putting herself at risk for being assaulted or violated, her body used and disregarded after being put in a vulnerable position.\n\nThis lack of empathy is very concerning. If youre sensitive about your money to the point youre not willing to take a small risk upon understanding this power disparity, you absolutely should not be sugaring",
                                            "author": "c0rnstarr",
                                            "id": "hkracvh",
                                            "parent_id": "t1_hkr8kx5",
                                            "score": 41,
                                            "created_utc": 1637005119.0,
                                            "replies": [
                                                {
                                                    "body": "\\^\\^ This. If you're dating a scammer, one party or the other is going to lose out on the $ if the other side doesn't hold up their end of the bargain. But, on top of that, she has so much more to lose. To put it bluntly, I'd rather be a victim of a straight up robbery (in fact I have, and yes it sucks) than be robbed *and* raped.",
                                                    "author": "roscoe7585",
                                                    "id": "hkrg3rb",
                                                    "parent_id": "t1_hkracvh",
                                                    "score": 33,
                                                    "created_utc": 1637007383.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "hkrby3o",
                                                    "parent_id": "t1_hkracvh",
                                                    "score": 15,
                                                    "created_utc": 1637005737.0,
                                                    "replies": [
                                                        {
                                                            "body": "And he used to be a mod here. \n\nSMDH.",
                                                            "author": "ExExpectations",
                                                            "id": "hkrfrj8",
                                                            "parent_id": "t1_hkrby3o",
                                                            "score": 11,
                                                            "created_utc": 1637007245.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hkr73ki",
                            "parent_id": "t1_hkr6csv",
                            "score": 44,
                            "created_utc": 1637003824.0,
                            "replies": [
                                {
                                    "body": "He (used to be) a mod on this subreddit. THAT in itself would take a whole day to unpack…",
                                    "author": "ExExpectations",
                                    "id": "hkrfmwm",
                                    "parent_id": "t1_hkr73ki",
                                    "score": 23,
                                    "created_utc": 1637007195.0,
                                    "replies": []
                                },
                                {
                                    "body": "What, exactly, do you think it says? People always like to drop the \"says a lot about you\" language. Don't be a pansy. Say it.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "hkr7h5b",
                                    "parent_id": "t1_hkr73ki",
                                    "score": -14,
                                    "created_utc": 1637003974.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hkr7wiy",
                                            "parent_id": "t1_hkr7h5b",
                                            "score": 44,
                                            "created_utc": 1637004141.0,
                                            "replies": [
                                                {
                                                    "body": "Huh, I would have just said that he's a \"rhymes with lass\"",
                                                    "author": "ChapterRelative",
                                                    "id": "hkr9xg8",
                                                    "parent_id": "t1_hkr7wiy",
                                                    "score": 14,
                                                    "created_utc": 1637004951.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Oh. That's all? I can live with that.",
                                                    "author": "This_is_Not_My_Handl",
                                                    "id": "hkr8ebk",
                                                    "parent_id": "t1_hkr7wiy",
                                                    "score": -18,
                                                    "created_utc": 1637004339.0,
                                                    "replies": [
                                                        {
                                                            "body": "And this guy used to be a mod!!",
                                                            "author": null,
                                                            "id": "hkr9u2w",
                                                            "parent_id": "t1_hkr8ebk",
                                                            "score": 17,
                                                            "created_utc": 1637004915.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "🚩🚩🚩🚩🚩🚩🚩🚩",
                                            "author": "Affectionate_Bus_171",
                                            "id": "hkr8txz",
                                            "parent_id": "t1_hkr7h5b",
                                            "score": 19,
                                            "created_utc": 1637004512.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I do believe that I said it sucks to get rinsed - because it matters.\n\nJust on balance, the impact is materially less than an SB getting PnD'd.",
                            "author": "sfwinefan",
                            "id": "hkrctrm",
                            "parent_id": "t1_hkr6csv",
                            "score": 16,
                            "created_utc": 1637006081.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Paying afterwards is the ultimate arrogance on the part of a SD. If you are worried about a SB scammer do PPM at first or increase the intervals until trust is earned. why should a SB who is financially vulnerable take 1005 of the risk of non payment?",
            "author": "GSSD",
            "id": "hkr3p1i",
            "parent_id": "t3_qun982",
            "score": 32,
            "created_utc": 1637002469.0,
            "replies": []
        },
        {
            "body": "People think being rinsed for money they supposedly can afford to part with is worse than being misled into an intimate situation and having your body used by someone who had no intentions of being real with you. Or rather, they know it's not the same but they don't respect the sb enough to give her that reassurance she's not being lied to. \n\nMaybe SBs should withhold intimacy until the end of the month too.",
            "author": "oneangstybiscuit",
            "id": "hkria0a",
            "parent_id": "t3_qun982",
            "score": 21,
            "created_utc": 1637008226.0,
            "replies": []
        },
        {
            "body": "Not just monthly allowances, this is why you never get your PPM after either! Nothing worse than holding up your end of the bargain and walking out of there with nada! And nothing you can do about it either!\n\nIf y’all afraid to ask for your PPM before you have sex you shouldn’t even be having these type of relationships — because this is the risk you run when you put your faith into him making right on his promise. Nope.",
            "author": "Zealousideal_Lion472",
            "id": "hkr44bd",
            "parent_id": "t3_qun982",
            "score": 26,
            "created_utc": 1637002638.0,
            "replies": []
        },
        {
            "body": "Is it so hard to follow the rules?\n\nALWAYS PPM\n\nALWAYS CASH\n\nCan we make this a sticky?  \n\n\nps. the \"salty daddy\" from one of the links may qualify as rapist, depending on jurisdiction. just FYI.",
            "author": "JeaneyBowl",
            "id": "hkra839",
            "parent_id": "t3_qun982",
            "score": 26,
            "created_utc": 1637005067.0,
            "replies": [
                {
                    "body": "Agreed.  I’ll occasionally do cashapp and Venmo with long established arrangements but it’s send when they are here.",
                    "author": "LotBuilder",
                    "id": "hkred2c",
                    "parent_id": "t1_hkra839",
                    "score": 8,
                    "created_utc": 1637006688.0,
                    "replies": []
                },
                {
                    "body": "Eh, I hate cash because my bank doesn’t allow cash deposits so I have to find a CVS or 7-11 and go and make a Cashapp deposit and be charged all the fees and stuff. It’s easier to just Venmo me the money.\n\nI will say though, that one of my current SDs pays me when he gets home, has since we started. There was one time where he wasn’t going home, but rather going on a business trip, and I didn’t get the money by the next morning. I mentioned it to him and gave him the benefit of the doubt and said it might’ve been the storm having spotty internet connection. He tried to do it while driving and it didn’t go through, and not even two minutes later I got the Venmo notification. \n\nDo whatever works for you, but honestly cash is annoying to a lot of people. It turns me off just a bit if I know the guy is only going to be using cash rather than money I can actually just transfer into my account.",
                    "author": null,
                    "id": "hkrhwe3",
                    "parent_id": "t1_hkra839",
                    "score": 1,
                    "created_utc": 1637008078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1000% agree!!!",
            "author": "thereadinessisall",
            "id": "hkr2gqy",
            "parent_id": "t3_qun982",
            "score": 11,
            "created_utc": 1637001983.0,
            "replies": []
        },
        {
            "body": "Truly amazing that all of these dudes with piss-poor reading comprehension have somehow been financially successful enough to become SDs.",
            "author": "coelacanthsgrandkid",
            "id": "hkrjxjz",
            "parent_id": "t3_qun982",
            "score": 17,
            "created_utc": 1637008878.0,
            "replies": []
        },
        {
            "body": "I’m not necessarily arguing, but both SBs and SDs can be shitty people.   I recently had an SB hit me up for the following month’s allowance 2 weeks early, only to ghost me while starting to see other SDs.",
            "author": "SLF_SD",
            "id": "hkra5we",
            "parent_id": "t3_qun982",
            "score": 3,
            "created_utc": 1637005044.0,
            "replies": []
        },
        {
            "body": "How about annual allowance at the end of the year? Should we start another post series on that?",
            "author": "Intelligent_Bid_1429",
            "id": "hkr7c7d",
            "parent_id": "t3_qun982",
            "score": 4,
            "created_utc": 1637003920.0,
            "replies": []
        },
        {
            "body": "This 👍🏽👍🏽",
            "author": null,
            "id": "hkr6kt4",
            "parent_id": "t3_qun982",
            "score": 2,
            "created_utc": 1637003615.0,
            "replies": []
        },
        {
            "body": "Allowance provides an imbalance for whoever has the money in hand.  PPM is the fairest and most efficient way to run an arrangement.",
            "author": "LotBuilder",
            "id": "hkrc99r",
            "parent_id": "t3_qun982",
            "score": 2,
            "created_utc": 1637005860.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkrh8rg",
                    "parent_id": "t1_hkrc99r",
                    "score": 7,
                    "created_utc": 1637007829.0,
                    "replies": [
                        {
                            "body": "We are all free to do what we want.  As a SD paying an allowance on the first does not benefit us in any way.",
                            "author": "LotBuilder",
                            "id": "hkrjeog",
                            "parent_id": "t1_hkrh8rg",
                            "score": 0,
                            "created_utc": 1637008671.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hkr5wv3",
            "parent_id": "t3_qun982",
            "score": 0,
            "created_utc": 1637003351.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkr9yc3",
                    "parent_id": "t1_hkr5wv3",
                    "score": 7,
                    "created_utc": 1637004961.0,
                    "replies": [
                        {
                            "body": "Yes, PPM should be left in an envelope at the start of the date. PPM isn't the issue here and if anyone gives up intimacy without the PPM in hand, they need to stop doing it.\n\nI'm only discussing monthly and suggesting for those that are in the \"no PPM\" camp, go for weekly, and yes paid at the START of the week, at the start of the date.\n\nUnfortunately, no matter what, these repeat posts won't do anything to stop bad actors. SBs need to be better educated and 99% of them don't visit SLF.",
                            "author": "vince539839",
                            "id": "hkrdli3",
                            "parent_id": "t1_hkr9yc3",
                            "score": 5,
                            "created_utc": 1637006385.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">(monthly allowance x 12)/52 weeks) = weekly allowance.\n\nVery precise calculation. Is this administered by ADP or PayChex?\n🤣",
                    "author": "Chill_SD1974",
                    "id": "hkrfjd4",
                    "parent_id": "t1_hkr5wv3",
                    "score": 3,
                    "created_utc": 1637007155.0,
                    "replies": [
                        {
                            "body": "LOL!!!",
                            "author": "vince539839",
                            "id": "hkrfw9j",
                            "parent_id": "t1_hkrfjd4",
                            "score": 2,
                            "created_utc": 1637007298.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hkrguf5",
                    "parent_id": "t1_hkr5wv3",
                    "score": 5,
                    "created_utc": 1637007677.0,
                    "replies": [
                        {
                            "body": "1br rent in my area is around $3.5k-$4k.\n\nI think I need to buy a home in some other area for my SRs ... lol!!",
                            "author": "vince539839",
                            "id": "hkrhled",
                            "parent_id": "t1_hkrguf5",
                            "score": 3,
                            "created_utc": 1637007961.0,
                            "replies": []
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hkrj3ju",
                            "parent_id": "t1_hkrguf5",
                            "score": 2,
                            "created_utc": 1637008548.0,
                            "replies": [
                                {
                                    "body": "“Lowball” and amounts is relative and complex. I could do an entire thesis on amounts. IMO that’s kinda low, but again, there’s a whole complexity that goes with it. No time for thesis. And mods will remove your comment mentioning specific amounts…",
                                    "author": "ExExpectations",
                                    "id": "hkrkc7l",
                                    "parent_id": "t1_hkrj3ju",
                                    "score": 3,
                                    "created_utc": 1637009037.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Holy shit where do you live lmfao. From two SDs I’m averaging about $3,200.",
                    "author": null,
                    "id": "hkrinvr",
                    "parent_id": "t1_hkr5wv3",
                    "score": 1,
                    "created_utc": 1637008379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's why you start with the PPM. Other than the 1st time which involves the intimacy, every other date should have the PPM at the beginning. \n\nIt's to build up trusts and make sure the SD can actually afford the SR. Many SD can't actually afford the SR long term but they can probably fake it for a while.\n\nFor monthly allowance, I have much better experience with splitting it up into 2 smaller chunk of biweekly sum. It prevents the SB from blowing everything on booze or something and beg for another stimulus before the start of the month. It also protects me from getting ghosted when giving the full amount at the beginning.",
            "author": "Majesticpork",
            "id": "hkrd7py",
            "parent_id": "t3_qun982",
            "score": -1,
            "created_utc": 1637006234.0,
            "replies": [
                {
                    "body": "Why are you dating them if you think they’re “blowing it all on booze”? That just sounds so condescending.",
                    "author": null,
                    "id": "hkrjfi2",
                    "parent_id": "t1_hkrd7py",
                    "score": 18,
                    "created_utc": 1637008680.0,
                    "replies": []
                },
                {
                    "body": ">It prevents the SB from blowing everything on booze or something and beg for another stimulus before the start of the month.\n\nIf my SD had ever said such a thing, I would have dumped him. It's impertinent. Also: If this is your experience, then those women that you end up with aren't the smartest. I would have some good ideas as to why that is.",
                    "author": "Inner_Examination_38",
                    "id": "hkrjhp9",
                    "parent_id": "t1_hkrd7py",
                    "score": 14,
                    "created_utc": 1637008704.0,
                    "replies": []
                },
                {
                    "body": "See, that seems fine. Biweekly is doable",
                    "author": "oneangstybiscuit",
                    "id": "hkrhcbi",
                    "parent_id": "t1_hkrd7py",
                    "score": 5,
                    "created_utc": 1637007866.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">This, my dear SDs, is why you should be providing an allowance upfront, at the beginning of the month, if you are on an allowance with your SB.\n\nThis goes both ways, doesn't it? What would be your suggestion for the SDs? How do we prevent the SB from ghosting immediately after she is paid on the first of the month?",
            "author": null,
            "id": "hkr3cvm",
            "parent_id": "t3_qun982",
            "score": -3,
            "created_utc": 1637002334.0,
            "replies": [
                {
                    "body": "She really answered this in her last sentence.\n\nAlso: If this whole question is so controversial and both sides assume they will be tricked, it is probably not a sugar relationship in the full sense of the word.",
                    "author": "Inner_Examination_38",
                    "id": "hkr45i2",
                    "parent_id": "t1_hkr3cvm",
                    "score": 20,
                    "created_utc": 1637002651.0,
                    "replies": []
                },
                {
                    "body": "I’d say if that is a worry then neither of you are ready to move to an allowance",
                    "author": "thereadinessisall",
                    "id": "hkr3vgq",
                    "parent_id": "t1_hkr3cvm",
                    "score": 12,
                    "created_utc": 1637002539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkr3b0t",
            "parent_id": "t3_qun982",
            "score": -12,
            "created_utc": 1637002314.0,
            "replies": [
                {
                    "body": "well personally, I think this post should be stickied, considering the influx of SBs posting on here asking if theyll ever get their allowance after encountering similar situations",
                    "author": "c0rnstarr",
                    "id": "hkrcyui",
                    "parent_id": "t1_hkr3b0t",
                    "score": 17,
                    "created_utc": 1637006136.0,
                    "replies": [
                        {
                            "body": "that’s what the is this a scam post is for",
                            "author": null,
                            "id": "hkrieuw",
                            "parent_id": "t1_hkrcyui",
                            "score": -5,
                            "created_utc": 1637008280.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The point is to highlight not only that there are men deliberately scamming women for sex, but here's an example of one who's actually bragging about how successful he's been at scamming women by promising to pay an allowance at the end of the month.\n\nGranted, this doesn't affect you personally. Although hopefully you understand the rationale behind a woman wanting to protect herself against this kind of predator. I believe the point of the post is to emphasize for the women on the forum that these kinds of sexual predators do, in fact, exist.",
                    "author": "ChapterRelative",
                    "id": "hkrecsl",
                    "parent_id": "t1_hkr3b0t",
                    "score": 20,
                    "created_utc": 1637006685.0,
                    "replies": []
                },
                {
                    "body": "Especially when it offers absolutely nothing. It's just an SB circle jerk",
                    "author": "This_is_Not_My_Handl",
                    "id": "hkr6fni",
                    "parent_id": "t1_hkr3b0t",
                    "score": -4,
                    "created_utc": 1637003558.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hkrecxc",
                            "parent_id": "t1_hkr6fni",
                            "score": 14,
                            "created_utc": 1637006687.0,
                            "replies": [
                                {
                                    "body": "very colorful visual",
                                    "author": "c0rnstarr",
                                    "id": "hkrf5ek",
                                    "parent_id": "t1_hkrecxc",
                                    "score": 7,
                                    "created_utc": 1637007000.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You say that like it's a bad thing. 😘",
                            "author": "ChapterRelative",
                            "id": "hkreelt",
                            "parent_id": "t1_hkr6fni",
                            "score": 7,
                            "created_utc": 1637006706.0,
                            "replies": []
                        },
                        {
                            "body": "pretty much so.",
                            "author": null,
                            "id": "hkrb6fd",
                            "parent_id": "t1_hkr6fni",
                            "score": -9,
                            "created_utc": 1637005440.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "While I agree with the conclusion that monthly allowance should be at the beginning of the month, the logic here is pretty shitty. Your quoted article is from a self-identified salt daddy who never pays allowance at all. There was no PPM until *mutual* trust is established. That's just being naive. That should always be the formula. Then, allowance can happen if everyone is interested. The primary reason it should be at the beginning is stability is the SB's primary benefit. And end of month allowance is inherently less stable than beginning of the month. But there is nothing evil about end of month allowance if the numbers work out to make it a better deal for the SB.",
            "author": "This_is_Not_My_Handl",
            "id": "hkr5xam",
            "parent_id": "t3_qun982",
            "score": -3,
            "created_utc": 1637003356.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkr9edy",
                    "parent_id": "t1_hkr5xam",
                    "score": 11,
                    "created_utc": 1637004739.0,
                    "replies": [
                        {
                            "body": "> How the heck would end-of-month allowance ever work out in the SBs favor? \n\nIf the allowance is high enough and there is sufficient trust, end of month allowance may be better than PPM. Some very genuine SDs simply refuse to do beginning of the month allowance.",
                            "author": "This_is_Not_My_Handl",
                            "id": "hkr9z7k",
                            "parent_id": "t1_hkr9edy",
                            "score": -2,
                            "created_utc": 1637004971.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is crazy talk saying its ok for an SD to get scammed. I don’t think either is ok.",
            "author": "401kisfun",
            "id": "hkrfo00",
            "parent_id": "t3_qun982",
            "score": -17,
            "created_utc": 1637007206.0,
            "replies": []
        },
        {
            "body": "👏🏼👏🏼👏🏼👏🏼👏🏼",
            "author": "ExExpectations",
            "id": "hkrfypq",
            "parent_id": "t1_hkrc2h7",
            "score": 4,
            "created_utc": 1637007326.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkr8jii",
            "parent_id": "t1_hkr6bt4",
            "score": 28,
            "created_utc": 1637004396.0,
            "replies": [
                {
                    "body": "I personally provide after and have never had it be an issue. \n\nBut I'm curious, why would a bad actor SD who you are worried about hurting you if you insisted on PPM after the meet not be a threat to you after he's paid upfront and just take the PPM back after making you feel comfortable and getting what he wanted from you? Only in that case the physical altercation is almost guaranteed since the PPM is physically in your possession. \n\nWhereas a bad actor SB is generally going to be completely deterred if they don't get the money up front as we're a sexually dimorphic species. Unless she's escalating to armed robbery or they're outliers. \n\nLike we're dealing with a piece of shit dude here. He's trying to scam you. Why would he draw the line at scamming? Clearly he's already comfortable with a serious conflict at the meet as he's going to tell you he can't pay you after you've already had the meet and expects you won't just be cool with it. So why not soft extortion? Stand in front of the door and say he actually really needs that money for his mom's medication they only take cash at her pharmacy. But he'll send the money to you on (insert app). What are you gonna do? Physically assault him? Call him the cops? If you're willing to escalate like that then what's stopping you from escalating if he refuses PPM after just the same?",
                    "author": "KPackCorey",
                    "id": "hkrcbfh",
                    "parent_id": "t1_hkr8jii",
                    "score": -11,
                    "created_utc": 1637005883.0,
                    "replies": [
                        {
                            "body": ">*I personally provide after and have never had it be an issue.*\n\nWhy not take away eventual disturbing thoughts off a woman you want to have passionate and enthusiastic sex with?\n\nWhat do you win by taking the risk she will be worrying through the whole intimate time?\n\nWhy make us having to ask for it upfront and make us feel like prostitutes?\n\nWhy let it even *become* an issue?\n\nDo you really lack the empathy to imagine why most women hate to ask? And it *NOT* being an issue maybe only plays in *YOUR* mind?\n\nWhy not let her feel taken care of and relax?!\n\nIs it really so hard to buy a nice card, write her name on it, and put it on the nightstand or in her purse before the clothes come off, and take away the slightest chance on it even *being* an issue for her?\n\n*> Stand in front of the door and say he actually really needs that money* \n\nAnd yes, there is always the risk he takes it back with force, but most scammers are cowards and telling someone that you didn't had time to go to an ATM but will cash app later requires a whole different (and more common) kind of 'courage' than robbing someone with force.",
                            "author": "A-touchofreality",
                            "id": "hkrhbaa",
                            "parent_id": "t1_hkrcbfh",
                            "score": 38,
                            "created_utc": 1637007855.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hkrdmlj",
                            "parent_id": "t1_hkrcbfh",
                            "score": 20,
                            "created_utc": 1637006398.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ripping either the SD or SB off its totally not ok. You shouldn’t even be suggesting that.",
            "author": "401kisfun",
            "id": "hkrfgvl",
            "parent_id": "t1_hkr3v94",
            "score": -14,
            "created_utc": 1637007128.0,
            "replies": [
                {
                    "body": "Well good thing that's not what they said, then.",
                    "author": "oneangstybiscuit",
                    "id": "hkrgtrs",
                    "parent_id": "t1_hkrfgvl",
                    "score": 38,
                    "created_utc": 1637007670.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone always thinks money stops mattering at some point and/or it never stops feeling shitty to get ripped off.I once quit ordering takeout from a favorite restaurant because they charged me 50¢ for a \"to-go charge\" without telling me that was the new policy. I don't want to be ripped off any more than you do.",
            "author": "This_is_Not_My_Handl",
            "id": "hkr6csv",
            "parent_id": "t1_hkr3v94",
            "score": -22,
            "created_utc": 1637003526.0,
            "replies": [
                {
                    "body": "HUGE RED FLAG 🚩🚩🚩🚩",
                    "author": "LibrarianWonderful52",
                    "id": "hkr7utk",
                    "parent_id": "t1_hkr6csv",
                    "score": 25,
                    "created_utc": 1637004122.0,
                    "replies": [
                        {
                            "body": "Yes. Huge red flag that I don't want to get ripped off any more than an SB wants to get ripped off. Equality be like that sometimes.",
                            "author": "This_is_Not_My_Handl",
                            "id": "hkr8kx5",
                            "parent_id": "t1_hkr7utk",
                            "score": -2,
                            "created_utc": 1637004412.0,
                            "replies": [
                                {
                                    "body": " it seems like youre not understanding if the fundamental difference between you as an SD getting \"ripped off\" and an SB getting \"ripped off\".\n\nSD: potentially loses a little bit of money that should not burn a hole in their pocket. its annoying\n\nSB: gets taken advantage of after putting herself at risk for being assaulted or violated, her body used and disregarded after being put in a vulnerable position.\n\nThis lack of empathy is very concerning. If youre sensitive about your money to the point youre not willing to take a small risk upon understanding this power disparity, you absolutely should not be sugaring",
                                    "author": "c0rnstarr",
                                    "id": "hkracvh",
                                    "parent_id": "t1_hkr8kx5",
                                    "score": 41,
                                    "created_utc": 1637005119.0,
                                    "replies": [
                                        {
                                            "body": "\\^\\^ This. If you're dating a scammer, one party or the other is going to lose out on the $ if the other side doesn't hold up their end of the bargain. But, on top of that, she has so much more to lose. To put it bluntly, I'd rather be a victim of a straight up robbery (in fact I have, and yes it sucks) than be robbed *and* raped.",
                                            "author": "roscoe7585",
                                            "id": "hkrg3rb",
                                            "parent_id": "t1_hkracvh",
                                            "score": 33,
                                            "created_utc": 1637007383.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hkrby3o",
                                            "parent_id": "t1_hkracvh",
                                            "score": 15,
                                            "created_utc": 1637005737.0,
                                            "replies": [
                                                {
                                                    "body": "And he used to be a mod here. \n\nSMDH.",
                                                    "author": "ExExpectations",
                                                    "id": "hkrfrj8",
                                                    "parent_id": "t1_hkrby3o",
                                                    "score": 11,
                                                    "created_utc": 1637007245.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkr73ki",
                    "parent_id": "t1_hkr6csv",
                    "score": 44,
                    "created_utc": 1637003824.0,
                    "replies": [
                        {
                            "body": "He (used to be) a mod on this subreddit. THAT in itself would take a whole day to unpack…",
                            "author": "ExExpectations",
                            "id": "hkrfmwm",
                            "parent_id": "t1_hkr73ki",
                            "score": 23,
                            "created_utc": 1637007195.0,
                            "replies": []
                        },
                        {
                            "body": "What, exactly, do you think it says? People always like to drop the \"says a lot about you\" language. Don't be a pansy. Say it.",
                            "author": "This_is_Not_My_Handl",
                            "id": "hkr7h5b",
                            "parent_id": "t1_hkr73ki",
                            "score": -14,
                            "created_utc": 1637003974.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hkr7wiy",
                                    "parent_id": "t1_hkr7h5b",
                                    "score": 44,
                                    "created_utc": 1637004141.0,
                                    "replies": [
                                        {
                                            "body": "Huh, I would have just said that he's a \"rhymes with lass\"",
                                            "author": "ChapterRelative",
                                            "id": "hkr9xg8",
                                            "parent_id": "t1_hkr7wiy",
                                            "score": 14,
                                            "created_utc": 1637004951.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Oh. That's all? I can live with that.",
                                            "author": "This_is_Not_My_Handl",
                                            "id": "hkr8ebk",
                                            "parent_id": "t1_hkr7wiy",
                                            "score": -18,
                                            "created_utc": 1637004339.0,
                                            "replies": [
                                                {
                                                    "body": "And this guy used to be a mod!!",
                                                    "author": null,
                                                    "id": "hkr9u2w",
                                                    "parent_id": "t1_hkr8ebk",
                                                    "score": 17,
                                                    "created_utc": 1637004915.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "🚩🚩🚩🚩🚩🚩🚩🚩",
                                    "author": "Affectionate_Bus_171",
                                    "id": "hkr8txz",
                                    "parent_id": "t1_hkr7h5b",
                                    "score": 19,
                                    "created_utc": 1637004512.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do believe that I said it sucks to get rinsed - because it matters.\n\nJust on balance, the impact is materially less than an SB getting PnD'd.",
                    "author": "sfwinefan",
                    "id": "hkrctrm",
                    "parent_id": "t1_hkr6csv",
                    "score": 16,
                    "created_utc": 1637006081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed.  I’ll occasionally do cashapp and Venmo with long established arrangements but it’s send when they are here.",
            "author": "LotBuilder",
            "id": "hkred2c",
            "parent_id": "t1_hkra839",
            "score": 8,
            "created_utc": 1637006688.0,
            "replies": []
        },
        {
            "body": "Eh, I hate cash because my bank doesn’t allow cash deposits so I have to find a CVS or 7-11 and go and make a Cashapp deposit and be charged all the fees and stuff. It’s easier to just Venmo me the money.\n\nI will say though, that one of my current SDs pays me when he gets home, has since we started. There was one time where he wasn’t going home, but rather going on a business trip, and I didn’t get the money by the next morning. I mentioned it to him and gave him the benefit of the doubt and said it might’ve been the storm having spotty internet connection. He tried to do it while driving and it didn’t go through, and not even two minutes later I got the Venmo notification. \n\nDo whatever works for you, but honestly cash is annoying to a lot of people. It turns me off just a bit if I know the guy is only going to be using cash rather than money I can actually just transfer into my account.",
            "author": null,
            "id": "hkrhwe3",
            "parent_id": "t1_hkra839",
            "score": 1,
            "created_utc": 1637008078.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkrh8rg",
            "parent_id": "t1_hkrc99r",
            "score": 7,
            "created_utc": 1637007829.0,
            "replies": [
                {
                    "body": "We are all free to do what we want.  As a SD paying an allowance on the first does not benefit us in any way.",
                    "author": "LotBuilder",
                    "id": "hkrjeog",
                    "parent_id": "t1_hkrh8rg",
                    "score": 0,
                    "created_utc": 1637008671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkr9yc3",
            "parent_id": "t1_hkr5wv3",
            "score": 7,
            "created_utc": 1637004961.0,
            "replies": [
                {
                    "body": "Yes, PPM should be left in an envelope at the start of the date. PPM isn't the issue here and if anyone gives up intimacy without the PPM in hand, they need to stop doing it.\n\nI'm only discussing monthly and suggesting for those that are in the \"no PPM\" camp, go for weekly, and yes paid at the START of the week, at the start of the date.\n\nUnfortunately, no matter what, these repeat posts won't do anything to stop bad actors. SBs need to be better educated and 99% of them don't visit SLF.",
                    "author": "vince539839",
                    "id": "hkrdli3",
                    "parent_id": "t1_hkr9yc3",
                    "score": 5,
                    "created_utc": 1637006385.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">(monthly allowance x 12)/52 weeks) = weekly allowance.\n\nVery precise calculation. Is this administered by ADP or PayChex?\n🤣",
            "author": "Chill_SD1974",
            "id": "hkrfjd4",
            "parent_id": "t1_hkr5wv3",
            "score": 3,
            "created_utc": 1637007155.0,
            "replies": [
                {
                    "body": "LOL!!!",
                    "author": "vince539839",
                    "id": "hkrfw9j",
                    "parent_id": "t1_hkrfjd4",
                    "score": 2,
                    "created_utc": 1637007298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hkrguf5",
            "parent_id": "t1_hkr5wv3",
            "score": 5,
            "created_utc": 1637007677.0,
            "replies": [
                {
                    "body": "1br rent in my area is around $3.5k-$4k.\n\nI think I need to buy a home in some other area for my SRs ... lol!!",
                    "author": "vince539839",
                    "id": "hkrhled",
                    "parent_id": "t1_hkrguf5",
                    "score": 3,
                    "created_utc": 1637007961.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hkrj3ju",
                    "parent_id": "t1_hkrguf5",
                    "score": 2,
                    "created_utc": 1637008548.0,
                    "replies": [
                        {
                            "body": "“Lowball” and amounts is relative and complex. I could do an entire thesis on amounts. IMO that’s kinda low, but again, there’s a whole complexity that goes with it. No time for thesis. And mods will remove your comment mentioning specific amounts…",
                            "author": "ExExpectations",
                            "id": "hkrkc7l",
                            "parent_id": "t1_hkrj3ju",
                            "score": 3,
                            "created_utc": 1637009037.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy shit where do you live lmfao. From two SDs I’m averaging about $3,200.",
            "author": null,
            "id": "hkrinvr",
            "parent_id": "t1_hkr5wv3",
            "score": 1,
            "created_utc": 1637008379.0,
            "replies": []
        },
        {
            "body": "Why are you dating them if you think they’re “blowing it all on booze”? That just sounds so condescending.",
            "author": null,
            "id": "hkrjfi2",
            "parent_id": "t1_hkrd7py",
            "score": 18,
            "created_utc": 1637008680.0,
            "replies": []
        },
        {
            "body": ">It prevents the SB from blowing everything on booze or something and beg for another stimulus before the start of the month.\n\nIf my SD had ever said such a thing, I would have dumped him. It's impertinent. Also: If this is your experience, then those women that you end up with aren't the smartest. I would have some good ideas as to why that is.",
            "author": "Inner_Examination_38",
            "id": "hkrjhp9",
            "parent_id": "t1_hkrd7py",
            "score": 14,
            "created_utc": 1637008704.0,
            "replies": []
        },
        {
            "body": "See, that seems fine. Biweekly is doable",
            "author": "oneangstybiscuit",
            "id": "hkrhcbi",
            "parent_id": "t1_hkrd7py",
            "score": 5,
            "created_utc": 1637007866.0,
            "replies": []
        },
        {
            "body": "She really answered this in her last sentence.\n\nAlso: If this whole question is so controversial and both sides assume they will be tricked, it is probably not a sugar relationship in the full sense of the word.",
            "author": "Inner_Examination_38",
            "id": "hkr45i2",
            "parent_id": "t1_hkr3cvm",
            "score": 20,
            "created_utc": 1637002651.0,
            "replies": []
        },
        {
            "body": "I’d say if that is a worry then neither of you are ready to move to an allowance",
            "author": "thereadinessisall",
            "id": "hkr3vgq",
            "parent_id": "t1_hkr3cvm",
            "score": 12,
            "created_utc": 1637002539.0,
            "replies": []
        },
        {
            "body": "well personally, I think this post should be stickied, considering the influx of SBs posting on here asking if theyll ever get their allowance after encountering similar situations",
            "author": "c0rnstarr",
            "id": "hkrcyui",
            "parent_id": "t1_hkr3b0t",
            "score": 17,
            "created_utc": 1637006136.0,
            "replies": [
                {
                    "body": "that’s what the is this a scam post is for",
                    "author": null,
                    "id": "hkrieuw",
                    "parent_id": "t1_hkrcyui",
                    "score": -5,
                    "created_utc": 1637008280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The point is to highlight not only that there are men deliberately scamming women for sex, but here's an example of one who's actually bragging about how successful he's been at scamming women by promising to pay an allowance at the end of the month.\n\nGranted, this doesn't affect you personally. Although hopefully you understand the rationale behind a woman wanting to protect herself against this kind of predator. I believe the point of the post is to emphasize for the women on the forum that these kinds of sexual predators do, in fact, exist.",
            "author": "ChapterRelative",
            "id": "hkrecsl",
            "parent_id": "t1_hkr3b0t",
            "score": 20,
            "created_utc": 1637006685.0,
            "replies": []
        },
        {
            "body": "Especially when it offers absolutely nothing. It's just an SB circle jerk",
            "author": "This_is_Not_My_Handl",
            "id": "hkr6fni",
            "parent_id": "t1_hkr3b0t",
            "score": -4,
            "created_utc": 1637003558.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkrecxc",
                    "parent_id": "t1_hkr6fni",
                    "score": 14,
                    "created_utc": 1637006687.0,
                    "replies": [
                        {
                            "body": "very colorful visual",
                            "author": "c0rnstarr",
                            "id": "hkrf5ek",
                            "parent_id": "t1_hkrecxc",
                            "score": 7,
                            "created_utc": 1637007000.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You say that like it's a bad thing. 😘",
                    "author": "ChapterRelative",
                    "id": "hkreelt",
                    "parent_id": "t1_hkr6fni",
                    "score": 7,
                    "created_utc": 1637006706.0,
                    "replies": []
                },
                {
                    "body": "pretty much so.",
                    "author": null,
                    "id": "hkrb6fd",
                    "parent_id": "t1_hkr6fni",
                    "score": -9,
                    "created_utc": 1637005440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkr9edy",
            "parent_id": "t1_hkr5xam",
            "score": 11,
            "created_utc": 1637004739.0,
            "replies": [
                {
                    "body": "> How the heck would end-of-month allowance ever work out in the SBs favor? \n\nIf the allowance is high enough and there is sufficient trust, end of month allowance may be better than PPM. Some very genuine SDs simply refuse to do beginning of the month allowance.",
                    "author": "This_is_Not_My_Handl",
                    "id": "hkr9z7k",
                    "parent_id": "t1_hkr9edy",
                    "score": -2,
                    "created_utc": 1637004971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I personally provide after and have never had it be an issue. \n\nBut I'm curious, why would a bad actor SD who you are worried about hurting you if you insisted on PPM after the meet not be a threat to you after he's paid upfront and just take the PPM back after making you feel comfortable and getting what he wanted from you? Only in that case the physical altercation is almost guaranteed since the PPM is physically in your possession. \n\nWhereas a bad actor SB is generally going to be completely deterred if they don't get the money up front as we're a sexually dimorphic species. Unless she's escalating to armed robbery or they're outliers. \n\nLike we're dealing with a piece of shit dude here. He's trying to scam you. Why would he draw the line at scamming? Clearly he's already comfortable with a serious conflict at the meet as he's going to tell you he can't pay you after you've already had the meet and expects you won't just be cool with it. So why not soft extortion? Stand in front of the door and say he actually really needs that money for his mom's medication they only take cash at her pharmacy. But he'll send the money to you on (insert app). What are you gonna do? Physically assault him? Call him the cops? If you're willing to escalate like that then what's stopping you from escalating if he refuses PPM after just the same?",
            "author": "KPackCorey",
            "id": "hkrcbfh",
            "parent_id": "t1_hkr8jii",
            "score": -11,
            "created_utc": 1637005883.0,
            "replies": [
                {
                    "body": ">*I personally provide after and have never had it be an issue.*\n\nWhy not take away eventual disturbing thoughts off a woman you want to have passionate and enthusiastic sex with?\n\nWhat do you win by taking the risk she will be worrying through the whole intimate time?\n\nWhy make us having to ask for it upfront and make us feel like prostitutes?\n\nWhy let it even *become* an issue?\n\nDo you really lack the empathy to imagine why most women hate to ask? And it *NOT* being an issue maybe only plays in *YOUR* mind?\n\nWhy not let her feel taken care of and relax?!\n\nIs it really so hard to buy a nice card, write her name on it, and put it on the nightstand or in her purse before the clothes come off, and take away the slightest chance on it even *being* an issue for her?\n\n*> Stand in front of the door and say he actually really needs that money* \n\nAnd yes, there is always the risk he takes it back with force, but most scammers are cowards and telling someone that you didn't had time to go to an ATM but will cash app later requires a whole different (and more common) kind of 'courage' than robbing someone with force.",
                    "author": "A-touchofreality",
                    "id": "hkrhbaa",
                    "parent_id": "t1_hkrcbfh",
                    "score": 38,
                    "created_utc": 1637007855.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkrdmlj",
                    "parent_id": "t1_hkrcbfh",
                    "score": 20,
                    "created_utc": 1637006398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well good thing that's not what they said, then.",
            "author": "oneangstybiscuit",
            "id": "hkrgtrs",
            "parent_id": "t1_hkrfgvl",
            "score": 38,
            "created_utc": 1637007670.0,
            "replies": []
        },
        {
            "body": "HUGE RED FLAG 🚩🚩🚩🚩",
            "author": "LibrarianWonderful52",
            "id": "hkr7utk",
            "parent_id": "t1_hkr6csv",
            "score": 25,
            "created_utc": 1637004122.0,
            "replies": [
                {
                    "body": "Yes. Huge red flag that I don't want to get ripped off any more than an SB wants to get ripped off. Equality be like that sometimes.",
                    "author": "This_is_Not_My_Handl",
                    "id": "hkr8kx5",
                    "parent_id": "t1_hkr7utk",
                    "score": -2,
                    "created_utc": 1637004412.0,
                    "replies": [
                        {
                            "body": " it seems like youre not understanding if the fundamental difference between you as an SD getting \"ripped off\" and an SB getting \"ripped off\".\n\nSD: potentially loses a little bit of money that should not burn a hole in their pocket. its annoying\n\nSB: gets taken advantage of after putting herself at risk for being assaulted or violated, her body used and disregarded after being put in a vulnerable position.\n\nThis lack of empathy is very concerning. If youre sensitive about your money to the point youre not willing to take a small risk upon understanding this power disparity, you absolutely should not be sugaring",
                            "author": "c0rnstarr",
                            "id": "hkracvh",
                            "parent_id": "t1_hkr8kx5",
                            "score": 41,
                            "created_utc": 1637005119.0,
                            "replies": [
                                {
                                    "body": "\\^\\^ This. If you're dating a scammer, one party or the other is going to lose out on the $ if the other side doesn't hold up their end of the bargain. But, on top of that, she has so much more to lose. To put it bluntly, I'd rather be a victim of a straight up robbery (in fact I have, and yes it sucks) than be robbed *and* raped.",
                                    "author": "roscoe7585",
                                    "id": "hkrg3rb",
                                    "parent_id": "t1_hkracvh",
                                    "score": 33,
                                    "created_utc": 1637007383.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hkrby3o",
                                    "parent_id": "t1_hkracvh",
                                    "score": 15,
                                    "created_utc": 1637005737.0,
                                    "replies": [
                                        {
                                            "body": "And he used to be a mod here. \n\nSMDH.",
                                            "author": "ExExpectations",
                                            "id": "hkrfrj8",
                                            "parent_id": "t1_hkrby3o",
                                            "score": 11,
                                            "created_utc": 1637007245.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkr73ki",
            "parent_id": "t1_hkr6csv",
            "score": 44,
            "created_utc": 1637003824.0,
            "replies": [
                {
                    "body": "He (used to be) a mod on this subreddit. THAT in itself would take a whole day to unpack…",
                    "author": "ExExpectations",
                    "id": "hkrfmwm",
                    "parent_id": "t1_hkr73ki",
                    "score": 23,
                    "created_utc": 1637007195.0,
                    "replies": []
                },
                {
                    "body": "What, exactly, do you think it says? People always like to drop the \"says a lot about you\" language. Don't be a pansy. Say it.",
                    "author": "This_is_Not_My_Handl",
                    "id": "hkr7h5b",
                    "parent_id": "t1_hkr73ki",
                    "score": -14,
                    "created_utc": 1637003974.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hkr7wiy",
                            "parent_id": "t1_hkr7h5b",
                            "score": 44,
                            "created_utc": 1637004141.0,
                            "replies": [
                                {
                                    "body": "Huh, I would have just said that he's a \"rhymes with lass\"",
                                    "author": "ChapterRelative",
                                    "id": "hkr9xg8",
                                    "parent_id": "t1_hkr7wiy",
                                    "score": 14,
                                    "created_utc": 1637004951.0,
                                    "replies": []
                                },
                                {
                                    "body": "Oh. That's all? I can live with that.",
                                    "author": "This_is_Not_My_Handl",
                                    "id": "hkr8ebk",
                                    "parent_id": "t1_hkr7wiy",
                                    "score": -18,
                                    "created_utc": 1637004339.0,
                                    "replies": [
                                        {
                                            "body": "And this guy used to be a mod!!",
                                            "author": null,
                                            "id": "hkr9u2w",
                                            "parent_id": "t1_hkr8ebk",
                                            "score": 17,
                                            "created_utc": 1637004915.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "🚩🚩🚩🚩🚩🚩🚩🚩",
                            "author": "Affectionate_Bus_171",
                            "id": "hkr8txz",
                            "parent_id": "t1_hkr7h5b",
                            "score": 19,
                            "created_utc": 1637004512.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do believe that I said it sucks to get rinsed - because it matters.\n\nJust on balance, the impact is materially less than an SB getting PnD'd.",
            "author": "sfwinefan",
            "id": "hkrctrm",
            "parent_id": "t1_hkr6csv",
            "score": 16,
            "created_utc": 1637006081.0,
            "replies": []
        },
        {
            "body": "We are all free to do what we want.  As a SD paying an allowance on the first does not benefit us in any way.",
            "author": "LotBuilder",
            "id": "hkrjeog",
            "parent_id": "t1_hkrh8rg",
            "score": 0,
            "created_utc": 1637008671.0,
            "replies": []
        },
        {
            "body": "Yes, PPM should be left in an envelope at the start of the date. PPM isn't the issue here and if anyone gives up intimacy without the PPM in hand, they need to stop doing it.\n\nI'm only discussing monthly and suggesting for those that are in the \"no PPM\" camp, go for weekly, and yes paid at the START of the week, at the start of the date.\n\nUnfortunately, no matter what, these repeat posts won't do anything to stop bad actors. SBs need to be better educated and 99% of them don't visit SLF.",
            "author": "vince539839",
            "id": "hkrdli3",
            "parent_id": "t1_hkr9yc3",
            "score": 5,
            "created_utc": 1637006385.0,
            "replies": []
        },
        {
            "body": "LOL!!!",
            "author": "vince539839",
            "id": "hkrfw9j",
            "parent_id": "t1_hkrfjd4",
            "score": 2,
            "created_utc": 1637007298.0,
            "replies": []
        },
        {
            "body": "1br rent in my area is around $3.5k-$4k.\n\nI think I need to buy a home in some other area for my SRs ... lol!!",
            "author": "vince539839",
            "id": "hkrhled",
            "parent_id": "t1_hkrguf5",
            "score": 3,
            "created_utc": 1637007961.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hkrj3ju",
            "parent_id": "t1_hkrguf5",
            "score": 2,
            "created_utc": 1637008548.0,
            "replies": [
                {
                    "body": "“Lowball” and amounts is relative and complex. I could do an entire thesis on amounts. IMO that’s kinda low, but again, there’s a whole complexity that goes with it. No time for thesis. And mods will remove your comment mentioning specific amounts…",
                    "author": "ExExpectations",
                    "id": "hkrkc7l",
                    "parent_id": "t1_hkrj3ju",
                    "score": 3,
                    "created_utc": 1637009037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "that’s what the is this a scam post is for",
            "author": null,
            "id": "hkrieuw",
            "parent_id": "t1_hkrcyui",
            "score": -5,
            "created_utc": 1637008280.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkrecxc",
            "parent_id": "t1_hkr6fni",
            "score": 14,
            "created_utc": 1637006687.0,
            "replies": [
                {
                    "body": "very colorful visual",
                    "author": "c0rnstarr",
                    "id": "hkrf5ek",
                    "parent_id": "t1_hkrecxc",
                    "score": 7,
                    "created_utc": 1637007000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You say that like it's a bad thing. 😘",
            "author": "ChapterRelative",
            "id": "hkreelt",
            "parent_id": "t1_hkr6fni",
            "score": 7,
            "created_utc": 1637006706.0,
            "replies": []
        },
        {
            "body": "pretty much so.",
            "author": null,
            "id": "hkrb6fd",
            "parent_id": "t1_hkr6fni",
            "score": -9,
            "created_utc": 1637005440.0,
            "replies": []
        },
        {
            "body": "> How the heck would end-of-month allowance ever work out in the SBs favor? \n\nIf the allowance is high enough and there is sufficient trust, end of month allowance may be better than PPM. Some very genuine SDs simply refuse to do beginning of the month allowance.",
            "author": "This_is_Not_My_Handl",
            "id": "hkr9z7k",
            "parent_id": "t1_hkr9edy",
            "score": -2,
            "created_utc": 1637004971.0,
            "replies": []
        },
        {
            "body": ">*I personally provide after and have never had it be an issue.*\n\nWhy not take away eventual disturbing thoughts off a woman you want to have passionate and enthusiastic sex with?\n\nWhat do you win by taking the risk she will be worrying through the whole intimate time?\n\nWhy make us having to ask for it upfront and make us feel like prostitutes?\n\nWhy let it even *become* an issue?\n\nDo you really lack the empathy to imagine why most women hate to ask? And it *NOT* being an issue maybe only plays in *YOUR* mind?\n\nWhy not let her feel taken care of and relax?!\n\nIs it really so hard to buy a nice card, write her name on it, and put it on the nightstand or in her purse before the clothes come off, and take away the slightest chance on it even *being* an issue for her?\n\n*> Stand in front of the door and say he actually really needs that money* \n\nAnd yes, there is always the risk he takes it back with force, but most scammers are cowards and telling someone that you didn't had time to go to an ATM but will cash app later requires a whole different (and more common) kind of 'courage' than robbing someone with force.",
            "author": "A-touchofreality",
            "id": "hkrhbaa",
            "parent_id": "t1_hkrcbfh",
            "score": 38,
            "created_utc": 1637007855.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkrdmlj",
            "parent_id": "t1_hkrcbfh",
            "score": 20,
            "created_utc": 1637006398.0,
            "replies": []
        },
        {
            "body": "Yes. Huge red flag that I don't want to get ripped off any more than an SB wants to get ripped off. Equality be like that sometimes.",
            "author": "This_is_Not_My_Handl",
            "id": "hkr8kx5",
            "parent_id": "t1_hkr7utk",
            "score": -2,
            "created_utc": 1637004412.0,
            "replies": [
                {
                    "body": " it seems like youre not understanding if the fundamental difference between you as an SD getting \"ripped off\" and an SB getting \"ripped off\".\n\nSD: potentially loses a little bit of money that should not burn a hole in their pocket. its annoying\n\nSB: gets taken advantage of after putting herself at risk for being assaulted or violated, her body used and disregarded after being put in a vulnerable position.\n\nThis lack of empathy is very concerning. If youre sensitive about your money to the point youre not willing to take a small risk upon understanding this power disparity, you absolutely should not be sugaring",
                    "author": "c0rnstarr",
                    "id": "hkracvh",
                    "parent_id": "t1_hkr8kx5",
                    "score": 41,
                    "created_utc": 1637005119.0,
                    "replies": [
                        {
                            "body": "\\^\\^ This. If you're dating a scammer, one party or the other is going to lose out on the $ if the other side doesn't hold up their end of the bargain. But, on top of that, she has so much more to lose. To put it bluntly, I'd rather be a victim of a straight up robbery (in fact I have, and yes it sucks) than be robbed *and* raped.",
                            "author": "roscoe7585",
                            "id": "hkrg3rb",
                            "parent_id": "t1_hkracvh",
                            "score": 33,
                            "created_utc": 1637007383.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hkrby3o",
                            "parent_id": "t1_hkracvh",
                            "score": 15,
                            "created_utc": 1637005737.0,
                            "replies": [
                                {
                                    "body": "And he used to be a mod here. \n\nSMDH.",
                                    "author": "ExExpectations",
                                    "id": "hkrfrj8",
                                    "parent_id": "t1_hkrby3o",
                                    "score": 11,
                                    "created_utc": 1637007245.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He (used to be) a mod on this subreddit. THAT in itself would take a whole day to unpack…",
            "author": "ExExpectations",
            "id": "hkrfmwm",
            "parent_id": "t1_hkr73ki",
            "score": 23,
            "created_utc": 1637007195.0,
            "replies": []
        },
        {
            "body": "What, exactly, do you think it says? People always like to drop the \"says a lot about you\" language. Don't be a pansy. Say it.",
            "author": "This_is_Not_My_Handl",
            "id": "hkr7h5b",
            "parent_id": "t1_hkr73ki",
            "score": -14,
            "created_utc": 1637003974.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkr7wiy",
                    "parent_id": "t1_hkr7h5b",
                    "score": 44,
                    "created_utc": 1637004141.0,
                    "replies": [
                        {
                            "body": "Huh, I would have just said that he's a \"rhymes with lass\"",
                            "author": "ChapterRelative",
                            "id": "hkr9xg8",
                            "parent_id": "t1_hkr7wiy",
                            "score": 14,
                            "created_utc": 1637004951.0,
                            "replies": []
                        },
                        {
                            "body": "Oh. That's all? I can live with that.",
                            "author": "This_is_Not_My_Handl",
                            "id": "hkr8ebk",
                            "parent_id": "t1_hkr7wiy",
                            "score": -18,
                            "created_utc": 1637004339.0,
                            "replies": [
                                {
                                    "body": "And this guy used to be a mod!!",
                                    "author": null,
                                    "id": "hkr9u2w",
                                    "parent_id": "t1_hkr8ebk",
                                    "score": 17,
                                    "created_utc": 1637004915.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "🚩🚩🚩🚩🚩🚩🚩🚩",
                    "author": "Affectionate_Bus_171",
                    "id": "hkr8txz",
                    "parent_id": "t1_hkr7h5b",
                    "score": 19,
                    "created_utc": 1637004512.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Lowball” and amounts is relative and complex. I could do an entire thesis on amounts. IMO that’s kinda low, but again, there’s a whole complexity that goes with it. No time for thesis. And mods will remove your comment mentioning specific amounts…",
            "author": "ExExpectations",
            "id": "hkrkc7l",
            "parent_id": "t1_hkrj3ju",
            "score": 3,
            "created_utc": 1637009037.0,
            "replies": []
        },
        {
            "body": "very colorful visual",
            "author": "c0rnstarr",
            "id": "hkrf5ek",
            "parent_id": "t1_hkrecxc",
            "score": 7,
            "created_utc": 1637007000.0,
            "replies": []
        },
        {
            "body": " it seems like youre not understanding if the fundamental difference between you as an SD getting \"ripped off\" and an SB getting \"ripped off\".\n\nSD: potentially loses a little bit of money that should not burn a hole in their pocket. its annoying\n\nSB: gets taken advantage of after putting herself at risk for being assaulted or violated, her body used and disregarded after being put in a vulnerable position.\n\nThis lack of empathy is very concerning. If youre sensitive about your money to the point youre not willing to take a small risk upon understanding this power disparity, you absolutely should not be sugaring",
            "author": "c0rnstarr",
            "id": "hkracvh",
            "parent_id": "t1_hkr8kx5",
            "score": 41,
            "created_utc": 1637005119.0,
            "replies": [
                {
                    "body": "\\^\\^ This. If you're dating a scammer, one party or the other is going to lose out on the $ if the other side doesn't hold up their end of the bargain. But, on top of that, she has so much more to lose. To put it bluntly, I'd rather be a victim of a straight up robbery (in fact I have, and yes it sucks) than be robbed *and* raped.",
                    "author": "roscoe7585",
                    "id": "hkrg3rb",
                    "parent_id": "t1_hkracvh",
                    "score": 33,
                    "created_utc": 1637007383.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hkrby3o",
                    "parent_id": "t1_hkracvh",
                    "score": 15,
                    "created_utc": 1637005737.0,
                    "replies": [
                        {
                            "body": "And he used to be a mod here. \n\nSMDH.",
                            "author": "ExExpectations",
                            "id": "hkrfrj8",
                            "parent_id": "t1_hkrby3o",
                            "score": 11,
                            "created_utc": 1637007245.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkr7wiy",
            "parent_id": "t1_hkr7h5b",
            "score": 44,
            "created_utc": 1637004141.0,
            "replies": [
                {
                    "body": "Huh, I would have just said that he's a \"rhymes with lass\"",
                    "author": "ChapterRelative",
                    "id": "hkr9xg8",
                    "parent_id": "t1_hkr7wiy",
                    "score": 14,
                    "created_utc": 1637004951.0,
                    "replies": []
                },
                {
                    "body": "Oh. That's all? I can live with that.",
                    "author": "This_is_Not_My_Handl",
                    "id": "hkr8ebk",
                    "parent_id": "t1_hkr7wiy",
                    "score": -18,
                    "created_utc": 1637004339.0,
                    "replies": [
                        {
                            "body": "And this guy used to be a mod!!",
                            "author": null,
                            "id": "hkr9u2w",
                            "parent_id": "t1_hkr8ebk",
                            "score": 17,
                            "created_utc": 1637004915.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🚩🚩🚩🚩🚩🚩🚩🚩",
            "author": "Affectionate_Bus_171",
            "id": "hkr8txz",
            "parent_id": "t1_hkr7h5b",
            "score": 19,
            "created_utc": 1637004512.0,
            "replies": []
        },
        {
            "body": "\\^\\^ This. If you're dating a scammer, one party or the other is going to lose out on the $ if the other side doesn't hold up their end of the bargain. But, on top of that, she has so much more to lose. To put it bluntly, I'd rather be a victim of a straight up robbery (in fact I have, and yes it sucks) than be robbed *and* raped.",
            "author": "roscoe7585",
            "id": "hkrg3rb",
            "parent_id": "t1_hkracvh",
            "score": 33,
            "created_utc": 1637007383.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hkrby3o",
            "parent_id": "t1_hkracvh",
            "score": 15,
            "created_utc": 1637005737.0,
            "replies": [
                {
                    "body": "And he used to be a mod here. \n\nSMDH.",
                    "author": "ExExpectations",
                    "id": "hkrfrj8",
                    "parent_id": "t1_hkrby3o",
                    "score": 11,
                    "created_utc": 1637007245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Huh, I would have just said that he's a \"rhymes with lass\"",
            "author": "ChapterRelative",
            "id": "hkr9xg8",
            "parent_id": "t1_hkr7wiy",
            "score": 14,
            "created_utc": 1637004951.0,
            "replies": []
        },
        {
            "body": "Oh. That's all? I can live with that.",
            "author": "This_is_Not_My_Handl",
            "id": "hkr8ebk",
            "parent_id": "t1_hkr7wiy",
            "score": -18,
            "created_utc": 1637004339.0,
            "replies": [
                {
                    "body": "And this guy used to be a mod!!",
                    "author": null,
                    "id": "hkr9u2w",
                    "parent_id": "t1_hkr8ebk",
                    "score": 17,
                    "created_utc": 1637004915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And he used to be a mod here. \n\nSMDH.",
            "author": "ExExpectations",
            "id": "hkrfrj8",
            "parent_id": "t1_hkrby3o",
            "score": 11,
            "created_utc": 1637007245.0,
            "replies": []
        },
        {
            "body": "And this guy used to be a mod!!",
            "author": null,
            "id": "hkr9u2w",
            "parent_id": "t1_hkr8ebk",
            "score": 17,
            "created_utc": 1637004915.0,
            "replies": []
        }
    ]
}