{
    "title": "[SNS] All's well that ends well! Today's RM recording with JSM & YSC",
    "post_id": "s0gfql",
    "post_url": "https://www.reddit.com/r/runningman/comments/s0gfql/sns_alls_well_that_ends_well_todays_rm_recording/",
    "author": "Deroucade",
    "body": "",
    "url": "https://www.instagram.com/p/CYi4cqbBDgl/?utm_medium=copy_link",
    "score": 343,
    "upvote_ratio": 0.97,
    "created_utc": 1641808347.0,
    "num_comments": 100,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "It was nice of her to post this, hopefully fans will cool down now before the next ep",
            "author": "pagethirteen",
            "id": "hs1mti1",
            "parent_id": "t3_s0gfql",
            "score": 83,
            "created_utc": 1641809056.0,
            "replies": [
                {
                    "body": "Lol yea its like people forgot how Somin is an actress that can cry on command. Its not even the worst thing theyve done to each other. Like KJK getting constantly teased about YEH, or how Seok Jin is a bad husband, or HAHA's youtube channel, or how Song Ji hyo's dating life. Or When Haha was forced to go on nevis swing by KJK and get slapped by him afterwards. https://www.youtube.com/watch?v=4tDY0FyxPm4\n\n\n\nThey are good friends, don't worry to much and cause rumors",
                    "author": "netgames2000",
                    "id": "hs49w0p",
                    "parent_id": "t1_hs1mti1",
                    "score": 12,
                    "created_utc": 1641850246.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hs1x63b",
                    "parent_id": "t1_hs1mti1",
                    "score": 10,
                    "created_utc": 1641816392.0,
                    "replies": [
                        {
                            "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**Please refrain from referring to fans as dumb, please. Thanks.**\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                            "author": "wumikomiko",
                            "id": "hs2o6cf",
                            "parent_id": "t1_hs1x63b",
                            "score": 4,
                            "created_utc": 1641829143.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is so kind and loving and gracious of her to post. So impressed with the protective ambrella she's extending for her friend. \n\nI'm also relieved that their on-air interactions will also likely be good, and the show won't be harmed for it.\n\nAnd I also feel a twinge of something - like regret - that something similar couldn't have been done publicly for JSM herself when the abuse and harassment targeting her first started to rage years ago. Look at the good impact that something cute and simple like this can have. \n\nThe fact that JSM takes the initiative to do this - which we see is not business as usual - makes her kindness even more notable. We should all be so lucky to have good people around us. We're all human, and we all make mistakes; sometimes we hurt our friends inadvertently. Even if it's just a little. Happy to see that they are good.",
            "author": "it-s-luminescent",
            "id": "hs1yf0o",
            "parent_id": "t3_s0gfql",
            "score": 106,
            "created_utc": 1641817163.0,
            "replies": [
                {
                    "body": ">The fact that JSM takes the initiative to do this - which we see is not business as usual - makes her kindness even more notable.\n\nI'm glad you pointed this part out. The cynic in me worried she was put up to this, but yeah, this hasn't happened before.\n\nI love all of the members and I hope they're all doing well.\n\nEDIT: I do think it's worth noting that some of what you're talking about in the other situation has happened a bit more since the PD change. It definitely should have happened sooner, but I'm hoping it will make a difference now.",
                    "author": "TopCoconut2",
                    "id": "hs4se6z",
                    "parent_id": "t1_hs1yf0o",
                    "score": 28,
                    "created_utc": 1641857451.0,
                    "replies": []
                },
                {
                    "body": "I agree she never really got that kind of public support when she has been bashed numerous amounts of times. I assume they’re gonna address this during the episode they shot today which is something I wish they had done for her.",
                    "author": "Purplesheart",
                    "id": "hs2sbr7",
                    "parent_id": "t1_hs1yf0o",
                    "score": 37,
                    "created_utc": 1641830720.0,
                    "replies": []
                },
                {
                    "body": "A-m-b-r-e-l-l-a ambrella! One of her best moments in RM for me",
                    "author": "tehpengss",
                    "id": "hs20rty",
                    "parent_id": "t1_hs1yf0o",
                    "score": 24,
                    "created_utc": 1641818562.0,
                    "replies": [
                        {
                            "body": "heheh Thanks for spotting that :)",
                            "author": "it-s-luminescent",
                            "id": "hs24tv5",
                            "parent_id": "t1_hs20rty",
                            "score": 3,
                            "created_utc": 1641820737.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yep! Such a bigger person act by her. I'm also of the opinion that there really wasn't anything to be so worked up about from that game. I get that it's probably not the best thing to bring up given JSM's past with that scumbag but neither did she seem so upset like how some are claiming to be. These two are good friends and she'll know most of all that he meant no malice.\n\nIts super awesome of her to just show everyone she's cool with YSC. And I agree with you as well about how for long I wished something similar could have been done for her throughout all those times she was suffering abuse. This just made me admire her more that at the slightest sign of trouble she immediately stood up for her friend.\n\nShe's a sweetheart ❤️",
                    "author": "fallin_light09",
                    "id": "hs2bw17",
                    "parent_id": "t1_hs1yf0o",
                    "score": 34,
                    "created_utc": 1641824097.0,
                    "replies": []
                },
                {
                    "body": "I completely agree. I was pretty disappointed that the veterans on the show did nothing to calm their massive and aggressive international fans down. I almost got the feeling that they were afraid of losing fans. I get that it's a tough position to be in but to see your colleague and hoobae suffer from that kind of abuse and harrassment and stay still doesn't sit well with me.",
                    "author": "flungoutofspace9",
                    "id": "hs3ytqn",
                    "parent_id": "t1_hs1yf0o",
                    "score": 32,
                    "created_utc": 1641846175.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "a calm sign for everyone, every entertainer had their bad moments, every people had their bad sides.",
            "author": "Shoddy-Ad-2140",
            "id": "hs1otcq",
            "parent_id": "t3_s0gfql",
            "score": 58,
            "created_utc": 1641810556.0,
            "replies": [
                {
                    "body": "Yes! And I'm sure Sechan already apologized about it. There's always room for growth.",
                    "author": "glassesinglamour",
                    "id": "hs1pk3w",
                    "parent_id": "t1_hs1otcq",
                    "score": 34,
                    "created_utc": 1641811119.0,
                    "replies": [
                        {
                            "body": "What happen?",
                            "author": "Mar7waN",
                            "id": "hs1wu6x",
                            "parent_id": "t1_hs1pk3w",
                            "score": 2,
                            "created_utc": 1641816195.0,
                            "replies": [
                                {
                                    "body": "Fans were uncomfortable about what happened in the latest episode's \"composure game\". They said SeChan went out of line for bringing up SoMin's ex-boyfriend.",
                                    "author": "glassesinglamour",
                                    "id": "hs1xhdi",
                                    "parent_id": "t1_hs1wu6x",
                                    "score": 20,
                                    "created_utc": 1641816585.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hs29zec",
                    "parent_id": "t1_hs1otcq",
                    "score": 0,
                    "created_utc": 1641823235.0,
                    "replies": [
                        {
                            "body": "it's obviously out of the line if you know the person they're talking about\n\ni'm not even forcing the issue, i'm just saying my thoughts here lmao",
                            "author": "Shoddy-Ad-2140",
                            "id": "hs2bgfa",
                            "parent_id": "t1_hs29zec",
                            "score": 25,
                            "created_utc": 1641823903.0,
                            "replies": [
                                {
                                    "body": "...who are they talking about? Not that I stay up to date with celebrity gossip, but I don't know how everyone is so informed all the time! Is there a good source to find these things out?",
                                    "author": "evieteafox",
                                    "id": "hs680cd",
                                    "parent_id": "t1_hs2bgfa",
                                    "score": 1,
                                    "created_utc": 1641879647.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yup. Rm fam who had bias tend to overreacting. Shame",
                            "author": "crisiman",
                            "id": "hs4jlqq",
                            "parent_id": "t1_hs29zec",
                            "score": 1,
                            "created_utc": 1641853893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Nah. Just people overreacting.",
                    "author": "NobleArch",
                    "id": "hs1xu75",
                    "parent_id": "t1_hs1otcq",
                    "score": -14,
                    "created_utc": 1641816805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As much as I want to say knetz over react again, this time, I think Sechan did being insensitive for the last question. I'm ok with the question about Sechan mentioning him and in contact with somin's ex but the question about Somin's kissing scene in her currently aired drama does remind her of her ex?   \n\n\nNow that's a bad question, considering how bad that relationship ends and how much Somin displayed her hatred for that relationship. Even the most like comment (1100+likes) at naver tv talking about this. But I'm sure Sechan and Somin are ok and that why Somin posted this picture to calm down the situation and I hope this will be a lesson for Sechan and RM teams.",
            "author": "honechan",
            "id": "hs2oe1v",
            "parent_id": "t3_s0gfql",
            "score": 45,
            "created_utc": 1641829226.0,
            "replies": []
        },
        {
            "body": "Lol I saw people saying she would post a pic with him to calm people down yesterday and sure enough she did. It’s small gesture but still sweet.",
            "author": "RumblesFish",
            "id": "hs2m8xw",
            "parent_id": "t3_s0gfql",
            "score": 27,
            "created_utc": 1641828380.0,
            "replies": []
        },
        {
            "body": "At the end of the day, this will be a learning experience for YSC. It can be difficult for comedians and entertainers to figure out where both the audience and other entertainers draw the line between a joke and something uncomfortable, and hopefully he took something away from all this. Whether or not JSM herself was offended, the fact that many viewers found it hard to watch is a sign that it was likely too far.",
            "author": "hicantics",
            "id": "hs31r5o",
            "parent_id": "t3_s0gfql",
            "score": 24,
            "created_utc": 1641834162.0,
            "replies": []
        },
        {
            "body": "So nice to see this.\n\nEven towards the end of the episode, we can see Sechan calling out for Somin to sit next to him. Maybe it was to tell her that he had no ill intentions and was focused only on winning.\n\nNevertheless, it's so good to see that these small things will not shake their friendship.\n\nAs viewers, we were worried that Somin might be hurt from this, but it's so nice of her to post these pics and let people know that \"All's well, that end's well\".",
            "author": "NavdeepNSG",
            "id": "hs23v57",
            "parent_id": "t3_s0gfql",
            "score": 19,
            "created_utc": 1641820231.0,
            "replies": []
        },
        {
            "body": "This means that they are still on good terms, they are okay based on this photo.",
            "author": "Foodieforreal",
            "id": "hs1m301",
            "parent_id": "t3_s0gfql",
            "score": 22,
            "created_utc": 1641808494.0,
            "replies": [
                {
                    "body": "Dudes been friends for more than they have been on RM, its funny how people think they know better than the ones involved in the matter, all to be angry i guess.",
                    "author": "ChickenMcPolloVS",
                    "id": "hs1mhd4",
                    "parent_id": "t1_hs1m301",
                    "score": 50,
                    "created_utc": 1641808803.0,
                    "replies": [
                        {
                            "body": "I dont think anyone expected her to hate YSC, but to acknowledge that if it was uncomfortable for viewers that it may have been VERY uncomfortable for her. The fact that the cast made a big deal about her reaction didn't help either. I don't think it would have been as big of a deal if they weren't all gushing over how hurt or angry she looked.\n\nI have friends I love but it doesn't mean they haven't said something hurtful to me in a moment - it may effect in the moment but then I move on. This doesn't mean I will hold grudge or dislike them.\n\nEdit: wording.",
                            "author": "Cre4t1v31",
                            "id": "hs57hyx",
                            "parent_id": "t1_hs1mhd4",
                            "score": 9,
                            "created_utc": 1641863816.0,
                            "replies": [
                                {
                                    "body": "It may, it may not, people here are just jumping to conclusions that she got hurt, we dont know only her and the cast know.\n\nIf we are gonna blame then we could blame most of the cast, they could have stop the game when she first reacted but they encourage them to keep going, you say they make it a big deal by gushing over it, its the same with the fans if they chill out a little and understand its a joke that they are friends and somin is an adult and if she found it unfunny, uncomfortable or whatever then is for her to ask an apology.",
                                    "author": "ChickenMcPolloVS",
                                    "id": "hs5ardd",
                                    "parent_id": "t1_hs57hyx",
                                    "score": 3,
                                    "created_utc": 1641865138.0,
                                    "replies": [
                                        {
                                            "body": "Everyone has a right to their opinion. If you are fine with it then that is fine, if people are uncomfortable with it then they have that right to that opinon too. People have differing opinions and comfort levels so this shouldn't come as a surprise \n\nRegardless, I don't think YSC deserves hate - but I don't see an issue with people pointing out that what he said was insensitive.",
                                            "author": "Cre4t1v31",
                                            "id": "hs5hjm4",
                                            "parent_id": "t1_hs5ardd",
                                            "score": 10,
                                            "created_utc": 1641867896.0,
                                            "replies": [
                                                {
                                                    "body": "I never say people arent allowed to their opinion, but people arent just saying they didnt like that segment, they are attacking him, and some are getting mad on behalf somin, which is just people jumping to conclusions.",
                                                    "author": "ChickenMcPolloVS",
                                                    "id": "hs5i3yt",
                                                    "parent_id": "t1_hs5hjm4",
                                                    "score": 3,
                                                    "created_utc": 1641868124.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
                                                            "author": "Cre4t1v31",
                                                            "id": "hs60jnt",
                                                            "parent_id": "t1_hs5i3yt",
                                                            "score": 7,
                                                            "created_utc": 1641875934.0,
                                                            "replies": [
                                                                {
                                                                    "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                                                                    "author": "Black_Crow-09",
                                                                    "id": "hs6m59z",
                                                                    "parent_id": "t1_hs60jnt",
                                                                    "score": 4,
                                                                    "created_utc": 1641889063.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's almost as if they are both professional entertainers who know what is real and what is done for the sake of variety.",
                    "author": "letuerk",
                    "id": "hs1q7qx",
                    "parent_id": "t1_hs1m301",
                    "score": 24,
                    "created_utc": 1641811603.0,
                    "replies": []
                },
                {
                    "body": "Obviously. People over this sub tend to overreactive for their bias.",
                    "author": "crisiman",
                    "id": "hs4juh7",
                    "parent_id": "t1_hs1m301",
                    "score": -6,
                    "created_utc": 1641853989.0,
                    "replies": [
                        {
                            "body": "Right. They are solo stan. They keep ruining the fun of the show. If they really care about sensitive issue, why dont they talk about when YJS calling JSJ a bad husband in this same ep? (Maybe it's not a big issue because this is only a man's marriage). Hypocrite at best.  \n\nApparently, only their bias never goes overboard. Only YSC makes mistake. No excuse, no explanation. Lets just hate. They dont even learn that this is the same hate their bias is suffering for years.",
                            "author": "Hydroinformatic",
                            "id": "hs637ay",
                            "parent_id": "t1_hs4juh7",
                            "score": 1,
                            "created_utc": 1641877159.0,
                            "replies": [
                                {
                                    "body": "Agree. I don’t care if they had bias or stan, but what i’m afraid if it’s affecting the show or ysc, they can’t be the real themselves anymore or they hesitate or lay back on jokes or teasing on screen.",
                                    "author": "crisiman",
                                    "id": "hs661w0",
                                    "parent_id": "t1_hs637ay",
                                    "score": -2,
                                    "created_utc": 1641878580.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Classy way to end the controversy by showing she's still okay with YSC.\n\nStill doesn't change what YSC did crossed line, but I hope both cast and crew know what boundaries they should not cross in the name of comedy.\n\nRM's been improving in last couple years by getting rid of painful and dangerous games and changing losing penalties to remove physical punishment so hope this incident will improve the show.\n\n&#x200B;\n\nEdit: more proofreading and fixing",
            "author": "gyojoo",
            "id": "hs3dry6",
            "parent_id": "t3_s0gfql",
            "score": 28,
            "created_utc": 1641838505.0,
            "replies": []
        },
        {
            "body": "The post is locked for moderation as the problems just moved from the episode guide post to this one instead. Overall people have kept it civil, but a bit too often it's gotten heated and it derails pretty fast after that. The post will be moderated and a decision on when to unlock it will come tomorrow.",
            "author": "BoneToBeWild",
            "id": "hs8jkyk",
            "parent_id": "t3_s0gfql",
            "score": 1,
            "created_utc": 1641924644.0,
            "replies": []
        },
        {
            "body": "I feel like fans were a bit overreacting on their interaction from the latest episode. If it truly made Somin uncomfortable in a serious way, they wouldn't have aired it. It was a fun banter between the two and people are just finding reasons to hate Sechan, unfortunately.",
            "author": "MFlash08",
            "id": "hs1n4q5",
            "parent_id": "t3_s0gfql",
            "score": 57,
            "created_utc": 1641809290.0,
            "replies": [
                {
                    "body": ">If it truly made Somin uncomfortable in a serious way, they wouldn't have aired it. \n\nProbably because it made the viewers uncomfortable, that’s why the viewers are raising it. It’s not a blame to be put on anyone. It’s for the production crew and possibly sechan to take note that certain things should not be aired or blurted out mindlessly, and it’s part of his learning curve to understand what jokes are suitable for CoBig (a gag show), what jokes are not suitable for a non-gag show on an international platform. He has a bigger responsibility for being on a bigger show. I’m sure RM members at one point had also gone through some sort of learning experience like this. \n\nPersonally for me, it’s the comment where sechan said “you are thinking of him when you are filming kissing scenes in the Show Window right”. As the drama is currently airing, it would cause some drama viewers to be unconsciously reminded of this statement whenever a kissing scene appears or possibly lead to inappropriate discussions because drama viewers heard this from RM. Sechan’s statement could possibly affect the drama and somin is not the only person whose career is involved - any discussions pertaining to the drama could affect the other actors as well (eg: attracting comments like there’s no chemistry between somin and her onscreen partner “because she is thinking about Y when doing this scene”, or the scene is so and so because “somin must be thinking of Y”. It’s a risky statement and most importantly, so unnecessary for a variety show game.",
                    "author": "S-J-A",
                    "id": "hs3hxnn",
                    "parent_id": "t1_hs1n4q5",
                    "score": 37,
                    "created_utc": 1641840022.0,
                    "replies": []
                },
                {
                    "body": "Its kind of weird how everyone thinks they know the characters they are seeing on the show, the cast have say multiple times that all of them act way different on camera yet some fans think that by seeing a heavy edited show for an hour and half somehow is the same as knowing them personally and make paragraphs of how somin should feel.",
                    "author": "ChickenMcPolloVS",
                    "id": "hs1nmun",
                    "parent_id": "t1_hs1n4q5",
                    "score": 36,
                    "created_utc": 1641809671.0,
                    "replies": [
                        {
                            "body": "Absolutely true. This fans  think of themselves way to much like bro chill out you don't even knew anything about them off camera.",
                            "author": "Dead-Shot1",
                            "id": "hs2ddm9",
                            "parent_id": "t1_hs1nmun",
                            "score": 14,
                            "created_utc": 1641824747.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Same here - I honestly didn't find it awkward or offensive til I read the thread after watching. I feel like they didn't notice how YSC wants to finish the game already but they (including) Somin kept pushing through it. Also, did they forget that Somin is an actress? Lol anyways all is well!",
                    "author": "hellobeee",
                    "id": "hs1nqx3",
                    "parent_id": "t1_hs1n4q5",
                    "score": 33,
                    "created_utc": 1641809754.0,
                    "replies": [
                        {
                            "body": "Right? I found it genuinely funny. Like there have been some otherworldly crazy Of Course games played on tv. I don't get why someone like Somin would challenge that game. Even the rest of the members were questioning why she would pitch that type of game as if she were good at it. Like she crushed Sechan in the crying game, should have stuck to that type of games. YJS should have called it after the first warning.  \n  \nI even rated the episode 4/5 because I thought it was so funny. It hurt getting to that thread after the lockdown, Sechan is my favorite member behind Haha.",
                            "author": "SpoonAtAGunFight",
                            "id": "hs1oxuo",
                            "parent_id": "t1_hs1nqx3",
                            "score": 21,
                            "created_utc": 1641810653.0,
                            "replies": [
                                {
                                    "body": "It hurts for me too - like Sechan struggled to fit in because he's way too nice at the beginning but now that he's more comfortable and can banter along, he is now offensive 😅 \n\nBut yeah, and the ex's name drop wasn't all of a sudden, he was hinting already by his other ofcourse lines like thinking of the ex while shooting her drama so I kinda expected Somin saw that coming because they're in that direction already. And fans probably forget that YSC and JSM are friends and hang out in real life - they aren't just co-workers. I rated the episode 4/5 too!",
                                    "author": "hellobeee",
                                    "id": "hs1xg9h",
                                    "parent_id": "t1_hs1oxuo",
                                    "score": 8,
                                    "created_utc": 1641816565.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It wasn’t just fans? Many people watched their interaction and felt uncomfortable with what Sechan said given the context of the situation. Sechan has gotten a lot of love from Korean fans lately so for a lot of comments to switch on him like that is more than just people trying to find a reason to hate him. Anyone who thought Somin would stop being friends with Sechan over this is completely naive. That doesn’t mean his comments didn’t cross the line even for a game.",
                    "author": "Purplesheart",
                    "id": "hs2rtfc",
                    "parent_id": "t1_hs1n4q5",
                    "score": 19,
                    "created_utc": 1641830528.0,
                    "replies": []
                },
                {
                    "body": "I'm very sure that if a RM member felt truly uncomfortable about something being aired and voiced out their concerns to the staff, they wouldn't air it. RM staff and cast have had a great relationship for literally a decade, and it's not by accident.",
                    "author": "etheryx",
                    "id": "hs1queo",
                    "parent_id": "t1_hs1n4q5",
                    "score": 18,
                    "created_utc": 1641812069.0,
                    "replies": []
                },
                {
                    "body": "Ehh, I'd like to disagree. Didn't look a \"fun banter\" to most people. JSM has gotten emotional many times now especially when her personal life's gotten involved. Heck, I don't even know why they had to keep bringing it up.\n\nBut on this, YSC seemed to be referring to a specific person which had a bad history with Somin.\n\nBut sure, if you think crossing other people's lines are \"fun banter\", then ok\n\nEdit: added a thought",
                    "author": "PotatoBulletGun",
                    "id": "hs1s20a",
                    "parent_id": "t1_hs1n4q5",
                    "score": 28,
                    "created_utc": 1641812959.0,
                    "replies": []
                },
                {
                    "body": "No, it was not a fun banter. Look closely, and you can find So-min wiping away her tears.\n\nYes, Se-chan had no ill intention but by no means, it was a fun banter. It became very personal, real quick.",
                    "author": "NavdeepNSG",
                    "id": "hs247b0",
                    "parent_id": "t1_hs1n4q5",
                    "score": 11,
                    "created_utc": 1641820409.0,
                    "replies": []
                },
                {
                    "body": "Same same. I get that the comments by YSC is sensitive (and I hope he will not bring that up again) but to say JSM was hurt and devastated by it was too overblown.\n\nIts ironic, because we keep saying that Blackpink fans were too soft when JSM was a bit \"aggressive\" with their idols. We are becoming a bit like them now don't we?",
                    "author": "Ideapad02",
                    "id": "hs1phof",
                    "parent_id": "t1_hs1n4q5",
                    "score": 7,
                    "created_utc": 1641811068.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually found that part funny except for the part about the kissing scene. It's not because of it being JSM's private life, but the fact that it may or may not affect her acting career and current drama. This part is something you would only joke to a close friend in private not in public especially on tv.\n\nThere has been a lot of shows where the private life of a cast would be brought up. I think some audiences are overreacting and speculating too much. I would go as far to say that some of the fans/viewers are just using this opportunity to badmouth YSC.",
            "author": "Beastyelectric",
            "id": "hs2qlsf",
            "parent_id": "t3_s0gfql",
            "score": 28,
            "created_utc": 1641830075.0,
            "replies": []
        },
        {
            "body": "Everyone pls take a chill pill",
            "author": "llamaowl",
            "id": "hs1m19v",
            "parent_id": "t3_s0gfql",
            "score": 26,
            "created_utc": 1641808457.0,
            "replies": []
        },
        {
            "body": "Hello all, the reason why the main thread was locked was that the arguments about this topic were going out of hand. Please maintain proper decorum while you engage in this topic so we can keep this thread open.\n\nPlease review our rules and avoid attacking other users and using ad hominem. Disagreements need not be mean or rude. Thanks.",
            "author": "wumikomiko",
            "id": "hs3ad2p",
            "parent_id": "t3_s0gfql",
            "score": 6,
            "created_utc": 1641837274.0,
            "replies": []
        },
        {
            "body": "It is disheartening to see some people invalidate the feelings of people, myself included, for not being comfortable with that segment that aired yesterday. I still feel that it wasn't right for him to bring up that matter and I am still disappointed, but I know it was more likely to be a thoughtless act than a malicious one. So, hope they cleared whatever they had to after and this is a sign from Somin that all is well now. :) Hopefully, such controversy won't happen again.\n\nEdit: Choose to agree to disagree. Don't invalidate how others feel and ask people to relax when they are upset over the matter just because you don't see anything wrong with it. It's not nice.",
            "author": "tooices",
            "id": "hs1pdcd",
            "parent_id": "t3_s0gfql",
            "score": 35,
            "created_utc": 1641810979.0,
            "replies": [
                {
                    "body": "I agree with you. I think there is different between members find it as a joke and how viewers seeing it. Some people may find it funny, but other may not. We shouldn't say which side is wrong because different people accept joke differently.",
                    "author": "WIZONE4LIFE",
                    "id": "hs2e16f",
                    "parent_id": "t1_hs1pdcd",
                    "score": 20,
                    "created_utc": 1641825030.0,
                    "replies": []
                },
                {
                    "body": "I do not think your feelings are being invalidated. It is that they are also expressing the way they saw what happened and they did not take it the way you did.",
                    "author": "bigmatch",
                    "id": "hs1v8y6",
                    "parent_id": "t1_hs1pdcd",
                    "score": 17,
                    "created_utc": 1641815180.0,
                    "replies": [
                        {
                            "body": "Oh! I'm fine with people who do not have the same views as I do. I can agree to disagree haha, but it was unpleasant to see comments calling us \"Karen\" or asking us to calm down just because it bothers us, yknow?",
                            "author": "tooices",
                            "id": "hs6lzwu",
                            "parent_id": "t1_hs1v8y6",
                            "score": 6,
                            "created_utc": 1641888949.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You shouldn't assume people are invalidating your feelings when all they're doing is expressing their take on the situation",
                    "author": "Slightly-Artsy",
                    "id": "hs2uyy6",
                    "parent_id": "t1_hs1pdcd",
                    "score": 7,
                    "created_utc": 1641831692.0,
                    "replies": [
                        {
                            "body": "If there are people that didn't intend on invalidating then that's good, but I have seen comments of people asking them or myself to \"not overreact\". There's a difference between expressing their thoughts that they do not find anything wrong with the situation and invalidating how others feel. \n\n\"I didn't think there was anything wrong with what he said\" VS \"People should calm down because there was nothing wrong\"",
                            "author": "tooices",
                            "id": "hs6lsq2",
                            "parent_id": "t1_hs2uyy6",
                            "score": 5,
                            "created_utc": 1641888796.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Except this is not about you and your feelings. You don’t even have anything to do with that situation, it only involves Somin and Sechan. Who both are clearly over it, if it ever even meant anything in the first place",
                    "author": "babymin",
                    "id": "hs3u9t7",
                    "parent_id": "t1_hs1pdcd",
                    "score": -1,
                    "created_utc": 1641844499.0,
                    "replies": [
                        {
                            "body": "I didn't know I am not allowed to feel anything as a viewer :O You'll never know if it did mean anything in the first place either so one can feel worried or unbothered about it. You don't need to invalidate how others might feel about the situation.",
                            "author": "tooices",
                            "id": "hs6ljv6",
                            "parent_id": "t1_hs3u9t7",
                            "score": 6,
                            "created_utc": 1641888604.0,
                            "replies": [
                                {
                                    "body": "You can feel however you want about it, but stop making this situation about your feelings. Somin posted the photo of her and Sechan to tell the likes of you that nothing bad happened and that they’re fine. Stop treating her as a child who needs coddling.",
                                    "author": "babymin",
                                    "id": "hs6tjgt",
                                    "parent_id": "t1_hs6ljv6",
                                    "score": 2,
                                    "created_utc": 1641895043.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hs1r8z8",
                    "parent_id": "t1_hs1pdcd",
                    "score": -1,
                    "created_utc": 1641812370.0,
                    "replies": [
                        {
                            "body": "Why? Does it seem like I'm a hater of SC after whatever happened? Because nah, I love the maknaes. Just gotta speak up when things aren't right mate.",
                            "author": "tooices",
                            "id": "hs1ryfj",
                            "parent_id": "t1_hs1r8z8",
                            "score": 17,
                            "created_utc": 1641812883.0,
                            "replies": []
                        },
                        {
                            "body": "Hello,\n\nThank you for your participation in r/runningman. Your post/comment fails to observe proper \"Rediquette\" or Rule No. 2.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                            "author": "BoneToBeWild",
                            "id": "hs39yuy",
                            "parent_id": "t1_hs1r8z8",
                            "score": 1,
                            "created_utc": 1641837138.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Go to Instagram, search for running man tag and see how people attacking YSC, revealing all the mistakes he has done in RM, saying no other member is worse than him, telling him to quit RM, not worth to be an RM member, cursing and much more cursing on YSC. \n\nMaybe there, you will be satisfied.",
                    "author": "Pyeonsae",
                    "id": "hs2byen",
                    "parent_id": "t1_hs1pdcd",
                    "score": -6,
                    "created_utc": 1641824127.0,
                    "replies": [
                        {
                            "body": "I don't partake in criticising him as a person or how he has performed in running man all these years because he was one of my favourite members. Neither do I support attacks sent to him because of what happened. \n\nI think you should see that not everyone that points out a mistake of others is out to bring them down and it is perhaps merely to help them improve as a person and be respectful to the people around them. \n\nCheers!",
                            "author": "tooices",
                            "id": "hs6maeg",
                            "parent_id": "t1_hs2byen",
                            "score": 7,
                            "created_utc": 1641889174.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "About the crossing the line issue,some said so and some said not. Whether it is crossing the line or not, shouldn't it be decided by the person involved? In this case, it's Somin who has right to decide whether Sechan crossed the line or not. Fans and viewers don't have that right. Both Somin and Sechan are old enough..37years old and in fact nearly 40. Crossing the line or not they knew better. \n\nThird party (us) should just chill and move on with our life.",
            "author": "onetwothreeand",
            "id": "hs6aus1",
            "parent_id": "t3_s0gfql",
            "score": 12,
            "created_utc": 1641881294.0,
            "replies": []
        },
        {
            "body": "That's good, I hope Sechan will take this as a learning experience for him, both are friends\n\nAll's well ends well, can't wait for the next episode",
            "author": "Stan_Yena99",
            "id": "hs5ppkh",
            "parent_id": "t3_s0gfql",
            "score": 11,
            "created_utc": 1641871248.0,
            "replies": []
        },
        {
            "body": "Its all good from the start itself,  sechan already said at start it just a game,  don't take seriously.  Its friend banter.  If he felt they have crossed the line,  he  would have apologized after segment don't shooting.   \n\nFans blow up the things wayy to much.  This fans are most toxic people i have ever scene like bro  don't you guys have  friend  long time friend  and sometimes to goes little above.  What you guys do then?  Say sorry and move on right.  Both of you even forget about that next day. \n\n\nThey act like they are the only people who can understand what their fav is feeling from TV screen and start blaming.",
            "author": "Dead-Shot1",
            "id": "hs2d2n8",
            "parent_id": "t3_s0gfql",
            "score": 16,
            "created_utc": 1641824613.0,
            "replies": [
                {
                    "body": "> bro don't you guys have friend long time friend and sometimes to goes little above\n\nhow often do you and your bros banter on national television? lol.",
                    "author": "botolsusu",
                    "id": "hs2uaza",
                    "parent_id": "t1_hs2d2n8",
                    "score": 22,
                    "created_utc": 1641831449.0,
                    "replies": [
                        {
                            "body": "Banter in friends is normal, even if they are celebrities. You want them to act different in real life and different on camera? It happens only when he both are close to each other.",
                            "author": "Dead-Shot1",
                            "id": "hs2wvxb",
                            "parent_id": "t1_hs2uaza",
                            "score": -2,
                            "created_utc": 1641832389.0,
                            "replies": [
                                {
                                    "body": "time and place dude. banter in a private place like a locker room and a public place like a restaurant would sound totally different.",
                                    "author": "botolsusu",
                                    "id": "hs2ygik",
                                    "parent_id": "t1_hs2wvxb",
                                    "score": 16,
                                    "created_utc": 1641832964.0,
                                    "replies": [
                                        {
                                            "body": "Ya that's why i said,  if any of them would feel offended because of that,  other will apologize cause it was done without any wrong intention and they will move on. \n\nWhat's the point of this fans  extending the issue? \nMaybe he apologized as soon as shoot ended, maybe they didn't even took it seriously as much as this fans took. who knows what happens behinds the scenes.  \n\nThe way i feel is this people want written apology to them when they are not even in conversations. Its between them,  misunderstanding happened, they will clear it between themselves. why other jump in that matter. \n\nI will never understand that.",
                                            "author": "Dead-Shot1",
                                            "id": "hs30svu",
                                            "parent_id": "t1_hs2ygik",
                                            "score": 5,
                                            "created_utc": 1641833817.0,
                                            "replies": [
                                                {
                                                    "body": "they're expressing that they won't accept that kind of humor, so hopefully maybe the members and the PDs will know what topics aren't acceptable. Haha had a national petition filed against him because he made fun of YJS (lol) and he stopped YSC from doing the same thing in a recent episode. LKS had the same thing happen with that AOA member and probably learnt to be more careful with female guests / PDs learnt to be more careful with editing.",
                                                    "author": "botolsusu",
                                                    "id": "hs32pj3",
                                                    "parent_id": "t1_hs30svu",
                                                    "score": 12,
                                                    "created_utc": 1641834504.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For me - and to be blunt here , so downvote me if you don't like it- if you are having an \"of course\" game, you have to be prepared for your past to be dug up and be verbally beaten up. \n\nRM won't be dumb enough to let names fly, but it has never been known to be kind towards the members. You think the members are there to be nice to each other?   \n\n\nWhile it's not an excuse for dangerous stunts like Sechan vacuuming YJS' ear, think about these : \n\n&#x200B;\n\n*  Do you think dipping YJS in mud was completely \"harmless\"? \n*  Do you think LKS swallowing food that has been in someone else's mouth is \"harmless\"?\n*  Do you think KJK's physical attack back then was \"harmless\"?\n*  Remember when LKS was legitimately pissed off when Haha completely scammed him to go to somewhere to meet a person whose criteria didn't even match the mission?\n*  Do you think publicly humiliating the member with over the top costumes (Kwangvatar, skinny pants in winter) was OK? \n* If you watch Outrun, do you know how Haha was legitimetely pissed when KJK promised to give Haha his immunity card only to tore it apart in front of the only man in RM whose courage is the size of a tardigrade? \n\n\"Oh but it is about past relationship and might hurt\"\n\n* **Do you think it's OK to bring up JSJ's marriage as a joke, especially with the secret bank account thing? Do some of you even aware of this skit? Do you treat this less seriously vs JSM's ex because it's the goddamn \"loser arabeoji Jee Seok Jin?\"**\n   *  Do you know how serious this can be on some marriages? Do you think  it's OK to risking his relationship with his wife but unacceptable to bring up past exes?\n   * Do you think portraying him as a bad, negligent family man is nice? Especially when it's repeated every month? \n\nYet our TikTok Grandpa takes it like a champ and sacrifices his whole dignity for the show. \n\n  \nAll I can say is that JSM is a good variety persona.  For all we know, JSM might be doing it for the show too and went with it, and she probably realized early that when Sechan started to dig up her past, she wouldn't stand a chance, so why don't just roll with it and making it funny for the audience to see her own suggested game backfired? It's a known variety technique that YJS often uses (overconfident to the point of epic fail in execution. \n\nDon't portray her as a fragile china vase FFS. She is not made of glass and you guys know that. You guys probably won't respond like this if SJH is treated the same just because she typically lashes out with violence /anger instead of crying. For all we know both RM girls are tough gals with different personalities that enrich the viewing experience. She often gets punished and take it like a champ, just like any other members. So why treat her like a such a vase that should be kept safe behind a lock?\n\nDownvote me, I don't  care. Crazy shit which were bordeline questionable happened back then in early RM, and digging up ex boyfriend for me is just mild. YSC was trying to win. His tactic is brutal but not the most outrageous thing that has happened in RM. \n\n&#x200B;\n\nMods - if you want to ban me for this comment I am welcome - just state the reason why I am wrong to post this and I'll be good. I just want people to not take RM too seriously like the members are doing a real squid game every week.",
            "author": "Kuuganism",
            "id": "hs6ei2i",
            "parent_id": "t3_s0gfql",
            "score": 14,
            "created_utc": 1641883573.0,
            "replies": []
        },
        {
            "body": "Can't wait for 588.",
            "author": "bigmatch",
            "id": "hs1pmdh",
            "parent_id": "t3_s0gfql",
            "score": 5,
            "created_utc": 1641811166.0,
            "replies": []
        },
        {
            "body": "Oh boy, people just need to take some time off social media in my opinion. Everyone is _ready_ to be offended over basically nothing.  \n\nThere are real problems out there that deserve your attention folks. Even if you just look at JSM there are people writing terrible stuff daily, those are the ones that deserve your criticism.  \nKind of reminds me of the shitstorm LKS got over that one joke to Hyejong.   \nThings just get blown out of proportion ...",
            "author": "letuerk",
            "id": "hs1q2y5",
            "parent_id": "t3_s0gfql",
            "score": 8,
            "created_utc": 1641811506.0,
            "replies": [
                {
                    "body": "Funny how petty gang flair is the least petty",
                    "author": "Slightly-Artsy",
                    "id": "hs2v2w2",
                    "parent_id": "t1_hs1q2y5",
                    "score": 2,
                    "created_utc": 1641831733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It would be nice if people stopped projecting their own issues into the cast members and making bs out of nothing. They are friends and know each other better than we know them and they are professionals on the show.  If you felt uncomfortable, then that’s on you, not on them.",
            "author": "real_highlight_reel",
            "id": "hs3gqkn",
            "parent_id": "t3_s0gfql",
            "score": 6,
            "created_utc": 1641839585.0,
            "replies": []
        },
        {
            "body": "Armchair psychologist malding",
            "author": "EuroDarer",
            "id": "hs1v5rw",
            "parent_id": "t3_s0gfql",
            "score": 3,
            "created_utc": 1641815121.0,
            "replies": []
        },
        {
            "body": "I’m going to pose one question for the whole sub. If what Sechan did was outright wrong and disgusting why did none of the cast react poorly and reprimanded sechan on the spot or if Somin or any of the cast members/PD/Writers felt it was too far why did the scene aired and not edited out to protect Somin? \n\nDo a bit of thinking and maybe you will know why. The fact that Somin has to do damage control even if she was/wasn’t fine in the first place will undoubtedly cause their friendship to turn even more sour.",
            "author": "Shin_Yuna",
            "id": "hs67qj2",
            "parent_id": "t3_s0gfql",
            "score": 3,
            "created_utc": 1641879494.0,
            "replies": []
        },
        {
            "body": "They are all close friends. And close friends all shit on each other. Somin is one that doesn't keep her composure. The whole running man team knows that and clearly sechan too esp when he alr warn repeatedly at the start that it's for jokes.\n\nThey throw out exes and past stuff so many times with other members like kwang soo and suk jin and all. This ain't any different.\n\nTime and time again, I emphasise the running man cast are a close family for so many years. Everything they do is played for laughs. They clearly do fight and argue bts as mentioned here and there but they always reconcile.\n\nThe fans are blowing everything up way too much when they clearly do it for laughs and ham it up more. Somin clearly will know that none of the members mean no harm.\n\nFans really need to chill and stop projecting. I don't get how this is not clear.  Whenever these kind of \"controversies\" come up, it honestly is ridiculous to me.\n\nEdit: it's fine to be uncomfortable with the segment but I think its ridiculous to think the members aren't a tightly knit group that joke ard a lot. They go overboard with each other all the time because they are close. That's what I find ridiculous.",
            "author": "ChilliWithFries",
            "id": "hs2cqfo",
            "parent_id": "t3_s0gfql",
            "score": 3,
            "created_utc": 1641824467.0,
            "replies": [
                {
                    "body": "Sorry, but you're saying \"Somin is one that doesn't keep her composure\" seems like you put the blames on her that this whole mess happens.",
                    "author": "honechan",
                    "id": "hs2wecj",
                    "parent_id": "t1_hs2cqfo",
                    "score": 20,
                    "created_utc": 1641832216.0,
                    "replies": [
                        {
                            "body": "I'm saying there's 0 blame on ANY MEMBERS. Even if she is hurt or any of the members, you think they won't resolve it behind the scenes? They are close friends, they do squabble and make up. \n\nI'm saying fans are the one blowing things up like now feeling like I'm putting the blame on somin when I have no intention of it. Somin's kind and soft hearted. YOU CAN TELL she's not the type to keep her composure because she wears her feelings on her sleeve. There's no blame here. The running man members says so. Sechan repeatedly say its a game because they know how she is.\n\nIt was a game and the only ones getting caught up in this ARE THE FANS. Did somin say anything? They are all such good friends and they will handle any feelings behind the scenes. Look at how jae suk takes care of somin after the loss. It's played up for laughs and the members will take care of each other behind the scenes. They all clearly love her and adore her. \n\nTHERE IS NO MESS. I hate these controversies cos they are just played up by fans. The running man cast is a tightly knit cast that cares about each other. You have so little faith in them being close friends that they can't handle a little mean spirit joke? Which they do to ALL THE MEMBERS. I'm sure they will make sure somin is okay cos that's what they are like. \n\nIt's a show where they wanna make people laugh. Stop taking these things so seriously god.",
                            "author": "ChilliWithFries",
                            "id": "hs33tse",
                            "parent_id": "t1_hs2wecj",
                            "score": 7,
                            "created_utc": 1641834912.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Its crazy how overprotective this sub is of Somin. She is a grown ass woman who can stand up for herself if she’s upset. People here are acting like idol fans",
            "author": "babymin",
            "id": "hs3ujuy",
            "parent_id": "t3_s0gfql",
            "score": -2,
            "created_utc": 1641844603.0,
            "replies": [
                {
                    "body": "Nah, not overprotective. I also felt uncomfortable watching that entire segment and im sure even the korean viewers found it the same which was why it even ended up making headlines. People are rightfully speaking up on why whatever Sechan said during the game was wrong. Its not only demeaning to Somin but also demeaning her professionalism as an actress. The worst is Sechan bringing up the ex-name, you could argue the staff bleep out the words so viewers couldnt hear but what about all the staff, stylists, managers who were there listening to the actual name being said.",
                    "author": "joant07012",
                    "id": "hs3xg0l",
                    "parent_id": "t1_hs3ujuy",
                    "score": 14,
                    "created_utc": 1641845667.0,
                    "replies": [
                        {
                            "body": "Please, it’s a game designed to hurt each other’s feelings, that’s the whole point of the game: to make the other person lose composure. It has always been personal. Somin is just a very emotional and responsive person, which is not a bad thing at all, but not suited to a game like this, which is why she couldn’t keep her composure and got flustered by Sechan’s attacks. I’m sure she got upset for a moment and then let it go, because she is a professional woman and not some 15 year old girl who can’t separate work from personal life. \n\nSechan obviously shouldn’t have mentioned his name, but if it’s the person who hurt Somin, then everybody already knew who he was. It doesn’t warrant all the hate he’s getting over this.",
                            "author": "babymin",
                            "id": "hs4len4",
                            "parent_id": "t1_hs3xg0l",
                            "score": -1,
                            "created_utc": 1641854607.0,
                            "replies": [
                                {
                                    "body": "There are some things that shouldn't be said no matter how close you are, nuffsaid. Just because it's a game to make people lose composure doesn't give him the free pass to bring up a traumatic situation, nor does it give him the pass to humilate her professionalism.",
                                    "author": "joant07012",
                                    "id": "hs5qfjh",
                                    "parent_id": "t1_hs4len4",
                                    "score": 9,
                                    "created_utc": 1641871546.0,
                                    "replies": [
                                        {
                                            "body": "Alright, where was this energy when  RM kept making fun of JSJ and his marriage? Just in this episode Somin stuck her hand up Haha’s ass, but that’s okay? Kwangsoo and Jongkook were literally undressed by members at different occasions, but it’s not crossing the line? Jaesuk and Sechan constantly getting ridiculed over their looks is alright? Where is the line? I don’t deny that Sechan could have been more careful, but if Somin was truly so upset  she would have stopped playing the game and just given up. So the only ones humiliating her professionalism here is people in this sub who think she’s some child that needs to be coddled. Give her some credit ffs.",
                                            "author": "babymin",
                                            "id": "hs6tyv0",
                                            "parent_id": "t1_hs5qfjh",
                                            "score": 6,
                                            "created_utc": 1641895404.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love Maknae Line <3\n\nEdit: Whoever downvoted me, your mom's a hoe <3",
            "author": "Crashingshores",
            "id": "hs4b8qm",
            "parent_id": "t3_s0gfql",
            "score": 2,
            "created_utc": 1641850749.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hs6s8u4",
            "parent_id": "t3_s0gfql",
            "score": 1,
            "created_utc": 1641893972.0,
            "replies": [
                {
                    "body": "Hi, your post has been removed by the automoderator due to multiple reports. However, I cannot approve your post due to the following:\n\n*- Inciteful language, specifically inciteful generalization of a fandom which violates* ***rule 5****.*\n\nYes, there is an observable backlash against Se-chan regarding this episode throughout several social media sites. You bring up a good point that **some** critics were not constructive and were just plain hateful.\n\nHowever, you cannot lump an entire fanbase on the comments of a few. I cannot attest to other platforms, but I can see in this subreddit that the hateful remarks have been a minority.\n\nNevertheless, whether the comments are constructive or the critics are a minority or not, I think it is very dangerous to advocate to cancel So-min solely because of her fans.\n\nSo-min is her own person. Whether you should support her or not has absolutely nothing to do with her fans. This goes for every celebrity and public figure.\n\nFeel free to reply to this post, but please review our rules before you do. Further rule violations will be dealt with harsher punitive functions.",
                    "author": "wumikomiko",
                    "id": "hs7vz0e",
                    "parent_id": "t1_hs6s8u4",
                    "score": 6,
                    "created_utc": 1641916003.0,
                    "replies": []
                },
                {
                    "body": "They are terrible for doing that to Somin’s bestie! Can you share links on hateful remarks so we can report?",
                    "author": "brightskyrun",
                    "id": "hs6xtji",
                    "parent_id": "t1_hs6s8u4",
                    "score": 1,
                    "created_utc": 1641898493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What happened??",
            "author": "shell2020",
            "id": "hs1rjvv",
            "parent_id": "t3_s0gfql",
            "score": 1,
            "created_utc": 1641812588.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hs4jgyh",
            "parent_id": "t3_s0gfql",
            "score": -1,
            "created_utc": 1641853842.0,
            "replies": [
                {
                    "body": "Hello,\n\nThank you for your participation in r/runningman. Your post/comment fails to observe proper \"Rediquette\" or Rule No. 2.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                    "author": "BoneToBeWild",
                    "id": "hs65egm",
                    "parent_id": "t1_hs4jgyh",
                    "score": 1,
                    "created_utc": 1641878245.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who??",
            "author": "Acherstrom",
            "id": "hs1vaj7",
            "parent_id": "t3_s0gfql",
            "score": -11,
            "created_utc": 1641815208.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hs2lkym",
            "parent_id": "t3_s0gfql",
            "score": 1,
            "created_utc": 1641828116.0,
            "replies": [
                {
                    "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nPlease refrain from calling people dumb. Thanks.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                    "author": "wumikomiko",
                    "id": "hs2nssc",
                    "parent_id": "t1_hs2lkym",
                    "score": 1,
                    "created_utc": 1641828998.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol yea its like people forgot how Somin is an actress that can cry on command. Its not even the worst thing theyve done to each other. Like KJK getting constantly teased about YEH, or how Seok Jin is a bad husband, or HAHA's youtube channel, or how Song Ji hyo's dating life. Or When Haha was forced to go on nevis swing by KJK and get slapped by him afterwards. https://www.youtube.com/watch?v=4tDY0FyxPm4\n\n\n\nThey are good friends, don't worry to much and cause rumors",
            "author": "netgames2000",
            "id": "hs49w0p",
            "parent_id": "t1_hs1mti1",
            "score": 12,
            "created_utc": 1641850246.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hs1x63b",
            "parent_id": "t1_hs1mti1",
            "score": 10,
            "created_utc": 1641816392.0,
            "replies": [
                {
                    "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**Please refrain from referring to fans as dumb, please. Thanks.**\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                    "author": "wumikomiko",
                    "id": "hs2o6cf",
                    "parent_id": "t1_hs1x63b",
                    "score": 4,
                    "created_utc": 1641829143.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">The fact that JSM takes the initiative to do this - which we see is not business as usual - makes her kindness even more notable.\n\nI'm glad you pointed this part out. The cynic in me worried she was put up to this, but yeah, this hasn't happened before.\n\nI love all of the members and I hope they're all doing well.\n\nEDIT: I do think it's worth noting that some of what you're talking about in the other situation has happened a bit more since the PD change. It definitely should have happened sooner, but I'm hoping it will make a difference now.",
            "author": "TopCoconut2",
            "id": "hs4se6z",
            "parent_id": "t1_hs1yf0o",
            "score": 28,
            "created_utc": 1641857451.0,
            "replies": []
        },
        {
            "body": "I agree she never really got that kind of public support when she has been bashed numerous amounts of times. I assume they’re gonna address this during the episode they shot today which is something I wish they had done for her.",
            "author": "Purplesheart",
            "id": "hs2sbr7",
            "parent_id": "t1_hs1yf0o",
            "score": 37,
            "created_utc": 1641830720.0,
            "replies": []
        },
        {
            "body": "A-m-b-r-e-l-l-a ambrella! One of her best moments in RM for me",
            "author": "tehpengss",
            "id": "hs20rty",
            "parent_id": "t1_hs1yf0o",
            "score": 24,
            "created_utc": 1641818562.0,
            "replies": [
                {
                    "body": "heheh Thanks for spotting that :)",
                    "author": "it-s-luminescent",
                    "id": "hs24tv5",
                    "parent_id": "t1_hs20rty",
                    "score": 3,
                    "created_utc": 1641820737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep! Such a bigger person act by her. I'm also of the opinion that there really wasn't anything to be so worked up about from that game. I get that it's probably not the best thing to bring up given JSM's past with that scumbag but neither did she seem so upset like how some are claiming to be. These two are good friends and she'll know most of all that he meant no malice.\n\nIts super awesome of her to just show everyone she's cool with YSC. And I agree with you as well about how for long I wished something similar could have been done for her throughout all those times she was suffering abuse. This just made me admire her more that at the slightest sign of trouble she immediately stood up for her friend.\n\nShe's a sweetheart ❤️",
            "author": "fallin_light09",
            "id": "hs2bw17",
            "parent_id": "t1_hs1yf0o",
            "score": 34,
            "created_utc": 1641824097.0,
            "replies": []
        },
        {
            "body": "I completely agree. I was pretty disappointed that the veterans on the show did nothing to calm their massive and aggressive international fans down. I almost got the feeling that they were afraid of losing fans. I get that it's a tough position to be in but to see your colleague and hoobae suffer from that kind of abuse and harrassment and stay still doesn't sit well with me.",
            "author": "flungoutofspace9",
            "id": "hs3ytqn",
            "parent_id": "t1_hs1yf0o",
            "score": 32,
            "created_utc": 1641846175.0,
            "replies": []
        },
        {
            "body": "Yes! And I'm sure Sechan already apologized about it. There's always room for growth.",
            "author": "glassesinglamour",
            "id": "hs1pk3w",
            "parent_id": "t1_hs1otcq",
            "score": 34,
            "created_utc": 1641811119.0,
            "replies": [
                {
                    "body": "What happen?",
                    "author": "Mar7waN",
                    "id": "hs1wu6x",
                    "parent_id": "t1_hs1pk3w",
                    "score": 2,
                    "created_utc": 1641816195.0,
                    "replies": [
                        {
                            "body": "Fans were uncomfortable about what happened in the latest episode's \"composure game\". They said SeChan went out of line for bringing up SoMin's ex-boyfriend.",
                            "author": "glassesinglamour",
                            "id": "hs1xhdi",
                            "parent_id": "t1_hs1wu6x",
                            "score": 20,
                            "created_utc": 1641816585.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hs29zec",
            "parent_id": "t1_hs1otcq",
            "score": 0,
            "created_utc": 1641823235.0,
            "replies": [
                {
                    "body": "it's obviously out of the line if you know the person they're talking about\n\ni'm not even forcing the issue, i'm just saying my thoughts here lmao",
                    "author": "Shoddy-Ad-2140",
                    "id": "hs2bgfa",
                    "parent_id": "t1_hs29zec",
                    "score": 25,
                    "created_utc": 1641823903.0,
                    "replies": [
                        {
                            "body": "...who are they talking about? Not that I stay up to date with celebrity gossip, but I don't know how everyone is so informed all the time! Is there a good source to find these things out?",
                            "author": "evieteafox",
                            "id": "hs680cd",
                            "parent_id": "t1_hs2bgfa",
                            "score": 1,
                            "created_utc": 1641879647.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yup. Rm fam who had bias tend to overreacting. Shame",
                    "author": "crisiman",
                    "id": "hs4jlqq",
                    "parent_id": "t1_hs29zec",
                    "score": 1,
                    "created_utc": 1641853893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah. Just people overreacting.",
            "author": "NobleArch",
            "id": "hs1xu75",
            "parent_id": "t1_hs1otcq",
            "score": -14,
            "created_utc": 1641816805.0,
            "replies": []
        },
        {
            "body": "Dudes been friends for more than they have been on RM, its funny how people think they know better than the ones involved in the matter, all to be angry i guess.",
            "author": "ChickenMcPolloVS",
            "id": "hs1mhd4",
            "parent_id": "t1_hs1m301",
            "score": 50,
            "created_utc": 1641808803.0,
            "replies": [
                {
                    "body": "I dont think anyone expected her to hate YSC, but to acknowledge that if it was uncomfortable for viewers that it may have been VERY uncomfortable for her. The fact that the cast made a big deal about her reaction didn't help either. I don't think it would have been as big of a deal if they weren't all gushing over how hurt or angry she looked.\n\nI have friends I love but it doesn't mean they haven't said something hurtful to me in a moment - it may effect in the moment but then I move on. This doesn't mean I will hold grudge or dislike them.\n\nEdit: wording.",
                    "author": "Cre4t1v31",
                    "id": "hs57hyx",
                    "parent_id": "t1_hs1mhd4",
                    "score": 9,
                    "created_utc": 1641863816.0,
                    "replies": [
                        {
                            "body": "It may, it may not, people here are just jumping to conclusions that she got hurt, we dont know only her and the cast know.\n\nIf we are gonna blame then we could blame most of the cast, they could have stop the game when she first reacted but they encourage them to keep going, you say they make it a big deal by gushing over it, its the same with the fans if they chill out a little and understand its a joke that they are friends and somin is an adult and if she found it unfunny, uncomfortable or whatever then is for her to ask an apology.",
                            "author": "ChickenMcPolloVS",
                            "id": "hs5ardd",
                            "parent_id": "t1_hs57hyx",
                            "score": 3,
                            "created_utc": 1641865138.0,
                            "replies": [
                                {
                                    "body": "Everyone has a right to their opinion. If you are fine with it then that is fine, if people are uncomfortable with it then they have that right to that opinon too. People have differing opinions and comfort levels so this shouldn't come as a surprise \n\nRegardless, I don't think YSC deserves hate - but I don't see an issue with people pointing out that what he said was insensitive.",
                                    "author": "Cre4t1v31",
                                    "id": "hs5hjm4",
                                    "parent_id": "t1_hs5ardd",
                                    "score": 10,
                                    "created_utc": 1641867896.0,
                                    "replies": [
                                        {
                                            "body": "I never say people arent allowed to their opinion, but people arent just saying they didnt like that segment, they are attacking him, and some are getting mad on behalf somin, which is just people jumping to conclusions.",
                                            "author": "ChickenMcPolloVS",
                                            "id": "hs5i3yt",
                                            "parent_id": "t1_hs5hjm4",
                                            "score": 3,
                                            "created_utc": 1641868124.0,
                                            "replies": [
                                                {
                                                    "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
                                                    "author": "Cre4t1v31",
                                                    "id": "hs60jnt",
                                                    "parent_id": "t1_hs5i3yt",
                                                    "score": 7,
                                                    "created_utc": 1641875934.0,
                                                    "replies": [
                                                        {
                                                            "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                                                            "author": "Black_Crow-09",
                                                            "id": "hs6m59z",
                                                            "parent_id": "t1_hs60jnt",
                                                            "score": 4,
                                                            "created_utc": 1641889063.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's almost as if they are both professional entertainers who know what is real and what is done for the sake of variety.",
            "author": "letuerk",
            "id": "hs1q7qx",
            "parent_id": "t1_hs1m301",
            "score": 24,
            "created_utc": 1641811603.0,
            "replies": []
        },
        {
            "body": "Obviously. People over this sub tend to overreactive for their bias.",
            "author": "crisiman",
            "id": "hs4juh7",
            "parent_id": "t1_hs1m301",
            "score": -6,
            "created_utc": 1641853989.0,
            "replies": [
                {
                    "body": "Right. They are solo stan. They keep ruining the fun of the show. If they really care about sensitive issue, why dont they talk about when YJS calling JSJ a bad husband in this same ep? (Maybe it's not a big issue because this is only a man's marriage). Hypocrite at best.  \n\nApparently, only their bias never goes overboard. Only YSC makes mistake. No excuse, no explanation. Lets just hate. They dont even learn that this is the same hate their bias is suffering for years.",
                    "author": "Hydroinformatic",
                    "id": "hs637ay",
                    "parent_id": "t1_hs4juh7",
                    "score": 1,
                    "created_utc": 1641877159.0,
                    "replies": [
                        {
                            "body": "Agree. I don’t care if they had bias or stan, but what i’m afraid if it’s affecting the show or ysc, they can’t be the real themselves anymore or they hesitate or lay back on jokes or teasing on screen.",
                            "author": "crisiman",
                            "id": "hs661w0",
                            "parent_id": "t1_hs637ay",
                            "score": -2,
                            "created_utc": 1641878580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">If it truly made Somin uncomfortable in a serious way, they wouldn't have aired it. \n\nProbably because it made the viewers uncomfortable, that’s why the viewers are raising it. It’s not a blame to be put on anyone. It’s for the production crew and possibly sechan to take note that certain things should not be aired or blurted out mindlessly, and it’s part of his learning curve to understand what jokes are suitable for CoBig (a gag show), what jokes are not suitable for a non-gag show on an international platform. He has a bigger responsibility for being on a bigger show. I’m sure RM members at one point had also gone through some sort of learning experience like this. \n\nPersonally for me, it’s the comment where sechan said “you are thinking of him when you are filming kissing scenes in the Show Window right”. As the drama is currently airing, it would cause some drama viewers to be unconsciously reminded of this statement whenever a kissing scene appears or possibly lead to inappropriate discussions because drama viewers heard this from RM. Sechan’s statement could possibly affect the drama and somin is not the only person whose career is involved - any discussions pertaining to the drama could affect the other actors as well (eg: attracting comments like there’s no chemistry between somin and her onscreen partner “because she is thinking about Y when doing this scene”, or the scene is so and so because “somin must be thinking of Y”. It’s a risky statement and most importantly, so unnecessary for a variety show game.",
            "author": "S-J-A",
            "id": "hs3hxnn",
            "parent_id": "t1_hs1n4q5",
            "score": 37,
            "created_utc": 1641840022.0,
            "replies": []
        },
        {
            "body": "Its kind of weird how everyone thinks they know the characters they are seeing on the show, the cast have say multiple times that all of them act way different on camera yet some fans think that by seeing a heavy edited show for an hour and half somehow is the same as knowing them personally and make paragraphs of how somin should feel.",
            "author": "ChickenMcPolloVS",
            "id": "hs1nmun",
            "parent_id": "t1_hs1n4q5",
            "score": 36,
            "created_utc": 1641809671.0,
            "replies": [
                {
                    "body": "Absolutely true. This fans  think of themselves way to much like bro chill out you don't even knew anything about them off camera.",
                    "author": "Dead-Shot1",
                    "id": "hs2ddm9",
                    "parent_id": "t1_hs1nmun",
                    "score": 14,
                    "created_utc": 1641824747.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same here - I honestly didn't find it awkward or offensive til I read the thread after watching. I feel like they didn't notice how YSC wants to finish the game already but they (including) Somin kept pushing through it. Also, did they forget that Somin is an actress? Lol anyways all is well!",
            "author": "hellobeee",
            "id": "hs1nqx3",
            "parent_id": "t1_hs1n4q5",
            "score": 33,
            "created_utc": 1641809754.0,
            "replies": [
                {
                    "body": "Right? I found it genuinely funny. Like there have been some otherworldly crazy Of Course games played on tv. I don't get why someone like Somin would challenge that game. Even the rest of the members were questioning why she would pitch that type of game as if she were good at it. Like she crushed Sechan in the crying game, should have stuck to that type of games. YJS should have called it after the first warning.  \n  \nI even rated the episode 4/5 because I thought it was so funny. It hurt getting to that thread after the lockdown, Sechan is my favorite member behind Haha.",
                    "author": "SpoonAtAGunFight",
                    "id": "hs1oxuo",
                    "parent_id": "t1_hs1nqx3",
                    "score": 21,
                    "created_utc": 1641810653.0,
                    "replies": [
                        {
                            "body": "It hurts for me too - like Sechan struggled to fit in because he's way too nice at the beginning but now that he's more comfortable and can banter along, he is now offensive 😅 \n\nBut yeah, and the ex's name drop wasn't all of a sudden, he was hinting already by his other ofcourse lines like thinking of the ex while shooting her drama so I kinda expected Somin saw that coming because they're in that direction already. And fans probably forget that YSC and JSM are friends and hang out in real life - they aren't just co-workers. I rated the episode 4/5 too!",
                            "author": "hellobeee",
                            "id": "hs1xg9h",
                            "parent_id": "t1_hs1oxuo",
                            "score": 8,
                            "created_utc": 1641816565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It wasn’t just fans? Many people watched their interaction and felt uncomfortable with what Sechan said given the context of the situation. Sechan has gotten a lot of love from Korean fans lately so for a lot of comments to switch on him like that is more than just people trying to find a reason to hate him. Anyone who thought Somin would stop being friends with Sechan over this is completely naive. That doesn’t mean his comments didn’t cross the line even for a game.",
            "author": "Purplesheart",
            "id": "hs2rtfc",
            "parent_id": "t1_hs1n4q5",
            "score": 19,
            "created_utc": 1641830528.0,
            "replies": []
        },
        {
            "body": "I'm very sure that if a RM member felt truly uncomfortable about something being aired and voiced out their concerns to the staff, they wouldn't air it. RM staff and cast have had a great relationship for literally a decade, and it's not by accident.",
            "author": "etheryx",
            "id": "hs1queo",
            "parent_id": "t1_hs1n4q5",
            "score": 18,
            "created_utc": 1641812069.0,
            "replies": []
        },
        {
            "body": "Ehh, I'd like to disagree. Didn't look a \"fun banter\" to most people. JSM has gotten emotional many times now especially when her personal life's gotten involved. Heck, I don't even know why they had to keep bringing it up.\n\nBut on this, YSC seemed to be referring to a specific person which had a bad history with Somin.\n\nBut sure, if you think crossing other people's lines are \"fun banter\", then ok\n\nEdit: added a thought",
            "author": "PotatoBulletGun",
            "id": "hs1s20a",
            "parent_id": "t1_hs1n4q5",
            "score": 28,
            "created_utc": 1641812959.0,
            "replies": []
        },
        {
            "body": "No, it was not a fun banter. Look closely, and you can find So-min wiping away her tears.\n\nYes, Se-chan had no ill intention but by no means, it was a fun banter. It became very personal, real quick.",
            "author": "NavdeepNSG",
            "id": "hs247b0",
            "parent_id": "t1_hs1n4q5",
            "score": 11,
            "created_utc": 1641820409.0,
            "replies": []
        },
        {
            "body": "Same same. I get that the comments by YSC is sensitive (and I hope he will not bring that up again) but to say JSM was hurt and devastated by it was too overblown.\n\nIts ironic, because we keep saying that Blackpink fans were too soft when JSM was a bit \"aggressive\" with their idols. We are becoming a bit like them now don't we?",
            "author": "Ideapad02",
            "id": "hs1phof",
            "parent_id": "t1_hs1n4q5",
            "score": 7,
            "created_utc": 1641811068.0,
            "replies": []
        },
        {
            "body": "I agree with you. I think there is different between members find it as a joke and how viewers seeing it. Some people may find it funny, but other may not. We shouldn't say which side is wrong because different people accept joke differently.",
            "author": "WIZONE4LIFE",
            "id": "hs2e16f",
            "parent_id": "t1_hs1pdcd",
            "score": 20,
            "created_utc": 1641825030.0,
            "replies": []
        },
        {
            "body": "I do not think your feelings are being invalidated. It is that they are also expressing the way they saw what happened and they did not take it the way you did.",
            "author": "bigmatch",
            "id": "hs1v8y6",
            "parent_id": "t1_hs1pdcd",
            "score": 17,
            "created_utc": 1641815180.0,
            "replies": [
                {
                    "body": "Oh! I'm fine with people who do not have the same views as I do. I can agree to disagree haha, but it was unpleasant to see comments calling us \"Karen\" or asking us to calm down just because it bothers us, yknow?",
                    "author": "tooices",
                    "id": "hs6lzwu",
                    "parent_id": "t1_hs1v8y6",
                    "score": 6,
                    "created_utc": 1641888949.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You shouldn't assume people are invalidating your feelings when all they're doing is expressing their take on the situation",
            "author": "Slightly-Artsy",
            "id": "hs2uyy6",
            "parent_id": "t1_hs1pdcd",
            "score": 7,
            "created_utc": 1641831692.0,
            "replies": [
                {
                    "body": "If there are people that didn't intend on invalidating then that's good, but I have seen comments of people asking them or myself to \"not overreact\". There's a difference between expressing their thoughts that they do not find anything wrong with the situation and invalidating how others feel. \n\n\"I didn't think there was anything wrong with what he said\" VS \"People should calm down because there was nothing wrong\"",
                    "author": "tooices",
                    "id": "hs6lsq2",
                    "parent_id": "t1_hs2uyy6",
                    "score": 5,
                    "created_utc": 1641888796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Except this is not about you and your feelings. You don’t even have anything to do with that situation, it only involves Somin and Sechan. Who both are clearly over it, if it ever even meant anything in the first place",
            "author": "babymin",
            "id": "hs3u9t7",
            "parent_id": "t1_hs1pdcd",
            "score": -1,
            "created_utc": 1641844499.0,
            "replies": [
                {
                    "body": "I didn't know I am not allowed to feel anything as a viewer :O You'll never know if it did mean anything in the first place either so one can feel worried or unbothered about it. You don't need to invalidate how others might feel about the situation.",
                    "author": "tooices",
                    "id": "hs6ljv6",
                    "parent_id": "t1_hs3u9t7",
                    "score": 6,
                    "created_utc": 1641888604.0,
                    "replies": [
                        {
                            "body": "You can feel however you want about it, but stop making this situation about your feelings. Somin posted the photo of her and Sechan to tell the likes of you that nothing bad happened and that they’re fine. Stop treating her as a child who needs coddling.",
                            "author": "babymin",
                            "id": "hs6tjgt",
                            "parent_id": "t1_hs6ljv6",
                            "score": 2,
                            "created_utc": 1641895043.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hs1r8z8",
            "parent_id": "t1_hs1pdcd",
            "score": -1,
            "created_utc": 1641812370.0,
            "replies": [
                {
                    "body": "Why? Does it seem like I'm a hater of SC after whatever happened? Because nah, I love the maknaes. Just gotta speak up when things aren't right mate.",
                    "author": "tooices",
                    "id": "hs1ryfj",
                    "parent_id": "t1_hs1r8z8",
                    "score": 17,
                    "created_utc": 1641812883.0,
                    "replies": []
                },
                {
                    "body": "Hello,\n\nThank you for your participation in r/runningman. Your post/comment fails to observe proper \"Rediquette\" or Rule No. 2.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
                    "author": "BoneToBeWild",
                    "id": "hs39yuy",
                    "parent_id": "t1_hs1r8z8",
                    "score": 1,
                    "created_utc": 1641837138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go to Instagram, search for running man tag and see how people attacking YSC, revealing all the mistakes he has done in RM, saying no other member is worse than him, telling him to quit RM, not worth to be an RM member, cursing and much more cursing on YSC. \n\nMaybe there, you will be satisfied.",
            "author": "Pyeonsae",
            "id": "hs2byen",
            "parent_id": "t1_hs1pdcd",
            "score": -6,
            "created_utc": 1641824127.0,
            "replies": [
                {
                    "body": "I don't partake in criticising him as a person or how he has performed in running man all these years because he was one of my favourite members. Neither do I support attacks sent to him because of what happened. \n\nI think you should see that not everyone that points out a mistake of others is out to bring them down and it is perhaps merely to help them improve as a person and be respectful to the people around them. \n\nCheers!",
                    "author": "tooices",
                    "id": "hs6maeg",
                    "parent_id": "t1_hs2byen",
                    "score": 7,
                    "created_utc": 1641889174.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> bro don't you guys have friend long time friend and sometimes to goes little above\n\nhow often do you and your bros banter on national television? lol.",
            "author": "botolsusu",
            "id": "hs2uaza",
            "parent_id": "t1_hs2d2n8",
            "score": 22,
            "created_utc": 1641831449.0,
            "replies": [
                {
                    "body": "Banter in friends is normal, even if they are celebrities. You want them to act different in real life and different on camera? It happens only when he both are close to each other.",
                    "author": "Dead-Shot1",
                    "id": "hs2wvxb",
                    "parent_id": "t1_hs2uaza",
                    "score": -2,
                    "created_utc": 1641832389.0,
                    "replies": [
                        {
                            "body": "time and place dude. banter in a private place like a locker room and a public place like a restaurant would sound totally different.",
                            "author": "botolsusu",
                            "id": "hs2ygik",
                            "parent_id": "t1_hs2wvxb",
                            "score": 16,
                            "created_utc": 1641832964.0,
                            "replies": [
                                {
                                    "body": "Ya that's why i said,  if any of them would feel offended because of that,  other will apologize cause it was done without any wrong intention and they will move on. \n\nWhat's the point of this fans  extending the issue? \nMaybe he apologized as soon as shoot ended, maybe they didn't even took it seriously as much as this fans took. who knows what happens behinds the scenes.  \n\nThe way i feel is this people want written apology to them when they are not even in conversations. Its between them,  misunderstanding happened, they will clear it between themselves. why other jump in that matter. \n\nI will never understand that.",
                                    "author": "Dead-Shot1",
                                    "id": "hs30svu",
                                    "parent_id": "t1_hs2ygik",
                                    "score": 5,
                                    "created_utc": 1641833817.0,
                                    "replies": [
                                        {
                                            "body": "they're expressing that they won't accept that kind of humor, so hopefully maybe the members and the PDs will know what topics aren't acceptable. Haha had a national petition filed against him because he made fun of YJS (lol) and he stopped YSC from doing the same thing in a recent episode. LKS had the same thing happen with that AOA member and probably learnt to be more careful with female guests / PDs learnt to be more careful with editing.",
                                            "author": "botolsusu",
                                            "id": "hs32pj3",
                                            "parent_id": "t1_hs30svu",
                                            "score": 12,
                                            "created_utc": 1641834504.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Funny how petty gang flair is the least petty",
            "author": "Slightly-Artsy",
            "id": "hs2v2w2",
            "parent_id": "t1_hs1q2y5",
            "score": 2,
            "created_utc": 1641831733.0,
            "replies": []
        },
        {
            "body": "Sorry, but you're saying \"Somin is one that doesn't keep her composure\" seems like you put the blames on her that this whole mess happens.",
            "author": "honechan",
            "id": "hs2wecj",
            "parent_id": "t1_hs2cqfo",
            "score": 20,
            "created_utc": 1641832216.0,
            "replies": [
                {
                    "body": "I'm saying there's 0 blame on ANY MEMBERS. Even if she is hurt or any of the members, you think they won't resolve it behind the scenes? They are close friends, they do squabble and make up. \n\nI'm saying fans are the one blowing things up like now feeling like I'm putting the blame on somin when I have no intention of it. Somin's kind and soft hearted. YOU CAN TELL she's not the type to keep her composure because she wears her feelings on her sleeve. There's no blame here. The running man members says so. Sechan repeatedly say its a game because they know how she is.\n\nIt was a game and the only ones getting caught up in this ARE THE FANS. Did somin say anything? They are all such good friends and they will handle any feelings behind the scenes. Look at how jae suk takes care of somin after the loss. It's played up for laughs and the members will take care of each other behind the scenes. They all clearly love her and adore her. \n\nTHERE IS NO MESS. I hate these controversies cos they are just played up by fans. The running man cast is a tightly knit cast that cares about each other. You have so little faith in them being close friends that they can't handle a little mean spirit joke? Which they do to ALL THE MEMBERS. I'm sure they will make sure somin is okay cos that's what they are like. \n\nIt's a show where they wanna make people laugh. Stop taking these things so seriously god.",
                    "author": "ChilliWithFries",
                    "id": "hs33tse",
                    "parent_id": "t1_hs2wecj",
                    "score": 7,
                    "created_utc": 1641834912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah, not overprotective. I also felt uncomfortable watching that entire segment and im sure even the korean viewers found it the same which was why it even ended up making headlines. People are rightfully speaking up on why whatever Sechan said during the game was wrong. Its not only demeaning to Somin but also demeaning her professionalism as an actress. The worst is Sechan bringing up the ex-name, you could argue the staff bleep out the words so viewers couldnt hear but what about all the staff, stylists, managers who were there listening to the actual name being said.",
            "author": "joant07012",
            "id": "hs3xg0l",
            "parent_id": "t1_hs3ujuy",
            "score": 14,
            "created_utc": 1641845667.0,
            "replies": [
                {
                    "body": "Please, it’s a game designed to hurt each other’s feelings, that’s the whole point of the game: to make the other person lose composure. It has always been personal. Somin is just a very emotional and responsive person, which is not a bad thing at all, but not suited to a game like this, which is why she couldn’t keep her composure and got flustered by Sechan’s attacks. I’m sure she got upset for a moment and then let it go, because she is a professional woman and not some 15 year old girl who can’t separate work from personal life. \n\nSechan obviously shouldn’t have mentioned his name, but if it’s the person who hurt Somin, then everybody already knew who he was. It doesn’t warrant all the hate he’s getting over this.",
                    "author": "babymin",
                    "id": "hs4len4",
                    "parent_id": "t1_hs3xg0l",
                    "score": -1,
                    "created_utc": 1641854607.0,
                    "replies": [
                        {
                            "body": "There are some things that shouldn't be said no matter how close you are, nuffsaid. Just because it's a game to make people lose composure doesn't give him the free pass to bring up a traumatic situation, nor does it give him the pass to humilate her professionalism.",
                            "author": "joant07012",
                            "id": "hs5qfjh",
                            "parent_id": "t1_hs4len4",
                            "score": 9,
                            "created_utc": 1641871546.0,
                            "replies": [
                                {
                                    "body": "Alright, where was this energy when  RM kept making fun of JSJ and his marriage? Just in this episode Somin stuck her hand up Haha’s ass, but that’s okay? Kwangsoo and Jongkook were literally undressed by members at different occasions, but it’s not crossing the line? Jaesuk and Sechan constantly getting ridiculed over their looks is alright? Where is the line? I don’t deny that Sechan could have been more careful, but if Somin was truly so upset  she would have stopped playing the game and just given up. So the only ones humiliating her professionalism here is people in this sub who think she’s some child that needs to be coddled. Give her some credit ffs.",
                                    "author": "babymin",
                                    "id": "hs6tyv0",
                                    "parent_id": "t1_hs5qfjh",
                                    "score": 6,
                                    "created_utc": 1641895404.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hi, your post has been removed by the automoderator due to multiple reports. However, I cannot approve your post due to the following:\n\n*- Inciteful language, specifically inciteful generalization of a fandom which violates* ***rule 5****.*\n\nYes, there is an observable backlash against Se-chan regarding this episode throughout several social media sites. You bring up a good point that **some** critics were not constructive and were just plain hateful.\n\nHowever, you cannot lump an entire fanbase on the comments of a few. I cannot attest to other platforms, but I can see in this subreddit that the hateful remarks have been a minority.\n\nNevertheless, whether the comments are constructive or the critics are a minority or not, I think it is very dangerous to advocate to cancel So-min solely because of her fans.\n\nSo-min is her own person. Whether you should support her or not has absolutely nothing to do with her fans. This goes for every celebrity and public figure.\n\nFeel free to reply to this post, but please review our rules before you do. Further rule violations will be dealt with harsher punitive functions.",
            "author": "wumikomiko",
            "id": "hs7vz0e",
            "parent_id": "t1_hs6s8u4",
            "score": 6,
            "created_utc": 1641916003.0,
            "replies": []
        },
        {
            "body": "They are terrible for doing that to Somin’s bestie! Can you share links on hateful remarks so we can report?",
            "author": "brightskyrun",
            "id": "hs6xtji",
            "parent_id": "t1_hs6s8u4",
            "score": 1,
            "created_utc": 1641898493.0,
            "replies": []
        },
        {
            "body": "Hello,\n\nThank you for your participation in r/runningman. Your post/comment fails to observe proper \"Rediquette\" or Rule No. 2.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
            "author": "BoneToBeWild",
            "id": "hs65egm",
            "parent_id": "t1_hs4jgyh",
            "score": 1,
            "created_utc": 1641878245.0,
            "replies": []
        },
        {
            "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nPlease refrain from calling people dumb. Thanks.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
            "author": "wumikomiko",
            "id": "hs2nssc",
            "parent_id": "t1_hs2lkym",
            "score": 1,
            "created_utc": 1641828998.0,
            "replies": []
        },
        {
            "body": "Hello, \n\nThank you for your participation in r/runningman. Your post/comment violates our subreddit's rules, specifically Rule No. 5 regarding \"toxicity, toxic-baiting, or drama-baiting\" that states:\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\n**Please refrain from referring to fans as dumb, please. Thanks.**\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
            "author": "wumikomiko",
            "id": "hs2o6cf",
            "parent_id": "t1_hs1x63b",
            "score": 4,
            "created_utc": 1641829143.0,
            "replies": []
        },
        {
            "body": "heheh Thanks for spotting that :)",
            "author": "it-s-luminescent",
            "id": "hs24tv5",
            "parent_id": "t1_hs20rty",
            "score": 3,
            "created_utc": 1641820737.0,
            "replies": []
        },
        {
            "body": "What happen?",
            "author": "Mar7waN",
            "id": "hs1wu6x",
            "parent_id": "t1_hs1pk3w",
            "score": 2,
            "created_utc": 1641816195.0,
            "replies": [
                {
                    "body": "Fans were uncomfortable about what happened in the latest episode's \"composure game\". They said SeChan went out of line for bringing up SoMin's ex-boyfriend.",
                    "author": "glassesinglamour",
                    "id": "hs1xhdi",
                    "parent_id": "t1_hs1wu6x",
                    "score": 20,
                    "created_utc": 1641816585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it's obviously out of the line if you know the person they're talking about\n\ni'm not even forcing the issue, i'm just saying my thoughts here lmao",
            "author": "Shoddy-Ad-2140",
            "id": "hs2bgfa",
            "parent_id": "t1_hs29zec",
            "score": 25,
            "created_utc": 1641823903.0,
            "replies": [
                {
                    "body": "...who are they talking about? Not that I stay up to date with celebrity gossip, but I don't know how everyone is so informed all the time! Is there a good source to find these things out?",
                    "author": "evieteafox",
                    "id": "hs680cd",
                    "parent_id": "t1_hs2bgfa",
                    "score": 1,
                    "created_utc": 1641879647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup. Rm fam who had bias tend to overreacting. Shame",
            "author": "crisiman",
            "id": "hs4jlqq",
            "parent_id": "t1_hs29zec",
            "score": 1,
            "created_utc": 1641853893.0,
            "replies": []
        },
        {
            "body": "I dont think anyone expected her to hate YSC, but to acknowledge that if it was uncomfortable for viewers that it may have been VERY uncomfortable for her. The fact that the cast made a big deal about her reaction didn't help either. I don't think it would have been as big of a deal if they weren't all gushing over how hurt or angry she looked.\n\nI have friends I love but it doesn't mean they haven't said something hurtful to me in a moment - it may effect in the moment but then I move on. This doesn't mean I will hold grudge or dislike them.\n\nEdit: wording.",
            "author": "Cre4t1v31",
            "id": "hs57hyx",
            "parent_id": "t1_hs1mhd4",
            "score": 9,
            "created_utc": 1641863816.0,
            "replies": [
                {
                    "body": "It may, it may not, people here are just jumping to conclusions that she got hurt, we dont know only her and the cast know.\n\nIf we are gonna blame then we could blame most of the cast, they could have stop the game when she first reacted but they encourage them to keep going, you say they make it a big deal by gushing over it, its the same with the fans if they chill out a little and understand its a joke that they are friends and somin is an adult and if she found it unfunny, uncomfortable or whatever then is for her to ask an apology.",
                    "author": "ChickenMcPolloVS",
                    "id": "hs5ardd",
                    "parent_id": "t1_hs57hyx",
                    "score": 3,
                    "created_utc": 1641865138.0,
                    "replies": [
                        {
                            "body": "Everyone has a right to their opinion. If you are fine with it then that is fine, if people are uncomfortable with it then they have that right to that opinon too. People have differing opinions and comfort levels so this shouldn't come as a surprise \n\nRegardless, I don't think YSC deserves hate - but I don't see an issue with people pointing out that what he said was insensitive.",
                            "author": "Cre4t1v31",
                            "id": "hs5hjm4",
                            "parent_id": "t1_hs5ardd",
                            "score": 10,
                            "created_utc": 1641867896.0,
                            "replies": [
                                {
                                    "body": "I never say people arent allowed to their opinion, but people arent just saying they didnt like that segment, they are attacking him, and some are getting mad on behalf somin, which is just people jumping to conclusions.",
                                    "author": "ChickenMcPolloVS",
                                    "id": "hs5i3yt",
                                    "parent_id": "t1_hs5hjm4",
                                    "score": 3,
                                    "created_utc": 1641868124.0,
                                    "replies": [
                                        {
                                            "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
                                            "author": "Cre4t1v31",
                                            "id": "hs60jnt",
                                            "parent_id": "t1_hs5i3yt",
                                            "score": 7,
                                            "created_utc": 1641875934.0,
                                            "replies": [
                                                {
                                                    "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                                                    "author": "Black_Crow-09",
                                                    "id": "hs6m59z",
                                                    "parent_id": "t1_hs60jnt",
                                                    "score": 4,
                                                    "created_utc": 1641889063.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right. They are solo stan. They keep ruining the fun of the show. If they really care about sensitive issue, why dont they talk about when YJS calling JSJ a bad husband in this same ep? (Maybe it's not a big issue because this is only a man's marriage). Hypocrite at best.  \n\nApparently, only their bias never goes overboard. Only YSC makes mistake. No excuse, no explanation. Lets just hate. They dont even learn that this is the same hate their bias is suffering for years.",
            "author": "Hydroinformatic",
            "id": "hs637ay",
            "parent_id": "t1_hs4juh7",
            "score": 1,
            "created_utc": 1641877159.0,
            "replies": [
                {
                    "body": "Agree. I don’t care if they had bias or stan, but what i’m afraid if it’s affecting the show or ysc, they can’t be the real themselves anymore or they hesitate or lay back on jokes or teasing on screen.",
                    "author": "crisiman",
                    "id": "hs661w0",
                    "parent_id": "t1_hs637ay",
                    "score": -2,
                    "created_utc": 1641878580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely true. This fans  think of themselves way to much like bro chill out you don't even knew anything about them off camera.",
            "author": "Dead-Shot1",
            "id": "hs2ddm9",
            "parent_id": "t1_hs1nmun",
            "score": 14,
            "created_utc": 1641824747.0,
            "replies": []
        },
        {
            "body": "Right? I found it genuinely funny. Like there have been some otherworldly crazy Of Course games played on tv. I don't get why someone like Somin would challenge that game. Even the rest of the members were questioning why she would pitch that type of game as if she were good at it. Like she crushed Sechan in the crying game, should have stuck to that type of games. YJS should have called it after the first warning.  \n  \nI even rated the episode 4/5 because I thought it was so funny. It hurt getting to that thread after the lockdown, Sechan is my favorite member behind Haha.",
            "author": "SpoonAtAGunFight",
            "id": "hs1oxuo",
            "parent_id": "t1_hs1nqx3",
            "score": 21,
            "created_utc": 1641810653.0,
            "replies": [
                {
                    "body": "It hurts for me too - like Sechan struggled to fit in because he's way too nice at the beginning but now that he's more comfortable and can banter along, he is now offensive 😅 \n\nBut yeah, and the ex's name drop wasn't all of a sudden, he was hinting already by his other ofcourse lines like thinking of the ex while shooting her drama so I kinda expected Somin saw that coming because they're in that direction already. And fans probably forget that YSC and JSM are friends and hang out in real life - they aren't just co-workers. I rated the episode 4/5 too!",
                    "author": "hellobeee",
                    "id": "hs1xg9h",
                    "parent_id": "t1_hs1oxuo",
                    "score": 8,
                    "created_utc": 1641816565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh! I'm fine with people who do not have the same views as I do. I can agree to disagree haha, but it was unpleasant to see comments calling us \"Karen\" or asking us to calm down just because it bothers us, yknow?",
            "author": "tooices",
            "id": "hs6lzwu",
            "parent_id": "t1_hs1v8y6",
            "score": 6,
            "created_utc": 1641888949.0,
            "replies": []
        },
        {
            "body": "If there are people that didn't intend on invalidating then that's good, but I have seen comments of people asking them or myself to \"not overreact\". There's a difference between expressing their thoughts that they do not find anything wrong with the situation and invalidating how others feel. \n\n\"I didn't think there was anything wrong with what he said\" VS \"People should calm down because there was nothing wrong\"",
            "author": "tooices",
            "id": "hs6lsq2",
            "parent_id": "t1_hs2uyy6",
            "score": 5,
            "created_utc": 1641888796.0,
            "replies": []
        },
        {
            "body": "I didn't know I am not allowed to feel anything as a viewer :O You'll never know if it did mean anything in the first place either so one can feel worried or unbothered about it. You don't need to invalidate how others might feel about the situation.",
            "author": "tooices",
            "id": "hs6ljv6",
            "parent_id": "t1_hs3u9t7",
            "score": 6,
            "created_utc": 1641888604.0,
            "replies": [
                {
                    "body": "You can feel however you want about it, but stop making this situation about your feelings. Somin posted the photo of her and Sechan to tell the likes of you that nothing bad happened and that they’re fine. Stop treating her as a child who needs coddling.",
                    "author": "babymin",
                    "id": "hs6tjgt",
                    "parent_id": "t1_hs6ljv6",
                    "score": 2,
                    "created_utc": 1641895043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why? Does it seem like I'm a hater of SC after whatever happened? Because nah, I love the maknaes. Just gotta speak up when things aren't right mate.",
            "author": "tooices",
            "id": "hs1ryfj",
            "parent_id": "t1_hs1r8z8",
            "score": 17,
            "created_utc": 1641812883.0,
            "replies": []
        },
        {
            "body": "Hello,\n\nThank you for your participation in r/runningman. Your post/comment fails to observe proper \"Rediquette\" or Rule No. 2.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.",
            "author": "BoneToBeWild",
            "id": "hs39yuy",
            "parent_id": "t1_hs1r8z8",
            "score": 1,
            "created_utc": 1641837138.0,
            "replies": []
        },
        {
            "body": "I don't partake in criticising him as a person or how he has performed in running man all these years because he was one of my favourite members. Neither do I support attacks sent to him because of what happened. \n\nI think you should see that not everyone that points out a mistake of others is out to bring them down and it is perhaps merely to help them improve as a person and be respectful to the people around them. \n\nCheers!",
            "author": "tooices",
            "id": "hs6maeg",
            "parent_id": "t1_hs2byen",
            "score": 7,
            "created_utc": 1641889174.0,
            "replies": []
        },
        {
            "body": "Banter in friends is normal, even if they are celebrities. You want them to act different in real life and different on camera? It happens only when he both are close to each other.",
            "author": "Dead-Shot1",
            "id": "hs2wvxb",
            "parent_id": "t1_hs2uaza",
            "score": -2,
            "created_utc": 1641832389.0,
            "replies": [
                {
                    "body": "time and place dude. banter in a private place like a locker room and a public place like a restaurant would sound totally different.",
                    "author": "botolsusu",
                    "id": "hs2ygik",
                    "parent_id": "t1_hs2wvxb",
                    "score": 16,
                    "created_utc": 1641832964.0,
                    "replies": [
                        {
                            "body": "Ya that's why i said,  if any of them would feel offended because of that,  other will apologize cause it was done without any wrong intention and they will move on. \n\nWhat's the point of this fans  extending the issue? \nMaybe he apologized as soon as shoot ended, maybe they didn't even took it seriously as much as this fans took. who knows what happens behinds the scenes.  \n\nThe way i feel is this people want written apology to them when they are not even in conversations. Its between them,  misunderstanding happened, they will clear it between themselves. why other jump in that matter. \n\nI will never understand that.",
                            "author": "Dead-Shot1",
                            "id": "hs30svu",
                            "parent_id": "t1_hs2ygik",
                            "score": 5,
                            "created_utc": 1641833817.0,
                            "replies": [
                                {
                                    "body": "they're expressing that they won't accept that kind of humor, so hopefully maybe the members and the PDs will know what topics aren't acceptable. Haha had a national petition filed against him because he made fun of YJS (lol) and he stopped YSC from doing the same thing in a recent episode. LKS had the same thing happen with that AOA member and probably learnt to be more careful with female guests / PDs learnt to be more careful with editing.",
                                    "author": "botolsusu",
                                    "id": "hs32pj3",
                                    "parent_id": "t1_hs30svu",
                                    "score": 12,
                                    "created_utc": 1641834504.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm saying there's 0 blame on ANY MEMBERS. Even if she is hurt or any of the members, you think they won't resolve it behind the scenes? They are close friends, they do squabble and make up. \n\nI'm saying fans are the one blowing things up like now feeling like I'm putting the blame on somin when I have no intention of it. Somin's kind and soft hearted. YOU CAN TELL she's not the type to keep her composure because she wears her feelings on her sleeve. There's no blame here. The running man members says so. Sechan repeatedly say its a game because they know how she is.\n\nIt was a game and the only ones getting caught up in this ARE THE FANS. Did somin say anything? They are all such good friends and they will handle any feelings behind the scenes. Look at how jae suk takes care of somin after the loss. It's played up for laughs and the members will take care of each other behind the scenes. They all clearly love her and adore her. \n\nTHERE IS NO MESS. I hate these controversies cos they are just played up by fans. The running man cast is a tightly knit cast that cares about each other. You have so little faith in them being close friends that they can't handle a little mean spirit joke? Which they do to ALL THE MEMBERS. I'm sure they will make sure somin is okay cos that's what they are like. \n\nIt's a show where they wanna make people laugh. Stop taking these things so seriously god.",
            "author": "ChilliWithFries",
            "id": "hs33tse",
            "parent_id": "t1_hs2wecj",
            "score": 7,
            "created_utc": 1641834912.0,
            "replies": []
        },
        {
            "body": "Please, it’s a game designed to hurt each other’s feelings, that’s the whole point of the game: to make the other person lose composure. It has always been personal. Somin is just a very emotional and responsive person, which is not a bad thing at all, but not suited to a game like this, which is why she couldn’t keep her composure and got flustered by Sechan’s attacks. I’m sure she got upset for a moment and then let it go, because she is a professional woman and not some 15 year old girl who can’t separate work from personal life. \n\nSechan obviously shouldn’t have mentioned his name, but if it’s the person who hurt Somin, then everybody already knew who he was. It doesn’t warrant all the hate he’s getting over this.",
            "author": "babymin",
            "id": "hs4len4",
            "parent_id": "t1_hs3xg0l",
            "score": -1,
            "created_utc": 1641854607.0,
            "replies": [
                {
                    "body": "There are some things that shouldn't be said no matter how close you are, nuffsaid. Just because it's a game to make people lose composure doesn't give him the free pass to bring up a traumatic situation, nor does it give him the pass to humilate her professionalism.",
                    "author": "joant07012",
                    "id": "hs5qfjh",
                    "parent_id": "t1_hs4len4",
                    "score": 9,
                    "created_utc": 1641871546.0,
                    "replies": [
                        {
                            "body": "Alright, where was this energy when  RM kept making fun of JSJ and his marriage? Just in this episode Somin stuck her hand up Haha’s ass, but that’s okay? Kwangsoo and Jongkook were literally undressed by members at different occasions, but it’s not crossing the line? Jaesuk and Sechan constantly getting ridiculed over their looks is alright? Where is the line? I don’t deny that Sechan could have been more careful, but if Somin was truly so upset  she would have stopped playing the game and just given up. So the only ones humiliating her professionalism here is people in this sub who think she’s some child that needs to be coddled. Give her some credit ffs.",
                            "author": "babymin",
                            "id": "hs6tyv0",
                            "parent_id": "t1_hs5qfjh",
                            "score": 6,
                            "created_utc": 1641895404.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fans were uncomfortable about what happened in the latest episode's \"composure game\". They said SeChan went out of line for bringing up SoMin's ex-boyfriend.",
            "author": "glassesinglamour",
            "id": "hs1xhdi",
            "parent_id": "t1_hs1wu6x",
            "score": 20,
            "created_utc": 1641816585.0,
            "replies": []
        },
        {
            "body": "...who are they talking about? Not that I stay up to date with celebrity gossip, but I don't know how everyone is so informed all the time! Is there a good source to find these things out?",
            "author": "evieteafox",
            "id": "hs680cd",
            "parent_id": "t1_hs2bgfa",
            "score": 1,
            "created_utc": 1641879647.0,
            "replies": []
        },
        {
            "body": "It may, it may not, people here are just jumping to conclusions that she got hurt, we dont know only her and the cast know.\n\nIf we are gonna blame then we could blame most of the cast, they could have stop the game when she first reacted but they encourage them to keep going, you say they make it a big deal by gushing over it, its the same with the fans if they chill out a little and understand its a joke that they are friends and somin is an adult and if she found it unfunny, uncomfortable or whatever then is for her to ask an apology.",
            "author": "ChickenMcPolloVS",
            "id": "hs5ardd",
            "parent_id": "t1_hs57hyx",
            "score": 3,
            "created_utc": 1641865138.0,
            "replies": [
                {
                    "body": "Everyone has a right to their opinion. If you are fine with it then that is fine, if people are uncomfortable with it then they have that right to that opinon too. People have differing opinions and comfort levels so this shouldn't come as a surprise \n\nRegardless, I don't think YSC deserves hate - but I don't see an issue with people pointing out that what he said was insensitive.",
                    "author": "Cre4t1v31",
                    "id": "hs5hjm4",
                    "parent_id": "t1_hs5ardd",
                    "score": 10,
                    "created_utc": 1641867896.0,
                    "replies": [
                        {
                            "body": "I never say people arent allowed to their opinion, but people arent just saying they didnt like that segment, they are attacking him, and some are getting mad on behalf somin, which is just people jumping to conclusions.",
                            "author": "ChickenMcPolloVS",
                            "id": "hs5i3yt",
                            "parent_id": "t1_hs5hjm4",
                            "score": 3,
                            "created_utc": 1641868124.0,
                            "replies": [
                                {
                                    "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
                                    "author": "Cre4t1v31",
                                    "id": "hs60jnt",
                                    "parent_id": "t1_hs5i3yt",
                                    "score": 7,
                                    "created_utc": 1641875934.0,
                                    "replies": [
                                        {
                                            "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                                            "author": "Black_Crow-09",
                                            "id": "hs6m59z",
                                            "parent_id": "t1_hs60jnt",
                                            "score": 4,
                                            "created_utc": 1641889063.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree. I don’t care if they had bias or stan, but what i’m afraid if it’s affecting the show or ysc, they can’t be the real themselves anymore or they hesitate or lay back on jokes or teasing on screen.",
            "author": "crisiman",
            "id": "hs661w0",
            "parent_id": "t1_hs637ay",
            "score": -2,
            "created_utc": 1641878580.0,
            "replies": []
        },
        {
            "body": "It hurts for me too - like Sechan struggled to fit in because he's way too nice at the beginning but now that he's more comfortable and can banter along, he is now offensive 😅 \n\nBut yeah, and the ex's name drop wasn't all of a sudden, he was hinting already by his other ofcourse lines like thinking of the ex while shooting her drama so I kinda expected Somin saw that coming because they're in that direction already. And fans probably forget that YSC and JSM are friends and hang out in real life - they aren't just co-workers. I rated the episode 4/5 too!",
            "author": "hellobeee",
            "id": "hs1xg9h",
            "parent_id": "t1_hs1oxuo",
            "score": 8,
            "created_utc": 1641816565.0,
            "replies": []
        },
        {
            "body": "You can feel however you want about it, but stop making this situation about your feelings. Somin posted the photo of her and Sechan to tell the likes of you that nothing bad happened and that they’re fine. Stop treating her as a child who needs coddling.",
            "author": "babymin",
            "id": "hs6tjgt",
            "parent_id": "t1_hs6ljv6",
            "score": 2,
            "created_utc": 1641895043.0,
            "replies": []
        },
        {
            "body": "time and place dude. banter in a private place like a locker room and a public place like a restaurant would sound totally different.",
            "author": "botolsusu",
            "id": "hs2ygik",
            "parent_id": "t1_hs2wvxb",
            "score": 16,
            "created_utc": 1641832964.0,
            "replies": [
                {
                    "body": "Ya that's why i said,  if any of them would feel offended because of that,  other will apologize cause it was done without any wrong intention and they will move on. \n\nWhat's the point of this fans  extending the issue? \nMaybe he apologized as soon as shoot ended, maybe they didn't even took it seriously as much as this fans took. who knows what happens behinds the scenes.  \n\nThe way i feel is this people want written apology to them when they are not even in conversations. Its between them,  misunderstanding happened, they will clear it between themselves. why other jump in that matter. \n\nI will never understand that.",
                    "author": "Dead-Shot1",
                    "id": "hs30svu",
                    "parent_id": "t1_hs2ygik",
                    "score": 5,
                    "created_utc": 1641833817.0,
                    "replies": [
                        {
                            "body": "they're expressing that they won't accept that kind of humor, so hopefully maybe the members and the PDs will know what topics aren't acceptable. Haha had a national petition filed against him because he made fun of YJS (lol) and he stopped YSC from doing the same thing in a recent episode. LKS had the same thing happen with that AOA member and probably learnt to be more careful with female guests / PDs learnt to be more careful with editing.",
                            "author": "botolsusu",
                            "id": "hs32pj3",
                            "parent_id": "t1_hs30svu",
                            "score": 12,
                            "created_utc": 1641834504.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There are some things that shouldn't be said no matter how close you are, nuffsaid. Just because it's a game to make people lose composure doesn't give him the free pass to bring up a traumatic situation, nor does it give him the pass to humilate her professionalism.",
            "author": "joant07012",
            "id": "hs5qfjh",
            "parent_id": "t1_hs4len4",
            "score": 9,
            "created_utc": 1641871546.0,
            "replies": [
                {
                    "body": "Alright, where was this energy when  RM kept making fun of JSJ and his marriage? Just in this episode Somin stuck her hand up Haha’s ass, but that’s okay? Kwangsoo and Jongkook were literally undressed by members at different occasions, but it’s not crossing the line? Jaesuk and Sechan constantly getting ridiculed over their looks is alright? Where is the line? I don’t deny that Sechan could have been more careful, but if Somin was truly so upset  she would have stopped playing the game and just given up. So the only ones humiliating her professionalism here is people in this sub who think she’s some child that needs to be coddled. Give her some credit ffs.",
                    "author": "babymin",
                    "id": "hs6tyv0",
                    "parent_id": "t1_hs5qfjh",
                    "score": 6,
                    "created_utc": 1641895404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone has a right to their opinion. If you are fine with it then that is fine, if people are uncomfortable with it then they have that right to that opinon too. People have differing opinions and comfort levels so this shouldn't come as a surprise \n\nRegardless, I don't think YSC deserves hate - but I don't see an issue with people pointing out that what he said was insensitive.",
            "author": "Cre4t1v31",
            "id": "hs5hjm4",
            "parent_id": "t1_hs5ardd",
            "score": 10,
            "created_utc": 1641867896.0,
            "replies": [
                {
                    "body": "I never say people arent allowed to their opinion, but people arent just saying they didnt like that segment, they are attacking him, and some are getting mad on behalf somin, which is just people jumping to conclusions.",
                    "author": "ChickenMcPolloVS",
                    "id": "hs5i3yt",
                    "parent_id": "t1_hs5hjm4",
                    "score": 3,
                    "created_utc": 1641868124.0,
                    "replies": [
                        {
                            "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
                            "author": "Cre4t1v31",
                            "id": "hs60jnt",
                            "parent_id": "t1_hs5i3yt",
                            "score": 7,
                            "created_utc": 1641875934.0,
                            "replies": [
                                {
                                    "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                                    "author": "Black_Crow-09",
                                    "id": "hs6m59z",
                                    "parent_id": "t1_hs60jnt",
                                    "score": 4,
                                    "created_utc": 1641889063.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ya that's why i said,  if any of them would feel offended because of that,  other will apologize cause it was done without any wrong intention and they will move on. \n\nWhat's the point of this fans  extending the issue? \nMaybe he apologized as soon as shoot ended, maybe they didn't even took it seriously as much as this fans took. who knows what happens behinds the scenes.  \n\nThe way i feel is this people want written apology to them when they are not even in conversations. Its between them,  misunderstanding happened, they will clear it between themselves. why other jump in that matter. \n\nI will never understand that.",
            "author": "Dead-Shot1",
            "id": "hs30svu",
            "parent_id": "t1_hs2ygik",
            "score": 5,
            "created_utc": 1641833817.0,
            "replies": [
                {
                    "body": "they're expressing that they won't accept that kind of humor, so hopefully maybe the members and the PDs will know what topics aren't acceptable. Haha had a national petition filed against him because he made fun of YJS (lol) and he stopped YSC from doing the same thing in a recent episode. LKS had the same thing happen with that AOA member and probably learnt to be more careful with female guests / PDs learnt to be more careful with editing.",
                    "author": "botolsusu",
                    "id": "hs32pj3",
                    "parent_id": "t1_hs30svu",
                    "score": 12,
                    "created_utc": 1641834504.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Alright, where was this energy when  RM kept making fun of JSJ and his marriage? Just in this episode Somin stuck her hand up Haha’s ass, but that’s okay? Kwangsoo and Jongkook were literally undressed by members at different occasions, but it’s not crossing the line? Jaesuk and Sechan constantly getting ridiculed over their looks is alright? Where is the line? I don’t deny that Sechan could have been more careful, but if Somin was truly so upset  she would have stopped playing the game and just given up. So the only ones humiliating her professionalism here is people in this sub who think she’s some child that needs to be coddled. Give her some credit ffs.",
            "author": "babymin",
            "id": "hs6tyv0",
            "parent_id": "t1_hs5qfjh",
            "score": 6,
            "created_utc": 1641895404.0,
            "replies": []
        },
        {
            "body": "I never say people arent allowed to their opinion, but people arent just saying they didnt like that segment, they are attacking him, and some are getting mad on behalf somin, which is just people jumping to conclusions.",
            "author": "ChickenMcPolloVS",
            "id": "hs5i3yt",
            "parent_id": "t1_hs5hjm4",
            "score": 3,
            "created_utc": 1641868124.0,
            "replies": [
                {
                    "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
                    "author": "Cre4t1v31",
                    "id": "hs60jnt",
                    "parent_id": "t1_hs5i3yt",
                    "score": 7,
                    "created_utc": 1641875934.0,
                    "replies": [
                        {
                            "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                            "author": "Black_Crow-09",
                            "id": "hs6m59z",
                            "parent_id": "t1_hs60jnt",
                            "score": 4,
                            "created_utc": 1641889063.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "they're expressing that they won't accept that kind of humor, so hopefully maybe the members and the PDs will know what topics aren't acceptable. Haha had a national petition filed against him because he made fun of YJS (lol) and he stopped YSC from doing the same thing in a recent episode. LKS had the same thing happen with that AOA member and probably learnt to be more careful with female guests / PDs learnt to be more careful with editing.",
            "author": "botolsusu",
            "id": "hs32pj3",
            "parent_id": "t1_hs30svu",
            "score": 12,
            "created_utc": 1641834504.0,
            "replies": []
        },
        {
            "body": "I am purely commenting on the concept of some viewers not liking the subject matter he brought up and being able to express their dislike - which is fair, but sending him hate for this is immature. 🙄\n\nThose people are real dummies 🤦‍♀️ and take it too far with the hate. He had a lapse of judgement in a small moment and was a bit insensitive but I feel like that is the extent of it. That doesn't make him deserving of whatever hate he is recieveing now. As long as he and Somin are good then people should move on.",
            "author": "Cre4t1v31",
            "id": "hs60jnt",
            "parent_id": "t1_hs5i3yt",
            "score": 7,
            "created_utc": 1641875934.0,
            "replies": [
                {
                    "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
                    "author": "Black_Crow-09",
                    "id": "hs6m59z",
                    "parent_id": "t1_hs60jnt",
                    "score": 4,
                    "created_utc": 1641889063.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And besides I know what Se Chan did was uncomfortable but I think it was okay to the cast and the staffs like I mean they could have edited that game if they are not okay with it and even Jae Suk did not stop or warn Se Chan from saying those things and there are many episodes where Jae Suk stop the cast members from saying something to the cast or the guest\n\n(Sorry for the poor english)",
            "author": "Black_Crow-09",
            "id": "hs6m59z",
            "parent_id": "t1_hs60jnt",
            "score": 4,
            "created_utc": 1641889063.0,
            "replies": []
        }
    ]
}