{
    "title": "Did I really get this lucky?",
    "post_id": "egxd4p",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/egxd4p/did_i_really_get_this_lucky/",
    "author": null,
    "body": "So i'm relaxing in a nice hot bath right now while my new SD takes a nap after our little fun session. We went to the zoo today, had an absolute blast. He insisted I pick out whatever I wanted from the gift shop so I got a cute turtle ring and an elephant shot glass. We came to the hotel, he didn't bring a condom so no PIV. He will be better prepared next time (he did not pressure me AT ALL to have sex without one). Before we got intimate I asked for my allowance and he immediately pulled it out and handed it to me and invited me to count it. He also told me whatever I want I just need to ask for. Obviously I won't abuse this, but now I don't have to feel guilty about asking. During this date another POT I had a great M&G with a week ago texted wanting to arrange our first date (he was away for the holidays). I think he has just as much potential as my current date. I think I have had my SA account reactivated for two weeks. I just deactivated it. Two SD will be enough to keep me busy and with plenty of sugar.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/egxd4p/did_i_really_get_this_lucky/",
    "score": 104,
    "upvote_ratio": 0.92,
    "created_utc": 1577572383.0,
    "num_comments": 67,
    "links": [
        []
    ],
    "comments": [
        {
            "body": ">  he didn't bring a condom so no PIV   \n>  \n>  He also told me whatever I want I just need to ask for \n\nlol ask him to buy you some condoms so that you are both prepared!",
            "author": "scott7sd",
            "id": "fcanra3",
            "parent_id": "t3_egxd4p",
            "score": 34,
            "created_utc": 1577572918.0,
            "replies": [
                {
                    "body": "Haha, i'll make sure to get some just in case. He said we can go get some after dinner before coming back to the hotel. But I am too tired so i'm going to ask if we can raincheck that.",
                    "author": null,
                    "id": "fcao0nr",
                    "parent_id": "t1_fcanra3",
                    "score": 4,
                    "created_utc": 1577573077.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcaqn5s",
                            "parent_id": "t1_fcao0nr",
                            "score": 17,
                            "created_utc": 1577574662.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fcawrch",
                                    "parent_id": "t1_fcaqn5s",
                                    "score": 13,
                                    "created_utc": 1577578141.0,
                                    "replies": [
                                        {
                                            "body": "I didn't say I was too tired, I just asked if he would be okay not going back to the hotel tonight. He said of course, whatever i'm comfortable with",
                                            "author": null,
                                            "id": "fcaxupg",
                                            "parent_id": "t1_fcawrch",
                                            "score": 4,
                                            "created_utc": 1577578760.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fcay7v1",
                                                    "parent_id": "t1_fcaxupg",
                                                    "score": 4,
                                                    "created_utc": 1577578968.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
                                                            "author": null,
                                                            "id": "fcayyuz",
                                                            "parent_id": "t1_fcay7v1",
                                                            "score": 7,
                                                            "created_utc": 1577579394.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Before we even left the room for dinner I asked if it would be ok not to come back to the hotel tonight and he said of course, my being comfortable is top priority.",
                                    "author": null,
                                    "id": "fcaw06p",
                                    "parent_id": "t1_fcaqn5s",
                                    "score": 6,
                                    "created_utc": 1577577709.0,
                                    "replies": []
                                },
                                {
                                    "body": "I hate to agree with this yet I do.  If he bounds back into the room with a fun pack of condoms and makes a big deal about it she better have something better than \"I'm tired\".  It sounds like he's been nothing but a gentleman to her and fully expects to be rewarded for that once he, again, fulfills his end of the bargain.",
                                    "author": null,
                                    "id": "fcavfpu",
                                    "parent_id": "t1_fcaqn5s",
                                    "score": 8,
                                    "created_utc": 1577577390.0,
                                    "replies": [
                                        {
                                            "body": "I asked before we even left for dinner if he'd be alright if we didn't return to the hotel tonight. He said of course he wants me to be comfortable.",
                                            "author": null,
                                            "id": "fcaw8ow",
                                            "parent_id": "t1_fcavfpu",
                                            "score": 8,
                                            "created_utc": 1577577844.0,
                                            "replies": [
                                                {
                                                    "body": "Hey, being the gentleman he is, this is the only answer he can give. You don't know him yet. This is a sugar relationship. You got your sugar. He still haven't got his. \nIt is too early in the relationship to really know if he's speaking his mind. When in doubt, don't assume people speak their mind.",
                                                    "author": "ukfi",
                                                    "id": "fcbq316",
                                                    "parent_id": "t1_fcaw8ow",
                                                    "score": 5,
                                                    "created_utc": 1577589719.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
                                                            "author": null,
                                                            "id": "fceewp4",
                                                            "parent_id": "t1_fcbq316",
                                                            "score": 2,
                                                            "created_utc": 1577619813.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "That's awesome.  Good for you on being upfront and honest with him, and reading some of your other responses it sounds like you're not going to take advantage of his generosity.  Hopefully, you two settle into a nice LTR.",
                                                    "author": null,
                                                    "id": "fcay6ey",
                                                    "parent_id": "t1_fcaw8ow",
                                                    "score": 1,
                                                    "created_utc": 1577578946.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
                                                            "author": null,
                                                            "id": "fcayf3v",
                                                            "parent_id": "t1_fcay6ey",
                                                            "score": 5,
                                                            "created_utc": 1577579082.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "you're rinsing him?   not a good look",
                                    "author": "Academic_Set",
                                    "id": "fcat0wu",
                                    "parent_id": "t1_fcaqn5s",
                                    "score": -9,
                                    "created_utc": 1577576031.0,
                                    "replies": [
                                        {
                                            "body": "Im not rinsing him. He was unprepared for sex. We engaged in non PIV. I asked if he would be alright if we didn't return to the hotel tonight. He said of course he only wants me to be comfortable.",
                                            "author": null,
                                            "id": "fcaw64b",
                                            "parent_id": "t1_fcat0wu",
                                            "score": 7,
                                            "created_utc": 1577577802.0,
                                            "replies": [
                                                {
                                                    "body": "It sounds like he is a good SD, but be careful.  He may say he is okay with it, but he may start to feel taken advantage of (rinsed).   It shouldn't be a deal killer, but you would need to make sure he was satisfied next time you meet.",
                                                    "author": "willfromvb",
                                                    "id": "fcfio8f",
                                                    "parent_id": "t1_fcaw64b",
                                                    "score": 1,
                                                    "created_utc": 1577630405.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "It is just as much your responsibility to come prepared with condoms. As the women I actually always expect to be the one bringing condoms, 1. Because it is my boundary, and 2. If an SD is married he doesn’t want to forget he has condoms on him. \n\nYou may not of said “too tired” to him and just felt that way but it does leave a negative impression.",
                                                    "author": null,
                                                    "id": "fcb3oqk",
                                                    "parent_id": "t1_fcaw64b",
                                                    "score": -2,
                                                    "created_utc": 1577581939.0,
                                                    "replies": [
                                                        {
                                                            "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
                                                            "author": null,
                                                            "id": "fcb4cif",
                                                            "parent_id": "t1_fcb3oqk",
                                                            "score": 7,
                                                            "created_utc": 1577582185.0,
                                                            "replies": [
                                                                {
                                                                    "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                                                                    "author": null,
                                                                    "id": "fcb4rx0",
                                                                    "parent_id": "t1_fcb4cif",
                                                                    "score": 5,
                                                                    "created_utc": 1577582341.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                                                                            "author": null,
                                                                            "id": "fcb5apt",
                                                                            "parent_id": "t1_fcb4rx0",
                                                                            "score": 5,
                                                                            "created_utc": 1577582535.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                                                                    "author": null,
                                                                                    "id": "fcb659o",
                                                                                    "parent_id": "t1_fcb5apt",
                                                                                    "score": 2,
                                                                                    "created_utc": 1577582866.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Raincheck instead of raincoat",
                            "author": null,
                            "id": "fcgsreb",
                            "parent_id": "t1_fcao0nr",
                            "score": 1,
                            "created_utc": 1577643641.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcaqotj",
                            "parent_id": "t1_fcao0nr",
                            "score": -1,
                            "created_utc": 1577574690.0,
                            "replies": [
                                {
                                    "body": "He is tired too and we discussed it and he's totally cool not going back to the hotel tonight.",
                                    "author": null,
                                    "id": "fcawbw4",
                                    "parent_id": "t1_fcaqotj",
                                    "score": 6,
                                    "created_utc": 1577577895.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcasfj3",
                            "parent_id": "t1_fcao0nr",
                            "score": -8,
                            "created_utc": 1577575708.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fcatr6n",
                                    "parent_id": "t1_fcasfj3",
                                    "score": 2,
                                    "created_utc": 1577576443.0,
                                    "replies": []
                                },
                                {
                                    "body": "Only wives can be tired? What does your comment even mean?",
                                    "author": "bsbdfw",
                                    "id": "fcaxorf",
                                    "parent_id": "t1_fcasfj3",
                                    "score": 3,
                                    "created_utc": 1577578667.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I thought you were going to say you could pick out any animal at the zoo and you picked a turtle and an elephant",
            "author": "doctorcoolpop",
            "id": "fcb1yb4",
            "parent_id": "t3_egxd4p",
            "score": 9,
            "created_utc": 1577581152.0,
            "replies": []
        },
        {
            "body": "🙄\nHow tf did a thankful post turn into SDs reprimanding a grown woman who did nothing wrong? \n If y'all really took the time to read what was posted, she explicitly stated intimacy just not piv.\n\nTo OP, you sure do sound lucky. Congrats!",
            "author": "bsbdfw",
            "id": "fcaybeg",
            "parent_id": "t3_egxd4p",
            "score": 44,
            "created_utc": 1577579023.0,
            "replies": [
                {
                    "body": "Thank you! Yeah I was surprised reading some of the comments cause we were intimate and he came. The two of us will be better prepared next time for PIV. But this date was literally an entire day and I didn't want to return to the hotel after dinner. He was totally cool with that, and I could tell that not just from his words but his body language.",
                    "author": null,
                    "id": "fcaytbs",
                    "parent_id": "t1_fcaybeg",
                    "score": 16,
                    "created_utc": 1577579309.0,
                    "replies": []
                },
                {
                    "body": "My read on this was: \"Good for her, I'm super glad she's happy.\" And then, \"This would never be anything like my SRs. So many things in such a short post that made me go ugh.\"\n\nNo reprimand at all. Just a very different view on arrangements.",
                    "author": "marker3000",
                    "id": "fcc1z5j",
                    "parent_id": "t1_fcaybeg",
                    "score": 3,
                    "created_utc": 1577593507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Enjoy and appreciate him, I am sure he will do the same. And it’s not a bad thing exploring intimacy without complete focus on pub. I have on occasion not Brough condoms so we have to explore other ways of mutual satisfaction",
            "author": "AussieSD",
            "id": "fcb40em",
            "parent_id": "t3_egxd4p",
            "score": 6,
            "created_utc": 1577582058.0,
            "replies": [
                {
                    "body": "Thank you, yes I think he's amazing and he tells me he thinks i'm amazing. So I think we'll be amazing together.",
                    "author": null,
                    "id": "fcb4i72",
                    "parent_id": "t1_fcb40em",
                    "score": 2,
                    "created_utc": 1577582242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn, everybody here got their panties in a twist just because you were too tired for round 2 after what sounds like a long date? Sex is more than just PIV people, and it sounds like you still had a fun intimacy time! Although I would advice you to always carry condoms yourself if you know that sex might happen, because not every guy is prepared or that respectful. But good for you for having such a nice time! I hope your next date goes just as well.",
            "author": "Competitive_Earth",
            "id": "fcaye5s",
            "parent_id": "t3_egxd4p",
            "score": 13,
            "created_utc": 1577579066.0,
            "replies": [
                {
                    "body": "Thank you!! Yeah we were intimate for 2 hours, he came. Please spare me people lol. Yes, I haven't been sexually active in awhile so I didn't have any on hand but i'll definitely get some.",
                    "author": null,
                    "id": "fcaykio",
                    "parent_id": "t1_fcaye5s",
                    "score": 8,
                    "created_utc": 1577579169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What site did you find your SD on ? SA? I’m having so much trouble weeding out the whack ones lol",
            "author": "kiks9820",
            "id": "fcaqd0i",
            "parent_id": "t3_egxd4p",
            "score": 6,
            "created_utc": 1577574500.0,
            "replies": [
                {
                    "body": "Yes I've only used SA. Lots of weeding to do. But there are a few real SD out there.",
                    "author": null,
                    "id": "fcaqhyo",
                    "parent_id": "t1_fcaqd0i",
                    "score": 5,
                    "created_utc": 1577574577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcb9bso",
            "parent_id": "t3_egxd4p",
            "score": 5,
            "created_utc": 1577584045.0,
            "replies": [
                {
                    "body": "Thank you :) I hope your new POT is even better then she seems!",
                    "author": null,
                    "id": "fcbb66f",
                    "parent_id": "t1_fcb9bso",
                    "score": 2,
                    "created_utc": 1577584720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why would you feel guilty about asking him for stuff? It’s the nature of the relationship. He cummed, he should be happy. PIV is not necessary. Also, careful with doing oral without a condom. And I don’t think you should delete your SA just yet.",
            "author": "ARIEL1109",
            "id": "fcc0642",
            "parent_id": "t3_egxd4p",
            "score": 5,
            "created_utc": 1577592921.0,
            "replies": [
                {
                    "body": "I don't want to take advantage of his generosity. So I will just be thoughtful about what I ask for. I have not deleted it, I deactivated it. Since I have two men right now I think I can be in good long term relationships with, I want to put my energy into them. If it doesn't work out, i'll reactivate my account.",
                    "author": null,
                    "id": "fcedrfc",
                    "parent_id": "t1_fcc0642",
                    "score": 2,
                    "created_utc": 1577619526.0,
                    "replies": [
                        {
                            "body": "Yes and when they both drop you randomly you are at square one. Never ever stop looking for option c.d.e...",
                            "author": "ARIEL1109",
                            "id": "fcedybu",
                            "parent_id": "t1_fcedrfc",
                            "score": 0,
                            "created_utc": 1577619589.0,
                            "replies": [
                                {
                                    "body": "Doesn't make sense to me to keep an account if I won't have the time, energy, or want to meet someone else. Meaning anyone in the meantime will write me off as someone who won't meet and block or hide my profile. So when I do need to look for another SD I have burned bridges",
                                    "author": null,
                                    "id": "fcefamf",
                                    "parent_id": "t1_fcedybu",
                                    "score": 3,
                                    "created_utc": 1577619949.0,
                                    "replies": [
                                        {
                                            "body": "Ah ok, didn’t think of that viewpoint. Maybe freestyle then at nice spots?",
                                            "author": "ARIEL1109",
                                            "id": "fcefiw8",
                                            "parent_id": "t1_fcefamf",
                                            "score": -1,
                                            "created_utc": 1577620026.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sounds like a perfect day! Both you and him ended up equally happy. If his only concern was your body, then his response to you would’ve been much different. You clearly weren’t opposed to sex; it seems that he genuinely enjoyed you enough not to be disappointed without it. Cheers to chemistry and meaningful SRs and fuck the haters (:",
            "author": null,
            "id": "fcb086j",
            "parent_id": "t3_egxd4p",
            "score": 3,
            "created_utc": 1577580092.0,
            "replies": [
                {
                    "body": "Thank you for the kind words!",
                    "author": null,
                    "id": "fcb0bbt",
                    "parent_id": "t1_fcb086j",
                    "score": 1,
                    "created_utc": 1577580142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's wonderful! See if he'll buy a good sized box of your preferred brand of condoms and you can bring them from now on.\n\nIf you ask for practical or logical small things I'm sure he'll get you plenty of things.\n\nOr if you find a particular fetish of his, or sexual fantasy. I started sending mine random links to stuff that really got him excited and next thing I knew he had them ordered 😁",
            "author": "Sweettooth_dragon",
            "id": "fcaojvb",
            "parent_id": "t3_egxd4p",
            "score": 1,
            "created_utc": 1577573407.0,
            "replies": [
                {
                    "body": "Yes my immediate thought was I could use a pair of rain boots lol. I want a really nice laptop but I couldn't ask for something like that so i'll save my sugar and then maybe ask him to buy me a warranty for it.\nEdit: I didn't comment on the fetishes as I have none. So that in particular just doesn't apply to me. Of course i'll still do what i'm comfortable with to spice things up, like my insane amount of lingerie.",
                    "author": null,
                    "id": "fcapi77",
                    "parent_id": "t1_fcaojvb",
                    "score": 5,
                    "created_utc": 1577573984.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcawv0h",
                            "parent_id": "t1_fcapi77",
                            "score": -2,
                            "created_utc": 1577578197.0,
                            "replies": [
                                {
                                    "body": "I am sorry I have given that impression as it's not true. I am a very thoughtful person. We were intimate, he came, just wasn't sex.",
                                    "author": null,
                                    "id": "fcax4ab",
                                    "parent_id": "t1_fcawv0h",
                                    "score": 7,
                                    "created_utc": 1577578345.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "keep your selfish banter on and those rubbers will hit the road.  thoughtless much?",
                            "author": "Academic_Set",
                            "id": "fcat5uv",
                            "parent_id": "t1_fcapi77",
                            "score": -15,
                            "created_utc": 1577576109.0,
                            "replies": [
                                {
                                    "body": "Selfish banter? I said I did not want to ask him for something ridiculously expensive. Which is the opposite of selfish.",
                                    "author": null,
                                    "id": "fcawgna",
                                    "parent_id": "t1_fcat5uv",
                                    "score": 8,
                                    "created_utc": 1577577971.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Amazon wish list?",
                    "author": "nemo69_1999",
                    "id": "fcasqke",
                    "parent_id": "t1_fcaojvb",
                    "score": 3,
                    "created_utc": 1577575872.0,
                    "replies": [
                        {
                            "body": "Oooh I should make one! It has mostly been things that came up in conversation such as sex toys and clothing we both found sexy.\n\nAs it came up I'd send a \"what about me in this?\" And if he drooled enough he'd order it.",
                            "author": "Sweettooth_dragon",
                            "id": "fcb05ml",
                            "parent_id": "t1_fcasqke",
                            "score": 1,
                            "created_utc": 1577580052.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "TIL PIV",
            "author": "unlimitedcome",
            "id": "fcb4hu6",
            "parent_id": "t3_egxd4p",
            "score": 1,
            "created_utc": 1577582239.0,
            "replies": []
        },
        {
            "body": "Like many of us, your SD has likely had a great year in the stock market. Enjoy while it lasts.",
            "author": null,
            "id": "fcbdg6f",
            "parent_id": "t3_egxd4p",
            "score": 1,
            "created_utc": 1577585513.0,
            "replies": [
                {
                    "body": "Hm he's never mentioned investing in the stock market. Of course that doesn't mean he hasn't. But he's a doctor so he makes good money.",
                    "author": null,
                    "id": "fcbdnil",
                    "parent_id": "t1_fcbdg6f",
                    "score": 3,
                    "created_utc": 1577585584.0,
                    "replies": [
                        {
                            "body": "Doctor who forgets condoms :)",
                            "author": null,
                            "id": "fcelkgk",
                            "parent_id": "t1_fcbdnil",
                            "score": 1,
                            "created_utc": 1577621601.0,
                            "replies": [
                                {
                                    "body": "Doctors know the real risks, lack of provided protection for some diseases, and in some cases, lack of actual risk despite the hysteria, of sex without a condom.   Not saying he was pushing for sex without a condom, just saying it's not the death sentence so many see in their head.",
                                    "author": "soicansaywhatiwant",
                                    "id": "fcgvoax",
                                    "parent_id": "t1_fcelkgk",
                                    "score": 1,
                                    "created_utc": 1577644386.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "An elephant shot glass? Are you 16?",
            "author": null,
            "id": "fcbqy1z",
            "parent_id": "t3_egxd4p",
            "score": -5,
            "created_utc": 1577589993.0,
            "replies": [
                {
                    "body": "It's a shot glass with a picture of an elephant on it. It is cute. And as far as calling me a child I would totally get a stuffed animal as well if I saw a really cute one.",
                    "author": null,
                    "id": "fcee6eb",
                    "parent_id": "t1_fcbqy1z",
                    "score": 2,
                    "created_utc": 1577619657.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds great! You should call your Mom and tell her all the details",
            "author": "Airlinefap",
            "id": "fcbbe30",
            "parent_id": "t3_egxd4p",
            "score": -3,
            "created_utc": 1577584799.0,
            "replies": [
                {
                    "body": "Ummm why? Lol",
                    "author": null,
                    "id": "fcbbl9q",
                    "parent_id": "t1_fcbbe30",
                    "score": 2,
                    "created_utc": 1577584868.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How do I get a SD 😭",
            "author": "ZoeyREI20",
            "id": "fcbbkdx",
            "parent_id": "t3_egxd4p",
            "score": 0,
            "created_utc": 1577584859.0,
            "replies": [
                {
                    "body": "Perseverance and luck. Put forth your good qualities and what you can bring to the relationship",
                    "author": null,
                    "id": "fcbbtc9",
                    "parent_id": "t1_fcbbkdx",
                    "score": 2,
                    "created_utc": 1577584948.0,
                    "replies": [
                        {
                            "body": "Also the 2 rules of dating, which people don't bring because it\ns too PC\n\n1) Be Attractive\n\n2) Don't be Not Attractive.",
                            "author": "xanfiles",
                            "id": "fccen3s",
                            "parent_id": "t1_fcbbtc9",
                            "score": 3,
                            "created_utc": 1577597519.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "two SD's is one too many. you'll get in trouble\n\nIMHO, one SD = sugar babe. two SD's = ho",
            "author": "doctorcoolpop",
            "id": "fcb22vi",
            "parent_id": "t3_egxd4p",
            "score": -24,
            "created_utc": 1577581228.0,
            "replies": [
                {
                    "body": "Do you feel the same way about one SD and one vanilla? Cause i'm not dating vanilla. And lots of SD are married so they have a wife and SB which in your thought process makes them a man ho.",
                    "author": null,
                    "id": "fcb28ug",
                    "parent_id": "t1_fcb22vi",
                    "score": 6,
                    "created_utc": 1577581323.0,
                    "replies": [
                        {
                            "body": "yes they are a man ho, but that's on them\n\ni stand by my comments",
                            "author": "doctorcoolpop",
                            "id": "fcb2hmd",
                            "parent_id": "t1_fcb28ug",
                            "score": -7,
                            "created_utc": 1577581440.0,
                            "replies": [
                                {
                                    "body": "You're entitled to your opinion, I disagree",
                                    "author": null,
                                    "id": "fcb2rhb",
                                    "parent_id": "t1_fcb2hmd",
                                    "score": 8,
                                    "created_utc": 1577581547.0,
                                    "replies": [
                                        {
                                            "body": "if you are going to have two sd's, recommend disclosing that you are non-exclusive",
                                            "author": "doctorcoolpop",
                                            "id": "fcb7wrn",
                                            "parent_id": "t1_fcb2rhb",
                                            "score": -2,
                                            "created_utc": 1577583520.0,
                                            "replies": [
                                                {
                                                    "body": "Yes I have been upfront with both of them that I am not exclusive.",
                                                    "author": null,
                                                    "id": "fcb8utb",
                                                    "parent_id": "t1_fcb7wrn",
                                                    "score": 6,
                                                    "created_utc": 1577583875.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Rule#5 SLF is a sex positive sub- Adult descriptions of sex are welcome. Graphic sexual posts, how to posts on performing certain sexual acts are prohibited. Disrespectful or or demeaning sexual descriptions (i.e. cumbucket, fuckboy, etc.,) will not be tolerated. **Shaming of other participants (i.e. escort, John, pro SB, etc.) for having multiple sugar partners is not allowed. Nor is using those terms in a derogatory fashion to insult others allowed.**\n\nConsider this the only warning you will receive concerning this matter.",
                    "author": "LaSirene23",
                    "id": "fcbf3xg",
                    "parent_id": "t1_fcb22vi",
                    "score": 10,
                    "created_utc": 1577586084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha, i'll make sure to get some just in case. He said we can go get some after dinner before coming back to the hotel. But I am too tired so i'm going to ask if we can raincheck that.",
            "author": null,
            "id": "fcao0nr",
            "parent_id": "t1_fcanra3",
            "score": 4,
            "created_utc": 1577573077.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcaqn5s",
                    "parent_id": "t1_fcao0nr",
                    "score": 17,
                    "created_utc": 1577574662.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcawrch",
                            "parent_id": "t1_fcaqn5s",
                            "score": 13,
                            "created_utc": 1577578141.0,
                            "replies": [
                                {
                                    "body": "I didn't say I was too tired, I just asked if he would be okay not going back to the hotel tonight. He said of course, whatever i'm comfortable with",
                                    "author": null,
                                    "id": "fcaxupg",
                                    "parent_id": "t1_fcawrch",
                                    "score": 4,
                                    "created_utc": 1577578760.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fcay7v1",
                                            "parent_id": "t1_fcaxupg",
                                            "score": 4,
                                            "created_utc": 1577578968.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
                                                    "author": null,
                                                    "id": "fcayyuz",
                                                    "parent_id": "t1_fcay7v1",
                                                    "score": 7,
                                                    "created_utc": 1577579394.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Before we even left the room for dinner I asked if it would be ok not to come back to the hotel tonight and he said of course, my being comfortable is top priority.",
                            "author": null,
                            "id": "fcaw06p",
                            "parent_id": "t1_fcaqn5s",
                            "score": 6,
                            "created_utc": 1577577709.0,
                            "replies": []
                        },
                        {
                            "body": "I hate to agree with this yet I do.  If he bounds back into the room with a fun pack of condoms and makes a big deal about it she better have something better than \"I'm tired\".  It sounds like he's been nothing but a gentleman to her and fully expects to be rewarded for that once he, again, fulfills his end of the bargain.",
                            "author": null,
                            "id": "fcavfpu",
                            "parent_id": "t1_fcaqn5s",
                            "score": 8,
                            "created_utc": 1577577390.0,
                            "replies": [
                                {
                                    "body": "I asked before we even left for dinner if he'd be alright if we didn't return to the hotel tonight. He said of course he wants me to be comfortable.",
                                    "author": null,
                                    "id": "fcaw8ow",
                                    "parent_id": "t1_fcavfpu",
                                    "score": 8,
                                    "created_utc": 1577577844.0,
                                    "replies": [
                                        {
                                            "body": "Hey, being the gentleman he is, this is the only answer he can give. You don't know him yet. This is a sugar relationship. You got your sugar. He still haven't got his. \nIt is too early in the relationship to really know if he's speaking his mind. When in doubt, don't assume people speak their mind.",
                                            "author": "ukfi",
                                            "id": "fcbq316",
                                            "parent_id": "t1_fcaw8ow",
                                            "score": 5,
                                            "created_utc": 1577589719.0,
                                            "replies": [
                                                {
                                                    "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
                                                    "author": null,
                                                    "id": "fceewp4",
                                                    "parent_id": "t1_fcbq316",
                                                    "score": 2,
                                                    "created_utc": 1577619813.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That's awesome.  Good for you on being upfront and honest with him, and reading some of your other responses it sounds like you're not going to take advantage of his generosity.  Hopefully, you two settle into a nice LTR.",
                                            "author": null,
                                            "id": "fcay6ey",
                                            "parent_id": "t1_fcaw8ow",
                                            "score": 1,
                                            "created_utc": 1577578946.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
                                                    "author": null,
                                                    "id": "fcayf3v",
                                                    "parent_id": "t1_fcay6ey",
                                                    "score": 5,
                                                    "created_utc": 1577579082.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "you're rinsing him?   not a good look",
                            "author": "Academic_Set",
                            "id": "fcat0wu",
                            "parent_id": "t1_fcaqn5s",
                            "score": -9,
                            "created_utc": 1577576031.0,
                            "replies": [
                                {
                                    "body": "Im not rinsing him. He was unprepared for sex. We engaged in non PIV. I asked if he would be alright if we didn't return to the hotel tonight. He said of course he only wants me to be comfortable.",
                                    "author": null,
                                    "id": "fcaw64b",
                                    "parent_id": "t1_fcat0wu",
                                    "score": 7,
                                    "created_utc": 1577577802.0,
                                    "replies": [
                                        {
                                            "body": "It sounds like he is a good SD, but be careful.  He may say he is okay with it, but he may start to feel taken advantage of (rinsed).   It shouldn't be a deal killer, but you would need to make sure he was satisfied next time you meet.",
                                            "author": "willfromvb",
                                            "id": "fcfio8f",
                                            "parent_id": "t1_fcaw64b",
                                            "score": 1,
                                            "created_utc": 1577630405.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It is just as much your responsibility to come prepared with condoms. As the women I actually always expect to be the one bringing condoms, 1. Because it is my boundary, and 2. If an SD is married he doesn’t want to forget he has condoms on him. \n\nYou may not of said “too tired” to him and just felt that way but it does leave a negative impression.",
                                            "author": null,
                                            "id": "fcb3oqk",
                                            "parent_id": "t1_fcaw64b",
                                            "score": -2,
                                            "created_utc": 1577581939.0,
                                            "replies": [
                                                {
                                                    "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
                                                    "author": null,
                                                    "id": "fcb4cif",
                                                    "parent_id": "t1_fcb3oqk",
                                                    "score": 7,
                                                    "created_utc": 1577582185.0,
                                                    "replies": [
                                                        {
                                                            "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                                                            "author": null,
                                                            "id": "fcb4rx0",
                                                            "parent_id": "t1_fcb4cif",
                                                            "score": 5,
                                                            "created_utc": 1577582341.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                                                                    "author": null,
                                                                    "id": "fcb5apt",
                                                                    "parent_id": "t1_fcb4rx0",
                                                                    "score": 5,
                                                                    "created_utc": 1577582535.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                                                            "author": null,
                                                                            "id": "fcb659o",
                                                                            "parent_id": "t1_fcb5apt",
                                                                            "score": 2,
                                                                            "created_utc": 1577582866.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Raincheck instead of raincoat",
                    "author": null,
                    "id": "fcgsreb",
                    "parent_id": "t1_fcao0nr",
                    "score": 1,
                    "created_utc": 1577643641.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcaqotj",
                    "parent_id": "t1_fcao0nr",
                    "score": -1,
                    "created_utc": 1577574690.0,
                    "replies": [
                        {
                            "body": "He is tired too and we discussed it and he's totally cool not going back to the hotel tonight.",
                            "author": null,
                            "id": "fcawbw4",
                            "parent_id": "t1_fcaqotj",
                            "score": 6,
                            "created_utc": 1577577895.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcasfj3",
                    "parent_id": "t1_fcao0nr",
                    "score": -8,
                    "created_utc": 1577575708.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcatr6n",
                            "parent_id": "t1_fcasfj3",
                            "score": 2,
                            "created_utc": 1577576443.0,
                            "replies": []
                        },
                        {
                            "body": "Only wives can be tired? What does your comment even mean?",
                            "author": "bsbdfw",
                            "id": "fcaxorf",
                            "parent_id": "t1_fcasfj3",
                            "score": 3,
                            "created_utc": 1577578667.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Yeah I was surprised reading some of the comments cause we were intimate and he came. The two of us will be better prepared next time for PIV. But this date was literally an entire day and I didn't want to return to the hotel after dinner. He was totally cool with that, and I could tell that not just from his words but his body language.",
            "author": null,
            "id": "fcaytbs",
            "parent_id": "t1_fcaybeg",
            "score": 16,
            "created_utc": 1577579309.0,
            "replies": []
        },
        {
            "body": "My read on this was: \"Good for her, I'm super glad she's happy.\" And then, \"This would never be anything like my SRs. So many things in such a short post that made me go ugh.\"\n\nNo reprimand at all. Just a very different view on arrangements.",
            "author": "marker3000",
            "id": "fcc1z5j",
            "parent_id": "t1_fcaybeg",
            "score": 3,
            "created_utc": 1577593507.0,
            "replies": []
        },
        {
            "body": "Thank you, yes I think he's amazing and he tells me he thinks i'm amazing. So I think we'll be amazing together.",
            "author": null,
            "id": "fcb4i72",
            "parent_id": "t1_fcb40em",
            "score": 2,
            "created_utc": 1577582242.0,
            "replies": []
        },
        {
            "body": "Thank you!! Yeah we were intimate for 2 hours, he came. Please spare me people lol. Yes, I haven't been sexually active in awhile so I didn't have any on hand but i'll definitely get some.",
            "author": null,
            "id": "fcaykio",
            "parent_id": "t1_fcaye5s",
            "score": 8,
            "created_utc": 1577579169.0,
            "replies": []
        },
        {
            "body": "Yes I've only used SA. Lots of weeding to do. But there are a few real SD out there.",
            "author": null,
            "id": "fcaqhyo",
            "parent_id": "t1_fcaqd0i",
            "score": 5,
            "created_utc": 1577574577.0,
            "replies": []
        },
        {
            "body": "Thank you :) I hope your new POT is even better then she seems!",
            "author": null,
            "id": "fcbb66f",
            "parent_id": "t1_fcb9bso",
            "score": 2,
            "created_utc": 1577584720.0,
            "replies": []
        },
        {
            "body": "I don't want to take advantage of his generosity. So I will just be thoughtful about what I ask for. I have not deleted it, I deactivated it. Since I have two men right now I think I can be in good long term relationships with, I want to put my energy into them. If it doesn't work out, i'll reactivate my account.",
            "author": null,
            "id": "fcedrfc",
            "parent_id": "t1_fcc0642",
            "score": 2,
            "created_utc": 1577619526.0,
            "replies": [
                {
                    "body": "Yes and when they both drop you randomly you are at square one. Never ever stop looking for option c.d.e...",
                    "author": "ARIEL1109",
                    "id": "fcedybu",
                    "parent_id": "t1_fcedrfc",
                    "score": 0,
                    "created_utc": 1577619589.0,
                    "replies": [
                        {
                            "body": "Doesn't make sense to me to keep an account if I won't have the time, energy, or want to meet someone else. Meaning anyone in the meantime will write me off as someone who won't meet and block or hide my profile. So when I do need to look for another SD I have burned bridges",
                            "author": null,
                            "id": "fcefamf",
                            "parent_id": "t1_fcedybu",
                            "score": 3,
                            "created_utc": 1577619949.0,
                            "replies": [
                                {
                                    "body": "Ah ok, didn’t think of that viewpoint. Maybe freestyle then at nice spots?",
                                    "author": "ARIEL1109",
                                    "id": "fcefiw8",
                                    "parent_id": "t1_fcefamf",
                                    "score": -1,
                                    "created_utc": 1577620026.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for the kind words!",
            "author": null,
            "id": "fcb0bbt",
            "parent_id": "t1_fcb086j",
            "score": 1,
            "created_utc": 1577580142.0,
            "replies": []
        },
        {
            "body": "Yes my immediate thought was I could use a pair of rain boots lol. I want a really nice laptop but I couldn't ask for something like that so i'll save my sugar and then maybe ask him to buy me a warranty for it.\nEdit: I didn't comment on the fetishes as I have none. So that in particular just doesn't apply to me. Of course i'll still do what i'm comfortable with to spice things up, like my insane amount of lingerie.",
            "author": null,
            "id": "fcapi77",
            "parent_id": "t1_fcaojvb",
            "score": 5,
            "created_utc": 1577573984.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcawv0h",
                    "parent_id": "t1_fcapi77",
                    "score": -2,
                    "created_utc": 1577578197.0,
                    "replies": [
                        {
                            "body": "I am sorry I have given that impression as it's not true. I am a very thoughtful person. We were intimate, he came, just wasn't sex.",
                            "author": null,
                            "id": "fcax4ab",
                            "parent_id": "t1_fcawv0h",
                            "score": 7,
                            "created_utc": 1577578345.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "keep your selfish banter on and those rubbers will hit the road.  thoughtless much?",
                    "author": "Academic_Set",
                    "id": "fcat5uv",
                    "parent_id": "t1_fcapi77",
                    "score": -15,
                    "created_utc": 1577576109.0,
                    "replies": [
                        {
                            "body": "Selfish banter? I said I did not want to ask him for something ridiculously expensive. Which is the opposite of selfish.",
                            "author": null,
                            "id": "fcawgna",
                            "parent_id": "t1_fcat5uv",
                            "score": 8,
                            "created_utc": 1577577971.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Amazon wish list?",
            "author": "nemo69_1999",
            "id": "fcasqke",
            "parent_id": "t1_fcaojvb",
            "score": 3,
            "created_utc": 1577575872.0,
            "replies": [
                {
                    "body": "Oooh I should make one! It has mostly been things that came up in conversation such as sex toys and clothing we both found sexy.\n\nAs it came up I'd send a \"what about me in this?\" And if he drooled enough he'd order it.",
                    "author": "Sweettooth_dragon",
                    "id": "fcb05ml",
                    "parent_id": "t1_fcasqke",
                    "score": 1,
                    "created_utc": 1577580052.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hm he's never mentioned investing in the stock market. Of course that doesn't mean he hasn't. But he's a doctor so he makes good money.",
            "author": null,
            "id": "fcbdnil",
            "parent_id": "t1_fcbdg6f",
            "score": 3,
            "created_utc": 1577585584.0,
            "replies": [
                {
                    "body": "Doctor who forgets condoms :)",
                    "author": null,
                    "id": "fcelkgk",
                    "parent_id": "t1_fcbdnil",
                    "score": 1,
                    "created_utc": 1577621601.0,
                    "replies": [
                        {
                            "body": "Doctors know the real risks, lack of provided protection for some diseases, and in some cases, lack of actual risk despite the hysteria, of sex without a condom.   Not saying he was pushing for sex without a condom, just saying it's not the death sentence so many see in their head.",
                            "author": "soicansaywhatiwant",
                            "id": "fcgvoax",
                            "parent_id": "t1_fcelkgk",
                            "score": 1,
                            "created_utc": 1577644386.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's a shot glass with a picture of an elephant on it. It is cute. And as far as calling me a child I would totally get a stuffed animal as well if I saw a really cute one.",
            "author": null,
            "id": "fcee6eb",
            "parent_id": "t1_fcbqy1z",
            "score": 2,
            "created_utc": 1577619657.0,
            "replies": []
        },
        {
            "body": "Ummm why? Lol",
            "author": null,
            "id": "fcbbl9q",
            "parent_id": "t1_fcbbe30",
            "score": 2,
            "created_utc": 1577584868.0,
            "replies": []
        },
        {
            "body": "Perseverance and luck. Put forth your good qualities and what you can bring to the relationship",
            "author": null,
            "id": "fcbbtc9",
            "parent_id": "t1_fcbbkdx",
            "score": 2,
            "created_utc": 1577584948.0,
            "replies": [
                {
                    "body": "Also the 2 rules of dating, which people don't bring because it\ns too PC\n\n1) Be Attractive\n\n2) Don't be Not Attractive.",
                    "author": "xanfiles",
                    "id": "fccen3s",
                    "parent_id": "t1_fcbbtc9",
                    "score": 3,
                    "created_utc": 1577597519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you feel the same way about one SD and one vanilla? Cause i'm not dating vanilla. And lots of SD are married so they have a wife and SB which in your thought process makes them a man ho.",
            "author": null,
            "id": "fcb28ug",
            "parent_id": "t1_fcb22vi",
            "score": 6,
            "created_utc": 1577581323.0,
            "replies": [
                {
                    "body": "yes they are a man ho, but that's on them\n\ni stand by my comments",
                    "author": "doctorcoolpop",
                    "id": "fcb2hmd",
                    "parent_id": "t1_fcb28ug",
                    "score": -7,
                    "created_utc": 1577581440.0,
                    "replies": [
                        {
                            "body": "You're entitled to your opinion, I disagree",
                            "author": null,
                            "id": "fcb2rhb",
                            "parent_id": "t1_fcb2hmd",
                            "score": 8,
                            "created_utc": 1577581547.0,
                            "replies": [
                                {
                                    "body": "if you are going to have two sd's, recommend disclosing that you are non-exclusive",
                                    "author": "doctorcoolpop",
                                    "id": "fcb7wrn",
                                    "parent_id": "t1_fcb2rhb",
                                    "score": -2,
                                    "created_utc": 1577583520.0,
                                    "replies": [
                                        {
                                            "body": "Yes I have been upfront with both of them that I am not exclusive.",
                                            "author": null,
                                            "id": "fcb8utb",
                                            "parent_id": "t1_fcb7wrn",
                                            "score": 6,
                                            "created_utc": 1577583875.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Rule#5 SLF is a sex positive sub- Adult descriptions of sex are welcome. Graphic sexual posts, how to posts on performing certain sexual acts are prohibited. Disrespectful or or demeaning sexual descriptions (i.e. cumbucket, fuckboy, etc.,) will not be tolerated. **Shaming of other participants (i.e. escort, John, pro SB, etc.) for having multiple sugar partners is not allowed. Nor is using those terms in a derogatory fashion to insult others allowed.**\n\nConsider this the only warning you will receive concerning this matter.",
            "author": "LaSirene23",
            "id": "fcbf3xg",
            "parent_id": "t1_fcb22vi",
            "score": 10,
            "created_utc": 1577586084.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcaqn5s",
            "parent_id": "t1_fcao0nr",
            "score": 17,
            "created_utc": 1577574662.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcawrch",
                    "parent_id": "t1_fcaqn5s",
                    "score": 13,
                    "created_utc": 1577578141.0,
                    "replies": [
                        {
                            "body": "I didn't say I was too tired, I just asked if he would be okay not going back to the hotel tonight. He said of course, whatever i'm comfortable with",
                            "author": null,
                            "id": "fcaxupg",
                            "parent_id": "t1_fcawrch",
                            "score": 4,
                            "created_utc": 1577578760.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fcay7v1",
                                    "parent_id": "t1_fcaxupg",
                                    "score": 4,
                                    "created_utc": 1577578968.0,
                                    "replies": [
                                        {
                                            "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
                                            "author": null,
                                            "id": "fcayyuz",
                                            "parent_id": "t1_fcay7v1",
                                            "score": 7,
                                            "created_utc": 1577579394.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Before we even left the room for dinner I asked if it would be ok not to come back to the hotel tonight and he said of course, my being comfortable is top priority.",
                    "author": null,
                    "id": "fcaw06p",
                    "parent_id": "t1_fcaqn5s",
                    "score": 6,
                    "created_utc": 1577577709.0,
                    "replies": []
                },
                {
                    "body": "I hate to agree with this yet I do.  If he bounds back into the room with a fun pack of condoms and makes a big deal about it she better have something better than \"I'm tired\".  It sounds like he's been nothing but a gentleman to her and fully expects to be rewarded for that once he, again, fulfills his end of the bargain.",
                    "author": null,
                    "id": "fcavfpu",
                    "parent_id": "t1_fcaqn5s",
                    "score": 8,
                    "created_utc": 1577577390.0,
                    "replies": [
                        {
                            "body": "I asked before we even left for dinner if he'd be alright if we didn't return to the hotel tonight. He said of course he wants me to be comfortable.",
                            "author": null,
                            "id": "fcaw8ow",
                            "parent_id": "t1_fcavfpu",
                            "score": 8,
                            "created_utc": 1577577844.0,
                            "replies": [
                                {
                                    "body": "Hey, being the gentleman he is, this is the only answer he can give. You don't know him yet. This is a sugar relationship. You got your sugar. He still haven't got his. \nIt is too early in the relationship to really know if he's speaking his mind. When in doubt, don't assume people speak their mind.",
                                    "author": "ukfi",
                                    "id": "fcbq316",
                                    "parent_id": "t1_fcaw8ow",
                                    "score": 5,
                                    "created_utc": 1577589719.0,
                                    "replies": [
                                        {
                                            "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
                                            "author": null,
                                            "id": "fceewp4",
                                            "parent_id": "t1_fcbq316",
                                            "score": 2,
                                            "created_utc": 1577619813.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That's awesome.  Good for you on being upfront and honest with him, and reading some of your other responses it sounds like you're not going to take advantage of his generosity.  Hopefully, you two settle into a nice LTR.",
                                    "author": null,
                                    "id": "fcay6ey",
                                    "parent_id": "t1_fcaw8ow",
                                    "score": 1,
                                    "created_utc": 1577578946.0,
                                    "replies": [
                                        {
                                            "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
                                            "author": null,
                                            "id": "fcayf3v",
                                            "parent_id": "t1_fcay6ey",
                                            "score": 5,
                                            "created_utc": 1577579082.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "you're rinsing him?   not a good look",
                    "author": "Academic_Set",
                    "id": "fcat0wu",
                    "parent_id": "t1_fcaqn5s",
                    "score": -9,
                    "created_utc": 1577576031.0,
                    "replies": [
                        {
                            "body": "Im not rinsing him. He was unprepared for sex. We engaged in non PIV. I asked if he would be alright if we didn't return to the hotel tonight. He said of course he only wants me to be comfortable.",
                            "author": null,
                            "id": "fcaw64b",
                            "parent_id": "t1_fcat0wu",
                            "score": 7,
                            "created_utc": 1577577802.0,
                            "replies": [
                                {
                                    "body": "It sounds like he is a good SD, but be careful.  He may say he is okay with it, but he may start to feel taken advantage of (rinsed).   It shouldn't be a deal killer, but you would need to make sure he was satisfied next time you meet.",
                                    "author": "willfromvb",
                                    "id": "fcfio8f",
                                    "parent_id": "t1_fcaw64b",
                                    "score": 1,
                                    "created_utc": 1577630405.0,
                                    "replies": []
                                },
                                {
                                    "body": "It is just as much your responsibility to come prepared with condoms. As the women I actually always expect to be the one bringing condoms, 1. Because it is my boundary, and 2. If an SD is married he doesn’t want to forget he has condoms on him. \n\nYou may not of said “too tired” to him and just felt that way but it does leave a negative impression.",
                                    "author": null,
                                    "id": "fcb3oqk",
                                    "parent_id": "t1_fcaw64b",
                                    "score": -2,
                                    "created_utc": 1577581939.0,
                                    "replies": [
                                        {
                                            "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
                                            "author": null,
                                            "id": "fcb4cif",
                                            "parent_id": "t1_fcb3oqk",
                                            "score": 7,
                                            "created_utc": 1577582185.0,
                                            "replies": [
                                                {
                                                    "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                                                    "author": null,
                                                    "id": "fcb4rx0",
                                                    "parent_id": "t1_fcb4cif",
                                                    "score": 5,
                                                    "created_utc": 1577582341.0,
                                                    "replies": [
                                                        {
                                                            "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                                                            "author": null,
                                                            "id": "fcb5apt",
                                                            "parent_id": "t1_fcb4rx0",
                                                            "score": 5,
                                                            "created_utc": 1577582535.0,
                                                            "replies": [
                                                                {
                                                                    "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                                                    "author": null,
                                                                    "id": "fcb659o",
                                                                    "parent_id": "t1_fcb5apt",
                                                                    "score": 2,
                                                                    "created_utc": 1577582866.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Raincheck instead of raincoat",
            "author": null,
            "id": "fcgsreb",
            "parent_id": "t1_fcao0nr",
            "score": 1,
            "created_utc": 1577643641.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcaqotj",
            "parent_id": "t1_fcao0nr",
            "score": -1,
            "created_utc": 1577574690.0,
            "replies": [
                {
                    "body": "He is tired too and we discussed it and he's totally cool not going back to the hotel tonight.",
                    "author": null,
                    "id": "fcawbw4",
                    "parent_id": "t1_fcaqotj",
                    "score": 6,
                    "created_utc": 1577577895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcasfj3",
            "parent_id": "t1_fcao0nr",
            "score": -8,
            "created_utc": 1577575708.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcatr6n",
                    "parent_id": "t1_fcasfj3",
                    "score": 2,
                    "created_utc": 1577576443.0,
                    "replies": []
                },
                {
                    "body": "Only wives can be tired? What does your comment even mean?",
                    "author": "bsbdfw",
                    "id": "fcaxorf",
                    "parent_id": "t1_fcasfj3",
                    "score": 3,
                    "created_utc": 1577578667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes and when they both drop you randomly you are at square one. Never ever stop looking for option c.d.e...",
            "author": "ARIEL1109",
            "id": "fcedybu",
            "parent_id": "t1_fcedrfc",
            "score": 0,
            "created_utc": 1577619589.0,
            "replies": [
                {
                    "body": "Doesn't make sense to me to keep an account if I won't have the time, energy, or want to meet someone else. Meaning anyone in the meantime will write me off as someone who won't meet and block or hide my profile. So when I do need to look for another SD I have burned bridges",
                    "author": null,
                    "id": "fcefamf",
                    "parent_id": "t1_fcedybu",
                    "score": 3,
                    "created_utc": 1577619949.0,
                    "replies": [
                        {
                            "body": "Ah ok, didn’t think of that viewpoint. Maybe freestyle then at nice spots?",
                            "author": "ARIEL1109",
                            "id": "fcefiw8",
                            "parent_id": "t1_fcefamf",
                            "score": -1,
                            "created_utc": 1577620026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcawv0h",
            "parent_id": "t1_fcapi77",
            "score": -2,
            "created_utc": 1577578197.0,
            "replies": [
                {
                    "body": "I am sorry I have given that impression as it's not true. I am a very thoughtful person. We were intimate, he came, just wasn't sex.",
                    "author": null,
                    "id": "fcax4ab",
                    "parent_id": "t1_fcawv0h",
                    "score": 7,
                    "created_utc": 1577578345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "keep your selfish banter on and those rubbers will hit the road.  thoughtless much?",
            "author": "Academic_Set",
            "id": "fcat5uv",
            "parent_id": "t1_fcapi77",
            "score": -15,
            "created_utc": 1577576109.0,
            "replies": [
                {
                    "body": "Selfish banter? I said I did not want to ask him for something ridiculously expensive. Which is the opposite of selfish.",
                    "author": null,
                    "id": "fcawgna",
                    "parent_id": "t1_fcat5uv",
                    "score": 8,
                    "created_utc": 1577577971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oooh I should make one! It has mostly been things that came up in conversation such as sex toys and clothing we both found sexy.\n\nAs it came up I'd send a \"what about me in this?\" And if he drooled enough he'd order it.",
            "author": "Sweettooth_dragon",
            "id": "fcb05ml",
            "parent_id": "t1_fcasqke",
            "score": 1,
            "created_utc": 1577580052.0,
            "replies": []
        },
        {
            "body": "Doctor who forgets condoms :)",
            "author": null,
            "id": "fcelkgk",
            "parent_id": "t1_fcbdnil",
            "score": 1,
            "created_utc": 1577621601.0,
            "replies": [
                {
                    "body": "Doctors know the real risks, lack of provided protection for some diseases, and in some cases, lack of actual risk despite the hysteria, of sex without a condom.   Not saying he was pushing for sex without a condom, just saying it's not the death sentence so many see in their head.",
                    "author": "soicansaywhatiwant",
                    "id": "fcgvoax",
                    "parent_id": "t1_fcelkgk",
                    "score": 1,
                    "created_utc": 1577644386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also the 2 rules of dating, which people don't bring because it\ns too PC\n\n1) Be Attractive\n\n2) Don't be Not Attractive.",
            "author": "xanfiles",
            "id": "fccen3s",
            "parent_id": "t1_fcbbtc9",
            "score": 3,
            "created_utc": 1577597519.0,
            "replies": []
        },
        {
            "body": "yes they are a man ho, but that's on them\n\ni stand by my comments",
            "author": "doctorcoolpop",
            "id": "fcb2hmd",
            "parent_id": "t1_fcb28ug",
            "score": -7,
            "created_utc": 1577581440.0,
            "replies": [
                {
                    "body": "You're entitled to your opinion, I disagree",
                    "author": null,
                    "id": "fcb2rhb",
                    "parent_id": "t1_fcb2hmd",
                    "score": 8,
                    "created_utc": 1577581547.0,
                    "replies": [
                        {
                            "body": "if you are going to have two sd's, recommend disclosing that you are non-exclusive",
                            "author": "doctorcoolpop",
                            "id": "fcb7wrn",
                            "parent_id": "t1_fcb2rhb",
                            "score": -2,
                            "created_utc": 1577583520.0,
                            "replies": [
                                {
                                    "body": "Yes I have been upfront with both of them that I am not exclusive.",
                                    "author": null,
                                    "id": "fcb8utb",
                                    "parent_id": "t1_fcb7wrn",
                                    "score": 6,
                                    "created_utc": 1577583875.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcawrch",
            "parent_id": "t1_fcaqn5s",
            "score": 13,
            "created_utc": 1577578141.0,
            "replies": [
                {
                    "body": "I didn't say I was too tired, I just asked if he would be okay not going back to the hotel tonight. He said of course, whatever i'm comfortable with",
                    "author": null,
                    "id": "fcaxupg",
                    "parent_id": "t1_fcawrch",
                    "score": 4,
                    "created_utc": 1577578760.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fcay7v1",
                            "parent_id": "t1_fcaxupg",
                            "score": 4,
                            "created_utc": 1577578968.0,
                            "replies": [
                                {
                                    "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
                                    "author": null,
                                    "id": "fcayyuz",
                                    "parent_id": "t1_fcay7v1",
                                    "score": 7,
                                    "created_utc": 1577579394.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Before we even left the room for dinner I asked if it would be ok not to come back to the hotel tonight and he said of course, my being comfortable is top priority.",
            "author": null,
            "id": "fcaw06p",
            "parent_id": "t1_fcaqn5s",
            "score": 6,
            "created_utc": 1577577709.0,
            "replies": []
        },
        {
            "body": "I hate to agree with this yet I do.  If he bounds back into the room with a fun pack of condoms and makes a big deal about it she better have something better than \"I'm tired\".  It sounds like he's been nothing but a gentleman to her and fully expects to be rewarded for that once he, again, fulfills his end of the bargain.",
            "author": null,
            "id": "fcavfpu",
            "parent_id": "t1_fcaqn5s",
            "score": 8,
            "created_utc": 1577577390.0,
            "replies": [
                {
                    "body": "I asked before we even left for dinner if he'd be alright if we didn't return to the hotel tonight. He said of course he wants me to be comfortable.",
                    "author": null,
                    "id": "fcaw8ow",
                    "parent_id": "t1_fcavfpu",
                    "score": 8,
                    "created_utc": 1577577844.0,
                    "replies": [
                        {
                            "body": "Hey, being the gentleman he is, this is the only answer he can give. You don't know him yet. This is a sugar relationship. You got your sugar. He still haven't got his. \nIt is too early in the relationship to really know if he's speaking his mind. When in doubt, don't assume people speak their mind.",
                            "author": "ukfi",
                            "id": "fcbq316",
                            "parent_id": "t1_fcaw8ow",
                            "score": 5,
                            "created_utc": 1577589719.0,
                            "replies": [
                                {
                                    "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
                                    "author": null,
                                    "id": "fceewp4",
                                    "parent_id": "t1_fcbq316",
                                    "score": 2,
                                    "created_utc": 1577619813.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That's awesome.  Good for you on being upfront and honest with him, and reading some of your other responses it sounds like you're not going to take advantage of his generosity.  Hopefully, you two settle into a nice LTR.",
                            "author": null,
                            "id": "fcay6ey",
                            "parent_id": "t1_fcaw8ow",
                            "score": 1,
                            "created_utc": 1577578946.0,
                            "replies": [
                                {
                                    "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
                                    "author": null,
                                    "id": "fcayf3v",
                                    "parent_id": "t1_fcay6ey",
                                    "score": 5,
                                    "created_utc": 1577579082.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "you're rinsing him?   not a good look",
            "author": "Academic_Set",
            "id": "fcat0wu",
            "parent_id": "t1_fcaqn5s",
            "score": -9,
            "created_utc": 1577576031.0,
            "replies": [
                {
                    "body": "Im not rinsing him. He was unprepared for sex. We engaged in non PIV. I asked if he would be alright if we didn't return to the hotel tonight. He said of course he only wants me to be comfortable.",
                    "author": null,
                    "id": "fcaw64b",
                    "parent_id": "t1_fcat0wu",
                    "score": 7,
                    "created_utc": 1577577802.0,
                    "replies": [
                        {
                            "body": "It sounds like he is a good SD, but be careful.  He may say he is okay with it, but he may start to feel taken advantage of (rinsed).   It shouldn't be a deal killer, but you would need to make sure he was satisfied next time you meet.",
                            "author": "willfromvb",
                            "id": "fcfio8f",
                            "parent_id": "t1_fcaw64b",
                            "score": 1,
                            "created_utc": 1577630405.0,
                            "replies": []
                        },
                        {
                            "body": "It is just as much your responsibility to come prepared with condoms. As the women I actually always expect to be the one bringing condoms, 1. Because it is my boundary, and 2. If an SD is married he doesn’t want to forget he has condoms on him. \n\nYou may not of said “too tired” to him and just felt that way but it does leave a negative impression.",
                            "author": null,
                            "id": "fcb3oqk",
                            "parent_id": "t1_fcaw64b",
                            "score": -2,
                            "created_utc": 1577581939.0,
                            "replies": [
                                {
                                    "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
                                    "author": null,
                                    "id": "fcb4cif",
                                    "parent_id": "t1_fcb3oqk",
                                    "score": 7,
                                    "created_utc": 1577582185.0,
                                    "replies": [
                                        {
                                            "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                                            "author": null,
                                            "id": "fcb4rx0",
                                            "parent_id": "t1_fcb4cif",
                                            "score": 5,
                                            "created_utc": 1577582341.0,
                                            "replies": [
                                                {
                                                    "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                                                    "author": null,
                                                    "id": "fcb5apt",
                                                    "parent_id": "t1_fcb4rx0",
                                                    "score": 5,
                                                    "created_utc": 1577582535.0,
                                                    "replies": [
                                                        {
                                                            "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                                            "author": null,
                                                            "id": "fcb659o",
                                                            "parent_id": "t1_fcb5apt",
                                                            "score": 2,
                                                            "created_utc": 1577582866.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He is tired too and we discussed it and he's totally cool not going back to the hotel tonight.",
            "author": null,
            "id": "fcawbw4",
            "parent_id": "t1_fcaqotj",
            "score": 6,
            "created_utc": 1577577895.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcatr6n",
            "parent_id": "t1_fcasfj3",
            "score": 2,
            "created_utc": 1577576443.0,
            "replies": []
        },
        {
            "body": "Only wives can be tired? What does your comment even mean?",
            "author": "bsbdfw",
            "id": "fcaxorf",
            "parent_id": "t1_fcasfj3",
            "score": 3,
            "created_utc": 1577578667.0,
            "replies": []
        },
        {
            "body": "Doesn't make sense to me to keep an account if I won't have the time, energy, or want to meet someone else. Meaning anyone in the meantime will write me off as someone who won't meet and block or hide my profile. So when I do need to look for another SD I have burned bridges",
            "author": null,
            "id": "fcefamf",
            "parent_id": "t1_fcedybu",
            "score": 3,
            "created_utc": 1577619949.0,
            "replies": [
                {
                    "body": "Ah ok, didn’t think of that viewpoint. Maybe freestyle then at nice spots?",
                    "author": "ARIEL1109",
                    "id": "fcefiw8",
                    "parent_id": "t1_fcefamf",
                    "score": -1,
                    "created_utc": 1577620026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am sorry I have given that impression as it's not true. I am a very thoughtful person. We were intimate, he came, just wasn't sex.",
            "author": null,
            "id": "fcax4ab",
            "parent_id": "t1_fcawv0h",
            "score": 7,
            "created_utc": 1577578345.0,
            "replies": []
        },
        {
            "body": "Selfish banter? I said I did not want to ask him for something ridiculously expensive. Which is the opposite of selfish.",
            "author": null,
            "id": "fcawgna",
            "parent_id": "t1_fcat5uv",
            "score": 8,
            "created_utc": 1577577971.0,
            "replies": []
        },
        {
            "body": "Doctors know the real risks, lack of provided protection for some diseases, and in some cases, lack of actual risk despite the hysteria, of sex without a condom.   Not saying he was pushing for sex without a condom, just saying it's not the death sentence so many see in their head.",
            "author": "soicansaywhatiwant",
            "id": "fcgvoax",
            "parent_id": "t1_fcelkgk",
            "score": 1,
            "created_utc": 1577644386.0,
            "replies": []
        },
        {
            "body": "You're entitled to your opinion, I disagree",
            "author": null,
            "id": "fcb2rhb",
            "parent_id": "t1_fcb2hmd",
            "score": 8,
            "created_utc": 1577581547.0,
            "replies": [
                {
                    "body": "if you are going to have two sd's, recommend disclosing that you are non-exclusive",
                    "author": "doctorcoolpop",
                    "id": "fcb7wrn",
                    "parent_id": "t1_fcb2rhb",
                    "score": -2,
                    "created_utc": 1577583520.0,
                    "replies": [
                        {
                            "body": "Yes I have been upfront with both of them that I am not exclusive.",
                            "author": null,
                            "id": "fcb8utb",
                            "parent_id": "t1_fcb7wrn",
                            "score": 6,
                            "created_utc": 1577583875.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn't say I was too tired, I just asked if he would be okay not going back to the hotel tonight. He said of course, whatever i'm comfortable with",
            "author": null,
            "id": "fcaxupg",
            "parent_id": "t1_fcawrch",
            "score": 4,
            "created_utc": 1577578760.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fcay7v1",
                    "parent_id": "t1_fcaxupg",
                    "score": 4,
                    "created_utc": 1577578968.0,
                    "replies": [
                        {
                            "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
                            "author": null,
                            "id": "fcayyuz",
                            "parent_id": "t1_fcay7v1",
                            "score": 7,
                            "created_utc": 1577579394.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I asked before we even left for dinner if he'd be alright if we didn't return to the hotel tonight. He said of course he wants me to be comfortable.",
            "author": null,
            "id": "fcaw8ow",
            "parent_id": "t1_fcavfpu",
            "score": 8,
            "created_utc": 1577577844.0,
            "replies": [
                {
                    "body": "Hey, being the gentleman he is, this is the only answer he can give. You don't know him yet. This is a sugar relationship. You got your sugar. He still haven't got his. \nIt is too early in the relationship to really know if he's speaking his mind. When in doubt, don't assume people speak their mind.",
                    "author": "ukfi",
                    "id": "fcbq316",
                    "parent_id": "t1_fcaw8ow",
                    "score": 5,
                    "created_utc": 1577589719.0,
                    "replies": [
                        {
                            "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
                            "author": null,
                            "id": "fceewp4",
                            "parent_id": "t1_fcbq316",
                            "score": 2,
                            "created_utc": 1577619813.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's awesome.  Good for you on being upfront and honest with him, and reading some of your other responses it sounds like you're not going to take advantage of his generosity.  Hopefully, you two settle into a nice LTR.",
                    "author": null,
                    "id": "fcay6ey",
                    "parent_id": "t1_fcaw8ow",
                    "score": 1,
                    "created_utc": 1577578946.0,
                    "replies": [
                        {
                            "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
                            "author": null,
                            "id": "fcayf3v",
                            "parent_id": "t1_fcay6ey",
                            "score": 5,
                            "created_utc": 1577579082.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im not rinsing him. He was unprepared for sex. We engaged in non PIV. I asked if he would be alright if we didn't return to the hotel tonight. He said of course he only wants me to be comfortable.",
            "author": null,
            "id": "fcaw64b",
            "parent_id": "t1_fcat0wu",
            "score": 7,
            "created_utc": 1577577802.0,
            "replies": [
                {
                    "body": "It sounds like he is a good SD, but be careful.  He may say he is okay with it, but he may start to feel taken advantage of (rinsed).   It shouldn't be a deal killer, but you would need to make sure he was satisfied next time you meet.",
                    "author": "willfromvb",
                    "id": "fcfio8f",
                    "parent_id": "t1_fcaw64b",
                    "score": 1,
                    "created_utc": 1577630405.0,
                    "replies": []
                },
                {
                    "body": "It is just as much your responsibility to come prepared with condoms. As the women I actually always expect to be the one bringing condoms, 1. Because it is my boundary, and 2. If an SD is married he doesn’t want to forget he has condoms on him. \n\nYou may not of said “too tired” to him and just felt that way but it does leave a negative impression.",
                    "author": null,
                    "id": "fcb3oqk",
                    "parent_id": "t1_fcaw64b",
                    "score": -2,
                    "created_utc": 1577581939.0,
                    "replies": [
                        {
                            "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
                            "author": null,
                            "id": "fcb4cif",
                            "parent_id": "t1_fcb3oqk",
                            "score": 7,
                            "created_utc": 1577582185.0,
                            "replies": [
                                {
                                    "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                                    "author": null,
                                    "id": "fcb4rx0",
                                    "parent_id": "t1_fcb4cif",
                                    "score": 5,
                                    "created_utc": 1577582341.0,
                                    "replies": [
                                        {
                                            "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                                            "author": null,
                                            "id": "fcb5apt",
                                            "parent_id": "t1_fcb4rx0",
                                            "score": 5,
                                            "created_utc": 1577582535.0,
                                            "replies": [
                                                {
                                                    "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                                    "author": null,
                                                    "id": "fcb659o",
                                                    "parent_id": "t1_fcb5apt",
                                                    "score": 2,
                                                    "created_utc": 1577582866.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah ok, didn’t think of that viewpoint. Maybe freestyle then at nice spots?",
            "author": "ARIEL1109",
            "id": "fcefiw8",
            "parent_id": "t1_fcefamf",
            "score": -1,
            "created_utc": 1577620026.0,
            "replies": []
        },
        {
            "body": "if you are going to have two sd's, recommend disclosing that you are non-exclusive",
            "author": "doctorcoolpop",
            "id": "fcb7wrn",
            "parent_id": "t1_fcb2rhb",
            "score": -2,
            "created_utc": 1577583520.0,
            "replies": [
                {
                    "body": "Yes I have been upfront with both of them that I am not exclusive.",
                    "author": null,
                    "id": "fcb8utb",
                    "parent_id": "t1_fcb7wrn",
                    "score": 6,
                    "created_utc": 1577583875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fcay7v1",
            "parent_id": "t1_fcaxupg",
            "score": 4,
            "created_utc": 1577578968.0,
            "replies": [
                {
                    "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
                    "author": null,
                    "id": "fcayyuz",
                    "parent_id": "t1_fcay7v1",
                    "score": 7,
                    "created_utc": 1577579394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey, being the gentleman he is, this is the only answer he can give. You don't know him yet. This is a sugar relationship. You got your sugar. He still haven't got his. \nIt is too early in the relationship to really know if he's speaking his mind. When in doubt, don't assume people speak their mind.",
            "author": "ukfi",
            "id": "fcbq316",
            "parent_id": "t1_fcaw8ow",
            "score": 5,
            "created_utc": 1577589719.0,
            "replies": [
                {
                    "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
                    "author": null,
                    "id": "fceewp4",
                    "parent_id": "t1_fcbq316",
                    "score": 2,
                    "created_utc": 1577619813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's awesome.  Good for you on being upfront and honest with him, and reading some of your other responses it sounds like you're not going to take advantage of his generosity.  Hopefully, you two settle into a nice LTR.",
            "author": null,
            "id": "fcay6ey",
            "parent_id": "t1_fcaw8ow",
            "score": 1,
            "created_utc": 1577578946.0,
            "replies": [
                {
                    "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
                    "author": null,
                    "id": "fcayf3v",
                    "parent_id": "t1_fcay6ey",
                    "score": 5,
                    "created_utc": 1577579082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It sounds like he is a good SD, but be careful.  He may say he is okay with it, but he may start to feel taken advantage of (rinsed).   It shouldn't be a deal killer, but you would need to make sure he was satisfied next time you meet.",
            "author": "willfromvb",
            "id": "fcfio8f",
            "parent_id": "t1_fcaw64b",
            "score": 1,
            "created_utc": 1577630405.0,
            "replies": []
        },
        {
            "body": "It is just as much your responsibility to come prepared with condoms. As the women I actually always expect to be the one bringing condoms, 1. Because it is my boundary, and 2. If an SD is married he doesn’t want to forget he has condoms on him. \n\nYou may not of said “too tired” to him and just felt that way but it does leave a negative impression.",
            "author": null,
            "id": "fcb3oqk",
            "parent_id": "t1_fcaw64b",
            "score": -2,
            "created_utc": 1577581939.0,
            "replies": [
                {
                    "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
                    "author": null,
                    "id": "fcb4cif",
                    "parent_id": "t1_fcb3oqk",
                    "score": 7,
                    "created_utc": 1577582185.0,
                    "replies": [
                        {
                            "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                            "author": null,
                            "id": "fcb4rx0",
                            "parent_id": "t1_fcb4cif",
                            "score": 5,
                            "created_utc": 1577582341.0,
                            "replies": [
                                {
                                    "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                                    "author": null,
                                    "id": "fcb5apt",
                                    "parent_id": "t1_fcb4rx0",
                                    "score": 5,
                                    "created_utc": 1577582535.0,
                                    "replies": [
                                        {
                                            "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                            "author": null,
                                            "id": "fcb659o",
                                            "parent_id": "t1_fcb5apt",
                                            "score": 2,
                                            "created_utc": 1577582866.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes I have been upfront with both of them that I am not exclusive.",
            "author": null,
            "id": "fcb8utb",
            "parent_id": "t1_fcb7wrn",
            "score": 6,
            "created_utc": 1577583875.0,
            "replies": []
        },
        {
            "body": "Thanks! And I communicated everything with him, and communication is what's important. He was completely satisfied with our date as it was and felt no need to return to the hotel either",
            "author": null,
            "id": "fcayyuz",
            "parent_id": "t1_fcay7v1",
            "score": 7,
            "created_utc": 1577579394.0,
            "replies": []
        },
        {
            "body": "I think I can trust my own judgment. It's pretty easy to tell very early on a person's character. Like if they'll lie or not. Also, he \"came\" last night so he got his sugar. PIV isn't the only satisfying sexual act. And I asked him about condoms before we even got to the hotel and he said we would just do oral instead.",
            "author": null,
            "id": "fceewp4",
            "parent_id": "t1_fcbq316",
            "score": 2,
            "created_utc": 1577619813.0,
            "replies": []
        },
        {
            "body": "Thank you, I appreciate that. He treated me well today and i hope i did the same. Seeing as he felt the need to tell me all my good qualities over dinner and how impressed he was with me today, i think we will have a nice LTR.",
            "author": null,
            "id": "fcayf3v",
            "parent_id": "t1_fcay6ey",
            "score": 5,
            "created_utc": 1577579082.0,
            "replies": []
        },
        {
            "body": "Normally I would have condoms but I haven't been sexually active in awhile. He's single. We had a nice intimate time, he came, and he's get sweet and considerate. He appreciates everything I bring to the relationship. He commented how it stuck out to him today when we were at the zoo and I saw a mother trying to take a selfie that included her whole family so I asked if I could take a picture for them. I felt appreciated that he valued that since it was just something I automatically did to be nice and helpful without thinking about it.",
            "author": null,
            "id": "fcb4cif",
            "parent_id": "t1_fcb3oqk",
            "score": 7,
            "created_utc": 1577582185.0,
            "replies": [
                {
                    "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
                    "author": null,
                    "id": "fcb4rx0",
                    "parent_id": "t1_fcb4cif",
                    "score": 5,
                    "created_utc": 1577582341.0,
                    "replies": [
                        {
                            "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                            "author": null,
                            "id": "fcb5apt",
                            "parent_id": "t1_fcb4rx0",
                            "score": 5,
                            "created_utc": 1577582535.0,
                            "replies": [
                                {
                                    "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                                    "author": null,
                                    "id": "fcb659o",
                                    "parent_id": "t1_fcb5apt",
                                    "score": 2,
                                    "created_utc": 1577582866.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He sounds like the type of SD who is looking for intimacy beyond sex, this tends to be a better quality SR. Just be prepared next time I guess.",
            "author": null,
            "id": "fcb4rx0",
            "parent_id": "t1_fcb4cif",
            "score": 5,
            "created_utc": 1577582341.0,
            "replies": [
                {
                    "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
                    "author": null,
                    "id": "fcb5apt",
                    "parent_id": "t1_fcb4rx0",
                    "score": 5,
                    "created_utc": 1577582535.0,
                    "replies": [
                        {
                            "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                            "author": null,
                            "id": "fcb659o",
                            "parent_id": "t1_fcb5apt",
                            "score": 2,
                            "created_utc": 1577582866.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Will do, and yes I specifically vetted for someone that wanted a relationship beyond the physical",
            "author": null,
            "id": "fcb5apt",
            "parent_id": "t1_fcb4rx0",
            "score": 5,
            "created_utc": 1577582535.0,
            "replies": [
                {
                    "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
                    "author": null,
                    "id": "fcb659o",
                    "parent_id": "t1_fcb5apt",
                    "score": 2,
                    "created_utc": 1577582866.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They are harder to find but the arrangement/relationship is so much more fulfilling. Hope you continue to enjoy :)",
            "author": null,
            "id": "fcb659o",
            "parent_id": "t1_fcb5apt",
            "score": 2,
            "created_utc": 1577582866.0,
            "replies": []
        }
    ]
}