{
    "title": "What product should I use to achieve the \"Young Stalin\" look?",
    "post_id": "5jrhdy",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/5jrhdy/what_product_should_i_use_to_achieve_the_young/",
    "author": "_oats_",
    "body": "",
    "url": "https://i.reddituploads.com/79f1920658d947c4bca2b5c7634d6f42?fit=max&h=1536&w=1536&s=309411400ddabd487b8bb7af16655307",
    "score": 294,
    "upvote_ratio": 0.86,
    "created_utc": 1482424496.0,
    "num_comments": 60,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Organize a proletarian movement to overthrow the bourgeoise, then use *texture cream*, which is a product that reduces frizz, has a light hold that's shapable during the day, adds little weight, and doesn't make it feel like you're wearing a helmet. ",
            "author": "Willravel",
            "id": "dbijr7a",
            "parent_id": "t3_5jrhdy",
            "score": 228,
            "created_utc": 1482432924.0,
            "replies": []
        },
        {
            "body": "I've heard good things about Revolution. It's this new product from MARX. Up and coming German brand manufactured in England.",
            "author": null,
            "id": "dbigvp0",
            "parent_id": "t3_5jrhdy",
            "score": 176,
            "created_utc": 1482429486.0,
            "replies": []
        },
        {
            "body": "FOR FUCK'S SAKE THE GUY HAD *REALLY* GOOD HAIR AND HE PROBABLY JUST RAKED HIS HAND BACK THROUGH IT AND THEY TOOK THE PHOTO. \nIF YOU DON'T ALREADY HAVE GREAT, THICK, SMOOTH HAIR JUST LET IT GO. ",
            "author": "god_of_this_age",
            "id": "dbifk9q",
            "parent_id": "t3_5jrhdy",
            "score": 276,
            "created_utc": 1482427887.0,
            "replies": [
                {
                    "body": "No, he had American Pigdog Crew Fibre ",
                    "author": null,
                    "id": "dbimeb1",
                    "parent_id": "t1_dbifk9q",
                    "score": 115,
                    "created_utc": 1482436152.0,
                    "replies": []
                },
                {
                    "body": "Lmao these replies are trash.\n\nThis might be a meme but for anyone curious here's your best shot on how to actually do it \n\n1. NoPoo method \n2. Use towel sparingly\n3. Use a good hair dryer\n4. Use heat protector \n5. Take really good care not to hurt your hair in order to get your luscious locks. (See 2,3,4)\n6. Use [Miracle 10](https://www.google.com/search?espv=2&q=miracle+ten&spell=1&sa=X&ved=0ahUKEwiJwdaR6IjRAhUk2oMKHW8mCacQvwUIGSgA&biw=1120&bih=613) or argan oil\n\n7. Use a medium to high hold product to keep it back. People lose their shit here about American Crew fiber (wax) so that should work. I like Suavecito (pomade)but it's not as easy to find. Most barber shops *should* have it. Try pomade first and then try waxes. American crew pomade is good as well\n\n8. Train your hair follicles to aim backwards. You can do this by never letting it sit down and always having product pushing it back. Or you could speed up the process by always wearing a hat\n\n9. Let it grow somewhere around 7 inches on top. Let the sides be like 4 inches\n\n10. Thin it out occasionally with a good cut every month. Show your barber the picture and get his insight\n\nI don't think people realize that Stalin's hair in real life may have been gaudy to look at. Personally I think [this](http://c8.alamy.com/comp/DYP0X6/joseph-stalin-1878-1953-leader-of-the-soviet-union-in-young-years-DYP0X6.jpg) side view is disenchanting and chasing it will make you look like [wreck it ralph](http://25.media.tumblr.com/tumblr_lw7vbhXXrM1qeu6ilo1_400.jpg) I think it's a good influence for what you want but I don't recommend you try to get that exact cut. It' would have looked a lot better if it was thinned out more. ",
                    "author": "SillySalamander6",
                    "id": "dbitwyr",
                    "parent_id": "t1_dbifk9q",
                    "score": 101,
                    "created_utc": 1482445880.0,
                    "replies": [
                        {
                            "body": "/u/_oats_ this right here is the real answer. Just stop washing your hair. You'll get past the nasty feeling period after 2 weeks, use dry shampoo or conditioner only washing to get past it. May be odd at first but your hair will be healthier and look better.\n\nAs for product, just use a pomade like the above comment suggests.",
                            "author": "Top_Hat_Matt",
                            "id": "dbizyao",
                            "parent_id": "t1_dbitwyr",
                            "score": 11,
                            "created_utc": 1482454715.0,
                            "replies": [
                                {
                                    "body": ">stop washing your hair \n\nWouldn't this have the opposite affect of \"healthy\"? Legitimate question as not washing hair not only sounds really gross, but also a terrible idea if you have any form of intensive labour occur at any time after not washing your hair for awhile. I mean sweat and dirt and stuff is bad. \n\nOr am I misunderstanding? Forgive me if I am it's 3am and I may not be comprehending what you're saying. Please correct me if I am wrong. ",
                                    "author": "Wendys_frys",
                                    "id": "dbjeu8r",
                                    "parent_id": "t1_dbizyao",
                                    "score": 2,
                                    "created_utc": 1482480372.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "dbjg759",
                                            "parent_id": "t1_dbjeu8r",
                                            "score": 7,
                                            "created_utc": 1482484340.0,
                                            "replies": [
                                                {
                                                    "body": "So still basically the same thing? I feel water wouldn't really clean your hair. I mean you wouldn't want dirty hair simple for a style would you?",
                                                    "author": "Wendys_frys",
                                                    "id": "dbjgbkh",
                                                    "parent_id": "t1_dbjg759",
                                                    "score": 2,
                                                    "created_utc": 1482484718.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "dbjgk4r",
                                                            "parent_id": "t1_dbjgbkh",
                                                            "score": 4,
                                                            "created_utc": 1482485469.0,
                                                            "replies": [
                                                                {
                                                                    "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                                                                    "author": "Wendys_frys",
                                                                    "id": "dbjls2j",
                                                                    "parent_id": "t1_dbjgk4r",
                                                                    "score": 1,
                                                                    "created_utc": 1482500564.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                                                                            "author": "james_strange",
                                                                            "id": "dbjqg8e",
                                                                            "parent_id": "t1_dbjls2j",
                                                                            "score": 3,
                                                                            "created_utc": 1482508438.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "You're correct! Nopoo is disgusting.",
                                                            "author": "firekil",
                                                            "id": "dbjj3h2",
                                                            "parent_id": "t1_dbjgbkh",
                                                            "score": 3,
                                                            "created_utc": 1482493694.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                                                                    "author": "Wendys_frys",
                                                                    "id": "dbjlqi9",
                                                                    "parent_id": "t1_dbjj3h2",
                                                                    "score": 3,
                                                                    "created_utc": 1482500471.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "There has been a bit of research into the microbiome of the skin (and by extension the hair) and how washing with soap just destroys it. I don't have the info about it off hand; my wife is a biochemist who studies the gut microbiome and tells me about it a lot. There is specifically one researcher who has stopped using soap or deodorant, and instead used some kind of body rub he made to facilitate the growth of some specific types of bacteria, and got to the point that he doesn't have body odor or problems with oily hair/skin anymore.\n\nPast that, washing with water will get the majority of the dead skin cells and such off your skin and out of your hair.",
                                            "author": "Lucosis",
                                            "id": "dbjok80",
                                            "parent_id": "t1_dbjeu8r",
                                            "score": 3,
                                            "created_utc": 1482505667.0,
                                            "replies": [
                                                {
                                                    "body": "Would love some more info on this like the name of that rub",
                                                    "author": "KIAN420",
                                                    "id": "dbllrbs",
                                                    "parent_id": "t1_dbjok80",
                                                    "score": 2,
                                                    "created_utc": 1482629298.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Just an afterthought, I agree with /u/Top_Hat_Matt that you should try nopoo. Unfortunately as much as I'd like to be a nopoo nazi and say it works 100% of the time, it doesn't. It's worth a shot but be vigilant when doing it because it could definitely look bad. But if you have a fresh cut and don't go to sports clips it may look intentional instead of unkempt and gross. Although there's only very slim chance it will never look good\n\nFor me nopoo worked instantly on my hair and never had a blunder stage. However I've heard of it taking up to six months for some unlucky few with longer hair. The extraordinarily long amount of time was probably because people try to do complicated tricks to make it look nice in the process (weird shit like baking soda and putting yolk in their hair). ",
                                    "author": "SillySalamander6",
                                    "id": "dbj0k0s",
                                    "parent_id": "t1_dbizyao",
                                    "score": 1,
                                    "created_utc": 1482455610.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Personally I still think that side view looks good ",
                            "author": "Blizzzzz",
                            "id": "dbjptqe",
                            "parent_id": "t1_dbitwyr",
                            "score": 4,
                            "created_utc": 1482507562.0,
                            "replies": [
                                {
                                    "body": "When I see that side view I think it just reminds me of how frustrating it can be to tame the sides. I think for most people doing it they will come out with \"shelf\" hair where it sticks out and is too thick. Maybe that's why I don't like it that much but I prefer a more clean cut.\n\nDon't get me wrong though objectively it is a superior cut. ",
                                    "author": "SillySalamander6",
                                    "id": "dbjtfow",
                                    "parent_id": "t1_dbjptqe",
                                    "score": 2,
                                    "created_utc": 1482512402.0,
                                    "replies": [
                                        {
                                            "body": "Oh right fair enough, I misunderstood and thought you using the side view is a reason against the hair cut, but I guess I read your comment wrong or something ",
                                            "author": "Blizzzzz",
                                            "id": "dbjxva5",
                                            "parent_id": "t1_dbjtfow",
                                            "score": 2,
                                            "created_utc": 1482518046.0,
                                            "replies": [
                                                {
                                                    "body": "No you read it right. I don't like it that much. But I acknowledge all together he has good hair, just not my taste\n\nEdit: I do think it's objectively a bit overrated though",
                                                    "author": "SillySalamander6",
                                                    "id": "dbjyau3",
                                                    "parent_id": "t1_dbjxva5",
                                                    "score": 2,
                                                    "created_utc": 1482518594.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
                                                            "author": "Blizzzzz",
                                                            "id": "dbjzhre",
                                                            "parent_id": "t1_dbjyau3",
                                                            "score": 2,
                                                            "created_utc": 1482520171.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What are you doing giving real advice? This is r/malehairadvise",
                            "author": "EyeMAdam",
                            "id": "dbpcof9",
                            "parent_id": "t1_dbitwyr",
                            "score": 2,
                            "created_utc": 1482896521.0,
                            "replies": [
                                {
                                    "body": "Maybe just wasting my time. I enjoyed typing it up but I wouldn't be suprised it I saw more posted after this",
                                    "author": "SillySalamander6",
                                    "id": "dbpd9de",
                                    "parent_id": "t1_dbpcof9",
                                    "score": 1,
                                    "created_utc": 1482897412.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This needs to be posted from now on this damn pic is posted lol",
                            "author": "ArtisticAquaMan",
                            "id": "dbked61",
                            "parent_id": "t1_dbitwyr",
                            "score": 1,
                            "created_utc": 1482542942.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What about Abe Lincoln?",
                    "author": "jmjf7",
                    "id": "dbigsxo",
                    "parent_id": "t1_dbifk9q",
                    "score": 7,
                    "created_utc": 1482429394.0,
                    "replies": [
                        {
                            "body": "Is honest Abe known for his luscious hair? ",
                            "author": null,
                            "id": "dbiiyc4",
                            "parent_id": "t1_dbigsxo",
                            "score": 14,
                            "created_utc": 1482431975.0,
                            "replies": [
                                {
                                    "body": "Didn't hurt him in the election, that's for sure.",
                                    "author": null,
                                    "id": "dbiyedj",
                                    "parent_id": "t1_dbiiyc4",
                                    "score": 6,
                                    "created_utc": 1482452407.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah everyone knows that there was no such thing as hair product until u/god_of_this_age's great white hope product \"American Crew Fiber\" came out in 1991, obviously the only type of product.",
                    "author": null,
                    "id": "dbiro7e",
                    "parent_id": "t1_dbifk9q",
                    "score": 6,
                    "created_utc": 1482442849.0,
                    "replies": []
                },
                {
                    "body": "Or he had American Crew Fiber?? ",
                    "author": "PEEDUR",
                    "id": "dbj86i5",
                    "parent_id": "t1_dbifk9q",
                    "score": 2,
                    "created_utc": 1482466818.0,
                    "replies": []
                },
                {
                    "body": "wasn't this guy rich he probably had hair care products",
                    "author": "MarBakwas",
                    "id": "dbij1ik",
                    "parent_id": "t1_dbifk9q",
                    "score": 6,
                    "created_utc": 1482432079.0,
                    "replies": [
                        {
                            "body": "He wasn't rich at all. Rather poor. ",
                            "author": null,
                            "id": "dbiygwj",
                            "parent_id": "t1_dbij1ik",
                            "score": 9,
                            "created_utc": 1482452514.0,
                            "replies": [
                                {
                                    "body": "In this photo though?",
                                    "author": "incharge21",
                                    "id": "dbj9jnf",
                                    "parent_id": "t1_dbiygwj",
                                    "score": 1,
                                    "created_utc": 1482468923.0,
                                    "replies": [
                                        {
                                            "body": "Na. He looks really young in this photo. Like after he dropped out of school. So yeah, no money. \n\nI think this is his mugshot actually. ",
                                            "author": null,
                                            "id": "dbj9oef",
                                            "parent_id": "t1_dbj9jnf",
                                            "score": 6,
                                            "created_utc": 1482469150.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "pretty sure stalin used american crew fiber\n",
            "author": "Felosele",
            "id": "dbikxar",
            "parent_id": "t3_5jrhdy",
            "score": 133,
            "created_utc": 1482434345.0,
            "replies": []
        },
        {
            "body": "Don't shampoo, don't condition. Use a blow drier after your shower to blow it out/up, lightly paste it to achieve the shape with a thicker toothed comb, and then hairspray to set.\n\nNot sure what your hair is like, his is definitely thick and wavy...and very long. If your hair is naturally very straight, you're gonna have a bad time.",
            "author": "razmig",
            "id": "dbimxtm",
            "parent_id": "t3_5jrhdy",
            "score": 18,
            "created_utc": 1482436824.0,
            "replies": []
        },
        {
            "body": "Not going to lie, Stalin has some good style in his younger years",
            "author": "Tacoatman",
            "id": "dbiqnht",
            "parent_id": "t3_5jrhdy",
            "score": 20,
            "created_utc": 1482441537.0,
            "replies": [
                {
                    "body": "Not gonna lie and no homo - but Stalin was hot. ",
                    "author": "bitcoin_noob",
                    "id": "dbise0z",
                    "parent_id": "t1_dbiqnht",
                    "score": 18,
                    "created_utc": 1482443781.0,
                    "replies": [
                        {
                            "body": "Not gonna lie, that's actually not Stalin. That's a propaganda picture. [Here](http://i.amz.mshcdn.com/DhcU91nX2lZ6E4JjHVJiU2w3kJo=/http%3A%2F%2Fa.amz.mshcdn.com%2Fwp-content%2Fuploads%2F2016%2F03%2Fstalin-11.jpg) is an actual, verified picture of Stalin from the same time period. Nobody knows who the guy in the other picture was but it's clear that it's *not* Stalin as his facial structure is completely different (especially when you compare the profile shots), ears are a different shape and hair insertion points are different.",
                            "author": "XeroMotivation",
                            "id": "dbit41z",
                            "parent_id": "t1_dbise0z",
                            "score": 12,
                            "created_utc": 1482444775.0,
                            "replies": [
                                {
                                    "body": "I've read that it is actually Stalin, but it is a photoshopped picture based off a painting.\n\nedit: see here I was a little wrong https://www.reddit.com/r/AskHistorians/comments/2d8at2/was_that_young_handsome_stalin_photo_edited_at/",
                                    "author": "microcrash",
                                    "id": "dbiusnz",
                                    "parent_id": "t1_dbit41z",
                                    "score": 6,
                                    "created_utc": 1482447125.0,
                                    "replies": [
                                        {
                                            "body": "Either way it's not a legitimate, unedited photo of Stalin. It's either someone else or there's been heavy modification done to it.",
                                            "author": "XeroMotivation",
                                            "id": "dbiwdz3",
                                            "parent_id": "t1_dbiusnz",
                                            "score": 3,
                                            "created_utc": 1482449418.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Ah yes, that looks more like a young version of old Stalin. ",
                                    "author": "bitcoin_noob",
                                    "id": "dbix5v3",
                                    "parent_id": "t1_dbit41z",
                                    "score": 3,
                                    "created_utc": 1482450562.0,
                                    "replies": []
                                },
                                {
                                    "body": "That's a picture of Sacha Baron Cohen",
                                    "author": "astro_basterd",
                                    "id": "dbj8mme",
                                    "parent_id": "t1_dbit41z",
                                    "score": 2,
                                    "created_utc": 1482467486.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good old fashioned greasy oilly hair ",
            "author": "trev627",
            "id": "dbil9fc",
            "parent_id": "t3_5jrhdy",
            "score": 34,
            "created_utc": 1482434757.0,
            "replies": [
                {
                    "body": "*Only showering once a week does wonders for your roots!*",
                    "author": null,
                    "id": "dbir8il",
                    "parent_id": "t1_dbil9fc",
                    "score": 10,
                    "created_utc": 1482442280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Soviet crew fiber",
            "author": "r3dast3rik09",
            "id": "dbiw06m",
            "parent_id": "t3_5jrhdy",
            "score": 27,
            "created_utc": 1482448866.0,
            "replies": []
        },
        {
            "body": "Probably a combination of pomade and not showering a lot. \n\nI have very thick hair but I wash it every night, so if I wanted to do this I would wet, mix in some pomade, blow dry, then brush it back with my hands. \nIf you have thick hair with some natural wave this shouldn't be too difficult. \n ",
            "author": null,
            "id": "dbirc7k",
            "parent_id": "t3_5jrhdy",
            "score": 11,
            "created_utc": 1482442409.0,
            "replies": [
                {
                    "body": "95 percent jokes 5 percent real answers. Except one person here actually answered it lol",
                    "author": "SillySalamander6",
                    "id": "dbiu19r",
                    "parent_id": "t1_dbirc7k",
                    "score": 3,
                    "created_utc": 1482446047.0,
                    "replies": []
                },
                {
                    "body": "Serious question: Are you supposed to apply pomade while your hair is wet?  I usually blow dry mine first until it is as close to dry as I can get.",
                    "author": "mission17",
                    "id": "dbjek2s",
                    "parent_id": "t1_dbirc7k",
                    "score": 1,
                    "created_utc": 1482479601.0,
                    "replies": [
                        {
                            "body": "You don't have to, but my hair doesn't like pomade unless its damp. So I wet it, dry it as much as I can while maintaining a decent dampness, and then apply the pomade. Works great for me!",
                            "author": null,
                            "id": "dbjw2yr",
                            "parent_id": "t1_dbjek2s",
                            "score": 2,
                            "created_utc": 1482515785.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not super active in this subreddit but I see this posted on here waaaaay too often. ",
            "author": "InsideLlewynDameron",
            "id": "dbip8kf",
            "parent_id": "t3_5jrhdy",
            "score": 29,
            "created_utc": 1482439688.0,
            "replies": [
                {
                    "body": "deleted  ^^^^^^^^^^^^^^^^0.4652  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/29360)",
                    "author": "fishdaddyflex",
                    "id": "dbiqdy2",
                    "parent_id": "t1_dbip8kf",
                    "score": 7,
                    "created_utc": 1482441185.0,
                    "replies": []
                },
                {
                    "body": "That's because this sub is shit.",
                    "author": "XeroMotivation",
                    "id": "dbit5hx",
                    "parent_id": "t1_dbip8kf",
                    "score": 7,
                    "created_utc": 1482444829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Blood of the bourgeois. ",
            "author": "Auvon",
            "id": "dbins16",
            "parent_id": "t3_5jrhdy",
            "score": 26,
            "created_utc": 1482437877.0,
            "replies": []
        },
        {
            "body": "Ruthless power ",
            "author": null,
            "id": "dbih185",
            "parent_id": "t3_5jrhdy",
            "score": 20,
            "created_utc": 1482429671.0,
            "replies": []
        },
        {
            "body": "Well since this is a long time ago, there weren't really many different products like there are now. Oil/Petroleum based pomades and rendered fats (grease) were what they had to use. find a good oil base pomade and you'll probably be as close as possible to Stalins hair.",
            "author": null,
            "id": "dbimbo7",
            "parent_id": "t3_5jrhdy",
            "score": 7,
            "created_utc": 1482436061.0,
            "replies": []
        },
        {
            "body": "Brylcreem",
            "author": "Xaxxus",
            "id": "dbinibj",
            "parent_id": "t3_5jrhdy",
            "score": 6,
            "created_utc": 1482437545.0,
            "replies": []
        },
        {
            "body": "I believe you are supposed to use the blood of Belarussians.",
            "author": "raveiskingcom",
            "id": "dbj5gaz",
            "parent_id": "t3_5jrhdy",
            "score": 4,
            "created_utc": 1482462691.0,
            "replies": []
        },
        {
            "body": "Stupid Sexy Stalin ",
            "author": "zachar3",
            "id": "dbj0hig",
            "parent_id": "t3_5jrhdy",
            "score": 3,
            "created_utc": 1482455506.0,
            "replies": []
        },
        {
            "body": "search this subreddit for \"stalin\" and read the other 89032740893274093 threads made about this picture already.",
            "author": "Jumpmancw13",
            "id": "dbiwh3w",
            "parent_id": "t3_5jrhdy",
            "score": 4,
            "created_utc": 1482449548.0,
            "replies": []
        },
        {
            "body": "Have good genetics and don't shower",
            "author": "Iamurcouch",
            "id": "dbjqqkf",
            "parent_id": "t3_5jrhdy",
            "score": 1,
            "created_utc": 1482508831.0,
            "replies": []
        },
        {
            "body": "It's always starts with  prolethairian ideals of freedom but ultimately it will require authorathairian  controlling products",
            "author": "jonathanswan",
            "id": "dbirk5z",
            "parent_id": "t3_5jrhdy",
            "score": -2,
            "created_utc": 1482442703.0,
            "replies": []
        },
        {
            "body": "No, he had American Pigdog Crew Fibre ",
            "author": null,
            "id": "dbimeb1",
            "parent_id": "t1_dbifk9q",
            "score": 115,
            "created_utc": 1482436152.0,
            "replies": []
        },
        {
            "body": "Lmao these replies are trash.\n\nThis might be a meme but for anyone curious here's your best shot on how to actually do it \n\n1. NoPoo method \n2. Use towel sparingly\n3. Use a good hair dryer\n4. Use heat protector \n5. Take really good care not to hurt your hair in order to get your luscious locks. (See 2,3,4)\n6. Use [Miracle 10](https://www.google.com/search?espv=2&q=miracle+ten&spell=1&sa=X&ved=0ahUKEwiJwdaR6IjRAhUk2oMKHW8mCacQvwUIGSgA&biw=1120&bih=613) or argan oil\n\n7. Use a medium to high hold product to keep it back. People lose their shit here about American Crew fiber (wax) so that should work. I like Suavecito (pomade)but it's not as easy to find. Most barber shops *should* have it. Try pomade first and then try waxes. American crew pomade is good as well\n\n8. Train your hair follicles to aim backwards. You can do this by never letting it sit down and always having product pushing it back. Or you could speed up the process by always wearing a hat\n\n9. Let it grow somewhere around 7 inches on top. Let the sides be like 4 inches\n\n10. Thin it out occasionally with a good cut every month. Show your barber the picture and get his insight\n\nI don't think people realize that Stalin's hair in real life may have been gaudy to look at. Personally I think [this](http://c8.alamy.com/comp/DYP0X6/joseph-stalin-1878-1953-leader-of-the-soviet-union-in-young-years-DYP0X6.jpg) side view is disenchanting and chasing it will make you look like [wreck it ralph](http://25.media.tumblr.com/tumblr_lw7vbhXXrM1qeu6ilo1_400.jpg) I think it's a good influence for what you want but I don't recommend you try to get that exact cut. It' would have looked a lot better if it was thinned out more. ",
            "author": "SillySalamander6",
            "id": "dbitwyr",
            "parent_id": "t1_dbifk9q",
            "score": 101,
            "created_utc": 1482445880.0,
            "replies": [
                {
                    "body": "/u/_oats_ this right here is the real answer. Just stop washing your hair. You'll get past the nasty feeling period after 2 weeks, use dry shampoo or conditioner only washing to get past it. May be odd at first but your hair will be healthier and look better.\n\nAs for product, just use a pomade like the above comment suggests.",
                    "author": "Top_Hat_Matt",
                    "id": "dbizyao",
                    "parent_id": "t1_dbitwyr",
                    "score": 11,
                    "created_utc": 1482454715.0,
                    "replies": [
                        {
                            "body": ">stop washing your hair \n\nWouldn't this have the opposite affect of \"healthy\"? Legitimate question as not washing hair not only sounds really gross, but also a terrible idea if you have any form of intensive labour occur at any time after not washing your hair for awhile. I mean sweat and dirt and stuff is bad. \n\nOr am I misunderstanding? Forgive me if I am it's 3am and I may not be comprehending what you're saying. Please correct me if I am wrong. ",
                            "author": "Wendys_frys",
                            "id": "dbjeu8r",
                            "parent_id": "t1_dbizyao",
                            "score": 2,
                            "created_utc": 1482480372.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "dbjg759",
                                    "parent_id": "t1_dbjeu8r",
                                    "score": 7,
                                    "created_utc": 1482484340.0,
                                    "replies": [
                                        {
                                            "body": "So still basically the same thing? I feel water wouldn't really clean your hair. I mean you wouldn't want dirty hair simple for a style would you?",
                                            "author": "Wendys_frys",
                                            "id": "dbjgbkh",
                                            "parent_id": "t1_dbjg759",
                                            "score": 2,
                                            "created_utc": 1482484718.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "dbjgk4r",
                                                    "parent_id": "t1_dbjgbkh",
                                                    "score": 4,
                                                    "created_utc": 1482485469.0,
                                                    "replies": [
                                                        {
                                                            "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                                                            "author": "Wendys_frys",
                                                            "id": "dbjls2j",
                                                            "parent_id": "t1_dbjgk4r",
                                                            "score": 1,
                                                            "created_utc": 1482500564.0,
                                                            "replies": [
                                                                {
                                                                    "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                                                                    "author": "james_strange",
                                                                    "id": "dbjqg8e",
                                                                    "parent_id": "t1_dbjls2j",
                                                                    "score": 3,
                                                                    "created_utc": 1482508438.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "You're correct! Nopoo is disgusting.",
                                                    "author": "firekil",
                                                    "id": "dbjj3h2",
                                                    "parent_id": "t1_dbjgbkh",
                                                    "score": 3,
                                                    "created_utc": 1482493694.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                                                            "author": "Wendys_frys",
                                                            "id": "dbjlqi9",
                                                            "parent_id": "t1_dbjj3h2",
                                                            "score": 3,
                                                            "created_utc": 1482500471.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "There has been a bit of research into the microbiome of the skin (and by extension the hair) and how washing with soap just destroys it. I don't have the info about it off hand; my wife is a biochemist who studies the gut microbiome and tells me about it a lot. There is specifically one researcher who has stopped using soap or deodorant, and instead used some kind of body rub he made to facilitate the growth of some specific types of bacteria, and got to the point that he doesn't have body odor or problems with oily hair/skin anymore.\n\nPast that, washing with water will get the majority of the dead skin cells and such off your skin and out of your hair.",
                                    "author": "Lucosis",
                                    "id": "dbjok80",
                                    "parent_id": "t1_dbjeu8r",
                                    "score": 3,
                                    "created_utc": 1482505667.0,
                                    "replies": [
                                        {
                                            "body": "Would love some more info on this like the name of that rub",
                                            "author": "KIAN420",
                                            "id": "dbllrbs",
                                            "parent_id": "t1_dbjok80",
                                            "score": 2,
                                            "created_utc": 1482629298.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Just an afterthought, I agree with /u/Top_Hat_Matt that you should try nopoo. Unfortunately as much as I'd like to be a nopoo nazi and say it works 100% of the time, it doesn't. It's worth a shot but be vigilant when doing it because it could definitely look bad. But if you have a fresh cut and don't go to sports clips it may look intentional instead of unkempt and gross. Although there's only very slim chance it will never look good\n\nFor me nopoo worked instantly on my hair and never had a blunder stage. However I've heard of it taking up to six months for some unlucky few with longer hair. The extraordinarily long amount of time was probably because people try to do complicated tricks to make it look nice in the process (weird shit like baking soda and putting yolk in their hair). ",
                            "author": "SillySalamander6",
                            "id": "dbj0k0s",
                            "parent_id": "t1_dbizyao",
                            "score": 1,
                            "created_utc": 1482455610.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Personally I still think that side view looks good ",
                    "author": "Blizzzzz",
                    "id": "dbjptqe",
                    "parent_id": "t1_dbitwyr",
                    "score": 4,
                    "created_utc": 1482507562.0,
                    "replies": [
                        {
                            "body": "When I see that side view I think it just reminds me of how frustrating it can be to tame the sides. I think for most people doing it they will come out with \"shelf\" hair where it sticks out and is too thick. Maybe that's why I don't like it that much but I prefer a more clean cut.\n\nDon't get me wrong though objectively it is a superior cut. ",
                            "author": "SillySalamander6",
                            "id": "dbjtfow",
                            "parent_id": "t1_dbjptqe",
                            "score": 2,
                            "created_utc": 1482512402.0,
                            "replies": [
                                {
                                    "body": "Oh right fair enough, I misunderstood and thought you using the side view is a reason against the hair cut, but I guess I read your comment wrong or something ",
                                    "author": "Blizzzzz",
                                    "id": "dbjxva5",
                                    "parent_id": "t1_dbjtfow",
                                    "score": 2,
                                    "created_utc": 1482518046.0,
                                    "replies": [
                                        {
                                            "body": "No you read it right. I don't like it that much. But I acknowledge all together he has good hair, just not my taste\n\nEdit: I do think it's objectively a bit overrated though",
                                            "author": "SillySalamander6",
                                            "id": "dbjyau3",
                                            "parent_id": "t1_dbjxva5",
                                            "score": 2,
                                            "created_utc": 1482518594.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
                                                    "author": "Blizzzzz",
                                                    "id": "dbjzhre",
                                                    "parent_id": "t1_dbjyau3",
                                                    "score": 2,
                                                    "created_utc": 1482520171.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What are you doing giving real advice? This is r/malehairadvise",
                    "author": "EyeMAdam",
                    "id": "dbpcof9",
                    "parent_id": "t1_dbitwyr",
                    "score": 2,
                    "created_utc": 1482896521.0,
                    "replies": [
                        {
                            "body": "Maybe just wasting my time. I enjoyed typing it up but I wouldn't be suprised it I saw more posted after this",
                            "author": "SillySalamander6",
                            "id": "dbpd9de",
                            "parent_id": "t1_dbpcof9",
                            "score": 1,
                            "created_utc": 1482897412.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This needs to be posted from now on this damn pic is posted lol",
                    "author": "ArtisticAquaMan",
                    "id": "dbked61",
                    "parent_id": "t1_dbitwyr",
                    "score": 1,
                    "created_utc": 1482542942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What about Abe Lincoln?",
            "author": "jmjf7",
            "id": "dbigsxo",
            "parent_id": "t1_dbifk9q",
            "score": 7,
            "created_utc": 1482429394.0,
            "replies": [
                {
                    "body": "Is honest Abe known for his luscious hair? ",
                    "author": null,
                    "id": "dbiiyc4",
                    "parent_id": "t1_dbigsxo",
                    "score": 14,
                    "created_utc": 1482431975.0,
                    "replies": [
                        {
                            "body": "Didn't hurt him in the election, that's for sure.",
                            "author": null,
                            "id": "dbiyedj",
                            "parent_id": "t1_dbiiyc4",
                            "score": 6,
                            "created_utc": 1482452407.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah everyone knows that there was no such thing as hair product until u/god_of_this_age's great white hope product \"American Crew Fiber\" came out in 1991, obviously the only type of product.",
            "author": null,
            "id": "dbiro7e",
            "parent_id": "t1_dbifk9q",
            "score": 6,
            "created_utc": 1482442849.0,
            "replies": []
        },
        {
            "body": "Or he had American Crew Fiber?? ",
            "author": "PEEDUR",
            "id": "dbj86i5",
            "parent_id": "t1_dbifk9q",
            "score": 2,
            "created_utc": 1482466818.0,
            "replies": []
        },
        {
            "body": "wasn't this guy rich he probably had hair care products",
            "author": "MarBakwas",
            "id": "dbij1ik",
            "parent_id": "t1_dbifk9q",
            "score": 6,
            "created_utc": 1482432079.0,
            "replies": [
                {
                    "body": "He wasn't rich at all. Rather poor. ",
                    "author": null,
                    "id": "dbiygwj",
                    "parent_id": "t1_dbij1ik",
                    "score": 9,
                    "created_utc": 1482452514.0,
                    "replies": [
                        {
                            "body": "In this photo though?",
                            "author": "incharge21",
                            "id": "dbj9jnf",
                            "parent_id": "t1_dbiygwj",
                            "score": 1,
                            "created_utc": 1482468923.0,
                            "replies": [
                                {
                                    "body": "Na. He looks really young in this photo. Like after he dropped out of school. So yeah, no money. \n\nI think this is his mugshot actually. ",
                                    "author": null,
                                    "id": "dbj9oef",
                                    "parent_id": "t1_dbj9jnf",
                                    "score": 6,
                                    "created_utc": 1482469150.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not gonna lie and no homo - but Stalin was hot. ",
            "author": "bitcoin_noob",
            "id": "dbise0z",
            "parent_id": "t1_dbiqnht",
            "score": 18,
            "created_utc": 1482443781.0,
            "replies": [
                {
                    "body": "Not gonna lie, that's actually not Stalin. That's a propaganda picture. [Here](http://i.amz.mshcdn.com/DhcU91nX2lZ6E4JjHVJiU2w3kJo=/http%3A%2F%2Fa.amz.mshcdn.com%2Fwp-content%2Fuploads%2F2016%2F03%2Fstalin-11.jpg) is an actual, verified picture of Stalin from the same time period. Nobody knows who the guy in the other picture was but it's clear that it's *not* Stalin as his facial structure is completely different (especially when you compare the profile shots), ears are a different shape and hair insertion points are different.",
                    "author": "XeroMotivation",
                    "id": "dbit41z",
                    "parent_id": "t1_dbise0z",
                    "score": 12,
                    "created_utc": 1482444775.0,
                    "replies": [
                        {
                            "body": "I've read that it is actually Stalin, but it is a photoshopped picture based off a painting.\n\nedit: see here I was a little wrong https://www.reddit.com/r/AskHistorians/comments/2d8at2/was_that_young_handsome_stalin_photo_edited_at/",
                            "author": "microcrash",
                            "id": "dbiusnz",
                            "parent_id": "t1_dbit41z",
                            "score": 6,
                            "created_utc": 1482447125.0,
                            "replies": [
                                {
                                    "body": "Either way it's not a legitimate, unedited photo of Stalin. It's either someone else or there's been heavy modification done to it.",
                                    "author": "XeroMotivation",
                                    "id": "dbiwdz3",
                                    "parent_id": "t1_dbiusnz",
                                    "score": 3,
                                    "created_utc": 1482449418.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Ah yes, that looks more like a young version of old Stalin. ",
                            "author": "bitcoin_noob",
                            "id": "dbix5v3",
                            "parent_id": "t1_dbit41z",
                            "score": 3,
                            "created_utc": 1482450562.0,
                            "replies": []
                        },
                        {
                            "body": "That's a picture of Sacha Baron Cohen",
                            "author": "astro_basterd",
                            "id": "dbj8mme",
                            "parent_id": "t1_dbit41z",
                            "score": 2,
                            "created_utc": 1482467486.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "*Only showering once a week does wonders for your roots!*",
            "author": null,
            "id": "dbir8il",
            "parent_id": "t1_dbil9fc",
            "score": 10,
            "created_utc": 1482442280.0,
            "replies": []
        },
        {
            "body": "95 percent jokes 5 percent real answers. Except one person here actually answered it lol",
            "author": "SillySalamander6",
            "id": "dbiu19r",
            "parent_id": "t1_dbirc7k",
            "score": 3,
            "created_utc": 1482446047.0,
            "replies": []
        },
        {
            "body": "Serious question: Are you supposed to apply pomade while your hair is wet?  I usually blow dry mine first until it is as close to dry as I can get.",
            "author": "mission17",
            "id": "dbjek2s",
            "parent_id": "t1_dbirc7k",
            "score": 1,
            "created_utc": 1482479601.0,
            "replies": [
                {
                    "body": "You don't have to, but my hair doesn't like pomade unless its damp. So I wet it, dry it as much as I can while maintaining a decent dampness, and then apply the pomade. Works great for me!",
                    "author": null,
                    "id": "dbjw2yr",
                    "parent_id": "t1_dbjek2s",
                    "score": 2,
                    "created_utc": 1482515785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "deleted  ^^^^^^^^^^^^^^^^0.4652  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/29360)",
            "author": "fishdaddyflex",
            "id": "dbiqdy2",
            "parent_id": "t1_dbip8kf",
            "score": 7,
            "created_utc": 1482441185.0,
            "replies": []
        },
        {
            "body": "That's because this sub is shit.",
            "author": "XeroMotivation",
            "id": "dbit5hx",
            "parent_id": "t1_dbip8kf",
            "score": 7,
            "created_utc": 1482444829.0,
            "replies": []
        },
        {
            "body": "/u/_oats_ this right here is the real answer. Just stop washing your hair. You'll get past the nasty feeling period after 2 weeks, use dry shampoo or conditioner only washing to get past it. May be odd at first but your hair will be healthier and look better.\n\nAs for product, just use a pomade like the above comment suggests.",
            "author": "Top_Hat_Matt",
            "id": "dbizyao",
            "parent_id": "t1_dbitwyr",
            "score": 11,
            "created_utc": 1482454715.0,
            "replies": [
                {
                    "body": ">stop washing your hair \n\nWouldn't this have the opposite affect of \"healthy\"? Legitimate question as not washing hair not only sounds really gross, but also a terrible idea if you have any form of intensive labour occur at any time after not washing your hair for awhile. I mean sweat and dirt and stuff is bad. \n\nOr am I misunderstanding? Forgive me if I am it's 3am and I may not be comprehending what you're saying. Please correct me if I am wrong. ",
                    "author": "Wendys_frys",
                    "id": "dbjeu8r",
                    "parent_id": "t1_dbizyao",
                    "score": 2,
                    "created_utc": 1482480372.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "dbjg759",
                            "parent_id": "t1_dbjeu8r",
                            "score": 7,
                            "created_utc": 1482484340.0,
                            "replies": [
                                {
                                    "body": "So still basically the same thing? I feel water wouldn't really clean your hair. I mean you wouldn't want dirty hair simple for a style would you?",
                                    "author": "Wendys_frys",
                                    "id": "dbjgbkh",
                                    "parent_id": "t1_dbjg759",
                                    "score": 2,
                                    "created_utc": 1482484718.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "dbjgk4r",
                                            "parent_id": "t1_dbjgbkh",
                                            "score": 4,
                                            "created_utc": 1482485469.0,
                                            "replies": [
                                                {
                                                    "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                                                    "author": "Wendys_frys",
                                                    "id": "dbjls2j",
                                                    "parent_id": "t1_dbjgk4r",
                                                    "score": 1,
                                                    "created_utc": 1482500564.0,
                                                    "replies": [
                                                        {
                                                            "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                                                            "author": "james_strange",
                                                            "id": "dbjqg8e",
                                                            "parent_id": "t1_dbjls2j",
                                                            "score": 3,
                                                            "created_utc": 1482508438.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You're correct! Nopoo is disgusting.",
                                            "author": "firekil",
                                            "id": "dbjj3h2",
                                            "parent_id": "t1_dbjgbkh",
                                            "score": 3,
                                            "created_utc": 1482493694.0,
                                            "replies": [
                                                {
                                                    "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                                                    "author": "Wendys_frys",
                                                    "id": "dbjlqi9",
                                                    "parent_id": "t1_dbjj3h2",
                                                    "score": 3,
                                                    "created_utc": 1482500471.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "There has been a bit of research into the microbiome of the skin (and by extension the hair) and how washing with soap just destroys it. I don't have the info about it off hand; my wife is a biochemist who studies the gut microbiome and tells me about it a lot. There is specifically one researcher who has stopped using soap or deodorant, and instead used some kind of body rub he made to facilitate the growth of some specific types of bacteria, and got to the point that he doesn't have body odor or problems with oily hair/skin anymore.\n\nPast that, washing with water will get the majority of the dead skin cells and such off your skin and out of your hair.",
                            "author": "Lucosis",
                            "id": "dbjok80",
                            "parent_id": "t1_dbjeu8r",
                            "score": 3,
                            "created_utc": 1482505667.0,
                            "replies": [
                                {
                                    "body": "Would love some more info on this like the name of that rub",
                                    "author": "KIAN420",
                                    "id": "dbllrbs",
                                    "parent_id": "t1_dbjok80",
                                    "score": 2,
                                    "created_utc": 1482629298.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Just an afterthought, I agree with /u/Top_Hat_Matt that you should try nopoo. Unfortunately as much as I'd like to be a nopoo nazi and say it works 100% of the time, it doesn't. It's worth a shot but be vigilant when doing it because it could definitely look bad. But if you have a fresh cut and don't go to sports clips it may look intentional instead of unkempt and gross. Although there's only very slim chance it will never look good\n\nFor me nopoo worked instantly on my hair and never had a blunder stage. However I've heard of it taking up to six months for some unlucky few with longer hair. The extraordinarily long amount of time was probably because people try to do complicated tricks to make it look nice in the process (weird shit like baking soda and putting yolk in their hair). ",
                    "author": "SillySalamander6",
                    "id": "dbj0k0s",
                    "parent_id": "t1_dbizyao",
                    "score": 1,
                    "created_utc": 1482455610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally I still think that side view looks good ",
            "author": "Blizzzzz",
            "id": "dbjptqe",
            "parent_id": "t1_dbitwyr",
            "score": 4,
            "created_utc": 1482507562.0,
            "replies": [
                {
                    "body": "When I see that side view I think it just reminds me of how frustrating it can be to tame the sides. I think for most people doing it they will come out with \"shelf\" hair where it sticks out and is too thick. Maybe that's why I don't like it that much but I prefer a more clean cut.\n\nDon't get me wrong though objectively it is a superior cut. ",
                    "author": "SillySalamander6",
                    "id": "dbjtfow",
                    "parent_id": "t1_dbjptqe",
                    "score": 2,
                    "created_utc": 1482512402.0,
                    "replies": [
                        {
                            "body": "Oh right fair enough, I misunderstood and thought you using the side view is a reason against the hair cut, but I guess I read your comment wrong or something ",
                            "author": "Blizzzzz",
                            "id": "dbjxva5",
                            "parent_id": "t1_dbjtfow",
                            "score": 2,
                            "created_utc": 1482518046.0,
                            "replies": [
                                {
                                    "body": "No you read it right. I don't like it that much. But I acknowledge all together he has good hair, just not my taste\n\nEdit: I do think it's objectively a bit overrated though",
                                    "author": "SillySalamander6",
                                    "id": "dbjyau3",
                                    "parent_id": "t1_dbjxva5",
                                    "score": 2,
                                    "created_utc": 1482518594.0,
                                    "replies": [
                                        {
                                            "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
                                            "author": "Blizzzzz",
                                            "id": "dbjzhre",
                                            "parent_id": "t1_dbjyau3",
                                            "score": 2,
                                            "created_utc": 1482520171.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are you doing giving real advice? This is r/malehairadvise",
            "author": "EyeMAdam",
            "id": "dbpcof9",
            "parent_id": "t1_dbitwyr",
            "score": 2,
            "created_utc": 1482896521.0,
            "replies": [
                {
                    "body": "Maybe just wasting my time. I enjoyed typing it up but I wouldn't be suprised it I saw more posted after this",
                    "author": "SillySalamander6",
                    "id": "dbpd9de",
                    "parent_id": "t1_dbpcof9",
                    "score": 1,
                    "created_utc": 1482897412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This needs to be posted from now on this damn pic is posted lol",
            "author": "ArtisticAquaMan",
            "id": "dbked61",
            "parent_id": "t1_dbitwyr",
            "score": 1,
            "created_utc": 1482542942.0,
            "replies": []
        },
        {
            "body": "Is honest Abe known for his luscious hair? ",
            "author": null,
            "id": "dbiiyc4",
            "parent_id": "t1_dbigsxo",
            "score": 14,
            "created_utc": 1482431975.0,
            "replies": [
                {
                    "body": "Didn't hurt him in the election, that's for sure.",
                    "author": null,
                    "id": "dbiyedj",
                    "parent_id": "t1_dbiiyc4",
                    "score": 6,
                    "created_utc": 1482452407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He wasn't rich at all. Rather poor. ",
            "author": null,
            "id": "dbiygwj",
            "parent_id": "t1_dbij1ik",
            "score": 9,
            "created_utc": 1482452514.0,
            "replies": [
                {
                    "body": "In this photo though?",
                    "author": "incharge21",
                    "id": "dbj9jnf",
                    "parent_id": "t1_dbiygwj",
                    "score": 1,
                    "created_utc": 1482468923.0,
                    "replies": [
                        {
                            "body": "Na. He looks really young in this photo. Like after he dropped out of school. So yeah, no money. \n\nI think this is his mugshot actually. ",
                            "author": null,
                            "id": "dbj9oef",
                            "parent_id": "t1_dbj9jnf",
                            "score": 6,
                            "created_utc": 1482469150.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not gonna lie, that's actually not Stalin. That's a propaganda picture. [Here](http://i.amz.mshcdn.com/DhcU91nX2lZ6E4JjHVJiU2w3kJo=/http%3A%2F%2Fa.amz.mshcdn.com%2Fwp-content%2Fuploads%2F2016%2F03%2Fstalin-11.jpg) is an actual, verified picture of Stalin from the same time period. Nobody knows who the guy in the other picture was but it's clear that it's *not* Stalin as his facial structure is completely different (especially when you compare the profile shots), ears are a different shape and hair insertion points are different.",
            "author": "XeroMotivation",
            "id": "dbit41z",
            "parent_id": "t1_dbise0z",
            "score": 12,
            "created_utc": 1482444775.0,
            "replies": [
                {
                    "body": "I've read that it is actually Stalin, but it is a photoshopped picture based off a painting.\n\nedit: see here I was a little wrong https://www.reddit.com/r/AskHistorians/comments/2d8at2/was_that_young_handsome_stalin_photo_edited_at/",
                    "author": "microcrash",
                    "id": "dbiusnz",
                    "parent_id": "t1_dbit41z",
                    "score": 6,
                    "created_utc": 1482447125.0,
                    "replies": [
                        {
                            "body": "Either way it's not a legitimate, unedited photo of Stalin. It's either someone else or there's been heavy modification done to it.",
                            "author": "XeroMotivation",
                            "id": "dbiwdz3",
                            "parent_id": "t1_dbiusnz",
                            "score": 3,
                            "created_utc": 1482449418.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ah yes, that looks more like a young version of old Stalin. ",
                    "author": "bitcoin_noob",
                    "id": "dbix5v3",
                    "parent_id": "t1_dbit41z",
                    "score": 3,
                    "created_utc": 1482450562.0,
                    "replies": []
                },
                {
                    "body": "That's a picture of Sacha Baron Cohen",
                    "author": "astro_basterd",
                    "id": "dbj8mme",
                    "parent_id": "t1_dbit41z",
                    "score": 2,
                    "created_utc": 1482467486.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You don't have to, but my hair doesn't like pomade unless its damp. So I wet it, dry it as much as I can while maintaining a decent dampness, and then apply the pomade. Works great for me!",
            "author": null,
            "id": "dbjw2yr",
            "parent_id": "t1_dbjek2s",
            "score": 2,
            "created_utc": 1482515785.0,
            "replies": []
        },
        {
            "body": ">stop washing your hair \n\nWouldn't this have the opposite affect of \"healthy\"? Legitimate question as not washing hair not only sounds really gross, but also a terrible idea if you have any form of intensive labour occur at any time after not washing your hair for awhile. I mean sweat and dirt and stuff is bad. \n\nOr am I misunderstanding? Forgive me if I am it's 3am and I may not be comprehending what you're saying. Please correct me if I am wrong. ",
            "author": "Wendys_frys",
            "id": "dbjeu8r",
            "parent_id": "t1_dbizyao",
            "score": 2,
            "created_utc": 1482480372.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "dbjg759",
                    "parent_id": "t1_dbjeu8r",
                    "score": 7,
                    "created_utc": 1482484340.0,
                    "replies": [
                        {
                            "body": "So still basically the same thing? I feel water wouldn't really clean your hair. I mean you wouldn't want dirty hair simple for a style would you?",
                            "author": "Wendys_frys",
                            "id": "dbjgbkh",
                            "parent_id": "t1_dbjg759",
                            "score": 2,
                            "created_utc": 1482484718.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "dbjgk4r",
                                    "parent_id": "t1_dbjgbkh",
                                    "score": 4,
                                    "created_utc": 1482485469.0,
                                    "replies": [
                                        {
                                            "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                                            "author": "Wendys_frys",
                                            "id": "dbjls2j",
                                            "parent_id": "t1_dbjgk4r",
                                            "score": 1,
                                            "created_utc": 1482500564.0,
                                            "replies": [
                                                {
                                                    "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                                                    "author": "james_strange",
                                                    "id": "dbjqg8e",
                                                    "parent_id": "t1_dbjls2j",
                                                    "score": 3,
                                                    "created_utc": 1482508438.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You're correct! Nopoo is disgusting.",
                                    "author": "firekil",
                                    "id": "dbjj3h2",
                                    "parent_id": "t1_dbjgbkh",
                                    "score": 3,
                                    "created_utc": 1482493694.0,
                                    "replies": [
                                        {
                                            "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                                            "author": "Wendys_frys",
                                            "id": "dbjlqi9",
                                            "parent_id": "t1_dbjj3h2",
                                            "score": 3,
                                            "created_utc": 1482500471.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There has been a bit of research into the microbiome of the skin (and by extension the hair) and how washing with soap just destroys it. I don't have the info about it off hand; my wife is a biochemist who studies the gut microbiome and tells me about it a lot. There is specifically one researcher who has stopped using soap or deodorant, and instead used some kind of body rub he made to facilitate the growth of some specific types of bacteria, and got to the point that he doesn't have body odor or problems with oily hair/skin anymore.\n\nPast that, washing with water will get the majority of the dead skin cells and such off your skin and out of your hair.",
                    "author": "Lucosis",
                    "id": "dbjok80",
                    "parent_id": "t1_dbjeu8r",
                    "score": 3,
                    "created_utc": 1482505667.0,
                    "replies": [
                        {
                            "body": "Would love some more info on this like the name of that rub",
                            "author": "KIAN420",
                            "id": "dbllrbs",
                            "parent_id": "t1_dbjok80",
                            "score": 2,
                            "created_utc": 1482629298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just an afterthought, I agree with /u/Top_Hat_Matt that you should try nopoo. Unfortunately as much as I'd like to be a nopoo nazi and say it works 100% of the time, it doesn't. It's worth a shot but be vigilant when doing it because it could definitely look bad. But if you have a fresh cut and don't go to sports clips it may look intentional instead of unkempt and gross. Although there's only very slim chance it will never look good\n\nFor me nopoo worked instantly on my hair and never had a blunder stage. However I've heard of it taking up to six months for some unlucky few with longer hair. The extraordinarily long amount of time was probably because people try to do complicated tricks to make it look nice in the process (weird shit like baking soda and putting yolk in their hair). ",
            "author": "SillySalamander6",
            "id": "dbj0k0s",
            "parent_id": "t1_dbizyao",
            "score": 1,
            "created_utc": 1482455610.0,
            "replies": []
        },
        {
            "body": "When I see that side view I think it just reminds me of how frustrating it can be to tame the sides. I think for most people doing it they will come out with \"shelf\" hair where it sticks out and is too thick. Maybe that's why I don't like it that much but I prefer a more clean cut.\n\nDon't get me wrong though objectively it is a superior cut. ",
            "author": "SillySalamander6",
            "id": "dbjtfow",
            "parent_id": "t1_dbjptqe",
            "score": 2,
            "created_utc": 1482512402.0,
            "replies": [
                {
                    "body": "Oh right fair enough, I misunderstood and thought you using the side view is a reason against the hair cut, but I guess I read your comment wrong or something ",
                    "author": "Blizzzzz",
                    "id": "dbjxva5",
                    "parent_id": "t1_dbjtfow",
                    "score": 2,
                    "created_utc": 1482518046.0,
                    "replies": [
                        {
                            "body": "No you read it right. I don't like it that much. But I acknowledge all together he has good hair, just not my taste\n\nEdit: I do think it's objectively a bit overrated though",
                            "author": "SillySalamander6",
                            "id": "dbjyau3",
                            "parent_id": "t1_dbjxva5",
                            "score": 2,
                            "created_utc": 1482518594.0,
                            "replies": [
                                {
                                    "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
                                    "author": "Blizzzzz",
                                    "id": "dbjzhre",
                                    "parent_id": "t1_dbjyau3",
                                    "score": 2,
                                    "created_utc": 1482520171.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe just wasting my time. I enjoyed typing it up but I wouldn't be suprised it I saw more posted after this",
            "author": "SillySalamander6",
            "id": "dbpd9de",
            "parent_id": "t1_dbpcof9",
            "score": 1,
            "created_utc": 1482897412.0,
            "replies": []
        },
        {
            "body": "Didn't hurt him in the election, that's for sure.",
            "author": null,
            "id": "dbiyedj",
            "parent_id": "t1_dbiiyc4",
            "score": 6,
            "created_utc": 1482452407.0,
            "replies": []
        },
        {
            "body": "In this photo though?",
            "author": "incharge21",
            "id": "dbj9jnf",
            "parent_id": "t1_dbiygwj",
            "score": 1,
            "created_utc": 1482468923.0,
            "replies": [
                {
                    "body": "Na. He looks really young in this photo. Like after he dropped out of school. So yeah, no money. \n\nI think this is his mugshot actually. ",
                    "author": null,
                    "id": "dbj9oef",
                    "parent_id": "t1_dbj9jnf",
                    "score": 6,
                    "created_utc": 1482469150.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've read that it is actually Stalin, but it is a photoshopped picture based off a painting.\n\nedit: see here I was a little wrong https://www.reddit.com/r/AskHistorians/comments/2d8at2/was_that_young_handsome_stalin_photo_edited_at/",
            "author": "microcrash",
            "id": "dbiusnz",
            "parent_id": "t1_dbit41z",
            "score": 6,
            "created_utc": 1482447125.0,
            "replies": [
                {
                    "body": "Either way it's not a legitimate, unedited photo of Stalin. It's either someone else or there's been heavy modification done to it.",
                    "author": "XeroMotivation",
                    "id": "dbiwdz3",
                    "parent_id": "t1_dbiusnz",
                    "score": 3,
                    "created_utc": 1482449418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah yes, that looks more like a young version of old Stalin. ",
            "author": "bitcoin_noob",
            "id": "dbix5v3",
            "parent_id": "t1_dbit41z",
            "score": 3,
            "created_utc": 1482450562.0,
            "replies": []
        },
        {
            "body": "That's a picture of Sacha Baron Cohen",
            "author": "astro_basterd",
            "id": "dbj8mme",
            "parent_id": "t1_dbit41z",
            "score": 2,
            "created_utc": 1482467486.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dbjg759",
            "parent_id": "t1_dbjeu8r",
            "score": 7,
            "created_utc": 1482484340.0,
            "replies": [
                {
                    "body": "So still basically the same thing? I feel water wouldn't really clean your hair. I mean you wouldn't want dirty hair simple for a style would you?",
                    "author": "Wendys_frys",
                    "id": "dbjgbkh",
                    "parent_id": "t1_dbjg759",
                    "score": 2,
                    "created_utc": 1482484718.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "dbjgk4r",
                            "parent_id": "t1_dbjgbkh",
                            "score": 4,
                            "created_utc": 1482485469.0,
                            "replies": [
                                {
                                    "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                                    "author": "Wendys_frys",
                                    "id": "dbjls2j",
                                    "parent_id": "t1_dbjgk4r",
                                    "score": 1,
                                    "created_utc": 1482500564.0,
                                    "replies": [
                                        {
                                            "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                                            "author": "james_strange",
                                            "id": "dbjqg8e",
                                            "parent_id": "t1_dbjls2j",
                                            "score": 3,
                                            "created_utc": 1482508438.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You're correct! Nopoo is disgusting.",
                            "author": "firekil",
                            "id": "dbjj3h2",
                            "parent_id": "t1_dbjgbkh",
                            "score": 3,
                            "created_utc": 1482493694.0,
                            "replies": [
                                {
                                    "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                                    "author": "Wendys_frys",
                                    "id": "dbjlqi9",
                                    "parent_id": "t1_dbjj3h2",
                                    "score": 3,
                                    "created_utc": 1482500471.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There has been a bit of research into the microbiome of the skin (and by extension the hair) and how washing with soap just destroys it. I don't have the info about it off hand; my wife is a biochemist who studies the gut microbiome and tells me about it a lot. There is specifically one researcher who has stopped using soap or deodorant, and instead used some kind of body rub he made to facilitate the growth of some specific types of bacteria, and got to the point that he doesn't have body odor or problems with oily hair/skin anymore.\n\nPast that, washing with water will get the majority of the dead skin cells and such off your skin and out of your hair.",
            "author": "Lucosis",
            "id": "dbjok80",
            "parent_id": "t1_dbjeu8r",
            "score": 3,
            "created_utc": 1482505667.0,
            "replies": [
                {
                    "body": "Would love some more info on this like the name of that rub",
                    "author": "KIAN420",
                    "id": "dbllrbs",
                    "parent_id": "t1_dbjok80",
                    "score": 2,
                    "created_utc": 1482629298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh right fair enough, I misunderstood and thought you using the side view is a reason against the hair cut, but I guess I read your comment wrong or something ",
            "author": "Blizzzzz",
            "id": "dbjxva5",
            "parent_id": "t1_dbjtfow",
            "score": 2,
            "created_utc": 1482518046.0,
            "replies": [
                {
                    "body": "No you read it right. I don't like it that much. But I acknowledge all together he has good hair, just not my taste\n\nEdit: I do think it's objectively a bit overrated though",
                    "author": "SillySalamander6",
                    "id": "dbjyau3",
                    "parent_id": "t1_dbjxva5",
                    "score": 2,
                    "created_utc": 1482518594.0,
                    "replies": [
                        {
                            "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
                            "author": "Blizzzzz",
                            "id": "dbjzhre",
                            "parent_id": "t1_dbjyau3",
                            "score": 2,
                            "created_utc": 1482520171.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Na. He looks really young in this photo. Like after he dropped out of school. So yeah, no money. \n\nI think this is his mugshot actually. ",
            "author": null,
            "id": "dbj9oef",
            "parent_id": "t1_dbj9jnf",
            "score": 6,
            "created_utc": 1482469150.0,
            "replies": []
        },
        {
            "body": "Either way it's not a legitimate, unedited photo of Stalin. It's either someone else or there's been heavy modification done to it.",
            "author": "XeroMotivation",
            "id": "dbiwdz3",
            "parent_id": "t1_dbiusnz",
            "score": 3,
            "created_utc": 1482449418.0,
            "replies": []
        },
        {
            "body": "So still basically the same thing? I feel water wouldn't really clean your hair. I mean you wouldn't want dirty hair simple for a style would you?",
            "author": "Wendys_frys",
            "id": "dbjgbkh",
            "parent_id": "t1_dbjg759",
            "score": 2,
            "created_utc": 1482484718.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "dbjgk4r",
                    "parent_id": "t1_dbjgbkh",
                    "score": 4,
                    "created_utc": 1482485469.0,
                    "replies": [
                        {
                            "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                            "author": "Wendys_frys",
                            "id": "dbjls2j",
                            "parent_id": "t1_dbjgk4r",
                            "score": 1,
                            "created_utc": 1482500564.0,
                            "replies": [
                                {
                                    "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                                    "author": "james_strange",
                                    "id": "dbjqg8e",
                                    "parent_id": "t1_dbjls2j",
                                    "score": 3,
                                    "created_utc": 1482508438.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You're correct! Nopoo is disgusting.",
                    "author": "firekil",
                    "id": "dbjj3h2",
                    "parent_id": "t1_dbjgbkh",
                    "score": 3,
                    "created_utc": 1482493694.0,
                    "replies": [
                        {
                            "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                            "author": "Wendys_frys",
                            "id": "dbjlqi9",
                            "parent_id": "t1_dbjj3h2",
                            "score": 3,
                            "created_utc": 1482500471.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Would love some more info on this like the name of that rub",
            "author": "KIAN420",
            "id": "dbllrbs",
            "parent_id": "t1_dbjok80",
            "score": 2,
            "created_utc": 1482629298.0,
            "replies": []
        },
        {
            "body": "No you read it right. I don't like it that much. But I acknowledge all together he has good hair, just not my taste\n\nEdit: I do think it's objectively a bit overrated though",
            "author": "SillySalamander6",
            "id": "dbjyau3",
            "parent_id": "t1_dbjxva5",
            "score": 2,
            "created_utc": 1482518594.0,
            "replies": [
                {
                    "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
                    "author": "Blizzzzz",
                    "id": "dbjzhre",
                    "parent_id": "t1_dbjyau3",
                    "score": 2,
                    "created_utc": 1482520171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dbjgk4r",
            "parent_id": "t1_dbjgbkh",
            "score": 4,
            "created_utc": 1482485469.0,
            "replies": [
                {
                    "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
                    "author": "Wendys_frys",
                    "id": "dbjls2j",
                    "parent_id": "t1_dbjgk4r",
                    "score": 1,
                    "created_utc": 1482500564.0,
                    "replies": [
                        {
                            "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                            "author": "james_strange",
                            "id": "dbjqg8e",
                            "parent_id": "t1_dbjls2j",
                            "score": 3,
                            "created_utc": 1482508438.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're correct! Nopoo is disgusting.",
            "author": "firekil",
            "id": "dbjj3h2",
            "parent_id": "t1_dbjgbkh",
            "score": 3,
            "created_utc": 1482493694.0,
            "replies": [
                {
                    "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
                    "author": "Wendys_frys",
                    "id": "dbjlqi9",
                    "parent_id": "t1_dbjj3h2",
                    "score": 3,
                    "created_utc": 1482500471.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that's a fair point, I've seen this same hair cut in this subreddit and its probably a bit overrated. Although I still do like the style, I just don't have the hair that could pull it off (or the motivation) ",
            "author": "Blizzzzz",
            "id": "dbjzhre",
            "parent_id": "t1_dbjyau3",
            "score": 2,
            "created_utc": 1482520171.0,
            "replies": []
        },
        {
            "body": "This is essentially what I do. Every 2-3 days and I try to use the same shampoo and conditioner each time. Occasionally I don't because I didn't have time to buy some more. ",
            "author": "Wendys_frys",
            "id": "dbjls2j",
            "parent_id": "t1_dbjgk4r",
            "score": 1,
            "created_utc": 1482500564.0,
            "replies": [
                {
                    "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
                    "author": "james_strange",
                    "id": "dbjqg8e",
                    "parent_id": "t1_dbjls2j",
                    "score": 3,
                    "created_utc": 1482508438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's what I thought. Granted I don't use shampoo every single day but I definitely wouldn't stop using it almost all together as I do spend quite a lot of time outside and I don't really want gross nasty hair. ",
            "author": "Wendys_frys",
            "id": "dbjlqi9",
            "parent_id": "t1_dbjj3h2",
            "score": 3,
            "created_utc": 1482500471.0,
            "replies": []
        },
        {
            "body": "2-3 days for me too. I have very fine hair. If it gets too oily it looks like my hair is thinning",
            "author": "james_strange",
            "id": "dbjqg8e",
            "parent_id": "t1_dbjls2j",
            "score": 3,
            "created_utc": 1482508438.0,
            "replies": []
        }
    ]
}