{
    "title": "Somin grew so much in me",
    "post_id": "11rns0p",
    "post_url": "https://www.reddit.com/r/runningman/comments/11rns0p/somin_grew_so_much_in_me/",
    "author": "idontknowanymore2552",
    "body": "So upon watching the last episode, I've realized how much I'm whipped for JSM. She does her best every episode and is just this bundle of sunshine. Then this thought has me questioning on how people could hate on her. \n\nWhen I thought about how they joined. The controversy about SJH and KJK was fairly new that the episodes after that kind of left a bad taste for some fans, including me because I still have yet to watch some episodes after that. Although I've watched JSM and YSC first episode, I think I didn't continue after that and kind of stop watching for a year. \n\nMaybe its just me, but I kind of feel like JSM and YSC were made to be a distraction and to shift the hate from the producer who fired the two to them instead. Because the hate could've been prevented by introducing them like the four family guests or JWJ for example. \n\nAnyway I might just be overthinking this but it just make me sad that they have to undergo so much unnecessary hate.",
    "url": "https://www.reddit.com/r/runningman/comments/11rns0p/somin_grew_so_much_in_me/",
    "score": 193,
    "upvote_ratio": 0.93,
    "created_utc": 1678860275.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Tbh, I wasn't very fond of her when she joined. I would never go as far as hate her, that's just ridiculous, but she wasn't on the top of my list. I don't even remember why... Maybe i wasn't ready for a change in the cast and wanted things to stay as they are. I'm of those who enjoy each and every episode, just watching each week them is a joy itself. After a while, I started noticing how dependent the cast were on her, and how they actually expect a lot more of that \"craziness\" or \"love frog\" that many were uncomfortable with at the beginning, to help with the content. What won me over, was how genuine she is, and how she doesn't try to be someone she isn't, just as normal as any of us, with a past and experiences (bad and good) shaping her to who she is now. How she is actively reaching out to the other members even outside RM, to build a strong chemistry with them as soon as possible, cause she knows RM depends a lot on that aspect. Now she is top of my list, just because she click with each and every member and add unpredictable dynamics within the group. Hard work does not go unnoticed, for most anyway.",
            "author": "Minguri22",
            "id": "jc9jne0",
            "parent_id": "t3_11rns0p",
            "score": 90,
            "created_utc": 1678864075.0,
            "replies": []
        },
        {
            "body": "I will die on the hill saying Somin at some point saved RM. She reignited the spark that is needed during that time. I remembered that period, it was tumultuous, at first KJK and SJH got fired without warning, then they decided to end it together, then KJK managed to persuade the others to stay and continue doing this. Then they got new members.\n\nSomin fit right in with the cast but Sechan took some time to get used to his role. But both of them were adored by the cast members and that chemistry showed until now. \n\nThe chemistry and camaderie of the members are the reason I keep watching. When this show ends, I’m gonna weep, it may not be the best show ever but the memories attached to this show is priceless.",
            "author": "echofades",
            "id": "jc9zu02",
            "parent_id": "t3_11rns0p",
            "score": 127,
            "created_utc": 1678877275.0,
            "replies": [
                {
                    "body": "You won't stand alone on that hill I'm sure. RM had been so stale and declining for a while and the energy she brought into the mix really ignited a new spark in the cast. The show experienced a second spring I would not have thought possible.",
                    "author": "letuerk",
                    "id": "jcaatxo",
                    "parent_id": "t1_jc9zu02",
                    "score": 40,
                    "created_utc": 1678883930.0,
                    "replies": [
                        {
                            "body": "Yeah, definitely. Chulmin's first run as PD (346-410) starting with bringing in JSM and YSC and ending with the Family Package is (in my opinion) the best run of Running Man episodes outside of the first 100, and Somin is a huge part of that. They recaptured lightning in a bottle and had great episodes almost every single week for more than a year. I think it's unfair to even call it a silver age of the show, it's a second golden age.",
                            "author": "Ocean_Madness",
                            "id": "jcdho63",
                            "parent_id": "t1_jcaatxo",
                            "score": 20,
                            "created_utc": 1678929238.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You won't die alone on that hill. She did saved rm and gave the show another fresh breath of life. People used to hate her for stealing a certain member's screentime but they got to know the show was on the verge of cancellation, chul-min PD had to do everything he can to ensure the show is entertaining enough for SBS to not cancel it.",
                    "author": "Ok_Reflection_1849",
                    "id": "jcebv0v",
                    "parent_id": "t1_jc9zu02",
                    "score": 12,
                    "created_utc": 1678944848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think they were added to shift hate from anyone to them. I think they were added to breath fresh air into a dying program, which worked. People chose to hate on her for their own messed up reasons",
            "author": "mong-dol",
            "id": "jc9q999",
            "parent_id": "t3_11rns0p",
            "score": 43,
            "created_utc": 1678869580.0,
            "replies": [
                {
                    "body": "Haters are too delusional to see what's the problem with RM. Even yjs and lks combo can't save it. And girl get hated just because she's doing best with her job is nut.",
                    "author": "No_Independence_1067",
                    "id": "jd1izsl",
                    "parent_id": "t1_jc9q999",
                    "score": 3,
                    "created_utc": 1679370366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She's the whole reason why I started watching running man again. I'm happy to see many people liking her now cus she deserve it.",
            "author": "Ok_Reflection_1849",
            "id": "jc9x3a2",
            "parent_id": "t3_11rns0p",
            "score": 35,
            "created_utc": 1678875204.0,
            "replies": []
        },
        {
            "body": "somin, as well as sechan, do not deserve the hate they get. they added new colors to the show; both of them are not afraid to try things just to make viewers laugh. especially somin, we can see her 100% effort literally in every single episode. so who could possibly hate them",
            "author": "_abcj",
            "id": "jc9y91x",
            "parent_id": "t3_11rns0p",
            "score": 35,
            "created_utc": 1678876102.0,
            "replies": [
                {
                    "body": "SeChan is the reason I FF during the episodes.",
                    "author": "Ohnosheshouldnt26",
                    "id": "jcfclzx",
                    "parent_id": "t1_jc9y91x",
                    "score": -1,
                    "created_utc": 1678971912.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "After watching the recent episode, All I can say is Somin has a pure heart.",
            "author": "Patient_No_97",
            "id": "jca68na",
            "parent_id": "t3_11rns0p",
            "score": 32,
            "created_utc": 1678881405.0,
            "replies": [
                {
                    "body": "The purest!!",
                    "author": "ImpossibleWarning6",
                    "id": "jcd53d1",
                    "parent_id": "t1_jca68na",
                    "score": 15,
                    "created_utc": 1678923837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm convinced the haters, especially on IG, does not watch the show.",
            "author": "CoffeeInBowl27",
            "id": "jca0g3a",
            "parent_id": "t3_11rns0p",
            "score": 26,
            "created_utc": 1678877702.0,
            "replies": [
                {
                    "body": "Both IG and twitter have a lot of that certain member fans who hate on somin",
                    "author": "Ok_Reflection_1849",
                    "id": "jcec1ek",
                    "parent_id": "t1_jca0g3a",
                    "score": 12,
                    "created_utc": 1678944977.0,
                    "replies": []
                },
                {
                    "body": "I think YouTube as well. I remember reading comments that Somin was taking away Jihyo's camera time... love Jihyo but the show isn't going to show someone standing still, plus each member has a cameraman assigned to them so everyone's recorded, was baffled about those screen time comments. Even just after she had made an appearance, the comments on dramacool.vc about Somin were horrific. \n\nSomin and Sechan were a breath of fresh air, love them joining. Love all the members past and present.",
                    "author": "Sivassassin",
                    "id": "jcodohv",
                    "parent_id": "t1_jca0g3a",
                    "score": 8,
                    "created_utc": 1679130588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She is my fav, I still rewatch all the craziness from the time she joined - the Japan and other tours they had. Not to sound dramatic but her episodes helped me when I was depressed and stressed",
            "author": "Maleficent-Part-9549",
            "id": "jcan36q",
            "parent_id": "t3_11rns0p",
            "score": 26,
            "created_utc": 1678889507.0,
            "replies": []
        },
        {
            "body": "I became a running man fan last november.\n\nI happen to stumble upon 'Sixth Sense is chaotic' video while searching for shows Jessi was in. I'm a fan of her's so I decided to watch all episodes from season 1, but my attention gradually shifted from Jessi to Somin after 4 episodes. I absolutely love Somin's sense of humor. She's also the loveliest entertainer I've seen on korean shows.\n\nSo I went searching for Jeon Somin on youtube, found out she was an actress and on Running man.   I ended up watching 300+ episodes in 4 months.",
            "author": "Puzzled-Purpose-6922",
            "id": "jc9oh7d",
            "parent_id": "t3_11rns0p",
            "score": 49,
            "created_utc": 1678868061.0,
            "replies": [
                {
                    "body": "She carried that show a lot. Her and YJS. When she wasn't around during season 3, I felt it lacked so much. She's got another show with YJS and Nucksal. Skip Dating.",
                    "author": "Worth_Chemist_3361",
                    "id": "jc9phy0",
                    "parent_id": "t1_jc9oh7d",
                    "score": 39,
                    "created_utc": 1678868930.0,
                    "replies": [
                        {
                            "body": "After watching her in season 2, I realized that she is definitely a top entertainer. She knows how to work with anything thrown at her. Her quick wit makes even the most awkward situations entertaining.",
                            "author": "Puzzled-Purpose-6922",
                            "id": "jc9qb2e",
                            "parent_id": "t1_jc9phy0",
                            "score": 28,
                            "created_utc": 1678869622.0,
                            "replies": [
                                {
                                    "body": "This is what I find amazing about LKS and JSM. They're great at diffusing the awkwardness because they can go of their ego in a pinch. You can tell that YJS loves working with both of them but he also did say he can't stand JSM's incessant curiousity and chattering when they're off cam.",
                                    "author": "hunmingnoisehdb",
                                    "id": "jc9r5c7",
                                    "parent_id": "t1_jc9qb2e",
                                    "score": 35,
                                    "created_utc": 1678870337.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly when i started rewatching from the start i missed YSC and JSM craziness. It's was kinda weird feeling that i was missing them heheh",
            "author": "darkapao",
            "id": "jc9h3lj",
            "parent_id": "t3_11rns0p",
            "score": 45,
            "created_utc": 1678862074.0,
            "replies": [
                {
                    "body": "Rightt I love old episodes and always rewatching them but now cant help thinking “I bet JSM will have so much fun doing this mission”, “if JSM here I wonder what kind of ridiculous skit she will pull out” and much more like omg the way she solidified her existence in RM is very impactful",
                    "author": "itsbrutal-0ut-here",
                    "id": "jfdwvnw",
                    "parent_id": "t1_jc9h3lj",
                    "score": 3,
                    "created_utc": 1680912795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Literally me!! I cracked up so much from watching JSM in the most recent episode — not many people can >!kick their leg up in the air to pretend to be a zebra.!< Only she can!!!",
            "author": "sunnyflowerr",
            "id": "jc9m6mn",
            "parent_id": "t3_11rns0p",
            "score": 45,
            "created_utc": 1678866143.0,
            "replies": [
                {
                    "body": "ambrella....ambrella\n\ncow cancel",
                    "author": "shems-2383",
                    "id": "jcf6cyt",
                    "parent_id": "t1_jc9m6mn",
                    "score": 14,
                    "created_utc": 1678968631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remember reddit discussion on her first episode as a member, some user typed something like 'Somin seems ok but I'll wait for more eps to to comments about her'. Thinking back, reddit community pretty open to her and and feels like safest place for her fans at that time to have discussion.\n\nedit: grammar",
            "author": "honechan",
            "id": "jc9znv8",
            "parent_id": "t3_11rns0p",
            "score": 24,
            "created_utc": 1678877151.0,
            "replies": []
        },
        {
            "body": "I'm a fan of her since she first joined rm \nHer \"craziness\"  and loveline is just lol\n\nEdit: spelling",
            "author": "shems-2383",
            "id": "jca03lf",
            "parent_id": "t3_11rns0p",
            "score": 20,
            "created_utc": 1678877464.0,
            "replies": []
        },
        {
            "body": "i hope y’all are watching recent eps cause they’ve been VERY VERY CRAZY!! i thought that once lks left, it’ll never be that crazy funny again. but the 2023 eps really left me in shambles. finally realized the absence of ysc in eps where he wasn’t there bc he plays a really vital role and jsm is the new variety genius. people still hate on sm so much and i hope they stop doing it. it’s been like, 6 years since they joined. aren’t they tired of it? also loving how hyungin pd is literally giving the cast back the ‘control’ to the show, less stricter that iron min or bopil pd but the casts run through with the material and just talk nonstop 😆 i hope they can show forever!",
            "author": "taylorsanatomy13_",
            "id": "jcae0m4",
            "parent_id": "t3_11rns0p",
            "score": 22,
            "created_utc": 1678885495.0,
            "replies": []
        },
        {
            "body": "I will honestly say that Somin saved the show for me. It had just been so stale for a while that seeing her act crazy and create lovelines for herself was hysterical. After a year with them being added, she became almost LKS level comedian to me and as essential to the show as  YJS and JSJ.",
            "author": "detached_18",
            "id": "jcanrk8",
            "parent_id": "t3_11rns0p",
            "score": 23,
            "created_utc": 1678889784.0,
            "replies": []
        },
        {
            "body": "I’ve always found her to be funny and cute, but my fondness for her grew in E641 when she started crying in response to KJK. Such a beautiful soul!",
            "author": "MrHydeUK",
            "id": "jcatymo",
            "parent_id": "t3_11rns0p",
            "score": 20,
            "created_utc": 1678892235.0,
            "replies": []
        },
        {
            "body": "I've always loved both of them. (JSM and YSC) although in the early days of them I kinda disliked how YSC handled/throw jokes and there was no \"chemistry\" between Him and the group.  Feels like He cant handle the jokes that well and he's not that \"witty\" for me at that time. But now I think he found his rhythm and I love the both of them. Although I personally think JSM became the best person to uplift the show when it was going downhill for me. (so I was surprised before when she got a lot of hate she was so good and a breath of fresh air).",
            "author": "vargyrrivia",
            "id": "jcanlvs",
            "parent_id": "t3_11rns0p",
            "score": 18,
            "created_utc": 1678889719.0,
            "replies": []
        },
        {
            "body": "She's a role model. Always smiling and giving her all. ❤️",
            "author": "cheepotle",
            "id": "jcd9ezd",
            "parent_id": "t3_11rns0p",
            "score": 18,
            "created_utc": 1678925681.0,
            "replies": []
        },
        {
            "body": "I was so glad when she joined with Sechan. Tbh the KJK and SJH issue already settled even before JSM and YSC joined. They need refreshing badly at that point, they said they were that close to be cancelled or something like that. All in all she is a force to be reckoned with as variety show actress, her comedic timing/chops, craziness, etc is on par with LKS, that's great comparison right there.",
            "author": "International-Chef53",
            "id": "jcbuvem",
            "parent_id": "t3_11rns0p",
            "score": 15,
            "created_utc": 1678905973.0,
            "replies": []
        },
        {
            "body": "Before she joined RM. I only knew her due to name confusion with actress Jung So Min.  She was on RM few times but didn’t stand out THAT much. Especially first time.  \n\nWhen they announced she’s joining RM my first thought was “Why?”\n\nAnd boy I was wrong.  She was cute, funny, she was already in sync with RM team from the day she joined the show. \n\nNow can’t watch the show where she’s missing. And she can now make a scene with anyone and make it funny. \n\nShe’s hard worker. Kinda want to see more of her in dramas tho.",
            "author": "gyojoo",
            "id": "jce23ng",
            "parent_id": "t3_11rns0p",
            "score": 14,
            "created_utc": 1678938779.0,
            "replies": [
                {
                    "body": "There's an episode where there's singer somin also\nHopefully there is an ep for 3 somin",
                    "author": "shems-2383",
                    "id": "jce85r8",
                    "parent_id": "t1_jce23ng",
                    "score": 5,
                    "created_utc": 1678942330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like her as guest, YSC too. Starting to like RM again because of global race and other projects after that",
            "author": "NieR_SemiAutomata",
            "id": "jc9tbha",
            "parent_id": "t3_11rns0p",
            "score": 10,
            "created_utc": 1678872159.0,
            "replies": []
        },
        {
            "body": "Same. I wasn’t a fan of JSM and YSC when they first joined, and I keep on wondering what running man saw with them to put them in the cast. BUT they proved me all wrong! YSC is now my favorite comedienne, he is a maknae on RM but whenever I see him with his colleagues, I can really see that he is a true senior on his field. Same as JSM, she is a ray of sunshine! With an episode without either of them, you can really feel the void.",
            "author": "Greedy-Breadfruit-57",
            "id": "jc9uih6",
            "parent_id": "t3_11rns0p",
            "score": 14,
            "created_utc": 1678873153.0,
            "replies": []
        },
        {
            "body": "I gotta admit that I got swayed by her haters narratives before, but as time goes on I can see her being one of members who really exceed too much effort on the show and started to like her",
            "author": "whitefang0824",
            "id": "jca1hnb",
            "parent_id": "t3_11rns0p",
            "score": 14,
            "created_utc": 1678878419.0,
            "replies": []
        },
        {
            "body": "JSM (and YSC) contributed a lot and both of them fits well to the current format of the show. Without them, RM would either be re-casted for a new season or has already been cancelled years back.\n\nThose people who still hates the \"new members\" to death should take a step back now since they are set to surpass Gary's length of tenure as a member this year if all goes well. Same goes to those fans who drags SJH down and calling her to quit for the sake of defending JSM, just saying.",
            "author": "EpikMint",
            "id": "jcalk4x",
            "parent_id": "t3_11rns0p",
            "score": 14,
            "created_utc": 1678888864.0,
            "replies": []
        },
        {
            "body": "Well the hate comes from people that can't accept member leaving the main cast or yknow the hateful guy/girl that just hate things don't go on their visions. JSJ is early victim on hate. Constantly said to be old, not funny, etc. (those hateful person still did it to this day tho you can spot one maybe even in this post).\n\nNow when Gary left they hated JSM & YSC as new member while they still demand monday couple fever. Then LKS left they target JSM again bcs of LKS & JSM private problems (just following & unfollowing thingy while they are from the same agency. What's the big deal? idk). They just love to hate changes.\n\nThey have choice just move away watch other variety show/anything or do something else but they choose to keep comment hate on member they targeted since it wasn't up to their expectations. Whiners always whine anyway until they grown out of it either stay watching RM or just find new things to do or even new things to hate somewhere else.",
            "author": "shimafeiyan",
            "id": "jcjqxiz",
            "parent_id": "t3_11rns0p",
            "score": 5,
            "created_utc": 1679048024.0,
            "replies": []
        },
        {
            "body": "I love Somin and Sechan now, just because…. they were gems fr.",
            "author": "earlgrcypand4_",
            "id": "jdbxctm",
            "parent_id": "t3_11rns0p",
            "score": 3,
            "created_utc": 1679560560.0,
            "replies": []
        },
        {
            "body": "It actually did and has been affecting me mentally in my real life to see and know about the unnecessarily and unfair hate SoMin has been getting for years. This world is horrible, isn't it? \n\nEven worse, the person who could have stopped or at least lessened the bullying and abuse simply didn't. They pretended that it didn't exist, except; it does exist. Wishing it away doesn't work. \n\nI agree that she should have gotten a family introduction. Poor girl was thrown into a new world out of nowhere with almost no prep...and she won a few awards that first year because she has more talent than she knows what to do with. Lol\n\nThem easing her into things would have been better for her... But she still managed to become one of the most important members and the reason many even started watching RM or continue to watch RM. (I started watching because of her and continue to watch becaus of her, I know several others who are the same) She has incredible chemistry with the members and they clearly cherish her. \n\nShe didn't even need to be eased into things. That's how natural she is. \n\nSoMina, fighting. 💪",
            "author": "Ancient_Reply4583",
            "id": "jca20u9",
            "parent_id": "t3_11rns0p",
            "score": 13,
            "created_utc": 1678878773.0,
            "replies": []
        },
        {
            "body": "I’ve always enjoyed So Min. SeChan h/e not so much. He makes things uncomfortable and he takes gags that aren’t that funny and just runs them into the ground.",
            "author": "Ohnosheshouldnt26",
            "id": "jcfccz1",
            "parent_id": "t3_11rns0p",
            "score": 0,
            "created_utc": 1678971787.0,
            "replies": [
                {
                    "body": "I disagree. I think Sechan has grown so much as an entertainer in RM and is now at the same level as Somin. He got that Top Excellence award for a reason. He deserved it.",
                    "author": "Mission-Loquat9290",
                    "id": "jcg9dg6",
                    "parent_id": "t1_jcfccz1",
                    "score": 8,
                    "created_utc": 1678985216.0,
                    "replies": [
                        {
                            "body": "Agree to disagree. He runs jokes into the ground and it’s uncomfortable to watch.",
                            "author": "Ohnosheshouldnt26",
                            "id": "jcgrwx4",
                            "parent_id": "t1_jcg9dg6",
                            "score": 3,
                            "created_utc": 1678992170.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously it's five years already and people still discuss about this?",
            "author": "abgbob",
            "id": "jca2t48",
            "parent_id": "t3_11rns0p",
            "score": -13,
            "created_utc": 1678879302.0,
            "replies": [
                {
                    "body": "Tell that to that members' fans who still hate on somin then",
                    "author": "Ok_Reflection_1849",
                    "id": "jcec60v",
                    "parent_id": "t1_jca2t48",
                    "score": 11,
                    "created_utc": 1678945071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You won't stand alone on that hill I'm sure. RM had been so stale and declining for a while and the energy she brought into the mix really ignited a new spark in the cast. The show experienced a second spring I would not have thought possible.",
            "author": "letuerk",
            "id": "jcaatxo",
            "parent_id": "t1_jc9zu02",
            "score": 40,
            "created_utc": 1678883930.0,
            "replies": [
                {
                    "body": "Yeah, definitely. Chulmin's first run as PD (346-410) starting with bringing in JSM and YSC and ending with the Family Package is (in my opinion) the best run of Running Man episodes outside of the first 100, and Somin is a huge part of that. They recaptured lightning in a bottle and had great episodes almost every single week for more than a year. I think it's unfair to even call it a silver age of the show, it's a second golden age.",
                    "author": "Ocean_Madness",
                    "id": "jcdho63",
                    "parent_id": "t1_jcaatxo",
                    "score": 20,
                    "created_utc": 1678929238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You won't die alone on that hill. She did saved rm and gave the show another fresh breath of life. People used to hate her for stealing a certain member's screentime but they got to know the show was on the verge of cancellation, chul-min PD had to do everything he can to ensure the show is entertaining enough for SBS to not cancel it.",
            "author": "Ok_Reflection_1849",
            "id": "jcebv0v",
            "parent_id": "t1_jc9zu02",
            "score": 12,
            "created_utc": 1678944848.0,
            "replies": []
        },
        {
            "body": "Haters are too delusional to see what's the problem with RM. Even yjs and lks combo can't save it. And girl get hated just because she's doing best with her job is nut.",
            "author": "No_Independence_1067",
            "id": "jd1izsl",
            "parent_id": "t1_jc9q999",
            "score": 3,
            "created_utc": 1679370366.0,
            "replies": []
        },
        {
            "body": "SeChan is the reason I FF during the episodes.",
            "author": "Ohnosheshouldnt26",
            "id": "jcfclzx",
            "parent_id": "t1_jc9y91x",
            "score": -1,
            "created_utc": 1678971912.0,
            "replies": []
        },
        {
            "body": "The purest!!",
            "author": "ImpossibleWarning6",
            "id": "jcd53d1",
            "parent_id": "t1_jca68na",
            "score": 15,
            "created_utc": 1678923837.0,
            "replies": []
        },
        {
            "body": "Both IG and twitter have a lot of that certain member fans who hate on somin",
            "author": "Ok_Reflection_1849",
            "id": "jcec1ek",
            "parent_id": "t1_jca0g3a",
            "score": 12,
            "created_utc": 1678944977.0,
            "replies": []
        },
        {
            "body": "I think YouTube as well. I remember reading comments that Somin was taking away Jihyo's camera time... love Jihyo but the show isn't going to show someone standing still, plus each member has a cameraman assigned to them so everyone's recorded, was baffled about those screen time comments. Even just after she had made an appearance, the comments on dramacool.vc about Somin were horrific. \n\nSomin and Sechan were a breath of fresh air, love them joining. Love all the members past and present.",
            "author": "Sivassassin",
            "id": "jcodohv",
            "parent_id": "t1_jca0g3a",
            "score": 8,
            "created_utc": 1679130588.0,
            "replies": []
        },
        {
            "body": "She carried that show a lot. Her and YJS. When she wasn't around during season 3, I felt it lacked so much. She's got another show with YJS and Nucksal. Skip Dating.",
            "author": "Worth_Chemist_3361",
            "id": "jc9phy0",
            "parent_id": "t1_jc9oh7d",
            "score": 39,
            "created_utc": 1678868930.0,
            "replies": [
                {
                    "body": "After watching her in season 2, I realized that she is definitely a top entertainer. She knows how to work with anything thrown at her. Her quick wit makes even the most awkward situations entertaining.",
                    "author": "Puzzled-Purpose-6922",
                    "id": "jc9qb2e",
                    "parent_id": "t1_jc9phy0",
                    "score": 28,
                    "created_utc": 1678869622.0,
                    "replies": [
                        {
                            "body": "This is what I find amazing about LKS and JSM. They're great at diffusing the awkwardness because they can go of their ego in a pinch. You can tell that YJS loves working with both of them but he also did say he can't stand JSM's incessant curiousity and chattering when they're off cam.",
                            "author": "hunmingnoisehdb",
                            "id": "jc9r5c7",
                            "parent_id": "t1_jc9qb2e",
                            "score": 35,
                            "created_utc": 1678870337.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rightt I love old episodes and always rewatching them but now cant help thinking “I bet JSM will have so much fun doing this mission”, “if JSM here I wonder what kind of ridiculous skit she will pull out” and much more like omg the way she solidified her existence in RM is very impactful",
            "author": "itsbrutal-0ut-here",
            "id": "jfdwvnw",
            "parent_id": "t1_jc9h3lj",
            "score": 3,
            "created_utc": 1680912795.0,
            "replies": []
        },
        {
            "body": "ambrella....ambrella\n\ncow cancel",
            "author": "shems-2383",
            "id": "jcf6cyt",
            "parent_id": "t1_jc9m6mn",
            "score": 14,
            "created_utc": 1678968631.0,
            "replies": []
        },
        {
            "body": "There's an episode where there's singer somin also\nHopefully there is an ep for 3 somin",
            "author": "shems-2383",
            "id": "jce85r8",
            "parent_id": "t1_jce23ng",
            "score": 5,
            "created_utc": 1678942330.0,
            "replies": []
        },
        {
            "body": "I disagree. I think Sechan has grown so much as an entertainer in RM and is now at the same level as Somin. He got that Top Excellence award for a reason. He deserved it.",
            "author": "Mission-Loquat9290",
            "id": "jcg9dg6",
            "parent_id": "t1_jcfccz1",
            "score": 8,
            "created_utc": 1678985216.0,
            "replies": [
                {
                    "body": "Agree to disagree. He runs jokes into the ground and it’s uncomfortable to watch.",
                    "author": "Ohnosheshouldnt26",
                    "id": "jcgrwx4",
                    "parent_id": "t1_jcg9dg6",
                    "score": 3,
                    "created_utc": 1678992170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tell that to that members' fans who still hate on somin then",
            "author": "Ok_Reflection_1849",
            "id": "jcec60v",
            "parent_id": "t1_jca2t48",
            "score": 11,
            "created_utc": 1678945071.0,
            "replies": []
        },
        {
            "body": "Yeah, definitely. Chulmin's first run as PD (346-410) starting with bringing in JSM and YSC and ending with the Family Package is (in my opinion) the best run of Running Man episodes outside of the first 100, and Somin is a huge part of that. They recaptured lightning in a bottle and had great episodes almost every single week for more than a year. I think it's unfair to even call it a silver age of the show, it's a second golden age.",
            "author": "Ocean_Madness",
            "id": "jcdho63",
            "parent_id": "t1_jcaatxo",
            "score": 20,
            "created_utc": 1678929238.0,
            "replies": []
        },
        {
            "body": "After watching her in season 2, I realized that she is definitely a top entertainer. She knows how to work with anything thrown at her. Her quick wit makes even the most awkward situations entertaining.",
            "author": "Puzzled-Purpose-6922",
            "id": "jc9qb2e",
            "parent_id": "t1_jc9phy0",
            "score": 28,
            "created_utc": 1678869622.0,
            "replies": [
                {
                    "body": "This is what I find amazing about LKS and JSM. They're great at diffusing the awkwardness because they can go of their ego in a pinch. You can tell that YJS loves working with both of them but he also did say he can't stand JSM's incessant curiousity and chattering when they're off cam.",
                    "author": "hunmingnoisehdb",
                    "id": "jc9r5c7",
                    "parent_id": "t1_jc9qb2e",
                    "score": 35,
                    "created_utc": 1678870337.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree to disagree. He runs jokes into the ground and it’s uncomfortable to watch.",
            "author": "Ohnosheshouldnt26",
            "id": "jcgrwx4",
            "parent_id": "t1_jcg9dg6",
            "score": 3,
            "created_utc": 1678992170.0,
            "replies": []
        },
        {
            "body": "This is what I find amazing about LKS and JSM. They're great at diffusing the awkwardness because they can go of their ego in a pinch. You can tell that YJS loves working with both of them but he also did say he can't stand JSM's incessant curiousity and chattering when they're off cam.",
            "author": "hunmingnoisehdb",
            "id": "jc9r5c7",
            "parent_id": "t1_jc9qb2e",
            "score": 35,
            "created_utc": 1678870337.0,
            "replies": []
        }
    ]
}