{
    "title": "SB had a miscarriage (Part 2)",
    "post_id": "slwofs",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/slwofs/sb_had_a_miscarriage_part_2/",
    "author": "chemistryromance",
    "body": "[Original Post](https://www.reddit.com/r/sugarlifestyleforum/comments/sjkcbq/sb_just_texted_that_she_miscarried_this_morning/?utm_medium=android_app&utm_source=share)\n\nLots of you replied to my earlier post and provided advice and words of support at a difficult time. Some people also shared their own experience of miscarriage and I am grateful for that. I don't think I can thank you all enough. \n\n\nArrangements have always felt magical to me, the planning and anticipation before the date, the feverish excitement,  the lust and romance,  the feeling of escape and then the 'comedown' to real life. \n\n\nI have felt safe and secure in this fantasy world. All the chaos was always on the outside. Over time, I had almost forgotten that the characters in this fantasy were real, and vulnerable to real life events.  \n\n\nOn Thursday, real life and fantasy collided in spectacular fashion. \"I had a miscarriage this morning\", a text flashed from my SB on my phone screen.  Those six words were enough to jolt me back to reality. \n\n\nI went to see her on Friday. She only had enough energy to come and sit in the car and it wasn't until late in the evening that she was able to see me. She walked out of  her house looking beautiful as ever, hugging a hot water bottle, and an oversized coat draped over her shoulders,  hiding her pain so well that a passerby would have never guessed what she had been through. \n\n\nShe looked at me and tried to smile but I could see that even the short walk to the car was an effort for her.  I stepped close and hugged her. As we got in the car, she looked visibly weak and shaken. \n\n\nI have only ever seen her at her best, smiling, full of life with the nonchalant attitude of a young person, so it was heartbreaking to see her so broken and vulnerable. \n\n\nShe started talking about her ordeal, the excruciating pain she suffered for hours, confusion about what was happening to her body, the phone call for the medics and the complete surprise and horror at the realisation that she had just had a miscarriage when she didn't even know she was pregnant. \n\n\nWe talked and held each other, perhaps searching for comfort in each other that we are both so familiar with. Adversity brought us closer. If I loved her before then I love her even more now.\n\n\nI asked her if she needed anything and she said she only needed sanitary pads and ibuprofen, I almost cried. \n\n\nI have made sure that she is comfortable for now and won't need anything for a while. Her meals are also taken care of so she won't have to cook. Her PPM continues at the same frequency as before whether we meet or not plus she has extra to spend on herself. Some of you suggested arranging therapy so this is something I will discuss with her in a week or two. I will be seeing her throughout the next week, even if it is just to sit in the car and talk. \n\n\nHaving said all of that, the reality of the situation is that no matter how much I do for her, she will have to deal with the physical and emotional trauma of miscarriage on her own, while I remain almost unscathed, and for that, I feel tremendous guilt and sadness",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/slwofs/sb_had_a_miscarriage_part_2/",
    "score": 121,
    "upvote_ratio": 0.91,
    "created_utc": 1644154155.0,
    "num_comments": 21,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/comments/sjkcbq/sb_just_texted_that_she_miscarried_this_morning/?utm_medium=android_app&utm_source=share"
        ]
    ],
    "comments": [
        {
            "body": "This made me cry. You sound like a very caring and considerate person, she’s fortunate to have someone like you to go through this experience with.",
            "author": "sugar__nymph",
            "id": "hvt7t7u",
            "parent_id": "t3_slwofs",
            "score": 46,
            "created_utc": 1644155821.0,
            "replies": []
        },
        {
            "body": "I’m not going to lie, I just stumbled onto this sub having no real life experience or ties to it due to the fact I am a young poor dude, and I was admittedly judge mental… \n\nBut damn, you guys treat each other better than most marriages I see. Your story honestly touched my heart and changed my initial thoughts about this world completely. \n\nI hope she has a healthy recovery and for all the best to you guys.",
            "author": "burritoes911",
            "id": "hvtopyd",
            "parent_id": "t3_slwofs",
            "score": 43,
            "created_utc": 1644163538.0,
            "replies": [
                {
                    "body": "Yeah, this is how arrangements are supposed to be. My long time SB had a traumatic experience (unrelated to sugaring), and we continued our arrangement and my support even though sexy times were put on hold temporarily (on and off depending on how she was doing as she recovered). We really care about each other and our support and spoiling of each other isn’t based on sex but on our caring for each other.",
                    "author": "freeewillieee",
                    "id": "hvvnno4",
                    "parent_id": "t1_hvtopyd",
                    "score": 9,
                    "created_utc": 1644192438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a SB, this is the response I could only dream a SD would have in this situation. If you want to do something extra and special for her, consider putting together an at home gift basket of self care items she can use to make herself feel better at her own pace. Fuzzy socks, chocolate and snacks, spa stuff like face masks, a stuffed animal, a book or a movie (without any sensitive topics of course). I had a SD do this when I had a concussion that put me out of service for a few weeks, at no fault of either of us, and it made me feel like he both understood that my health was a priority and made me feel like I could take care of myself and feel more human at my own pace.",
            "author": "olivinemultichrome",
            "id": "hvt89tl",
            "parent_id": "t3_slwofs",
            "score": 20,
            "created_utc": 1644156061.0,
            "replies": []
        },
        {
            "body": "As tragic and heartbreaking as this situation is I’m sure she will never forget your kindness and compassion throughout. I’m glad you have each other.",
            "author": "TwerkingAvocado",
            "id": "hvt5veq",
            "parent_id": "t3_slwofs",
            "score": 24,
            "created_utc": 1644154786.0,
            "replies": []
        },
        {
            "body": "I would expect no less from a good SD (or man, or human for that matter) to his SB. Your caring, support, and kindness mean more than any allowance,  but the allowance and extra allow your SB to concentrate on her physical and mental recovery without worry. \n\nYou are doing what any one of us would in a similar situation. At least I hope we are the man you are.",
            "author": "AFSMSgt",
            "id": "hvtralq",
            "parent_id": "t3_slwofs",
            "score": 8,
            "created_utc": 1644164582.0,
            "replies": []
        },
        {
            "body": "You’re a good man for doing the only right thing. She will remember this forever, unfortunately for multiple reasons.\nI appreciate the last part where you acknowledge your placement in this traumatic experience for her. Many men cannot. \n\nI encourage men to do their part in efforts to prevent pain for the women in their life. We carry your pain, don’t forget that",
            "author": "c0rnstarr",
            "id": "hvtjnfv",
            "parent_id": "t3_slwofs",
            "score": 10,
            "created_utc": 1644161405.0,
            "replies": []
        },
        {
            "body": "You sound like an amazing partner to have as an SD. Brought me to tears this morning ❤️😭",
            "author": null,
            "id": "hvtdz7o",
            "parent_id": "t3_slwofs",
            "score": 4,
            "created_utc": 1644158852.0,
            "replies": [
                {
                    "body": "I’m not a SB or a SD and this shit hit me. Dude is a good man.",
                    "author": "burritoes911",
                    "id": "hvtp0ih",
                    "parent_id": "t1_hvtdz7o",
                    "score": 7,
                    "created_utc": 1644163655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i’m glad you were able to see eachother and provide comfort in the few ways we can as men. god bless",
            "author": "ValueFuck",
            "id": "hvthnst",
            "parent_id": "t3_slwofs",
            "score": 3,
            "created_utc": 1644160539.0,
            "replies": []
        },
        {
            "body": "You, good sir, are doing it right. I know it's an ordeal for both of you and wish you well.",
            "author": "Cledaddy23",
            "id": "hvufrwg",
            "parent_id": "t3_slwofs",
            "score": 2,
            "created_utc": 1644174282.0,
            "replies": []
        },
        {
            "body": "I am glad you are being there for her as an SB.",
            "author": "confused_meta-slave",
            "id": "hvunxw4",
            "parent_id": "t3_slwofs",
            "score": 2,
            "created_utc": 1644177558.0,
            "replies": []
        },
        {
            "body": "Thank you for being open enough to take our advice and be so aware to help her through this incredibly difficult time. She will forever appreciate it. \n\nI’m so sorry to hear that it’s been really tough on her. I wish I could wrap you both up in a warm hug. \n\nBest wishes on the recovery road for both of you. I wish only healing and love for you both.",
            "author": "SatansBirthdayCake",
            "id": "hvuwet9",
            "parent_id": "t3_slwofs",
            "score": 2,
            "created_utc": 1644180969.0,
            "replies": []
        },
        {
            "body": "One of the main things that helped through my miscarriage was a supportive partner. ❤",
            "author": "thisshpwasmadetosnk",
            "id": "hvwbp9k",
            "parent_id": "t3_slwofs",
            "score": 2,
            "created_utc": 1644203529.0,
            "replies": []
        },
        {
            "body": "I’m invested to this. Hope she’s doing okay 🥺❤️",
            "author": "LiePale4283",
            "id": "i0yzusq",
            "parent_id": "t3_slwofs",
            "score": 2,
            "created_utc": 1647485729.0,
            "replies": [
                {
                    "body": "Thank you. Physically she is almost back to normal. Mentally and emotionally, I am not sure, it will be a long recovery.",
                    "author": "chemistryromance",
                    "id": "i0zpqut",
                    "parent_id": "t1_i0yzusq",
                    "score": 1,
                    "created_utc": 1647501794.0,
                    "replies": [
                        {
                            "body": "It does! But hoping for fast recovery ❤️",
                            "author": "LiePale4283",
                            "id": "i126ie2",
                            "parent_id": "t1_i0zpqut",
                            "score": 1,
                            "created_utc": 1647546452.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Something's off, you almost cried? \n\nHave you considered that this could all be a lie? Just saying. You sound a lot like a white knight deep in delusion. There's just too much text to describe a simple situation and it's very emotional. \n\nYou are not the one who felt the pain are you? Your extreme empathy tells me you could be dealing with a liar. If not then just ignore me but be careful. \n\nThere a lot of escorts posing as SBs nowadays and they use this trick to keep you around when you start pulling away. Just be careful.",
            "author": "scottr_36",
            "id": "hvvuayq",
            "parent_id": "t3_slwofs",
            "score": -3,
            "created_utc": 1644195437.0,
            "replies": [
                {
                    "body": "Do elaborate on how *you* would feel if you impregnated a young woman you loved and had known for nearly a year with the result that she miscarried nearly a quarter of the way through the pregnancy and found out while holding the inviable fetus in her hands, and came to see you in the car but was otherwise in too much pain to do anything?\n\nOr don't. And just go away.",
                    "author": "SBerryTrifle",
                    "id": "hvwdvz8",
                    "parent_id": "t1_hvvuayq",
                    "score": 4,
                    "created_utc": 1644204565.0,
                    "replies": [
                        {
                            "body": "OP I assume you've done your research and know the basics of what happened and have spoken to your SB and continue to do so, but one thing I was unaware of or hadn't thought about is that pregnancy hormones actually linger for about a month after a miscarriage. So if she seems particularly emotionally volatile it could be that her experience is amplified by the same hormones that can make pregnant women especially emotional (apparently headaches are also common as hormones crash back down). And that's neither of your faults.",
                            "author": "SBerryTrifle",
                            "id": "hvwekx8",
                            "parent_id": "t1_hvwdvz8",
                            "score": 4,
                            "created_utc": 1644204894.0,
                            "replies": [
                                {
                                    "body": "Thank you yes, I am mindful of this, there were some unexplained changes in behaviour last few weeks, at least there is an explanation now.",
                                    "author": "chemistryromance",
                                    "id": "hvzsljs",
                                    "parent_id": "t1_hvwekx8",
                                    "score": 1,
                                    "created_utc": 1644267814.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, this is how arrangements are supposed to be. My long time SB had a traumatic experience (unrelated to sugaring), and we continued our arrangement and my support even though sexy times were put on hold temporarily (on and off depending on how she was doing as she recovered). We really care about each other and our support and spoiling of each other isn’t based on sex but on our caring for each other.",
            "author": "freeewillieee",
            "id": "hvvnno4",
            "parent_id": "t1_hvtopyd",
            "score": 9,
            "created_utc": 1644192438.0,
            "replies": []
        },
        {
            "body": "I’m not a SB or a SD and this shit hit me. Dude is a good man.",
            "author": "burritoes911",
            "id": "hvtp0ih",
            "parent_id": "t1_hvtdz7o",
            "score": 7,
            "created_utc": 1644163655.0,
            "replies": []
        },
        {
            "body": "Thank you. Physically she is almost back to normal. Mentally and emotionally, I am not sure, it will be a long recovery.",
            "author": "chemistryromance",
            "id": "i0zpqut",
            "parent_id": "t1_i0yzusq",
            "score": 1,
            "created_utc": 1647501794.0,
            "replies": [
                {
                    "body": "It does! But hoping for fast recovery ❤️",
                    "author": "LiePale4283",
                    "id": "i126ie2",
                    "parent_id": "t1_i0zpqut",
                    "score": 1,
                    "created_utc": 1647546452.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do elaborate on how *you* would feel if you impregnated a young woman you loved and had known for nearly a year with the result that she miscarried nearly a quarter of the way through the pregnancy and found out while holding the inviable fetus in her hands, and came to see you in the car but was otherwise in too much pain to do anything?\n\nOr don't. And just go away.",
            "author": "SBerryTrifle",
            "id": "hvwdvz8",
            "parent_id": "t1_hvvuayq",
            "score": 4,
            "created_utc": 1644204565.0,
            "replies": [
                {
                    "body": "OP I assume you've done your research and know the basics of what happened and have spoken to your SB and continue to do so, but one thing I was unaware of or hadn't thought about is that pregnancy hormones actually linger for about a month after a miscarriage. So if she seems particularly emotionally volatile it could be that her experience is amplified by the same hormones that can make pregnant women especially emotional (apparently headaches are also common as hormones crash back down). And that's neither of your faults.",
                    "author": "SBerryTrifle",
                    "id": "hvwekx8",
                    "parent_id": "t1_hvwdvz8",
                    "score": 4,
                    "created_utc": 1644204894.0,
                    "replies": [
                        {
                            "body": "Thank you yes, I am mindful of this, there were some unexplained changes in behaviour last few weeks, at least there is an explanation now.",
                            "author": "chemistryromance",
                            "id": "hvzsljs",
                            "parent_id": "t1_hvwekx8",
                            "score": 1,
                            "created_utc": 1644267814.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It does! But hoping for fast recovery ❤️",
            "author": "LiePale4283",
            "id": "i126ie2",
            "parent_id": "t1_i0zpqut",
            "score": 1,
            "created_utc": 1647546452.0,
            "replies": []
        },
        {
            "body": "OP I assume you've done your research and know the basics of what happened and have spoken to your SB and continue to do so, but one thing I was unaware of or hadn't thought about is that pregnancy hormones actually linger for about a month after a miscarriage. So if she seems particularly emotionally volatile it could be that her experience is amplified by the same hormones that can make pregnant women especially emotional (apparently headaches are also common as hormones crash back down). And that's neither of your faults.",
            "author": "SBerryTrifle",
            "id": "hvwekx8",
            "parent_id": "t1_hvwdvz8",
            "score": 4,
            "created_utc": 1644204894.0,
            "replies": [
                {
                    "body": "Thank you yes, I am mindful of this, there were some unexplained changes in behaviour last few weeks, at least there is an explanation now.",
                    "author": "chemistryromance",
                    "id": "hvzsljs",
                    "parent_id": "t1_hvwekx8",
                    "score": 1,
                    "created_utc": 1644267814.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you yes, I am mindful of this, there were some unexplained changes in behaviour last few weeks, at least there is an explanation now.",
            "author": "chemistryromance",
            "id": "hvzsljs",
            "parent_id": "t1_hvwekx8",
            "score": 1,
            "created_utc": 1644267814.0,
            "replies": []
        }
    ]
}