{
    "title": "Dear Sbs",
    "post_id": "ap4bo4",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ap4bo4/dear_sbs/",
    "author": null,
    "body": "I’m seeing a few posts with Sbs saying stuff like they aren’t sure they’re pretty enough to be an Sb or their tit size or how much are they worth etc.\n1st off. You are priceless! Time is a precious thing and what we spend it on doing, your looks have nothing to do with that.\nSecondly, you are worth as much as you make yourself. And by that I mean how you carry yourself and present yourself. If you act like trash, turn up to a first date looking like you just woke up and haven’t changed in weeks then do not expect a SD to want to pay you. \nAlthough some SD’s are looking for a hot, classy woman to walk around with, most SD’s are just looking for good company, a break from reality and someone intelligent or maybe even just someone to listen to them! Usually it’s all of those things! \nA girl that turns up on agreed dates and is able to keep in touch and make their SD feel one of a kind and not like an ATM.\n:) You want to be an SB? Great! You’re now an SB. Now go out there and take your first nose dive into the sugar bowl, it’s a hard swim but you’ll get there. ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ap4bo4/dear_sbs/",
    "score": 138,
    "upvote_ratio": 0.89,
    "created_utc": 1549808822.0,
    "num_comments": 107,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sb here-and I’d agree with you but I’d add one thing- SD wants to be wanted, no matter how old or ugly he is on the outside. You want someone to look past your exterior, you need to do the same. Your fiery passion for him and his interests will turn him on more than some dumb uninterested Barbie doll. Sure, sometimes they just want the pretty face & body but without a personality and desire for his time & attention she won’t get very far. ",
            "author": "w-r",
            "id": "eg6osw6",
            "parent_id": "t3_ap4bo4",
            "score": 22,
            "created_utc": 1549839742.0,
            "replies": [
                {
                    "body": "I love this!! ",
                    "author": null,
                    "id": "eg6q860",
                    "parent_id": "t1_eg6osw6",
                    "score": 2,
                    "created_utc": 1549840897.0,
                    "replies": []
                },
                {
                    "body": "Up vote!",
                    "author": "HappyBear1952",
                    "id": "eg74c2e",
                    "parent_id": "t1_eg6osw6",
                    "score": 1,
                    "created_utc": 1549852845.0,
                    "replies": [
                        {
                            "body": "Awww shucks. I’m honored to get support for this idea. I don’t even post pictures of myself even though I’m 90% sure I’m a Seattle 10 in my age division :).  I need to converse with a POT and fall in love with his insides a little bit, even if just for the fact that he agreed on a blind date or that he was willing to share a fantasy and some witty banter.  People are beautiful. Just gotta see past their skin (unless there’s like way too much, I mean there are limits unfortunately for everyone). ",
                            "author": "w-r",
                            "id": "eg7agpk",
                            "parent_id": "t1_eg74c2e",
                            "score": 2,
                            "created_utc": 1549857926.0,
                            "replies": [
                                {
                                    "body": "You just get better and better!!   Love your comments and your love of people.  And - now I know you are a 'Seattle 10'   Your SD is (or will be) the luckiest of men!  ",
                                    "author": "HappyBear1952",
                                    "id": "eg8d5vb",
                                    "parent_id": "t1_eg7agpk",
                                    "score": 1,
                                    "created_utc": 1549902082.0,
                                    "replies": [
                                        {
                                            "body": "❤️ thank you happy bear. ",
                                            "author": "w-r",
                                            "id": "eg8e484",
                                            "parent_id": "t1_eg8d5vb",
                                            "score": 1,
                                            "created_utc": 1549902674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely motivational, and so true. Most SD’s I encounter really just want their time respected and to vent... Being nice looking helps but the end result tends to be the same. ",
            "author": "kimmy8888",
            "id": "eg5pguu",
            "parent_id": "t3_ap4bo4",
            "score": 21,
            "created_utc": 1549811886.0,
            "replies": [
                {
                    "body": "Exactly, being attractive is definitely a bonus but if a girl is unique and interesting enough it will definitely catch more of an eye. :) especially if that girl has ambitions! I find a lot of SD’s aren’t too turned on by the idea of giving money to a girl who won’t do anything productive with it.\nGlad to hear you enjoyed my speech.",
                    "author": null,
                    "id": "eg5qfg4",
                    "parent_id": "t1_eg5pguu",
                    "score": 13,
                    "created_utc": 1549812768.0,
                    "replies": [
                        {
                            "body": "Yes!\n\nAnd also, there are plenty of attractive women who don’t think they are attractive. SBs aren’t trying to date themselves, so they needn’t be attracted to themselves - just as long as the SD likes her and she likes him back, they’re good to go :)",
                            "author": "thesluttypet",
                            "id": "eg5ulol",
                            "parent_id": "t1_eg5qfg4",
                            "score": 9,
                            "created_utc": 1549816262.0,
                            "replies": [
                                {
                                    "body": "Fully agree :) I think everyone in some way struggles to see their perfections which is why they should do their best to keep their head in the game rather than obsess over what they can’t see x",
                                    "author": null,
                                    "id": "eg5vfwf",
                                    "parent_id": "t1_eg5ulol",
                                    "score": 1,
                                    "created_utc": 1549816924.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. If nothing else, it will decrease negative thinking which will increase quality of life :)\n\nPersonally, I used to think I was super fat and ugly. I’d obsess over it. Trying not to let anyone see me from the side (I hated my face profile) or never wearing shorts/skirts for years because I thought my legs were bad..\n\nNow that I’ve gained confidence, I can look back and see that while Im certainly not perfect, I’ve never actually been fat nor ugly :p",
                                            "author": "thesluttypet",
                                            "id": "eg5w94y",
                                            "parent_id": "t1_eg5vfwf",
                                            "score": 1,
                                            "created_utc": 1549817569.0,
                                            "replies": [
                                                {
                                                    "body": "Good on you!\nTbh I only just hit the fuck it button in December and I gotta tell ya, I feel like I’ve lost the weight that made me feel fat. My weight being the worries.",
                                                    "author": null,
                                                    "id": "eg6cyr1",
                                                    "parent_id": "t1_eg5w94y",
                                                    "score": 1,
                                                    "created_utc": 1549830688.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "If you understand the metaphor x",
                                                    "author": null,
                                                    "id": "eg6czma",
                                                    "parent_id": "t1_eg5w94y",
                                                    "score": 1,
                                                    "created_utc": 1549830707.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
                                                            "author": "thesluttypet",
                                                            "id": "eg6ey6v",
                                                            "parent_id": "t1_eg6czma",
                                                            "score": 0,
                                                            "created_utc": 1549832229.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                                                                    "author": null,
                                                                    "id": "eg6fae6",
                                                                    "parent_id": "t1_eg6ey6v",
                                                                    "score": 1,
                                                                    "created_utc": 1549832482.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                                                                            "author": "thesluttypet",
                                                                            "id": "eg6gmre",
                                                                            "parent_id": "t1_eg6fae6",
                                                                            "score": 0,
                                                                            "created_utc": 1549833510.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                                                                    "author": null,
                                                                                    "id": "eg6gs2s",
                                                                                    "parent_id": "t1_eg6gmre",
                                                                                    "score": 1,
                                                                                    "created_utc": 1549833629.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                                                                            "author": "thesluttypet",
                                                                                            "id": "eg6guso",
                                                                                            "parent_id": "t1_eg6gs2s",
                                                                                            "score": 1,
                                                                                            "created_utc": 1549833688.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                                                                    "author": null,
                                                                                                    "id": "eg6h557",
                                                                                                    "parent_id": "t1_eg6guso",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1549833911.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Vent? ",
                    "author": null,
                    "id": "eg5wg9u",
                    "parent_id": "t1_eg5pguu",
                    "score": 1,
                    "created_utc": 1549817724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this helps a lot. this is my first week in the bowl as a SB and i’ve been a nervous wreck and putting off m&g’s because i feel like i lack the looks, confidence and personality to outcompete other SB’s.",
            "author": "sugarbabeet",
            "id": "eg6ke5n",
            "parent_id": "t3_ap4bo4",
            "score": 4,
            "created_utc": 1549836360.0,
            "replies": [
                {
                    "body": "If you every need someone to talk to I’ll be happy to ! And you definitely just need to hit the fuck it button and go for it! I’m glad this has helped you!",
                    "author": null,
                    "id": "eg6qm4k",
                    "parent_id": "t1_eg6ke5n",
                    "score": 2,
                    "created_utc": 1549841212.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Funny as I wrote this yesterday to someone so here it is again.\n\n* **Looks** is the first thing needed to get a physical attraction - if this doesn't pass, I won't even meet   This is just a fact for most SDs.\n* Then comes **conversation**, are you actually able to talk about things or just \"omg\", \"like\", or \"awkward\" with nothing to say. I'm not talking about having political views as that's a turn-off but to be able to make the person you are with feel interested.\n* **Attentive** (paying attention to him, not looking at your phone constantly, look for his needs and fulfill them, look into his eyes, hold his hands etc -Discrete (able to read the situation and room in case there is a need to be discrete) \n* **Fun!** \\-- like actually having fun with the person so they don't feel like this is a forced time together and you can't wait to GTFO there. \n* **Sex** \\- this is always important, if you're a dead fish then no one will want to keep seeing you. This is where you'll need to have a genuine connection or the sex will not be good \n* **Time** \\- don't be the 1-hour date. I probably cultivate more time when I'm out, usually the girl don't mind spending 5+ hours with me (not all in the bed room but really have like a date but with intimacy in the end)\n* I also look for a girl who has the **ambition** to be somebody (whether it’s school or a specific profession/career). It makes me feel good as I can give them advice as well\n* It's all about **building an experience** to make him feel wanted. It's as simple as that.",
            "author": null,
            "id": "eg5shgw",
            "parent_id": "t3_ap4bo4",
            "score": 11,
            "created_utc": 1549814579.0,
            "replies": [
                {
                    "body": "Nice use of organisation. And as I said this to the last SD who commented that their first thing to look for is physical attraction, every SD is different. I did state that some SDs looks for every aspect I stated all together. However not all SDs are the same. So as lovely as your resume looks, this is to let SBs know their own worth and that there ARE SDs out there that look beyond who’s a 10 and who isn’t. :) But like I said, all SDs are different, some care about looks and some don’t. Either one is perfectly fine.",
                    "author": null,
                    "id": "eg5tx3g",
                    "parent_id": "t1_eg5shgw",
                    "score": 1,
                    "created_utc": 1549815743.0,
                    "replies": [
                        {
                            "body": "How many SD do you think will pick a SB that they aren't physically attracted to? Yeah, everyone finds different traits attractive, but it is rare that a guy will pick a girl to vanilla date they don't find attractive and sugar allows men to be pickier both in looks and personality. Very few SD's dont care about looks.",
                            "author": "sexviewer",
                            "id": "eg6roux",
                            "parent_id": "t1_eg5tx3g",
                            "score": 4,
                            "created_utc": 1549842109.0,
                            "replies": [
                                {
                                    "body": "Actually I have met a lot of SDs that are primarily looking for personality and attention rather than just looks. I wouldn’t make this post without my own personal experience as backup. I don’t make these posts with false pretense and hopes. ",
                                    "author": null,
                                    "id": "eg6rxir",
                                    "parent_id": "t1_eg6roux",
                                    "score": 3,
                                    "created_utc": 1549842301.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eg7wd86",
                                            "parent_id": "t1_eg6rxir",
                                            "score": 2,
                                            "created_utc": 1549887588.0,
                                            "replies": [
                                                {
                                                    "body": "A. Thank you for the compliment.\nB. Not every guy thinks I’m attractive. Just because one guy says you’re hot doesn’t mean you are. It’s all about attitude and how you carry yourself. Confidence and prowess :) if I was depressed all the time and had no confidence in myself it wouldn’t be very attractive unless you meet a daddy that likes being the “protector” role. Which there, then again is still a match!\nIt’s all about perspective.\n\nI don’t shit on your beliefs so please don’t shit on other people’s beliefs :) if you want to believe in black and white views then that’s perfect okay.",
                                                    "author": null,
                                                    "id": "eg8rp9g",
                                                    "parent_id": "t1_eg7wd86",
                                                    "score": 3,
                                                    "created_utc": 1549910617.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Right, I also am mainly focusing on finding a sugarbaby that I have a personality I can connect with and is attentive. But that's because a girl I'm not attracted to doesn't even get a message. Does she have to he a 10? Even in dating where looks play a smaller role for me, if I don't find a girl attractive then I'm not going to date her. That doesn't mean it's the primary thing I look at though. \n\nCould you elaborate on what you mean by having personal experience to back it up? Are you trying to say you've had a sugar daddy that did not find you attractive?",
                                            "author": "sexviewer",
                                            "id": "eg6zfse",
                                            "parent_id": "t1_eg6rxir",
                                            "score": 1,
                                            "created_utc": 1549848757.0,
                                            "replies": [
                                                {
                                                    "body": "I have actually. I’ve had some sugar daddy’s tell me I’m ugly as shit but I’ve also had some that have called me hot! \nOnes junk is another mans treasure. If you find one girl unattractive another guy might find her attractive. It’s completely based off of perspective honestly :) \n\nAnd it’s perfectly fine that you care about looks. Honestly a lot of guys reading this are mistaking what im saying to be “guys who look for hot girls are assholes” and I promise that’s not what I’m saying at all! I’m saying that every SD is different just as every SB is different. :) And that I think attitude is the most important thing.\n\nA bad attitude hot girl who doesn’t make dates won’t get far for being a waste of time.\n\nA bad attitude rich man who makes girls feel like crap also won’t get far.\nHe might if there’s girls who try to endure it because she really needs the cash but they’d never actually have a connection.",
                                                    "author": null,
                                                    "id": "eg70bdg",
                                                    "parent_id": "t1_eg6zfse",
                                                    "score": 1,
                                                    "created_utc": 1549849493.0,
                                                    "replies": [
                                                        {
                                                            "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
                                                            "author": "sexviewer",
                                                            "id": "eg716wu",
                                                            "parent_id": "t1_eg70bdg",
                                                            "score": 3,
                                                            "created_utc": 1549850218.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                                                                    "author": null,
                                                                    "id": "eg71dbb",
                                                                    "parent_id": "t1_eg716wu",
                                                                    "score": 2,
                                                                    "created_utc": 1549850365.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                                                                            "author": "sexviewer",
                                                                            "id": "eg75pdr",
                                                                            "parent_id": "t1_eg71dbb",
                                                                            "score": 3,
                                                                            "created_utc": 1549853985.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                                                                    "author": null,
                                                                                    "id": "eg8r4vy",
                                                                                    "parent_id": "t1_eg75pdr",
                                                                                    "score": 3,
                                                                                    "created_utc": 1549910302.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "There is an important additional component to the discussion.  For the SD whose primary focus is on looks there will always be another woman more attractive and thus the relationship is likely to be short term. \n\nCharacteristics like character, fun, interesting, intelligent, respectful of commitments are more likely to be enduring and not compared on a continuing basis.  \n\nYou want to be a partner in a relationship not a hunting trophy",
                            "author": "pinotandsugar",
                            "id": "eg68ukr",
                            "parent_id": "t1_eg5tx3g",
                            "score": 3,
                            "created_utc": 1549827437.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eg6brpy",
                                    "parent_id": "t1_eg68ukr",
                                    "score": 1,
                                    "created_utc": 1549829752.0,
                                    "replies": [
                                        {
                                            "body": "Hahaha loved this x and idk I don’t use Match.com and I haven’t ever seen another SBs profile before but I can assure that looking for the diamonds in the rocks are always worth it. But then again I think SDs pay for their memberships? Damn haha. The sugar bowl is quite the rumble isn’t it? 😂 I guess its simply gambling. Like a, ‘Play to win’ sorta thing. Play and you get a  shiny new Sb ~ \n",
                                            "author": null,
                                            "id": "eg6e00t",
                                            "parent_id": "t1_eg6brpy",
                                            "score": 1,
                                            "created_utc": 1549831494.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I've never been on match but I assume it is primarily peer group dating on speed. ",
                                            "author": "pinotandsugar",
                                            "id": "eg6ggom",
                                            "parent_id": "t1_eg6brpy",
                                            "score": 1,
                                            "created_utc": 1549833381.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eg6kb5l",
                                                    "parent_id": "t1_eg6ggom",
                                                    "score": 1,
                                                    "created_utc": 1549836296.0,
                                                    "replies": [
                                                        {
                                                            "body": "attitude , energy ,not looking for long term / permanent relationship",
                                                            "author": "pinotandsugar",
                                                            "id": "eg6zmst",
                                                            "parent_id": "t1_eg6kb5l",
                                                            "score": 0,
                                                            "created_utc": 1549848925.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm chubby and have had no issue getting dates. If they like my pictures and profile (I do point out I'm not thin) then there's no surprise. \nI take care of myself and make sure I don't look like a thumb. There's a certain level of attraction needed but the personality and intelligence to get past that initial contact is key.",
            "author": null,
            "id": "eg6d1s7",
            "parent_id": "t3_ap4bo4",
            "score": 9,
            "created_utc": 1549830755.0,
            "replies": [
                {
                    "body": "Yes! I was chubby and always got dates with daddies. It’s how you present yourself 🥰",
                    "author": null,
                    "id": "eg6hr1i",
                    "parent_id": "t1_eg6d1s7",
                    "score": 3,
                    "created_utc": 1549834374.0,
                    "replies": []
                },
                {
                    "body": "Loved this read!",
                    "author": null,
                    "id": "eg6e8fm",
                    "parent_id": "t1_eg6d1s7",
                    "score": 1,
                    "created_utc": 1549831676.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg5rjjy",
            "parent_id": "t3_ap4bo4",
            "score": 17,
            "created_utc": 1549813755.0,
            "replies": [
                {
                    "body": "Not all women become SBs. That is a fact. Some women are not fit and I am not attracted to them.\n\nI think what OP is saying is that the bowl is hard on the fucking confidence of women. They need to not let small boobs a couple extra pounds impact them.",
                    "author": "girlz_are_42",
                    "id": "eg5s4b1",
                    "parent_id": "t1_eg5rjjy",
                    "score": 15,
                    "created_utc": 1549814262.0,
                    "replies": []
                },
                {
                    "body": "Eh. That’s not how I interpreted the OP. Sounds more like “you don’t have to be supermodel hot” rather than “even a troll can make it if she tries hard enough”\n\nFor most (not all) SBs starting out, they would do better with more confidence, rather than a hotter face and body. Ya know?",
                    "author": "thesluttypet",
                    "id": "eg5v0y9",
                    "parent_id": "t1_eg5rjjy",
                    "score": 8,
                    "created_utc": 1549816598.0,
                    "replies": [
                        {
                            "body": "I’m confused x this doesn’t seem at all what that guy was talking about.",
                            "author": null,
                            "id": "eg6r5ju",
                            "parent_id": "t1_eg5v0y9",
                            "score": 2,
                            "created_utc": 1549841662.0,
                            "replies": [
                                {
                                    "body": "I guess I was reading a bit far into it, and making up some stuff. \n\nBasically. I was trying to equate a “SD” with a $200/mo budget to a SB ugly enough inside and out to only be worth $200/mo. \n\nIn your OP, you didn’t say looks don’t matter *at all*. Or that everyone can succeed in the bowl, all you have to do is want it. You simply said some practical advice and alternative ways of thinking that are much healthier and more attractive, in a partner (or anyone). \n\nThe guy I was responding to made it seem like the OP was unrealistically inspirational or not relatable. I don’t think what you said was even close to telling a poor dude to be a SD. And that’s the aspect I was responding to :)",
                                    "author": "thesluttypet",
                                    "id": "eg6s8hx",
                                    "parent_id": "t1_eg6r5ju",
                                    "score": 2,
                                    "created_utc": 1549842552.0,
                                    "replies": [
                                        {
                                            "body": "Oh okay :) I understand now! I was so confused haha!",
                                            "author": null,
                                            "id": "eg6sbcm",
                                            "parent_id": "t1_eg6s8hx",
                                            "score": 2,
                                            "created_utc": 1549842618.0,
                                            "replies": [
                                                {
                                                    "body": "Hehe no worries. I accidentally forget everyone doesn’t know what I’m thinking about / responding to :p",
                                                    "author": "thesluttypet",
                                                    "id": "eg6sfk5",
                                                    "parent_id": "t1_eg6sbcm",
                                                    "score": 2,
                                                    "created_utc": 1549842715.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg7vymj",
                            "parent_id": "t1_eg5v0y9",
                            "score": 2,
                            "created_utc": 1549887060.0,
                            "replies": [
                                {
                                    "body": "Umm. \n\nI don’t think we read the same OP. Never once did I read here say “ looks aren’t important to many guys”\n\nWhat you seen to be missing, is that many women who you (and society) would say are pretty, don’t think they are pretty. In fact, I think OP wrote that based on personal experience. \n\nBut, instead of making any assumptions about the OP, I’ll tell you from my point of view. I have personally felt that I was hideous, that my breasts appear“saggy” because they’re small or that my nose is too big - all things that would intimidate me from entering the Sugar Bowl. But guess what? I get tons of guys (and girls) interested in me. And when I meet people from online, I’m usually told I look better in person than in my photos. \n\nBasically, you read the OP and thought it was BS because you assumed she was saying something like: “Ugly people can easily be super successful in the bowl, just because of their good personality” (or something like that, right?)\n\nAnd I read the OP and agreed. Because I think she’s saying something closer to “stop obsessing over the little things you think are wrong with you, confidence, connection, and personality are the main things to keep a SR going. Looks matter at first, because attraction is important. But guys aren’t usually looking for a 10 to use solely as arm candy. In fact, almost every SD would prefer a 7-8 who is fun, genuine in bed, and interesting to talk to”",
                                    "author": "thesluttypet",
                                    "id": "egb68eg",
                                    "parent_id": "t1_eg7vymj",
                                    "score": 3,
                                    "created_utc": 1549984911.0,
                                    "replies": []
                                },
                                {
                                    "body": "You make the most sensible points I've read on these threads\n\nKeep up the good work.  Sometimes the most true points are more difficult because of group think on the SB side with demands that SDs accept no standards. \n\nJust like some SDs are not well off enough for most SBs to afford sugaring, there are SBs that aren't attractive enough to command much of an allowance.\n\nJust the reality of the game.",
                                    "author": "alphadawg26",
                                    "id": "ege2spb",
                                    "parent_id": "t1_eg7vymj",
                                    "score": 1,
                                    "created_utc": 1550075451.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes but bare in mind this is a “inspirational post” for SBs. Not SDs. I’m talking about an SBs Image and point of view not a SD financial standpoints which is obviously different.",
                    "author": null,
                    "id": "eg5rqg3",
                    "parent_id": "t1_eg5rjjy",
                    "score": 8,
                    "created_utc": 1549813921.0,
                    "replies": [
                        {
                            "body": "Haha I thought they were obviously different things - but if it’s thinkable someone will have thought it..",
                            "author": "thesluttypet",
                            "id": "eg5v3rv",
                            "parent_id": "t1_eg5rqg3",
                            "score": 3,
                            "created_utc": 1549816661.0,
                            "replies": [
                                {
                                    "body": "Well it would still be completely off topic and a random sub argument that should be probably taken up in a different post x completely valid, but off topic :)",
                                    "author": null,
                                    "id": "eg5vi27",
                                    "parent_id": "t1_eg5v3rv",
                                    "score": 2,
                                    "created_utc": 1549816972.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This!",
                    "author": "ruphun",
                    "id": "eg5tap8",
                    "parent_id": "t1_eg5rjjy",
                    "score": 1,
                    "created_utc": 1549815254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP ... this is gold.\n\nI am not going to rah rah and say every SB will get a SD. It is a fact and a numbers game.\n\nWhat I will tell you is that personality to me is just as important as looks. Personally am I not attracted to women who are obese. Sorry ladies I am personally not. Do some guys light a couple extra pounds yep.\n\nA ladies confidence is often impacted by the bowl. Really I 🙏 that is it not.",
            "author": "girlz_are_42",
            "id": "eg5tfvf",
            "parent_id": "t3_ap4bo4",
            "score": 15,
            "created_utc": 1549815370.0,
            "replies": [
                {
                    "body": "Love this response! Very positive!\nAnd of course I have my own shallow streak and I’m sure everyone does. But what’s important is that a SB knows how to carry herself and that if one SD dislikes one of their physicial attributes another one will like it! But that’s a lesson life as well. You need to love yourself before anyone else can love you and no matter how attractive you are, if you don’t act like it and don’t shine as brightly as you are capable of shining then you’re just a face. \n\nYes the bowl is ruthless sometimes!! But it’s important for everyone to remember to keep their A game on no matter what one person says or how hard it gets!",
                    "author": null,
                    "id": "eg5uveo",
                    "parent_id": "t1_eg5tfvf",
                    "score": 3,
                    "created_utc": 1549816476.0,
                    "replies": [
                        {
                            "body": "Being physically attracted to a women is not shallow. That is human nature. Being a bigot on looks is fucked up, and happens.\n\nLife is ducking ruthless at times. Accept it! Rejoice in it! Thrive in it.\n\nFail fast and get back the fuck up!",
                            "author": "girlz_are_42",
                            "id": "eg61b7l",
                            "parent_id": "t1_eg5uveo",
                            "score": 2,
                            "created_utc": 1549821497.0,
                            "replies": [
                                {
                                    "body": "Haha i never said being shallow was bad :) like I said I’m also kinda shallow even though I accept personalities wholeheartedly. \n\nHonestly, talking from a personal standpoint, I own a fire proof vest but it doesn’t mean I am fireproof. If you can hear it , it can hurt anyone who is critical of themselves.  ( reference to a cantrip from dnd I couldn’t help making! )\n\nBut you’re right. That “can do” spirit is what keeps his society thriving and surviving! :) ",
                                    "author": null,
                                    "id": "eg6dia2",
                                    "parent_id": "t1_eg61b7l",
                                    "score": 1,
                                    "created_utc": 1549831114.0,
                                    "replies": [
                                        {
                                            "body": "Well I wish we had a just tad more of the can do 😂😂😂\n\nCantrip from DND? Now you are talking my language 😂😂",
                                            "author": "girlz_are_42",
                                            "id": "eg6dznf",
                                            "parent_id": "t1_eg6dia2",
                                            "score": 0,
                                            "created_utc": 1549831487.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly, I had an idea once of s dating website where you would be manually paired with someone by professional love psychiatrists. Scientific but.. A lot more effective since our own brains often suck at finding our perfect partners.\n\nHaha yeah I was referencing “Vicious Mochery” . It saved me once when I was attacked by 3 orcs.😬",
                                                    "author": null,
                                                    "id": "eg6eht2",
                                                    "parent_id": "t1_eg6dznf",
                                                    "score": -1,
                                                    "created_utc": 1549831880.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6aah2",
            "parent_id": "t3_ap4bo4",
            "score": 5,
            "created_utc": 1549828588.0,
            "replies": [
                {
                    "body": "It definitely will help any SB who reads this, as a Sb myself with tits that aren’t relatively large, definitely boosted my confidence for sure! :D",
                    "author": null,
                    "id": "eg6e4jp",
                    "parent_id": "t1_eg6aah2",
                    "score": 2,
                    "created_utc": 1549831594.0,
                    "replies": [
                        {
                            "body": "My all-time favorite SB is:\n\n* Gorgeous\n* Has the tiniest boobs I've ever seen up close and personal.\n\nDid I mention she was gorgeous?\n\nAnd my all-time favorite SB?",
                            "author": "marker3000",
                            "id": "eg7ngg8",
                            "parent_id": "t1_eg6e4jp",
                            "score": 2,
                            "created_utc": 1549872724.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg6fo50",
                            "parent_id": "t1_eg6e4jp",
                            "score": 1,
                            "created_utc": 1549832771.0,
                            "replies": [
                                {
                                    "body": "Me too :)",
                                    "author": null,
                                    "id": "eg6gm02",
                                    "parent_id": "t1_eg6fo50",
                                    "score": 2,
                                    "created_utc": 1549833493.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Let’s turn this argument on its head. ‘ok sugar daddies it turns out it doesn’t matter how fat your wallet is. If you can only spend 50 bucks per date, don’t worry about it. Youll find sugar babies will reject you but keep that chin high and don’t stop looking. You’ll eventually find the right one who will appreciate what you have to offer.’\n\nI think there’s a few things going on here. One is selection bias. The sbs who chime in here with positive experiences of being a big/unconventional/whatever sb  are more likely to be the few successful ones whereas the vast amount of unattractive sbs who never found a match, givecup, and don’t go to this message board because it’s too painful to think about. Or they read the threads but don’t post.\n\nThe other dynamic is that just based on statistics a few unattractive sbs will get sds, but it’s just based mostly on luck and circumstance. Human behavior and preference do exist on spectrums. A few men really do prefer obese women. But people seem to have this kind of silly habit nowadays of taking the exceptions and making them the main basis on which the new rule is made, which is ‘everyone is different and has different preferences and characteristics so embrace the diversity of people, and rules about human behavior or sexuality are oppressive and limiting’. ",
            "author": "Birdflare",
            "id": "eg6m6ck",
            "parent_id": "t3_ap4bo4",
            "score": 6,
            "created_utc": 1549837701.0,
            "replies": [
                {
                    "body": "You’re correct, of course. But your valid points will fall on deaf ears for all the ladies reading this. Females respond to emotion and feeling, not to logic.  That’s why silly motivational posts like the one above written by women for women get so many upvotes from SLF’s large female audience. ",
                    "author": "throwawaySD654",
                    "id": "eg6okmb",
                    "parent_id": "t1_eg6m6ck",
                    "score": 4,
                    "created_utc": 1549839559.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg6pfzt",
                            "parent_id": "t1_eg6okmb",
                            "score": 4,
                            "created_utc": 1549840264.0,
                            "replies": [
                                {
                                    "body": "The irony of your comment is that it itself is a generalization",
                                    "author": "throwawaySD654",
                                    "id": "eg6plhf",
                                    "parent_id": "t1_eg6pfzt",
                                    "score": 1,
                                    "created_utc": 1549840387.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eg6pzzu",
                                            "parent_id": "t1_eg6plhf",
                                            "score": -1,
                                            "created_utc": 1549840709.0,
                                            "replies": [
                                                {
                                                    "body": "Unclear what point you’re trying to make with your non-sequitur. But you indirectly supported mine: you were triggered by my comment and replied with emotion, not logic.",
                                                    "author": "throwawaySD654",
                                                    "id": "eg6qcmd",
                                                    "parent_id": "t1_eg6pzzu",
                                                    "score": 3,
                                                    "created_utc": 1549840997.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I didn’t even finish this. Honestly the attitude in this is really disappointing. Not only is the SD financial thing nothing to do with this post it is a completely different matter. Not ever SD thinks that Looks are all that matter and I never said that Every SB has equal chances. I just said that there IS chances. I’m not going to fight you on this because it’s your opinion and I’m not biased and you’re entitled to what you believe. ",
                    "author": null,
                    "id": "eg6pv7w",
                    "parent_id": "t1_eg6m6ck",
                    "score": 1,
                    "created_utc": 1549840602.0,
                    "replies": [
                        {
                            "body": ">SD financial thing nothing to do with this post\n\nIsn't the \"SD financial thing\" the baseline idea for all posts? It's the reason any of this even exists. Denying this is as extreme as saying \"your looks have nothing to do with that\".The post seems like  a con job to boost user account numbers for investor review.   \nEdit: removed extra word",
                            "author": "sweetmagnum",
                            "id": "eg6um4x",
                            "parent_id": "t1_eg6pv7w",
                            "score": 3,
                            "created_utc": 1549844587.0,
                            "replies": [
                                {
                                    "body": "It’s actually astounding how other people’s negative mindsets can create something so awful out of a post created to boost moral.\nDo you think I fap to post likes or something like some sad weirdo? Come in man. With this kind of logo you’re accusing everyone who ever posts for doing it just for the likes.\nAnd each some people do and when you can’t recognise the difference between them then you don’t really have an actual clear perspective on your own opinion.\n\nI was saying how it’s a completely different matter that the guy essentially said that “ if an Sd doesn’t have much cash then that means he can still be an sd?” , he tried to link it to this post as if saying the way an SB carried herself and how much an Aspiring SD carries in his wallet is the same issue. I’m talking and SBs mental image of themselves. And what you and this guy are talking about are Whether a broke guy can be an SD or not.",
                                    "author": null,
                                    "id": "eg6v0id",
                                    "parent_id": "t1_eg6um4x",
                                    "score": 0,
                                    "created_utc": 1549844937.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">most SD’s are just looking for good company, a break from reality and someone intelligent or maybe even just someone to listen to them!\n\nAre you advertising for SA now?",
            "author": "vacationfor",
            "id": "eg5ui3i",
            "parent_id": "t3_ap4bo4",
            "score": 2,
            "created_utc": 1549816185.0,
            "replies": [
                {
                    "body": "Lol😂😂😂 ",
                    "author": null,
                    "id": "eg5v48a",
                    "parent_id": "t1_eg5ui3i",
                    "score": 1,
                    "created_utc": 1549816671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For heaven's sake yes.\n\nShow up on time, don't cancel last minute, be clean even if dressed casually. You're already winning me over.",
            "author": "marker3000",
            "id": "eg7nfc3",
            "parent_id": "t3_ap4bo4",
            "score": 2,
            "created_utc": 1549872674.0,
            "replies": []
        },
        {
            "body": "Make sure you send recent pics that portray your true, current body type. ",
            "author": "dade_murphy1",
            "id": "eg7v6ol",
            "parent_id": "t3_ap4bo4",
            "score": 2,
            "created_utc": 1549885985.0,
            "replies": [
                {
                    "body": "Lol tru that! No one likes a catfish :)",
                    "author": null,
                    "id": "eg8rsoa",
                    "parent_id": "t1_eg7v6ol",
                    "score": 2,
                    "created_utc": 1549910671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😍😍🥰",
            "author": "Misscherry92",
            "id": "eg5qshh",
            "parent_id": "t3_ap4bo4",
            "score": 4,
            "created_utc": 1549813093.0,
            "replies": []
        },
        {
            "body": "I'm curious what other SD's think, as I'm curious if I'm unique, but being attractive is very important to me. It's not the only thing of course, and all of the qualities listed are requirements, but very physically attractive is one of the requirements, it's just not the only thing.\n\nI don't think I'm unique on this, but that's why I'm asking to see.",
            "author": "sexviewer",
            "id": "eg5rcbz",
            "parent_id": "t3_ap4bo4",
            "score": 5,
            "created_utc": 1549813580.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg5sdk4",
                    "parent_id": "t1_eg5rcbz",
                    "score": 5,
                    "created_utc": 1549814485.0,
                    "replies": [
                        {
                            "body": "I agree completely and is what I'm saying.",
                            "author": "sexviewer",
                            "id": "eg5skkc",
                            "parent_id": "t1_eg5sdk4",
                            "score": 1,
                            "created_utc": 1549814654.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But what is attractive? I do not like plastic IG. \n\nBeauty is in the eye of the beholder.\n\nEdit: cannot spell",
                    "author": "girlz_are_42",
                    "id": "eg5rxht",
                    "parent_id": "t1_eg5rcbz",
                    "score": 2,
                    "created_utc": 1549814095.0,
                    "replies": [
                        {
                            "body": "I never said plastic instagram. I'm not a fan of that either. ",
                            "author": "sexviewer",
                            "id": "eg5s4mt",
                            "parent_id": "t1_eg5rxht",
                            "score": 1,
                            "created_utc": 1549814270.0,
                            "replies": []
                        },
                        {
                            "body": "Are you a fan of Beaty too..?  😂😂",
                            "author": "ruphun",
                            "id": "eg5shgi",
                            "parent_id": "t1_eg5rxht",
                            "score": 0,
                            "created_utc": 1549814579.0,
                            "replies": [
                                {
                                    "body": "Huh?",
                                    "author": "girlz_are_42",
                                    "id": "eg5tyka",
                                    "parent_id": "t1_eg5shgi",
                                    "score": 1,
                                    "created_utc": 1549815776.0,
                                    "replies": [
                                        {
                                            "body": "I was being snarky, here’s what you typed... “Beaty is in the eye of the beholder” 😜",
                                            "author": "ruphun",
                                            "id": "eg5u6h5",
                                            "parent_id": "t1_eg5tyka",
                                            "score": 1,
                                            "created_utc": 1549815944.0,
                                            "replies": [
                                                {
                                                    "body": "😂😂 sprellojg hard",
                                                    "author": "girlz_are_42",
                                                    "id": "eg61e84",
                                                    "parent_id": "t1_eg5u6h5",
                                                    "score": 1,
                                                    "created_utc": 1549821563.0,
                                                    "replies": [
                                                        {
                                                            "body": "I is a colledge stoodent 😜😈",
                                                            "author": "ruphun",
                                                            "id": "eg622kx",
                                                            "parent_id": "t1_eg61e84",
                                                            "score": 1,
                                                            "created_utc": 1549822081.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am a drop out. They suck at teaching entrepreneurs ",
                                                                    "author": "girlz_are_42",
                                                                    "id": "eg62oqv",
                                                                    "parent_id": "t1_eg622kx",
                                                                    "score": 0,
                                                                    "created_utc": 1549822563.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That sounds like my story too 😂👍🏻",
                                                                            "author": "ruphun",
                                                                            "id": "eg62quh",
                                                                            "parent_id": "t1_eg62oqv",
                                                                            "score": 1,
                                                                            "created_utc": 1549822608.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Being attractive is definitely important, and so is being in shape, no matter what your shape is. But truthfully I would take an affectionate, fun loving, & sexual 7 or 8, over an uptight, entitled 9 or 10 any day..!  \n\n",
                    "author": "ruphun",
                    "id": "eg5t5cd",
                    "parent_id": "t1_eg5rcbz",
                    "score": 3,
                    "created_utc": 1549815136.0,
                    "replies": [
                        {
                            "body": "Right, you need to be both attractive and have an awesome personality. There are just enough SB's out there that you don't have to pick one.",
                            "author": "sexviewer",
                            "id": "eg5uh1h",
                            "parent_id": "t1_eg5t5cd",
                            "score": 2,
                            "created_utc": 1549816163.0,
                            "replies": [
                                {
                                    "body": "Exactly. And what separates a great SB from an average SB is a woman that realizes that being a SB is not about her getting spoiled because she’s a princess.. It’s about what she brings to the SR, and how she makes her SD life better, to give him a reason to want to spoil her and spend his money on her, over the 1000 other options he has.",
                                    "author": "ruphun",
                                    "id": "eg5uy63",
                                    "parent_id": "t1_eg5uh1h",
                                    "score": 0,
                                    "created_utc": 1549816537.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Most of the SDs I’ve talked with, seem to put looks as a lower priority than you do. Maybe we can create a separate post/poll to find out. \n\nMaybe it has to do with the city, too. I live in Los Angeles, and there are a whole bunch of above average looking gals around here, *almost* to the point where being hot is to be assumed, but not literally. Some of us are average, like me ",
                    "author": "thesluttypet",
                    "id": "eg5vd2g",
                    "parent_id": "t1_eg5rcbz",
                    "score": 2,
                    "created_utc": 1549816862.0,
                    "replies": [
                        {
                            "body": "I mean average looks do mean you're likely attractive to a portion of guys. I'm not saying looks are top priority, just that I wouldn't form a SR with someone I find unattractive. I believe most SD feel the same way, but this post is claiming otherwise so that's why im asking.",
                            "author": "sexviewer",
                            "id": "eg5wc6j",
                            "parent_id": "t1_eg5vd2g",
                            "score": 2,
                            "created_utc": 1549817635.0,
                            "replies": [
                                {
                                    "body": "Oh. Well I definitely think attraction is important - but it didn’t seem like this post said differently. I read it more like: \n\n“Fake it till ya make it, you don’t have to be a solid 10 to be attractive. In fact, some girls who society would say are a 7, are another guy’s version of a 10”",
                                    "author": "thesluttypet",
                                    "id": "eg5wozi",
                                    "parent_id": "t1_eg5wc6j",
                                    "score": 2,
                                    "created_utc": 1549817917.0,
                                    "replies": [
                                        {
                                            "body": "👌🏼👍🏻 I agree with the OP. “Beauty is always in the eye of the beholder”... After that, honesty is the most important quality, at least for/to me.",
                                            "author": "AKA_Mr_X",
                                            "id": "eg61u74",
                                            "parent_id": "t1_eg5wozi",
                                            "score": 2,
                                            "created_utc": 1549821904.0,
                                            "replies": [
                                                {
                                                    "body": "Yeahhh! That’s a lot more how I see it, too. \n\nFor me, I really need to find someone with a matching sense of humor. I make jokes real often, but they are often sorta subtle or referencing a previous conversation that they have since forgotten, to the point where if the person misses the joke. I just feel awkward or sound creepy :p haha",
                                                    "author": "thesluttypet",
                                                    "id": "eg68tzj",
                                                    "parent_id": "t1_eg61u74",
                                                    "score": 1,
                                                    "created_utc": 1549827423.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well like I said :) every SD is different. Just as every SB is different. I’m sure a few more SDs will comment on this so you’ll definitely get your opinions.",
                    "author": null,
                    "id": "eg5rm7u",
                    "parent_id": "t1_eg5rcbz",
                    "score": 2,
                    "created_utc": 1549813819.0,
                    "replies": [
                        {
                            "body": "Kind of a bummer that all the SDs who care a lot about looks have decided it’s their time to shine on a post for which they are not even the target audience.  Because you’re right.  There are all sorts of SDs out there.  A lot care about looks first, and there’s nothing wrong with that!  But a lot care about intelligence first.  Or a willingness and ability to travel to them.  Or a mutual desire for an emotional connection.  Or a demonstrated and well-articulated need for financial support for a good cause (school, child support, etc.)\n\nFWIW, I’m a solid 6-7 in the looks department, but I have a great personality, I’m smart, kind, attentive, confident, don’t let the haters get me down ((*ahem!*)), and I have plenty of interest.  That interest comes from men who find my profile smart/articulate, upfront/honest, and CONFIDENT.\n\nAnyway, love the post.  You right, girl. ❤️ ",
                            "author": "lifeoftwopi",
                            "id": "eg5xvqf",
                            "parent_id": "t1_eg5rm7u",
                            "score": 0,
                            "created_utc": 1549818868.0,
                            "replies": [
                                {
                                    "body": "Awe! I really enjoyed reading this! You seem like a really cool fella!\nGood to know you’re open minded on the subject as some guys out there can be real scummy about how a girl looks, making her feel like she’s nothing without her looks which honestly shouldn’t happen! No matter what it is we are doing, we should always take in consideration that people are still people with fragile mental healths :) x\n\nHaha I envy you! I let haters get to me too much. But more in a “You wanna fight, punk?!” Kinda way haha.",
                                    "author": null,
                                    "id": "eg6d8ss",
                                    "parent_id": "t1_eg5xvqf",
                                    "score": 1,
                                    "created_utc": 1549830910.0,
                                    "replies": [
                                        {
                                            "body": "Lol wait, I’m a baby.  Sorry for not clarifying!  😂",
                                            "author": "lifeoftwopi",
                                            "id": "eg6dkx0",
                                            "parent_id": "t1_eg6d8ss",
                                            "score": 1,
                                            "created_utc": 1549831172.0,
                                            "replies": [
                                                {
                                                    "body": "Haha I’ll protect you! I’ll bring boxing gloves 🥊 🤣",
                                                    "author": null,
                                                    "id": "eg6eajh",
                                                    "parent_id": "t1_eg6dkx0",
                                                    "score": 1,
                                                    "created_utc": 1549831720.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You're the norm among SDs",
                    "author": "alphadawg26",
                    "id": "ege52ja",
                    "parent_id": "t1_eg5rcbz",
                    "score": 1,
                    "created_utc": 1550076940.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I skip over so many profiles that are nothing more that “hot” pictures. Not to say that looks don’t matter at all, but show me some genuine personality and I am much more likely to consider reaching out and pursuing an SR.",
            "author": "yesiamansd",
            "id": "eg61nft",
            "parent_id": "t3_ap4bo4",
            "score": 3,
            "created_utc": 1549821757.0,
            "replies": [
                {
                    "body": "This is the healthiest response I’ve read so far :) ",
                    "author": null,
                    "id": "eg6do6r",
                    "parent_id": "t1_eg61nft",
                    "score": 3,
                    "created_utc": 1549831243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg8434b",
            "parent_id": "t3_ap4bo4",
            "score": 2,
            "created_utc": 1549895543.0,
            "replies": [
                {
                    "body": "Fuck yea! This was exactly what the discussion needed!",
                    "author": null,
                    "id": "eg8qczm",
                    "parent_id": "t1_eg8434b",
                    "score": 1,
                    "created_utc": 1549909869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg8haio",
            "parent_id": "t3_ap4bo4",
            "score": 2,
            "created_utc": 1549904622.0,
            "replies": [
                {
                    "body": "Sooo.... your shit?",
                    "author": null,
                    "id": "eg8q98d",
                    "parent_id": "t1_eg8haio",
                    "score": 4,
                    "created_utc": 1549909811.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg99wzl",
                            "parent_id": "t1_eg8q98d",
                            "score": 1,
                            "created_utc": 1549920833.0,
                            "replies": [
                                {
                                    "body": "Haha it took me a moment to actually understand this. Love the try hard passive aggressive attitude. Yknow it would be a lot less effort to just type “Lol”.",
                                    "author": null,
                                    "id": "eg9a32f",
                                    "parent_id": "t1_eg99wzl",
                                    "score": 3,
                                    "created_utc": 1549920930.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "egbdrug",
                                            "parent_id": "t1_eg9a32f",
                                            "score": 1,
                                            "created_utc": 1549990276.0,
                                            "replies": [
                                                {
                                                    "body": "You too xD but seriously man ? Haha you come across super passive aggressive! If you really aren’t then I suggest you work on that for futuristic purposes.",
                                                    "author": null,
                                                    "id": "egdb5m5",
                                                    "parent_id": "t1_egbdrug",
                                                    "score": 1,
                                                    "created_utc": 1550044454.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6b1cm",
            "parent_id": "t3_ap4bo4",
            "score": 1,
            "created_utc": 1549829172.0,
            "replies": [
                {
                    "body": "Yay :) Happy to read this! I’m sure I won’t be the only one.",
                    "author": null,
                    "id": "eg6cir2",
                    "parent_id": "t1_eg6b1cm",
                    "score": 2,
                    "created_utc": 1549830345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "+$æaa\n",
            "author": "Blahra",
            "id": "eg5y72b",
            "parent_id": "t3_ap4bo4",
            "score": 1,
            "created_utc": 1549819109.0,
            "replies": []
        },
        {
            "body": "I love this!! ",
            "author": null,
            "id": "eg6q860",
            "parent_id": "t1_eg6osw6",
            "score": 2,
            "created_utc": 1549840897.0,
            "replies": []
        },
        {
            "body": "Up vote!",
            "author": "HappyBear1952",
            "id": "eg74c2e",
            "parent_id": "t1_eg6osw6",
            "score": 1,
            "created_utc": 1549852845.0,
            "replies": [
                {
                    "body": "Awww shucks. I’m honored to get support for this idea. I don’t even post pictures of myself even though I’m 90% sure I’m a Seattle 10 in my age division :).  I need to converse with a POT and fall in love with his insides a little bit, even if just for the fact that he agreed on a blind date or that he was willing to share a fantasy and some witty banter.  People are beautiful. Just gotta see past their skin (unless there’s like way too much, I mean there are limits unfortunately for everyone). ",
                    "author": "w-r",
                    "id": "eg7agpk",
                    "parent_id": "t1_eg74c2e",
                    "score": 2,
                    "created_utc": 1549857926.0,
                    "replies": [
                        {
                            "body": "You just get better and better!!   Love your comments and your love of people.  And - now I know you are a 'Seattle 10'   Your SD is (or will be) the luckiest of men!  ",
                            "author": "HappyBear1952",
                            "id": "eg8d5vb",
                            "parent_id": "t1_eg7agpk",
                            "score": 1,
                            "created_utc": 1549902082.0,
                            "replies": [
                                {
                                    "body": "❤️ thank you happy bear. ",
                                    "author": "w-r",
                                    "id": "eg8e484",
                                    "parent_id": "t1_eg8d5vb",
                                    "score": 1,
                                    "created_utc": 1549902674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly, being attractive is definitely a bonus but if a girl is unique and interesting enough it will definitely catch more of an eye. :) especially if that girl has ambitions! I find a lot of SD’s aren’t too turned on by the idea of giving money to a girl who won’t do anything productive with it.\nGlad to hear you enjoyed my speech.",
            "author": null,
            "id": "eg5qfg4",
            "parent_id": "t1_eg5pguu",
            "score": 13,
            "created_utc": 1549812768.0,
            "replies": [
                {
                    "body": "Yes!\n\nAnd also, there are plenty of attractive women who don’t think they are attractive. SBs aren’t trying to date themselves, so they needn’t be attracted to themselves - just as long as the SD likes her and she likes him back, they’re good to go :)",
                    "author": "thesluttypet",
                    "id": "eg5ulol",
                    "parent_id": "t1_eg5qfg4",
                    "score": 9,
                    "created_utc": 1549816262.0,
                    "replies": [
                        {
                            "body": "Fully agree :) I think everyone in some way struggles to see their perfections which is why they should do their best to keep their head in the game rather than obsess over what they can’t see x",
                            "author": null,
                            "id": "eg5vfwf",
                            "parent_id": "t1_eg5ulol",
                            "score": 1,
                            "created_utc": 1549816924.0,
                            "replies": [
                                {
                                    "body": "Yeah. If nothing else, it will decrease negative thinking which will increase quality of life :)\n\nPersonally, I used to think I was super fat and ugly. I’d obsess over it. Trying not to let anyone see me from the side (I hated my face profile) or never wearing shorts/skirts for years because I thought my legs were bad..\n\nNow that I’ve gained confidence, I can look back and see that while Im certainly not perfect, I’ve never actually been fat nor ugly :p",
                                    "author": "thesluttypet",
                                    "id": "eg5w94y",
                                    "parent_id": "t1_eg5vfwf",
                                    "score": 1,
                                    "created_utc": 1549817569.0,
                                    "replies": [
                                        {
                                            "body": "Good on you!\nTbh I only just hit the fuck it button in December and I gotta tell ya, I feel like I’ve lost the weight that made me feel fat. My weight being the worries.",
                                            "author": null,
                                            "id": "eg6cyr1",
                                            "parent_id": "t1_eg5w94y",
                                            "score": 1,
                                            "created_utc": 1549830688.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If you understand the metaphor x",
                                            "author": null,
                                            "id": "eg6czma",
                                            "parent_id": "t1_eg5w94y",
                                            "score": 1,
                                            "created_utc": 1549830707.0,
                                            "replies": [
                                                {
                                                    "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
                                                    "author": "thesluttypet",
                                                    "id": "eg6ey6v",
                                                    "parent_id": "t1_eg6czma",
                                                    "score": 0,
                                                    "created_utc": 1549832229.0,
                                                    "replies": [
                                                        {
                                                            "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                                                            "author": null,
                                                            "id": "eg6fae6",
                                                            "parent_id": "t1_eg6ey6v",
                                                            "score": 1,
                                                            "created_utc": 1549832482.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                                                                    "author": "thesluttypet",
                                                                    "id": "eg6gmre",
                                                                    "parent_id": "t1_eg6fae6",
                                                                    "score": 0,
                                                                    "created_utc": 1549833510.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                                                            "author": null,
                                                                            "id": "eg6gs2s",
                                                                            "parent_id": "t1_eg6gmre",
                                                                            "score": 1,
                                                                            "created_utc": 1549833629.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                                                                    "author": "thesluttypet",
                                                                                    "id": "eg6guso",
                                                                                    "parent_id": "t1_eg6gs2s",
                                                                                    "score": 1,
                                                                                    "created_utc": 1549833688.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                                                            "author": null,
                                                                                            "id": "eg6h557",
                                                                                            "parent_id": "t1_eg6guso",
                                                                                            "score": 1,
                                                                                            "created_utc": 1549833911.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Vent? ",
            "author": null,
            "id": "eg5wg9u",
            "parent_id": "t1_eg5pguu",
            "score": 1,
            "created_utc": 1549817724.0,
            "replies": []
        },
        {
            "body": "If you every need someone to talk to I’ll be happy to ! And you definitely just need to hit the fuck it button and go for it! I’m glad this has helped you!",
            "author": null,
            "id": "eg6qm4k",
            "parent_id": "t1_eg6ke5n",
            "score": 2,
            "created_utc": 1549841212.0,
            "replies": []
        },
        {
            "body": "Nice use of organisation. And as I said this to the last SD who commented that their first thing to look for is physical attraction, every SD is different. I did state that some SDs looks for every aspect I stated all together. However not all SDs are the same. So as lovely as your resume looks, this is to let SBs know their own worth and that there ARE SDs out there that look beyond who’s a 10 and who isn’t. :) But like I said, all SDs are different, some care about looks and some don’t. Either one is perfectly fine.",
            "author": null,
            "id": "eg5tx3g",
            "parent_id": "t1_eg5shgw",
            "score": 1,
            "created_utc": 1549815743.0,
            "replies": [
                {
                    "body": "How many SD do you think will pick a SB that they aren't physically attracted to? Yeah, everyone finds different traits attractive, but it is rare that a guy will pick a girl to vanilla date they don't find attractive and sugar allows men to be pickier both in looks and personality. Very few SD's dont care about looks.",
                    "author": "sexviewer",
                    "id": "eg6roux",
                    "parent_id": "t1_eg5tx3g",
                    "score": 4,
                    "created_utc": 1549842109.0,
                    "replies": [
                        {
                            "body": "Actually I have met a lot of SDs that are primarily looking for personality and attention rather than just looks. I wouldn’t make this post without my own personal experience as backup. I don’t make these posts with false pretense and hopes. ",
                            "author": null,
                            "id": "eg6rxir",
                            "parent_id": "t1_eg6roux",
                            "score": 3,
                            "created_utc": 1549842301.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eg7wd86",
                                    "parent_id": "t1_eg6rxir",
                                    "score": 2,
                                    "created_utc": 1549887588.0,
                                    "replies": [
                                        {
                                            "body": "A. Thank you for the compliment.\nB. Not every guy thinks I’m attractive. Just because one guy says you’re hot doesn’t mean you are. It’s all about attitude and how you carry yourself. Confidence and prowess :) if I was depressed all the time and had no confidence in myself it wouldn’t be very attractive unless you meet a daddy that likes being the “protector” role. Which there, then again is still a match!\nIt’s all about perspective.\n\nI don’t shit on your beliefs so please don’t shit on other people’s beliefs :) if you want to believe in black and white views then that’s perfect okay.",
                                            "author": null,
                                            "id": "eg8rp9g",
                                            "parent_id": "t1_eg7wd86",
                                            "score": 3,
                                            "created_utc": 1549910617.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Right, I also am mainly focusing on finding a sugarbaby that I have a personality I can connect with and is attentive. But that's because a girl I'm not attracted to doesn't even get a message. Does she have to he a 10? Even in dating where looks play a smaller role for me, if I don't find a girl attractive then I'm not going to date her. That doesn't mean it's the primary thing I look at though. \n\nCould you elaborate on what you mean by having personal experience to back it up? Are you trying to say you've had a sugar daddy that did not find you attractive?",
                                    "author": "sexviewer",
                                    "id": "eg6zfse",
                                    "parent_id": "t1_eg6rxir",
                                    "score": 1,
                                    "created_utc": 1549848757.0,
                                    "replies": [
                                        {
                                            "body": "I have actually. I’ve had some sugar daddy’s tell me I’m ugly as shit but I’ve also had some that have called me hot! \nOnes junk is another mans treasure. If you find one girl unattractive another guy might find her attractive. It’s completely based off of perspective honestly :) \n\nAnd it’s perfectly fine that you care about looks. Honestly a lot of guys reading this are mistaking what im saying to be “guys who look for hot girls are assholes” and I promise that’s not what I’m saying at all! I’m saying that every SD is different just as every SB is different. :) And that I think attitude is the most important thing.\n\nA bad attitude hot girl who doesn’t make dates won’t get far for being a waste of time.\n\nA bad attitude rich man who makes girls feel like crap also won’t get far.\nHe might if there’s girls who try to endure it because she really needs the cash but they’d never actually have a connection.",
                                            "author": null,
                                            "id": "eg70bdg",
                                            "parent_id": "t1_eg6zfse",
                                            "score": 1,
                                            "created_utc": 1549849493.0,
                                            "replies": [
                                                {
                                                    "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
                                                    "author": "sexviewer",
                                                    "id": "eg716wu",
                                                    "parent_id": "t1_eg70bdg",
                                                    "score": 3,
                                                    "created_utc": 1549850218.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                                                            "author": null,
                                                            "id": "eg71dbb",
                                                            "parent_id": "t1_eg716wu",
                                                            "score": 2,
                                                            "created_utc": 1549850365.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                                                                    "author": "sexviewer",
                                                                    "id": "eg75pdr",
                                                                    "parent_id": "t1_eg71dbb",
                                                                    "score": 3,
                                                                    "created_utc": 1549853985.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                                                            "author": null,
                                                                            "id": "eg8r4vy",
                                                                            "parent_id": "t1_eg75pdr",
                                                                            "score": 3,
                                                                            "created_utc": 1549910302.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "There is an important additional component to the discussion.  For the SD whose primary focus is on looks there will always be another woman more attractive and thus the relationship is likely to be short term. \n\nCharacteristics like character, fun, interesting, intelligent, respectful of commitments are more likely to be enduring and not compared on a continuing basis.  \n\nYou want to be a partner in a relationship not a hunting trophy",
                    "author": "pinotandsugar",
                    "id": "eg68ukr",
                    "parent_id": "t1_eg5tx3g",
                    "score": 3,
                    "created_utc": 1549827437.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg6brpy",
                            "parent_id": "t1_eg68ukr",
                            "score": 1,
                            "created_utc": 1549829752.0,
                            "replies": [
                                {
                                    "body": "Hahaha loved this x and idk I don’t use Match.com and I haven’t ever seen another SBs profile before but I can assure that looking for the diamonds in the rocks are always worth it. But then again I think SDs pay for their memberships? Damn haha. The sugar bowl is quite the rumble isn’t it? 😂 I guess its simply gambling. Like a, ‘Play to win’ sorta thing. Play and you get a  shiny new Sb ~ \n",
                                    "author": null,
                                    "id": "eg6e00t",
                                    "parent_id": "t1_eg6brpy",
                                    "score": 1,
                                    "created_utc": 1549831494.0,
                                    "replies": []
                                },
                                {
                                    "body": "I've never been on match but I assume it is primarily peer group dating on speed. ",
                                    "author": "pinotandsugar",
                                    "id": "eg6ggom",
                                    "parent_id": "t1_eg6brpy",
                                    "score": 1,
                                    "created_utc": 1549833381.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eg6kb5l",
                                            "parent_id": "t1_eg6ggom",
                                            "score": 1,
                                            "created_utc": 1549836296.0,
                                            "replies": [
                                                {
                                                    "body": "attitude , energy ,not looking for long term / permanent relationship",
                                                    "author": "pinotandsugar",
                                                    "id": "eg6zmst",
                                                    "parent_id": "t1_eg6kb5l",
                                                    "score": 0,
                                                    "created_utc": 1549848925.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! I was chubby and always got dates with daddies. It’s how you present yourself 🥰",
            "author": null,
            "id": "eg6hr1i",
            "parent_id": "t1_eg6d1s7",
            "score": 3,
            "created_utc": 1549834374.0,
            "replies": []
        },
        {
            "body": "Loved this read!",
            "author": null,
            "id": "eg6e8fm",
            "parent_id": "t1_eg6d1s7",
            "score": 1,
            "created_utc": 1549831676.0,
            "replies": []
        },
        {
            "body": "Not all women become SBs. That is a fact. Some women are not fit and I am not attracted to them.\n\nI think what OP is saying is that the bowl is hard on the fucking confidence of women. They need to not let small boobs a couple extra pounds impact them.",
            "author": "girlz_are_42",
            "id": "eg5s4b1",
            "parent_id": "t1_eg5rjjy",
            "score": 15,
            "created_utc": 1549814262.0,
            "replies": []
        },
        {
            "body": "Eh. That’s not how I interpreted the OP. Sounds more like “you don’t have to be supermodel hot” rather than “even a troll can make it if she tries hard enough”\n\nFor most (not all) SBs starting out, they would do better with more confidence, rather than a hotter face and body. Ya know?",
            "author": "thesluttypet",
            "id": "eg5v0y9",
            "parent_id": "t1_eg5rjjy",
            "score": 8,
            "created_utc": 1549816598.0,
            "replies": [
                {
                    "body": "I’m confused x this doesn’t seem at all what that guy was talking about.",
                    "author": null,
                    "id": "eg6r5ju",
                    "parent_id": "t1_eg5v0y9",
                    "score": 2,
                    "created_utc": 1549841662.0,
                    "replies": [
                        {
                            "body": "I guess I was reading a bit far into it, and making up some stuff. \n\nBasically. I was trying to equate a “SD” with a $200/mo budget to a SB ugly enough inside and out to only be worth $200/mo. \n\nIn your OP, you didn’t say looks don’t matter *at all*. Or that everyone can succeed in the bowl, all you have to do is want it. You simply said some practical advice and alternative ways of thinking that are much healthier and more attractive, in a partner (or anyone). \n\nThe guy I was responding to made it seem like the OP was unrealistically inspirational or not relatable. I don’t think what you said was even close to telling a poor dude to be a SD. And that’s the aspect I was responding to :)",
                            "author": "thesluttypet",
                            "id": "eg6s8hx",
                            "parent_id": "t1_eg6r5ju",
                            "score": 2,
                            "created_utc": 1549842552.0,
                            "replies": [
                                {
                                    "body": "Oh okay :) I understand now! I was so confused haha!",
                                    "author": null,
                                    "id": "eg6sbcm",
                                    "parent_id": "t1_eg6s8hx",
                                    "score": 2,
                                    "created_utc": 1549842618.0,
                                    "replies": [
                                        {
                                            "body": "Hehe no worries. I accidentally forget everyone doesn’t know what I’m thinking about / responding to :p",
                                            "author": "thesluttypet",
                                            "id": "eg6sfk5",
                                            "parent_id": "t1_eg6sbcm",
                                            "score": 2,
                                            "created_utc": 1549842715.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg7vymj",
                    "parent_id": "t1_eg5v0y9",
                    "score": 2,
                    "created_utc": 1549887060.0,
                    "replies": [
                        {
                            "body": "Umm. \n\nI don’t think we read the same OP. Never once did I read here say “ looks aren’t important to many guys”\n\nWhat you seen to be missing, is that many women who you (and society) would say are pretty, don’t think they are pretty. In fact, I think OP wrote that based on personal experience. \n\nBut, instead of making any assumptions about the OP, I’ll tell you from my point of view. I have personally felt that I was hideous, that my breasts appear“saggy” because they’re small or that my nose is too big - all things that would intimidate me from entering the Sugar Bowl. But guess what? I get tons of guys (and girls) interested in me. And when I meet people from online, I’m usually told I look better in person than in my photos. \n\nBasically, you read the OP and thought it was BS because you assumed she was saying something like: “Ugly people can easily be super successful in the bowl, just because of their good personality” (or something like that, right?)\n\nAnd I read the OP and agreed. Because I think she’s saying something closer to “stop obsessing over the little things you think are wrong with you, confidence, connection, and personality are the main things to keep a SR going. Looks matter at first, because attraction is important. But guys aren’t usually looking for a 10 to use solely as arm candy. In fact, almost every SD would prefer a 7-8 who is fun, genuine in bed, and interesting to talk to”",
                            "author": "thesluttypet",
                            "id": "egb68eg",
                            "parent_id": "t1_eg7vymj",
                            "score": 3,
                            "created_utc": 1549984911.0,
                            "replies": []
                        },
                        {
                            "body": "You make the most sensible points I've read on these threads\n\nKeep up the good work.  Sometimes the most true points are more difficult because of group think on the SB side with demands that SDs accept no standards. \n\nJust like some SDs are not well off enough for most SBs to afford sugaring, there are SBs that aren't attractive enough to command much of an allowance.\n\nJust the reality of the game.",
                            "author": "alphadawg26",
                            "id": "ege2spb",
                            "parent_id": "t1_eg7vymj",
                            "score": 1,
                            "created_utc": 1550075451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes but bare in mind this is a “inspirational post” for SBs. Not SDs. I’m talking about an SBs Image and point of view not a SD financial standpoints which is obviously different.",
            "author": null,
            "id": "eg5rqg3",
            "parent_id": "t1_eg5rjjy",
            "score": 8,
            "created_utc": 1549813921.0,
            "replies": [
                {
                    "body": "Haha I thought they were obviously different things - but if it’s thinkable someone will have thought it..",
                    "author": "thesluttypet",
                    "id": "eg5v3rv",
                    "parent_id": "t1_eg5rqg3",
                    "score": 3,
                    "created_utc": 1549816661.0,
                    "replies": [
                        {
                            "body": "Well it would still be completely off topic and a random sub argument that should be probably taken up in a different post x completely valid, but off topic :)",
                            "author": null,
                            "id": "eg5vi27",
                            "parent_id": "t1_eg5v3rv",
                            "score": 2,
                            "created_utc": 1549816972.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This!",
            "author": "ruphun",
            "id": "eg5tap8",
            "parent_id": "t1_eg5rjjy",
            "score": 1,
            "created_utc": 1549815254.0,
            "replies": []
        },
        {
            "body": "Love this response! Very positive!\nAnd of course I have my own shallow streak and I’m sure everyone does. But what’s important is that a SB knows how to carry herself and that if one SD dislikes one of their physicial attributes another one will like it! But that’s a lesson life as well. You need to love yourself before anyone else can love you and no matter how attractive you are, if you don’t act like it and don’t shine as brightly as you are capable of shining then you’re just a face. \n\nYes the bowl is ruthless sometimes!! But it’s important for everyone to remember to keep their A game on no matter what one person says or how hard it gets!",
            "author": null,
            "id": "eg5uveo",
            "parent_id": "t1_eg5tfvf",
            "score": 3,
            "created_utc": 1549816476.0,
            "replies": [
                {
                    "body": "Being physically attracted to a women is not shallow. That is human nature. Being a bigot on looks is fucked up, and happens.\n\nLife is ducking ruthless at times. Accept it! Rejoice in it! Thrive in it.\n\nFail fast and get back the fuck up!",
                    "author": "girlz_are_42",
                    "id": "eg61b7l",
                    "parent_id": "t1_eg5uveo",
                    "score": 2,
                    "created_utc": 1549821497.0,
                    "replies": [
                        {
                            "body": "Haha i never said being shallow was bad :) like I said I’m also kinda shallow even though I accept personalities wholeheartedly. \n\nHonestly, talking from a personal standpoint, I own a fire proof vest but it doesn’t mean I am fireproof. If you can hear it , it can hurt anyone who is critical of themselves.  ( reference to a cantrip from dnd I couldn’t help making! )\n\nBut you’re right. That “can do” spirit is what keeps his society thriving and surviving! :) ",
                            "author": null,
                            "id": "eg6dia2",
                            "parent_id": "t1_eg61b7l",
                            "score": 1,
                            "created_utc": 1549831114.0,
                            "replies": [
                                {
                                    "body": "Well I wish we had a just tad more of the can do 😂😂😂\n\nCantrip from DND? Now you are talking my language 😂😂",
                                    "author": "girlz_are_42",
                                    "id": "eg6dznf",
                                    "parent_id": "t1_eg6dia2",
                                    "score": 0,
                                    "created_utc": 1549831487.0,
                                    "replies": [
                                        {
                                            "body": "Honestly, I had an idea once of s dating website where you would be manually paired with someone by professional love psychiatrists. Scientific but.. A lot more effective since our own brains often suck at finding our perfect partners.\n\nHaha yeah I was referencing “Vicious Mochery” . It saved me once when I was attacked by 3 orcs.😬",
                                            "author": null,
                                            "id": "eg6eht2",
                                            "parent_id": "t1_eg6dznf",
                                            "score": -1,
                                            "created_utc": 1549831880.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It definitely will help any SB who reads this, as a Sb myself with tits that aren’t relatively large, definitely boosted my confidence for sure! :D",
            "author": null,
            "id": "eg6e4jp",
            "parent_id": "t1_eg6aah2",
            "score": 2,
            "created_utc": 1549831594.0,
            "replies": [
                {
                    "body": "My all-time favorite SB is:\n\n* Gorgeous\n* Has the tiniest boobs I've ever seen up close and personal.\n\nDid I mention she was gorgeous?\n\nAnd my all-time favorite SB?",
                    "author": "marker3000",
                    "id": "eg7ngg8",
                    "parent_id": "t1_eg6e4jp",
                    "score": 2,
                    "created_utc": 1549872724.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg6fo50",
                    "parent_id": "t1_eg6e4jp",
                    "score": 1,
                    "created_utc": 1549832771.0,
                    "replies": [
                        {
                            "body": "Me too :)",
                            "author": null,
                            "id": "eg6gm02",
                            "parent_id": "t1_eg6fo50",
                            "score": 2,
                            "created_utc": 1549833493.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re correct, of course. But your valid points will fall on deaf ears for all the ladies reading this. Females respond to emotion and feeling, not to logic.  That’s why silly motivational posts like the one above written by women for women get so many upvotes from SLF’s large female audience. ",
            "author": "throwawaySD654",
            "id": "eg6okmb",
            "parent_id": "t1_eg6m6ck",
            "score": 4,
            "created_utc": 1549839559.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg6pfzt",
                    "parent_id": "t1_eg6okmb",
                    "score": 4,
                    "created_utc": 1549840264.0,
                    "replies": [
                        {
                            "body": "The irony of your comment is that it itself is a generalization",
                            "author": "throwawaySD654",
                            "id": "eg6plhf",
                            "parent_id": "t1_eg6pfzt",
                            "score": 1,
                            "created_utc": 1549840387.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eg6pzzu",
                                    "parent_id": "t1_eg6plhf",
                                    "score": -1,
                                    "created_utc": 1549840709.0,
                                    "replies": [
                                        {
                                            "body": "Unclear what point you’re trying to make with your non-sequitur. But you indirectly supported mine: you were triggered by my comment and replied with emotion, not logic.",
                                            "author": "throwawaySD654",
                                            "id": "eg6qcmd",
                                            "parent_id": "t1_eg6pzzu",
                                            "score": 3,
                                            "created_utc": 1549840997.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn’t even finish this. Honestly the attitude in this is really disappointing. Not only is the SD financial thing nothing to do with this post it is a completely different matter. Not ever SD thinks that Looks are all that matter and I never said that Every SB has equal chances. I just said that there IS chances. I’m not going to fight you on this because it’s your opinion and I’m not biased and you’re entitled to what you believe. ",
            "author": null,
            "id": "eg6pv7w",
            "parent_id": "t1_eg6m6ck",
            "score": 1,
            "created_utc": 1549840602.0,
            "replies": [
                {
                    "body": ">SD financial thing nothing to do with this post\n\nIsn't the \"SD financial thing\" the baseline idea for all posts? It's the reason any of this even exists. Denying this is as extreme as saying \"your looks have nothing to do with that\".The post seems like  a con job to boost user account numbers for investor review.   \nEdit: removed extra word",
                    "author": "sweetmagnum",
                    "id": "eg6um4x",
                    "parent_id": "t1_eg6pv7w",
                    "score": 3,
                    "created_utc": 1549844587.0,
                    "replies": [
                        {
                            "body": "It’s actually astounding how other people’s negative mindsets can create something so awful out of a post created to boost moral.\nDo you think I fap to post likes or something like some sad weirdo? Come in man. With this kind of logo you’re accusing everyone who ever posts for doing it just for the likes.\nAnd each some people do and when you can’t recognise the difference between them then you don’t really have an actual clear perspective on your own opinion.\n\nI was saying how it’s a completely different matter that the guy essentially said that “ if an Sd doesn’t have much cash then that means he can still be an sd?” , he tried to link it to this post as if saying the way an SB carried herself and how much an Aspiring SD carries in his wallet is the same issue. I’m talking and SBs mental image of themselves. And what you and this guy are talking about are Whether a broke guy can be an SD or not.",
                            "author": null,
                            "id": "eg6v0id",
                            "parent_id": "t1_eg6um4x",
                            "score": 0,
                            "created_utc": 1549844937.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol😂😂😂 ",
            "author": null,
            "id": "eg5v48a",
            "parent_id": "t1_eg5ui3i",
            "score": 1,
            "created_utc": 1549816671.0,
            "replies": []
        },
        {
            "body": "Lol tru that! No one likes a catfish :)",
            "author": null,
            "id": "eg8rsoa",
            "parent_id": "t1_eg7v6ol",
            "score": 2,
            "created_utc": 1549910671.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg5sdk4",
            "parent_id": "t1_eg5rcbz",
            "score": 5,
            "created_utc": 1549814485.0,
            "replies": [
                {
                    "body": "I agree completely and is what I'm saying.",
                    "author": "sexviewer",
                    "id": "eg5skkc",
                    "parent_id": "t1_eg5sdk4",
                    "score": 1,
                    "created_utc": 1549814654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But what is attractive? I do not like plastic IG. \n\nBeauty is in the eye of the beholder.\n\nEdit: cannot spell",
            "author": "girlz_are_42",
            "id": "eg5rxht",
            "parent_id": "t1_eg5rcbz",
            "score": 2,
            "created_utc": 1549814095.0,
            "replies": [
                {
                    "body": "I never said plastic instagram. I'm not a fan of that either. ",
                    "author": "sexviewer",
                    "id": "eg5s4mt",
                    "parent_id": "t1_eg5rxht",
                    "score": 1,
                    "created_utc": 1549814270.0,
                    "replies": []
                },
                {
                    "body": "Are you a fan of Beaty too..?  😂😂",
                    "author": "ruphun",
                    "id": "eg5shgi",
                    "parent_id": "t1_eg5rxht",
                    "score": 0,
                    "created_utc": 1549814579.0,
                    "replies": [
                        {
                            "body": "Huh?",
                            "author": "girlz_are_42",
                            "id": "eg5tyka",
                            "parent_id": "t1_eg5shgi",
                            "score": 1,
                            "created_utc": 1549815776.0,
                            "replies": [
                                {
                                    "body": "I was being snarky, here’s what you typed... “Beaty is in the eye of the beholder” 😜",
                                    "author": "ruphun",
                                    "id": "eg5u6h5",
                                    "parent_id": "t1_eg5tyka",
                                    "score": 1,
                                    "created_utc": 1549815944.0,
                                    "replies": [
                                        {
                                            "body": "😂😂 sprellojg hard",
                                            "author": "girlz_are_42",
                                            "id": "eg61e84",
                                            "parent_id": "t1_eg5u6h5",
                                            "score": 1,
                                            "created_utc": 1549821563.0,
                                            "replies": [
                                                {
                                                    "body": "I is a colledge stoodent 😜😈",
                                                    "author": "ruphun",
                                                    "id": "eg622kx",
                                                    "parent_id": "t1_eg61e84",
                                                    "score": 1,
                                                    "created_utc": 1549822081.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am a drop out. They suck at teaching entrepreneurs ",
                                                            "author": "girlz_are_42",
                                                            "id": "eg62oqv",
                                                            "parent_id": "t1_eg622kx",
                                                            "score": 0,
                                                            "created_utc": 1549822563.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That sounds like my story too 😂👍🏻",
                                                                    "author": "ruphun",
                                                                    "id": "eg62quh",
                                                                    "parent_id": "t1_eg62oqv",
                                                                    "score": 1,
                                                                    "created_utc": 1549822608.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Being attractive is definitely important, and so is being in shape, no matter what your shape is. But truthfully I would take an affectionate, fun loving, & sexual 7 or 8, over an uptight, entitled 9 or 10 any day..!  \n\n",
            "author": "ruphun",
            "id": "eg5t5cd",
            "parent_id": "t1_eg5rcbz",
            "score": 3,
            "created_utc": 1549815136.0,
            "replies": [
                {
                    "body": "Right, you need to be both attractive and have an awesome personality. There are just enough SB's out there that you don't have to pick one.",
                    "author": "sexviewer",
                    "id": "eg5uh1h",
                    "parent_id": "t1_eg5t5cd",
                    "score": 2,
                    "created_utc": 1549816163.0,
                    "replies": [
                        {
                            "body": "Exactly. And what separates a great SB from an average SB is a woman that realizes that being a SB is not about her getting spoiled because she’s a princess.. It’s about what she brings to the SR, and how she makes her SD life better, to give him a reason to want to spoil her and spend his money on her, over the 1000 other options he has.",
                            "author": "ruphun",
                            "id": "eg5uy63",
                            "parent_id": "t1_eg5uh1h",
                            "score": 0,
                            "created_utc": 1549816537.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Most of the SDs I’ve talked with, seem to put looks as a lower priority than you do. Maybe we can create a separate post/poll to find out. \n\nMaybe it has to do with the city, too. I live in Los Angeles, and there are a whole bunch of above average looking gals around here, *almost* to the point where being hot is to be assumed, but not literally. Some of us are average, like me ",
            "author": "thesluttypet",
            "id": "eg5vd2g",
            "parent_id": "t1_eg5rcbz",
            "score": 2,
            "created_utc": 1549816862.0,
            "replies": [
                {
                    "body": "I mean average looks do mean you're likely attractive to a portion of guys. I'm not saying looks are top priority, just that I wouldn't form a SR with someone I find unattractive. I believe most SD feel the same way, but this post is claiming otherwise so that's why im asking.",
                    "author": "sexviewer",
                    "id": "eg5wc6j",
                    "parent_id": "t1_eg5vd2g",
                    "score": 2,
                    "created_utc": 1549817635.0,
                    "replies": [
                        {
                            "body": "Oh. Well I definitely think attraction is important - but it didn’t seem like this post said differently. I read it more like: \n\n“Fake it till ya make it, you don’t have to be a solid 10 to be attractive. In fact, some girls who society would say are a 7, are another guy’s version of a 10”",
                            "author": "thesluttypet",
                            "id": "eg5wozi",
                            "parent_id": "t1_eg5wc6j",
                            "score": 2,
                            "created_utc": 1549817917.0,
                            "replies": [
                                {
                                    "body": "👌🏼👍🏻 I agree with the OP. “Beauty is always in the eye of the beholder”... After that, honesty is the most important quality, at least for/to me.",
                                    "author": "AKA_Mr_X",
                                    "id": "eg61u74",
                                    "parent_id": "t1_eg5wozi",
                                    "score": 2,
                                    "created_utc": 1549821904.0,
                                    "replies": [
                                        {
                                            "body": "Yeahhh! That’s a lot more how I see it, too. \n\nFor me, I really need to find someone with a matching sense of humor. I make jokes real often, but they are often sorta subtle or referencing a previous conversation that they have since forgotten, to the point where if the person misses the joke. I just feel awkward or sound creepy :p haha",
                                            "author": "thesluttypet",
                                            "id": "eg68tzj",
                                            "parent_id": "t1_eg61u74",
                                            "score": 1,
                                            "created_utc": 1549827423.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well like I said :) every SD is different. Just as every SB is different. I’m sure a few more SDs will comment on this so you’ll definitely get your opinions.",
            "author": null,
            "id": "eg5rm7u",
            "parent_id": "t1_eg5rcbz",
            "score": 2,
            "created_utc": 1549813819.0,
            "replies": [
                {
                    "body": "Kind of a bummer that all the SDs who care a lot about looks have decided it’s their time to shine on a post for which they are not even the target audience.  Because you’re right.  There are all sorts of SDs out there.  A lot care about looks first, and there’s nothing wrong with that!  But a lot care about intelligence first.  Or a willingness and ability to travel to them.  Or a mutual desire for an emotional connection.  Or a demonstrated and well-articulated need for financial support for a good cause (school, child support, etc.)\n\nFWIW, I’m a solid 6-7 in the looks department, but I have a great personality, I’m smart, kind, attentive, confident, don’t let the haters get me down ((*ahem!*)), and I have plenty of interest.  That interest comes from men who find my profile smart/articulate, upfront/honest, and CONFIDENT.\n\nAnyway, love the post.  You right, girl. ❤️ ",
                    "author": "lifeoftwopi",
                    "id": "eg5xvqf",
                    "parent_id": "t1_eg5rm7u",
                    "score": 0,
                    "created_utc": 1549818868.0,
                    "replies": [
                        {
                            "body": "Awe! I really enjoyed reading this! You seem like a really cool fella!\nGood to know you’re open minded on the subject as some guys out there can be real scummy about how a girl looks, making her feel like she’s nothing without her looks which honestly shouldn’t happen! No matter what it is we are doing, we should always take in consideration that people are still people with fragile mental healths :) x\n\nHaha I envy you! I let haters get to me too much. But more in a “You wanna fight, punk?!” Kinda way haha.",
                            "author": null,
                            "id": "eg6d8ss",
                            "parent_id": "t1_eg5xvqf",
                            "score": 1,
                            "created_utc": 1549830910.0,
                            "replies": [
                                {
                                    "body": "Lol wait, I’m a baby.  Sorry for not clarifying!  😂",
                                    "author": "lifeoftwopi",
                                    "id": "eg6dkx0",
                                    "parent_id": "t1_eg6d8ss",
                                    "score": 1,
                                    "created_utc": 1549831172.0,
                                    "replies": [
                                        {
                                            "body": "Haha I’ll protect you! I’ll bring boxing gloves 🥊 🤣",
                                            "author": null,
                                            "id": "eg6eajh",
                                            "parent_id": "t1_eg6dkx0",
                                            "score": 1,
                                            "created_utc": 1549831720.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're the norm among SDs",
            "author": "alphadawg26",
            "id": "ege52ja",
            "parent_id": "t1_eg5rcbz",
            "score": 1,
            "created_utc": 1550076940.0,
            "replies": []
        },
        {
            "body": "This is the healthiest response I’ve read so far :) ",
            "author": null,
            "id": "eg6do6r",
            "parent_id": "t1_eg61nft",
            "score": 3,
            "created_utc": 1549831243.0,
            "replies": []
        },
        {
            "body": "Fuck yea! This was exactly what the discussion needed!",
            "author": null,
            "id": "eg8qczm",
            "parent_id": "t1_eg8434b",
            "score": 1,
            "created_utc": 1549909869.0,
            "replies": []
        },
        {
            "body": "Sooo.... your shit?",
            "author": null,
            "id": "eg8q98d",
            "parent_id": "t1_eg8haio",
            "score": 4,
            "created_utc": 1549909811.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg99wzl",
                    "parent_id": "t1_eg8q98d",
                    "score": 1,
                    "created_utc": 1549920833.0,
                    "replies": [
                        {
                            "body": "Haha it took me a moment to actually understand this. Love the try hard passive aggressive attitude. Yknow it would be a lot less effort to just type “Lol”.",
                            "author": null,
                            "id": "eg9a32f",
                            "parent_id": "t1_eg99wzl",
                            "score": 3,
                            "created_utc": 1549920930.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "egbdrug",
                                    "parent_id": "t1_eg9a32f",
                                    "score": 1,
                                    "created_utc": 1549990276.0,
                                    "replies": [
                                        {
                                            "body": "You too xD but seriously man ? Haha you come across super passive aggressive! If you really aren’t then I suggest you work on that for futuristic purposes.",
                                            "author": null,
                                            "id": "egdb5m5",
                                            "parent_id": "t1_egbdrug",
                                            "score": 1,
                                            "created_utc": 1550044454.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yay :) Happy to read this! I’m sure I won’t be the only one.",
            "author": null,
            "id": "eg6cir2",
            "parent_id": "t1_eg6b1cm",
            "score": 2,
            "created_utc": 1549830345.0,
            "replies": []
        },
        {
            "body": "Awww shucks. I’m honored to get support for this idea. I don’t even post pictures of myself even though I’m 90% sure I’m a Seattle 10 in my age division :).  I need to converse with a POT and fall in love with his insides a little bit, even if just for the fact that he agreed on a blind date or that he was willing to share a fantasy and some witty banter.  People are beautiful. Just gotta see past their skin (unless there’s like way too much, I mean there are limits unfortunately for everyone). ",
            "author": "w-r",
            "id": "eg7agpk",
            "parent_id": "t1_eg74c2e",
            "score": 2,
            "created_utc": 1549857926.0,
            "replies": [
                {
                    "body": "You just get better and better!!   Love your comments and your love of people.  And - now I know you are a 'Seattle 10'   Your SD is (or will be) the luckiest of men!  ",
                    "author": "HappyBear1952",
                    "id": "eg8d5vb",
                    "parent_id": "t1_eg7agpk",
                    "score": 1,
                    "created_utc": 1549902082.0,
                    "replies": [
                        {
                            "body": "❤️ thank you happy bear. ",
                            "author": "w-r",
                            "id": "eg8e484",
                            "parent_id": "t1_eg8d5vb",
                            "score": 1,
                            "created_utc": 1549902674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes!\n\nAnd also, there are plenty of attractive women who don’t think they are attractive. SBs aren’t trying to date themselves, so they needn’t be attracted to themselves - just as long as the SD likes her and she likes him back, they’re good to go :)",
            "author": "thesluttypet",
            "id": "eg5ulol",
            "parent_id": "t1_eg5qfg4",
            "score": 9,
            "created_utc": 1549816262.0,
            "replies": [
                {
                    "body": "Fully agree :) I think everyone in some way struggles to see their perfections which is why they should do their best to keep their head in the game rather than obsess over what they can’t see x",
                    "author": null,
                    "id": "eg5vfwf",
                    "parent_id": "t1_eg5ulol",
                    "score": 1,
                    "created_utc": 1549816924.0,
                    "replies": [
                        {
                            "body": "Yeah. If nothing else, it will decrease negative thinking which will increase quality of life :)\n\nPersonally, I used to think I was super fat and ugly. I’d obsess over it. Trying not to let anyone see me from the side (I hated my face profile) or never wearing shorts/skirts for years because I thought my legs were bad..\n\nNow that I’ve gained confidence, I can look back and see that while Im certainly not perfect, I’ve never actually been fat nor ugly :p",
                            "author": "thesluttypet",
                            "id": "eg5w94y",
                            "parent_id": "t1_eg5vfwf",
                            "score": 1,
                            "created_utc": 1549817569.0,
                            "replies": [
                                {
                                    "body": "Good on you!\nTbh I only just hit the fuck it button in December and I gotta tell ya, I feel like I’ve lost the weight that made me feel fat. My weight being the worries.",
                                    "author": null,
                                    "id": "eg6cyr1",
                                    "parent_id": "t1_eg5w94y",
                                    "score": 1,
                                    "created_utc": 1549830688.0,
                                    "replies": []
                                },
                                {
                                    "body": "If you understand the metaphor x",
                                    "author": null,
                                    "id": "eg6czma",
                                    "parent_id": "t1_eg5w94y",
                                    "score": 1,
                                    "created_utc": 1549830707.0,
                                    "replies": [
                                        {
                                            "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
                                            "author": "thesluttypet",
                                            "id": "eg6ey6v",
                                            "parent_id": "t1_eg6czma",
                                            "score": 0,
                                            "created_utc": 1549832229.0,
                                            "replies": [
                                                {
                                                    "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                                                    "author": null,
                                                    "id": "eg6fae6",
                                                    "parent_id": "t1_eg6ey6v",
                                                    "score": 1,
                                                    "created_utc": 1549832482.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                                                            "author": "thesluttypet",
                                                            "id": "eg6gmre",
                                                            "parent_id": "t1_eg6fae6",
                                                            "score": 0,
                                                            "created_utc": 1549833510.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                                                    "author": null,
                                                                    "id": "eg6gs2s",
                                                                    "parent_id": "t1_eg6gmre",
                                                                    "score": 1,
                                                                    "created_utc": 1549833629.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                                                            "author": "thesluttypet",
                                                                            "id": "eg6guso",
                                                                            "parent_id": "t1_eg6gs2s",
                                                                            "score": 1,
                                                                            "created_utc": 1549833688.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                                                    "author": null,
                                                                                    "id": "eg6h557",
                                                                                    "parent_id": "t1_eg6guso",
                                                                                    "score": 1,
                                                                                    "created_utc": 1549833911.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How many SD do you think will pick a SB that they aren't physically attracted to? Yeah, everyone finds different traits attractive, but it is rare that a guy will pick a girl to vanilla date they don't find attractive and sugar allows men to be pickier both in looks and personality. Very few SD's dont care about looks.",
            "author": "sexviewer",
            "id": "eg6roux",
            "parent_id": "t1_eg5tx3g",
            "score": 4,
            "created_utc": 1549842109.0,
            "replies": [
                {
                    "body": "Actually I have met a lot of SDs that are primarily looking for personality and attention rather than just looks. I wouldn’t make this post without my own personal experience as backup. I don’t make these posts with false pretense and hopes. ",
                    "author": null,
                    "id": "eg6rxir",
                    "parent_id": "t1_eg6roux",
                    "score": 3,
                    "created_utc": 1549842301.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg7wd86",
                            "parent_id": "t1_eg6rxir",
                            "score": 2,
                            "created_utc": 1549887588.0,
                            "replies": [
                                {
                                    "body": "A. Thank you for the compliment.\nB. Not every guy thinks I’m attractive. Just because one guy says you’re hot doesn’t mean you are. It’s all about attitude and how you carry yourself. Confidence and prowess :) if I was depressed all the time and had no confidence in myself it wouldn’t be very attractive unless you meet a daddy that likes being the “protector” role. Which there, then again is still a match!\nIt’s all about perspective.\n\nI don’t shit on your beliefs so please don’t shit on other people’s beliefs :) if you want to believe in black and white views then that’s perfect okay.",
                                    "author": null,
                                    "id": "eg8rp9g",
                                    "parent_id": "t1_eg7wd86",
                                    "score": 3,
                                    "created_utc": 1549910617.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Right, I also am mainly focusing on finding a sugarbaby that I have a personality I can connect with and is attentive. But that's because a girl I'm not attracted to doesn't even get a message. Does she have to he a 10? Even in dating where looks play a smaller role for me, if I don't find a girl attractive then I'm not going to date her. That doesn't mean it's the primary thing I look at though. \n\nCould you elaborate on what you mean by having personal experience to back it up? Are you trying to say you've had a sugar daddy that did not find you attractive?",
                            "author": "sexviewer",
                            "id": "eg6zfse",
                            "parent_id": "t1_eg6rxir",
                            "score": 1,
                            "created_utc": 1549848757.0,
                            "replies": [
                                {
                                    "body": "I have actually. I’ve had some sugar daddy’s tell me I’m ugly as shit but I’ve also had some that have called me hot! \nOnes junk is another mans treasure. If you find one girl unattractive another guy might find her attractive. It’s completely based off of perspective honestly :) \n\nAnd it’s perfectly fine that you care about looks. Honestly a lot of guys reading this are mistaking what im saying to be “guys who look for hot girls are assholes” and I promise that’s not what I’m saying at all! I’m saying that every SD is different just as every SB is different. :) And that I think attitude is the most important thing.\n\nA bad attitude hot girl who doesn’t make dates won’t get far for being a waste of time.\n\nA bad attitude rich man who makes girls feel like crap also won’t get far.\nHe might if there’s girls who try to endure it because she really needs the cash but they’d never actually have a connection.",
                                    "author": null,
                                    "id": "eg70bdg",
                                    "parent_id": "t1_eg6zfse",
                                    "score": 1,
                                    "created_utc": 1549849493.0,
                                    "replies": [
                                        {
                                            "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
                                            "author": "sexviewer",
                                            "id": "eg716wu",
                                            "parent_id": "t1_eg70bdg",
                                            "score": 3,
                                            "created_utc": 1549850218.0,
                                            "replies": [
                                                {
                                                    "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                                                    "author": null,
                                                    "id": "eg71dbb",
                                                    "parent_id": "t1_eg716wu",
                                                    "score": 2,
                                                    "created_utc": 1549850365.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                                                            "author": "sexviewer",
                                                            "id": "eg75pdr",
                                                            "parent_id": "t1_eg71dbb",
                                                            "score": 3,
                                                            "created_utc": 1549853985.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                                                    "author": null,
                                                                    "id": "eg8r4vy",
                                                                    "parent_id": "t1_eg75pdr",
                                                                    "score": 3,
                                                                    "created_utc": 1549910302.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is an important additional component to the discussion.  For the SD whose primary focus is on looks there will always be another woman more attractive and thus the relationship is likely to be short term. \n\nCharacteristics like character, fun, interesting, intelligent, respectful of commitments are more likely to be enduring and not compared on a continuing basis.  \n\nYou want to be a partner in a relationship not a hunting trophy",
            "author": "pinotandsugar",
            "id": "eg68ukr",
            "parent_id": "t1_eg5tx3g",
            "score": 3,
            "created_utc": 1549827437.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg6brpy",
                    "parent_id": "t1_eg68ukr",
                    "score": 1,
                    "created_utc": 1549829752.0,
                    "replies": [
                        {
                            "body": "Hahaha loved this x and idk I don’t use Match.com and I haven’t ever seen another SBs profile before but I can assure that looking for the diamonds in the rocks are always worth it. But then again I think SDs pay for their memberships? Damn haha. The sugar bowl is quite the rumble isn’t it? 😂 I guess its simply gambling. Like a, ‘Play to win’ sorta thing. Play and you get a  shiny new Sb ~ \n",
                            "author": null,
                            "id": "eg6e00t",
                            "parent_id": "t1_eg6brpy",
                            "score": 1,
                            "created_utc": 1549831494.0,
                            "replies": []
                        },
                        {
                            "body": "I've never been on match but I assume it is primarily peer group dating on speed. ",
                            "author": "pinotandsugar",
                            "id": "eg6ggom",
                            "parent_id": "t1_eg6brpy",
                            "score": 1,
                            "created_utc": 1549833381.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eg6kb5l",
                                    "parent_id": "t1_eg6ggom",
                                    "score": 1,
                                    "created_utc": 1549836296.0,
                                    "replies": [
                                        {
                                            "body": "attitude , energy ,not looking for long term / permanent relationship",
                                            "author": "pinotandsugar",
                                            "id": "eg6zmst",
                                            "parent_id": "t1_eg6kb5l",
                                            "score": 0,
                                            "created_utc": 1549848925.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m confused x this doesn’t seem at all what that guy was talking about.",
            "author": null,
            "id": "eg6r5ju",
            "parent_id": "t1_eg5v0y9",
            "score": 2,
            "created_utc": 1549841662.0,
            "replies": [
                {
                    "body": "I guess I was reading a bit far into it, and making up some stuff. \n\nBasically. I was trying to equate a “SD” with a $200/mo budget to a SB ugly enough inside and out to only be worth $200/mo. \n\nIn your OP, you didn’t say looks don’t matter *at all*. Or that everyone can succeed in the bowl, all you have to do is want it. You simply said some practical advice and alternative ways of thinking that are much healthier and more attractive, in a partner (or anyone). \n\nThe guy I was responding to made it seem like the OP was unrealistically inspirational or not relatable. I don’t think what you said was even close to telling a poor dude to be a SD. And that’s the aspect I was responding to :)",
                    "author": "thesluttypet",
                    "id": "eg6s8hx",
                    "parent_id": "t1_eg6r5ju",
                    "score": 2,
                    "created_utc": 1549842552.0,
                    "replies": [
                        {
                            "body": "Oh okay :) I understand now! I was so confused haha!",
                            "author": null,
                            "id": "eg6sbcm",
                            "parent_id": "t1_eg6s8hx",
                            "score": 2,
                            "created_utc": 1549842618.0,
                            "replies": [
                                {
                                    "body": "Hehe no worries. I accidentally forget everyone doesn’t know what I’m thinking about / responding to :p",
                                    "author": "thesluttypet",
                                    "id": "eg6sfk5",
                                    "parent_id": "t1_eg6sbcm",
                                    "score": 2,
                                    "created_utc": 1549842715.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg7vymj",
            "parent_id": "t1_eg5v0y9",
            "score": 2,
            "created_utc": 1549887060.0,
            "replies": [
                {
                    "body": "Umm. \n\nI don’t think we read the same OP. Never once did I read here say “ looks aren’t important to many guys”\n\nWhat you seen to be missing, is that many women who you (and society) would say are pretty, don’t think they are pretty. In fact, I think OP wrote that based on personal experience. \n\nBut, instead of making any assumptions about the OP, I’ll tell you from my point of view. I have personally felt that I was hideous, that my breasts appear“saggy” because they’re small or that my nose is too big - all things that would intimidate me from entering the Sugar Bowl. But guess what? I get tons of guys (and girls) interested in me. And when I meet people from online, I’m usually told I look better in person than in my photos. \n\nBasically, you read the OP and thought it was BS because you assumed she was saying something like: “Ugly people can easily be super successful in the bowl, just because of their good personality” (or something like that, right?)\n\nAnd I read the OP and agreed. Because I think she’s saying something closer to “stop obsessing over the little things you think are wrong with you, confidence, connection, and personality are the main things to keep a SR going. Looks matter at first, because attraction is important. But guys aren’t usually looking for a 10 to use solely as arm candy. In fact, almost every SD would prefer a 7-8 who is fun, genuine in bed, and interesting to talk to”",
                    "author": "thesluttypet",
                    "id": "egb68eg",
                    "parent_id": "t1_eg7vymj",
                    "score": 3,
                    "created_utc": 1549984911.0,
                    "replies": []
                },
                {
                    "body": "You make the most sensible points I've read on these threads\n\nKeep up the good work.  Sometimes the most true points are more difficult because of group think on the SB side with demands that SDs accept no standards. \n\nJust like some SDs are not well off enough for most SBs to afford sugaring, there are SBs that aren't attractive enough to command much of an allowance.\n\nJust the reality of the game.",
                    "author": "alphadawg26",
                    "id": "ege2spb",
                    "parent_id": "t1_eg7vymj",
                    "score": 1,
                    "created_utc": 1550075451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha I thought they were obviously different things - but if it’s thinkable someone will have thought it..",
            "author": "thesluttypet",
            "id": "eg5v3rv",
            "parent_id": "t1_eg5rqg3",
            "score": 3,
            "created_utc": 1549816661.0,
            "replies": [
                {
                    "body": "Well it would still be completely off topic and a random sub argument that should be probably taken up in a different post x completely valid, but off topic :)",
                    "author": null,
                    "id": "eg5vi27",
                    "parent_id": "t1_eg5v3rv",
                    "score": 2,
                    "created_utc": 1549816972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being physically attracted to a women is not shallow. That is human nature. Being a bigot on looks is fucked up, and happens.\n\nLife is ducking ruthless at times. Accept it! Rejoice in it! Thrive in it.\n\nFail fast and get back the fuck up!",
            "author": "girlz_are_42",
            "id": "eg61b7l",
            "parent_id": "t1_eg5uveo",
            "score": 2,
            "created_utc": 1549821497.0,
            "replies": [
                {
                    "body": "Haha i never said being shallow was bad :) like I said I’m also kinda shallow even though I accept personalities wholeheartedly. \n\nHonestly, talking from a personal standpoint, I own a fire proof vest but it doesn’t mean I am fireproof. If you can hear it , it can hurt anyone who is critical of themselves.  ( reference to a cantrip from dnd I couldn’t help making! )\n\nBut you’re right. That “can do” spirit is what keeps his society thriving and surviving! :) ",
                    "author": null,
                    "id": "eg6dia2",
                    "parent_id": "t1_eg61b7l",
                    "score": 1,
                    "created_utc": 1549831114.0,
                    "replies": [
                        {
                            "body": "Well I wish we had a just tad more of the can do 😂😂😂\n\nCantrip from DND? Now you are talking my language 😂😂",
                            "author": "girlz_are_42",
                            "id": "eg6dznf",
                            "parent_id": "t1_eg6dia2",
                            "score": 0,
                            "created_utc": 1549831487.0,
                            "replies": [
                                {
                                    "body": "Honestly, I had an idea once of s dating website where you would be manually paired with someone by professional love psychiatrists. Scientific but.. A lot more effective since our own brains often suck at finding our perfect partners.\n\nHaha yeah I was referencing “Vicious Mochery” . It saved me once when I was attacked by 3 orcs.😬",
                                    "author": null,
                                    "id": "eg6eht2",
                                    "parent_id": "t1_eg6dznf",
                                    "score": -1,
                                    "created_utc": 1549831880.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My all-time favorite SB is:\n\n* Gorgeous\n* Has the tiniest boobs I've ever seen up close and personal.\n\nDid I mention she was gorgeous?\n\nAnd my all-time favorite SB?",
            "author": "marker3000",
            "id": "eg7ngg8",
            "parent_id": "t1_eg6e4jp",
            "score": 2,
            "created_utc": 1549872724.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6fo50",
            "parent_id": "t1_eg6e4jp",
            "score": 1,
            "created_utc": 1549832771.0,
            "replies": [
                {
                    "body": "Me too :)",
                    "author": null,
                    "id": "eg6gm02",
                    "parent_id": "t1_eg6fo50",
                    "score": 2,
                    "created_utc": 1549833493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6pfzt",
            "parent_id": "t1_eg6okmb",
            "score": 4,
            "created_utc": 1549840264.0,
            "replies": [
                {
                    "body": "The irony of your comment is that it itself is a generalization",
                    "author": "throwawaySD654",
                    "id": "eg6plhf",
                    "parent_id": "t1_eg6pfzt",
                    "score": 1,
                    "created_utc": 1549840387.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg6pzzu",
                            "parent_id": "t1_eg6plhf",
                            "score": -1,
                            "created_utc": 1549840709.0,
                            "replies": [
                                {
                                    "body": "Unclear what point you’re trying to make with your non-sequitur. But you indirectly supported mine: you were triggered by my comment and replied with emotion, not logic.",
                                    "author": "throwawaySD654",
                                    "id": "eg6qcmd",
                                    "parent_id": "t1_eg6pzzu",
                                    "score": 3,
                                    "created_utc": 1549840997.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">SD financial thing nothing to do with this post\n\nIsn't the \"SD financial thing\" the baseline idea for all posts? It's the reason any of this even exists. Denying this is as extreme as saying \"your looks have nothing to do with that\".The post seems like  a con job to boost user account numbers for investor review.   \nEdit: removed extra word",
            "author": "sweetmagnum",
            "id": "eg6um4x",
            "parent_id": "t1_eg6pv7w",
            "score": 3,
            "created_utc": 1549844587.0,
            "replies": [
                {
                    "body": "It’s actually astounding how other people’s negative mindsets can create something so awful out of a post created to boost moral.\nDo you think I fap to post likes or something like some sad weirdo? Come in man. With this kind of logo you’re accusing everyone who ever posts for doing it just for the likes.\nAnd each some people do and when you can’t recognise the difference between them then you don’t really have an actual clear perspective on your own opinion.\n\nI was saying how it’s a completely different matter that the guy essentially said that “ if an Sd doesn’t have much cash then that means he can still be an sd?” , he tried to link it to this post as if saying the way an SB carried herself and how much an Aspiring SD carries in his wallet is the same issue. I’m talking and SBs mental image of themselves. And what you and this guy are talking about are Whether a broke guy can be an SD or not.",
                    "author": null,
                    "id": "eg6v0id",
                    "parent_id": "t1_eg6um4x",
                    "score": 0,
                    "created_utc": 1549844937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree completely and is what I'm saying.",
            "author": "sexviewer",
            "id": "eg5skkc",
            "parent_id": "t1_eg5sdk4",
            "score": 1,
            "created_utc": 1549814654.0,
            "replies": []
        },
        {
            "body": "I never said plastic instagram. I'm not a fan of that either. ",
            "author": "sexviewer",
            "id": "eg5s4mt",
            "parent_id": "t1_eg5rxht",
            "score": 1,
            "created_utc": 1549814270.0,
            "replies": []
        },
        {
            "body": "Are you a fan of Beaty too..?  😂😂",
            "author": "ruphun",
            "id": "eg5shgi",
            "parent_id": "t1_eg5rxht",
            "score": 0,
            "created_utc": 1549814579.0,
            "replies": [
                {
                    "body": "Huh?",
                    "author": "girlz_are_42",
                    "id": "eg5tyka",
                    "parent_id": "t1_eg5shgi",
                    "score": 1,
                    "created_utc": 1549815776.0,
                    "replies": [
                        {
                            "body": "I was being snarky, here’s what you typed... “Beaty is in the eye of the beholder” 😜",
                            "author": "ruphun",
                            "id": "eg5u6h5",
                            "parent_id": "t1_eg5tyka",
                            "score": 1,
                            "created_utc": 1549815944.0,
                            "replies": [
                                {
                                    "body": "😂😂 sprellojg hard",
                                    "author": "girlz_are_42",
                                    "id": "eg61e84",
                                    "parent_id": "t1_eg5u6h5",
                                    "score": 1,
                                    "created_utc": 1549821563.0,
                                    "replies": [
                                        {
                                            "body": "I is a colledge stoodent 😜😈",
                                            "author": "ruphun",
                                            "id": "eg622kx",
                                            "parent_id": "t1_eg61e84",
                                            "score": 1,
                                            "created_utc": 1549822081.0,
                                            "replies": [
                                                {
                                                    "body": "I am a drop out. They suck at teaching entrepreneurs ",
                                                    "author": "girlz_are_42",
                                                    "id": "eg62oqv",
                                                    "parent_id": "t1_eg622kx",
                                                    "score": 0,
                                                    "created_utc": 1549822563.0,
                                                    "replies": [
                                                        {
                                                            "body": "That sounds like my story too 😂👍🏻",
                                                            "author": "ruphun",
                                                            "id": "eg62quh",
                                                            "parent_id": "t1_eg62oqv",
                                                            "score": 1,
                                                            "created_utc": 1549822608.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right, you need to be both attractive and have an awesome personality. There are just enough SB's out there that you don't have to pick one.",
            "author": "sexviewer",
            "id": "eg5uh1h",
            "parent_id": "t1_eg5t5cd",
            "score": 2,
            "created_utc": 1549816163.0,
            "replies": [
                {
                    "body": "Exactly. And what separates a great SB from an average SB is a woman that realizes that being a SB is not about her getting spoiled because she’s a princess.. It’s about what she brings to the SR, and how she makes her SD life better, to give him a reason to want to spoil her and spend his money on her, over the 1000 other options he has.",
                    "author": "ruphun",
                    "id": "eg5uy63",
                    "parent_id": "t1_eg5uh1h",
                    "score": 0,
                    "created_utc": 1549816537.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean average looks do mean you're likely attractive to a portion of guys. I'm not saying looks are top priority, just that I wouldn't form a SR with someone I find unattractive. I believe most SD feel the same way, but this post is claiming otherwise so that's why im asking.",
            "author": "sexviewer",
            "id": "eg5wc6j",
            "parent_id": "t1_eg5vd2g",
            "score": 2,
            "created_utc": 1549817635.0,
            "replies": [
                {
                    "body": "Oh. Well I definitely think attraction is important - but it didn’t seem like this post said differently. I read it more like: \n\n“Fake it till ya make it, you don’t have to be a solid 10 to be attractive. In fact, some girls who society would say are a 7, are another guy’s version of a 10”",
                    "author": "thesluttypet",
                    "id": "eg5wozi",
                    "parent_id": "t1_eg5wc6j",
                    "score": 2,
                    "created_utc": 1549817917.0,
                    "replies": [
                        {
                            "body": "👌🏼👍🏻 I agree with the OP. “Beauty is always in the eye of the beholder”... After that, honesty is the most important quality, at least for/to me.",
                            "author": "AKA_Mr_X",
                            "id": "eg61u74",
                            "parent_id": "t1_eg5wozi",
                            "score": 2,
                            "created_utc": 1549821904.0,
                            "replies": [
                                {
                                    "body": "Yeahhh! That’s a lot more how I see it, too. \n\nFor me, I really need to find someone with a matching sense of humor. I make jokes real often, but they are often sorta subtle or referencing a previous conversation that they have since forgotten, to the point where if the person misses the joke. I just feel awkward or sound creepy :p haha",
                                    "author": "thesluttypet",
                                    "id": "eg68tzj",
                                    "parent_id": "t1_eg61u74",
                                    "score": 1,
                                    "created_utc": 1549827423.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kind of a bummer that all the SDs who care a lot about looks have decided it’s their time to shine on a post for which they are not even the target audience.  Because you’re right.  There are all sorts of SDs out there.  A lot care about looks first, and there’s nothing wrong with that!  But a lot care about intelligence first.  Or a willingness and ability to travel to them.  Or a mutual desire for an emotional connection.  Or a demonstrated and well-articulated need for financial support for a good cause (school, child support, etc.)\n\nFWIW, I’m a solid 6-7 in the looks department, but I have a great personality, I’m smart, kind, attentive, confident, don’t let the haters get me down ((*ahem!*)), and I have plenty of interest.  That interest comes from men who find my profile smart/articulate, upfront/honest, and CONFIDENT.\n\nAnyway, love the post.  You right, girl. ❤️ ",
            "author": "lifeoftwopi",
            "id": "eg5xvqf",
            "parent_id": "t1_eg5rm7u",
            "score": 0,
            "created_utc": 1549818868.0,
            "replies": [
                {
                    "body": "Awe! I really enjoyed reading this! You seem like a really cool fella!\nGood to know you’re open minded on the subject as some guys out there can be real scummy about how a girl looks, making her feel like she’s nothing without her looks which honestly shouldn’t happen! No matter what it is we are doing, we should always take in consideration that people are still people with fragile mental healths :) x\n\nHaha I envy you! I let haters get to me too much. But more in a “You wanna fight, punk?!” Kinda way haha.",
                    "author": null,
                    "id": "eg6d8ss",
                    "parent_id": "t1_eg5xvqf",
                    "score": 1,
                    "created_utc": 1549830910.0,
                    "replies": [
                        {
                            "body": "Lol wait, I’m a baby.  Sorry for not clarifying!  😂",
                            "author": "lifeoftwopi",
                            "id": "eg6dkx0",
                            "parent_id": "t1_eg6d8ss",
                            "score": 1,
                            "created_utc": 1549831172.0,
                            "replies": [
                                {
                                    "body": "Haha I’ll protect you! I’ll bring boxing gloves 🥊 🤣",
                                    "author": null,
                                    "id": "eg6eajh",
                                    "parent_id": "t1_eg6dkx0",
                                    "score": 1,
                                    "created_utc": 1549831720.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg99wzl",
            "parent_id": "t1_eg8q98d",
            "score": 1,
            "created_utc": 1549920833.0,
            "replies": [
                {
                    "body": "Haha it took me a moment to actually understand this. Love the try hard passive aggressive attitude. Yknow it would be a lot less effort to just type “Lol”.",
                    "author": null,
                    "id": "eg9a32f",
                    "parent_id": "t1_eg99wzl",
                    "score": 3,
                    "created_utc": 1549920930.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "egbdrug",
                            "parent_id": "t1_eg9a32f",
                            "score": 1,
                            "created_utc": 1549990276.0,
                            "replies": [
                                {
                                    "body": "You too xD but seriously man ? Haha you come across super passive aggressive! If you really aren’t then I suggest you work on that for futuristic purposes.",
                                    "author": null,
                                    "id": "egdb5m5",
                                    "parent_id": "t1_egbdrug",
                                    "score": 1,
                                    "created_utc": 1550044454.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You just get better and better!!   Love your comments and your love of people.  And - now I know you are a 'Seattle 10'   Your SD is (or will be) the luckiest of men!  ",
            "author": "HappyBear1952",
            "id": "eg8d5vb",
            "parent_id": "t1_eg7agpk",
            "score": 1,
            "created_utc": 1549902082.0,
            "replies": [
                {
                    "body": "❤️ thank you happy bear. ",
                    "author": "w-r",
                    "id": "eg8e484",
                    "parent_id": "t1_eg8d5vb",
                    "score": 1,
                    "created_utc": 1549902674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fully agree :) I think everyone in some way struggles to see their perfections which is why they should do their best to keep their head in the game rather than obsess over what they can’t see x",
            "author": null,
            "id": "eg5vfwf",
            "parent_id": "t1_eg5ulol",
            "score": 1,
            "created_utc": 1549816924.0,
            "replies": [
                {
                    "body": "Yeah. If nothing else, it will decrease negative thinking which will increase quality of life :)\n\nPersonally, I used to think I was super fat and ugly. I’d obsess over it. Trying not to let anyone see me from the side (I hated my face profile) or never wearing shorts/skirts for years because I thought my legs were bad..\n\nNow that I’ve gained confidence, I can look back and see that while Im certainly not perfect, I’ve never actually been fat nor ugly :p",
                    "author": "thesluttypet",
                    "id": "eg5w94y",
                    "parent_id": "t1_eg5vfwf",
                    "score": 1,
                    "created_utc": 1549817569.0,
                    "replies": [
                        {
                            "body": "Good on you!\nTbh I only just hit the fuck it button in December and I gotta tell ya, I feel like I’ve lost the weight that made me feel fat. My weight being the worries.",
                            "author": null,
                            "id": "eg6cyr1",
                            "parent_id": "t1_eg5w94y",
                            "score": 1,
                            "created_utc": 1549830688.0,
                            "replies": []
                        },
                        {
                            "body": "If you understand the metaphor x",
                            "author": null,
                            "id": "eg6czma",
                            "parent_id": "t1_eg5w94y",
                            "score": 1,
                            "created_utc": 1549830707.0,
                            "replies": [
                                {
                                    "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
                                    "author": "thesluttypet",
                                    "id": "eg6ey6v",
                                    "parent_id": "t1_eg6czma",
                                    "score": 0,
                                    "created_utc": 1549832229.0,
                                    "replies": [
                                        {
                                            "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                                            "author": null,
                                            "id": "eg6fae6",
                                            "parent_id": "t1_eg6ey6v",
                                            "score": 1,
                                            "created_utc": 1549832482.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                                                    "author": "thesluttypet",
                                                    "id": "eg6gmre",
                                                    "parent_id": "t1_eg6fae6",
                                                    "score": 0,
                                                    "created_utc": 1549833510.0,
                                                    "replies": [
                                                        {
                                                            "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                                            "author": null,
                                                            "id": "eg6gs2s",
                                                            "parent_id": "t1_eg6gmre",
                                                            "score": 1,
                                                            "created_utc": 1549833629.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                                                    "author": "thesluttypet",
                                                                    "id": "eg6guso",
                                                                    "parent_id": "t1_eg6gs2s",
                                                                    "score": 1,
                                                                    "created_utc": 1549833688.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                                            "author": null,
                                                                            "id": "eg6h557",
                                                                            "parent_id": "t1_eg6guso",
                                                                            "score": 1,
                                                                            "created_utc": 1549833911.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Actually I have met a lot of SDs that are primarily looking for personality and attention rather than just looks. I wouldn’t make this post without my own personal experience as backup. I don’t make these posts with false pretense and hopes. ",
            "author": null,
            "id": "eg6rxir",
            "parent_id": "t1_eg6roux",
            "score": 3,
            "created_utc": 1549842301.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg7wd86",
                    "parent_id": "t1_eg6rxir",
                    "score": 2,
                    "created_utc": 1549887588.0,
                    "replies": [
                        {
                            "body": "A. Thank you for the compliment.\nB. Not every guy thinks I’m attractive. Just because one guy says you’re hot doesn’t mean you are. It’s all about attitude and how you carry yourself. Confidence and prowess :) if I was depressed all the time and had no confidence in myself it wouldn’t be very attractive unless you meet a daddy that likes being the “protector” role. Which there, then again is still a match!\nIt’s all about perspective.\n\nI don’t shit on your beliefs so please don’t shit on other people’s beliefs :) if you want to believe in black and white views then that’s perfect okay.",
                            "author": null,
                            "id": "eg8rp9g",
                            "parent_id": "t1_eg7wd86",
                            "score": 3,
                            "created_utc": 1549910617.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Right, I also am mainly focusing on finding a sugarbaby that I have a personality I can connect with and is attentive. But that's because a girl I'm not attracted to doesn't even get a message. Does she have to he a 10? Even in dating where looks play a smaller role for me, if I don't find a girl attractive then I'm not going to date her. That doesn't mean it's the primary thing I look at though. \n\nCould you elaborate on what you mean by having personal experience to back it up? Are you trying to say you've had a sugar daddy that did not find you attractive?",
                    "author": "sexviewer",
                    "id": "eg6zfse",
                    "parent_id": "t1_eg6rxir",
                    "score": 1,
                    "created_utc": 1549848757.0,
                    "replies": [
                        {
                            "body": "I have actually. I’ve had some sugar daddy’s tell me I’m ugly as shit but I’ve also had some that have called me hot! \nOnes junk is another mans treasure. If you find one girl unattractive another guy might find her attractive. It’s completely based off of perspective honestly :) \n\nAnd it’s perfectly fine that you care about looks. Honestly a lot of guys reading this are mistaking what im saying to be “guys who look for hot girls are assholes” and I promise that’s not what I’m saying at all! I’m saying that every SD is different just as every SB is different. :) And that I think attitude is the most important thing.\n\nA bad attitude hot girl who doesn’t make dates won’t get far for being a waste of time.\n\nA bad attitude rich man who makes girls feel like crap also won’t get far.\nHe might if there’s girls who try to endure it because she really needs the cash but they’d never actually have a connection.",
                            "author": null,
                            "id": "eg70bdg",
                            "parent_id": "t1_eg6zfse",
                            "score": 1,
                            "created_utc": 1549849493.0,
                            "replies": [
                                {
                                    "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
                                    "author": "sexviewer",
                                    "id": "eg716wu",
                                    "parent_id": "t1_eg70bdg",
                                    "score": 3,
                                    "created_utc": 1549850218.0,
                                    "replies": [
                                        {
                                            "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                                            "author": null,
                                            "id": "eg71dbb",
                                            "parent_id": "t1_eg716wu",
                                            "score": 2,
                                            "created_utc": 1549850365.0,
                                            "replies": [
                                                {
                                                    "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                                                    "author": "sexviewer",
                                                    "id": "eg75pdr",
                                                    "parent_id": "t1_eg71dbb",
                                                    "score": 3,
                                                    "created_utc": 1549853985.0,
                                                    "replies": [
                                                        {
                                                            "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                                            "author": null,
                                                            "id": "eg8r4vy",
                                                            "parent_id": "t1_eg75pdr",
                                                            "score": 3,
                                                            "created_utc": 1549910302.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6brpy",
            "parent_id": "t1_eg68ukr",
            "score": 1,
            "created_utc": 1549829752.0,
            "replies": [
                {
                    "body": "Hahaha loved this x and idk I don’t use Match.com and I haven’t ever seen another SBs profile before but I can assure that looking for the diamonds in the rocks are always worth it. But then again I think SDs pay for their memberships? Damn haha. The sugar bowl is quite the rumble isn’t it? 😂 I guess its simply gambling. Like a, ‘Play to win’ sorta thing. Play and you get a  shiny new Sb ~ \n",
                    "author": null,
                    "id": "eg6e00t",
                    "parent_id": "t1_eg6brpy",
                    "score": 1,
                    "created_utc": 1549831494.0,
                    "replies": []
                },
                {
                    "body": "I've never been on match but I assume it is primarily peer group dating on speed. ",
                    "author": "pinotandsugar",
                    "id": "eg6ggom",
                    "parent_id": "t1_eg6brpy",
                    "score": 1,
                    "created_utc": 1549833381.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eg6kb5l",
                            "parent_id": "t1_eg6ggom",
                            "score": 1,
                            "created_utc": 1549836296.0,
                            "replies": [
                                {
                                    "body": "attitude , energy ,not looking for long term / permanent relationship",
                                    "author": "pinotandsugar",
                                    "id": "eg6zmst",
                                    "parent_id": "t1_eg6kb5l",
                                    "score": 0,
                                    "created_utc": 1549848925.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I guess I was reading a bit far into it, and making up some stuff. \n\nBasically. I was trying to equate a “SD” with a $200/mo budget to a SB ugly enough inside and out to only be worth $200/mo. \n\nIn your OP, you didn’t say looks don’t matter *at all*. Or that everyone can succeed in the bowl, all you have to do is want it. You simply said some practical advice and alternative ways of thinking that are much healthier and more attractive, in a partner (or anyone). \n\nThe guy I was responding to made it seem like the OP was unrealistically inspirational or not relatable. I don’t think what you said was even close to telling a poor dude to be a SD. And that’s the aspect I was responding to :)",
            "author": "thesluttypet",
            "id": "eg6s8hx",
            "parent_id": "t1_eg6r5ju",
            "score": 2,
            "created_utc": 1549842552.0,
            "replies": [
                {
                    "body": "Oh okay :) I understand now! I was so confused haha!",
                    "author": null,
                    "id": "eg6sbcm",
                    "parent_id": "t1_eg6s8hx",
                    "score": 2,
                    "created_utc": 1549842618.0,
                    "replies": [
                        {
                            "body": "Hehe no worries. I accidentally forget everyone doesn’t know what I’m thinking about / responding to :p",
                            "author": "thesluttypet",
                            "id": "eg6sfk5",
                            "parent_id": "t1_eg6sbcm",
                            "score": 2,
                            "created_utc": 1549842715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Umm. \n\nI don’t think we read the same OP. Never once did I read here say “ looks aren’t important to many guys”\n\nWhat you seen to be missing, is that many women who you (and society) would say are pretty, don’t think they are pretty. In fact, I think OP wrote that based on personal experience. \n\nBut, instead of making any assumptions about the OP, I’ll tell you from my point of view. I have personally felt that I was hideous, that my breasts appear“saggy” because they’re small or that my nose is too big - all things that would intimidate me from entering the Sugar Bowl. But guess what? I get tons of guys (and girls) interested in me. And when I meet people from online, I’m usually told I look better in person than in my photos. \n\nBasically, you read the OP and thought it was BS because you assumed she was saying something like: “Ugly people can easily be super successful in the bowl, just because of their good personality” (or something like that, right?)\n\nAnd I read the OP and agreed. Because I think she’s saying something closer to “stop obsessing over the little things you think are wrong with you, confidence, connection, and personality are the main things to keep a SR going. Looks matter at first, because attraction is important. But guys aren’t usually looking for a 10 to use solely as arm candy. In fact, almost every SD would prefer a 7-8 who is fun, genuine in bed, and interesting to talk to”",
            "author": "thesluttypet",
            "id": "egb68eg",
            "parent_id": "t1_eg7vymj",
            "score": 3,
            "created_utc": 1549984911.0,
            "replies": []
        },
        {
            "body": "You make the most sensible points I've read on these threads\n\nKeep up the good work.  Sometimes the most true points are more difficult because of group think on the SB side with demands that SDs accept no standards. \n\nJust like some SDs are not well off enough for most SBs to afford sugaring, there are SBs that aren't attractive enough to command much of an allowance.\n\nJust the reality of the game.",
            "author": "alphadawg26",
            "id": "ege2spb",
            "parent_id": "t1_eg7vymj",
            "score": 1,
            "created_utc": 1550075451.0,
            "replies": []
        },
        {
            "body": "Well it would still be completely off topic and a random sub argument that should be probably taken up in a different post x completely valid, but off topic :)",
            "author": null,
            "id": "eg5vi27",
            "parent_id": "t1_eg5v3rv",
            "score": 2,
            "created_utc": 1549816972.0,
            "replies": []
        },
        {
            "body": "Haha i never said being shallow was bad :) like I said I’m also kinda shallow even though I accept personalities wholeheartedly. \n\nHonestly, talking from a personal standpoint, I own a fire proof vest but it doesn’t mean I am fireproof. If you can hear it , it can hurt anyone who is critical of themselves.  ( reference to a cantrip from dnd I couldn’t help making! )\n\nBut you’re right. That “can do” spirit is what keeps his society thriving and surviving! :) ",
            "author": null,
            "id": "eg6dia2",
            "parent_id": "t1_eg61b7l",
            "score": 1,
            "created_utc": 1549831114.0,
            "replies": [
                {
                    "body": "Well I wish we had a just tad more of the can do 😂😂😂\n\nCantrip from DND? Now you are talking my language 😂😂",
                    "author": "girlz_are_42",
                    "id": "eg6dznf",
                    "parent_id": "t1_eg6dia2",
                    "score": 0,
                    "created_utc": 1549831487.0,
                    "replies": [
                        {
                            "body": "Honestly, I had an idea once of s dating website where you would be manually paired with someone by professional love psychiatrists. Scientific but.. A lot more effective since our own brains often suck at finding our perfect partners.\n\nHaha yeah I was referencing “Vicious Mochery” . It saved me once when I was attacked by 3 orcs.😬",
                            "author": null,
                            "id": "eg6eht2",
                            "parent_id": "t1_eg6dznf",
                            "score": -1,
                            "created_utc": 1549831880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me too :)",
            "author": null,
            "id": "eg6gm02",
            "parent_id": "t1_eg6fo50",
            "score": 2,
            "created_utc": 1549833493.0,
            "replies": []
        },
        {
            "body": "The irony of your comment is that it itself is a generalization",
            "author": "throwawaySD654",
            "id": "eg6plhf",
            "parent_id": "t1_eg6pfzt",
            "score": 1,
            "created_utc": 1549840387.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg6pzzu",
                    "parent_id": "t1_eg6plhf",
                    "score": -1,
                    "created_utc": 1549840709.0,
                    "replies": [
                        {
                            "body": "Unclear what point you’re trying to make with your non-sequitur. But you indirectly supported mine: you were triggered by my comment and replied with emotion, not logic.",
                            "author": "throwawaySD654",
                            "id": "eg6qcmd",
                            "parent_id": "t1_eg6pzzu",
                            "score": 3,
                            "created_utc": 1549840997.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s actually astounding how other people’s negative mindsets can create something so awful out of a post created to boost moral.\nDo you think I fap to post likes or something like some sad weirdo? Come in man. With this kind of logo you’re accusing everyone who ever posts for doing it just for the likes.\nAnd each some people do and when you can’t recognise the difference between them then you don’t really have an actual clear perspective on your own opinion.\n\nI was saying how it’s a completely different matter that the guy essentially said that “ if an Sd doesn’t have much cash then that means he can still be an sd?” , he tried to link it to this post as if saying the way an SB carried herself and how much an Aspiring SD carries in his wallet is the same issue. I’m talking and SBs mental image of themselves. And what you and this guy are talking about are Whether a broke guy can be an SD or not.",
            "author": null,
            "id": "eg6v0id",
            "parent_id": "t1_eg6um4x",
            "score": 0,
            "created_utc": 1549844937.0,
            "replies": []
        },
        {
            "body": "Huh?",
            "author": "girlz_are_42",
            "id": "eg5tyka",
            "parent_id": "t1_eg5shgi",
            "score": 1,
            "created_utc": 1549815776.0,
            "replies": [
                {
                    "body": "I was being snarky, here’s what you typed... “Beaty is in the eye of the beholder” 😜",
                    "author": "ruphun",
                    "id": "eg5u6h5",
                    "parent_id": "t1_eg5tyka",
                    "score": 1,
                    "created_utc": 1549815944.0,
                    "replies": [
                        {
                            "body": "😂😂 sprellojg hard",
                            "author": "girlz_are_42",
                            "id": "eg61e84",
                            "parent_id": "t1_eg5u6h5",
                            "score": 1,
                            "created_utc": 1549821563.0,
                            "replies": [
                                {
                                    "body": "I is a colledge stoodent 😜😈",
                                    "author": "ruphun",
                                    "id": "eg622kx",
                                    "parent_id": "t1_eg61e84",
                                    "score": 1,
                                    "created_utc": 1549822081.0,
                                    "replies": [
                                        {
                                            "body": "I am a drop out. They suck at teaching entrepreneurs ",
                                            "author": "girlz_are_42",
                                            "id": "eg62oqv",
                                            "parent_id": "t1_eg622kx",
                                            "score": 0,
                                            "created_utc": 1549822563.0,
                                            "replies": [
                                                {
                                                    "body": "That sounds like my story too 😂👍🏻",
                                                    "author": "ruphun",
                                                    "id": "eg62quh",
                                                    "parent_id": "t1_eg62oqv",
                                                    "score": 1,
                                                    "created_utc": 1549822608.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly. And what separates a great SB from an average SB is a woman that realizes that being a SB is not about her getting spoiled because she’s a princess.. It’s about what she brings to the SR, and how she makes her SD life better, to give him a reason to want to spoil her and spend his money on her, over the 1000 other options he has.",
            "author": "ruphun",
            "id": "eg5uy63",
            "parent_id": "t1_eg5uh1h",
            "score": 0,
            "created_utc": 1549816537.0,
            "replies": []
        },
        {
            "body": "Oh. Well I definitely think attraction is important - but it didn’t seem like this post said differently. I read it more like: \n\n“Fake it till ya make it, you don’t have to be a solid 10 to be attractive. In fact, some girls who society would say are a 7, are another guy’s version of a 10”",
            "author": "thesluttypet",
            "id": "eg5wozi",
            "parent_id": "t1_eg5wc6j",
            "score": 2,
            "created_utc": 1549817917.0,
            "replies": [
                {
                    "body": "👌🏼👍🏻 I agree with the OP. “Beauty is always in the eye of the beholder”... After that, honesty is the most important quality, at least for/to me.",
                    "author": "AKA_Mr_X",
                    "id": "eg61u74",
                    "parent_id": "t1_eg5wozi",
                    "score": 2,
                    "created_utc": 1549821904.0,
                    "replies": [
                        {
                            "body": "Yeahhh! That’s a lot more how I see it, too. \n\nFor me, I really need to find someone with a matching sense of humor. I make jokes real often, but they are often sorta subtle or referencing a previous conversation that they have since forgotten, to the point where if the person misses the joke. I just feel awkward or sound creepy :p haha",
                            "author": "thesluttypet",
                            "id": "eg68tzj",
                            "parent_id": "t1_eg61u74",
                            "score": 1,
                            "created_utc": 1549827423.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awe! I really enjoyed reading this! You seem like a really cool fella!\nGood to know you’re open minded on the subject as some guys out there can be real scummy about how a girl looks, making her feel like she’s nothing without her looks which honestly shouldn’t happen! No matter what it is we are doing, we should always take in consideration that people are still people with fragile mental healths :) x\n\nHaha I envy you! I let haters get to me too much. But more in a “You wanna fight, punk?!” Kinda way haha.",
            "author": null,
            "id": "eg6d8ss",
            "parent_id": "t1_eg5xvqf",
            "score": 1,
            "created_utc": 1549830910.0,
            "replies": [
                {
                    "body": "Lol wait, I’m a baby.  Sorry for not clarifying!  😂",
                    "author": "lifeoftwopi",
                    "id": "eg6dkx0",
                    "parent_id": "t1_eg6d8ss",
                    "score": 1,
                    "created_utc": 1549831172.0,
                    "replies": [
                        {
                            "body": "Haha I’ll protect you! I’ll bring boxing gloves 🥊 🤣",
                            "author": null,
                            "id": "eg6eajh",
                            "parent_id": "t1_eg6dkx0",
                            "score": 1,
                            "created_utc": 1549831720.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha it took me a moment to actually understand this. Love the try hard passive aggressive attitude. Yknow it would be a lot less effort to just type “Lol”.",
            "author": null,
            "id": "eg9a32f",
            "parent_id": "t1_eg99wzl",
            "score": 3,
            "created_utc": 1549920930.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "egbdrug",
                    "parent_id": "t1_eg9a32f",
                    "score": 1,
                    "created_utc": 1549990276.0,
                    "replies": [
                        {
                            "body": "You too xD but seriously man ? Haha you come across super passive aggressive! If you really aren’t then I suggest you work on that for futuristic purposes.",
                            "author": null,
                            "id": "egdb5m5",
                            "parent_id": "t1_egbdrug",
                            "score": 1,
                            "created_utc": 1550044454.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "❤️ thank you happy bear. ",
            "author": "w-r",
            "id": "eg8e484",
            "parent_id": "t1_eg8d5vb",
            "score": 1,
            "created_utc": 1549902674.0,
            "replies": []
        },
        {
            "body": "Yeah. If nothing else, it will decrease negative thinking which will increase quality of life :)\n\nPersonally, I used to think I was super fat and ugly. I’d obsess over it. Trying not to let anyone see me from the side (I hated my face profile) or never wearing shorts/skirts for years because I thought my legs were bad..\n\nNow that I’ve gained confidence, I can look back and see that while Im certainly not perfect, I’ve never actually been fat nor ugly :p",
            "author": "thesluttypet",
            "id": "eg5w94y",
            "parent_id": "t1_eg5vfwf",
            "score": 1,
            "created_utc": 1549817569.0,
            "replies": [
                {
                    "body": "Good on you!\nTbh I only just hit the fuck it button in December and I gotta tell ya, I feel like I’ve lost the weight that made me feel fat. My weight being the worries.",
                    "author": null,
                    "id": "eg6cyr1",
                    "parent_id": "t1_eg5w94y",
                    "score": 1,
                    "created_utc": 1549830688.0,
                    "replies": []
                },
                {
                    "body": "If you understand the metaphor x",
                    "author": null,
                    "id": "eg6czma",
                    "parent_id": "t1_eg5w94y",
                    "score": 1,
                    "created_utc": 1549830707.0,
                    "replies": [
                        {
                            "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
                            "author": "thesluttypet",
                            "id": "eg6ey6v",
                            "parent_id": "t1_eg6czma",
                            "score": 0,
                            "created_utc": 1549832229.0,
                            "replies": [
                                {
                                    "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                                    "author": null,
                                    "id": "eg6fae6",
                                    "parent_id": "t1_eg6ey6v",
                                    "score": 1,
                                    "created_utc": 1549832482.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                                            "author": "thesluttypet",
                                            "id": "eg6gmre",
                                            "parent_id": "t1_eg6fae6",
                                            "score": 0,
                                            "created_utc": 1549833510.0,
                                            "replies": [
                                                {
                                                    "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                                    "author": null,
                                                    "id": "eg6gs2s",
                                                    "parent_id": "t1_eg6gmre",
                                                    "score": 1,
                                                    "created_utc": 1549833629.0,
                                                    "replies": [
                                                        {
                                                            "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                                            "author": "thesluttypet",
                                                            "id": "eg6guso",
                                                            "parent_id": "t1_eg6gs2s",
                                                            "score": 1,
                                                            "created_utc": 1549833688.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                                    "author": null,
                                                                    "id": "eg6h557",
                                                                    "parent_id": "t1_eg6guso",
                                                                    "score": 1,
                                                                    "created_utc": 1549833911.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg7wd86",
            "parent_id": "t1_eg6rxir",
            "score": 2,
            "created_utc": 1549887588.0,
            "replies": [
                {
                    "body": "A. Thank you for the compliment.\nB. Not every guy thinks I’m attractive. Just because one guy says you’re hot doesn’t mean you are. It’s all about attitude and how you carry yourself. Confidence and prowess :) if I was depressed all the time and had no confidence in myself it wouldn’t be very attractive unless you meet a daddy that likes being the “protector” role. Which there, then again is still a match!\nIt’s all about perspective.\n\nI don’t shit on your beliefs so please don’t shit on other people’s beliefs :) if you want to believe in black and white views then that’s perfect okay.",
                    "author": null,
                    "id": "eg8rp9g",
                    "parent_id": "t1_eg7wd86",
                    "score": 3,
                    "created_utc": 1549910617.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right, I also am mainly focusing on finding a sugarbaby that I have a personality I can connect with and is attentive. But that's because a girl I'm not attracted to doesn't even get a message. Does she have to he a 10? Even in dating where looks play a smaller role for me, if I don't find a girl attractive then I'm not going to date her. That doesn't mean it's the primary thing I look at though. \n\nCould you elaborate on what you mean by having personal experience to back it up? Are you trying to say you've had a sugar daddy that did not find you attractive?",
            "author": "sexviewer",
            "id": "eg6zfse",
            "parent_id": "t1_eg6rxir",
            "score": 1,
            "created_utc": 1549848757.0,
            "replies": [
                {
                    "body": "I have actually. I’ve had some sugar daddy’s tell me I’m ugly as shit but I’ve also had some that have called me hot! \nOnes junk is another mans treasure. If you find one girl unattractive another guy might find her attractive. It’s completely based off of perspective honestly :) \n\nAnd it’s perfectly fine that you care about looks. Honestly a lot of guys reading this are mistaking what im saying to be “guys who look for hot girls are assholes” and I promise that’s not what I’m saying at all! I’m saying that every SD is different just as every SB is different. :) And that I think attitude is the most important thing.\n\nA bad attitude hot girl who doesn’t make dates won’t get far for being a waste of time.\n\nA bad attitude rich man who makes girls feel like crap also won’t get far.\nHe might if there’s girls who try to endure it because she really needs the cash but they’d never actually have a connection.",
                    "author": null,
                    "id": "eg70bdg",
                    "parent_id": "t1_eg6zfse",
                    "score": 1,
                    "created_utc": 1549849493.0,
                    "replies": [
                        {
                            "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
                            "author": "sexviewer",
                            "id": "eg716wu",
                            "parent_id": "t1_eg70bdg",
                            "score": 3,
                            "created_utc": 1549850218.0,
                            "replies": [
                                {
                                    "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                                    "author": null,
                                    "id": "eg71dbb",
                                    "parent_id": "t1_eg716wu",
                                    "score": 2,
                                    "created_utc": 1549850365.0,
                                    "replies": [
                                        {
                                            "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                                            "author": "sexviewer",
                                            "id": "eg75pdr",
                                            "parent_id": "t1_eg71dbb",
                                            "score": 3,
                                            "created_utc": 1549853985.0,
                                            "replies": [
                                                {
                                                    "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                                    "author": null,
                                                    "id": "eg8r4vy",
                                                    "parent_id": "t1_eg75pdr",
                                                    "score": 3,
                                                    "created_utc": 1549910302.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hahaha loved this x and idk I don’t use Match.com and I haven’t ever seen another SBs profile before but I can assure that looking for the diamonds in the rocks are always worth it. But then again I think SDs pay for their memberships? Damn haha. The sugar bowl is quite the rumble isn’t it? 😂 I guess its simply gambling. Like a, ‘Play to win’ sorta thing. Play and you get a  shiny new Sb ~ \n",
            "author": null,
            "id": "eg6e00t",
            "parent_id": "t1_eg6brpy",
            "score": 1,
            "created_utc": 1549831494.0,
            "replies": []
        },
        {
            "body": "I've never been on match but I assume it is primarily peer group dating on speed. ",
            "author": "pinotandsugar",
            "id": "eg6ggom",
            "parent_id": "t1_eg6brpy",
            "score": 1,
            "created_utc": 1549833381.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eg6kb5l",
                    "parent_id": "t1_eg6ggom",
                    "score": 1,
                    "created_utc": 1549836296.0,
                    "replies": [
                        {
                            "body": "attitude , energy ,not looking for long term / permanent relationship",
                            "author": "pinotandsugar",
                            "id": "eg6zmst",
                            "parent_id": "t1_eg6kb5l",
                            "score": 0,
                            "created_utc": 1549848925.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh okay :) I understand now! I was so confused haha!",
            "author": null,
            "id": "eg6sbcm",
            "parent_id": "t1_eg6s8hx",
            "score": 2,
            "created_utc": 1549842618.0,
            "replies": [
                {
                    "body": "Hehe no worries. I accidentally forget everyone doesn’t know what I’m thinking about / responding to :p",
                    "author": "thesluttypet",
                    "id": "eg6sfk5",
                    "parent_id": "t1_eg6sbcm",
                    "score": 2,
                    "created_utc": 1549842715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well I wish we had a just tad more of the can do 😂😂😂\n\nCantrip from DND? Now you are talking my language 😂😂",
            "author": "girlz_are_42",
            "id": "eg6dznf",
            "parent_id": "t1_eg6dia2",
            "score": 0,
            "created_utc": 1549831487.0,
            "replies": [
                {
                    "body": "Honestly, I had an idea once of s dating website where you would be manually paired with someone by professional love psychiatrists. Scientific but.. A lot more effective since our own brains often suck at finding our perfect partners.\n\nHaha yeah I was referencing “Vicious Mochery” . It saved me once when I was attacked by 3 orcs.😬",
                    "author": null,
                    "id": "eg6eht2",
                    "parent_id": "t1_eg6dznf",
                    "score": -1,
                    "created_utc": 1549831880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6pzzu",
            "parent_id": "t1_eg6plhf",
            "score": -1,
            "created_utc": 1549840709.0,
            "replies": [
                {
                    "body": "Unclear what point you’re trying to make with your non-sequitur. But you indirectly supported mine: you were triggered by my comment and replied with emotion, not logic.",
                    "author": "throwawaySD654",
                    "id": "eg6qcmd",
                    "parent_id": "t1_eg6pzzu",
                    "score": 3,
                    "created_utc": 1549840997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was being snarky, here’s what you typed... “Beaty is in the eye of the beholder” 😜",
            "author": "ruphun",
            "id": "eg5u6h5",
            "parent_id": "t1_eg5tyka",
            "score": 1,
            "created_utc": 1549815944.0,
            "replies": [
                {
                    "body": "😂😂 sprellojg hard",
                    "author": "girlz_are_42",
                    "id": "eg61e84",
                    "parent_id": "t1_eg5u6h5",
                    "score": 1,
                    "created_utc": 1549821563.0,
                    "replies": [
                        {
                            "body": "I is a colledge stoodent 😜😈",
                            "author": "ruphun",
                            "id": "eg622kx",
                            "parent_id": "t1_eg61e84",
                            "score": 1,
                            "created_utc": 1549822081.0,
                            "replies": [
                                {
                                    "body": "I am a drop out. They suck at teaching entrepreneurs ",
                                    "author": "girlz_are_42",
                                    "id": "eg62oqv",
                                    "parent_id": "t1_eg622kx",
                                    "score": 0,
                                    "created_utc": 1549822563.0,
                                    "replies": [
                                        {
                                            "body": "That sounds like my story too 😂👍🏻",
                                            "author": "ruphun",
                                            "id": "eg62quh",
                                            "parent_id": "t1_eg62oqv",
                                            "score": 1,
                                            "created_utc": 1549822608.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "👌🏼👍🏻 I agree with the OP. “Beauty is always in the eye of the beholder”... After that, honesty is the most important quality, at least for/to me.",
            "author": "AKA_Mr_X",
            "id": "eg61u74",
            "parent_id": "t1_eg5wozi",
            "score": 2,
            "created_utc": 1549821904.0,
            "replies": [
                {
                    "body": "Yeahhh! That’s a lot more how I see it, too. \n\nFor me, I really need to find someone with a matching sense of humor. I make jokes real often, but they are often sorta subtle or referencing a previous conversation that they have since forgotten, to the point where if the person misses the joke. I just feel awkward or sound creepy :p haha",
                    "author": "thesluttypet",
                    "id": "eg68tzj",
                    "parent_id": "t1_eg61u74",
                    "score": 1,
                    "created_utc": 1549827423.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol wait, I’m a baby.  Sorry for not clarifying!  😂",
            "author": "lifeoftwopi",
            "id": "eg6dkx0",
            "parent_id": "t1_eg6d8ss",
            "score": 1,
            "created_utc": 1549831172.0,
            "replies": [
                {
                    "body": "Haha I’ll protect you! I’ll bring boxing gloves 🥊 🤣",
                    "author": null,
                    "id": "eg6eajh",
                    "parent_id": "t1_eg6dkx0",
                    "score": 1,
                    "created_utc": 1549831720.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "egbdrug",
            "parent_id": "t1_eg9a32f",
            "score": 1,
            "created_utc": 1549990276.0,
            "replies": [
                {
                    "body": "You too xD but seriously man ? Haha you come across super passive aggressive! If you really aren’t then I suggest you work on that for futuristic purposes.",
                    "author": null,
                    "id": "egdb5m5",
                    "parent_id": "t1_egbdrug",
                    "score": 1,
                    "created_utc": 1550044454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good on you!\nTbh I only just hit the fuck it button in December and I gotta tell ya, I feel like I’ve lost the weight that made me feel fat. My weight being the worries.",
            "author": null,
            "id": "eg6cyr1",
            "parent_id": "t1_eg5w94y",
            "score": 1,
            "created_utc": 1549830688.0,
            "replies": []
        },
        {
            "body": "If you understand the metaphor x",
            "author": null,
            "id": "eg6czma",
            "parent_id": "t1_eg5w94y",
            "score": 1,
            "created_utc": 1549830707.0,
            "replies": [
                {
                    "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
                    "author": "thesluttypet",
                    "id": "eg6ey6v",
                    "parent_id": "t1_eg6czma",
                    "score": 0,
                    "created_utc": 1549832229.0,
                    "replies": [
                        {
                            "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                            "author": null,
                            "id": "eg6fae6",
                            "parent_id": "t1_eg6ey6v",
                            "score": 1,
                            "created_utc": 1549832482.0,
                            "replies": [
                                {
                                    "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                                    "author": "thesluttypet",
                                    "id": "eg6gmre",
                                    "parent_id": "t1_eg6fae6",
                                    "score": 0,
                                    "created_utc": 1549833510.0,
                                    "replies": [
                                        {
                                            "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                            "author": null,
                                            "id": "eg6gs2s",
                                            "parent_id": "t1_eg6gmre",
                                            "score": 1,
                                            "created_utc": 1549833629.0,
                                            "replies": [
                                                {
                                                    "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                                    "author": "thesluttypet",
                                                    "id": "eg6guso",
                                                    "parent_id": "t1_eg6gs2s",
                                                    "score": 1,
                                                    "created_utc": 1549833688.0,
                                                    "replies": [
                                                        {
                                                            "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                            "author": null,
                                                            "id": "eg6h557",
                                                            "parent_id": "t1_eg6guso",
                                                            "score": 1,
                                                            "created_utc": 1549833911.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A. Thank you for the compliment.\nB. Not every guy thinks I’m attractive. Just because one guy says you’re hot doesn’t mean you are. It’s all about attitude and how you carry yourself. Confidence and prowess :) if I was depressed all the time and had no confidence in myself it wouldn’t be very attractive unless you meet a daddy that likes being the “protector” role. Which there, then again is still a match!\nIt’s all about perspective.\n\nI don’t shit on your beliefs so please don’t shit on other people’s beliefs :) if you want to believe in black and white views then that’s perfect okay.",
            "author": null,
            "id": "eg8rp9g",
            "parent_id": "t1_eg7wd86",
            "score": 3,
            "created_utc": 1549910617.0,
            "replies": []
        },
        {
            "body": "I have actually. I’ve had some sugar daddy’s tell me I’m ugly as shit but I’ve also had some that have called me hot! \nOnes junk is another mans treasure. If you find one girl unattractive another guy might find her attractive. It’s completely based off of perspective honestly :) \n\nAnd it’s perfectly fine that you care about looks. Honestly a lot of guys reading this are mistaking what im saying to be “guys who look for hot girls are assholes” and I promise that’s not what I’m saying at all! I’m saying that every SD is different just as every SB is different. :) And that I think attitude is the most important thing.\n\nA bad attitude hot girl who doesn’t make dates won’t get far for being a waste of time.\n\nA bad attitude rich man who makes girls feel like crap also won’t get far.\nHe might if there’s girls who try to endure it because she really needs the cash but they’d never actually have a connection.",
            "author": null,
            "id": "eg70bdg",
            "parent_id": "t1_eg6zfse",
            "score": 1,
            "created_utc": 1549849493.0,
            "replies": [
                {
                    "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
                    "author": "sexviewer",
                    "id": "eg716wu",
                    "parent_id": "t1_eg70bdg",
                    "score": 3,
                    "created_utc": 1549850218.0,
                    "replies": [
                        {
                            "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                            "author": null,
                            "id": "eg71dbb",
                            "parent_id": "t1_eg716wu",
                            "score": 2,
                            "created_utc": 1549850365.0,
                            "replies": [
                                {
                                    "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                                    "author": "sexviewer",
                                    "id": "eg75pdr",
                                    "parent_id": "t1_eg71dbb",
                                    "score": 3,
                                    "created_utc": 1549853985.0,
                                    "replies": [
                                        {
                                            "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                            "author": null,
                                            "id": "eg8r4vy",
                                            "parent_id": "t1_eg75pdr",
                                            "score": 3,
                                            "created_utc": 1549910302.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eg6kb5l",
            "parent_id": "t1_eg6ggom",
            "score": 1,
            "created_utc": 1549836296.0,
            "replies": [
                {
                    "body": "attitude , energy ,not looking for long term / permanent relationship",
                    "author": "pinotandsugar",
                    "id": "eg6zmst",
                    "parent_id": "t1_eg6kb5l",
                    "score": 0,
                    "created_utc": 1549848925.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hehe no worries. I accidentally forget everyone doesn’t know what I’m thinking about / responding to :p",
            "author": "thesluttypet",
            "id": "eg6sfk5",
            "parent_id": "t1_eg6sbcm",
            "score": 2,
            "created_utc": 1549842715.0,
            "replies": []
        },
        {
            "body": "Honestly, I had an idea once of s dating website where you would be manually paired with someone by professional love psychiatrists. Scientific but.. A lot more effective since our own brains often suck at finding our perfect partners.\n\nHaha yeah I was referencing “Vicious Mochery” . It saved me once when I was attacked by 3 orcs.😬",
            "author": null,
            "id": "eg6eht2",
            "parent_id": "t1_eg6dznf",
            "score": -1,
            "created_utc": 1549831880.0,
            "replies": []
        },
        {
            "body": "Unclear what point you’re trying to make with your non-sequitur. But you indirectly supported mine: you were triggered by my comment and replied with emotion, not logic.",
            "author": "throwawaySD654",
            "id": "eg6qcmd",
            "parent_id": "t1_eg6pzzu",
            "score": 3,
            "created_utc": 1549840997.0,
            "replies": []
        },
        {
            "body": "😂😂 sprellojg hard",
            "author": "girlz_are_42",
            "id": "eg61e84",
            "parent_id": "t1_eg5u6h5",
            "score": 1,
            "created_utc": 1549821563.0,
            "replies": [
                {
                    "body": "I is a colledge stoodent 😜😈",
                    "author": "ruphun",
                    "id": "eg622kx",
                    "parent_id": "t1_eg61e84",
                    "score": 1,
                    "created_utc": 1549822081.0,
                    "replies": [
                        {
                            "body": "I am a drop out. They suck at teaching entrepreneurs ",
                            "author": "girlz_are_42",
                            "id": "eg62oqv",
                            "parent_id": "t1_eg622kx",
                            "score": 0,
                            "created_utc": 1549822563.0,
                            "replies": [
                                {
                                    "body": "That sounds like my story too 😂👍🏻",
                                    "author": "ruphun",
                                    "id": "eg62quh",
                                    "parent_id": "t1_eg62oqv",
                                    "score": 1,
                                    "created_utc": 1549822608.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeahhh! That’s a lot more how I see it, too. \n\nFor me, I really need to find someone with a matching sense of humor. I make jokes real often, but they are often sorta subtle or referencing a previous conversation that they have since forgotten, to the point where if the person misses the joke. I just feel awkward or sound creepy :p haha",
            "author": "thesluttypet",
            "id": "eg68tzj",
            "parent_id": "t1_eg61u74",
            "score": 1,
            "created_utc": 1549827423.0,
            "replies": []
        },
        {
            "body": "Haha I’ll protect you! I’ll bring boxing gloves 🥊 🤣",
            "author": null,
            "id": "eg6eajh",
            "parent_id": "t1_eg6dkx0",
            "score": 1,
            "created_utc": 1549831720.0,
            "replies": []
        },
        {
            "body": "You too xD but seriously man ? Haha you come across super passive aggressive! If you really aren’t then I suggest you work on that for futuristic purposes.",
            "author": null,
            "id": "egdb5m5",
            "parent_id": "t1_egbdrug",
            "score": 1,
            "created_utc": 1550044454.0,
            "replies": []
        },
        {
            "body": "Oh yes! \n\nIt’s seriously is huge relief and makes life less stressful. That sure feels a lot like carrying around less weight (literally and metaphorically)",
            "author": "thesluttypet",
            "id": "eg6ey6v",
            "parent_id": "t1_eg6czma",
            "score": 0,
            "created_utc": 1549832229.0,
            "replies": [
                {
                    "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
                    "author": null,
                    "id": "eg6fae6",
                    "parent_id": "t1_eg6ey6v",
                    "score": 1,
                    "created_utc": 1549832482.0,
                    "replies": [
                        {
                            "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                            "author": "thesluttypet",
                            "id": "eg6gmre",
                            "parent_id": "t1_eg6fae6",
                            "score": 0,
                            "created_utc": 1549833510.0,
                            "replies": [
                                {
                                    "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                                    "author": null,
                                    "id": "eg6gs2s",
                                    "parent_id": "t1_eg6gmre",
                                    "score": 1,
                                    "created_utc": 1549833629.0,
                                    "replies": [
                                        {
                                            "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                            "author": "thesluttypet",
                                            "id": "eg6guso",
                                            "parent_id": "t1_eg6gs2s",
                                            "score": 1,
                                            "created_utc": 1549833688.0,
                                            "replies": [
                                                {
                                                    "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                                    "author": null,
                                                    "id": "eg6h557",
                                                    "parent_id": "t1_eg6guso",
                                                    "score": 1,
                                                    "created_utc": 1549833911.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You've actually had a sugar daddy that you were seeing and who was paying you call you ugly? I'm not talking about random guy on the site that insult girls that reject them, or a guy you were seeing lash out when you tell them you're not comfortable with something or that you want to end it. Your sugar daddy actually said  (paraphrasing) \"you're ugly so shit, but your personality is so great that I want you to continue to be my sugaby\"?",
            "author": "sexviewer",
            "id": "eg716wu",
            "parent_id": "t1_eg70bdg",
            "score": 3,
            "created_utc": 1549850218.0,
            "replies": [
                {
                    "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
                    "author": null,
                    "id": "eg71dbb",
                    "parent_id": "t1_eg716wu",
                    "score": 2,
                    "created_utc": 1549850365.0,
                    "replies": [
                        {
                            "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                            "author": "sexviewer",
                            "id": "eg75pdr",
                            "parent_id": "t1_eg71dbb",
                            "score": 3,
                            "created_utc": 1549853985.0,
                            "replies": [
                                {
                                    "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                                    "author": null,
                                    "id": "eg8r4vy",
                                    "parent_id": "t1_eg75pdr",
                                    "score": 3,
                                    "created_utc": 1549910302.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "attitude , energy ,not looking for long term / permanent relationship",
            "author": "pinotandsugar",
            "id": "eg6zmst",
            "parent_id": "t1_eg6kb5l",
            "score": 0,
            "created_utc": 1549848925.0,
            "replies": []
        },
        {
            "body": "I is a colledge stoodent 😜😈",
            "author": "ruphun",
            "id": "eg622kx",
            "parent_id": "t1_eg61e84",
            "score": 1,
            "created_utc": 1549822081.0,
            "replies": [
                {
                    "body": "I am a drop out. They suck at teaching entrepreneurs ",
                    "author": "girlz_are_42",
                    "id": "eg62oqv",
                    "parent_id": "t1_eg622kx",
                    "score": 0,
                    "created_utc": 1549822563.0,
                    "replies": [
                        {
                            "body": "That sounds like my story too 😂👍🏻",
                            "author": "ruphun",
                            "id": "eg62quh",
                            "parent_id": "t1_eg62oqv",
                            "score": 1,
                            "created_utc": 1549822608.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do my best to pass this on to any other girl that deals with mental issues x  it was nice meeting you you’re really cool :)",
            "author": null,
            "id": "eg6fae6",
            "parent_id": "t1_eg6ey6v",
            "score": 1,
            "created_utc": 1549832482.0,
            "replies": [
                {
                    "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
                    "author": "thesluttypet",
                    "id": "eg6gmre",
                    "parent_id": "t1_eg6fae6",
                    "score": 0,
                    "created_utc": 1549833510.0,
                    "replies": [
                        {
                            "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                            "author": null,
                            "id": "eg6gs2s",
                            "parent_id": "t1_eg6gmre",
                            "score": 1,
                            "created_utc": 1549833629.0,
                            "replies": [
                                {
                                    "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                                    "author": "thesluttypet",
                                    "id": "eg6guso",
                                    "parent_id": "t1_eg6gs2s",
                                    "score": 1,
                                    "created_utc": 1549833688.0,
                                    "replies": [
                                        {
                                            "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                            "author": null,
                                            "id": "eg6h557",
                                            "parent_id": "t1_eg6guso",
                                            "score": 1,
                                            "created_utc": 1549833911.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my gosh no that hasn’t happened to me. Any Sd that calls me ugly isn’t really a turn on for me.\nBut actually there is someone in the comments here who commented about their SB who isn’t particularly attractive but are intelligent and good at handjobs so they’re happy with it.",
            "author": null,
            "id": "eg71dbb",
            "parent_id": "t1_eg716wu",
            "score": 2,
            "created_utc": 1549850365.0,
            "replies": [
                {
                    "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
                    "author": "sexviewer",
                    "id": "eg75pdr",
                    "parent_id": "t1_eg71dbb",
                    "score": 3,
                    "created_utc": 1549853985.0,
                    "replies": [
                        {
                            "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                            "author": null,
                            "id": "eg8r4vy",
                            "parent_id": "t1_eg75pdr",
                            "score": 3,
                            "created_utc": 1549910302.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am a drop out. They suck at teaching entrepreneurs ",
            "author": "girlz_are_42",
            "id": "eg62oqv",
            "parent_id": "t1_eg622kx",
            "score": 0,
            "created_utc": 1549822563.0,
            "replies": [
                {
                    "body": "That sounds like my story too 😂👍🏻",
                    "author": "ruphun",
                    "id": "eg62quh",
                    "parent_id": "t1_eg62oqv",
                    "score": 1,
                    "created_utc": 1549822608.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks, you too!\n\nAnd that’s a great idea, this is the kinda shit they should teach in school!",
            "author": "thesluttypet",
            "id": "eg6gmre",
            "parent_id": "t1_eg6fae6",
            "score": 0,
            "created_utc": 1549833510.0,
            "replies": [
                {
                    "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
                    "author": null,
                    "id": "eg6gs2s",
                    "parent_id": "t1_eg6gmre",
                    "score": 1,
                    "created_utc": 1549833629.0,
                    "replies": [
                        {
                            "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                            "author": "thesluttypet",
                            "id": "eg6guso",
                            "parent_id": "t1_eg6gs2s",
                            "score": 1,
                            "created_utc": 1549833688.0,
                            "replies": [
                                {
                                    "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                                    "author": null,
                                    "id": "eg6h557",
                                    "parent_id": "t1_eg6guso",
                                    "score": 1,
                                    "created_utc": 1549833911.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok, then why did you say yes when I asked if you've had a SD that did not find you attractive? ",
            "author": "sexviewer",
            "id": "eg75pdr",
            "parent_id": "t1_eg71dbb",
            "score": 3,
            "created_utc": 1549853985.0,
            "replies": [
                {
                    "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
                    "author": null,
                    "id": "eg8r4vy",
                    "parent_id": "t1_eg75pdr",
                    "score": 3,
                    "created_utc": 1549910302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That sounds like my story too 😂👍🏻",
            "author": "ruphun",
            "id": "eg62quh",
            "parent_id": "t1_eg62oqv",
            "score": 1,
            "created_utc": 1549822608.0,
            "replies": []
        },
        {
            "body": "Litterally. It should actually be a class “Mental health Class” where they teach you about states of mind and how to get happier with yourself.",
            "author": null,
            "id": "eg6gs2s",
            "parent_id": "t1_eg6gmre",
            "score": 1,
            "created_utc": 1549833629.0,
            "replies": [
                {
                    "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
                    "author": "thesluttypet",
                    "id": "eg6guso",
                    "parent_id": "t1_eg6gs2s",
                    "score": 1,
                    "created_utc": 1549833688.0,
                    "replies": [
                        {
                            "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                            "author": null,
                            "id": "eg6h557",
                            "parent_id": "t1_eg6guso",
                            "score": 1,
                            "created_utc": 1549833911.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because I have had an Sd that’s called me unattractive? Doesn’t mean they were my SD.",
            "author": null,
            "id": "eg8r4vy",
            "parent_id": "t1_eg75pdr",
            "score": 3,
            "created_utc": 1549910302.0,
            "replies": []
        },
        {
            "body": "Right? I’d take that class now, if it were offered. And I’m almost 30 haha ",
            "author": "thesluttypet",
            "id": "eg6guso",
            "parent_id": "t1_eg6gs2s",
            "score": 1,
            "created_utc": 1549833688.0,
            "replies": [
                {
                    "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
                    "author": null,
                    "id": "eg6h557",
                    "parent_id": "t1_eg6guso",
                    "score": 1,
                    "created_utc": 1549833911.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same honestly. I’m sure there’s some around for our generation ... that’s free 😂😂",
            "author": null,
            "id": "eg6h557",
            "parent_id": "t1_eg6guso",
            "score": 1,
            "created_utc": 1549833911.0,
            "replies": []
        }
    ]
}