{
    "title": "When thank you isn’t enough..",
    "post_id": "hw99o4",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hw99o4/when_thank_you_isnt_enough/",
    "author": null,
    "body": "Tonight I was sitting across the room from my guy, staring at him while he ordered us dinner on his phone and it hit me that “thank you” will never, ever come close to being enough to express how thankful I am for him. \n\nAfter working all day, he drove 40 mins. to where my classroom is and spent the next 3 hours hanging posters, taping labels on bins, and sitting in an elementary school kid chair eating take out food with me.  He expected nothing in return. \n\nWhen I joined Seeking I never imagined I’d find the best man I’ve ever met. My biggest supporter, my best friend, my greatest love.. and sometimes it makes me a little sad knowing that I will never be able to express the amount of love and gratitude I feel for him. No amount of words or actions could express all the feels. \n\nTo my guy - Thank you for being you. Your love and support make me a better person. 😘",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hw99o4/when_thank_you_isnt_enough/",
    "score": 200,
    "upvote_ratio": 0.98,
    "created_utc": 1595478603.0,
    "num_comments": 43,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Awwww. That's all I have to say really.\n\nI had not sat on an elementary school chair for nearly 50 years so this is definitely not me 😝",
            "author": "eurosd",
            "id": "fyy9ige",
            "parent_id": "t3_hw99o4",
            "score": 31,
            "created_utc": 1595480746.0,
            "replies": [
                {
                    "body": "If I sat in an elementary school chair now - I would need help getting out of it!",
                    "author": "Bflat2012",
                    "id": "fyyg3ax",
                    "parent_id": "t1_fyy9ige",
                    "score": 17,
                    "created_utc": 1595486287.0,
                    "replies": [
                        {
                            "body": "HAHA! I feel you. I’m so use to it I don’t notice how strange it is until someone not use to them sits down.",
                            "author": null,
                            "id": "fyz1zjl",
                            "parent_id": "t1_fyyg3ax",
                            "score": 7,
                            "created_utc": 1595507078.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "LOL. You’re on the wrong side of the pond also. \n\nMy guy is a newish member here in SLF world. Maybe he’ll stumble upon this post at some point.",
                    "author": null,
                    "id": "fyz1wr4",
                    "parent_id": "t1_fyy9ige",
                    "score": 6,
                    "created_utc": 1595507016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyyb5ex",
            "parent_id": "t3_hw99o4",
            "score": 17,
            "created_utc": 1595482049.0,
            "replies": [
                {
                    "body": "Absolutely the best.",
                    "author": null,
                    "id": "fyz20ho",
                    "parent_id": "t1_fyyb5ex",
                    "score": 3,
                    "created_utc": 1595507099.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyz7g8r",
                            "parent_id": "t1_fyz20ho",
                            "score": 3,
                            "created_utc": 1595510776.0,
                            "replies": [
                                {
                                    "body": "We definitely have so much love between us. We are 2.5 years in and I don’t see an end to our relationship any time soon. We’ve had talks of being exclusive & not needing/looking for anyone else.",
                                    "author": null,
                                    "id": "fyz9cfi",
                                    "parent_id": "t1_fyz7g8r",
                                    "score": 3,
                                    "created_utc": 1595511912.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fyza2o8",
                                            "parent_id": "t1_fyz9cfi",
                                            "score": 3,
                                            "created_utc": 1595512335.0,
                                            "replies": [
                                                {
                                                    "body": "The same one, the only one. \nNo, he won’t ever leave. & I’m ok with that. I’d never in a million years ask him to.  It doesn’t hurt. We’re very honest about what we have and what we are.",
                                                    "author": null,
                                                    "id": "fyzbn5i",
                                                    "parent_id": "t1_fyza2o8",
                                                    "score": 3,
                                                    "created_utc": 1595513226.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Complete best",
                            "author": null,
                            "id": "fyz2gjq",
                            "parent_id": "t1_fyz20ho",
                            "score": 2,
                            "created_utc": 1595507451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a fellow teacher, I feel this! After one of my first m&gs, a SD/SB couple took me to Office Depot and bought me a cart full of school supplies, and it was honestly one of the most touching things.",
            "author": "brown_bi_babe",
            "id": "fyyb8w5",
            "parent_id": "t3_hw99o4",
            "score": 16,
            "created_utc": 1595482128.0,
            "replies": [
                {
                    "body": "Oh that is so awesome. Did you cry? I probably would have cried. It’s things like that the mean the most to me. \n\nA few meets ago I was venting about not being able to find specific bins I was looking for around my area and he said send me a photo of you what need. He went to stores in his area & found them and got tons of them for me. And then when I get random Venmo notifications from him that say “School is cool” or “Be cool, stay in school” it makes me a little teary eyed. \n\nBest of luck to you this upcoming school year. I’m a little nervous but going to make the best of it.",
                    "author": null,
                    "id": "fyz2bml",
                    "parent_id": "t1_fyyb8w5",
                    "score": 16,
                    "created_utc": 1595507344.0,
                    "replies": [
                        {
                            "body": "I basically never cry (it's probably a first gen / culture thing) but I do get really flustered when people do nice things, so I got all red and forgot how to structure sentences instead.\n\nThat is so sweet! All of it. That sounds amazing.\n\nGood luck to you too! I'm stocking up on KN-95s, but my kids are older so they might actually social distance. I don't even know how K-5 teachers are going to manage, but bless y'all.",
                            "author": "brown_bi_babe",
                            "id": "fz1k4iy",
                            "parent_id": "t1_fyz2bml",
                            "score": 3,
                            "created_utc": 1595553008.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Doing anything for someone whom you care deeply gives immense happiness to the person doing it. I’m sure your SBF must have been thrilled to have helped you get ready for your back to school night. \n\nI’m sure he feels all the respect and love from you even if words cannot express it. \n\nAmazing story and sentiments, thanks for sharing and hope you get to create many more such wonderful memories",
            "author": "supportiveceo",
            "id": "fyybm2b",
            "parent_id": "t3_hw99o4",
            "score": 9,
            "created_utc": 1595482424.0,
            "replies": [
                {
                    "body": "We’ve had 2.5 years of wonderful memories & I swear each one keeps getting better and better. He kept saying how much fun he had, so I do think he enjoyed the time together also. \n\nYou’re post helped me realize I recently told him my top love languages are 1) quality time and 2) acts of service and last night was the most perfect example of both of those combined.",
                    "author": null,
                    "id": "fyz2ij6",
                    "parent_id": "t1_fyybm2b",
                    "score": 5,
                    "created_utc": 1595507492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's awesome and I'm a little envious you guys do stuff like that. \n\nI'd love to do things with my SBs, however, I don't feel comfortable in public since I'm married and need to be discreet.  This gives me a great idea that maybe we could volunteer to do community work together.",
            "author": "EMPOWER_not_enable",
            "id": "fyyht6n",
            "parent_id": "t3_hw99o4",
            "score": 6,
            "created_utc": 1595487871.0,
            "replies": [
                {
                    "body": "My SD and I tackle this obstacle by traveling to a city 30-90 minutes away from his hometown for public dates. Idk if that's possible for you. \n\nFor overnights we typically drive 1-2 hours out of town to avoid people he may know. Works wonderfully and allows us both to relax and enjoy the natural PDA, kissing and holding hands. I enjoy the road trip experience with my SD. It's part of our quality time for the trip.",
                    "author": "ElementShow",
                    "id": "fyzxj78",
                    "parent_id": "t1_fyyht6n",
                    "score": 5,
                    "created_utc": 1595524135.0,
                    "replies": [
                        {
                            "body": "Those are great ideas.  I'm sure the road trip experience is a fun one!",
                            "author": null,
                            "id": "fz01rtp",
                            "parent_id": "t1_fyzxj78",
                            "score": 2,
                            "created_utc": 1595526039.0,
                            "replies": [
                                {
                                    "body": "Agree those are great ideas!  Unfortunately , wiith COVID, it's almost impossible to be out of the house for more than 3 or 4 hours without raising suspicion.  Food for thought post-COVID though!  Thanks!",
                                    "author": "EMPOWER_not_enable",
                                    "id": "fz098ge",
                                    "parent_id": "t1_fz01rtp",
                                    "score": 3,
                                    "created_utc": 1595529442.0,
                                    "replies": [
                                        {
                                            "body": "Can you play hooky from work?\n\n SD will request a day off in advance so him and I can go somewhere for the \"work day\".... so like 9am-6pm. Bonus points if it's a work day you have to \"work late.\"",
                                            "author": "ElementShow",
                                            "id": "fz09zas",
                                            "parent_id": "t1_fz098ge",
                                            "score": 2,
                                            "created_utc": 1595529782.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I totally understand feeling envious. My guy is married too so occasionally I have little envious moments when I read certain posts on here of people being able to do more than we can. \n\nMy schools is in a town where he knows no one so it was pretty safe. However we’ve been venturing out a lot more lately than we did in the beginning. \n\nI love your idea of volunteering together! That sounds like so much fun.",
                    "author": null,
                    "id": "fyz1pec",
                    "parent_id": "t1_fyyht6n",
                    "score": 3,
                    "created_utc": 1595506859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What an uplifting post!  Thank-you.",
            "author": "MrBuzzard",
            "id": "fyyc84y",
            "parent_id": "t3_hw99o4",
            "score": 5,
            "created_utc": 1595482923.0,
            "replies": []
        },
        {
            "body": "This is so cute. So happy for you!!!",
            "author": "EntertainerStandard",
            "id": "fyyafjz",
            "parent_id": "t3_hw99o4",
            "score": 4,
            "created_utc": 1595481474.0,
            "replies": []
        },
        {
            "body": "Aww. Ditto with my SD. I won't ever be able to say thank you enough. He's literally changed my life's perspective and trajectory.  Enjoy your man!",
            "author": "ElementShow",
            "id": "fyzx2ad",
            "parent_id": "t3_hw99o4",
            "score": 3,
            "created_utc": 1595523923.0,
            "replies": []
        },
        {
            "body": "Well i hope you realize that he is actually just as lucky as you are --- really thank you for sharing 👍",
            "author": "shamloo77",
            "id": "fyynzee",
            "parent_id": "t3_hw99o4",
            "score": 2,
            "created_utc": 1595494157.0,
            "replies": [
                {
                    "body": "Aw, thank you.",
                    "author": null,
                    "id": "fyz2jlv",
                    "parent_id": "t1_fyynzee",
                    "score": 2,
                    "created_utc": 1595507514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have to say I’m jealous. Not of your man but the fact your school is in session. I’ll be homeschooling again . 😭😭😭 fuck Covid I can’t imagine being in love with a married guy. That’s why I stick with single men",
            "author": "Driftwould92",
            "id": "fyz5lgz",
            "parent_id": "t3_hw99o4",
            "score": 2,
            "created_utc": 1595509607.0,
            "replies": [
                {
                    "body": "I definitely agree on the feelings towards COVID. However, don’t be jealous. Our school board is sending us back to school as we normally would be. I live in a very high infection rate area but they want to send 800 students and 115 staff members back to school with very little guidelines on COVID changes. It’s nuts. We’ll all be sick at some point because of this. Grades 6-12 will only go to their school buildings 2 days a week (half the students 2 days and the other half the other 2 days) and learn virtually 3 days a week, but for some reason they think K-5 is all good to go back every single day. \n\nSorry, I didn’t mean to get up on my soapbox right then. I hope homeschooling goes well for you & that Covid leaves us soon so we can return to school safely and soon!!",
                    "author": null,
                    "id": "fyz64vy",
                    "parent_id": "t1_fyz5lgz",
                    "score": 2,
                    "created_utc": 1595509955.0,
                    "replies": [
                        {
                            "body": "Damn.  I’m actually not jealous anymore . You have a high chance of dying. Kids are super spreaders. Especially since it’s worse when you are constantly exposed like that .",
                            "author": "Driftwould92",
                            "id": "fyz6tmx",
                            "parent_id": "t1_fyz64vy",
                            "score": 2,
                            "created_utc": 1595510385.0,
                            "replies": []
                        },
                        {
                            "body": "To put it in perspective , our deaths due to covid in 7 months are more than twice our deaths in 10 plus years of war in Vietnam .",
                            "author": "pinotandsugar",
                            "id": "fz2misq",
                            "parent_id": "t1_fyz64vy",
                            "score": 1,
                            "created_utc": 1595580229.0,
                            "replies": [
                                {
                                    "body": "I've stopped making references to the Vietnam War.  Even my 35 yo daughter has no emotional attachment to it (sigh).",
                                    "author": "TY2022",
                                    "id": "fz6en9w",
                                    "parent_id": "t1_fz2misq",
                                    "score": 2,
                                    "created_utc": 1595662987.0,
                                    "replies": [
                                        {
                                            "body": "Probably the greatest evolution of music , political turmoil, and social change since the civil war.",
                                            "author": "pinotandsugar",
                                            "id": "fz72txj",
                                            "parent_id": "t1_fz6en9w",
                                            "score": 1,
                                            "created_utc": 1595685351.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Dont get too worried on the school thing.....kids are normally super spreader but europe has found with this one not so much.  Literally no transmission from k-12\n\nThat said you are more likely to get hit by lightning than some harmful or perm given you age.....there us always something freeky ....but dont let the fear mongering get you down ....the science is pretty clear at this point.\n\nThat said how refreshing to hear you SR some of us would die for someone to appreciate what we do especially the extras with nothing expected.\n\nMany people in the bowl and many not mature enough for meaningful relationships of any kind one either side.\n\nThank you for giving some of us hope that there are great people out there....just have to keep turning rocks.",
                            "author": "Momopllc",
                            "id": "fyzoj1e",
                            "parent_id": "t1_fyz64vy",
                            "score": 0,
                            "created_utc": 1595519908.0,
                            "replies": [
                                {
                                    "body": "Thankfully I am not fearful, just nervous about the what-ifs. I appreciate you sharing this information with me. \n\n\nYou’re welcome for the Sugar hope. I wish everyone could find the perfect sugar relationship for them. I know not everyone is looking for what I have, but it would be nice if everyone found what they were looking for. I hate hearing the bad/frustrating experiences some people go through to find a good SR.",
                                    "author": null,
                                    "id": "fyzuo4a",
                                    "parent_id": "t1_fyzoj1e",
                                    "score": 2,
                                    "created_utc": 1595522840.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awwwww this is so cute! I have the same thought so often haha sometimes our sugar daddies really are the best 😌",
            "author": "sugarbbellie",
            "id": "fyz8rjy",
            "parent_id": "t3_hw99o4",
            "score": 2,
            "created_utc": 1595511573.0,
            "replies": []
        },
        {
            "body": "This is absolutely precious!! Elementary teachers, FTW! Are y’all going back in person? \n\nMy SD always makes fun of me for sitting criss-cross... I don’t have chairs in my room (music), so it’s just how I sit! 🤷🏼‍♀️😂",
            "author": "ddcheri11",
            "id": "fyzh01b",
            "parent_id": "t3_hw99o4",
            "score": 2,
            "created_utc": 1595516121.0,
            "replies": [
                {
                    "body": "Yay for Elem. Teachers!! ❤️\n\nWe are going back in person. I’m worried because we live in a super high infection rate (like one of the “you can’t travel from your state to our state because we don’t want your virus here” states).  We were told a week ago we were doing hybrid (1/2 the kids were coming Monday & Thursday and the other half  Tuesday & Friday with everyone online Wednesday, but 2 nights ago the board decided all K-5 would go back to everyday in the building while 6-12 would stay in the hybrid mode. So I’m scared but going to try to make the best of it. How will your school year look as of now? \n\nI LOVE sitting cross cross. I don’t have chairs either, I’m all flexible seating! Those SDs don’t know what kind of fun they’re missing out on by not having flexible seating in their offices. Lol!",
                    "author": null,
                    "id": "fyzhtji",
                    "parent_id": "t1_fyzh01b",
                    "score": 2,
                    "created_utc": 1595516550.0,
                    "replies": [
                        {
                            "body": "We are starting online, then moving to in person on September 7. Also nervous because I’m in a city where the cases are still on the rise. Nearly 10k yesterday. Ugh. We have (some) protocols in place... teachers and staff are required to wear face coverings, students in PreK-4th aren’t required, but suggested, 5th-8th (we have a MS on our campus as well) are required all day. \n\nI MISS my babies, and I don’t have a better solution than what’s been put in place... but I just want them (and the teachers and staff!) to be safe. \n\nSDs will NEVER understand the joy of a scoop rocking chair or a bouncy ball chair!!! 😂👩🏼‍🏫🍎",
                            "author": "ddcheri11",
                            "id": "fyzisil",
                            "parent_id": "t1_fyzhtji",
                            "score": 1,
                            "created_utc": 1595517055.0,
                            "replies": [
                                {
                                    "body": "I miss the kids SO MUCH! I know I’m going to want to hug & squeeze every last one of them when I finally see them again! \n\nI hope you stay super healthy & get to have some sort of normal school year. I so hope this isn’t our new normal for education. \n\nI thought my guy’s were going to explode when I showed him my scoop chairs & my surf desks last night. 😂😂 They just don’t understand the joys.",
                                    "author": null,
                                    "id": "fyzv7cr",
                                    "parent_id": "t1_fyzisil",
                                    "score": 1,
                                    "created_utc": 1595523091.0,
                                    "replies": [
                                        {
                                            "body": "Oh, girl. I’m a music teacher, so I’ve known some of the “big kids” since they were in Pre-K. I didn’t get to give them a big hug at the end of the year, before they move on to the middle school. My heart just ached to tell them how much I’ll miss being their music teacher!!! \nI hope you and everyone on your campus stay safe too. This all feels like a bad sci-fi movie, ya know??\n\nGirl, nobody understands the joys of a scoop chair but us and the little darlins!!! Same with things like flair pens and the tropical color pop-up sticky notes!!! LOL 🤩💖",
                                            "author": "ddcheri11",
                                            "id": "fz260na",
                                            "parent_id": "t1_fyzv7cr",
                                            "score": 1,
                                            "created_utc": 1595566073.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I love seeing stories like this on here. It gives me hope that I'll find a relationship like this one day.",
            "author": "muffinandberries",
            "id": "fz0d80p",
            "parent_id": "t3_hw99o4",
            "score": 2,
            "created_utc": 1595531280.0,
            "replies": [
                {
                    "body": "Keep searching. There are some great ones out there. Good luck!",
                    "author": null,
                    "id": "fz0dusu",
                    "parent_id": "t1_fz0d80p",
                    "score": 3,
                    "created_utc": 1595531577.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "muffinandberries",
                            "id": "fz0gruf",
                            "parent_id": "t1_fz0dusu",
                            "score": 1,
                            "created_utc": 1595532939.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel the exact same about my SD.",
            "author": null,
            "id": "fz0w1jh",
            "parent_id": "t3_hw99o4",
            "score": 1,
            "created_utc": 1595540289.0,
            "replies": []
        },
        {
            "body": "Awww. That's so sweet. Glad it's such a great SR!",
            "author": "MyBeautifulLife4Me",
            "id": "fz1eemd",
            "parent_id": "t3_hw99o4",
            "score": 1,
            "created_utc": 1595549796.0,
            "replies": []
        },
        {
            "body": "If I sat in an elementary school chair now - I would need help getting out of it!",
            "author": "Bflat2012",
            "id": "fyyg3ax",
            "parent_id": "t1_fyy9ige",
            "score": 17,
            "created_utc": 1595486287.0,
            "replies": [
                {
                    "body": "HAHA! I feel you. I’m so use to it I don’t notice how strange it is until someone not use to them sits down.",
                    "author": null,
                    "id": "fyz1zjl",
                    "parent_id": "t1_fyyg3ax",
                    "score": 7,
                    "created_utc": 1595507078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL. You’re on the wrong side of the pond also. \n\nMy guy is a newish member here in SLF world. Maybe he’ll stumble upon this post at some point.",
            "author": null,
            "id": "fyz1wr4",
            "parent_id": "t1_fyy9ige",
            "score": 6,
            "created_utc": 1595507016.0,
            "replies": []
        },
        {
            "body": "Absolutely the best.",
            "author": null,
            "id": "fyz20ho",
            "parent_id": "t1_fyyb5ex",
            "score": 3,
            "created_utc": 1595507099.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyz7g8r",
                    "parent_id": "t1_fyz20ho",
                    "score": 3,
                    "created_utc": 1595510776.0,
                    "replies": [
                        {
                            "body": "We definitely have so much love between us. We are 2.5 years in and I don’t see an end to our relationship any time soon. We’ve had talks of being exclusive & not needing/looking for anyone else.",
                            "author": null,
                            "id": "fyz9cfi",
                            "parent_id": "t1_fyz7g8r",
                            "score": 3,
                            "created_utc": 1595511912.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyza2o8",
                                    "parent_id": "t1_fyz9cfi",
                                    "score": 3,
                                    "created_utc": 1595512335.0,
                                    "replies": [
                                        {
                                            "body": "The same one, the only one. \nNo, he won’t ever leave. & I’m ok with that. I’d never in a million years ask him to.  It doesn’t hurt. We’re very honest about what we have and what we are.",
                                            "author": null,
                                            "id": "fyzbn5i",
                                            "parent_id": "t1_fyza2o8",
                                            "score": 3,
                                            "created_utc": 1595513226.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Complete best",
                    "author": null,
                    "id": "fyz2gjq",
                    "parent_id": "t1_fyz20ho",
                    "score": 2,
                    "created_utc": 1595507451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh that is so awesome. Did you cry? I probably would have cried. It’s things like that the mean the most to me. \n\nA few meets ago I was venting about not being able to find specific bins I was looking for around my area and he said send me a photo of you what need. He went to stores in his area & found them and got tons of them for me. And then when I get random Venmo notifications from him that say “School is cool” or “Be cool, stay in school” it makes me a little teary eyed. \n\nBest of luck to you this upcoming school year. I’m a little nervous but going to make the best of it.",
            "author": null,
            "id": "fyz2bml",
            "parent_id": "t1_fyyb8w5",
            "score": 16,
            "created_utc": 1595507344.0,
            "replies": [
                {
                    "body": "I basically never cry (it's probably a first gen / culture thing) but I do get really flustered when people do nice things, so I got all red and forgot how to structure sentences instead.\n\nThat is so sweet! All of it. That sounds amazing.\n\nGood luck to you too! I'm stocking up on KN-95s, but my kids are older so they might actually social distance. I don't even know how K-5 teachers are going to manage, but bless y'all.",
                    "author": "brown_bi_babe",
                    "id": "fz1k4iy",
                    "parent_id": "t1_fyz2bml",
                    "score": 3,
                    "created_utc": 1595553008.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We’ve had 2.5 years of wonderful memories & I swear each one keeps getting better and better. He kept saying how much fun he had, so I do think he enjoyed the time together also. \n\nYou’re post helped me realize I recently told him my top love languages are 1) quality time and 2) acts of service and last night was the most perfect example of both of those combined.",
            "author": null,
            "id": "fyz2ij6",
            "parent_id": "t1_fyybm2b",
            "score": 5,
            "created_utc": 1595507492.0,
            "replies": []
        },
        {
            "body": "My SD and I tackle this obstacle by traveling to a city 30-90 minutes away from his hometown for public dates. Idk if that's possible for you. \n\nFor overnights we typically drive 1-2 hours out of town to avoid people he may know. Works wonderfully and allows us both to relax and enjoy the natural PDA, kissing and holding hands. I enjoy the road trip experience with my SD. It's part of our quality time for the trip.",
            "author": "ElementShow",
            "id": "fyzxj78",
            "parent_id": "t1_fyyht6n",
            "score": 5,
            "created_utc": 1595524135.0,
            "replies": [
                {
                    "body": "Those are great ideas.  I'm sure the road trip experience is a fun one!",
                    "author": null,
                    "id": "fz01rtp",
                    "parent_id": "t1_fyzxj78",
                    "score": 2,
                    "created_utc": 1595526039.0,
                    "replies": [
                        {
                            "body": "Agree those are great ideas!  Unfortunately , wiith COVID, it's almost impossible to be out of the house for more than 3 or 4 hours without raising suspicion.  Food for thought post-COVID though!  Thanks!",
                            "author": "EMPOWER_not_enable",
                            "id": "fz098ge",
                            "parent_id": "t1_fz01rtp",
                            "score": 3,
                            "created_utc": 1595529442.0,
                            "replies": [
                                {
                                    "body": "Can you play hooky from work?\n\n SD will request a day off in advance so him and I can go somewhere for the \"work day\".... so like 9am-6pm. Bonus points if it's a work day you have to \"work late.\"",
                                    "author": "ElementShow",
                                    "id": "fz09zas",
                                    "parent_id": "t1_fz098ge",
                                    "score": 2,
                                    "created_utc": 1595529782.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I totally understand feeling envious. My guy is married too so occasionally I have little envious moments when I read certain posts on here of people being able to do more than we can. \n\nMy schools is in a town where he knows no one so it was pretty safe. However we’ve been venturing out a lot more lately than we did in the beginning. \n\nI love your idea of volunteering together! That sounds like so much fun.",
            "author": null,
            "id": "fyz1pec",
            "parent_id": "t1_fyyht6n",
            "score": 3,
            "created_utc": 1595506859.0,
            "replies": []
        },
        {
            "body": "Aw, thank you.",
            "author": null,
            "id": "fyz2jlv",
            "parent_id": "t1_fyynzee",
            "score": 2,
            "created_utc": 1595507514.0,
            "replies": []
        },
        {
            "body": "I definitely agree on the feelings towards COVID. However, don’t be jealous. Our school board is sending us back to school as we normally would be. I live in a very high infection rate area but they want to send 800 students and 115 staff members back to school with very little guidelines on COVID changes. It’s nuts. We’ll all be sick at some point because of this. Grades 6-12 will only go to their school buildings 2 days a week (half the students 2 days and the other half the other 2 days) and learn virtually 3 days a week, but for some reason they think K-5 is all good to go back every single day. \n\nSorry, I didn’t mean to get up on my soapbox right then. I hope homeschooling goes well for you & that Covid leaves us soon so we can return to school safely and soon!!",
            "author": null,
            "id": "fyz64vy",
            "parent_id": "t1_fyz5lgz",
            "score": 2,
            "created_utc": 1595509955.0,
            "replies": [
                {
                    "body": "Damn.  I’m actually not jealous anymore . You have a high chance of dying. Kids are super spreaders. Especially since it’s worse when you are constantly exposed like that .",
                    "author": "Driftwould92",
                    "id": "fyz6tmx",
                    "parent_id": "t1_fyz64vy",
                    "score": 2,
                    "created_utc": 1595510385.0,
                    "replies": []
                },
                {
                    "body": "To put it in perspective , our deaths due to covid in 7 months are more than twice our deaths in 10 plus years of war in Vietnam .",
                    "author": "pinotandsugar",
                    "id": "fz2misq",
                    "parent_id": "t1_fyz64vy",
                    "score": 1,
                    "created_utc": 1595580229.0,
                    "replies": [
                        {
                            "body": "I've stopped making references to the Vietnam War.  Even my 35 yo daughter has no emotional attachment to it (sigh).",
                            "author": "TY2022",
                            "id": "fz6en9w",
                            "parent_id": "t1_fz2misq",
                            "score": 2,
                            "created_utc": 1595662987.0,
                            "replies": [
                                {
                                    "body": "Probably the greatest evolution of music , political turmoil, and social change since the civil war.",
                                    "author": "pinotandsugar",
                                    "id": "fz72txj",
                                    "parent_id": "t1_fz6en9w",
                                    "score": 1,
                                    "created_utc": 1595685351.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Dont get too worried on the school thing.....kids are normally super spreader but europe has found with this one not so much.  Literally no transmission from k-12\n\nThat said you are more likely to get hit by lightning than some harmful or perm given you age.....there us always something freeky ....but dont let the fear mongering get you down ....the science is pretty clear at this point.\n\nThat said how refreshing to hear you SR some of us would die for someone to appreciate what we do especially the extras with nothing expected.\n\nMany people in the bowl and many not mature enough for meaningful relationships of any kind one either side.\n\nThank you for giving some of us hope that there are great people out there....just have to keep turning rocks.",
                    "author": "Momopllc",
                    "id": "fyzoj1e",
                    "parent_id": "t1_fyz64vy",
                    "score": 0,
                    "created_utc": 1595519908.0,
                    "replies": [
                        {
                            "body": "Thankfully I am not fearful, just nervous about the what-ifs. I appreciate you sharing this information with me. \n\n\nYou’re welcome for the Sugar hope. I wish everyone could find the perfect sugar relationship for them. I know not everyone is looking for what I have, but it would be nice if everyone found what they were looking for. I hate hearing the bad/frustrating experiences some people go through to find a good SR.",
                            "author": null,
                            "id": "fyzuo4a",
                            "parent_id": "t1_fyzoj1e",
                            "score": 2,
                            "created_utc": 1595522840.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yay for Elem. Teachers!! ❤️\n\nWe are going back in person. I’m worried because we live in a super high infection rate (like one of the “you can’t travel from your state to our state because we don’t want your virus here” states).  We were told a week ago we were doing hybrid (1/2 the kids were coming Monday & Thursday and the other half  Tuesday & Friday with everyone online Wednesday, but 2 nights ago the board decided all K-5 would go back to everyday in the building while 6-12 would stay in the hybrid mode. So I’m scared but going to try to make the best of it. How will your school year look as of now? \n\nI LOVE sitting cross cross. I don’t have chairs either, I’m all flexible seating! Those SDs don’t know what kind of fun they’re missing out on by not having flexible seating in their offices. Lol!",
            "author": null,
            "id": "fyzhtji",
            "parent_id": "t1_fyzh01b",
            "score": 2,
            "created_utc": 1595516550.0,
            "replies": [
                {
                    "body": "We are starting online, then moving to in person on September 7. Also nervous because I’m in a city where the cases are still on the rise. Nearly 10k yesterday. Ugh. We have (some) protocols in place... teachers and staff are required to wear face coverings, students in PreK-4th aren’t required, but suggested, 5th-8th (we have a MS on our campus as well) are required all day. \n\nI MISS my babies, and I don’t have a better solution than what’s been put in place... but I just want them (and the teachers and staff!) to be safe. \n\nSDs will NEVER understand the joy of a scoop rocking chair or a bouncy ball chair!!! 😂👩🏼‍🏫🍎",
                    "author": "ddcheri11",
                    "id": "fyzisil",
                    "parent_id": "t1_fyzhtji",
                    "score": 1,
                    "created_utc": 1595517055.0,
                    "replies": [
                        {
                            "body": "I miss the kids SO MUCH! I know I’m going to want to hug & squeeze every last one of them when I finally see them again! \n\nI hope you stay super healthy & get to have some sort of normal school year. I so hope this isn’t our new normal for education. \n\nI thought my guy’s were going to explode when I showed him my scoop chairs & my surf desks last night. 😂😂 They just don’t understand the joys.",
                            "author": null,
                            "id": "fyzv7cr",
                            "parent_id": "t1_fyzisil",
                            "score": 1,
                            "created_utc": 1595523091.0,
                            "replies": [
                                {
                                    "body": "Oh, girl. I’m a music teacher, so I’ve known some of the “big kids” since they were in Pre-K. I didn’t get to give them a big hug at the end of the year, before they move on to the middle school. My heart just ached to tell them how much I’ll miss being their music teacher!!! \nI hope you and everyone on your campus stay safe too. This all feels like a bad sci-fi movie, ya know??\n\nGirl, nobody understands the joys of a scoop chair but us and the little darlins!!! Same with things like flair pens and the tropical color pop-up sticky notes!!! LOL 🤩💖",
                                    "author": "ddcheri11",
                                    "id": "fz260na",
                                    "parent_id": "t1_fyzv7cr",
                                    "score": 1,
                                    "created_utc": 1595566073.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Keep searching. There are some great ones out there. Good luck!",
            "author": null,
            "id": "fz0dusu",
            "parent_id": "t1_fz0d80p",
            "score": 3,
            "created_utc": 1595531577.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "muffinandberries",
                    "id": "fz0gruf",
                    "parent_id": "t1_fz0dusu",
                    "score": 1,
                    "created_utc": 1595532939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HAHA! I feel you. I’m so use to it I don’t notice how strange it is until someone not use to them sits down.",
            "author": null,
            "id": "fyz1zjl",
            "parent_id": "t1_fyyg3ax",
            "score": 7,
            "created_utc": 1595507078.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyz7g8r",
            "parent_id": "t1_fyz20ho",
            "score": 3,
            "created_utc": 1595510776.0,
            "replies": [
                {
                    "body": "We definitely have so much love between us. We are 2.5 years in and I don’t see an end to our relationship any time soon. We’ve had talks of being exclusive & not needing/looking for anyone else.",
                    "author": null,
                    "id": "fyz9cfi",
                    "parent_id": "t1_fyz7g8r",
                    "score": 3,
                    "created_utc": 1595511912.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyza2o8",
                            "parent_id": "t1_fyz9cfi",
                            "score": 3,
                            "created_utc": 1595512335.0,
                            "replies": [
                                {
                                    "body": "The same one, the only one. \nNo, he won’t ever leave. & I’m ok with that. I’d never in a million years ask him to.  It doesn’t hurt. We’re very honest about what we have and what we are.",
                                    "author": null,
                                    "id": "fyzbn5i",
                                    "parent_id": "t1_fyza2o8",
                                    "score": 3,
                                    "created_utc": 1595513226.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Complete best",
            "author": null,
            "id": "fyz2gjq",
            "parent_id": "t1_fyz20ho",
            "score": 2,
            "created_utc": 1595507451.0,
            "replies": []
        },
        {
            "body": "I basically never cry (it's probably a first gen / culture thing) but I do get really flustered when people do nice things, so I got all red and forgot how to structure sentences instead.\n\nThat is so sweet! All of it. That sounds amazing.\n\nGood luck to you too! I'm stocking up on KN-95s, but my kids are older so they might actually social distance. I don't even know how K-5 teachers are going to manage, but bless y'all.",
            "author": "brown_bi_babe",
            "id": "fz1k4iy",
            "parent_id": "t1_fyz2bml",
            "score": 3,
            "created_utc": 1595553008.0,
            "replies": []
        },
        {
            "body": "Those are great ideas.  I'm sure the road trip experience is a fun one!",
            "author": null,
            "id": "fz01rtp",
            "parent_id": "t1_fyzxj78",
            "score": 2,
            "created_utc": 1595526039.0,
            "replies": [
                {
                    "body": "Agree those are great ideas!  Unfortunately , wiith COVID, it's almost impossible to be out of the house for more than 3 or 4 hours without raising suspicion.  Food for thought post-COVID though!  Thanks!",
                    "author": "EMPOWER_not_enable",
                    "id": "fz098ge",
                    "parent_id": "t1_fz01rtp",
                    "score": 3,
                    "created_utc": 1595529442.0,
                    "replies": [
                        {
                            "body": "Can you play hooky from work?\n\n SD will request a day off in advance so him and I can go somewhere for the \"work day\".... so like 9am-6pm. Bonus points if it's a work day you have to \"work late.\"",
                            "author": "ElementShow",
                            "id": "fz09zas",
                            "parent_id": "t1_fz098ge",
                            "score": 2,
                            "created_utc": 1595529782.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn.  I’m actually not jealous anymore . You have a high chance of dying. Kids are super spreaders. Especially since it’s worse when you are constantly exposed like that .",
            "author": "Driftwould92",
            "id": "fyz6tmx",
            "parent_id": "t1_fyz64vy",
            "score": 2,
            "created_utc": 1595510385.0,
            "replies": []
        },
        {
            "body": "To put it in perspective , our deaths due to covid in 7 months are more than twice our deaths in 10 plus years of war in Vietnam .",
            "author": "pinotandsugar",
            "id": "fz2misq",
            "parent_id": "t1_fyz64vy",
            "score": 1,
            "created_utc": 1595580229.0,
            "replies": [
                {
                    "body": "I've stopped making references to the Vietnam War.  Even my 35 yo daughter has no emotional attachment to it (sigh).",
                    "author": "TY2022",
                    "id": "fz6en9w",
                    "parent_id": "t1_fz2misq",
                    "score": 2,
                    "created_utc": 1595662987.0,
                    "replies": [
                        {
                            "body": "Probably the greatest evolution of music , political turmoil, and social change since the civil war.",
                            "author": "pinotandsugar",
                            "id": "fz72txj",
                            "parent_id": "t1_fz6en9w",
                            "score": 1,
                            "created_utc": 1595685351.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dont get too worried on the school thing.....kids are normally super spreader but europe has found with this one not so much.  Literally no transmission from k-12\n\nThat said you are more likely to get hit by lightning than some harmful or perm given you age.....there us always something freeky ....but dont let the fear mongering get you down ....the science is pretty clear at this point.\n\nThat said how refreshing to hear you SR some of us would die for someone to appreciate what we do especially the extras with nothing expected.\n\nMany people in the bowl and many not mature enough for meaningful relationships of any kind one either side.\n\nThank you for giving some of us hope that there are great people out there....just have to keep turning rocks.",
            "author": "Momopllc",
            "id": "fyzoj1e",
            "parent_id": "t1_fyz64vy",
            "score": 0,
            "created_utc": 1595519908.0,
            "replies": [
                {
                    "body": "Thankfully I am not fearful, just nervous about the what-ifs. I appreciate you sharing this information with me. \n\n\nYou’re welcome for the Sugar hope. I wish everyone could find the perfect sugar relationship for them. I know not everyone is looking for what I have, but it would be nice if everyone found what they were looking for. I hate hearing the bad/frustrating experiences some people go through to find a good SR.",
                    "author": null,
                    "id": "fyzuo4a",
                    "parent_id": "t1_fyzoj1e",
                    "score": 2,
                    "created_utc": 1595522840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We are starting online, then moving to in person on September 7. Also nervous because I’m in a city where the cases are still on the rise. Nearly 10k yesterday. Ugh. We have (some) protocols in place... teachers and staff are required to wear face coverings, students in PreK-4th aren’t required, but suggested, 5th-8th (we have a MS on our campus as well) are required all day. \n\nI MISS my babies, and I don’t have a better solution than what’s been put in place... but I just want them (and the teachers and staff!) to be safe. \n\nSDs will NEVER understand the joy of a scoop rocking chair or a bouncy ball chair!!! 😂👩🏼‍🏫🍎",
            "author": "ddcheri11",
            "id": "fyzisil",
            "parent_id": "t1_fyzhtji",
            "score": 1,
            "created_utc": 1595517055.0,
            "replies": [
                {
                    "body": "I miss the kids SO MUCH! I know I’m going to want to hug & squeeze every last one of them when I finally see them again! \n\nI hope you stay super healthy & get to have some sort of normal school year. I so hope this isn’t our new normal for education. \n\nI thought my guy’s were going to explode when I showed him my scoop chairs & my surf desks last night. 😂😂 They just don’t understand the joys.",
                    "author": null,
                    "id": "fyzv7cr",
                    "parent_id": "t1_fyzisil",
                    "score": 1,
                    "created_utc": 1595523091.0,
                    "replies": [
                        {
                            "body": "Oh, girl. I’m a music teacher, so I’ve known some of the “big kids” since they were in Pre-K. I didn’t get to give them a big hug at the end of the year, before they move on to the middle school. My heart just ached to tell them how much I’ll miss being their music teacher!!! \nI hope you and everyone on your campus stay safe too. This all feels like a bad sci-fi movie, ya know??\n\nGirl, nobody understands the joys of a scoop chair but us and the little darlins!!! Same with things like flair pens and the tropical color pop-up sticky notes!!! LOL 🤩💖",
                            "author": "ddcheri11",
                            "id": "fz260na",
                            "parent_id": "t1_fyzv7cr",
                            "score": 1,
                            "created_utc": 1595566073.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "muffinandberries",
            "id": "fz0gruf",
            "parent_id": "t1_fz0dusu",
            "score": 1,
            "created_utc": 1595532939.0,
            "replies": []
        },
        {
            "body": "We definitely have so much love between us. We are 2.5 years in and I don’t see an end to our relationship any time soon. We’ve had talks of being exclusive & not needing/looking for anyone else.",
            "author": null,
            "id": "fyz9cfi",
            "parent_id": "t1_fyz7g8r",
            "score": 3,
            "created_utc": 1595511912.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyza2o8",
                    "parent_id": "t1_fyz9cfi",
                    "score": 3,
                    "created_utc": 1595512335.0,
                    "replies": [
                        {
                            "body": "The same one, the only one. \nNo, he won’t ever leave. & I’m ok with that. I’d never in a million years ask him to.  It doesn’t hurt. We’re very honest about what we have and what we are.",
                            "author": null,
                            "id": "fyzbn5i",
                            "parent_id": "t1_fyza2o8",
                            "score": 3,
                            "created_utc": 1595513226.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree those are great ideas!  Unfortunately , wiith COVID, it's almost impossible to be out of the house for more than 3 or 4 hours without raising suspicion.  Food for thought post-COVID though!  Thanks!",
            "author": "EMPOWER_not_enable",
            "id": "fz098ge",
            "parent_id": "t1_fz01rtp",
            "score": 3,
            "created_utc": 1595529442.0,
            "replies": [
                {
                    "body": "Can you play hooky from work?\n\n SD will request a day off in advance so him and I can go somewhere for the \"work day\".... so like 9am-6pm. Bonus points if it's a work day you have to \"work late.\"",
                    "author": "ElementShow",
                    "id": "fz09zas",
                    "parent_id": "t1_fz098ge",
                    "score": 2,
                    "created_utc": 1595529782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've stopped making references to the Vietnam War.  Even my 35 yo daughter has no emotional attachment to it (sigh).",
            "author": "TY2022",
            "id": "fz6en9w",
            "parent_id": "t1_fz2misq",
            "score": 2,
            "created_utc": 1595662987.0,
            "replies": [
                {
                    "body": "Probably the greatest evolution of music , political turmoil, and social change since the civil war.",
                    "author": "pinotandsugar",
                    "id": "fz72txj",
                    "parent_id": "t1_fz6en9w",
                    "score": 1,
                    "created_utc": 1595685351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thankfully I am not fearful, just nervous about the what-ifs. I appreciate you sharing this information with me. \n\n\nYou’re welcome for the Sugar hope. I wish everyone could find the perfect sugar relationship for them. I know not everyone is looking for what I have, but it would be nice if everyone found what they were looking for. I hate hearing the bad/frustrating experiences some people go through to find a good SR.",
            "author": null,
            "id": "fyzuo4a",
            "parent_id": "t1_fyzoj1e",
            "score": 2,
            "created_utc": 1595522840.0,
            "replies": []
        },
        {
            "body": "I miss the kids SO MUCH! I know I’m going to want to hug & squeeze every last one of them when I finally see them again! \n\nI hope you stay super healthy & get to have some sort of normal school year. I so hope this isn’t our new normal for education. \n\nI thought my guy’s were going to explode when I showed him my scoop chairs & my surf desks last night. 😂😂 They just don’t understand the joys.",
            "author": null,
            "id": "fyzv7cr",
            "parent_id": "t1_fyzisil",
            "score": 1,
            "created_utc": 1595523091.0,
            "replies": [
                {
                    "body": "Oh, girl. I’m a music teacher, so I’ve known some of the “big kids” since they were in Pre-K. I didn’t get to give them a big hug at the end of the year, before they move on to the middle school. My heart just ached to tell them how much I’ll miss being their music teacher!!! \nI hope you and everyone on your campus stay safe too. This all feels like a bad sci-fi movie, ya know??\n\nGirl, nobody understands the joys of a scoop chair but us and the little darlins!!! Same with things like flair pens and the tropical color pop-up sticky notes!!! LOL 🤩💖",
                    "author": "ddcheri11",
                    "id": "fz260na",
                    "parent_id": "t1_fyzv7cr",
                    "score": 1,
                    "created_utc": 1595566073.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyza2o8",
            "parent_id": "t1_fyz9cfi",
            "score": 3,
            "created_utc": 1595512335.0,
            "replies": [
                {
                    "body": "The same one, the only one. \nNo, he won’t ever leave. & I’m ok with that. I’d never in a million years ask him to.  It doesn’t hurt. We’re very honest about what we have and what we are.",
                    "author": null,
                    "id": "fyzbn5i",
                    "parent_id": "t1_fyza2o8",
                    "score": 3,
                    "created_utc": 1595513226.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can you play hooky from work?\n\n SD will request a day off in advance so him and I can go somewhere for the \"work day\".... so like 9am-6pm. Bonus points if it's a work day you have to \"work late.\"",
            "author": "ElementShow",
            "id": "fz09zas",
            "parent_id": "t1_fz098ge",
            "score": 2,
            "created_utc": 1595529782.0,
            "replies": []
        },
        {
            "body": "Probably the greatest evolution of music , political turmoil, and social change since the civil war.",
            "author": "pinotandsugar",
            "id": "fz72txj",
            "parent_id": "t1_fz6en9w",
            "score": 1,
            "created_utc": 1595685351.0,
            "replies": []
        },
        {
            "body": "Oh, girl. I’m a music teacher, so I’ve known some of the “big kids” since they were in Pre-K. I didn’t get to give them a big hug at the end of the year, before they move on to the middle school. My heart just ached to tell them how much I’ll miss being their music teacher!!! \nI hope you and everyone on your campus stay safe too. This all feels like a bad sci-fi movie, ya know??\n\nGirl, nobody understands the joys of a scoop chair but us and the little darlins!!! Same with things like flair pens and the tropical color pop-up sticky notes!!! LOL 🤩💖",
            "author": "ddcheri11",
            "id": "fz260na",
            "parent_id": "t1_fyzv7cr",
            "score": 1,
            "created_utc": 1595566073.0,
            "replies": []
        },
        {
            "body": "The same one, the only one. \nNo, he won’t ever leave. & I’m ok with that. I’d never in a million years ask him to.  It doesn’t hurt. We’re very honest about what we have and what we are.",
            "author": null,
            "id": "fyzbn5i",
            "parent_id": "t1_fyza2o8",
            "score": 3,
            "created_utc": 1595513226.0,
            "replies": []
        }
    ]
}