{
    "title": "Black Girl Tips -good advice for all minorities really-",
    "post_id": "xnq0xw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xnq0xw/black_girl_tips_good_advice_for_all_minorities/",
    "author": "chocolatebabydoll",
    "body": "\nHonestly, I made a post like 2yrs ago complaining about the sugar lifestyle and how racist it is and discriminatory. I feel like we have to work 10x harder to even get half the stuff some of these girls get, and when i posted that...the white american sugar daddies in the forum ate me tf up and were coming with every excuse for why that isnt true. BUT I have figured out ladies...it's simply America. Go where you're celebrated and wanted and for me personally...I flourish in Europe with sugar daddies in every country that are big spenders. They think i am \"exotic\" so thats why it's easier to attract high value men. I recommend countries with no black people like Eastern Europe and Scandinavian/Nordic Countries. But the Mediterranean European countries love us too. I have never been more embraced and sought after than when I go to Europe. It's because they don't really have a lot of black population, so they have no perception of black people and see us as exotic and are generally curious of us. The higher the black population in that country, the less effective i think, because then they have a societal perception of black people. For example, England, very racist, but no surprise they birthed america right? Spain, sorta racist, they have an african immigrant communtiy so some people have a perception of black people when they see us and i personally felt it - but if youre american for some reason its ok to be black then -. Romania, an Eastern European country with no black people,  I was treated very well, getting free stuff everywhere i go from bar owners and restaurants, because they genuinely want to.treat you nice and leave a good perception of the country and people. \n\nAnyways domestically I'd suggest New York because it is more liberal and there are lots of guys with money that honestly don't care what type of girl they spoil, she just has to be attractive to them. \n\nI'd just like to stress that this is my personal experience and what seems to be true for me as of right now. The south never worked for me and I was getting depressed because I didn't know why, but when I traveled abroad...it opened up my eyes. \n\nALSO use dating sites and apps, they have worked for me BETTER  than SA.\n\nTldr: Go where you're wanted and celebrated, not where there is a history and societal norms of hating you.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xnq0xw/black_girl_tips_good_advice_for_all_minorities/",
    "score": 100,
    "upvote_ratio": 0.85,
    "created_utc": 1664118895.0,
    "num_comments": 77,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Looking at your pictures (from your post history), I'm surprised you would have much difficulty in any location finding an SR.\n\nThat said, I'm also not surprised you would have luck in an area you are seen as exotic - but I would also wonder if it would (over time) wear on you for being fetishized.\n\nI (sugar)dated/hooked up/whatever exactly 1 black woman (she was Ghanian/Czech) when I was living in Czechia.  The vast majority of the women I saw were white.  Why?  Simple demographics (as you say).  One of the things she complained about to me (in our conversations) was that most guys that showed interest in her - seemed to be more interested in being with her, because she was black, then anything else about her.  Her racial background was a novelty, a checkbox, something to brag about.  Very few people seemed to be interested in her.",
            "author": "SDstartingOut",
            "id": "ipvijg8",
            "parent_id": "t3_xnq0xw",
            "score": 15,
            "created_utc": 1664132664.0,
            "replies": [
                {
                    "body": "When I was 18 in Croatia I ran into that a lot, i got so many \"I've always wanted to be with a black girl\" \"I've always wanted to be with a black teen\" shit like that which to me is indeed nasty....but in to any guy that says that I would NEVER date them or fuck them for free lmao. If they want me only to fulfill their fantasy and to brag about it...then give me money, and for me it's THAT simple. If you wanna treat me as an experience and not a human, I'll charge you for this experience (aka pussay lmaooo). For sugar lifestyle fetishization and all sexwork -cause I do other stuff too- fetishization works in my favor because I can charge more/get spoiled more...but outside of that, I don't tolerate it...well unless it benefits me....cause I'm shallow 🤣",
                    "author": "chocolatebabydoll",
                    "id": "ipvjf27",
                    "parent_id": "t1_ipvijg8",
                    "score": 12,
                    "created_utc": 1664133001.0,
                    "replies": [
                        {
                            "body": "Do they tend to turn into longer term relationships, or mostly short term?  (Of course, I understand there is typically a ratio of short term to find the right long term - so there will always be more short term than long term).",
                            "author": "SDstartingOut",
                            "id": "ipvkh35",
                            "parent_id": "t1_ipvjf27",
                            "score": 3,
                            "created_utc": 1664133399.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tbh I call cap about the Europe thing. Maybe in Nordic countries black people are more celebrated. But in Eastern European countries and even some western like France, this isn't true. Dude Poland literally refused black and brown ukrainians from seeking asylum in Poland. It's actually crazy",
            "author": "Snoo91187",
            "id": "ipvyw7r",
            "parent_id": "t3_xnq0xw",
            "score": 10,
            "created_utc": 1664138803.0,
            "replies": [
                {
                    "body": "I don't think your point & OP's point are mutually exclusive of each other.\n\nI absolutely agree that Eastern Europe is far more racists than the US (or at least - the parts of the US that I have lived in).  It's a bit of a different type of racism - due to the more homogenous racial makeup of the country.  But still very deep seated racism.\n\nHowever - OP is playing to her strength in those areas.  She is a rarity / someone seen as exotic.  When I lived in Czechia (not Prague;  2nd largest city) - I think I saw a total of 2 black women on SA the entire time there.  So it's a bit more of a niche.",
                    "author": "SDstartingOut",
                    "id": "ipw01cy",
                    "parent_id": "t1_ipvyw7r",
                    "score": 5,
                    "created_utc": 1664139255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ipv99zf",
            "parent_id": "t3_xnq0xw",
            "score": 22,
            "created_utc": 1664129238.0,
            "replies": [
                {
                    "body": "See, I didn't think about it from that perspective! That is a valid point to bring up body types! I can only speak from my perspective as a relatively small woman -I've been called petite before but idk if I'd say that- and I have troubles as a small black woman. I am curious about the other shapes and sizes of women on SA though, because I wkuld assume in general bigger girls of all races don't particularly frequent SA because generally wealthy men DO enjoy women with a fit frame...but I could see where it comes into play because in the past decade or 2 -and in the black community for years and years before- a bigger and curvy body was desirable, so maybe there are a lot of curvy black women on SA because our body types are being glorified nowadays in mainstream media and culture. However it doesn't translate to the Sugar Bowl...and it's the same for race. I am beautiful period and when I travel I get called beautiful all the time, but it doesn't translate to the sugar bowl I guess because just the demographic of white american men and their prefrences...if that makes sense. So I just learned to travel where my race is a preference or at least not a negative.",
                    "author": "chocolatebabydoll",
                    "id": "ipvb1jl",
                    "parent_id": "t1_ipv99zf",
                    "score": 5,
                    "created_utc": 1664129892.0,
                    "replies": [
                        {
                            "body": "I have had multiple black and mixed SB’s over the years.  They are all fit and petite and they all got a bunch of crap from their own race for being “too skinny” despite being Slim Thicc or fit with curves. I think build is a bigger hurdle for WOC than race.  For SD’s,  hot is hot.  I have dated the rainbow and the one thing they had in common was their build.  Doesn’t matter if they were a blonde beach babe or dark hair and eyes from Yemen,  it’s the body type that attracts.",
                            "author": "LotBuilder",
                            "id": "ipvj1r8",
                            "parent_id": "t1_ipvb1jl",
                            "score": 9,
                            "created_utc": 1664132858.0,
                            "replies": []
                        },
                        {
                            "body": "But you're thinking about it different than most. Heavier girls have been getting called thicc, sexy, etc. They are used to men pumping their egos for a lay. Eventually they believe they can get paid to do it.\n\nI've seen all types and bodies in the bowl. I have no racial preference, but I hate egotistical women. Black women and Hispanic women tend to be on the larger side and that's going to turn off a lot of guys. They go on there only to wonder why guys don't want them. Then they also think they're queens, and have higher standards. I don't like dealing with that shit.\n\nYou look at it like a business, which is what I personally prefer. But I would say 75 percent of SB's I see are heavy enough to be overweight or obese.",
                            "author": "Daddy_Dom_47",
                            "id": "ipwc2g3",
                            "parent_id": "t1_ipvb1jl",
                            "score": 0,
                            "created_utc": 1664144303.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t judge as a daddy, I have had arrangements from all colors and ethnicities… it’s about a connection to me…",
            "author": null,
            "id": "ipv3tb6",
            "parent_id": "t3_xnq0xw",
            "score": 6,
            "created_utc": 1664127229.0,
            "replies": [
                {
                    "body": "And that's awesome, that's how it should be for everyone. Connection and attractiveness.  I mean I can't fault someone for having a preference, we all inherently do. But when it gets to I won't date xyz period, no matter how attractiveness they are, no matter how much we click, then it becomes weird and racist.",
                    "author": "chocolatebabydoll",
                    "id": "ipv4hdx",
                    "parent_id": "t1_ipv3tb6",
                    "score": 5,
                    "created_utc": 1664127477.0,
                    "replies": [
                        {
                            "body": "Ugh. Just can't handle the fact that people have preferences.  Just because you consider yourself attractive doesn't mean that I will.  I prefer tall athletic Caucasian brunettes.   So have zero interest in dating you. Does NOT make me a racist, no matter what you think or believe.     It is my preference. Just because you want it to be, doesn't mean it will.  Just because you think America is racist, doesn't make it so.  Just curious,  what about all the successful black SDs?  Why aren't they into you?",
                            "author": "MainDragonfruit82",
                            "id": "ipvcxsy",
                            "parent_id": "t1_ipv4hdx",
                            "score": -2,
                            "created_utc": 1664130568.0,
                            "replies": [
                                {
                                    "body": "I agreed with the first part of your first statement but when you brought in America not having a racism problem, it revealed your ignorance as a history book can easily refute your point. Or just read what people have to say all across the internet in their anonymity about black people. My dad who is mixed but mostly white heard all sorts of racists things said about black people in his presence and there are videos of white people confessing racists things they've heard other white people say about black people. Heck our first mixed race president (who isnt even called that) born in Hawaii was harassed and told to go back to Kenya.  Like cmon dude, so much evidence of a racism towards people who are black, mixed, asian, and yes white).\n\nYou are absolutely allowed to have racial preferences. I do (I just dont share them). Most people have a phenotype they prefer. I highly doubt you've versed in the internalized racism issues within the black American community (or that you want to be) so I wouldnt bring up black sds if I were you. Also, given that America is 77% white and white americans tend to have higher income than black americans, there wont be that many black sds for black sbs. No one can demand anyone be interested in them, but the OPs points are valid. Stereotypes have caused a negative perception of black women in the US. Even Asian women get the \"submissive sex doll\" fetish too.",
                                    "author": "UniqueSkinnyXFigure",
                                    "id": "ipwe73g",
                                    "parent_id": "t1_ipvcxsy",
                                    "score": 9,
                                    "created_utc": 1664145246.0,
                                    "replies": [
                                        {
                                            "body": "Racism can be examined and evaluated on many levels.   I have three masters degrees and one is history.  One man's view of racism is not always accurate.   Not saying that we have had racial  issues but in last 50 or so years since LBJ was President,  racism has been perpetrated by a sect of society who used it for political purposes. \n\nI can site dozens of examples. So whether you agree or disagree, racism is not significantly prevalent except for some who profit from it",
                                            "author": "MainDragonfruit82",
                                            "id": "ipwg4rw",
                                            "parent_id": "t1_ipwe73g",
                                            "score": 0,
                                            "created_utc": 1664146102.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I had responded,  but not sure it posted.  As I said, one man's view of racism is not necessarily viewed the same by others.  I am a student of history with a masters in the subject and two other masters degrees focused on my career. \n\nUnfortunately your views are naive. Sorry.   While there will always be racism....as it us human nature....to label it as purely American shows limited knowledge of the world.    Since just before LBJ was President,  racism was focused on forcing segments of society to engage and integrate.  People were also being shamed.  Then welfare reform was passed which institutionalized the perception of a segment of society.  It also enabled certain people and groups to use \"racism\" as a tool for specific political objectives.   It did not help or improve.\nToday most in this country do not care about racism as it is mostly non existent.  It is manufactured by those seeking to benefit and profit.   Sorry if you disagree, but I can provide reams of examples.  Even Obama used racism to get elected.  He is the perfect example of incompetence being promoted to make certain groups feel good about themselves.   He though, Injected himself into racial issues....mostly on the wrong side.  He is a class a race baiter.  Again, no worries if you disagree.    Unfortunately for those who claim rampant racism,the facts just don't support it.",
                                            "author": "MainDragonfruit82",
                                            "id": "ipwjro7",
                                            "parent_id": "t1_ipwe73g",
                                            "score": -1,
                                            "created_utc": 1664147725.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "...just cause you dont want america to be racist doesn't mean it isn't. You sound SILLY. America has racism in its roots, have you been to history class baby? To say america isnt racist is ignorant and stupid even. Also if a tall, athletic, black woman with brown hair was to meet you, and she had the perfect personality, and you think \"she is perfect BUT she is black that's the only problem\" then youre racist. I already stated I understand people have preferences, and that's fine, but when it gets to the point you won't choose someone ONLY cause their race, then it becomes a problem...what don't you understand hunny? I am beautiful period. I get plenty of compliments outside the US, it's just the US is racist. As for black sugar daddy's, most black men that are sugar daddies know that white women are a standard of beauty and a symbol of status, that is why you see a lot of wealthy black men with white women, it's still a result of racism and coonery if I'm frank. The other half of black men with money -sports, music, pop culture- tend to go with racially ambiguous women or white, which is why you see racially ambiguous and white women as basketball wives and football wives etc. Even in the black community there is colorism, which is preferring lighter skins over darker skin black people. Racism and colonialism really did a number on america and Americans-including black americans-. For you to say I don't understand preference is ignorant. I prefer european white men because they tend to treat me like a princess and are very generous towards me, HOWEVER, if I met a black man that did treat me the same, or an American white man that treated me the same, I would never say \"no because they are american\" \"no they are black\"",
                                    "author": "chocolatebabydoll",
                                    "id": "ipvg4eq",
                                    "parent_id": "t1_ipvcxsy",
                                    "score": 14,
                                    "created_utc": 1664131742.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "ipvlon6",
                                            "parent_id": "t1_ipvg4eq",
                                            "score": -5,
                                            "created_utc": 1664133851.0,
                                            "replies": [
                                                {
                                                    "body": "Not finding BW desirable isn’t inherently racist. However, when you start to shift the blame and are unable to answer the question of “Why not?” without saying “well… because they’re disagreeable, difficult, demanding, uncouth, and money hungry” without considering that 1) your perception of black women probably isn’t the most informed if you aren’t engaging with them on a regular basis \nOr 2) critically thinking about how things got that way … it’s pretty suspect.\n\nMost racists will claim that they aren’t, and that the system isn’t racist (if you’d like actual literature on the history of America’s systemic racism – more than happy to share.) But when you ask them why they think black women behave and move through the world in the way they do the answer is always: Well, because they’re black.\n\nAnd that, my friend, is racist😁",
                                                    "author": "naecest",
                                                    "id": "ipvykb2",
                                                    "parent_id": "t1_ipvlon6",
                                                    "score": 4,
                                                    "created_utc": 1664138673.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
                                                            "author": "MainDragonfruit82",
                                                            "id": "ipwce0n",
                                                            "parent_id": "t1_ipvykb2",
                                                            "score": -3,
                                                            "created_utc": 1664144444.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Pissed",
                                                                    "author": "MainDragonfruit82",
                                                                    "id": "ipwcfvp",
                                                                    "parent_id": "t1_ipwce0n",
                                                                    "score": 0,
                                                                    "created_utc": 1664144466.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
                                                            "author": "MainDragonfruit82",
                                                            "id": "ipwbo7j",
                                                            "parent_id": "t1_ipvykb2",
                                                            "score": -3,
                                                            "created_utc": 1664144128.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You sound super slow nobody care about what your saying my guy",
                                    "author": "Successful_Ad_5027",
                                    "id": "ipw6zor",
                                    "parent_id": "t1_ipvcxsy",
                                    "score": -1,
                                    "created_utc": 1664142108.0,
                                    "replies": [
                                        {
                                            "body": "When you learn to write and speak proper English,  feel free to message me back.  Until then, please don't waste my time",
                                            "author": "MainDragonfruit82",
                                            "id": "ipwbwc9",
                                            "parent_id": "t1_ipw6zor",
                                            "score": 2,
                                            "created_utc": 1664144227.0,
                                            "replies": [
                                                {
                                                    "body": "You must be real sore with that sick in your ass 24/7 go grown up and get a life",
                                                    "author": "Successful_Ad_5027",
                                                    "id": "ipwc2sk",
                                                    "parent_id": "t1_ipwbwc9",
                                                    "score": 1,
                                                    "created_utc": 1664144307.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "You sound like a muncher",
                                                    "author": "Successful_Ad_5027",
                                                    "id": "ipwc4xv",
                                                    "parent_id": "t1_ipwbwc9",
                                                    "score": 0,
                                                    "created_utc": 1664144334.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’ve met a few black gals lately that were so amazing… beautiful and so spiritually in tune… can’t find a decent spiritual white girl to save my life and that’s ok because all faiths started in SOuth Afrika so I am so honored that they are sharing with me 😎",
                            "author": null,
                            "id": "ipv4zwx",
                            "parent_id": "t1_ipv4hdx",
                            "score": 1,
                            "created_utc": 1664127668.0,
                            "replies": [
                                {
                                    "body": "What do you mean all faiths started in South africa?",
                                    "author": "chocolatebabydoll",
                                    "id": "ipv6lu3",
                                    "parent_id": "t1_ipv4zwx",
                                    "score": 1,
                                    "created_utc": 1664128254.0,
                                    "replies": [
                                        {
                                            "body": "Send DM",
                                            "author": null,
                                            "id": "ipvr3vn",
                                            "parent_id": "t1_ipv6lu3",
                                            "score": 0,
                                            "created_utc": 1664135860.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The oldest practice of faith on the planet was IFA and it was used by South Afrikaans and Egyptians … Ancient Egypt Kings and Queens were Black !",
                                            "author": null,
                                            "id": "ipv6zha",
                                            "parent_id": "t1_ipv6lu3",
                                            "score": -2,
                                            "created_utc": 1664128395.0,
                                            "replies": [
                                                {
                                                    "body": "?? Pharaons kings werent black it is just an urban legend",
                                                    "author": "GuyFromParis",
                                                    "id": "ipv9eha",
                                                    "parent_id": "t1_ipv6zha",
                                                    "score": 7,
                                                    "created_utc": 1664129284.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sounds good 👌🏼",
                                                            "author": null,
                                                            "id": "ipvb6wf",
                                                            "parent_id": "t1_ipv9eha",
                                                            "score": 0,
                                                            "created_utc": 1664129945.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Where are you getting your information?  You are so wrong.......",
                                                    "author": "MainDragonfruit82",
                                                    "id": "ipvd490",
                                                    "parent_id": "t1_ipv6zha",
                                                    "score": 3,
                                                    "created_utc": 1664130632.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Similarly, white sugar daddies can do very well in Africa.",
            "author": "MGTOWManofMystery",
            "id": "ipw7cbt",
            "parent_id": "t3_xnq0xw",
            "score": 3,
            "created_utc": 1664142257.0,
            "replies": []
        },
        {
            "body": "I'm biracial and attract every race and ethnicity but get stupid comments once in a blue moon. I've heard about what Black and Asian women experience with dating with regards to race and I know it's rough. Watched youtube videos listening to what guys say to some of these women and it's appalling. I wish someone would say those things to me. Havent gotten to whip the sharp tongue out in a while. \n\nI surprisingly don't get that many race related comments and white men show the most interest. I've admittedly taken a step back from online dating in general because the assumptions(not race/ethnicity related), poor reading comprehension and sexual aggressiveness are annoying. Also undeniably in lust with an older man (who's white) so dating is impossible since I imagine his head on every guys body😏.\n\nI agree that women of color should go where they're wanted and I'm glad you've been treated well in other countries. I'm taking a trip to New Zealand soon. Wonder how the dating scene is there.",
            "author": "UniqueSkinnyXFigure",
            "id": "ipwav4a",
            "parent_id": "t3_xnq0xw",
            "score": 3,
            "created_utc": 1664143774.0,
            "replies": []
        },
        {
            "body": "Some parts in England are quite racist but in London it’s definitely more accepting and easier to sugar since it’s so diverse. \nLots of older white guys here fetishise dark skin / racially ambiguous women so I’ve used that to my advantage and found myself 3 older white sd’s. I’m obviously not sugaring with the fetishisers, but my sd’s like me for me and not just my skin colour.\nIt definitely wasn’t easy, but I didn’t give up on the search.",
            "author": "D2boujee",
            "id": "ipuv28r",
            "parent_id": "t3_xnq0xw",
            "score": 4,
            "created_utc": 1664123797.0,
            "replies": [
                {
                    "body": "Yes! Exactly...but ngl I will.sugar with someone that has a fetish cause shiddddd his dollars still spend. And we are 2 consenting adults, I understand he is just a sugar daddy so tbh idc if he fetishizes me cause he isn't really my partner. If I don't take it, someone else will.",
                    "author": "chocolatebabydoll",
                    "id": "ipuvym4",
                    "parent_id": "t1_ipuv28r",
                    "score": 3,
                    "created_utc": 1664124164.0,
                    "replies": [
                        {
                            "body": "I get that, so would I tbh but ‘race play’ is where I draw the line lol",
                            "author": "D2boujee",
                            "id": "ipuw7by",
                            "parent_id": "t1_ipuvym4",
                            "score": 4,
                            "created_utc": 1664124261.0,
                            "replies": [
                                {
                                    "body": "Understandable. I feel like that's more in the BDSM scene anyways, so one would have to be into bdsm in the first place to allow that. I would never tolerate negative race play, because for me that's just a boundary, but if you call me your \"black goddess\" I'll probably cringe, cry, and shit myself, but it wouldn't be a deal breaker, I'd just count downt the seconds till I can leave with my rent money 😭. And then if they are just using black as a description I also don't mind lmao. like \"your little black pussy\" or some shit...I'm just like well yea, it is a little pussy and it is indeed black. If they KEEP saying it multiple times and for EVERYTHING, then i get a bit uncomfortable like...ok i get it IM BLACK and you like that like...ok bro. But I am into the kink scene so I'm a bit freaky deaky.",
                                    "author": "chocolatebabydoll",
                                    "id": "ipuy83d",
                                    "parent_id": "t1_ipuw7by",
                                    "score": 1,
                                    "created_utc": 1664125090.0,
                                    "replies": [
                                        {
                                            "body": "Yeah I don’t mind the black this and that stuff during intimacy. I’d probably say it back to him and fulfill the fantasy: “How much do you love this black pussy”? etc but when it starts to get degrading I would want to call it quits since it’s such a turn off and my kink is more of a praise, sub kink - so the complete opposite.\nUnless he’s offering like a significantly big allowance, I’d consider it. But at the same time I don’t want to feel like I’m just an object and black f*ck toy to him.",
                                            "author": "D2boujee",
                                            "id": "ipv03wq",
                                            "parent_id": "t1_ipuy83d",
                                            "score": 4,
                                            "created_utc": 1664125832.0,
                                            "replies": [
                                                {
                                                    "body": "Exactly, a girl that gets it. But I'm a sub so it works out in my favor lmao. Right but the price point is the key 🔑",
                                                    "author": "chocolatebabydoll",
                                                    "id": "ipv18fq",
                                                    "parent_id": "t1_ipv03wq",
                                                    "score": 1,
                                                    "created_utc": 1664126267.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "no cos why does the yt girl who posted a profile review after me already have feedback but I don’t 😭 anyway I totally agree cos I’m not a local in my country so I attract a niche group and most times they’re wealthier. bipoc reading this definitely try setting your location to diff countries and using the “travel to you” tag on seeking. might find something great!",
            "author": null,
            "id": "ipumaqg",
            "parent_id": "t3_xnq0xw",
            "score": 8,
            "created_utc": 1664120133.0,
            "replies": [
                {
                    "body": "And there was a white girl that posted a profile review an HOUR before your post, and you have more responses (on your thread) than she does.\n\nhttps://www.reddit.com/r/sugarlifestyleforum/comments/xno77n/any_advice_is_welcomed/\n\nNot every single thing is about race.",
                    "author": "SDstartingOut",
                    "id": "ipv5d06",
                    "parent_id": "t1_ipumaqg",
                    "score": 8,
                    "created_utc": 1664127803.0,
                    "replies": [
                        {
                            "body": "her face wasn’t the focal point of her post. i saw that post and didn’t even know she was white. at first glance I thought she was poc and she clearly takes influence from poc. please stop trying to find little loopholes. you don’t know my experience simply just scroll away this post isn’t for you",
                            "author": null,
                            "id": "ipv5tvm",
                            "parent_id": "t1_ipv5d06",
                            "score": -2,
                            "created_utc": 1664127974.0,
                            "replies": [
                                {
                                    "body": "> her face wasn’t the focal point of her post\n\nSorry, not sure what face means?\n\nAnyway, you posted this very clearly.  You said:\n\n> why does the yt girl who posted a profile review after me already have feedback but I don’t \n\nAnd I'm pointing out to you, that you got MORE feedback, then a different white girl, that posted an hour before you",
                                    "author": "SDstartingOut",
                                    "id": "ipv7bve",
                                    "parent_id": "t1_ipv5tvm",
                                    "score": 6,
                                    "created_utc": 1664128521.0,
                                    "replies": [
                                        {
                                            "body": "what do you mean you don’t know what face means? i provided a simple explanation, don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes looking directly into the camera",
                                            "author": null,
                                            "id": "ipv7y69",
                                            "parent_id": "t1_ipv7bve",
                                            "score": -2,
                                            "created_utc": 1664128752.0,
                                            "replies": [
                                                {
                                                    "body": "> what do you mean you don’t know what face means? \n\nI wasn't sure if it was a typo for you saying \"race\".  I genuinely (until you made this comment) did not understand what you were saying.   None of it clicked (what you said in your initial post), because that's not at all how I see her profile.  I don't even know what this means:\n\n> and she clearly takes influence from poc.\n\nHow?  What about her looks like its influenced from POC?  \n\n> don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes\n\nI don't think there is anything racially ambiguous about the profile.    Agree to disagree.  And it also clearly says \"white\" on the profile, which you can't miss if you click on it.",
                                                    "author": "SDstartingOut",
                                                    "id": "ipvm1wo",
                                                    "parent_id": "t1_ipv7y69",
                                                    "score": 4,
                                                    "created_utc": 1664133989.0,
                                                    "replies": [
                                                        {
                                                            "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
                                                            "author": null,
                                                            "id": "ipvmta6",
                                                            "parent_id": "t1_ipvm1wo",
                                                            "score": 0,
                                                            "created_utc": 1664134272.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "\"the yt\" - is that supposed to read as \"the whitey\"?",
                    "author": null,
                    "id": "ipuu14f",
                    "parent_id": "t1_ipumaqg",
                    "score": 3,
                    "created_utc": 1664123375.0,
                    "replies": [
                        {
                            "body": "Yt- white",
                            "author": "MissCannabunny",
                            "id": "ipuywlg",
                            "parent_id": "t1_ipuu14f",
                            "score": 5,
                            "created_utc": 1664125359.0,
                            "replies": []
                        },
                        {
                            "body": "personally I read it as white so “white girl”. never heard of whitey but what are you insinuating?",
                            "author": null,
                            "id": "ipuu7t5",
                            "parent_id": "t1_ipuu14f",
                            "score": -1,
                            "created_utc": 1664123452.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Exactly. Like certain areas just aren't for us...and for me it's almost the whole country of USA. I mean I finally have somewhat come to terms with it being supply and demand. Like go where you're wanted, it's that simple. Also yea, this forum is a correct depiction of the US sugar lifestyle, lot of conservative yt people that can't stand to even imagine that america isn't fair, and can't even imagine a person of coloras pretty or prettier as their preference, and these comment will definitely show that lmao.",
                    "author": "chocolatebabydoll",
                    "id": "ipurdo7",
                    "parent_id": "t1_ipumaqg",
                    "score": -1,
                    "created_utc": 1664122274.0,
                    "replies": [
                        {
                            "body": "i hear you! omg. good thing is we thrive in a lot of places too! you’re totally spot on about being seen as “exotic”. as much as I hate it in the regular dating scene, I love it in sugar dating because I feel like I’m providing more by offering a new experience to the SD! \n\nalso im quite shocked that I didn’t receive more feedback. maybe it’s just this subreddit but I’ve always been considered and consider myself as attractive or above average even if I do take shitty pictures",
                            "author": null,
                            "id": "ipus78n",
                            "parent_id": "t1_ipurdo7",
                            "score": 3,
                            "created_utc": 1664122618.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "found your photos from your profile, sign this southern-ish\\* white man up! but I'm not surprised you ran into those kind of issues, there are a lot of white men with very backwards ideas around here. \n\n\\*Richmond, Virginia. it was the capital of the confederacy so I guess that counts as southern.",
            "author": "fromaroundhere1",
            "id": "ipwk2t9",
            "parent_id": "t3_xnq0xw",
            "score": 2,
            "created_utc": 1664147865.0,
            "replies": []
        },
        {
            "body": "Haha I had a guy write to me recently that his “blackness is an issue,” and I was like - what are you on???  If his blackness were an issue, I wouldn’t even be talking to him, right?  And if he was accusing me of fetishizing him, well then - good riddance.  \n\nIt’s 2022.  Date who you are attracted to, period.  It’s unpopular and vile to be racist.  Choose who to love (or bone) and keep it moving.  False accusations of -ISMS and -phobics are both insulting and inaccurate more than half the time.",
            "author": "mistressita",
            "id": "ipuv33h",
            "parent_id": "t3_xnq0xw",
            "score": 3,
            "created_utc": 1664123807.0,
            "replies": [
                {
                    "body": "False ones are insulting, however there are people who are actually racist and other stuff. I wouldn't ever accuse someone that is talking to me of that...unless I had a reason..but shit, I really don't give a fuck if someone fetishizes me if I'm getting their money...like that's more for me if I am your fantasy, right? But odd experience if he said that out of nowhere.",
                    "author": "chocolatebabydoll",
                    "id": "ipuw9mz",
                    "parent_id": "t1_ipuv33h",
                    "score": 0,
                    "created_utc": 1664124288.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or alternatively there are fundamental differences between American black culture and European black culture. A Nigerian immigrant and a chick from south central LA have very little in common outside of skin color.",
            "author": "Bgdaddysmooth",
            "id": "ipw6h9o",
            "parent_id": "t3_xnq0xw",
            "score": 4,
            "created_utc": 1664141892.0,
            "replies": []
        },
        {
            "body": "thank you for this post and addressing something most people in the community wouldn’t!!",
            "author": null,
            "id": "ipvk5nt",
            "parent_id": "t3_xnq0xw",
            "score": 2,
            "created_utc": 1664133278.0,
            "replies": []
        },
        {
            "body": "commented ur other post. just popping in to thank you again for writing this !",
            "author": "MissMilkerss",
            "id": "ipv3s7k",
            "parent_id": "t3_xnq0xw",
            "score": 0,
            "created_utc": 1664127217.0,
            "replies": [
                {
                    "body": "Thanks for the support babe ♡",
                    "author": "chocolatebabydoll",
                    "id": "ipv4ijs",
                    "parent_id": "t1_ipv3s7k",
                    "score": 3,
                    "created_utc": 1664127489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cool story bro.",
            "author": "storm170",
            "id": "ipupmxh",
            "parent_id": "t3_xnq0xw",
            "score": -7,
            "created_utc": 1664121550.0,
            "replies": [
                {
                    "body": "why are you patronising OP when she created this post to give useful advice to bipoc SBs… look at the new posts in this subreddit, i posted my profile review before another girl and she has already received more than 3 times the amount of feedback. we’re not mad about it, just finding ways to navigate properly so we can have a good experience too",
                    "author": null,
                    "id": "ipuqc7z",
                    "parent_id": "t1_ipupmxh",
                    "score": 5,
                    "created_utc": 1664121841.0,
                    "replies": [
                        {
                            "body": "Because her problem has very little (but not nothing) to do with her being black, and most likely everything to do with her being a stripper and bringing a hustler mentality to her interactions with POTs. Rich men don't fuck with strippers, they pay them to shake their ass and then go away.\n\nAlso, your review has fewer comments than the one above it because we aren't allowed to comment why you are struggling due to forum rules. The post above yours had problems with their text, and we can try to help with that.",
                            "author": "storm170",
                            "id": "iputooh",
                            "parent_id": "t1_ipuqc7z",
                            "score": 0,
                            "created_utc": 1664123231.0,
                            "replies": [
                                {
                                    "body": "definitely not the reason why mine has less feedback, some of the feedback on hers are just compliments too. lets not make things up, im really not mad this is just how it is. but at least support posts like OP’s so girls like us have a chance too",
                                    "author": null,
                                    "id": "ipuuttx",
                                    "parent_id": "t1_iputooh",
                                    "score": 3,
                                    "created_utc": 1664123703.0,
                                    "replies": [
                                        {
                                            "body": "And there is another white woman, who posted a profile review 1 hour before yours, that only has _3_ responses.  Yours has _12_.\n\nHow do you explain that, please?",
                                            "author": "SDstartingOut",
                                            "id": "ipv5on6",
                                            "parent_id": "t1_ipuuttx",
                                            "score": 4,
                                            "created_utc": 1664127922.0,
                                            "replies": [
                                                {
                                                    "body": "I replied to your other comment hope that clears it up",
                                                    "author": null,
                                                    "id": "ipv5x8t",
                                                    "parent_id": "t1_ipv5on6",
                                                    "score": 1,
                                                    "created_utc": 1664128007.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Way to make everything about you and racism",
                            "author": "London-SD",
                            "id": "ipuygg1",
                            "parent_id": "t1_ipuqc7z",
                            "score": -1,
                            "created_utc": 1664125184.0,
                            "replies": [
                                {
                                    "body": "you don’t even wanna hear us out… no one’s making it about racism. it’s about racial preferences and how to navigate them. not one poc in this thread has been rude or upset, just pointing things out and giving advice. this is not the right post for you to be under, take your conservativeness somewhere else",
                                    "author": null,
                                    "id": "ipuyyig",
                                    "parent_id": "t1_ipuygg1",
                                    "score": 4,
                                    "created_utc": 1664125381.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It really was babe ♡ glad you read it.",
                    "author": "chocolatebabydoll",
                    "id": "ipuqr6t",
                    "parent_id": "t1_ipupmxh",
                    "score": 3,
                    "created_utc": 1664122013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is literally geomaxxing 😂😂😂",
            "author": "MundaneRecognition2",
            "id": "ipvfumo",
            "parent_id": "t3_xnq0xw",
            "score": 0,
            "created_utc": 1664131640.0,
            "replies": []
        },
        {
            "body": "Please make sure you put in your profile your feelings on this issue so that any prospective sugar daddy knows how much time you spend thinking about this kind of stuff.",
            "author": "RTManson",
            "id": "ipup56r",
            "parent_id": "t3_xnq0xw",
            "score": -8,
            "created_utc": 1664121341.0,
            "replies": [
                {
                    "body": "Lol most daddies that are intelligent enough to date ALL types of girls as long as they're beautiful, already know how much this stuff is a problem. But if daddies can't handle the fact that as a black woman I think about all the unfair stuff that happens to me...then...they weren't gonna be my daddy anyways.",
                    "author": "chocolatebabydoll",
                    "id": "ipurnv3",
                    "parent_id": "t1_ipup56r",
                    "score": 11,
                    "created_utc": 1664122393.0,
                    "replies": []
                },
                {
                    "body": "Lol as i said, I found plenty of foreign daddies and they actually understand how fucked up Americans are",
                    "author": "chocolatebabydoll",
                    "id": "ipuqmyo",
                    "parent_id": "t1_ipup56r",
                    "score": 4,
                    "created_utc": 1664121964.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is France 🇫🇷?",
            "author": "everesr1954",
            "id": "ipuquye",
            "parent_id": "t3_xnq0xw",
            "score": 1,
            "created_utc": 1664122056.0,
            "replies": [
                {
                    "body": "France is similar to Spain, there is an even bigger African immigrant population actually since there are a lot of African/Caribbean French/creole speaking countries. So they have an idea of a lot of black people as well, but the perceptions I've had of French people in general is that they're a little cheap compared to surrounding countries/Europe. Also French people in general rub me the wrong way cause they aren't that friendly or chill like surrounding countries. I'd say Spain, Italy, Germany...and anywhere else close by might be a better bet if possible.",
                    "author": "chocolatebabydoll",
                    "id": "ipusc3b",
                    "parent_id": "t1_ipuquye",
                    "score": 1,
                    "created_utc": 1664122676.0,
                    "replies": [
                        {
                            "body": "Well said\n\nIn France Blacks people may come from Caribbean (descendant from slaves) or directly from Africa \n\nAs there never been black slavery nor segregation in mainland France then the white people mentality is very different from the US\n\nThe only blacks people that have a bad reputation are the \"jeunes de banlieues\" (youngsters from poor suburbs) but it apply to arabs too and even whites too\n\nSo a black woman that is american is welcome",
                            "author": "GuyFromParis",
                            "id": "ipv7bsq",
                            "parent_id": "t1_ipusc3b",
                            "score": 1,
                            "created_utc": 1664128521.0,
                            "replies": [
                                {
                                    "body": "Exactly! Which goes to play with the whole \"go where you are wanted\" because I would NEVER recommend an Arabic girl to do sugaring in France, giving the recent happenings and what a lot of French people think of Arabic/Muslim people from my understanding. \n\nBut Exactly. Countries with no history of black slavery -at least in the mainland- tend to have no problem with black people, especially americans",
                                    "author": "chocolatebabydoll",
                                    "id": "ipv8ww0",
                                    "parent_id": "t1_ipv7bsq",
                                    "score": 5,
                                    "created_utc": 1664129107.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "THAT is how one self-identifies as a racist. Good riddance!",
            "author": "YourSugarFather",
            "id": "ipur538",
            "parent_id": "t3_xnq0xw",
            "score": 1,
            "created_utc": 1664122175.0,
            "replies": []
        },
        {
            "body": "When I was 18 in Croatia I ran into that a lot, i got so many \"I've always wanted to be with a black girl\" \"I've always wanted to be with a black teen\" shit like that which to me is indeed nasty....but in to any guy that says that I would NEVER date them or fuck them for free lmao. If they want me only to fulfill their fantasy and to brag about it...then give me money, and for me it's THAT simple. If you wanna treat me as an experience and not a human, I'll charge you for this experience (aka pussay lmaooo). For sugar lifestyle fetishization and all sexwork -cause I do other stuff too- fetishization works in my favor because I can charge more/get spoiled more...but outside of that, I don't tolerate it...well unless it benefits me....cause I'm shallow 🤣",
            "author": "chocolatebabydoll",
            "id": "ipvjf27",
            "parent_id": "t1_ipvijg8",
            "score": 12,
            "created_utc": 1664133001.0,
            "replies": [
                {
                    "body": "Do they tend to turn into longer term relationships, or mostly short term?  (Of course, I understand there is typically a ratio of short term to find the right long term - so there will always be more short term than long term).",
                    "author": "SDstartingOut",
                    "id": "ipvkh35",
                    "parent_id": "t1_ipvjf27",
                    "score": 3,
                    "created_utc": 1664133399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think your point & OP's point are mutually exclusive of each other.\n\nI absolutely agree that Eastern Europe is far more racists than the US (or at least - the parts of the US that I have lived in).  It's a bit of a different type of racism - due to the more homogenous racial makeup of the country.  But still very deep seated racism.\n\nHowever - OP is playing to her strength in those areas.  She is a rarity / someone seen as exotic.  When I lived in Czechia (not Prague;  2nd largest city) - I think I saw a total of 2 black women on SA the entire time there.  So it's a bit more of a niche.",
            "author": "SDstartingOut",
            "id": "ipw01cy",
            "parent_id": "t1_ipvyw7r",
            "score": 5,
            "created_utc": 1664139255.0,
            "replies": []
        },
        {
            "body": "See, I didn't think about it from that perspective! That is a valid point to bring up body types! I can only speak from my perspective as a relatively small woman -I've been called petite before but idk if I'd say that- and I have troubles as a small black woman. I am curious about the other shapes and sizes of women on SA though, because I wkuld assume in general bigger girls of all races don't particularly frequent SA because generally wealthy men DO enjoy women with a fit frame...but I could see where it comes into play because in the past decade or 2 -and in the black community for years and years before- a bigger and curvy body was desirable, so maybe there are a lot of curvy black women on SA because our body types are being glorified nowadays in mainstream media and culture. However it doesn't translate to the Sugar Bowl...and it's the same for race. I am beautiful period and when I travel I get called beautiful all the time, but it doesn't translate to the sugar bowl I guess because just the demographic of white american men and their prefrences...if that makes sense. So I just learned to travel where my race is a preference or at least not a negative.",
            "author": "chocolatebabydoll",
            "id": "ipvb1jl",
            "parent_id": "t1_ipv99zf",
            "score": 5,
            "created_utc": 1664129892.0,
            "replies": [
                {
                    "body": "I have had multiple black and mixed SB’s over the years.  They are all fit and petite and they all got a bunch of crap from their own race for being “too skinny” despite being Slim Thicc or fit with curves. I think build is a bigger hurdle for WOC than race.  For SD’s,  hot is hot.  I have dated the rainbow and the one thing they had in common was their build.  Doesn’t matter if they were a blonde beach babe or dark hair and eyes from Yemen,  it’s the body type that attracts.",
                    "author": "LotBuilder",
                    "id": "ipvj1r8",
                    "parent_id": "t1_ipvb1jl",
                    "score": 9,
                    "created_utc": 1664132858.0,
                    "replies": []
                },
                {
                    "body": "But you're thinking about it different than most. Heavier girls have been getting called thicc, sexy, etc. They are used to men pumping their egos for a lay. Eventually they believe they can get paid to do it.\n\nI've seen all types and bodies in the bowl. I have no racial preference, but I hate egotistical women. Black women and Hispanic women tend to be on the larger side and that's going to turn off a lot of guys. They go on there only to wonder why guys don't want them. Then they also think they're queens, and have higher standards. I don't like dealing with that shit.\n\nYou look at it like a business, which is what I personally prefer. But I would say 75 percent of SB's I see are heavy enough to be overweight or obese.",
                    "author": "Daddy_Dom_47",
                    "id": "ipwc2g3",
                    "parent_id": "t1_ipvb1jl",
                    "score": 0,
                    "created_utc": 1664144303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And that's awesome, that's how it should be for everyone. Connection and attractiveness.  I mean I can't fault someone for having a preference, we all inherently do. But when it gets to I won't date xyz period, no matter how attractiveness they are, no matter how much we click, then it becomes weird and racist.",
            "author": "chocolatebabydoll",
            "id": "ipv4hdx",
            "parent_id": "t1_ipv3tb6",
            "score": 5,
            "created_utc": 1664127477.0,
            "replies": [
                {
                    "body": "Ugh. Just can't handle the fact that people have preferences.  Just because you consider yourself attractive doesn't mean that I will.  I prefer tall athletic Caucasian brunettes.   So have zero interest in dating you. Does NOT make me a racist, no matter what you think or believe.     It is my preference. Just because you want it to be, doesn't mean it will.  Just because you think America is racist, doesn't make it so.  Just curious,  what about all the successful black SDs?  Why aren't they into you?",
                    "author": "MainDragonfruit82",
                    "id": "ipvcxsy",
                    "parent_id": "t1_ipv4hdx",
                    "score": -2,
                    "created_utc": 1664130568.0,
                    "replies": [
                        {
                            "body": "I agreed with the first part of your first statement but when you brought in America not having a racism problem, it revealed your ignorance as a history book can easily refute your point. Or just read what people have to say all across the internet in their anonymity about black people. My dad who is mixed but mostly white heard all sorts of racists things said about black people in his presence and there are videos of white people confessing racists things they've heard other white people say about black people. Heck our first mixed race president (who isnt even called that) born in Hawaii was harassed and told to go back to Kenya.  Like cmon dude, so much evidence of a racism towards people who are black, mixed, asian, and yes white).\n\nYou are absolutely allowed to have racial preferences. I do (I just dont share them). Most people have a phenotype they prefer. I highly doubt you've versed in the internalized racism issues within the black American community (or that you want to be) so I wouldnt bring up black sds if I were you. Also, given that America is 77% white and white americans tend to have higher income than black americans, there wont be that many black sds for black sbs. No one can demand anyone be interested in them, but the OPs points are valid. Stereotypes have caused a negative perception of black women in the US. Even Asian women get the \"submissive sex doll\" fetish too.",
                            "author": "UniqueSkinnyXFigure",
                            "id": "ipwe73g",
                            "parent_id": "t1_ipvcxsy",
                            "score": 9,
                            "created_utc": 1664145246.0,
                            "replies": [
                                {
                                    "body": "Racism can be examined and evaluated on many levels.   I have three masters degrees and one is history.  One man's view of racism is not always accurate.   Not saying that we have had racial  issues but in last 50 or so years since LBJ was President,  racism has been perpetrated by a sect of society who used it for political purposes. \n\nI can site dozens of examples. So whether you agree or disagree, racism is not significantly prevalent except for some who profit from it",
                                    "author": "MainDragonfruit82",
                                    "id": "ipwg4rw",
                                    "parent_id": "t1_ipwe73g",
                                    "score": 0,
                                    "created_utc": 1664146102.0,
                                    "replies": []
                                },
                                {
                                    "body": "I had responded,  but not sure it posted.  As I said, one man's view of racism is not necessarily viewed the same by others.  I am a student of history with a masters in the subject and two other masters degrees focused on my career. \n\nUnfortunately your views are naive. Sorry.   While there will always be racism....as it us human nature....to label it as purely American shows limited knowledge of the world.    Since just before LBJ was President,  racism was focused on forcing segments of society to engage and integrate.  People were also being shamed.  Then welfare reform was passed which institutionalized the perception of a segment of society.  It also enabled certain people and groups to use \"racism\" as a tool for specific political objectives.   It did not help or improve.\nToday most in this country do not care about racism as it is mostly non existent.  It is manufactured by those seeking to benefit and profit.   Sorry if you disagree, but I can provide reams of examples.  Even Obama used racism to get elected.  He is the perfect example of incompetence being promoted to make certain groups feel good about themselves.   He though, Injected himself into racial issues....mostly on the wrong side.  He is a class a race baiter.  Again, no worries if you disagree.    Unfortunately for those who claim rampant racism,the facts just don't support it.",
                                    "author": "MainDragonfruit82",
                                    "id": "ipwjro7",
                                    "parent_id": "t1_ipwe73g",
                                    "score": -1,
                                    "created_utc": 1664147725.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "...just cause you dont want america to be racist doesn't mean it isn't. You sound SILLY. America has racism in its roots, have you been to history class baby? To say america isnt racist is ignorant and stupid even. Also if a tall, athletic, black woman with brown hair was to meet you, and she had the perfect personality, and you think \"she is perfect BUT she is black that's the only problem\" then youre racist. I already stated I understand people have preferences, and that's fine, but when it gets to the point you won't choose someone ONLY cause their race, then it becomes a problem...what don't you understand hunny? I am beautiful period. I get plenty of compliments outside the US, it's just the US is racist. As for black sugar daddy's, most black men that are sugar daddies know that white women are a standard of beauty and a symbol of status, that is why you see a lot of wealthy black men with white women, it's still a result of racism and coonery if I'm frank. The other half of black men with money -sports, music, pop culture- tend to go with racially ambiguous women or white, which is why you see racially ambiguous and white women as basketball wives and football wives etc. Even in the black community there is colorism, which is preferring lighter skins over darker skin black people. Racism and colonialism really did a number on america and Americans-including black americans-. For you to say I don't understand preference is ignorant. I prefer european white men because they tend to treat me like a princess and are very generous towards me, HOWEVER, if I met a black man that did treat me the same, or an American white man that treated me the same, I would never say \"no because they are american\" \"no they are black\"",
                            "author": "chocolatebabydoll",
                            "id": "ipvg4eq",
                            "parent_id": "t1_ipvcxsy",
                            "score": 14,
                            "created_utc": 1664131742.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "ipvlon6",
                                    "parent_id": "t1_ipvg4eq",
                                    "score": -5,
                                    "created_utc": 1664133851.0,
                                    "replies": [
                                        {
                                            "body": "Not finding BW desirable isn’t inherently racist. However, when you start to shift the blame and are unable to answer the question of “Why not?” without saying “well… because they’re disagreeable, difficult, demanding, uncouth, and money hungry” without considering that 1) your perception of black women probably isn’t the most informed if you aren’t engaging with them on a regular basis \nOr 2) critically thinking about how things got that way … it’s pretty suspect.\n\nMost racists will claim that they aren’t, and that the system isn’t racist (if you’d like actual literature on the history of America’s systemic racism – more than happy to share.) But when you ask them why they think black women behave and move through the world in the way they do the answer is always: Well, because they’re black.\n\nAnd that, my friend, is racist😁",
                                            "author": "naecest",
                                            "id": "ipvykb2",
                                            "parent_id": "t1_ipvlon6",
                                            "score": 4,
                                            "created_utc": 1664138673.0,
                                            "replies": [
                                                {
                                                    "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
                                                    "author": "MainDragonfruit82",
                                                    "id": "ipwce0n",
                                                    "parent_id": "t1_ipvykb2",
                                                    "score": -3,
                                                    "created_utc": 1664144444.0,
                                                    "replies": [
                                                        {
                                                            "body": "Pissed",
                                                            "author": "MainDragonfruit82",
                                                            "id": "ipwcfvp",
                                                            "parent_id": "t1_ipwce0n",
                                                            "score": 0,
                                                            "created_utc": 1664144466.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
                                                    "author": "MainDragonfruit82",
                                                    "id": "ipwbo7j",
                                                    "parent_id": "t1_ipvykb2",
                                                    "score": -3,
                                                    "created_utc": 1664144128.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You sound super slow nobody care about what your saying my guy",
                            "author": "Successful_Ad_5027",
                            "id": "ipw6zor",
                            "parent_id": "t1_ipvcxsy",
                            "score": -1,
                            "created_utc": 1664142108.0,
                            "replies": [
                                {
                                    "body": "When you learn to write and speak proper English,  feel free to message me back.  Until then, please don't waste my time",
                                    "author": "MainDragonfruit82",
                                    "id": "ipwbwc9",
                                    "parent_id": "t1_ipw6zor",
                                    "score": 2,
                                    "created_utc": 1664144227.0,
                                    "replies": [
                                        {
                                            "body": "You must be real sore with that sick in your ass 24/7 go grown up and get a life",
                                            "author": "Successful_Ad_5027",
                                            "id": "ipwc2sk",
                                            "parent_id": "t1_ipwbwc9",
                                            "score": 1,
                                            "created_utc": 1664144307.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "You sound like a muncher",
                                            "author": "Successful_Ad_5027",
                                            "id": "ipwc4xv",
                                            "parent_id": "t1_ipwbwc9",
                                            "score": 0,
                                            "created_utc": 1664144334.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ve met a few black gals lately that were so amazing… beautiful and so spiritually in tune… can’t find a decent spiritual white girl to save my life and that’s ok because all faiths started in SOuth Afrika so I am so honored that they are sharing with me 😎",
                    "author": null,
                    "id": "ipv4zwx",
                    "parent_id": "t1_ipv4hdx",
                    "score": 1,
                    "created_utc": 1664127668.0,
                    "replies": [
                        {
                            "body": "What do you mean all faiths started in South africa?",
                            "author": "chocolatebabydoll",
                            "id": "ipv6lu3",
                            "parent_id": "t1_ipv4zwx",
                            "score": 1,
                            "created_utc": 1664128254.0,
                            "replies": [
                                {
                                    "body": "Send DM",
                                    "author": null,
                                    "id": "ipvr3vn",
                                    "parent_id": "t1_ipv6lu3",
                                    "score": 0,
                                    "created_utc": 1664135860.0,
                                    "replies": []
                                },
                                {
                                    "body": "The oldest practice of faith on the planet was IFA and it was used by South Afrikaans and Egyptians … Ancient Egypt Kings and Queens were Black !",
                                    "author": null,
                                    "id": "ipv6zha",
                                    "parent_id": "t1_ipv6lu3",
                                    "score": -2,
                                    "created_utc": 1664128395.0,
                                    "replies": [
                                        {
                                            "body": "?? Pharaons kings werent black it is just an urban legend",
                                            "author": "GuyFromParis",
                                            "id": "ipv9eha",
                                            "parent_id": "t1_ipv6zha",
                                            "score": 7,
                                            "created_utc": 1664129284.0,
                                            "replies": [
                                                {
                                                    "body": "Sounds good 👌🏼",
                                                    "author": null,
                                                    "id": "ipvb6wf",
                                                    "parent_id": "t1_ipv9eha",
                                                    "score": 0,
                                                    "created_utc": 1664129945.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Where are you getting your information?  You are so wrong.......",
                                            "author": "MainDragonfruit82",
                                            "id": "ipvd490",
                                            "parent_id": "t1_ipv6zha",
                                            "score": 3,
                                            "created_utc": 1664130632.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! Exactly...but ngl I will.sugar with someone that has a fetish cause shiddddd his dollars still spend. And we are 2 consenting adults, I understand he is just a sugar daddy so tbh idc if he fetishizes me cause he isn't really my partner. If I don't take it, someone else will.",
            "author": "chocolatebabydoll",
            "id": "ipuvym4",
            "parent_id": "t1_ipuv28r",
            "score": 3,
            "created_utc": 1664124164.0,
            "replies": [
                {
                    "body": "I get that, so would I tbh but ‘race play’ is where I draw the line lol",
                    "author": "D2boujee",
                    "id": "ipuw7by",
                    "parent_id": "t1_ipuvym4",
                    "score": 4,
                    "created_utc": 1664124261.0,
                    "replies": [
                        {
                            "body": "Understandable. I feel like that's more in the BDSM scene anyways, so one would have to be into bdsm in the first place to allow that. I would never tolerate negative race play, because for me that's just a boundary, but if you call me your \"black goddess\" I'll probably cringe, cry, and shit myself, but it wouldn't be a deal breaker, I'd just count downt the seconds till I can leave with my rent money 😭. And then if they are just using black as a description I also don't mind lmao. like \"your little black pussy\" or some shit...I'm just like well yea, it is a little pussy and it is indeed black. If they KEEP saying it multiple times and for EVERYTHING, then i get a bit uncomfortable like...ok i get it IM BLACK and you like that like...ok bro. But I am into the kink scene so I'm a bit freaky deaky.",
                            "author": "chocolatebabydoll",
                            "id": "ipuy83d",
                            "parent_id": "t1_ipuw7by",
                            "score": 1,
                            "created_utc": 1664125090.0,
                            "replies": [
                                {
                                    "body": "Yeah I don’t mind the black this and that stuff during intimacy. I’d probably say it back to him and fulfill the fantasy: “How much do you love this black pussy”? etc but when it starts to get degrading I would want to call it quits since it’s such a turn off and my kink is more of a praise, sub kink - so the complete opposite.\nUnless he’s offering like a significantly big allowance, I’d consider it. But at the same time I don’t want to feel like I’m just an object and black f*ck toy to him.",
                                    "author": "D2boujee",
                                    "id": "ipv03wq",
                                    "parent_id": "t1_ipuy83d",
                                    "score": 4,
                                    "created_utc": 1664125832.0,
                                    "replies": [
                                        {
                                            "body": "Exactly, a girl that gets it. But I'm a sub so it works out in my favor lmao. Right but the price point is the key 🔑",
                                            "author": "chocolatebabydoll",
                                            "id": "ipv18fq",
                                            "parent_id": "t1_ipv03wq",
                                            "score": 1,
                                            "created_utc": 1664126267.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And there was a white girl that posted a profile review an HOUR before your post, and you have more responses (on your thread) than she does.\n\nhttps://www.reddit.com/r/sugarlifestyleforum/comments/xno77n/any_advice_is_welcomed/\n\nNot every single thing is about race.",
            "author": "SDstartingOut",
            "id": "ipv5d06",
            "parent_id": "t1_ipumaqg",
            "score": 8,
            "created_utc": 1664127803.0,
            "replies": [
                {
                    "body": "her face wasn’t the focal point of her post. i saw that post and didn’t even know she was white. at first glance I thought she was poc and she clearly takes influence from poc. please stop trying to find little loopholes. you don’t know my experience simply just scroll away this post isn’t for you",
                    "author": null,
                    "id": "ipv5tvm",
                    "parent_id": "t1_ipv5d06",
                    "score": -2,
                    "created_utc": 1664127974.0,
                    "replies": [
                        {
                            "body": "> her face wasn’t the focal point of her post\n\nSorry, not sure what face means?\n\nAnyway, you posted this very clearly.  You said:\n\n> why does the yt girl who posted a profile review after me already have feedback but I don’t \n\nAnd I'm pointing out to you, that you got MORE feedback, then a different white girl, that posted an hour before you",
                            "author": "SDstartingOut",
                            "id": "ipv7bve",
                            "parent_id": "t1_ipv5tvm",
                            "score": 6,
                            "created_utc": 1664128521.0,
                            "replies": [
                                {
                                    "body": "what do you mean you don’t know what face means? i provided a simple explanation, don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes looking directly into the camera",
                                    "author": null,
                                    "id": "ipv7y69",
                                    "parent_id": "t1_ipv7bve",
                                    "score": -2,
                                    "created_utc": 1664128752.0,
                                    "replies": [
                                        {
                                            "body": "> what do you mean you don’t know what face means? \n\nI wasn't sure if it was a typo for you saying \"race\".  I genuinely (until you made this comment) did not understand what you were saying.   None of it clicked (what you said in your initial post), because that's not at all how I see her profile.  I don't even know what this means:\n\n> and she clearly takes influence from poc.\n\nHow?  What about her looks like its influenced from POC?  \n\n> don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes\n\nI don't think there is anything racially ambiguous about the profile.    Agree to disagree.  And it also clearly says \"white\" on the profile, which you can't miss if you click on it.",
                                            "author": "SDstartingOut",
                                            "id": "ipvm1wo",
                                            "parent_id": "t1_ipv7y69",
                                            "score": 4,
                                            "created_utc": 1664133989.0,
                                            "replies": [
                                                {
                                                    "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
                                                    "author": null,
                                                    "id": "ipvmta6",
                                                    "parent_id": "t1_ipvm1wo",
                                                    "score": 0,
                                                    "created_utc": 1664134272.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"the yt\" - is that supposed to read as \"the whitey\"?",
            "author": null,
            "id": "ipuu14f",
            "parent_id": "t1_ipumaqg",
            "score": 3,
            "created_utc": 1664123375.0,
            "replies": [
                {
                    "body": "Yt- white",
                    "author": "MissCannabunny",
                    "id": "ipuywlg",
                    "parent_id": "t1_ipuu14f",
                    "score": 5,
                    "created_utc": 1664125359.0,
                    "replies": []
                },
                {
                    "body": "personally I read it as white so “white girl”. never heard of whitey but what are you insinuating?",
                    "author": null,
                    "id": "ipuu7t5",
                    "parent_id": "t1_ipuu14f",
                    "score": -1,
                    "created_utc": 1664123452.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly. Like certain areas just aren't for us...and for me it's almost the whole country of USA. I mean I finally have somewhat come to terms with it being supply and demand. Like go where you're wanted, it's that simple. Also yea, this forum is a correct depiction of the US sugar lifestyle, lot of conservative yt people that can't stand to even imagine that america isn't fair, and can't even imagine a person of coloras pretty or prettier as their preference, and these comment will definitely show that lmao.",
            "author": "chocolatebabydoll",
            "id": "ipurdo7",
            "parent_id": "t1_ipumaqg",
            "score": -1,
            "created_utc": 1664122274.0,
            "replies": [
                {
                    "body": "i hear you! omg. good thing is we thrive in a lot of places too! you’re totally spot on about being seen as “exotic”. as much as I hate it in the regular dating scene, I love it in sugar dating because I feel like I’m providing more by offering a new experience to the SD! \n\nalso im quite shocked that I didn’t receive more feedback. maybe it’s just this subreddit but I’ve always been considered and consider myself as attractive or above average even if I do take shitty pictures",
                    "author": null,
                    "id": "ipus78n",
                    "parent_id": "t1_ipurdo7",
                    "score": 3,
                    "created_utc": 1664122618.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "False ones are insulting, however there are people who are actually racist and other stuff. I wouldn't ever accuse someone that is talking to me of that...unless I had a reason..but shit, I really don't give a fuck if someone fetishizes me if I'm getting their money...like that's more for me if I am your fantasy, right? But odd experience if he said that out of nowhere.",
            "author": "chocolatebabydoll",
            "id": "ipuw9mz",
            "parent_id": "t1_ipuv33h",
            "score": 0,
            "created_utc": 1664124288.0,
            "replies": []
        },
        {
            "body": "Thanks for the support babe ♡",
            "author": "chocolatebabydoll",
            "id": "ipv4ijs",
            "parent_id": "t1_ipv3s7k",
            "score": 3,
            "created_utc": 1664127489.0,
            "replies": []
        },
        {
            "body": "why are you patronising OP when she created this post to give useful advice to bipoc SBs… look at the new posts in this subreddit, i posted my profile review before another girl and she has already received more than 3 times the amount of feedback. we’re not mad about it, just finding ways to navigate properly so we can have a good experience too",
            "author": null,
            "id": "ipuqc7z",
            "parent_id": "t1_ipupmxh",
            "score": 5,
            "created_utc": 1664121841.0,
            "replies": [
                {
                    "body": "Because her problem has very little (but not nothing) to do with her being black, and most likely everything to do with her being a stripper and bringing a hustler mentality to her interactions with POTs. Rich men don't fuck with strippers, they pay them to shake their ass and then go away.\n\nAlso, your review has fewer comments than the one above it because we aren't allowed to comment why you are struggling due to forum rules. The post above yours had problems with their text, and we can try to help with that.",
                    "author": "storm170",
                    "id": "iputooh",
                    "parent_id": "t1_ipuqc7z",
                    "score": 0,
                    "created_utc": 1664123231.0,
                    "replies": [
                        {
                            "body": "definitely not the reason why mine has less feedback, some of the feedback on hers are just compliments too. lets not make things up, im really not mad this is just how it is. but at least support posts like OP’s so girls like us have a chance too",
                            "author": null,
                            "id": "ipuuttx",
                            "parent_id": "t1_iputooh",
                            "score": 3,
                            "created_utc": 1664123703.0,
                            "replies": [
                                {
                                    "body": "And there is another white woman, who posted a profile review 1 hour before yours, that only has _3_ responses.  Yours has _12_.\n\nHow do you explain that, please?",
                                    "author": "SDstartingOut",
                                    "id": "ipv5on6",
                                    "parent_id": "t1_ipuuttx",
                                    "score": 4,
                                    "created_utc": 1664127922.0,
                                    "replies": [
                                        {
                                            "body": "I replied to your other comment hope that clears it up",
                                            "author": null,
                                            "id": "ipv5x8t",
                                            "parent_id": "t1_ipv5on6",
                                            "score": 1,
                                            "created_utc": 1664128007.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Way to make everything about you and racism",
                    "author": "London-SD",
                    "id": "ipuygg1",
                    "parent_id": "t1_ipuqc7z",
                    "score": -1,
                    "created_utc": 1664125184.0,
                    "replies": [
                        {
                            "body": "you don’t even wanna hear us out… no one’s making it about racism. it’s about racial preferences and how to navigate them. not one poc in this thread has been rude or upset, just pointing things out and giving advice. this is not the right post for you to be under, take your conservativeness somewhere else",
                            "author": null,
                            "id": "ipuyyig",
                            "parent_id": "t1_ipuygg1",
                            "score": 4,
                            "created_utc": 1664125381.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It really was babe ♡ glad you read it.",
            "author": "chocolatebabydoll",
            "id": "ipuqr6t",
            "parent_id": "t1_ipupmxh",
            "score": 3,
            "created_utc": 1664122013.0,
            "replies": []
        },
        {
            "body": "Lol most daddies that are intelligent enough to date ALL types of girls as long as they're beautiful, already know how much this stuff is a problem. But if daddies can't handle the fact that as a black woman I think about all the unfair stuff that happens to me...then...they weren't gonna be my daddy anyways.",
            "author": "chocolatebabydoll",
            "id": "ipurnv3",
            "parent_id": "t1_ipup56r",
            "score": 11,
            "created_utc": 1664122393.0,
            "replies": []
        },
        {
            "body": "Lol as i said, I found plenty of foreign daddies and they actually understand how fucked up Americans are",
            "author": "chocolatebabydoll",
            "id": "ipuqmyo",
            "parent_id": "t1_ipup56r",
            "score": 4,
            "created_utc": 1664121964.0,
            "replies": []
        },
        {
            "body": "France is similar to Spain, there is an even bigger African immigrant population actually since there are a lot of African/Caribbean French/creole speaking countries. So they have an idea of a lot of black people as well, but the perceptions I've had of French people in general is that they're a little cheap compared to surrounding countries/Europe. Also French people in general rub me the wrong way cause they aren't that friendly or chill like surrounding countries. I'd say Spain, Italy, Germany...and anywhere else close by might be a better bet if possible.",
            "author": "chocolatebabydoll",
            "id": "ipusc3b",
            "parent_id": "t1_ipuquye",
            "score": 1,
            "created_utc": 1664122676.0,
            "replies": [
                {
                    "body": "Well said\n\nIn France Blacks people may come from Caribbean (descendant from slaves) or directly from Africa \n\nAs there never been black slavery nor segregation in mainland France then the white people mentality is very different from the US\n\nThe only blacks people that have a bad reputation are the \"jeunes de banlieues\" (youngsters from poor suburbs) but it apply to arabs too and even whites too\n\nSo a black woman that is american is welcome",
                    "author": "GuyFromParis",
                    "id": "ipv7bsq",
                    "parent_id": "t1_ipusc3b",
                    "score": 1,
                    "created_utc": 1664128521.0,
                    "replies": [
                        {
                            "body": "Exactly! Which goes to play with the whole \"go where you are wanted\" because I would NEVER recommend an Arabic girl to do sugaring in France, giving the recent happenings and what a lot of French people think of Arabic/Muslim people from my understanding. \n\nBut Exactly. Countries with no history of black slavery -at least in the mainland- tend to have no problem with black people, especially americans",
                            "author": "chocolatebabydoll",
                            "id": "ipv8ww0",
                            "parent_id": "t1_ipv7bsq",
                            "score": 5,
                            "created_utc": 1664129107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do they tend to turn into longer term relationships, or mostly short term?  (Of course, I understand there is typically a ratio of short term to find the right long term - so there will always be more short term than long term).",
            "author": "SDstartingOut",
            "id": "ipvkh35",
            "parent_id": "t1_ipvjf27",
            "score": 3,
            "created_utc": 1664133399.0,
            "replies": []
        },
        {
            "body": "I have had multiple black and mixed SB’s over the years.  They are all fit and petite and they all got a bunch of crap from their own race for being “too skinny” despite being Slim Thicc or fit with curves. I think build is a bigger hurdle for WOC than race.  For SD’s,  hot is hot.  I have dated the rainbow and the one thing they had in common was their build.  Doesn’t matter if they were a blonde beach babe or dark hair and eyes from Yemen,  it’s the body type that attracts.",
            "author": "LotBuilder",
            "id": "ipvj1r8",
            "parent_id": "t1_ipvb1jl",
            "score": 9,
            "created_utc": 1664132858.0,
            "replies": []
        },
        {
            "body": "But you're thinking about it different than most. Heavier girls have been getting called thicc, sexy, etc. They are used to men pumping their egos for a lay. Eventually they believe they can get paid to do it.\n\nI've seen all types and bodies in the bowl. I have no racial preference, but I hate egotistical women. Black women and Hispanic women tend to be on the larger side and that's going to turn off a lot of guys. They go on there only to wonder why guys don't want them. Then they also think they're queens, and have higher standards. I don't like dealing with that shit.\n\nYou look at it like a business, which is what I personally prefer. But I would say 75 percent of SB's I see are heavy enough to be overweight or obese.",
            "author": "Daddy_Dom_47",
            "id": "ipwc2g3",
            "parent_id": "t1_ipvb1jl",
            "score": 0,
            "created_utc": 1664144303.0,
            "replies": []
        },
        {
            "body": "Ugh. Just can't handle the fact that people have preferences.  Just because you consider yourself attractive doesn't mean that I will.  I prefer tall athletic Caucasian brunettes.   So have zero interest in dating you. Does NOT make me a racist, no matter what you think or believe.     It is my preference. Just because you want it to be, doesn't mean it will.  Just because you think America is racist, doesn't make it so.  Just curious,  what about all the successful black SDs?  Why aren't they into you?",
            "author": "MainDragonfruit82",
            "id": "ipvcxsy",
            "parent_id": "t1_ipv4hdx",
            "score": -2,
            "created_utc": 1664130568.0,
            "replies": [
                {
                    "body": "I agreed with the first part of your first statement but when you brought in America not having a racism problem, it revealed your ignorance as a history book can easily refute your point. Or just read what people have to say all across the internet in their anonymity about black people. My dad who is mixed but mostly white heard all sorts of racists things said about black people in his presence and there are videos of white people confessing racists things they've heard other white people say about black people. Heck our first mixed race president (who isnt even called that) born in Hawaii was harassed and told to go back to Kenya.  Like cmon dude, so much evidence of a racism towards people who are black, mixed, asian, and yes white).\n\nYou are absolutely allowed to have racial preferences. I do (I just dont share them). Most people have a phenotype they prefer. I highly doubt you've versed in the internalized racism issues within the black American community (or that you want to be) so I wouldnt bring up black sds if I were you. Also, given that America is 77% white and white americans tend to have higher income than black americans, there wont be that many black sds for black sbs. No one can demand anyone be interested in them, but the OPs points are valid. Stereotypes have caused a negative perception of black women in the US. Even Asian women get the \"submissive sex doll\" fetish too.",
                    "author": "UniqueSkinnyXFigure",
                    "id": "ipwe73g",
                    "parent_id": "t1_ipvcxsy",
                    "score": 9,
                    "created_utc": 1664145246.0,
                    "replies": [
                        {
                            "body": "Racism can be examined and evaluated on many levels.   I have three masters degrees and one is history.  One man's view of racism is not always accurate.   Not saying that we have had racial  issues but in last 50 or so years since LBJ was President,  racism has been perpetrated by a sect of society who used it for political purposes. \n\nI can site dozens of examples. So whether you agree or disagree, racism is not significantly prevalent except for some who profit from it",
                            "author": "MainDragonfruit82",
                            "id": "ipwg4rw",
                            "parent_id": "t1_ipwe73g",
                            "score": 0,
                            "created_utc": 1664146102.0,
                            "replies": []
                        },
                        {
                            "body": "I had responded,  but not sure it posted.  As I said, one man's view of racism is not necessarily viewed the same by others.  I am a student of history with a masters in the subject and two other masters degrees focused on my career. \n\nUnfortunately your views are naive. Sorry.   While there will always be racism....as it us human nature....to label it as purely American shows limited knowledge of the world.    Since just before LBJ was President,  racism was focused on forcing segments of society to engage and integrate.  People were also being shamed.  Then welfare reform was passed which institutionalized the perception of a segment of society.  It also enabled certain people and groups to use \"racism\" as a tool for specific political objectives.   It did not help or improve.\nToday most in this country do not care about racism as it is mostly non existent.  It is manufactured by those seeking to benefit and profit.   Sorry if you disagree, but I can provide reams of examples.  Even Obama used racism to get elected.  He is the perfect example of incompetence being promoted to make certain groups feel good about themselves.   He though, Injected himself into racial issues....mostly on the wrong side.  He is a class a race baiter.  Again, no worries if you disagree.    Unfortunately for those who claim rampant racism,the facts just don't support it.",
                            "author": "MainDragonfruit82",
                            "id": "ipwjro7",
                            "parent_id": "t1_ipwe73g",
                            "score": -1,
                            "created_utc": 1664147725.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "...just cause you dont want america to be racist doesn't mean it isn't. You sound SILLY. America has racism in its roots, have you been to history class baby? To say america isnt racist is ignorant and stupid even. Also if a tall, athletic, black woman with brown hair was to meet you, and she had the perfect personality, and you think \"she is perfect BUT she is black that's the only problem\" then youre racist. I already stated I understand people have preferences, and that's fine, but when it gets to the point you won't choose someone ONLY cause their race, then it becomes a problem...what don't you understand hunny? I am beautiful period. I get plenty of compliments outside the US, it's just the US is racist. As for black sugar daddy's, most black men that are sugar daddies know that white women are a standard of beauty and a symbol of status, that is why you see a lot of wealthy black men with white women, it's still a result of racism and coonery if I'm frank. The other half of black men with money -sports, music, pop culture- tend to go with racially ambiguous women or white, which is why you see racially ambiguous and white women as basketball wives and football wives etc. Even in the black community there is colorism, which is preferring lighter skins over darker skin black people. Racism and colonialism really did a number on america and Americans-including black americans-. For you to say I don't understand preference is ignorant. I prefer european white men because they tend to treat me like a princess and are very generous towards me, HOWEVER, if I met a black man that did treat me the same, or an American white man that treated me the same, I would never say \"no because they are american\" \"no they are black\"",
                    "author": "chocolatebabydoll",
                    "id": "ipvg4eq",
                    "parent_id": "t1_ipvcxsy",
                    "score": 14,
                    "created_utc": 1664131742.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "ipvlon6",
                            "parent_id": "t1_ipvg4eq",
                            "score": -5,
                            "created_utc": 1664133851.0,
                            "replies": [
                                {
                                    "body": "Not finding BW desirable isn’t inherently racist. However, when you start to shift the blame and are unable to answer the question of “Why not?” without saying “well… because they’re disagreeable, difficult, demanding, uncouth, and money hungry” without considering that 1) your perception of black women probably isn’t the most informed if you aren’t engaging with them on a regular basis \nOr 2) critically thinking about how things got that way … it’s pretty suspect.\n\nMost racists will claim that they aren’t, and that the system isn’t racist (if you’d like actual literature on the history of America’s systemic racism – more than happy to share.) But when you ask them why they think black women behave and move through the world in the way they do the answer is always: Well, because they’re black.\n\nAnd that, my friend, is racist😁",
                                    "author": "naecest",
                                    "id": "ipvykb2",
                                    "parent_id": "t1_ipvlon6",
                                    "score": 4,
                                    "created_utc": 1664138673.0,
                                    "replies": [
                                        {
                                            "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
                                            "author": "MainDragonfruit82",
                                            "id": "ipwce0n",
                                            "parent_id": "t1_ipvykb2",
                                            "score": -3,
                                            "created_utc": 1664144444.0,
                                            "replies": [
                                                {
                                                    "body": "Pissed",
                                                    "author": "MainDragonfruit82",
                                                    "id": "ipwcfvp",
                                                    "parent_id": "t1_ipwce0n",
                                                    "score": 0,
                                                    "created_utc": 1664144466.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
                                            "author": "MainDragonfruit82",
                                            "id": "ipwbo7j",
                                            "parent_id": "t1_ipvykb2",
                                            "score": -3,
                                            "created_utc": 1664144128.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You sound super slow nobody care about what your saying my guy",
                    "author": "Successful_Ad_5027",
                    "id": "ipw6zor",
                    "parent_id": "t1_ipvcxsy",
                    "score": -1,
                    "created_utc": 1664142108.0,
                    "replies": [
                        {
                            "body": "When you learn to write and speak proper English,  feel free to message me back.  Until then, please don't waste my time",
                            "author": "MainDragonfruit82",
                            "id": "ipwbwc9",
                            "parent_id": "t1_ipw6zor",
                            "score": 2,
                            "created_utc": 1664144227.0,
                            "replies": [
                                {
                                    "body": "You must be real sore with that sick in your ass 24/7 go grown up and get a life",
                                    "author": "Successful_Ad_5027",
                                    "id": "ipwc2sk",
                                    "parent_id": "t1_ipwbwc9",
                                    "score": 1,
                                    "created_utc": 1664144307.0,
                                    "replies": []
                                },
                                {
                                    "body": "You sound like a muncher",
                                    "author": "Successful_Ad_5027",
                                    "id": "ipwc4xv",
                                    "parent_id": "t1_ipwbwc9",
                                    "score": 0,
                                    "created_utc": 1664144334.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve met a few black gals lately that were so amazing… beautiful and so spiritually in tune… can’t find a decent spiritual white girl to save my life and that’s ok because all faiths started in SOuth Afrika so I am so honored that they are sharing with me 😎",
            "author": null,
            "id": "ipv4zwx",
            "parent_id": "t1_ipv4hdx",
            "score": 1,
            "created_utc": 1664127668.0,
            "replies": [
                {
                    "body": "What do you mean all faiths started in South africa?",
                    "author": "chocolatebabydoll",
                    "id": "ipv6lu3",
                    "parent_id": "t1_ipv4zwx",
                    "score": 1,
                    "created_utc": 1664128254.0,
                    "replies": [
                        {
                            "body": "Send DM",
                            "author": null,
                            "id": "ipvr3vn",
                            "parent_id": "t1_ipv6lu3",
                            "score": 0,
                            "created_utc": 1664135860.0,
                            "replies": []
                        },
                        {
                            "body": "The oldest practice of faith on the planet was IFA and it was used by South Afrikaans and Egyptians … Ancient Egypt Kings and Queens were Black !",
                            "author": null,
                            "id": "ipv6zha",
                            "parent_id": "t1_ipv6lu3",
                            "score": -2,
                            "created_utc": 1664128395.0,
                            "replies": [
                                {
                                    "body": "?? Pharaons kings werent black it is just an urban legend",
                                    "author": "GuyFromParis",
                                    "id": "ipv9eha",
                                    "parent_id": "t1_ipv6zha",
                                    "score": 7,
                                    "created_utc": 1664129284.0,
                                    "replies": [
                                        {
                                            "body": "Sounds good 👌🏼",
                                            "author": null,
                                            "id": "ipvb6wf",
                                            "parent_id": "t1_ipv9eha",
                                            "score": 0,
                                            "created_utc": 1664129945.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Where are you getting your information?  You are so wrong.......",
                                    "author": "MainDragonfruit82",
                                    "id": "ipvd490",
                                    "parent_id": "t1_ipv6zha",
                                    "score": 3,
                                    "created_utc": 1664130632.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get that, so would I tbh but ‘race play’ is where I draw the line lol",
            "author": "D2boujee",
            "id": "ipuw7by",
            "parent_id": "t1_ipuvym4",
            "score": 4,
            "created_utc": 1664124261.0,
            "replies": [
                {
                    "body": "Understandable. I feel like that's more in the BDSM scene anyways, so one would have to be into bdsm in the first place to allow that. I would never tolerate negative race play, because for me that's just a boundary, but if you call me your \"black goddess\" I'll probably cringe, cry, and shit myself, but it wouldn't be a deal breaker, I'd just count downt the seconds till I can leave with my rent money 😭. And then if they are just using black as a description I also don't mind lmao. like \"your little black pussy\" or some shit...I'm just like well yea, it is a little pussy and it is indeed black. If they KEEP saying it multiple times and for EVERYTHING, then i get a bit uncomfortable like...ok i get it IM BLACK and you like that like...ok bro. But I am into the kink scene so I'm a bit freaky deaky.",
                    "author": "chocolatebabydoll",
                    "id": "ipuy83d",
                    "parent_id": "t1_ipuw7by",
                    "score": 1,
                    "created_utc": 1664125090.0,
                    "replies": [
                        {
                            "body": "Yeah I don’t mind the black this and that stuff during intimacy. I’d probably say it back to him and fulfill the fantasy: “How much do you love this black pussy”? etc but when it starts to get degrading I would want to call it quits since it’s such a turn off and my kink is more of a praise, sub kink - so the complete opposite.\nUnless he’s offering like a significantly big allowance, I’d consider it. But at the same time I don’t want to feel like I’m just an object and black f*ck toy to him.",
                            "author": "D2boujee",
                            "id": "ipv03wq",
                            "parent_id": "t1_ipuy83d",
                            "score": 4,
                            "created_utc": 1664125832.0,
                            "replies": [
                                {
                                    "body": "Exactly, a girl that gets it. But I'm a sub so it works out in my favor lmao. Right but the price point is the key 🔑",
                                    "author": "chocolatebabydoll",
                                    "id": "ipv18fq",
                                    "parent_id": "t1_ipv03wq",
                                    "score": 1,
                                    "created_utc": 1664126267.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "her face wasn’t the focal point of her post. i saw that post and didn’t even know she was white. at first glance I thought she was poc and she clearly takes influence from poc. please stop trying to find little loopholes. you don’t know my experience simply just scroll away this post isn’t for you",
            "author": null,
            "id": "ipv5tvm",
            "parent_id": "t1_ipv5d06",
            "score": -2,
            "created_utc": 1664127974.0,
            "replies": [
                {
                    "body": "> her face wasn’t the focal point of her post\n\nSorry, not sure what face means?\n\nAnyway, you posted this very clearly.  You said:\n\n> why does the yt girl who posted a profile review after me already have feedback but I don’t \n\nAnd I'm pointing out to you, that you got MORE feedback, then a different white girl, that posted an hour before you",
                    "author": "SDstartingOut",
                    "id": "ipv7bve",
                    "parent_id": "t1_ipv5tvm",
                    "score": 6,
                    "created_utc": 1664128521.0,
                    "replies": [
                        {
                            "body": "what do you mean you don’t know what face means? i provided a simple explanation, don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes looking directly into the camera",
                            "author": null,
                            "id": "ipv7y69",
                            "parent_id": "t1_ipv7bve",
                            "score": -2,
                            "created_utc": 1664128752.0,
                            "replies": [
                                {
                                    "body": "> what do you mean you don’t know what face means? \n\nI wasn't sure if it was a typo for you saying \"race\".  I genuinely (until you made this comment) did not understand what you were saying.   None of it clicked (what you said in your initial post), because that's not at all how I see her profile.  I don't even know what this means:\n\n> and she clearly takes influence from poc.\n\nHow?  What about her looks like its influenced from POC?  \n\n> don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes\n\nI don't think there is anything racially ambiguous about the profile.    Agree to disagree.  And it also clearly says \"white\" on the profile, which you can't miss if you click on it.",
                                    "author": "SDstartingOut",
                                    "id": "ipvm1wo",
                                    "parent_id": "t1_ipv7y69",
                                    "score": 4,
                                    "created_utc": 1664133989.0,
                                    "replies": [
                                        {
                                            "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
                                            "author": null,
                                            "id": "ipvmta6",
                                            "parent_id": "t1_ipvm1wo",
                                            "score": 0,
                                            "created_utc": 1664134272.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yt- white",
            "author": "MissCannabunny",
            "id": "ipuywlg",
            "parent_id": "t1_ipuu14f",
            "score": 5,
            "created_utc": 1664125359.0,
            "replies": []
        },
        {
            "body": "personally I read it as white so “white girl”. never heard of whitey but what are you insinuating?",
            "author": null,
            "id": "ipuu7t5",
            "parent_id": "t1_ipuu14f",
            "score": -1,
            "created_utc": 1664123452.0,
            "replies": []
        },
        {
            "body": "i hear you! omg. good thing is we thrive in a lot of places too! you’re totally spot on about being seen as “exotic”. as much as I hate it in the regular dating scene, I love it in sugar dating because I feel like I’m providing more by offering a new experience to the SD! \n\nalso im quite shocked that I didn’t receive more feedback. maybe it’s just this subreddit but I’ve always been considered and consider myself as attractive or above average even if I do take shitty pictures",
            "author": null,
            "id": "ipus78n",
            "parent_id": "t1_ipurdo7",
            "score": 3,
            "created_utc": 1664122618.0,
            "replies": []
        },
        {
            "body": "Because her problem has very little (but not nothing) to do with her being black, and most likely everything to do with her being a stripper and bringing a hustler mentality to her interactions with POTs. Rich men don't fuck with strippers, they pay them to shake their ass and then go away.\n\nAlso, your review has fewer comments than the one above it because we aren't allowed to comment why you are struggling due to forum rules. The post above yours had problems with their text, and we can try to help with that.",
            "author": "storm170",
            "id": "iputooh",
            "parent_id": "t1_ipuqc7z",
            "score": 0,
            "created_utc": 1664123231.0,
            "replies": [
                {
                    "body": "definitely not the reason why mine has less feedback, some of the feedback on hers are just compliments too. lets not make things up, im really not mad this is just how it is. but at least support posts like OP’s so girls like us have a chance too",
                    "author": null,
                    "id": "ipuuttx",
                    "parent_id": "t1_iputooh",
                    "score": 3,
                    "created_utc": 1664123703.0,
                    "replies": [
                        {
                            "body": "And there is another white woman, who posted a profile review 1 hour before yours, that only has _3_ responses.  Yours has _12_.\n\nHow do you explain that, please?",
                            "author": "SDstartingOut",
                            "id": "ipv5on6",
                            "parent_id": "t1_ipuuttx",
                            "score": 4,
                            "created_utc": 1664127922.0,
                            "replies": [
                                {
                                    "body": "I replied to your other comment hope that clears it up",
                                    "author": null,
                                    "id": "ipv5x8t",
                                    "parent_id": "t1_ipv5on6",
                                    "score": 1,
                                    "created_utc": 1664128007.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Way to make everything about you and racism",
            "author": "London-SD",
            "id": "ipuygg1",
            "parent_id": "t1_ipuqc7z",
            "score": -1,
            "created_utc": 1664125184.0,
            "replies": [
                {
                    "body": "you don’t even wanna hear us out… no one’s making it about racism. it’s about racial preferences and how to navigate them. not one poc in this thread has been rude or upset, just pointing things out and giving advice. this is not the right post for you to be under, take your conservativeness somewhere else",
                    "author": null,
                    "id": "ipuyyig",
                    "parent_id": "t1_ipuygg1",
                    "score": 4,
                    "created_utc": 1664125381.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said\n\nIn France Blacks people may come from Caribbean (descendant from slaves) or directly from Africa \n\nAs there never been black slavery nor segregation in mainland France then the white people mentality is very different from the US\n\nThe only blacks people that have a bad reputation are the \"jeunes de banlieues\" (youngsters from poor suburbs) but it apply to arabs too and even whites too\n\nSo a black woman that is american is welcome",
            "author": "GuyFromParis",
            "id": "ipv7bsq",
            "parent_id": "t1_ipusc3b",
            "score": 1,
            "created_utc": 1664128521.0,
            "replies": [
                {
                    "body": "Exactly! Which goes to play with the whole \"go where you are wanted\" because I would NEVER recommend an Arabic girl to do sugaring in France, giving the recent happenings and what a lot of French people think of Arabic/Muslim people from my understanding. \n\nBut Exactly. Countries with no history of black slavery -at least in the mainland- tend to have no problem with black people, especially americans",
                    "author": "chocolatebabydoll",
                    "id": "ipv8ww0",
                    "parent_id": "t1_ipv7bsq",
                    "score": 5,
                    "created_utc": 1664129107.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agreed with the first part of your first statement but when you brought in America not having a racism problem, it revealed your ignorance as a history book can easily refute your point. Or just read what people have to say all across the internet in their anonymity about black people. My dad who is mixed but mostly white heard all sorts of racists things said about black people in his presence and there are videos of white people confessing racists things they've heard other white people say about black people. Heck our first mixed race president (who isnt even called that) born in Hawaii was harassed and told to go back to Kenya.  Like cmon dude, so much evidence of a racism towards people who are black, mixed, asian, and yes white).\n\nYou are absolutely allowed to have racial preferences. I do (I just dont share them). Most people have a phenotype they prefer. I highly doubt you've versed in the internalized racism issues within the black American community (or that you want to be) so I wouldnt bring up black sds if I were you. Also, given that America is 77% white and white americans tend to have higher income than black americans, there wont be that many black sds for black sbs. No one can demand anyone be interested in them, but the OPs points are valid. Stereotypes have caused a negative perception of black women in the US. Even Asian women get the \"submissive sex doll\" fetish too.",
            "author": "UniqueSkinnyXFigure",
            "id": "ipwe73g",
            "parent_id": "t1_ipvcxsy",
            "score": 9,
            "created_utc": 1664145246.0,
            "replies": [
                {
                    "body": "Racism can be examined and evaluated on many levels.   I have three masters degrees and one is history.  One man's view of racism is not always accurate.   Not saying that we have had racial  issues but in last 50 or so years since LBJ was President,  racism has been perpetrated by a sect of society who used it for political purposes. \n\nI can site dozens of examples. So whether you agree or disagree, racism is not significantly prevalent except for some who profit from it",
                    "author": "MainDragonfruit82",
                    "id": "ipwg4rw",
                    "parent_id": "t1_ipwe73g",
                    "score": 0,
                    "created_utc": 1664146102.0,
                    "replies": []
                },
                {
                    "body": "I had responded,  but not sure it posted.  As I said, one man's view of racism is not necessarily viewed the same by others.  I am a student of history with a masters in the subject and two other masters degrees focused on my career. \n\nUnfortunately your views are naive. Sorry.   While there will always be racism....as it us human nature....to label it as purely American shows limited knowledge of the world.    Since just before LBJ was President,  racism was focused on forcing segments of society to engage and integrate.  People were also being shamed.  Then welfare reform was passed which institutionalized the perception of a segment of society.  It also enabled certain people and groups to use \"racism\" as a tool for specific political objectives.   It did not help or improve.\nToday most in this country do not care about racism as it is mostly non existent.  It is manufactured by those seeking to benefit and profit.   Sorry if you disagree, but I can provide reams of examples.  Even Obama used racism to get elected.  He is the perfect example of incompetence being promoted to make certain groups feel good about themselves.   He though, Injected himself into racial issues....mostly on the wrong side.  He is a class a race baiter.  Again, no worries if you disagree.    Unfortunately for those who claim rampant racism,the facts just don't support it.",
                    "author": "MainDragonfruit82",
                    "id": "ipwjro7",
                    "parent_id": "t1_ipwe73g",
                    "score": -1,
                    "created_utc": 1664147725.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "...just cause you dont want america to be racist doesn't mean it isn't. You sound SILLY. America has racism in its roots, have you been to history class baby? To say america isnt racist is ignorant and stupid even. Also if a tall, athletic, black woman with brown hair was to meet you, and she had the perfect personality, and you think \"she is perfect BUT she is black that's the only problem\" then youre racist. I already stated I understand people have preferences, and that's fine, but when it gets to the point you won't choose someone ONLY cause their race, then it becomes a problem...what don't you understand hunny? I am beautiful period. I get plenty of compliments outside the US, it's just the US is racist. As for black sugar daddy's, most black men that are sugar daddies know that white women are a standard of beauty and a symbol of status, that is why you see a lot of wealthy black men with white women, it's still a result of racism and coonery if I'm frank. The other half of black men with money -sports, music, pop culture- tend to go with racially ambiguous women or white, which is why you see racially ambiguous and white women as basketball wives and football wives etc. Even in the black community there is colorism, which is preferring lighter skins over darker skin black people. Racism and colonialism really did a number on america and Americans-including black americans-. For you to say I don't understand preference is ignorant. I prefer european white men because they tend to treat me like a princess and are very generous towards me, HOWEVER, if I met a black man that did treat me the same, or an American white man that treated me the same, I would never say \"no because they are american\" \"no they are black\"",
            "author": "chocolatebabydoll",
            "id": "ipvg4eq",
            "parent_id": "t1_ipvcxsy",
            "score": 14,
            "created_utc": 1664131742.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ipvlon6",
                    "parent_id": "t1_ipvg4eq",
                    "score": -5,
                    "created_utc": 1664133851.0,
                    "replies": [
                        {
                            "body": "Not finding BW desirable isn’t inherently racist. However, when you start to shift the blame and are unable to answer the question of “Why not?” without saying “well… because they’re disagreeable, difficult, demanding, uncouth, and money hungry” without considering that 1) your perception of black women probably isn’t the most informed if you aren’t engaging with them on a regular basis \nOr 2) critically thinking about how things got that way … it’s pretty suspect.\n\nMost racists will claim that they aren’t, and that the system isn’t racist (if you’d like actual literature on the history of America’s systemic racism – more than happy to share.) But when you ask them why they think black women behave and move through the world in the way they do the answer is always: Well, because they’re black.\n\nAnd that, my friend, is racist😁",
                            "author": "naecest",
                            "id": "ipvykb2",
                            "parent_id": "t1_ipvlon6",
                            "score": 4,
                            "created_utc": 1664138673.0,
                            "replies": [
                                {
                                    "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
                                    "author": "MainDragonfruit82",
                                    "id": "ipwce0n",
                                    "parent_id": "t1_ipvykb2",
                                    "score": -3,
                                    "created_utc": 1664144444.0,
                                    "replies": [
                                        {
                                            "body": "Pissed",
                                            "author": "MainDragonfruit82",
                                            "id": "ipwcfvp",
                                            "parent_id": "t1_ipwce0n",
                                            "score": 0,
                                            "created_utc": 1664144466.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
                                    "author": "MainDragonfruit82",
                                    "id": "ipwbo7j",
                                    "parent_id": "t1_ipvykb2",
                                    "score": -3,
                                    "created_utc": 1664144128.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You sound super slow nobody care about what your saying my guy",
            "author": "Successful_Ad_5027",
            "id": "ipw6zor",
            "parent_id": "t1_ipvcxsy",
            "score": -1,
            "created_utc": 1664142108.0,
            "replies": [
                {
                    "body": "When you learn to write and speak proper English,  feel free to message me back.  Until then, please don't waste my time",
                    "author": "MainDragonfruit82",
                    "id": "ipwbwc9",
                    "parent_id": "t1_ipw6zor",
                    "score": 2,
                    "created_utc": 1664144227.0,
                    "replies": [
                        {
                            "body": "You must be real sore with that sick in your ass 24/7 go grown up and get a life",
                            "author": "Successful_Ad_5027",
                            "id": "ipwc2sk",
                            "parent_id": "t1_ipwbwc9",
                            "score": 1,
                            "created_utc": 1664144307.0,
                            "replies": []
                        },
                        {
                            "body": "You sound like a muncher",
                            "author": "Successful_Ad_5027",
                            "id": "ipwc4xv",
                            "parent_id": "t1_ipwbwc9",
                            "score": 0,
                            "created_utc": 1664144334.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What do you mean all faiths started in South africa?",
            "author": "chocolatebabydoll",
            "id": "ipv6lu3",
            "parent_id": "t1_ipv4zwx",
            "score": 1,
            "created_utc": 1664128254.0,
            "replies": [
                {
                    "body": "Send DM",
                    "author": null,
                    "id": "ipvr3vn",
                    "parent_id": "t1_ipv6lu3",
                    "score": 0,
                    "created_utc": 1664135860.0,
                    "replies": []
                },
                {
                    "body": "The oldest practice of faith on the planet was IFA and it was used by South Afrikaans and Egyptians … Ancient Egypt Kings and Queens were Black !",
                    "author": null,
                    "id": "ipv6zha",
                    "parent_id": "t1_ipv6lu3",
                    "score": -2,
                    "created_utc": 1664128395.0,
                    "replies": [
                        {
                            "body": "?? Pharaons kings werent black it is just an urban legend",
                            "author": "GuyFromParis",
                            "id": "ipv9eha",
                            "parent_id": "t1_ipv6zha",
                            "score": 7,
                            "created_utc": 1664129284.0,
                            "replies": [
                                {
                                    "body": "Sounds good 👌🏼",
                                    "author": null,
                                    "id": "ipvb6wf",
                                    "parent_id": "t1_ipv9eha",
                                    "score": 0,
                                    "created_utc": 1664129945.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Where are you getting your information?  You are so wrong.......",
                            "author": "MainDragonfruit82",
                            "id": "ipvd490",
                            "parent_id": "t1_ipv6zha",
                            "score": 3,
                            "created_utc": 1664130632.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Understandable. I feel like that's more in the BDSM scene anyways, so one would have to be into bdsm in the first place to allow that. I would never tolerate negative race play, because for me that's just a boundary, but if you call me your \"black goddess\" I'll probably cringe, cry, and shit myself, but it wouldn't be a deal breaker, I'd just count downt the seconds till I can leave with my rent money 😭. And then if they are just using black as a description I also don't mind lmao. like \"your little black pussy\" or some shit...I'm just like well yea, it is a little pussy and it is indeed black. If they KEEP saying it multiple times and for EVERYTHING, then i get a bit uncomfortable like...ok i get it IM BLACK and you like that like...ok bro. But I am into the kink scene so I'm a bit freaky deaky.",
            "author": "chocolatebabydoll",
            "id": "ipuy83d",
            "parent_id": "t1_ipuw7by",
            "score": 1,
            "created_utc": 1664125090.0,
            "replies": [
                {
                    "body": "Yeah I don’t mind the black this and that stuff during intimacy. I’d probably say it back to him and fulfill the fantasy: “How much do you love this black pussy”? etc but when it starts to get degrading I would want to call it quits since it’s such a turn off and my kink is more of a praise, sub kink - so the complete opposite.\nUnless he’s offering like a significantly big allowance, I’d consider it. But at the same time I don’t want to feel like I’m just an object and black f*ck toy to him.",
                    "author": "D2boujee",
                    "id": "ipv03wq",
                    "parent_id": "t1_ipuy83d",
                    "score": 4,
                    "created_utc": 1664125832.0,
                    "replies": [
                        {
                            "body": "Exactly, a girl that gets it. But I'm a sub so it works out in my favor lmao. Right but the price point is the key 🔑",
                            "author": "chocolatebabydoll",
                            "id": "ipv18fq",
                            "parent_id": "t1_ipv03wq",
                            "score": 1,
                            "created_utc": 1664126267.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> her face wasn’t the focal point of her post\n\nSorry, not sure what face means?\n\nAnyway, you posted this very clearly.  You said:\n\n> why does the yt girl who posted a profile review after me already have feedback but I don’t \n\nAnd I'm pointing out to you, that you got MORE feedback, then a different white girl, that posted an hour before you",
            "author": "SDstartingOut",
            "id": "ipv7bve",
            "parent_id": "t1_ipv5tvm",
            "score": 6,
            "created_utc": 1664128521.0,
            "replies": [
                {
                    "body": "what do you mean you don’t know what face means? i provided a simple explanation, don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes looking directly into the camera",
                    "author": null,
                    "id": "ipv7y69",
                    "parent_id": "t1_ipv7bve",
                    "score": -2,
                    "created_utc": 1664128752.0,
                    "replies": [
                        {
                            "body": "> what do you mean you don’t know what face means? \n\nI wasn't sure if it was a typo for you saying \"race\".  I genuinely (until you made this comment) did not understand what you were saying.   None of it clicked (what you said in your initial post), because that's not at all how I see her profile.  I don't even know what this means:\n\n> and she clearly takes influence from poc.\n\nHow?  What about her looks like its influenced from POC?  \n\n> don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes\n\nI don't think there is anything racially ambiguous about the profile.    Agree to disagree.  And it also clearly says \"white\" on the profile, which you can't miss if you click on it.",
                            "author": "SDstartingOut",
                            "id": "ipvm1wo",
                            "parent_id": "t1_ipv7y69",
                            "score": 4,
                            "created_utc": 1664133989.0,
                            "replies": [
                                {
                                    "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
                                    "author": null,
                                    "id": "ipvmta6",
                                    "parent_id": "t1_ipvm1wo",
                                    "score": 0,
                                    "created_utc": 1664134272.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "definitely not the reason why mine has less feedback, some of the feedback on hers are just compliments too. lets not make things up, im really not mad this is just how it is. but at least support posts like OP’s so girls like us have a chance too",
            "author": null,
            "id": "ipuuttx",
            "parent_id": "t1_iputooh",
            "score": 3,
            "created_utc": 1664123703.0,
            "replies": [
                {
                    "body": "And there is another white woman, who posted a profile review 1 hour before yours, that only has _3_ responses.  Yours has _12_.\n\nHow do you explain that, please?",
                    "author": "SDstartingOut",
                    "id": "ipv5on6",
                    "parent_id": "t1_ipuuttx",
                    "score": 4,
                    "created_utc": 1664127922.0,
                    "replies": [
                        {
                            "body": "I replied to your other comment hope that clears it up",
                            "author": null,
                            "id": "ipv5x8t",
                            "parent_id": "t1_ipv5on6",
                            "score": 1,
                            "created_utc": 1664128007.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "you don’t even wanna hear us out… no one’s making it about racism. it’s about racial preferences and how to navigate them. not one poc in this thread has been rude or upset, just pointing things out and giving advice. this is not the right post for you to be under, take your conservativeness somewhere else",
            "author": null,
            "id": "ipuyyig",
            "parent_id": "t1_ipuygg1",
            "score": 4,
            "created_utc": 1664125381.0,
            "replies": []
        },
        {
            "body": "Exactly! Which goes to play with the whole \"go where you are wanted\" because I would NEVER recommend an Arabic girl to do sugaring in France, giving the recent happenings and what a lot of French people think of Arabic/Muslim people from my understanding. \n\nBut Exactly. Countries with no history of black slavery -at least in the mainland- tend to have no problem with black people, especially americans",
            "author": "chocolatebabydoll",
            "id": "ipv8ww0",
            "parent_id": "t1_ipv7bsq",
            "score": 5,
            "created_utc": 1664129107.0,
            "replies": []
        },
        {
            "body": "Racism can be examined and evaluated on many levels.   I have three masters degrees and one is history.  One man's view of racism is not always accurate.   Not saying that we have had racial  issues but in last 50 or so years since LBJ was President,  racism has been perpetrated by a sect of society who used it for political purposes. \n\nI can site dozens of examples. So whether you agree or disagree, racism is not significantly prevalent except for some who profit from it",
            "author": "MainDragonfruit82",
            "id": "ipwg4rw",
            "parent_id": "t1_ipwe73g",
            "score": 0,
            "created_utc": 1664146102.0,
            "replies": []
        },
        {
            "body": "I had responded,  but not sure it posted.  As I said, one man's view of racism is not necessarily viewed the same by others.  I am a student of history with a masters in the subject and two other masters degrees focused on my career. \n\nUnfortunately your views are naive. Sorry.   While there will always be racism....as it us human nature....to label it as purely American shows limited knowledge of the world.    Since just before LBJ was President,  racism was focused on forcing segments of society to engage and integrate.  People were also being shamed.  Then welfare reform was passed which institutionalized the perception of a segment of society.  It also enabled certain people and groups to use \"racism\" as a tool for specific political objectives.   It did not help or improve.\nToday most in this country do not care about racism as it is mostly non existent.  It is manufactured by those seeking to benefit and profit.   Sorry if you disagree, but I can provide reams of examples.  Even Obama used racism to get elected.  He is the perfect example of incompetence being promoted to make certain groups feel good about themselves.   He though, Injected himself into racial issues....mostly on the wrong side.  He is a class a race baiter.  Again, no worries if you disagree.    Unfortunately for those who claim rampant racism,the facts just don't support it.",
            "author": "MainDragonfruit82",
            "id": "ipwjro7",
            "parent_id": "t1_ipwe73g",
            "score": -1,
            "created_utc": 1664147725.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ipvlon6",
            "parent_id": "t1_ipvg4eq",
            "score": -5,
            "created_utc": 1664133851.0,
            "replies": [
                {
                    "body": "Not finding BW desirable isn’t inherently racist. However, when you start to shift the blame and are unable to answer the question of “Why not?” without saying “well… because they’re disagreeable, difficult, demanding, uncouth, and money hungry” without considering that 1) your perception of black women probably isn’t the most informed if you aren’t engaging with them on a regular basis \nOr 2) critically thinking about how things got that way … it’s pretty suspect.\n\nMost racists will claim that they aren’t, and that the system isn’t racist (if you’d like actual literature on the history of America’s systemic racism – more than happy to share.) But when you ask them why they think black women behave and move through the world in the way they do the answer is always: Well, because they’re black.\n\nAnd that, my friend, is racist😁",
                    "author": "naecest",
                    "id": "ipvykb2",
                    "parent_id": "t1_ipvlon6",
                    "score": 4,
                    "created_utc": 1664138673.0,
                    "replies": [
                        {
                            "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
                            "author": "MainDragonfruit82",
                            "id": "ipwce0n",
                            "parent_id": "t1_ipvykb2",
                            "score": -3,
                            "created_utc": 1664144444.0,
                            "replies": [
                                {
                                    "body": "Pissed",
                                    "author": "MainDragonfruit82",
                                    "id": "ipwcfvp",
                                    "parent_id": "t1_ipwce0n",
                                    "score": 0,
                                    "created_utc": 1664144466.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
                            "author": "MainDragonfruit82",
                            "id": "ipwbo7j",
                            "parent_id": "t1_ipvykb2",
                            "score": -3,
                            "created_utc": 1664144128.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When you learn to write and speak proper English,  feel free to message me back.  Until then, please don't waste my time",
            "author": "MainDragonfruit82",
            "id": "ipwbwc9",
            "parent_id": "t1_ipw6zor",
            "score": 2,
            "created_utc": 1664144227.0,
            "replies": [
                {
                    "body": "You must be real sore with that sick in your ass 24/7 go grown up and get a life",
                    "author": "Successful_Ad_5027",
                    "id": "ipwc2sk",
                    "parent_id": "t1_ipwbwc9",
                    "score": 1,
                    "created_utc": 1664144307.0,
                    "replies": []
                },
                {
                    "body": "You sound like a muncher",
                    "author": "Successful_Ad_5027",
                    "id": "ipwc4xv",
                    "parent_id": "t1_ipwbwc9",
                    "score": 0,
                    "created_utc": 1664144334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Send DM",
            "author": null,
            "id": "ipvr3vn",
            "parent_id": "t1_ipv6lu3",
            "score": 0,
            "created_utc": 1664135860.0,
            "replies": []
        },
        {
            "body": "The oldest practice of faith on the planet was IFA and it was used by South Afrikaans and Egyptians … Ancient Egypt Kings and Queens were Black !",
            "author": null,
            "id": "ipv6zha",
            "parent_id": "t1_ipv6lu3",
            "score": -2,
            "created_utc": 1664128395.0,
            "replies": [
                {
                    "body": "?? Pharaons kings werent black it is just an urban legend",
                    "author": "GuyFromParis",
                    "id": "ipv9eha",
                    "parent_id": "t1_ipv6zha",
                    "score": 7,
                    "created_utc": 1664129284.0,
                    "replies": [
                        {
                            "body": "Sounds good 👌🏼",
                            "author": null,
                            "id": "ipvb6wf",
                            "parent_id": "t1_ipv9eha",
                            "score": 0,
                            "created_utc": 1664129945.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Where are you getting your information?  You are so wrong.......",
                    "author": "MainDragonfruit82",
                    "id": "ipvd490",
                    "parent_id": "t1_ipv6zha",
                    "score": 3,
                    "created_utc": 1664130632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I don’t mind the black this and that stuff during intimacy. I’d probably say it back to him and fulfill the fantasy: “How much do you love this black pussy”? etc but when it starts to get degrading I would want to call it quits since it’s such a turn off and my kink is more of a praise, sub kink - so the complete opposite.\nUnless he’s offering like a significantly big allowance, I’d consider it. But at the same time I don’t want to feel like I’m just an object and black f*ck toy to him.",
            "author": "D2boujee",
            "id": "ipv03wq",
            "parent_id": "t1_ipuy83d",
            "score": 4,
            "created_utc": 1664125832.0,
            "replies": [
                {
                    "body": "Exactly, a girl that gets it. But I'm a sub so it works out in my favor lmao. Right but the price point is the key 🔑",
                    "author": "chocolatebabydoll",
                    "id": "ipv18fq",
                    "parent_id": "t1_ipv03wq",
                    "score": 1,
                    "created_utc": 1664126267.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "what do you mean you don’t know what face means? i provided a simple explanation, don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes looking directly into the camera",
            "author": null,
            "id": "ipv7y69",
            "parent_id": "t1_ipv7bve",
            "score": -2,
            "created_utc": 1664128752.0,
            "replies": [
                {
                    "body": "> what do you mean you don’t know what face means? \n\nI wasn't sure if it was a typo for you saying \"race\".  I genuinely (until you made this comment) did not understand what you were saying.   None of it clicked (what you said in your initial post), because that's not at all how I see her profile.  I don't even know what this means:\n\n> and she clearly takes influence from poc.\n\nHow?  What about her looks like its influenced from POC?  \n\n> don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes\n\nI don't think there is anything racially ambiguous about the profile.    Agree to disagree.  And it also clearly says \"white\" on the profile, which you can't miss if you click on it.",
                    "author": "SDstartingOut",
                    "id": "ipvm1wo",
                    "parent_id": "t1_ipv7y69",
                    "score": 4,
                    "created_utc": 1664133989.0,
                    "replies": [
                        {
                            "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
                            "author": null,
                            "id": "ipvmta6",
                            "parent_id": "t1_ipvm1wo",
                            "score": 0,
                            "created_utc": 1664134272.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And there is another white woman, who posted a profile review 1 hour before yours, that only has _3_ responses.  Yours has _12_.\n\nHow do you explain that, please?",
            "author": "SDstartingOut",
            "id": "ipv5on6",
            "parent_id": "t1_ipuuttx",
            "score": 4,
            "created_utc": 1664127922.0,
            "replies": [
                {
                    "body": "I replied to your other comment hope that clears it up",
                    "author": null,
                    "id": "ipv5x8t",
                    "parent_id": "t1_ipv5on6",
                    "score": 1,
                    "created_utc": 1664128007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not finding BW desirable isn’t inherently racist. However, when you start to shift the blame and are unable to answer the question of “Why not?” without saying “well… because they’re disagreeable, difficult, demanding, uncouth, and money hungry” without considering that 1) your perception of black women probably isn’t the most informed if you aren’t engaging with them on a regular basis \nOr 2) critically thinking about how things got that way … it’s pretty suspect.\n\nMost racists will claim that they aren’t, and that the system isn’t racist (if you’d like actual literature on the history of America’s systemic racism – more than happy to share.) But when you ask them why they think black women behave and move through the world in the way they do the answer is always: Well, because they’re black.\n\nAnd that, my friend, is racist😁",
            "author": "naecest",
            "id": "ipvykb2",
            "parent_id": "t1_ipvlon6",
            "score": 4,
            "created_utc": 1664138673.0,
            "replies": [
                {
                    "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
                    "author": "MainDragonfruit82",
                    "id": "ipwce0n",
                    "parent_id": "t1_ipvykb2",
                    "score": -3,
                    "created_utc": 1664144444.0,
                    "replies": [
                        {
                            "body": "Pissed",
                            "author": "MainDragonfruit82",
                            "id": "ipwcfvp",
                            "parent_id": "t1_ipwce0n",
                            "score": 0,
                            "created_utc": 1664144466.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
                    "author": "MainDragonfruit82",
                    "id": "ipwbo7j",
                    "parent_id": "t1_ipvykb2",
                    "score": -3,
                    "created_utc": 1664144128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You must be real sore with that sick in your ass 24/7 go grown up and get a life",
            "author": "Successful_Ad_5027",
            "id": "ipwc2sk",
            "parent_id": "t1_ipwbwc9",
            "score": 1,
            "created_utc": 1664144307.0,
            "replies": []
        },
        {
            "body": "You sound like a muncher",
            "author": "Successful_Ad_5027",
            "id": "ipwc4xv",
            "parent_id": "t1_ipwbwc9",
            "score": 0,
            "created_utc": 1664144334.0,
            "replies": []
        },
        {
            "body": "?? Pharaons kings werent black it is just an urban legend",
            "author": "GuyFromParis",
            "id": "ipv9eha",
            "parent_id": "t1_ipv6zha",
            "score": 7,
            "created_utc": 1664129284.0,
            "replies": [
                {
                    "body": "Sounds good 👌🏼",
                    "author": null,
                    "id": "ipvb6wf",
                    "parent_id": "t1_ipv9eha",
                    "score": 0,
                    "created_utc": 1664129945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where are you getting your information?  You are so wrong.......",
            "author": "MainDragonfruit82",
            "id": "ipvd490",
            "parent_id": "t1_ipv6zha",
            "score": 3,
            "created_utc": 1664130632.0,
            "replies": []
        },
        {
            "body": "Exactly, a girl that gets it. But I'm a sub so it works out in my favor lmao. Right but the price point is the key 🔑",
            "author": "chocolatebabydoll",
            "id": "ipv18fq",
            "parent_id": "t1_ipv03wq",
            "score": 1,
            "created_utc": 1664126267.0,
            "replies": []
        },
        {
            "body": "> what do you mean you don’t know what face means? \n\nI wasn't sure if it was a typo for you saying \"race\".  I genuinely (until you made this comment) did not understand what you were saying.   None of it clicked (what you said in your initial post), because that's not at all how I see her profile.  I don't even know what this means:\n\n> and she clearly takes influence from poc.\n\nHow?  What about her looks like its influenced from POC?  \n\n> don’t pretend there isn’t a difference between a small picture of a racially ambiguous dark-haired white woman and a blonde girl with blue eyes\n\nI don't think there is anything racially ambiguous about the profile.    Agree to disagree.  And it also clearly says \"white\" on the profile, which you can't miss if you click on it.",
            "author": "SDstartingOut",
            "id": "ipvm1wo",
            "parent_id": "t1_ipv7y69",
            "score": 4,
            "created_utc": 1664133989.0,
            "replies": [
                {
                    "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
                    "author": null,
                    "id": "ipvmta6",
                    "parent_id": "t1_ipvm1wo",
                    "score": 0,
                    "created_utc": 1664134272.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I replied to your other comment hope that clears it up",
            "author": null,
            "id": "ipv5x8t",
            "parent_id": "t1_ipv5on6",
            "score": 1,
            "created_utc": 1664128007.0,
            "replies": []
        },
        {
            "body": "Oh one other thing.   There doesn't have to be a reason I don't want to be with you sexually.   It is called free will.   So stop with the bullcr*p that if I don't want you because you are black is racist.  It isn't. You are just passed that very very very few white guys want you.  Accept it and move on.   I can challenge every effort you make to label me and will push you to justify your comments as most are outlandish and ludicrous",
            "author": "MainDragonfruit82",
            "id": "ipwce0n",
            "parent_id": "t1_ipvykb2",
            "score": -3,
            "created_utc": 1664144444.0,
            "replies": [
                {
                    "body": "Pissed",
                    "author": "MainDragonfruit82",
                    "id": "ipwcfvp",
                    "parent_id": "t1_ipwce0n",
                    "score": 0,
                    "created_utc": 1664144466.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LMFAO.  I don't have to justify anything to you. What you think or say is completely irrelevant to me. Just find it enjoyable to see someone like yourself twisting to rationalize your behavior.   Perhaps you should live in Europe.  I did.  Great life...but not as good as hear.  Unfortunate you project your shortcomings onto everyone else...like who you are has nothing to do with how people perceive and react to you.   Screaming racism doesn't work any longer as the majority could care less.  I am sure someone on CNN would love to interview the black girl angry because white rich guys are not interested in bedding her.    I feel for you LOL",
            "author": "MainDragonfruit82",
            "id": "ipwbo7j",
            "parent_id": "t1_ipvykb2",
            "score": -3,
            "created_utc": 1664144128.0,
            "replies": []
        },
        {
            "body": "Sounds good 👌🏼",
            "author": null,
            "id": "ipvb6wf",
            "parent_id": "t1_ipv9eha",
            "score": 0,
            "created_utc": 1664129945.0,
            "replies": []
        },
        {
            "body": "it doesnt clearly say “white” the small text wouldn’t be seen at first glance. please leave me alone LMAO like fr what are you trying to debate exactly? literally no one is mad other than you. you don’t know my experience and what I’ve had to do to adapt. honestly, shut up. like just shut up",
            "author": null,
            "id": "ipvmta6",
            "parent_id": "t1_ipvm1wo",
            "score": 0,
            "created_utc": 1664134272.0,
            "replies": []
        },
        {
            "body": "Pissed",
            "author": "MainDragonfruit82",
            "id": "ipwcfvp",
            "parent_id": "t1_ipwce0n",
            "score": 0,
            "created_utc": 1664144466.0,
            "replies": []
        }
    ]
}