{
    "title": "Guys am I going fucking bald at 17",
    "post_id": "c9ci77",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/c9ci77/guys_am_i_going_fucking_bald_at_17/",
    "author": "EvilSammyy",
    "body": "",
    "url": "https://i.redd.it/g3z7pi6iff831.jpg",
    "score": 467,
    "upvote_ratio": 0.99,
    "created_utc": 1562307068.0,
    "num_comments": 110,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Go to a dermatologist",
            "author": "JezzaPar",
            "id": "esw7x1k",
            "parent_id": "t3_c9ci77",
            "score": 414,
            "created_utc": 1562310545.0,
            "replies": [
                {
                    "body": "Seriously, it's better to get it checked out before abandoning all hope and shaving it all off. 17 is pretty young to start losing hair, there may still be hope.",
                    "author": "Rhyanoceros218",
                    "id": "eswcwcf",
                    "parent_id": "t1_esw7x1k",
                    "score": 233,
                    "created_utc": 1562313060.0,
                    "replies": [
                        {
                            "body": "I second this. I noticed earlier this year that I was thinning pretty rapidly up top, similar to OP. Went to the dermo and they prescribed some meds which essentially reversed everything within a few months. I'm also 17 for reference. Hope it goes well, OP! :^)",
                            "author": "_Hikaryu",
                            "id": "esxbdle",
                            "parent_id": "t1_eswcwcf",
                            "score": 69,
                            "created_utc": 1562328113.0,
                            "replies": [
                                {
                                    "body": "Why was your hair thinning?",
                                    "author": "At0m123",
                                    "id": "esyhmfi",
                                    "parent_id": "t1_esxbdle",
                                    "score": 22,
                                    "created_utc": 1562343621.0,
                                    "replies": [
                                        {
                                            "body": "It can actually be hereditary even at that age, or a sign of malnutrition.",
                                            "author": "darkguardian823",
                                            "id": "esz026u",
                                            "parent_id": "t1_esyhmfi",
                                            "score": 10,
                                            "created_utc": 1562352740.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> they prescribed some meds\n\nWhich are???",
                                    "author": "Applesauce3750",
                                    "id": "irdhnvv",
                                    "parent_id": "t1_esxbdle",
                                    "score": 1,
                                    "created_utc": 1665120763.0,
                                    "replies": []
                                },
                                {
                                    "body": "Have the meds still been working or?",
                                    "author": "A7kt",
                                    "id": "jelv42v",
                                    "parent_id": "t1_esxbdle",
                                    "score": 1,
                                    "created_utc": 1680397857.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "My hair loss started at 16 because of dandruff, back then it used to be quite dense and my hair was jet black silky and thick, so as a result i didnt take care of it. After a year during winters, my hair started falling rapidly and even after using anti dandruff shampoos, i couldn't get rid of the dandruff. I used to do home remedies like applying oil and other stuff, got it under control, until a few months back(18 then) when i shifted to another place, my hairfall started again (mainly because of the hard water we got).\n\n\nHonestly saying, this hairfall thing depresses you a lot. Right now(18) i have lesser hair than my father and i honestly regret a lot. Shit's depressing man.",
                            "author": "redhood_007",
                            "id": "esy1u0p",
                            "parent_id": "t1_eswcwcf",
                            "score": 19,
                            "created_utc": 1562337951.0,
                            "replies": [
                                {
                                    "body": "If you have hair loss from dandruff then you really need to see a GP and get referred to a Dermatologist, or go straight to a Dermatologist. I know financial situations can make that hard or next to impossible, but if it's developed enough to be causing hair loss it really needs to be checked out.",
                                    "author": "Lucosis",
                                    "id": "esyiqfp",
                                    "parent_id": "t1_esy1u0p",
                                    "score": 11,
                                    "created_utc": 1562344077.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I started losing my hair at 14, I went to a dermatologist when I turned 18. she literally told me \"the bald head and bearded look is popular these days\"... thats a direct quote...😔",
                    "author": "MrK1_257",
                    "id": "hn6c4op",
                    "parent_id": "t1_esw7x1k",
                    "score": 3,
                    "created_utc": 1638607188.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "esykvji",
                    "parent_id": "t1_esw7x1k",
                    "score": 2,
                    "created_utc": 1562344957.0,
                    "replies": [
                        {
                            "body": "Tell him that you’re thinning, let him see your hair/scalp and then he’ll tell you something. He could prescribe a topica cream or something like propecia even I think",
                            "author": "JezzaPar",
                            "id": "esyrr5v",
                            "parent_id": "t1_esykvji",
                            "score": 3,
                            "created_utc": 1562348250.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It does seem to be thinning based on this photo. If you've been concerned enough to have taken photos and posted them here, and then we all unanimously agree I'd say you probably are.\n\nI'd suggest Minoxidil and professional advice.",
            "author": null,
            "id": "esw9hig",
            "parent_id": "t3_c9ci77",
            "score": 78,
            "created_utc": 1562311337.0,
            "replies": []
        },
        {
            "body": "Yes.",
            "author": "Purple-Ham",
            "id": "esw0wp6",
            "parent_id": "t3_c9ci77",
            "score": 162,
            "created_utc": 1562307464.0,
            "replies": [
                {
                    "body": "What should I do? Are you sure its not because my hair is slick back and wet?",
                    "author": "EvilSammyy",
                    "id": "esw1oh5",
                    "parent_id": "t1_esw0wp6",
                    "score": 76,
                    "created_utc": 1562307845.0,
                    "replies": [
                        {
                            "body": "Go to a dermatologist and stick with the meds they'll give you. You can also check r/tressless for other treatments",
                            "author": "Amranwag",
                            "id": "eswe1a8",
                            "parent_id": "t1_esw1oh5",
                            "score": 89,
                            "created_utc": 1562313597.0,
                            "replies": [
                                {
                                    "body": "Since r/tressless is now overrun with incels, I'll just list the main takeaway:\n\nThere are 3 known ways to curb male balding:\n\n1.\tFinasteride (pills). 1mg is what is preferred. Some buy the 5mg and cut them up. HIMS now sells fin for a shit ton of money, but a prescription is dirt cheap.\n2.\tMinoxidil. This is the chemical within Rogain. You apply it to your head 1-2 times a day. There's a foam version and syrup-y version. Minox-beards are also a thing, especially for trans guys. Anywhere you put minox, hair will grow (which means that you shouldn't hug women, especially pregnant women, when using). \n3.\tDermarolling. Dermapens are the go-to device. Somehow, poking tiny holes into the skin on your heads stimulates hair growth.\n\nResults of course very person to person. Something like 1% of men get rough side effects from fin. Some men experience hair regrowth. Others just experience less balding (shedding). Others don't see any progress at all.",
                                    "author": "Antisystemization",
                                    "id": "esyu5qa",
                                    "parent_id": "t1_eswe1a8",
                                    "score": 20,
                                    "created_utc": 1562349651.0,
                                    "replies": [
                                        {
                                            "body": "1. Finasteride is okay, I caught the rare ED issue, but most don't. I will say that they need to go the prescription route, as a doctor can prescribe and evaluate overtime as finasteride is a DHT Blocker, and people tend to forget that messing with hormones at such a crucial developmental time in their life can have life altering results. \n\n2. Minoxidil can help, but as it is only a low level DHT blocker itself, it can only stimulate growth in already opened follicles. If time passes and the follicles close, there is a good chance they won't produce anymore. It won't make hair appear, but only stimulate growth where growth was already possible.\n\n3. I may actually check this out, this one is new to me.\n\nI have a massive hormone deficiency and have to take Testosterone, estrogen blockers, DHT for side effects, and more. Losing my hair up top, while actually having some moderate success with Minoxidil for the beard.",
                                            "author": "darkguardian823",
                                            "id": "esz1ovs",
                                            "parent_id": "t1_esyu5qa",
                                            "score": 4,
                                            "created_utc": 1562353584.0,
                                            "replies": [
                                                {
                                                    "body": "What do you mean massive hormone déficience,  I cannot tolerate fin at all too ? On it my penile tissue changes Nd I get severe mental side effect too",
                                                    "author": "Drakein2233",
                                                    "id": "io3vj96",
                                                    "parent_id": "t1_esz1ovs",
                                                    "score": 1,
                                                    "created_utc": 1662979694.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Wait can you really not hug a girl? Like if you’re hanging out with friends and you meet up with them and give her a hug?",
                                            "author": "ek1995",
                                            "id": "esz268m",
                                            "parent_id": "t1_esyu5qa",
                                            "score": 2,
                                            "created_utc": 1562353828.0,
                                            "replies": [
                                                {
                                                    "body": "No, thats a little extreme. It takes weeks of consistent exposure to have an effect on adults. Infants, children, and cats however are all sensitive and can get side effects (and its lethal to cats). If you are living with a woman (girlfriend, wife, daughter, mom, sister, ect.) Then you may want to be careful that they don't come into daily contact with the product, and that they dont use your pillows.",
                                                    "author": "Ozuf1",
                                                    "id": "et0feh1",
                                                    "parent_id": "t1_esz268m",
                                                    "score": 2,
                                                    "created_utc": 1562378129.0,
                                                    "replies": [
                                                        {
                                                            "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
                                                            "author": "say_chicha",
                                                            "id": "et2zs24",
                                                            "parent_id": "t1_et0feh1",
                                                            "score": 2,
                                                            "created_utc": 1562425672.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                                                                    "author": "Ozuf1",
                                                                    "id": "et37lja",
                                                                    "parent_id": "t1_et2zs24",
                                                                    "score": 1,
                                                                    "created_utc": 1562429168.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No I'm sorry but your hair is very thin. You could go for a buzz cut or crewcut",
                            "author": "Gravittyyy",
                            "id": "esw6ujk",
                            "parent_id": "t1_esw1oh5",
                            "score": 39,
                            "created_utc": 1562310067.0,
                            "replies": []
                        },
                        {
                            "body": "Thats thinning my son, embrace it. Ive had many friends go bald at the age of 24, and one back in highschool at 19. They all took it in stride.\n\nShave it clean, if your Polish double points because that hair is going to transfer to the rest of your body. Start working on it early and get some sun on your scalp so your skin tones match.\n\nIf this is the route you go, I would also say that you should kick your aerobics in gear. Ladies love fit bald runners. Im not joking.",
                            "author": "Alchestbreach_ModAlt",
                            "id": "eswbyom",
                            "parent_id": "t1_esw1oh5",
                            "score": 119,
                            "created_utc": 1562312589.0,
                            "replies": [
                                {
                                    "body": "I'm starting to lose my hair at 25 and this advice made me feel a lot better about it so thank you!",
                                    "author": "Naveedamin7992",
                                    "id": "esx3otf",
                                    "parent_id": "t1_eswbyom",
                                    "score": 22,
                                    "created_utc": 1562324918.0,
                                    "replies": [
                                        {
                                            "body": "Man, my best bud is bald and hes a handsome devil. You dont have to have hair to make it in life. In fact if you have it your given the tyranny of choice to find out how to make it look good. But a bald dude who takes that jazz in stride doesn't need to worry about any of that. In fact you dont need to be peak fitness either, just be healthy.\n\nWhen your in highschool, going bald might seem like a terror, but its just that masculine hairline going into overdrive for that sick amount of testosterone you got.",
                                            "author": "Alchestbreach_ModAlt",
                                            "id": "esz1696",
                                            "parent_id": "t1_esx3otf",
                                            "score": 2,
                                            "created_utc": 1562353314.0,
                                            "replies": [
                                                {
                                                    "body": "Lol I've never thought of it that way. It'd oddly comforting.\nMy problem is that I have pretty severe social anxiety and I feel like everyone will look at me like I'm a wierdo. Plus the fact that I'm extremely self conscious so I'm even more awkward than normal lol.\nI guess I just need to accept the inevitable baldness and try to become comfortable with myself.",
                                                    "author": "Naveedamin7992",
                                                    "id": "esz1qbv",
                                                    "parent_id": "t1_esz1696",
                                                    "score": 2,
                                                    "created_utc": 1562353604.0,
                                                    "replies": [
                                                        {
                                                            "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
                                                            "author": "ObieCat",
                                                            "id": "et2xvzf",
                                                            "parent_id": "t1_esz1qbv",
                                                            "score": 2,
                                                            "created_utc": 1562424723.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Gotta love yourself man.",
                                                            "author": "Alchestbreach_ModAlt",
                                                            "id": "eszb4li",
                                                            "parent_id": "t1_esz1qbv",
                                                            "score": 1,
                                                            "created_utc": 1562358603.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Get on that propecia. It is the best thing out there and will help you maintain what you have as well as regrow some that you have lost.\n\nOnly thing is you have to take it forever to keep the results",
                            "author": "fufm",
                            "id": "esxuuzm",
                            "parent_id": "t1_esw1oh5",
                            "score": 2,
                            "created_utc": 1562335529.0,
                            "replies": []
                        },
                        {
                            "body": "dermatologist",
                            "author": null,
                            "id": "esyuy7x",
                            "parent_id": "t1_esw1oh5",
                            "score": 1,
                            "created_utc": 1562350101.0,
                            "replies": []
                        },
                        {
                            "body": "Could be bro.",
                            "author": "randouser",
                            "id": "iocchdi",
                            "parent_id": "t1_esw1oh5",
                            "score": 1,
                            "created_utc": 1663121868.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "esw9ki9",
            "parent_id": "t3_c9ci77",
            "score": 43,
            "created_utc": 1562311421.0,
            "replies": [
                {
                    "body": "I’ve also had success with using the pills from Hims and their shampoo. I was a bit worse than OP here, now it looks like normal thinning. But I definitely second going to a dermatologist, I’ve been meaning to do this but they’ll be able to give you an accurate diagnosis.",
                    "author": "fuckimbackonreddit9",
                    "id": "esx5k44",
                    "parent_id": "t1_esw9ki9",
                    "score": 5,
                    "created_utc": 1562325696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are definately thinning!",
            "author": "Longislandtea12",
            "id": "esw5fv3",
            "parent_id": "t3_c9ci77",
            "score": 108,
            "created_utc": 1562309470.0,
            "replies": []
        },
        {
            "body": "Definitely thinning man. It's rare at your age but it does happen. I had a friend in college who was 20 and had about half the amount of hair you do. He was tormented for it endlessly. I always felt bad for the guy and left him alone. I had a birthmark on my arm that some people back then made fun of me for, but they aren't around anymore. Anyways, eventually my friend just embraced the shave and looked fine. You don't appear to be at that point yet, but trust me when or if the time comes it's better to shave it than look like a cancer patient perpetually in chemo. \n\nSee a dermatologist if you can afford it. Alternatively, kidnap a dermatologist and force them to experiment on you until they can regrow your hair. Do not accept no for an answer because they can do it if they're good. It's important you stake out this dermatologist a day or two before you abduct them to see where he/she lives so you can threaten to hurt their family if they refuse to cooperate. Take pictures on your phone of their house or kids/wife/dog. \n\nYou could also rent a storage unit if you want and tie their family up inside the unit for extra leverage just make sure you pay cash. You can usually slip a 20 to whoever is working at the time and they won't enter your ID. Just tell them you just signed a lease for an apartment but can't move in until monday and only need the unit for the weekend anyways. Have the family rolled and tied up inside some rugs so it just looks like you're storing some decor. If you do this MAKE SURE you tape their mouths shut with duct tape so they cannot vocalize. Most storage facilities only have workers present Monday through Friday so rent the unit on Friday then bring the family after the workers have left for the weekend. \n\nIf the dermatologists office is closed on the weekend then Friday after they close would be a good time to kidnap them so then they have a secluded place to work on you without arising much suspicion. DO NOT let them inject you with anything as they could be a smarty pants trying to sedate you and then you're in jail and balding. Assure the doctor he is safe the entire time he experiments on you to regrow your hair, but don't worry we just want him to remain calm and able to focus on regrowing our hair. At the end no matter the outcome you should \"take care\" of him since he's likely seen your face at this point. When cleaning blood/dna keep in mind you need bleach with an oxygen cleaning agent in it. A lot of people think regular bleach destroys DNA evidence. It will destroy most but not all so get something like oxiclean if you want to do it right. \n\nhttps://www.youtube.com/watch?v=dQw4w9WgXcQ",
            "author": "chacer98",
            "id": "eswf348",
            "parent_id": "t3_c9ci77",
            "score": 55,
            "created_utc": 1562314044.0,
            "replies": [
                {
                    "body": "What the fuck did I just read",
                    "author": "army-of-juan",
                    "id": "esxkra6",
                    "parent_id": "t1_eswf348",
                    "score": 15,
                    "created_utc": 1562331902.0,
                    "replies": []
                },
                {
                    "body": "What",
                    "author": "Lucianoywea",
                    "id": "esyk0el",
                    "parent_id": "t1_eswf348",
                    "score": 3,
                    "created_utc": 1562344600.0,
                    "replies": []
                },
                {
                    "body": "I can guess what happened to the people who made fun of your birthmark that “aren’t around anymore.”",
                    "author": "ObieCat",
                    "id": "et2y6x9",
                    "parent_id": "t1_eswf348",
                    "score": 3,
                    "created_utc": 1562424929.0,
                    "replies": []
                },
                {
                    "body": "Thank you! 🤗",
                    "author": "yuiojmncbf",
                    "id": "esyb4ri",
                    "parent_id": "t1_eswf348",
                    "score": 1,
                    "created_utc": 1562341309.0,
                    "replies": []
                },
                {
                    "body": "FBI open up",
                    "author": "Ignoringit",
                    "id": "et1scj7",
                    "parent_id": "t1_eswf348",
                    "score": 1,
                    "created_utc": 1562402937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I knew a guy in high school a decade ago that went bald when he was 18. It happens.",
            "author": "jLight91",
            "id": "eswewz0",
            "parent_id": "t3_c9ci77",
            "score": 7,
            "created_utc": 1562313973.0,
            "replies": []
        },
        {
            "body": "What’s your diet and sleep like!?!",
            "author": "mindgamesweldon",
            "id": "eswln36",
            "parent_id": "t3_c9ci77",
            "score": 14,
            "created_utc": 1562316869.0,
            "replies": [
                {
                    "body": "Can having general anxiety , eating fast food once every day ,and sleeping very late but still getting 8+ hours of sleep cause some hair loss? This is very specific I know",
                    "author": "Cheezewiz239",
                    "id": "esxzfje",
                    "parent_id": "t1_eswln36",
                    "score": 5,
                    "created_utc": 1562337136.0,
                    "replies": [
                        {
                            "body": "I'm a doctor and you're dying",
                            "author": "djrunk_djedi",
                            "id": "esy0wd2",
                            "parent_id": "t1_esxzfje",
                            "score": 12,
                            "created_utc": 1562337636.0,
                            "replies": [
                                {
                                    "body": "Aren’t we all?",
                                    "author": "Cheezewiz239",
                                    "id": "esy0y3t",
                                    "parent_id": "t1_esy0wd2",
                                    "score": 2,
                                    "created_utc": 1562337651.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "There’s been minor evidence linking SOME non genetic hairloss to arteriorschlerois (the hardening of arteries from arterial plaque that causes heart disease). That plaque buildup is from cholesterol so it’s mainly diet related (or genetics of how your body handles cholesterol or a mystery of the universe with no none connection to red meat, depending on which food cult you belong)\n\nAnecdotally my hair started thinning 5 months ago when I got a high stress job and stopped sleeping barely at all. So for me, I’m trying to get more sleep and exercise :)\n\n(And yeah fast food usually fried food so cholesterol is off the charts.)",
                            "author": "mindgamesweldon",
                            "id": "esy3vb8",
                            "parent_id": "t1_esxzfje",
                            "score": 2,
                            "created_utc": 1562338666.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Someone is finally suggesting the right things!",
                    "author": "xproushe03",
                    "id": "esx5rpa",
                    "parent_id": "t1_eswln36",
                    "score": 9,
                    "created_utc": 1562325790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dont worry bro me too. In this one together 😔",
            "author": "AllWomenAreQueens69",
            "id": "eswge52",
            "parent_id": "t3_c9ci77",
            "score": 6,
            "created_utc": 1562314602.0,
            "replies": []
        },
        {
            "body": "If you dermatologist or any certified doctor says it's just really premature hair loss, then do yourself a favour : do not try anything to \"make hair stronger\", or \"fight hair loss\". It will be a huge waste of money and it will look weird.\n\nShave it all off, it will always look better and more natural than anything else you try.\n\nI haven't been there so I can't say that I know what it's like to lose your hair. But I know what it's like to witness men of young age lose their hair.\nOut of all these guys, only one type gets out of it glorious and proud. The guy who goes full Q ball hair cut.",
            "author": null,
            "id": "esxbnmm",
            "parent_id": "t3_c9ci77",
            "score": 4,
            "created_utc": 1562328233.0,
            "replies": [
                {
                    "body": "...There are a lot of success stories of people with min/fin and the like.",
                    "author": null,
                    "id": "esy347l",
                    "parent_id": "t1_esxbnmm",
                    "score": 2,
                    "created_utc": 1562338402.0,
                    "replies": [
                        {
                            "body": "Ok ! I hope I'm wrong bro. I hope you manage to keep your hair.",
                            "author": null,
                            "id": "esy40cg",
                            "parent_id": "t1_esy347l",
                            "score": 1,
                            "created_utc": 1562338716.0,
                            "replies": [
                                {
                                    "body": "Well thank you!\n\nI mean, a good strategy is to keep the hair short regardless, apply the medicine and treatments while maintaining a buzz",
                                    "author": null,
                                    "id": "esy48p8",
                                    "parent_id": "t1_esy40cg",
                                    "score": 1,
                                    "created_utc": 1562338798.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[I got a hair transplant in Turkey.](https://imgur.com/gallery/rQH6WS9) \n\nI was receding like fuck but hid it fairly well but it was obvious if I didn’t really style it!\n\nIf you’re interested give me a shout because I can get you a discount by referral (cost about €1300 plus flights. It includes the hotel, antibiotics, a liaison person to make sure you’re ok etc).",
            "author": "MildlyAgreeable",
            "id": "eswp9lx",
            "parent_id": "t3_c9ci77",
            "score": 8,
            "created_utc": 1562318503.0,
            "replies": [
                {
                    "body": "Sounds like a promo for a place in a murder movie",
                    "author": "msx_asdf",
                    "id": "esxjypp",
                    "parent_id": "t1_eswp9lx",
                    "score": 8,
                    "created_utc": 1562331598.0,
                    "replies": [
                        {
                            "body": "Justsnuffthings.",
                            "author": "MildlyAgreeable",
                            "id": "esxk1wt",
                            "parent_id": "t1_esxjypp",
                            "score": 1,
                            "created_utc": 1562331631.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What does the actual hair transplant procedure entail?",
                    "author": "kookman",
                    "id": "esxl45c",
                    "parent_id": "t1_eswp9lx",
                    "score": 3,
                    "created_utc": 1562332032.0,
                    "replies": [
                        {
                            "body": "They shave your head, numb up the back of your head (in my case), extract your hair follicles, have a break (by feeding you) and then start injecting said follicles into the site that you’re balding (and beyond it in order to future proof it).\n\nIt’s a bit sore for a few days (like sunburn) but they dress it all up and give you all the mild painkillers and antibiotics.\n\nI’m a year on and I’m really happy with it.",
                            "author": "MildlyAgreeable",
                            "id": "esxlr9p",
                            "parent_id": "t1_esxl45c",
                            "score": 6,
                            "created_utc": 1562332276.0,
                            "replies": [
                                {
                                    "body": "Thanks for the reply. I am intrigued because I currently have the same look as your first (before) pic. Just out of curiosity why did you go to Turkey, was it simply cheaper all things considered?",
                                    "author": "kookman",
                                    "id": "esyn4or",
                                    "parent_id": "t1_esxlr9p",
                                    "score": 1,
                                    "created_utc": 1562345928.0,
                                    "replies": [
                                        {
                                            "body": "You’re welcome! Yeah it’s like £5000 in the UK.\n\nI knew someone who had it done. I did my due diligence on the clinic and was happy with what I saw. They were very communicative and did everything they said they would. Plus the results were the main thing so I would recommend it.",
                                            "author": "MildlyAgreeable",
                                            "id": "esynbm2",
                                            "parent_id": "t1_esyn4or",
                                            "score": 2,
                                            "created_utc": 1562346012.0,
                                            "replies": [
                                                {
                                                    "body": "What do you call this procedure? I would like to research online about it and as a possible option.",
                                                    "author": "joram000",
                                                    "id": "et66jcw",
                                                    "parent_id": "t1_esynbm2",
                                                    "score": 1,
                                                    "created_utc": 1562505234.0,
                                                    "replies": [
                                                        {
                                                            "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
                                                            "author": "MildlyAgreeable",
                                                            "id": "et6kpva",
                                                            "parent_id": "t1_et66jcw",
                                                            "score": 1,
                                                            "created_utc": 1562514606.0,
                                                            "replies": [
                                                                {
                                                                    "body": "How does it look rn",
                                                                    "author": "Ok_Oil1834",
                                                                    "id": "hwpikc1",
                                                                    "parent_id": "t1_et6kpva",
                                                                    "score": 1,
                                                                    "created_utc": 1644708174.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yeah still good, man 👍🏻",
                                                                            "author": "MildlyAgreeable",
                                                                            "id": "hwrfsle",
                                                                            "parent_id": "t1_hwpikc1",
                                                                            "score": 1,
                                                                            "created_utc": 1644746736.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "don't you still need to put a stop to the current balding though? i'm fairly certain if you get a hair transplant while it's still going on then the hair you got transplanted in will just thin away as well",
                    "author": "AyeAye_Kane",
                    "id": "esyrx00",
                    "parent_id": "t1_eswp9lx",
                    "score": 1,
                    "created_utc": 1562348332.0,
                    "replies": [
                        {
                            "body": "They implanted hair further back than from where I was balding - sort of like a double layer. It didn’t disrupt the other natural follicles so it grows normally and isn’t thick on the ‘border’ of the hairline.\n\nIf, for some reason, my hair starting going bald further back than it was originally (it had gone back as far as it could and had stayed at that point for years) then the new follicles would still be there.",
                            "author": "MildlyAgreeable",
                            "id": "esysa9y",
                            "parent_id": "t1_esyrx00",
                            "score": 2,
                            "created_utc": 1562348519.0,
                            "replies": [
                                {
                                    "body": "ohh, okay, thanks for explaining",
                                    "author": "AyeAye_Kane",
                                    "id": "esyserd",
                                    "parent_id": "t1_esysa9y",
                                    "score": 2,
                                    "created_utc": 1562348596.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Embrace it or get help",
            "author": null,
            "id": "eswfcq8",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562314159.0,
            "replies": []
        },
        {
            "body": "Shit dude go see a dermatologist asap.",
            "author": null,
            "id": "eswfogj",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562314288.0,
            "replies": []
        },
        {
            "body": "https://perfecthairhealth.com/why-most-hair-loss-topicals-fail-to-regrow-hair/ i recommend reading through this guys articles and work, he's one of the better hairloss writers ive seen. Go to a dermatologist and get tested to see why you are loosing your hair, it could be diet, could be your thyroid, could be something other than male pattern baldness (you appear to have a diffuse pattern). If you do have mpb shaving it off can give you a lot of confidence back, but there are ways of giving your hair the best shot it can get to grow back and stay put, even if those ways aren't guarantees. \n\nBe careful with the tressless subreddit those guys are very...intenese at times, though it can be good to read posts of others going through the same thing. You arent alone after all!\n\nI wish you the best of luck on whichever path you choose, let me know if you have any questions!",
            "author": "Ozuf1",
            "id": "esxc23z",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562328392.0,
            "replies": []
        },
        {
            "body": "Might be worth checking your bloods to see if you have any diet based deficiency. You look pretty pale so could be something.",
            "author": "NoizeUK",
            "id": "esxlpub",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562332260.0,
            "replies": []
        },
        {
            "body": "Shit guys didnt expect to wake up to so many comments. Thanks for the tips I think Im gonna give the buzzcut a try :)",
            "author": "EvilSammyy",
            "id": "esxym2r",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562336861.0,
            "replies": [
                {
                    "body": "That sounds like a good idea.",
                    "author": "Longislandtea12",
                    "id": "esy45jl",
                    "parent_id": "t1_esxym2r",
                    "score": 2,
                    "created_utc": 1562338767.0,
                    "replies": []
                },
                {
                    "body": "i'd still suggest seeing a dermatologist before doing that",
                    "author": "AyeAye_Kane",
                    "id": "esyryub",
                    "parent_id": "t1_esxym2r",
                    "score": 1,
                    "created_utc": 1562348357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks pretty thin dude. I’ve had a few young lads I’ve worked with go and receive transplants in Turkey. Pretty nice gig, for the price of a holiday you go and get hairs removed from the back of your neck and get them put in the thinning area. You should see them now, full head of hair! And I’m talking they were worse than this.",
            "author": null,
            "id": "eswgvc9",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562314816.0,
            "replies": []
        },
        {
            "body": "Maybe get your thyroid checked. Hair loss is a symptom",
            "author": "BaronVA",
            "id": "eswhv7s",
            "parent_id": "t3_c9ci77",
            "score": 3,
            "created_utc": 1562315230.0,
            "replies": []
        },
        {
            "body": "F",
            "author": null,
            "id": "eswgzs3",
            "parent_id": "t3_c9ci77",
            "score": 4,
            "created_utc": 1562314859.0,
            "replies": []
        },
        {
            "body": "Commit to it",
            "author": "Giggly_nigly",
            "id": "eswgru1",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562314775.0,
            "replies": []
        },
        {
            "body": "Rogaine and Proscar mix and you should be fine, but don't dick around. It'll grow back if it's just thinning but once the hair follicle dies it's gone.",
            "author": "AaronicNation",
            "id": "eswyqdp",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562322854.0,
            "replies": []
        },
        {
            "body": "So Ill be completely honest from this pic it looks like thinning, but your hair looks kinda wild in it so idk for sure. Post another pic maybe?",
            "author": "THEADJENT",
            "id": "esx36ac",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562324699.0,
            "replies": []
        },
        {
            "body": "happens to the best of us",
            "author": "BigBubba09",
            "id": "esx4df6",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562325203.0,
            "replies": []
        },
        {
            "body": "Yes. Get some minoxidil on that ASAP!",
            "author": "Onesharpman",
            "id": "esx9pj6",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562327458.0,
            "replies": []
        },
        {
            "body": "Around 2001 My cosmetology instructor told me he started to lose hair in the same area you did and he started taking a supplement called calcium 600 and it grew back. I also had an elderly client with hair that felt very rough and thin and I recommended she try that supplement as well. On her 4th appointment(around 4 -6 weeks) I noticed  her hair looking full and feeling soft, I asked her what she had been doing and she said she started that supplement I had told her about. Both her and my instructor said it can cause an upset stomach so they would take it with food. Balding can be caused by other things and not just male pattern baldness. Maybe that’s the case in your situation.",
            "author": "juarez31",
            "id": "esxf0so",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562329600.0,
            "replies": []
        },
        {
            "body": "Shave it. I know it doesn't sound like a good option but a shaved head is a strong look and take confidence. I have a full head of thick Irish hair and I often shave it off. Trust me is a good look. Especially if you work out,shaved head,musselly armed guys are swimming in tail. Just ask Jason stathem.",
            "author": "therobohour",
            "id": "esxzksc",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562337184.0,
            "replies": []
        },
        {
            "body": "F.",
            "author": "AirborneRanger117",
            "id": "esyifir",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562343948.0,
            "replies": []
        },
        {
            "body": "You could have an autoimmune disease or a nutritional deficiency so I would get that checked out.",
            "author": "eablokker",
            "id": "esyk5if",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562344659.0,
            "replies": []
        },
        {
            "body": "I'm here to bring you some truths based on experience and family's experience.... I first noticed a slight thinning in my hair at 14, no lies. I was able to notice it because I was so analytical about everything, I always noticed small changes... I didnt tell anyone because I knew they wouldnt believe me , fast forward to about 20 and it had become more obvious that people actually believed me when I told them. I feared I would lose it all by 25, but I'm now 30 and I still have a decent amount of hair left , enough to were some people cant notice it unless they look at my crown area which is where it's the most obvious. \n\nTruth be told to start losing hair at a teen is not un heard of . Sometimes it's can be due to a health condition , there are many reasons so it's best to go get checked. And other times it's simply just male pattern baldness and theres nearly nothing you can do about it... that's the harsh truth , my wife's cousin was receding as a teen and was fully bald by 20. I've also met people who told me the same thing , bald by 20... theres a famous celebrity I think his name is Ricky Tambor? He was on Arrested Development , he said he was going bald at 16, my cousins as well are young and are receding... it's just genetics sometimes. \n\nHow fast it goes is the real question ... sometimes its quick other times it takes years and years...",
            "author": "jzng27",
            "id": "esym1ue",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562345452.0,
            "replies": []
        },
        {
            "body": "I started going bald around 17 as well. Honestly man there’s not much you can do that either won’t look like shit or won’t cost you a fortune. If it’s really worth it for you then go ahead I suppose. For about a year, maybe two, I tried supplements, different haircuts, hats, etc. \n\nEventually I just figured why prolong the inevitable, can’t fight nature. Made it my new year resolution (the only one I’ve ever followed thru on) and shaved it all down, kept on it about every two days since. \n\nGoing bald isn’t the end of the world man. Only thing I miss about hair is having something to hold the sweat at bay. Otherwise I love it. I gauged my ears (to a 00, nothing obnoxious), bought some bolder glasses and grew out the mustache and goatee combo to break up a bit of the monotony of having all of that skin from the shirt up. Those are changes I probably wouldn’t have made if I still had my hair because I never would’ve felt the need to. In the end I took going bald as a chance to reinvent, and I suggest to everyone in the same situation to just make the best of it, make the change and try something different. I was cool with how I looked then but I love how I look now. \n\nJust my two cents.",
            "author": "MidwestAction",
            "id": "esyoe3m",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562346535.0,
            "replies": []
        },
        {
            "body": "I went bald cause I wanted to, join me!",
            "author": "toxicsgo",
            "id": "esypl91",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562347140.0,
            "replies": []
        },
        {
            "body": "I can only offer you my sorrow and share your pain, I hope you get your hair back",
            "author": "SSSRSF",
            "id": "esz099z",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562352844.0,
            "replies": []
        },
        {
            "body": "1. Check your diet.\n2. Start working out (yes really)\n3. Go to a derm/GP to get checked for skin/scalp issues.\n4. Look into using finesteride, minoxidil, dandruff control products and maybe ketoconazole shampoos.\n\n&#x200B;\n\nFor 'top of head' finesteride is #1, but there are side effects/risks so do your research and understand what your getting yourself into. Minoxidil from what I recall only works on the rear of the head (aka \"bald spot\").",
            "author": null,
            "id": "esz1oh6",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562353577.0,
            "replies": []
        },
        {
            "body": "Oof",
            "author": "Iam_nameless",
            "id": "esz3e4w",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562354451.0,
            "replies": []
        },
        {
            "body": "I had an issue similar to this. What I learned was my best friend was matte product. See a dermatologist and maybe if you’re able to they could prescribe finasteride or propecia (idk if they’re the same pill) to help reverse it. I’ve never used it as I wasn’t that bad but your best bet is to cut your hair a bit shorter and use matte product (clay and a blowdryer makes hair look full). Shine or wetness shows your scalp. If not, own it and shave it then lift weights and be a tough guy. I had to do that when I shaved my head to compensate, and it works.",
            "author": null,
            "id": "et1bkva",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562394773.0,
            "replies": []
        },
        {
            "body": "Update? I sure as hell hope you've been on fin :/",
            "author": "RadamanthysWyvern",
            "id": "ezru7oq",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1568078862.0,
            "replies": [
                {
                    "body": "Havent been on fin, basically all I did was buzz my hair but rn i want my hair back, im kinda lost\n(Also it doesnt look as bad in the sun)",
                    "author": "EvilSammyy",
                    "id": "ezrucnh",
                    "parent_id": "t1_ezru7oq",
                    "score": 1,
                    "created_utc": 1568078915.0,
                    "replies": [
                        {
                            "body": "Wtf bro, did you at least see a dermatologist about it? You're too young for this shit.",
                            "author": "RadamanthysWyvern",
                            "id": "ezruuqx",
                            "parent_id": "t1_ezrucnh",
                            "score": 1,
                            "created_utc": 1568079107.0,
                            "replies": [
                                {
                                    "body": "I did and I was honestly shocked how careless he sounded when I talked about this. I showed him this picture and he replied : \" its normal, some people are just born with less hair \".",
                                    "author": "EvilSammyy",
                                    "id": "ezrv10c",
                                    "parent_id": "t1_ezruuqx",
                                    "score": 1,
                                    "created_utc": 1568079171.0,
                                    "replies": [
                                        {
                                            "body": "What a pos. I would consult another one, unless this was just a downright unflattering pic or your hair has gotten better since.",
                                            "author": "RadamanthysWyvern",
                                            "id": "ezrvdoh",
                                            "parent_id": "t1_ezrv10c",
                                            "score": 1,
                                            "created_utc": 1568079307.0,
                                            "replies": [
                                                {
                                                    "body": "To be fair, my hair was wet in this pic and all clumped up together, I could post a picture of my hair rn",
                                                    "author": "EvilSammyy",
                                                    "id": "ezrw0ad",
                                                    "parent_id": "t1_ezrvdoh",
                                                    "score": 1,
                                                    "created_utc": 1568079559.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Another thing worth mentioning is that Im trying to get rid of my dandruff right now, I have a feeling thats the issue here",
                    "author": "EvilSammyy",
                    "id": "ezruthf",
                    "parent_id": "t1_ezru7oq",
                    "score": 1,
                    "created_utc": 1568079094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "F",
            "author": "elias2tife",
            "id": "eswhj3t",
            "parent_id": "t3_c9ci77",
            "score": 2,
            "created_utc": 1562315089.0,
            "replies": []
        },
        {
            "body": "r/tressless\n\nYou should do your research, some substances work very good but have nasty side effects",
            "author": "mo-powerbuilder",
            "id": "eswgegv",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562314608.0,
            "replies": []
        },
        {
            "body": "You're welcome,  shave it off and go lift some weights.",
            "author": "nothera",
            "id": "esxf36z",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1562329637.0,
            "replies": []
        },
        {
            "body": "Thyroid",
            "author": "AssmanPk",
            "id": "eswqzz1",
            "parent_id": "t3_c9ci77",
            "score": -1,
            "created_utc": 1562319283.0,
            "replies": []
        },
        {
            "body": "that's bad",
            "author": "colaturka",
            "id": "esxspcr",
            "parent_id": "t3_c9ci77",
            "score": -1,
            "created_utc": 1562334759.0,
            "replies": []
        },
        {
            "body": "Same man 😔",
            "author": null,
            "id": "hoy29mh",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1639763871.0,
            "replies": []
        },
        {
            "body": "The caption IS SO FUNNY IM SORRY",
            "author": "OkTiger54",
            "id": "icfkgec",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1655281255.0,
            "replies": []
        },
        {
            "body": "Hi I'm also experiencing this at 16 and I wanted to ask if you felt tiny hair on your scalp whenever you touched it",
            "author": "surewhynotimbored",
            "id": "igrl0gg",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1658231010.0,
            "replies": []
        },
        {
            "body": "Did you ever get this resolved/get a definitive answer, OP?",
            "author": "Dry-Ad8580",
            "id": "int8j50",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1662779129.0,
            "replies": []
        },
        {
            "body": "I'm facing the same problem for more than 6 years and now I'm 17..idk what to even do..I'm female btw..hair thinning caused my confidence so fcking low..and I'm stressed so much abt it..hope you'll get a way to grow urs well..frnd",
            "author": "vamostae",
            "id": "iojtgyv",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1663259878.0,
            "replies": []
        },
        {
            "body": "Brother how is ur hair status now",
            "author": "sohelllll",
            "id": "iqhm5np",
            "parent_id": "t3_c9ci77",
            "score": 1,
            "created_utc": 1664539488.0,
            "replies": []
        },
        {
            "body": "Seriously, it's better to get it checked out before abandoning all hope and shaving it all off. 17 is pretty young to start losing hair, there may still be hope.",
            "author": "Rhyanoceros218",
            "id": "eswcwcf",
            "parent_id": "t1_esw7x1k",
            "score": 233,
            "created_utc": 1562313060.0,
            "replies": [
                {
                    "body": "I second this. I noticed earlier this year that I was thinning pretty rapidly up top, similar to OP. Went to the dermo and they prescribed some meds which essentially reversed everything within a few months. I'm also 17 for reference. Hope it goes well, OP! :^)",
                    "author": "_Hikaryu",
                    "id": "esxbdle",
                    "parent_id": "t1_eswcwcf",
                    "score": 69,
                    "created_utc": 1562328113.0,
                    "replies": [
                        {
                            "body": "Why was your hair thinning?",
                            "author": "At0m123",
                            "id": "esyhmfi",
                            "parent_id": "t1_esxbdle",
                            "score": 22,
                            "created_utc": 1562343621.0,
                            "replies": [
                                {
                                    "body": "It can actually be hereditary even at that age, or a sign of malnutrition.",
                                    "author": "darkguardian823",
                                    "id": "esz026u",
                                    "parent_id": "t1_esyhmfi",
                                    "score": 10,
                                    "created_utc": 1562352740.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> they prescribed some meds\n\nWhich are???",
                            "author": "Applesauce3750",
                            "id": "irdhnvv",
                            "parent_id": "t1_esxbdle",
                            "score": 1,
                            "created_utc": 1665120763.0,
                            "replies": []
                        },
                        {
                            "body": "Have the meds still been working or?",
                            "author": "A7kt",
                            "id": "jelv42v",
                            "parent_id": "t1_esxbdle",
                            "score": 1,
                            "created_utc": 1680397857.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "My hair loss started at 16 because of dandruff, back then it used to be quite dense and my hair was jet black silky and thick, so as a result i didnt take care of it. After a year during winters, my hair started falling rapidly and even after using anti dandruff shampoos, i couldn't get rid of the dandruff. I used to do home remedies like applying oil and other stuff, got it under control, until a few months back(18 then) when i shifted to another place, my hairfall started again (mainly because of the hard water we got).\n\n\nHonestly saying, this hairfall thing depresses you a lot. Right now(18) i have lesser hair than my father and i honestly regret a lot. Shit's depressing man.",
                    "author": "redhood_007",
                    "id": "esy1u0p",
                    "parent_id": "t1_eswcwcf",
                    "score": 19,
                    "created_utc": 1562337951.0,
                    "replies": [
                        {
                            "body": "If you have hair loss from dandruff then you really need to see a GP and get referred to a Dermatologist, or go straight to a Dermatologist. I know financial situations can make that hard or next to impossible, but if it's developed enough to be causing hair loss it really needs to be checked out.",
                            "author": "Lucosis",
                            "id": "esyiqfp",
                            "parent_id": "t1_esy1u0p",
                            "score": 11,
                            "created_utc": 1562344077.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I started losing my hair at 14, I went to a dermatologist when I turned 18. she literally told me \"the bald head and bearded look is popular these days\"... thats a direct quote...😔",
            "author": "MrK1_257",
            "id": "hn6c4op",
            "parent_id": "t1_esw7x1k",
            "score": 3,
            "created_utc": 1638607188.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "esykvji",
            "parent_id": "t1_esw7x1k",
            "score": 2,
            "created_utc": 1562344957.0,
            "replies": [
                {
                    "body": "Tell him that you’re thinning, let him see your hair/scalp and then he’ll tell you something. He could prescribe a topica cream or something like propecia even I think",
                    "author": "JezzaPar",
                    "id": "esyrr5v",
                    "parent_id": "t1_esykvji",
                    "score": 3,
                    "created_utc": 1562348250.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What should I do? Are you sure its not because my hair is slick back and wet?",
            "author": "EvilSammyy",
            "id": "esw1oh5",
            "parent_id": "t1_esw0wp6",
            "score": 76,
            "created_utc": 1562307845.0,
            "replies": [
                {
                    "body": "Go to a dermatologist and stick with the meds they'll give you. You can also check r/tressless for other treatments",
                    "author": "Amranwag",
                    "id": "eswe1a8",
                    "parent_id": "t1_esw1oh5",
                    "score": 89,
                    "created_utc": 1562313597.0,
                    "replies": [
                        {
                            "body": "Since r/tressless is now overrun with incels, I'll just list the main takeaway:\n\nThere are 3 known ways to curb male balding:\n\n1.\tFinasteride (pills). 1mg is what is preferred. Some buy the 5mg and cut them up. HIMS now sells fin for a shit ton of money, but a prescription is dirt cheap.\n2.\tMinoxidil. This is the chemical within Rogain. You apply it to your head 1-2 times a day. There's a foam version and syrup-y version. Minox-beards are also a thing, especially for trans guys. Anywhere you put minox, hair will grow (which means that you shouldn't hug women, especially pregnant women, when using). \n3.\tDermarolling. Dermapens are the go-to device. Somehow, poking tiny holes into the skin on your heads stimulates hair growth.\n\nResults of course very person to person. Something like 1% of men get rough side effects from fin. Some men experience hair regrowth. Others just experience less balding (shedding). Others don't see any progress at all.",
                            "author": "Antisystemization",
                            "id": "esyu5qa",
                            "parent_id": "t1_eswe1a8",
                            "score": 20,
                            "created_utc": 1562349651.0,
                            "replies": [
                                {
                                    "body": "1. Finasteride is okay, I caught the rare ED issue, but most don't. I will say that they need to go the prescription route, as a doctor can prescribe and evaluate overtime as finasteride is a DHT Blocker, and people tend to forget that messing with hormones at such a crucial developmental time in their life can have life altering results. \n\n2. Minoxidil can help, but as it is only a low level DHT blocker itself, it can only stimulate growth in already opened follicles. If time passes and the follicles close, there is a good chance they won't produce anymore. It won't make hair appear, but only stimulate growth where growth was already possible.\n\n3. I may actually check this out, this one is new to me.\n\nI have a massive hormone deficiency and have to take Testosterone, estrogen blockers, DHT for side effects, and more. Losing my hair up top, while actually having some moderate success with Minoxidil for the beard.",
                                    "author": "darkguardian823",
                                    "id": "esz1ovs",
                                    "parent_id": "t1_esyu5qa",
                                    "score": 4,
                                    "created_utc": 1562353584.0,
                                    "replies": [
                                        {
                                            "body": "What do you mean massive hormone déficience,  I cannot tolerate fin at all too ? On it my penile tissue changes Nd I get severe mental side effect too",
                                            "author": "Drakein2233",
                                            "id": "io3vj96",
                                            "parent_id": "t1_esz1ovs",
                                            "score": 1,
                                            "created_utc": 1662979694.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Wait can you really not hug a girl? Like if you’re hanging out with friends and you meet up with them and give her a hug?",
                                    "author": "ek1995",
                                    "id": "esz268m",
                                    "parent_id": "t1_esyu5qa",
                                    "score": 2,
                                    "created_utc": 1562353828.0,
                                    "replies": [
                                        {
                                            "body": "No, thats a little extreme. It takes weeks of consistent exposure to have an effect on adults. Infants, children, and cats however are all sensitive and can get side effects (and its lethal to cats). If you are living with a woman (girlfriend, wife, daughter, mom, sister, ect.) Then you may want to be careful that they don't come into daily contact with the product, and that they dont use your pillows.",
                                            "author": "Ozuf1",
                                            "id": "et0feh1",
                                            "parent_id": "t1_esz268m",
                                            "score": 2,
                                            "created_utc": 1562378129.0,
                                            "replies": [
                                                {
                                                    "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
                                                    "author": "say_chicha",
                                                    "id": "et2zs24",
                                                    "parent_id": "t1_et0feh1",
                                                    "score": 2,
                                                    "created_utc": 1562425672.0,
                                                    "replies": [
                                                        {
                                                            "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                                                            "author": "Ozuf1",
                                                            "id": "et37lja",
                                                            "parent_id": "t1_et2zs24",
                                                            "score": 1,
                                                            "created_utc": 1562429168.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No I'm sorry but your hair is very thin. You could go for a buzz cut or crewcut",
                    "author": "Gravittyyy",
                    "id": "esw6ujk",
                    "parent_id": "t1_esw1oh5",
                    "score": 39,
                    "created_utc": 1562310067.0,
                    "replies": []
                },
                {
                    "body": "Thats thinning my son, embrace it. Ive had many friends go bald at the age of 24, and one back in highschool at 19. They all took it in stride.\n\nShave it clean, if your Polish double points because that hair is going to transfer to the rest of your body. Start working on it early and get some sun on your scalp so your skin tones match.\n\nIf this is the route you go, I would also say that you should kick your aerobics in gear. Ladies love fit bald runners. Im not joking.",
                    "author": "Alchestbreach_ModAlt",
                    "id": "eswbyom",
                    "parent_id": "t1_esw1oh5",
                    "score": 119,
                    "created_utc": 1562312589.0,
                    "replies": [
                        {
                            "body": "I'm starting to lose my hair at 25 and this advice made me feel a lot better about it so thank you!",
                            "author": "Naveedamin7992",
                            "id": "esx3otf",
                            "parent_id": "t1_eswbyom",
                            "score": 22,
                            "created_utc": 1562324918.0,
                            "replies": [
                                {
                                    "body": "Man, my best bud is bald and hes a handsome devil. You dont have to have hair to make it in life. In fact if you have it your given the tyranny of choice to find out how to make it look good. But a bald dude who takes that jazz in stride doesn't need to worry about any of that. In fact you dont need to be peak fitness either, just be healthy.\n\nWhen your in highschool, going bald might seem like a terror, but its just that masculine hairline going into overdrive for that sick amount of testosterone you got.",
                                    "author": "Alchestbreach_ModAlt",
                                    "id": "esz1696",
                                    "parent_id": "t1_esx3otf",
                                    "score": 2,
                                    "created_utc": 1562353314.0,
                                    "replies": [
                                        {
                                            "body": "Lol I've never thought of it that way. It'd oddly comforting.\nMy problem is that I have pretty severe social anxiety and I feel like everyone will look at me like I'm a wierdo. Plus the fact that I'm extremely self conscious so I'm even more awkward than normal lol.\nI guess I just need to accept the inevitable baldness and try to become comfortable with myself.",
                                            "author": "Naveedamin7992",
                                            "id": "esz1qbv",
                                            "parent_id": "t1_esz1696",
                                            "score": 2,
                                            "created_utc": 1562353604.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
                                                    "author": "ObieCat",
                                                    "id": "et2xvzf",
                                                    "parent_id": "t1_esz1qbv",
                                                    "score": 2,
                                                    "created_utc": 1562424723.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Gotta love yourself man.",
                                                    "author": "Alchestbreach_ModAlt",
                                                    "id": "eszb4li",
                                                    "parent_id": "t1_esz1qbv",
                                                    "score": 1,
                                                    "created_utc": 1562358603.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Get on that propecia. It is the best thing out there and will help you maintain what you have as well as regrow some that you have lost.\n\nOnly thing is you have to take it forever to keep the results",
                    "author": "fufm",
                    "id": "esxuuzm",
                    "parent_id": "t1_esw1oh5",
                    "score": 2,
                    "created_utc": 1562335529.0,
                    "replies": []
                },
                {
                    "body": "dermatologist",
                    "author": null,
                    "id": "esyuy7x",
                    "parent_id": "t1_esw1oh5",
                    "score": 1,
                    "created_utc": 1562350101.0,
                    "replies": []
                },
                {
                    "body": "Could be bro.",
                    "author": "randouser",
                    "id": "iocchdi",
                    "parent_id": "t1_esw1oh5",
                    "score": 1,
                    "created_utc": 1663121868.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve also had success with using the pills from Hims and their shampoo. I was a bit worse than OP here, now it looks like normal thinning. But I definitely second going to a dermatologist, I’ve been meaning to do this but they’ll be able to give you an accurate diagnosis.",
            "author": "fuckimbackonreddit9",
            "id": "esx5k44",
            "parent_id": "t1_esw9ki9",
            "score": 5,
            "created_utc": 1562325696.0,
            "replies": []
        },
        {
            "body": "What the fuck did I just read",
            "author": "army-of-juan",
            "id": "esxkra6",
            "parent_id": "t1_eswf348",
            "score": 15,
            "created_utc": 1562331902.0,
            "replies": []
        },
        {
            "body": "What",
            "author": "Lucianoywea",
            "id": "esyk0el",
            "parent_id": "t1_eswf348",
            "score": 3,
            "created_utc": 1562344600.0,
            "replies": []
        },
        {
            "body": "I can guess what happened to the people who made fun of your birthmark that “aren’t around anymore.”",
            "author": "ObieCat",
            "id": "et2y6x9",
            "parent_id": "t1_eswf348",
            "score": 3,
            "created_utc": 1562424929.0,
            "replies": []
        },
        {
            "body": "Thank you! 🤗",
            "author": "yuiojmncbf",
            "id": "esyb4ri",
            "parent_id": "t1_eswf348",
            "score": 1,
            "created_utc": 1562341309.0,
            "replies": []
        },
        {
            "body": "FBI open up",
            "author": "Ignoringit",
            "id": "et1scj7",
            "parent_id": "t1_eswf348",
            "score": 1,
            "created_utc": 1562402937.0,
            "replies": []
        },
        {
            "body": "Can having general anxiety , eating fast food once every day ,and sleeping very late but still getting 8+ hours of sleep cause some hair loss? This is very specific I know",
            "author": "Cheezewiz239",
            "id": "esxzfje",
            "parent_id": "t1_eswln36",
            "score": 5,
            "created_utc": 1562337136.0,
            "replies": [
                {
                    "body": "I'm a doctor and you're dying",
                    "author": "djrunk_djedi",
                    "id": "esy0wd2",
                    "parent_id": "t1_esxzfje",
                    "score": 12,
                    "created_utc": 1562337636.0,
                    "replies": [
                        {
                            "body": "Aren’t we all?",
                            "author": "Cheezewiz239",
                            "id": "esy0y3t",
                            "parent_id": "t1_esy0wd2",
                            "score": 2,
                            "created_utc": 1562337651.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There’s been minor evidence linking SOME non genetic hairloss to arteriorschlerois (the hardening of arteries from arterial plaque that causes heart disease). That plaque buildup is from cholesterol so it’s mainly diet related (or genetics of how your body handles cholesterol or a mystery of the universe with no none connection to red meat, depending on which food cult you belong)\n\nAnecdotally my hair started thinning 5 months ago when I got a high stress job and stopped sleeping barely at all. So for me, I’m trying to get more sleep and exercise :)\n\n(And yeah fast food usually fried food so cholesterol is off the charts.)",
                    "author": "mindgamesweldon",
                    "id": "esy3vb8",
                    "parent_id": "t1_esxzfje",
                    "score": 2,
                    "created_utc": 1562338666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone is finally suggesting the right things!",
            "author": "xproushe03",
            "id": "esx5rpa",
            "parent_id": "t1_eswln36",
            "score": 9,
            "created_utc": 1562325790.0,
            "replies": []
        },
        {
            "body": "...There are a lot of success stories of people with min/fin and the like.",
            "author": null,
            "id": "esy347l",
            "parent_id": "t1_esxbnmm",
            "score": 2,
            "created_utc": 1562338402.0,
            "replies": [
                {
                    "body": "Ok ! I hope I'm wrong bro. I hope you manage to keep your hair.",
                    "author": null,
                    "id": "esy40cg",
                    "parent_id": "t1_esy347l",
                    "score": 1,
                    "created_utc": 1562338716.0,
                    "replies": [
                        {
                            "body": "Well thank you!\n\nI mean, a good strategy is to keep the hair short regardless, apply the medicine and treatments while maintaining a buzz",
                            "author": null,
                            "id": "esy48p8",
                            "parent_id": "t1_esy40cg",
                            "score": 1,
                            "created_utc": 1562338798.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like a promo for a place in a murder movie",
            "author": "msx_asdf",
            "id": "esxjypp",
            "parent_id": "t1_eswp9lx",
            "score": 8,
            "created_utc": 1562331598.0,
            "replies": [
                {
                    "body": "Justsnuffthings.",
                    "author": "MildlyAgreeable",
                    "id": "esxk1wt",
                    "parent_id": "t1_esxjypp",
                    "score": 1,
                    "created_utc": 1562331631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does the actual hair transplant procedure entail?",
            "author": "kookman",
            "id": "esxl45c",
            "parent_id": "t1_eswp9lx",
            "score": 3,
            "created_utc": 1562332032.0,
            "replies": [
                {
                    "body": "They shave your head, numb up the back of your head (in my case), extract your hair follicles, have a break (by feeding you) and then start injecting said follicles into the site that you’re balding (and beyond it in order to future proof it).\n\nIt’s a bit sore for a few days (like sunburn) but they dress it all up and give you all the mild painkillers and antibiotics.\n\nI’m a year on and I’m really happy with it.",
                    "author": "MildlyAgreeable",
                    "id": "esxlr9p",
                    "parent_id": "t1_esxl45c",
                    "score": 6,
                    "created_utc": 1562332276.0,
                    "replies": [
                        {
                            "body": "Thanks for the reply. I am intrigued because I currently have the same look as your first (before) pic. Just out of curiosity why did you go to Turkey, was it simply cheaper all things considered?",
                            "author": "kookman",
                            "id": "esyn4or",
                            "parent_id": "t1_esxlr9p",
                            "score": 1,
                            "created_utc": 1562345928.0,
                            "replies": [
                                {
                                    "body": "You’re welcome! Yeah it’s like £5000 in the UK.\n\nI knew someone who had it done. I did my due diligence on the clinic and was happy with what I saw. They were very communicative and did everything they said they would. Plus the results were the main thing so I would recommend it.",
                                    "author": "MildlyAgreeable",
                                    "id": "esynbm2",
                                    "parent_id": "t1_esyn4or",
                                    "score": 2,
                                    "created_utc": 1562346012.0,
                                    "replies": [
                                        {
                                            "body": "What do you call this procedure? I would like to research online about it and as a possible option.",
                                            "author": "joram000",
                                            "id": "et66jcw",
                                            "parent_id": "t1_esynbm2",
                                            "score": 1,
                                            "created_utc": 1562505234.0,
                                            "replies": [
                                                {
                                                    "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
                                                    "author": "MildlyAgreeable",
                                                    "id": "et6kpva",
                                                    "parent_id": "t1_et66jcw",
                                                    "score": 1,
                                                    "created_utc": 1562514606.0,
                                                    "replies": [
                                                        {
                                                            "body": "How does it look rn",
                                                            "author": "Ok_Oil1834",
                                                            "id": "hwpikc1",
                                                            "parent_id": "t1_et6kpva",
                                                            "score": 1,
                                                            "created_utc": 1644708174.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yeah still good, man 👍🏻",
                                                                    "author": "MildlyAgreeable",
                                                                    "id": "hwrfsle",
                                                                    "parent_id": "t1_hwpikc1",
                                                                    "score": 1,
                                                                    "created_utc": 1644746736.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "don't you still need to put a stop to the current balding though? i'm fairly certain if you get a hair transplant while it's still going on then the hair you got transplanted in will just thin away as well",
            "author": "AyeAye_Kane",
            "id": "esyrx00",
            "parent_id": "t1_eswp9lx",
            "score": 1,
            "created_utc": 1562348332.0,
            "replies": [
                {
                    "body": "They implanted hair further back than from where I was balding - sort of like a double layer. It didn’t disrupt the other natural follicles so it grows normally and isn’t thick on the ‘border’ of the hairline.\n\nIf, for some reason, my hair starting going bald further back than it was originally (it had gone back as far as it could and had stayed at that point for years) then the new follicles would still be there.",
                    "author": "MildlyAgreeable",
                    "id": "esysa9y",
                    "parent_id": "t1_esyrx00",
                    "score": 2,
                    "created_utc": 1562348519.0,
                    "replies": [
                        {
                            "body": "ohh, okay, thanks for explaining",
                            "author": "AyeAye_Kane",
                            "id": "esyserd",
                            "parent_id": "t1_esysa9y",
                            "score": 2,
                            "created_utc": 1562348596.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That sounds like a good idea.",
            "author": "Longislandtea12",
            "id": "esy45jl",
            "parent_id": "t1_esxym2r",
            "score": 2,
            "created_utc": 1562338767.0,
            "replies": []
        },
        {
            "body": "i'd still suggest seeing a dermatologist before doing that",
            "author": "AyeAye_Kane",
            "id": "esyryub",
            "parent_id": "t1_esxym2r",
            "score": 1,
            "created_utc": 1562348357.0,
            "replies": []
        },
        {
            "body": "Havent been on fin, basically all I did was buzz my hair but rn i want my hair back, im kinda lost\n(Also it doesnt look as bad in the sun)",
            "author": "EvilSammyy",
            "id": "ezrucnh",
            "parent_id": "t1_ezru7oq",
            "score": 1,
            "created_utc": 1568078915.0,
            "replies": [
                {
                    "body": "Wtf bro, did you at least see a dermatologist about it? You're too young for this shit.",
                    "author": "RadamanthysWyvern",
                    "id": "ezruuqx",
                    "parent_id": "t1_ezrucnh",
                    "score": 1,
                    "created_utc": 1568079107.0,
                    "replies": [
                        {
                            "body": "I did and I was honestly shocked how careless he sounded when I talked about this. I showed him this picture and he replied : \" its normal, some people are just born with less hair \".",
                            "author": "EvilSammyy",
                            "id": "ezrv10c",
                            "parent_id": "t1_ezruuqx",
                            "score": 1,
                            "created_utc": 1568079171.0,
                            "replies": [
                                {
                                    "body": "What a pos. I would consult another one, unless this was just a downright unflattering pic or your hair has gotten better since.",
                                    "author": "RadamanthysWyvern",
                                    "id": "ezrvdoh",
                                    "parent_id": "t1_ezrv10c",
                                    "score": 1,
                                    "created_utc": 1568079307.0,
                                    "replies": [
                                        {
                                            "body": "To be fair, my hair was wet in this pic and all clumped up together, I could post a picture of my hair rn",
                                            "author": "EvilSammyy",
                                            "id": "ezrw0ad",
                                            "parent_id": "t1_ezrvdoh",
                                            "score": 1,
                                            "created_utc": 1568079559.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Another thing worth mentioning is that Im trying to get rid of my dandruff right now, I have a feeling thats the issue here",
            "author": "EvilSammyy",
            "id": "ezruthf",
            "parent_id": "t1_ezru7oq",
            "score": 1,
            "created_utc": 1568079094.0,
            "replies": []
        },
        {
            "body": "I second this. I noticed earlier this year that I was thinning pretty rapidly up top, similar to OP. Went to the dermo and they prescribed some meds which essentially reversed everything within a few months. I'm also 17 for reference. Hope it goes well, OP! :^)",
            "author": "_Hikaryu",
            "id": "esxbdle",
            "parent_id": "t1_eswcwcf",
            "score": 69,
            "created_utc": 1562328113.0,
            "replies": [
                {
                    "body": "Why was your hair thinning?",
                    "author": "At0m123",
                    "id": "esyhmfi",
                    "parent_id": "t1_esxbdle",
                    "score": 22,
                    "created_utc": 1562343621.0,
                    "replies": [
                        {
                            "body": "It can actually be hereditary even at that age, or a sign of malnutrition.",
                            "author": "darkguardian823",
                            "id": "esz026u",
                            "parent_id": "t1_esyhmfi",
                            "score": 10,
                            "created_utc": 1562352740.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> they prescribed some meds\n\nWhich are???",
                    "author": "Applesauce3750",
                    "id": "irdhnvv",
                    "parent_id": "t1_esxbdle",
                    "score": 1,
                    "created_utc": 1665120763.0,
                    "replies": []
                },
                {
                    "body": "Have the meds still been working or?",
                    "author": "A7kt",
                    "id": "jelv42v",
                    "parent_id": "t1_esxbdle",
                    "score": 1,
                    "created_utc": 1680397857.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My hair loss started at 16 because of dandruff, back then it used to be quite dense and my hair was jet black silky and thick, so as a result i didnt take care of it. After a year during winters, my hair started falling rapidly and even after using anti dandruff shampoos, i couldn't get rid of the dandruff. I used to do home remedies like applying oil and other stuff, got it under control, until a few months back(18 then) when i shifted to another place, my hairfall started again (mainly because of the hard water we got).\n\n\nHonestly saying, this hairfall thing depresses you a lot. Right now(18) i have lesser hair than my father and i honestly regret a lot. Shit's depressing man.",
            "author": "redhood_007",
            "id": "esy1u0p",
            "parent_id": "t1_eswcwcf",
            "score": 19,
            "created_utc": 1562337951.0,
            "replies": [
                {
                    "body": "If you have hair loss from dandruff then you really need to see a GP and get referred to a Dermatologist, or go straight to a Dermatologist. I know financial situations can make that hard or next to impossible, but if it's developed enough to be causing hair loss it really needs to be checked out.",
                    "author": "Lucosis",
                    "id": "esyiqfp",
                    "parent_id": "t1_esy1u0p",
                    "score": 11,
                    "created_utc": 1562344077.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tell him that you’re thinning, let him see your hair/scalp and then he’ll tell you something. He could prescribe a topica cream or something like propecia even I think",
            "author": "JezzaPar",
            "id": "esyrr5v",
            "parent_id": "t1_esykvji",
            "score": 3,
            "created_utc": 1562348250.0,
            "replies": []
        },
        {
            "body": "Go to a dermatologist and stick with the meds they'll give you. You can also check r/tressless for other treatments",
            "author": "Amranwag",
            "id": "eswe1a8",
            "parent_id": "t1_esw1oh5",
            "score": 89,
            "created_utc": 1562313597.0,
            "replies": [
                {
                    "body": "Since r/tressless is now overrun with incels, I'll just list the main takeaway:\n\nThere are 3 known ways to curb male balding:\n\n1.\tFinasteride (pills). 1mg is what is preferred. Some buy the 5mg and cut them up. HIMS now sells fin for a shit ton of money, but a prescription is dirt cheap.\n2.\tMinoxidil. This is the chemical within Rogain. You apply it to your head 1-2 times a day. There's a foam version and syrup-y version. Minox-beards are also a thing, especially for trans guys. Anywhere you put minox, hair will grow (which means that you shouldn't hug women, especially pregnant women, when using). \n3.\tDermarolling. Dermapens are the go-to device. Somehow, poking tiny holes into the skin on your heads stimulates hair growth.\n\nResults of course very person to person. Something like 1% of men get rough side effects from fin. Some men experience hair regrowth. Others just experience less balding (shedding). Others don't see any progress at all.",
                    "author": "Antisystemization",
                    "id": "esyu5qa",
                    "parent_id": "t1_eswe1a8",
                    "score": 20,
                    "created_utc": 1562349651.0,
                    "replies": [
                        {
                            "body": "1. Finasteride is okay, I caught the rare ED issue, but most don't. I will say that they need to go the prescription route, as a doctor can prescribe and evaluate overtime as finasteride is a DHT Blocker, and people tend to forget that messing with hormones at such a crucial developmental time in their life can have life altering results. \n\n2. Minoxidil can help, but as it is only a low level DHT blocker itself, it can only stimulate growth in already opened follicles. If time passes and the follicles close, there is a good chance they won't produce anymore. It won't make hair appear, but only stimulate growth where growth was already possible.\n\n3. I may actually check this out, this one is new to me.\n\nI have a massive hormone deficiency and have to take Testosterone, estrogen blockers, DHT for side effects, and more. Losing my hair up top, while actually having some moderate success with Minoxidil for the beard.",
                            "author": "darkguardian823",
                            "id": "esz1ovs",
                            "parent_id": "t1_esyu5qa",
                            "score": 4,
                            "created_utc": 1562353584.0,
                            "replies": [
                                {
                                    "body": "What do you mean massive hormone déficience,  I cannot tolerate fin at all too ? On it my penile tissue changes Nd I get severe mental side effect too",
                                    "author": "Drakein2233",
                                    "id": "io3vj96",
                                    "parent_id": "t1_esz1ovs",
                                    "score": 1,
                                    "created_utc": 1662979694.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wait can you really not hug a girl? Like if you’re hanging out with friends and you meet up with them and give her a hug?",
                            "author": "ek1995",
                            "id": "esz268m",
                            "parent_id": "t1_esyu5qa",
                            "score": 2,
                            "created_utc": 1562353828.0,
                            "replies": [
                                {
                                    "body": "No, thats a little extreme. It takes weeks of consistent exposure to have an effect on adults. Infants, children, and cats however are all sensitive and can get side effects (and its lethal to cats). If you are living with a woman (girlfriend, wife, daughter, mom, sister, ect.) Then you may want to be careful that they don't come into daily contact with the product, and that they dont use your pillows.",
                                    "author": "Ozuf1",
                                    "id": "et0feh1",
                                    "parent_id": "t1_esz268m",
                                    "score": 2,
                                    "created_utc": 1562378129.0,
                                    "replies": [
                                        {
                                            "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
                                            "author": "say_chicha",
                                            "id": "et2zs24",
                                            "parent_id": "t1_et0feh1",
                                            "score": 2,
                                            "created_utc": 1562425672.0,
                                            "replies": [
                                                {
                                                    "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                                                    "author": "Ozuf1",
                                                    "id": "et37lja",
                                                    "parent_id": "t1_et2zs24",
                                                    "score": 1,
                                                    "created_utc": 1562429168.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No I'm sorry but your hair is very thin. You could go for a buzz cut or crewcut",
            "author": "Gravittyyy",
            "id": "esw6ujk",
            "parent_id": "t1_esw1oh5",
            "score": 39,
            "created_utc": 1562310067.0,
            "replies": []
        },
        {
            "body": "Thats thinning my son, embrace it. Ive had many friends go bald at the age of 24, and one back in highschool at 19. They all took it in stride.\n\nShave it clean, if your Polish double points because that hair is going to transfer to the rest of your body. Start working on it early and get some sun on your scalp so your skin tones match.\n\nIf this is the route you go, I would also say that you should kick your aerobics in gear. Ladies love fit bald runners. Im not joking.",
            "author": "Alchestbreach_ModAlt",
            "id": "eswbyom",
            "parent_id": "t1_esw1oh5",
            "score": 119,
            "created_utc": 1562312589.0,
            "replies": [
                {
                    "body": "I'm starting to lose my hair at 25 and this advice made me feel a lot better about it so thank you!",
                    "author": "Naveedamin7992",
                    "id": "esx3otf",
                    "parent_id": "t1_eswbyom",
                    "score": 22,
                    "created_utc": 1562324918.0,
                    "replies": [
                        {
                            "body": "Man, my best bud is bald and hes a handsome devil. You dont have to have hair to make it in life. In fact if you have it your given the tyranny of choice to find out how to make it look good. But a bald dude who takes that jazz in stride doesn't need to worry about any of that. In fact you dont need to be peak fitness either, just be healthy.\n\nWhen your in highschool, going bald might seem like a terror, but its just that masculine hairline going into overdrive for that sick amount of testosterone you got.",
                            "author": "Alchestbreach_ModAlt",
                            "id": "esz1696",
                            "parent_id": "t1_esx3otf",
                            "score": 2,
                            "created_utc": 1562353314.0,
                            "replies": [
                                {
                                    "body": "Lol I've never thought of it that way. It'd oddly comforting.\nMy problem is that I have pretty severe social anxiety and I feel like everyone will look at me like I'm a wierdo. Plus the fact that I'm extremely self conscious so I'm even more awkward than normal lol.\nI guess I just need to accept the inevitable baldness and try to become comfortable with myself.",
                                    "author": "Naveedamin7992",
                                    "id": "esz1qbv",
                                    "parent_id": "t1_esz1696",
                                    "score": 2,
                                    "created_utc": 1562353604.0,
                                    "replies": [
                                        {
                                            "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
                                            "author": "ObieCat",
                                            "id": "et2xvzf",
                                            "parent_id": "t1_esz1qbv",
                                            "score": 2,
                                            "created_utc": 1562424723.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Gotta love yourself man.",
                                            "author": "Alchestbreach_ModAlt",
                                            "id": "eszb4li",
                                            "parent_id": "t1_esz1qbv",
                                            "score": 1,
                                            "created_utc": 1562358603.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get on that propecia. It is the best thing out there and will help you maintain what you have as well as regrow some that you have lost.\n\nOnly thing is you have to take it forever to keep the results",
            "author": "fufm",
            "id": "esxuuzm",
            "parent_id": "t1_esw1oh5",
            "score": 2,
            "created_utc": 1562335529.0,
            "replies": []
        },
        {
            "body": "dermatologist",
            "author": null,
            "id": "esyuy7x",
            "parent_id": "t1_esw1oh5",
            "score": 1,
            "created_utc": 1562350101.0,
            "replies": []
        },
        {
            "body": "Could be bro.",
            "author": "randouser",
            "id": "iocchdi",
            "parent_id": "t1_esw1oh5",
            "score": 1,
            "created_utc": 1663121868.0,
            "replies": []
        },
        {
            "body": "I'm a doctor and you're dying",
            "author": "djrunk_djedi",
            "id": "esy0wd2",
            "parent_id": "t1_esxzfje",
            "score": 12,
            "created_utc": 1562337636.0,
            "replies": [
                {
                    "body": "Aren’t we all?",
                    "author": "Cheezewiz239",
                    "id": "esy0y3t",
                    "parent_id": "t1_esy0wd2",
                    "score": 2,
                    "created_utc": 1562337651.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s been minor evidence linking SOME non genetic hairloss to arteriorschlerois (the hardening of arteries from arterial plaque that causes heart disease). That plaque buildup is from cholesterol so it’s mainly diet related (or genetics of how your body handles cholesterol or a mystery of the universe with no none connection to red meat, depending on which food cult you belong)\n\nAnecdotally my hair started thinning 5 months ago when I got a high stress job and stopped sleeping barely at all. So for me, I’m trying to get more sleep and exercise :)\n\n(And yeah fast food usually fried food so cholesterol is off the charts.)",
            "author": "mindgamesweldon",
            "id": "esy3vb8",
            "parent_id": "t1_esxzfje",
            "score": 2,
            "created_utc": 1562338666.0,
            "replies": []
        },
        {
            "body": "Ok ! I hope I'm wrong bro. I hope you manage to keep your hair.",
            "author": null,
            "id": "esy40cg",
            "parent_id": "t1_esy347l",
            "score": 1,
            "created_utc": 1562338716.0,
            "replies": [
                {
                    "body": "Well thank you!\n\nI mean, a good strategy is to keep the hair short regardless, apply the medicine and treatments while maintaining a buzz",
                    "author": null,
                    "id": "esy48p8",
                    "parent_id": "t1_esy40cg",
                    "score": 1,
                    "created_utc": 1562338798.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Justsnuffthings.",
            "author": "MildlyAgreeable",
            "id": "esxk1wt",
            "parent_id": "t1_esxjypp",
            "score": 1,
            "created_utc": 1562331631.0,
            "replies": []
        },
        {
            "body": "They shave your head, numb up the back of your head (in my case), extract your hair follicles, have a break (by feeding you) and then start injecting said follicles into the site that you’re balding (and beyond it in order to future proof it).\n\nIt’s a bit sore for a few days (like sunburn) but they dress it all up and give you all the mild painkillers and antibiotics.\n\nI’m a year on and I’m really happy with it.",
            "author": "MildlyAgreeable",
            "id": "esxlr9p",
            "parent_id": "t1_esxl45c",
            "score": 6,
            "created_utc": 1562332276.0,
            "replies": [
                {
                    "body": "Thanks for the reply. I am intrigued because I currently have the same look as your first (before) pic. Just out of curiosity why did you go to Turkey, was it simply cheaper all things considered?",
                    "author": "kookman",
                    "id": "esyn4or",
                    "parent_id": "t1_esxlr9p",
                    "score": 1,
                    "created_utc": 1562345928.0,
                    "replies": [
                        {
                            "body": "You’re welcome! Yeah it’s like £5000 in the UK.\n\nI knew someone who had it done. I did my due diligence on the clinic and was happy with what I saw. They were very communicative and did everything they said they would. Plus the results were the main thing so I would recommend it.",
                            "author": "MildlyAgreeable",
                            "id": "esynbm2",
                            "parent_id": "t1_esyn4or",
                            "score": 2,
                            "created_utc": 1562346012.0,
                            "replies": [
                                {
                                    "body": "What do you call this procedure? I would like to research online about it and as a possible option.",
                                    "author": "joram000",
                                    "id": "et66jcw",
                                    "parent_id": "t1_esynbm2",
                                    "score": 1,
                                    "created_utc": 1562505234.0,
                                    "replies": [
                                        {
                                            "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
                                            "author": "MildlyAgreeable",
                                            "id": "et6kpva",
                                            "parent_id": "t1_et66jcw",
                                            "score": 1,
                                            "created_utc": 1562514606.0,
                                            "replies": [
                                                {
                                                    "body": "How does it look rn",
                                                    "author": "Ok_Oil1834",
                                                    "id": "hwpikc1",
                                                    "parent_id": "t1_et6kpva",
                                                    "score": 1,
                                                    "created_utc": 1644708174.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yeah still good, man 👍🏻",
                                                            "author": "MildlyAgreeable",
                                                            "id": "hwrfsle",
                                                            "parent_id": "t1_hwpikc1",
                                                            "score": 1,
                                                            "created_utc": 1644746736.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They implanted hair further back than from where I was balding - sort of like a double layer. It didn’t disrupt the other natural follicles so it grows normally and isn’t thick on the ‘border’ of the hairline.\n\nIf, for some reason, my hair starting going bald further back than it was originally (it had gone back as far as it could and had stayed at that point for years) then the new follicles would still be there.",
            "author": "MildlyAgreeable",
            "id": "esysa9y",
            "parent_id": "t1_esyrx00",
            "score": 2,
            "created_utc": 1562348519.0,
            "replies": [
                {
                    "body": "ohh, okay, thanks for explaining",
                    "author": "AyeAye_Kane",
                    "id": "esyserd",
                    "parent_id": "t1_esysa9y",
                    "score": 2,
                    "created_utc": 1562348596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wtf bro, did you at least see a dermatologist about it? You're too young for this shit.",
            "author": "RadamanthysWyvern",
            "id": "ezruuqx",
            "parent_id": "t1_ezrucnh",
            "score": 1,
            "created_utc": 1568079107.0,
            "replies": [
                {
                    "body": "I did and I was honestly shocked how careless he sounded when I talked about this. I showed him this picture and he replied : \" its normal, some people are just born with less hair \".",
                    "author": "EvilSammyy",
                    "id": "ezrv10c",
                    "parent_id": "t1_ezruuqx",
                    "score": 1,
                    "created_utc": 1568079171.0,
                    "replies": [
                        {
                            "body": "What a pos. I would consult another one, unless this was just a downright unflattering pic or your hair has gotten better since.",
                            "author": "RadamanthysWyvern",
                            "id": "ezrvdoh",
                            "parent_id": "t1_ezrv10c",
                            "score": 1,
                            "created_utc": 1568079307.0,
                            "replies": [
                                {
                                    "body": "To be fair, my hair was wet in this pic and all clumped up together, I could post a picture of my hair rn",
                                    "author": "EvilSammyy",
                                    "id": "ezrw0ad",
                                    "parent_id": "t1_ezrvdoh",
                                    "score": 1,
                                    "created_utc": 1568079559.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why was your hair thinning?",
            "author": "At0m123",
            "id": "esyhmfi",
            "parent_id": "t1_esxbdle",
            "score": 22,
            "created_utc": 1562343621.0,
            "replies": [
                {
                    "body": "It can actually be hereditary even at that age, or a sign of malnutrition.",
                    "author": "darkguardian823",
                    "id": "esz026u",
                    "parent_id": "t1_esyhmfi",
                    "score": 10,
                    "created_utc": 1562352740.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> they prescribed some meds\n\nWhich are???",
            "author": "Applesauce3750",
            "id": "irdhnvv",
            "parent_id": "t1_esxbdle",
            "score": 1,
            "created_utc": 1665120763.0,
            "replies": []
        },
        {
            "body": "Have the meds still been working or?",
            "author": "A7kt",
            "id": "jelv42v",
            "parent_id": "t1_esxbdle",
            "score": 1,
            "created_utc": 1680397857.0,
            "replies": []
        },
        {
            "body": "If you have hair loss from dandruff then you really need to see a GP and get referred to a Dermatologist, or go straight to a Dermatologist. I know financial situations can make that hard or next to impossible, but if it's developed enough to be causing hair loss it really needs to be checked out.",
            "author": "Lucosis",
            "id": "esyiqfp",
            "parent_id": "t1_esy1u0p",
            "score": 11,
            "created_utc": 1562344077.0,
            "replies": []
        },
        {
            "body": "Since r/tressless is now overrun with incels, I'll just list the main takeaway:\n\nThere are 3 known ways to curb male balding:\n\n1.\tFinasteride (pills). 1mg is what is preferred. Some buy the 5mg and cut them up. HIMS now sells fin for a shit ton of money, but a prescription is dirt cheap.\n2.\tMinoxidil. This is the chemical within Rogain. You apply it to your head 1-2 times a day. There's a foam version and syrup-y version. Minox-beards are also a thing, especially for trans guys. Anywhere you put minox, hair will grow (which means that you shouldn't hug women, especially pregnant women, when using). \n3.\tDermarolling. Dermapens are the go-to device. Somehow, poking tiny holes into the skin on your heads stimulates hair growth.\n\nResults of course very person to person. Something like 1% of men get rough side effects from fin. Some men experience hair regrowth. Others just experience less balding (shedding). Others don't see any progress at all.",
            "author": "Antisystemization",
            "id": "esyu5qa",
            "parent_id": "t1_eswe1a8",
            "score": 20,
            "created_utc": 1562349651.0,
            "replies": [
                {
                    "body": "1. Finasteride is okay, I caught the rare ED issue, but most don't. I will say that they need to go the prescription route, as a doctor can prescribe and evaluate overtime as finasteride is a DHT Blocker, and people tend to forget that messing with hormones at such a crucial developmental time in their life can have life altering results. \n\n2. Minoxidil can help, but as it is only a low level DHT blocker itself, it can only stimulate growth in already opened follicles. If time passes and the follicles close, there is a good chance they won't produce anymore. It won't make hair appear, but only stimulate growth where growth was already possible.\n\n3. I may actually check this out, this one is new to me.\n\nI have a massive hormone deficiency and have to take Testosterone, estrogen blockers, DHT for side effects, and more. Losing my hair up top, while actually having some moderate success with Minoxidil for the beard.",
                    "author": "darkguardian823",
                    "id": "esz1ovs",
                    "parent_id": "t1_esyu5qa",
                    "score": 4,
                    "created_utc": 1562353584.0,
                    "replies": [
                        {
                            "body": "What do you mean massive hormone déficience,  I cannot tolerate fin at all too ? On it my penile tissue changes Nd I get severe mental side effect too",
                            "author": "Drakein2233",
                            "id": "io3vj96",
                            "parent_id": "t1_esz1ovs",
                            "score": 1,
                            "created_utc": 1662979694.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wait can you really not hug a girl? Like if you’re hanging out with friends and you meet up with them and give her a hug?",
                    "author": "ek1995",
                    "id": "esz268m",
                    "parent_id": "t1_esyu5qa",
                    "score": 2,
                    "created_utc": 1562353828.0,
                    "replies": [
                        {
                            "body": "No, thats a little extreme. It takes weeks of consistent exposure to have an effect on adults. Infants, children, and cats however are all sensitive and can get side effects (and its lethal to cats). If you are living with a woman (girlfriend, wife, daughter, mom, sister, ect.) Then you may want to be careful that they don't come into daily contact with the product, and that they dont use your pillows.",
                            "author": "Ozuf1",
                            "id": "et0feh1",
                            "parent_id": "t1_esz268m",
                            "score": 2,
                            "created_utc": 1562378129.0,
                            "replies": [
                                {
                                    "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
                                    "author": "say_chicha",
                                    "id": "et2zs24",
                                    "parent_id": "t1_et0feh1",
                                    "score": 2,
                                    "created_utc": 1562425672.0,
                                    "replies": [
                                        {
                                            "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                                            "author": "Ozuf1",
                                            "id": "et37lja",
                                            "parent_id": "t1_et2zs24",
                                            "score": 1,
                                            "created_utc": 1562429168.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm starting to lose my hair at 25 and this advice made me feel a lot better about it so thank you!",
            "author": "Naveedamin7992",
            "id": "esx3otf",
            "parent_id": "t1_eswbyom",
            "score": 22,
            "created_utc": 1562324918.0,
            "replies": [
                {
                    "body": "Man, my best bud is bald and hes a handsome devil. You dont have to have hair to make it in life. In fact if you have it your given the tyranny of choice to find out how to make it look good. But a bald dude who takes that jazz in stride doesn't need to worry about any of that. In fact you dont need to be peak fitness either, just be healthy.\n\nWhen your in highschool, going bald might seem like a terror, but its just that masculine hairline going into overdrive for that sick amount of testosterone you got.",
                    "author": "Alchestbreach_ModAlt",
                    "id": "esz1696",
                    "parent_id": "t1_esx3otf",
                    "score": 2,
                    "created_utc": 1562353314.0,
                    "replies": [
                        {
                            "body": "Lol I've never thought of it that way. It'd oddly comforting.\nMy problem is that I have pretty severe social anxiety and I feel like everyone will look at me like I'm a wierdo. Plus the fact that I'm extremely self conscious so I'm even more awkward than normal lol.\nI guess I just need to accept the inevitable baldness and try to become comfortable with myself.",
                            "author": "Naveedamin7992",
                            "id": "esz1qbv",
                            "parent_id": "t1_esz1696",
                            "score": 2,
                            "created_utc": 1562353604.0,
                            "replies": [
                                {
                                    "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
                                    "author": "ObieCat",
                                    "id": "et2xvzf",
                                    "parent_id": "t1_esz1qbv",
                                    "score": 2,
                                    "created_utc": 1562424723.0,
                                    "replies": []
                                },
                                {
                                    "body": "Gotta love yourself man.",
                                    "author": "Alchestbreach_ModAlt",
                                    "id": "eszb4li",
                                    "parent_id": "t1_esz1qbv",
                                    "score": 1,
                                    "created_utc": 1562358603.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aren’t we all?",
            "author": "Cheezewiz239",
            "id": "esy0y3t",
            "parent_id": "t1_esy0wd2",
            "score": 2,
            "created_utc": 1562337651.0,
            "replies": []
        },
        {
            "body": "Well thank you!\n\nI mean, a good strategy is to keep the hair short regardless, apply the medicine and treatments while maintaining a buzz",
            "author": null,
            "id": "esy48p8",
            "parent_id": "t1_esy40cg",
            "score": 1,
            "created_utc": 1562338798.0,
            "replies": []
        },
        {
            "body": "Thanks for the reply. I am intrigued because I currently have the same look as your first (before) pic. Just out of curiosity why did you go to Turkey, was it simply cheaper all things considered?",
            "author": "kookman",
            "id": "esyn4or",
            "parent_id": "t1_esxlr9p",
            "score": 1,
            "created_utc": 1562345928.0,
            "replies": [
                {
                    "body": "You’re welcome! Yeah it’s like £5000 in the UK.\n\nI knew someone who had it done. I did my due diligence on the clinic and was happy with what I saw. They were very communicative and did everything they said they would. Plus the results were the main thing so I would recommend it.",
                    "author": "MildlyAgreeable",
                    "id": "esynbm2",
                    "parent_id": "t1_esyn4or",
                    "score": 2,
                    "created_utc": 1562346012.0,
                    "replies": [
                        {
                            "body": "What do you call this procedure? I would like to research online about it and as a possible option.",
                            "author": "joram000",
                            "id": "et66jcw",
                            "parent_id": "t1_esynbm2",
                            "score": 1,
                            "created_utc": 1562505234.0,
                            "replies": [
                                {
                                    "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
                                    "author": "MildlyAgreeable",
                                    "id": "et6kpva",
                                    "parent_id": "t1_et66jcw",
                                    "score": 1,
                                    "created_utc": 1562514606.0,
                                    "replies": [
                                        {
                                            "body": "How does it look rn",
                                            "author": "Ok_Oil1834",
                                            "id": "hwpikc1",
                                            "parent_id": "t1_et6kpva",
                                            "score": 1,
                                            "created_utc": 1644708174.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah still good, man 👍🏻",
                                                    "author": "MildlyAgreeable",
                                                    "id": "hwrfsle",
                                                    "parent_id": "t1_hwpikc1",
                                                    "score": 1,
                                                    "created_utc": 1644746736.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "ohh, okay, thanks for explaining",
            "author": "AyeAye_Kane",
            "id": "esyserd",
            "parent_id": "t1_esysa9y",
            "score": 2,
            "created_utc": 1562348596.0,
            "replies": []
        },
        {
            "body": "I did and I was honestly shocked how careless he sounded when I talked about this. I showed him this picture and he replied : \" its normal, some people are just born with less hair \".",
            "author": "EvilSammyy",
            "id": "ezrv10c",
            "parent_id": "t1_ezruuqx",
            "score": 1,
            "created_utc": 1568079171.0,
            "replies": [
                {
                    "body": "What a pos. I would consult another one, unless this was just a downright unflattering pic or your hair has gotten better since.",
                    "author": "RadamanthysWyvern",
                    "id": "ezrvdoh",
                    "parent_id": "t1_ezrv10c",
                    "score": 1,
                    "created_utc": 1568079307.0,
                    "replies": [
                        {
                            "body": "To be fair, my hair was wet in this pic and all clumped up together, I could post a picture of my hair rn",
                            "author": "EvilSammyy",
                            "id": "ezrw0ad",
                            "parent_id": "t1_ezrvdoh",
                            "score": 1,
                            "created_utc": 1568079559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It can actually be hereditary even at that age, or a sign of malnutrition.",
            "author": "darkguardian823",
            "id": "esz026u",
            "parent_id": "t1_esyhmfi",
            "score": 10,
            "created_utc": 1562352740.0,
            "replies": []
        },
        {
            "body": "1. Finasteride is okay, I caught the rare ED issue, but most don't. I will say that they need to go the prescription route, as a doctor can prescribe and evaluate overtime as finasteride is a DHT Blocker, and people tend to forget that messing with hormones at such a crucial developmental time in their life can have life altering results. \n\n2. Minoxidil can help, but as it is only a low level DHT blocker itself, it can only stimulate growth in already opened follicles. If time passes and the follicles close, there is a good chance they won't produce anymore. It won't make hair appear, but only stimulate growth where growth was already possible.\n\n3. I may actually check this out, this one is new to me.\n\nI have a massive hormone deficiency and have to take Testosterone, estrogen blockers, DHT for side effects, and more. Losing my hair up top, while actually having some moderate success with Minoxidil for the beard.",
            "author": "darkguardian823",
            "id": "esz1ovs",
            "parent_id": "t1_esyu5qa",
            "score": 4,
            "created_utc": 1562353584.0,
            "replies": [
                {
                    "body": "What do you mean massive hormone déficience,  I cannot tolerate fin at all too ? On it my penile tissue changes Nd I get severe mental side effect too",
                    "author": "Drakein2233",
                    "id": "io3vj96",
                    "parent_id": "t1_esz1ovs",
                    "score": 1,
                    "created_utc": 1662979694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wait can you really not hug a girl? Like if you’re hanging out with friends and you meet up with them and give her a hug?",
            "author": "ek1995",
            "id": "esz268m",
            "parent_id": "t1_esyu5qa",
            "score": 2,
            "created_utc": 1562353828.0,
            "replies": [
                {
                    "body": "No, thats a little extreme. It takes weeks of consistent exposure to have an effect on adults. Infants, children, and cats however are all sensitive and can get side effects (and its lethal to cats). If you are living with a woman (girlfriend, wife, daughter, mom, sister, ect.) Then you may want to be careful that they don't come into daily contact with the product, and that they dont use your pillows.",
                    "author": "Ozuf1",
                    "id": "et0feh1",
                    "parent_id": "t1_esz268m",
                    "score": 2,
                    "created_utc": 1562378129.0,
                    "replies": [
                        {
                            "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
                            "author": "say_chicha",
                            "id": "et2zs24",
                            "parent_id": "t1_et0feh1",
                            "score": 2,
                            "created_utc": 1562425672.0,
                            "replies": [
                                {
                                    "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                                    "author": "Ozuf1",
                                    "id": "et37lja",
                                    "parent_id": "t1_et2zs24",
                                    "score": 1,
                                    "created_utc": 1562429168.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Man, my best bud is bald and hes a handsome devil. You dont have to have hair to make it in life. In fact if you have it your given the tyranny of choice to find out how to make it look good. But a bald dude who takes that jazz in stride doesn't need to worry about any of that. In fact you dont need to be peak fitness either, just be healthy.\n\nWhen your in highschool, going bald might seem like a terror, but its just that masculine hairline going into overdrive for that sick amount of testosterone you got.",
            "author": "Alchestbreach_ModAlt",
            "id": "esz1696",
            "parent_id": "t1_esx3otf",
            "score": 2,
            "created_utc": 1562353314.0,
            "replies": [
                {
                    "body": "Lol I've never thought of it that way. It'd oddly comforting.\nMy problem is that I have pretty severe social anxiety and I feel like everyone will look at me like I'm a wierdo. Plus the fact that I'm extremely self conscious so I'm even more awkward than normal lol.\nI guess I just need to accept the inevitable baldness and try to become comfortable with myself.",
                    "author": "Naveedamin7992",
                    "id": "esz1qbv",
                    "parent_id": "t1_esz1696",
                    "score": 2,
                    "created_utc": 1562353604.0,
                    "replies": [
                        {
                            "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
                            "author": "ObieCat",
                            "id": "et2xvzf",
                            "parent_id": "t1_esz1qbv",
                            "score": 2,
                            "created_utc": 1562424723.0,
                            "replies": []
                        },
                        {
                            "body": "Gotta love yourself man.",
                            "author": "Alchestbreach_ModAlt",
                            "id": "eszb4li",
                            "parent_id": "t1_esz1qbv",
                            "score": 1,
                            "created_utc": 1562358603.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re welcome! Yeah it’s like £5000 in the UK.\n\nI knew someone who had it done. I did my due diligence on the clinic and was happy with what I saw. They were very communicative and did everything they said they would. Plus the results were the main thing so I would recommend it.",
            "author": "MildlyAgreeable",
            "id": "esynbm2",
            "parent_id": "t1_esyn4or",
            "score": 2,
            "created_utc": 1562346012.0,
            "replies": [
                {
                    "body": "What do you call this procedure? I would like to research online about it and as a possible option.",
                    "author": "joram000",
                    "id": "et66jcw",
                    "parent_id": "t1_esynbm2",
                    "score": 1,
                    "created_utc": 1562505234.0,
                    "replies": [
                        {
                            "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
                            "author": "MildlyAgreeable",
                            "id": "et6kpva",
                            "parent_id": "t1_et66jcw",
                            "score": 1,
                            "created_utc": 1562514606.0,
                            "replies": [
                                {
                                    "body": "How does it look rn",
                                    "author": "Ok_Oil1834",
                                    "id": "hwpikc1",
                                    "parent_id": "t1_et6kpva",
                                    "score": 1,
                                    "created_utc": 1644708174.0,
                                    "replies": [
                                        {
                                            "body": "Yeah still good, man 👍🏻",
                                            "author": "MildlyAgreeable",
                                            "id": "hwrfsle",
                                            "parent_id": "t1_hwpikc1",
                                            "score": 1,
                                            "created_utc": 1644746736.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a pos. I would consult another one, unless this was just a downright unflattering pic or your hair has gotten better since.",
            "author": "RadamanthysWyvern",
            "id": "ezrvdoh",
            "parent_id": "t1_ezrv10c",
            "score": 1,
            "created_utc": 1568079307.0,
            "replies": [
                {
                    "body": "To be fair, my hair was wet in this pic and all clumped up together, I could post a picture of my hair rn",
                    "author": "EvilSammyy",
                    "id": "ezrw0ad",
                    "parent_id": "t1_ezrvdoh",
                    "score": 1,
                    "created_utc": 1568079559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you mean massive hormone déficience,  I cannot tolerate fin at all too ? On it my penile tissue changes Nd I get severe mental side effect too",
            "author": "Drakein2233",
            "id": "io3vj96",
            "parent_id": "t1_esz1ovs",
            "score": 1,
            "created_utc": 1662979694.0,
            "replies": []
        },
        {
            "body": "No, thats a little extreme. It takes weeks of consistent exposure to have an effect on adults. Infants, children, and cats however are all sensitive and can get side effects (and its lethal to cats). If you are living with a woman (girlfriend, wife, daughter, mom, sister, ect.) Then you may want to be careful that they don't come into daily contact with the product, and that they dont use your pillows.",
            "author": "Ozuf1",
            "id": "et0feh1",
            "parent_id": "t1_esz268m",
            "score": 2,
            "created_utc": 1562378129.0,
            "replies": [
                {
                    "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
                    "author": "say_chicha",
                    "id": "et2zs24",
                    "parent_id": "t1_et0feh1",
                    "score": 2,
                    "created_utc": 1562425672.0,
                    "replies": [
                        {
                            "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                            "author": "Ozuf1",
                            "id": "et37lja",
                            "parent_id": "t1_et2zs24",
                            "score": 1,
                            "created_utc": 1562429168.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol I've never thought of it that way. It'd oddly comforting.\nMy problem is that I have pretty severe social anxiety and I feel like everyone will look at me like I'm a wierdo. Plus the fact that I'm extremely self conscious so I'm even more awkward than normal lol.\nI guess I just need to accept the inevitable baldness and try to become comfortable with myself.",
            "author": "Naveedamin7992",
            "id": "esz1qbv",
            "parent_id": "t1_esz1696",
            "score": 2,
            "created_utc": 1562353604.0,
            "replies": [
                {
                    "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
                    "author": "ObieCat",
                    "id": "et2xvzf",
                    "parent_id": "t1_esz1qbv",
                    "score": 2,
                    "created_utc": 1562424723.0,
                    "replies": []
                },
                {
                    "body": "Gotta love yourself man.",
                    "author": "Alchestbreach_ModAlt",
                    "id": "eszb4li",
                    "parent_id": "t1_esz1qbv",
                    "score": 1,
                    "created_utc": 1562358603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you call this procedure? I would like to research online about it and as a possible option.",
            "author": "joram000",
            "id": "et66jcw",
            "parent_id": "t1_esynbm2",
            "score": 1,
            "created_utc": 1562505234.0,
            "replies": [
                {
                    "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
                    "author": "MildlyAgreeable",
                    "id": "et6kpva",
                    "parent_id": "t1_et66jcw",
                    "score": 1,
                    "created_utc": 1562514606.0,
                    "replies": [
                        {
                            "body": "How does it look rn",
                            "author": "Ok_Oil1834",
                            "id": "hwpikc1",
                            "parent_id": "t1_et6kpva",
                            "score": 1,
                            "created_utc": 1644708174.0,
                            "replies": [
                                {
                                    "body": "Yeah still good, man 👍🏻",
                                    "author": "MildlyAgreeable",
                                    "id": "hwrfsle",
                                    "parent_id": "t1_hwpikc1",
                                    "score": 1,
                                    "created_utc": 1644746736.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, my hair was wet in this pic and all clumped up together, I could post a picture of my hair rn",
            "author": "EvilSammyy",
            "id": "ezrw0ad",
            "parent_id": "t1_ezrvdoh",
            "score": 1,
            "created_utc": 1568079559.0,
            "replies": []
        },
        {
            "body": "But women and children aren't supposed to handle finasteride (or dutasteride for that matter) without gloves because it gets absorbed through the skin, even in pill form. You're also supposed to clean the counting tray right after you dispense either of these. At least that's what they taught me in pharmacy school.",
            "author": "say_chicha",
            "id": "et2zs24",
            "parent_id": "t1_et0feh1",
            "score": 2,
            "created_utc": 1562425672.0,
            "replies": [
                {
                    "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
                    "author": "Ozuf1",
                    "id": "et37lja",
                    "parent_id": "t1_et2zs24",
                    "score": 1,
                    "created_utc": 1562429168.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe this will make it easier to interact with people? And anytime you feel self-conscious, just rub your palm on your scalp - it feels good!",
            "author": "ObieCat",
            "id": "et2xvzf",
            "parent_id": "t1_esz1qbv",
            "score": 2,
            "created_utc": 1562424723.0,
            "replies": []
        },
        {
            "body": "Gotta love yourself man.",
            "author": "Alchestbreach_ModAlt",
            "id": "eszb4li",
            "parent_id": "t1_esz1qbv",
            "score": 1,
            "created_utc": 1562358603.0,
            "replies": []
        },
        {
            "body": "It’s called FUE (follicular unit extraction). DM me if you have any questions.",
            "author": "MildlyAgreeable",
            "id": "et6kpva",
            "parent_id": "t1_et66jcw",
            "score": 1,
            "created_utc": 1562514606.0,
            "replies": [
                {
                    "body": "How does it look rn",
                    "author": "Ok_Oil1834",
                    "id": "hwpikc1",
                    "parent_id": "t1_et6kpva",
                    "score": 1,
                    "created_utc": 1644708174.0,
                    "replies": [
                        {
                            "body": "Yeah still good, man 👍🏻",
                            "author": "MildlyAgreeable",
                            "id": "hwrfsle",
                            "parent_id": "t1_hwpikc1",
                            "score": 1,
                            "created_utc": 1644746736.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Finasteride is a DHT blocker in its purest form, it blocks the production of DHT to something like 70-80% which in women can have some real issues because they dont produce much of it at all anyways. And children need DHT as its an important growth (maturity) hormone. \n\nThe post was about minoxidil which is sold as an alcohol based solution with a small percentage of that being actual minoxidil. Minoxidil is a vasodialator not a DHT blocker, so the effects of exposure arent as bad or gender dependant. Minoxidil can still be harmful if mis managed but you dont need to shun human contact if your using it, like the poster was asking about.\n\n\nHowever I'm just an armchair researcher, if your phramasy program has taught you otherwise please let me know so i can edit my post accordingly",
            "author": "Ozuf1",
            "id": "et37lja",
            "parent_id": "t1_et2zs24",
            "score": 1,
            "created_utc": 1562429168.0,
            "replies": []
        },
        {
            "body": "How does it look rn",
            "author": "Ok_Oil1834",
            "id": "hwpikc1",
            "parent_id": "t1_et6kpva",
            "score": 1,
            "created_utc": 1644708174.0,
            "replies": [
                {
                    "body": "Yeah still good, man 👍🏻",
                    "author": "MildlyAgreeable",
                    "id": "hwrfsle",
                    "parent_id": "t1_hwpikc1",
                    "score": 1,
                    "created_utc": 1644746736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah still good, man 👍🏻",
            "author": "MildlyAgreeable",
            "id": "hwrfsle",
            "parent_id": "t1_hwpikc1",
            "score": 1,
            "created_utc": 1644746736.0,
            "replies": []
        }
    ]
}