{
    "title": "I made a list of Green, Yellow, and Red flags leading up to the first M&G for Sugar Babies to look out for",
    "post_id": "wemi90",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wemi90/i_made_a_list_of_green_yellow_and_red_flags/",
    "author": null,
    "body": "I have been in two successful long term arrangements, and it took a bit of looking each time to find the right person. I hope these guidelines can help other women weed out who is serious, who is not, and who is going to be a massive headache to deal with. With the right person, the M&G process should be easy and exciting :) \n\nThis post is not meant to be about complaining, it’s just to help others like me find their best match.\n\n\n**Green Flags**\n\nHe opens with a detailed message about himself and what he is looking for. Bonus points if he includes something specific he liked about your profile. \n\nHe suggests a time (or multiple times to choose from) to meet. He suggests a nice place, or shows enthusiasm about the place you choose. \n\nHe sends photos without you having to ask, or explains why he isn’t comfortable sending photos yet and provides some form of verification.\n\nHe is clear that he understands what a sugar relationship is, and communicates exactly what he wants without being overtly sexual. \n\nDuring the M&G, he asks questions about you, and listens to what you have to say. He is open to talking about the terms of the arrangement. You are able to come to an agreement about what works for you both. You feel comfortable telling him your needs. You have the sense that he wants to make you happy. \n\nHe makes it clear that he is happy to see you and is enjoying your company. By the end, you feel that you are both on the same page, and are ideally looking forward to a second date. \n\n**Yellow Flags** \n\nHe opens with a generic message like “How are you?”. If his profile is detailed it’s not a big deal. \n\nHe wants to meet but insists you choose the time/place and doesn’t give much input. \n\nHe sends photos only after being asked (despite requesting more pictures from you.) \n\nHe asks, “What are you looking for?” and then answers, “I could do that.” He is not clear about what he wants or expects. Maybe he could do that, maybe not. Some men will say anything. \n\nThe M&G is awkward. The conversation doesn’t flow well. You feel like you are carrying the conversation. \n\nYou leave the date unsure about how you feel. It could just be the awkwardness of meeting a new person, or it could be a bad fit. It’s up to you to decide if you want to move forward.\n\n**Red Flags (Instant Next)**\n\nHe opens with a generic compliment or some other odd statement that is difficult to reply to. (“Wow!” “You’re so sexy!”) He opens with an overtly sexual message about his fetishes or desires, or he brings them up before talking about anything else. He opens by saying he is only in your city for one night (a few days, one week) and wants to meet up. \n\nHe wants to meet immediately. He insists on picking you up (personally, I think even offering is weird.) He insists you meet at his house. Or he insists you choose the location for the date, but then rejects your choice without offering another option.\n\nHe keeps asking you for more photos (even if he has sent some.) He asks you for “sexy” or nude photos before you have met. His photos are clearly decades old. He refuses to send any photos at all or do a video call. You aren’t the least bit attracted to him. \n\nHe asks what you are looking for, then tries to talk you down. The wealthier he claims to be, the more concerning this is. A gentleman will simply tell you he is not able to meet your needs and try to compromise or let you go. He tells you he doesn’t want to talk about money. He tells you he doesn’t want something “transactional”. He tells you that you can ask him for “help” sometimes if you “need” it, but that’s it. He makes vague promises but refuses to be specific about his capabilities. \n\nHe tries to engage with you sexually before agreeing on the terms of the arrangement, and gets offended when you reject his advances. Or he makes advances and you feel like you can’t say “No”, even though you want to. At any point, you feel uncomfortable bringing up the terms of the arrangement with him, telling him how you feel, or asking for what you need. \n\nThe M&G is chaotic. Maybe there were some exciting parts, but there were also things you did not like. He interrupts you. He insists on ordering for you. He spends the whole time talking about himself. He gives you back-handed compliments. He criticizes you in any way. He has bad hygiene, or doesn’t dress well. He shows up excessively late (15+mins). He doesn’t look like his pictures, or used certain pictures to hide that he was overweight. He insists you get in his car. He feels entitled to sex after the date. You didn’t discuss the terms of the arrangement at all. Or, you agree on terms, and he demands you delete your account and stop seeing anyone else. \n\nHe brings up marriage, commitment, children, or making other major life decisions with you like they are no big deal. You don’t have any reason to trust that he is who he says he is (claims to be a millionaire businessman but has no social skills, his story lacks any real details, etc). He asks you highly personal questions. He tells you too much personal information about himself. Going into detail about his divorce, his marital problems, or his complaints about his past girlfriend/sugar baby is a sign for you to RUN!!!! You leave the date feeling overwhelmed, exhausted, irritated, or sad.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wemi90/i_made_a_list_of_green_yellow_and_red_flags/",
    "score": 103,
    "upvote_ratio": 0.95,
    "created_utc": 1659472876.0,
    "num_comments": 21,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Love this post. \n\nA good SD should be making your life easier.\nIf it doesn’t feel like this is happening right away, I don’t stick around.",
            "author": "_Potion_",
            "id": "iip5jnp",
            "parent_id": "t3_wemi90",
            "score": 24,
            "created_utc": 1659475704.0,
            "replies": [
                {
                    "body": "Second this. Always trust your gut instinct, and if it isn’t 100% yes, then it’s a no!",
                    "author": "tshhh_xo",
                    "id": "iipa4zs",
                    "parent_id": "t1_iip5jnp",
                    "score": 5,
                    "created_utc": 1659477490.0,
                    "replies": []
                },
                {
                    "body": "Also true other way around",
                    "author": "asaprockynaurdwar",
                    "id": "iiqu0ut",
                    "parent_id": "t1_iip5jnp",
                    "score": 1,
                    "created_utc": 1659503302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> green flag: he opens with a detailed message about himself and what he is looking for \n\nFrom what I’ve seen from former SB’s messages, this often is not a green flag. There are many men who are writing out novels about what they want and then spam sending them to as many SBs as they can. \n\nThey aren’t interested in you when they do that, they literally will take almost anyone",
            "author": null,
            "id": "iipqh9u",
            "parent_id": "t3_wemi90",
            "score": 10,
            "created_utc": 1659484272.0,
            "replies": [
                {
                    "body": "I think if it relates to your profile, it's a green flag. Copy-pasted are usually pretty easy to spot, but I'll take a c&p with a personal touch added as marginally good and have a tentative conversation with them.",
                    "author": "justabebeh",
                    "id": "iisfouz",
                    "parent_id": "t1_iipqh9u",
                    "score": 4,
                    "created_utc": 1659538791.0,
                    "replies": []
                },
                {
                    "body": "Lots of SBs do this too. Ctrl+C, Ctrl+V. Send.",
                    "author": "non_giant_panda",
                    "id": "iiqq7hn",
                    "parent_id": "t1_iipqh9u",
                    "score": 3,
                    "created_utc": 1659501022.0,
                    "replies": [
                        {
                            "body": "Yup, it’s just usually they don’t send 3 paragraphs about their ideal arrangement. Frankly lots of SBs just send “hey”",
                            "author": null,
                            "id": "iiqqdpq",
                            "parent_id": "t1_iiqq7hn",
                            "score": 3,
                            "created_utc": 1659501122.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very good advice. I’m pleased to see how well aligned I am with your green flags, and avoiding the yellows and reds. So I totally agree.",
            "author": "SD-47",
            "id": "iioymws",
            "parent_id": "t3_wemi90",
            "score": 7,
            "created_utc": 1659473075.0,
            "replies": []
        },
        {
            "body": "Glorious! Thank you for posting. I’ve decided I’ll never negotiate with a POT - just leaves me feeling like a commodity. The few times I did negotiate, I felt gross.",
            "author": "vinoweknow",
            "id": "iip01w7",
            "parent_id": "t3_wemi90",
            "score": 8,
            "created_utc": 1659473610.0,
            "replies": []
        },
        {
            "body": "My M&G is just like first date since I don’t really care about allowance or pppm stuff .. \n\nThe worst off putting behaviour is to ask for nude or send me his nude photos. \n\nThat really doesn’t get him far. I let him off once but he asks again, I probably just ignore/block him and move on.. too shallow and stupid for my taste. \n\nIt’s a very animal behaviour to me. You don’t share your penis to people you barely know unless you are a bull on heat. I seek a gentleman not a stupid bull. Thanks.",
            "author": null,
            "id": "iipanz7",
            "parent_id": "t3_wemi90",
            "score": 9,
            "created_utc": 1659477695.0,
            "replies": []
        },
        {
            "body": "This is excellent. A healthy sugar relationship is a relationship first with an exceptional amount of candor and clarity in communication. If you get a sense you’re being manipulated into an outcome other than a real relationship with expectations out on the table, trust your instincts and move on. I want to know what a pot SB’s figure looks like, but I don’t ask for nudes. I want to know about her and whether we are going to have fun together. I want to know if I can genuinely help her in life. If the conversations you’re having aren’t headed in the direction of the relationship you want, move on. Proceeding on hope of something different is somewhere between dangerous and disappointment.",
            "author": "granobo",
            "id": "iiqr997",
            "parent_id": "t3_wemi90",
            "score": 3,
            "created_utc": 1659501631.0,
            "replies": []
        },
        {
            "body": "Wow, thank you so much! This totally lines up with my experiences in the bowl. This post should be pinned!",
            "author": "Fin_Dom_Princess",
            "id": "iiviv5c",
            "parent_id": "t3_wemi90",
            "score": 3,
            "created_utc": 1659586826.0,
            "replies": []
        },
        {
            "body": "My SD literally checks all the green flags. When we first video chatted he saw that I looked young and politely confirmed I was of age before moving forward. Such an unexpected turn on!",
            "author": "Fin_Dom_Princess",
            "id": "iivj6y4",
            "parent_id": "t3_wemi90",
            "score": 3,
            "created_utc": 1659587003.0,
            "replies": []
        },
        {
            "body": ">\"You didn’t discuss the terms of the arrangement at all.\"\n\nMany SDs discuts the arrangement after the M&G so not a red flag\n\n- Can have several M&Gs so cant choose yet\n\n- I remember a M&G dinner where we were sitted next to a group of old women that sended us black eyes looks: talking arrangement wasnt \npossible near those old witches",
            "author": "GuyFromParis",
            "id": "iiqzw9e",
            "parent_id": "t3_wemi90",
            "score": 4,
            "created_utc": 1659507245.0,
            "replies": []
        },
        {
            "body": ">He sends photos without you having to ask, or explains why he isn’t comfortable sending photos yet and provides some form of verification.\n\nThis is a tricky one for me.  Generally speaking, I send face photos as soon as I'm comfortable -- which means, if she's asking for a face photo, by definition I'm not ready to send it yet, or I would have already sent it (I have multiple body photos on my profile already so this has to be a face photo request).  I do explain that I'd like to see if we're compatible first.  But I don't, and would never, \"provide some form of verification\" in lieu of a face photo, and I don't know that there's many SDs who would.   What do you have in mind as far as that form of identification?  What are POTs sending you?  Just curious\n\nAnyway good list, that one just caught my eye!",
            "author": "Azurecole",
            "id": "iip437l",
            "parent_id": "t3_wemi90",
            "score": 2,
            "created_utc": 1659475139.0,
            "replies": [
                {
                    "body": "It’s not a problem if you explain why you aren’t comfortable sending them. Verification to me would be like a video call or a phone call, just something that makes me believe you’re a real person who wants to meet me and isn’t fishing for my pictures :) I’ve never asked for anything beyond that",
                    "author": null,
                    "id": "iipgdg9",
                    "parent_id": "t1_iip437l",
                    "score": 6,
                    "created_utc": 1659479978.0,
                    "replies": [
                        {
                            "body": "Got it! Video call would be fine with me",
                            "author": "Azurecole",
                            "id": "iipiclj",
                            "parent_id": "t1_iipgdg9",
                            "score": 1,
                            "created_utc": 1659480796.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Same here. I would also explain the reason the same way. I never ask for pictures until we agree to an M&G and that too only if the profile doesn't already have a face photo to know who look for.",
                    "author": "stpatricks81",
                    "id": "iippi2r",
                    "parent_id": "t1_iip437l",
                    "score": 1,
                    "created_utc": 1659483849.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> He wants to meet immediately.\n\nWhy is this a red flag?  If you’re going to a platonic MG it might as well be right away if you have the time. What could he do to you meeting immediately that he couldnt do in the future?\n\nI’ve been trained by SBs to really limit the messaging in favor of face-to-face.  It is the norm to just try to get it going or move on.",
            "author": "JDMultralight",
            "id": "iipel5f",
            "parent_id": "t3_wemi90",
            "score": -2,
            "created_utc": 1659479245.0,
            "replies": [
                {
                    "body": "When I say immediately, I mean the exact moment that he’s texting me he expects me to be leaving the house to go somewhere. Like, “Let’s meet right now. Where are you?” It’s fine to make plans fairly quickly. I don’t like texting for days either. I’ve agreed to meet the same day before. It’s the pressure to be instantly available that is a red flag.",
                    "author": null,
                    "id": "iipgv1h",
                    "parent_id": "t1_iipel5f",
                    "score": 10,
                    "created_utc": 1659480185.0,
                    "replies": [
                        {
                            "body": "Yes this makes sense",
                            "author": "JDMultralight",
                            "id": "iipt6us",
                            "parent_id": "t1_iipgv1h",
                            "score": 1,
                            "created_utc": 1659485451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Second this. Always trust your gut instinct, and if it isn’t 100% yes, then it’s a no!",
            "author": "tshhh_xo",
            "id": "iipa4zs",
            "parent_id": "t1_iip5jnp",
            "score": 5,
            "created_utc": 1659477490.0,
            "replies": []
        },
        {
            "body": "Also true other way around",
            "author": "asaprockynaurdwar",
            "id": "iiqu0ut",
            "parent_id": "t1_iip5jnp",
            "score": 1,
            "created_utc": 1659503302.0,
            "replies": []
        },
        {
            "body": "I think if it relates to your profile, it's a green flag. Copy-pasted are usually pretty easy to spot, but I'll take a c&p with a personal touch added as marginally good and have a tentative conversation with them.",
            "author": "justabebeh",
            "id": "iisfouz",
            "parent_id": "t1_iipqh9u",
            "score": 4,
            "created_utc": 1659538791.0,
            "replies": []
        },
        {
            "body": "Lots of SBs do this too. Ctrl+C, Ctrl+V. Send.",
            "author": "non_giant_panda",
            "id": "iiqq7hn",
            "parent_id": "t1_iipqh9u",
            "score": 3,
            "created_utc": 1659501022.0,
            "replies": [
                {
                    "body": "Yup, it’s just usually they don’t send 3 paragraphs about their ideal arrangement. Frankly lots of SBs just send “hey”",
                    "author": null,
                    "id": "iiqqdpq",
                    "parent_id": "t1_iiqq7hn",
                    "score": 3,
                    "created_utc": 1659501122.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not a problem if you explain why you aren’t comfortable sending them. Verification to me would be like a video call or a phone call, just something that makes me believe you’re a real person who wants to meet me and isn’t fishing for my pictures :) I’ve never asked for anything beyond that",
            "author": null,
            "id": "iipgdg9",
            "parent_id": "t1_iip437l",
            "score": 6,
            "created_utc": 1659479978.0,
            "replies": [
                {
                    "body": "Got it! Video call would be fine with me",
                    "author": "Azurecole",
                    "id": "iipiclj",
                    "parent_id": "t1_iipgdg9",
                    "score": 1,
                    "created_utc": 1659480796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same here. I would also explain the reason the same way. I never ask for pictures until we agree to an M&G and that too only if the profile doesn't already have a face photo to know who look for.",
            "author": "stpatricks81",
            "id": "iippi2r",
            "parent_id": "t1_iip437l",
            "score": 1,
            "created_utc": 1659483849.0,
            "replies": []
        },
        {
            "body": "When I say immediately, I mean the exact moment that he’s texting me he expects me to be leaving the house to go somewhere. Like, “Let’s meet right now. Where are you?” It’s fine to make plans fairly quickly. I don’t like texting for days either. I’ve agreed to meet the same day before. It’s the pressure to be instantly available that is a red flag.",
            "author": null,
            "id": "iipgv1h",
            "parent_id": "t1_iipel5f",
            "score": 10,
            "created_utc": 1659480185.0,
            "replies": [
                {
                    "body": "Yes this makes sense",
                    "author": "JDMultralight",
                    "id": "iipt6us",
                    "parent_id": "t1_iipgv1h",
                    "score": 1,
                    "created_utc": 1659485451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup, it’s just usually they don’t send 3 paragraphs about their ideal arrangement. Frankly lots of SBs just send “hey”",
            "author": null,
            "id": "iiqqdpq",
            "parent_id": "t1_iiqq7hn",
            "score": 3,
            "created_utc": 1659501122.0,
            "replies": []
        },
        {
            "body": "Got it! Video call would be fine with me",
            "author": "Azurecole",
            "id": "iipiclj",
            "parent_id": "t1_iipgdg9",
            "score": 1,
            "created_utc": 1659480796.0,
            "replies": []
        },
        {
            "body": "Yes this makes sense",
            "author": "JDMultralight",
            "id": "iipt6us",
            "parent_id": "t1_iipgv1h",
            "score": 1,
            "created_utc": 1659485451.0,
            "replies": []
        }
    ]
}