{
    "title": "Your safety is ALWAYS first. No amount of money is worth lifelong trauma.",
    "post_id": "l69pnh",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l69pnh/your_safety_is_always_first_no_amount_of_money_is/",
    "author": "perpetually--tired",
    "body": "This post is directed towards all the lurking SBs on here. Safety, particularly for SBs, comes up every so often but I feel can get muddled in all the posting that goes on this sub. This will probably get hate, but I don't care. \n\nDo NOT EVER assume these men you meet (whether they claim to be an SD or not) have your best interest. Remember that they are there with you to fulfill their own interest first. Stand your ground firmly. No amount of money can ever buy your mental health, your body, or any part of you. Do not let \"SDs\" guilt you for not trusting them immediately. When do you ever fully trust a random man you just met? Never. Sugar or not, trust takes time. Even after trust is built, people can be full of surprises. \n\nSDs on reddit are NOT representative of most SDs online. (Most) SDs on reddit who post and comment are actual gems, whereas the 90k+ other members of this sub lurking around can take proper SD language and tactics to manipulate you into a situation you are not comfortable with. \n\nUs SBs are young, we have a full life ahead of us. If any part of you doubts any situation, leave. You do not need permission to do what feels safe for you. You do not need to apologize for putting yourself first. You do not owe anyone ANYTHING. You are your biggest and often times, the only one to advocate for you. \n\nAlso, \"SDs\" who continue to push after any mention of discomfort, you can go unkindly fuck off. You're a creep and that is not okay and I am fully shaming you.\n\n\n\nan addendum: thank you everyone for the awards! i don't know why I thought I'd get a bit of push back, so thanks again! but again, (to the lurking SBs), this comment section is NOT representative of all \"SDs\". This comment section, GEMS! Cannot say the same for anyone outside of this comment section here.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l69pnh/your_safety_is_always_first_no_amount_of_money_is/",
    "score": 560,
    "upvote_ratio": 0.99,
    "created_utc": 1611768580.0,
    "num_comments": 45,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Life pro tip:  Define personal boundaries for your life and STICK TO THEM.  Not just sugaring, but all aspects.  Your safety and mental well being are well served by good boundaries.  \nThere are 1000s of links to be found.. this is just one of them.  \n[https://www.healthline.com/health/mental-health/set-boundaries#intro](https://www.healthline.com/health/mental-health/set-boundaries#intro)\n\nGood post OP",
            "author": "TXPolyDaddy",
            "id": "gkz5aq8",
            "parent_id": "t3_l69pnh",
            "score": 89,
            "created_utc": 1611769384.0,
            "replies": [
                {
                    "body": "It’s so crazy. My SD thinks boundaries are bad things to have in a relationship.\n\nThis resource is totally right! Boundaries are extremely important for both parties and mental health",
                    "author": "scarlared",
                    "id": "gl0ybu1",
                    "parent_id": "t1_gkz5aq8",
                    "score": 13,
                    "created_utc": 1611794827.0,
                    "replies": [
                        {
                            "body": "Yesssssssss red flag 🚩",
                            "author": null,
                            "id": "gl5yi26",
                            "parent_id": "t1_gl0ybu1",
                            "score": 2,
                            "created_utc": 1611877598.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Boundaries are something I live by. I never used to, struggling with mental health issues when I was younger and not setting proper boundaries caused a lot of problems in my life. \n\nIt’s hard for some to do this but I can’t stress the importance of it. And I firmly believe if I can do it, anyone can. This saves you from a world of shitty emotional trauma, brings a safety guard to your physical being and overall lands you in better relationships. \n\nThanks for making this comment with the link! :)",
                    "author": "avanirvana",
                    "id": "gkz7ohm",
                    "parent_id": "t1_gkz5aq8",
                    "score": 7,
                    "created_utc": 1611770161.0,
                    "replies": []
                },
                {
                    "body": "I'll suggest a different , but,  complimentary approach. \n\n1) Rather than wander through SA, Facebook or even this site make a lifelong investment in your safety ,  grab your favorite beverage and listen to someone whose advice is sought by Presidents, moguls and professional law enforcement in the recognition of threats, Gavin deBecker.   \n\nWhen part of my work was with major building management groups deBecker's checklist of evaluating bomb threats was a must have item, if you went to your local PD feeling threatened by a domestic violence issue chances are that they pulled out deBecker's 20 questions to evaluate the threat,  if the President's security detail needed fine tuning chances are that deBecker was consulted.  Grab a beverage of your choice and get what others pay thousands to hear. \n\nhttps://www.youtube.com/watch?v=zNtXjIiJ0PU\n\nAs you listen translate this to your discussion with a man, many years your senior, whom you have never met before. His adult experience is two  to ten times yours.  If he is married all you know is that he is probably good at deception.  If he is successful he has learned how to motivate and charm people.  You need to arm yourself with better situational awareness. \n\ndeBecker is all about situational awareness and recognizing threats.  The great part of this is you are looking for threats by looking at the big picture, not through simplistic rules of engagement stuff. \n\n         Does this clown deBecker really have anything to offer me?  Well, his 20 questions to evaluate the prospect of domestic violence , used by most police departments in the pre digital age  were applied to OJ , sadly after the LAPD and his wife overlooked many messages. \n\nOn a scale of 1-20   OJ scored a perfect 20.  It was a near certainty that OJ would commit a violent act. (( Yes I know that OJ was \"found not guilty\" but have enough direct knowledge of the case to assure you that he is, but, that's not important)  \n\n3.  Rather than worrying about buying the perfect outfit for your first M&G invest the time to listen to deBecker and search out his checklist. \n\n4.  You'll not be on the journey by yourselves.  Young Marines sent into the confused environment of foreign cities are exposed to Left of Bang, a classic study on recognizing danger that builds on many of deBecker's foundational thoughts.   It's also an interesting read. \n\nTX poly aptly describes them as personal boundaries. I think it is important to have very specific limits, but also equally important to have the situational awareness to detect situations where the perp has been careful not to trip the limits but still poses an immediate significant threat to dissolve the limits through intimidation, charm, extortion or physical threats/abuse(plus drugs) .",
                    "author": "pinotandsugar",
                    "id": "gl2ad83",
                    "parent_id": "t1_gkz5aq8",
                    "score": 8,
                    "created_utc": 1611820255.0,
                    "replies": [
                        {
                            "body": "I am only 17min in so far.  It is a good video with solid advice and reasoning.  It is a complimentary overlay on to what I was talking about boundaries.   So many people close to use (parents, siblings, spouses, bosses) completely disregard reasonable boundaries so we have to set our own.\n\nIf someone takes that video to heart and sets other boundaries they will be very well prepared to recognize and adapt to life.",
                            "author": "TXPolyDaddy",
                            "id": "gl553i3",
                            "parent_id": "t1_gl2ad83",
                            "score": 3,
                            "created_utc": 1611866214.0,
                            "replies": []
                        },
                        {
                            "body": "This comment saved my life.",
                            "author": "rouge_27",
                            "id": "hobifqe",
                            "parent_id": "t1_gl2ad83",
                            "score": 2,
                            "created_utc": 1639356714.0,
                            "replies": []
                        },
                        {
                            "body": "Thank you for sharing this video. It helped me a lot. Very interesting to think about logic vs instinct in that way.",
                            "author": "Adira5",
                            "id": "gl2m16l",
                            "parent_id": "t1_gl2ad83",
                            "score": 1,
                            "created_utc": 1611830077.0,
                            "replies": [
                                {
                                    "body": "We are trained to suppress the messages of danger out of social niceties \n\nHere is a link to the equivalent of the tool PD used in the non digital age . https://www.oprah.com/oprahshow/mosaic-gavin-de-beckers-online-threat-assessment-tool\n\n  Online, free with links to others.  \n\nFor first time SB I highly recommend  reading Gift of Fear as the intro. In flying we call it situational awareness or SA (pn essay) .  Gift of Fear includes the 20 question evaluation of the probability of domestic violence that was near standard for police.  \n\nFew SB leaving for a first meet will have the info needed to run the evaluation but they need to know the signals and have the discipline to act. Also the book, a light read , is a great help. I don't know anybody who has read the book and not gotten a lot of insights. For me it probably saved my life.",
                                    "author": "pinotandsugar",
                                    "id": "gl49kzv",
                                    "parent_id": "t1_gl2m16l",
                                    "score": 7,
                                    "created_utc": 1611854074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t ever tire of these posts. They’re so important, and new SBs join this sub every day without searching to see how often this is brought up (with very good reason). \n\nSet boundaries for yourself and stick to them. Don’t get in a SD’s car or go to his house on a M&G, or before you really know and trust him.\n\nDon’t accept anything you’re uncomfortable with, whether it’s related to money, time, intimacy or something else.",
            "author": "FoxyFreckles1989",
            "id": "gkzj356",
            "parent_id": "t3_l69pnh",
            "score": 48,
            "created_utc": 1611774255.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gkz3p3m",
            "parent_id": "t3_l69pnh",
            "score": 55,
            "created_utc": 1611768871.0,
            "replies": [
                {
                    "body": "And no is a complete sentence.",
                    "author": "Cdnsugarr",
                    "id": "gkz9whd",
                    "parent_id": "t1_gkz3p3m",
                    "score": 42,
                    "created_utc": 1611770900.0,
                    "replies": [
                        {
                            "body": "Periodt",
                            "author": "PromiseBest777",
                            "id": "gkzkpq4",
                            "parent_id": "t1_gkz9whd",
                            "score": 8,
                            "created_utc": 1611775095.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This cannot be said enough. Maybe for SDs, but for young women, this is the MOST important thing they need to understand for their safety.",
                    "author": "scarlared",
                    "id": "gl0yj6j",
                    "parent_id": "t1_gkz3p3m",
                    "score": 6,
                    "created_utc": 1611794896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And something that makes it easier to set boundaries? Not being desperate. I truly don’t believe anyone should be sugaring to make rent, food, etc if they can help it. When you begin to associate someone with your very survival you ARE going to form unhealthy attachments to them that will make it easier for them to manipulate and god forbid violate you in a number of ways. The best time to sugar is when things are fine in your life as far as basic survival needs because then it’s much easier to disregard the ones who do not meet your criteria and who show signs of inadequacy before even giving them a chance to meet you.",
            "author": null,
            "id": "gl11s4d",
            "parent_id": "t3_l69pnh",
            "score": 20,
            "created_utc": 1611796116.0,
            "replies": [
                {
                    "body": "this!! i met up w someone from seeking for car sex (first red flag lmao) when i was newer and completely broke and i’m embarrassed to admit i accepted $50 for literal bareback bc i was desperate. made me feel really disgusting inside tbh and im still kinda mad at myself.",
                    "author": "whospillsarethese",
                    "id": "gl2b6jv",
                    "parent_id": "t1_gl11s4d",
                    "score": 13,
                    "created_utc": 1611820915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wish I could upvote this more than once.",
            "author": "Daddyg2019",
            "id": "gkzlw1g",
            "parent_id": "t3_l69pnh",
            "score": 11,
            "created_utc": 1611775741.0,
            "replies": []
        },
        {
            "body": "Agree\n\nAnd moreover, your gut is not enough.  **This is not a risk-free activity for those who do not do a little research, and the consequences can be serious**.  Spend some time here reading about the norms and safety guidelines.   If you are a new SB, consider not breaking the safety guidelines for any reason -- you do not yet have the experience to know when you're being manipulated, so stick with the guidelines even if your gut is telling you \"everything is fine, sure I should XXX against slf advice\".   \n\nRead u/milliondollarkitty's great advice thread here: [https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some\\_possible\\_tips\\_for\\_new\\_sbs/](https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some_possible_tips_for_new_sbs/)",
            "author": "Azurecole",
            "id": "gkzcp9n",
            "parent_id": "t3_l69pnh",
            "score": 20,
            "created_utc": 1611771864.0,
            "replies": []
        },
        {
            "body": "I think safety is looked past in ways during covid and with some lockdown issues. We all need to get a little more creative in regards to meeting people these days as the risk runs higher (1. To get sick and 2. Not being able to do things in public as much).\n\nI’ve read some great posts on going about SR’s and meeting POTs through the pandemic. It’s so important to follow safety first even though we have needs. I always try and take a step back and ask myself what’s more important. The answer is ME.",
            "author": "avanirvana",
            "id": "gkz8oiq",
            "parent_id": "t3_l69pnh",
            "score": 10,
            "created_utc": 1611770484.0,
            "replies": []
        },
        {
            "body": "Well said. Leave. And remember it's not a discussion. You don't need his okay or acquiescence to leave. Just leave. If he's unhappy about it that's on him.",
            "author": "ChapterRelative",
            "id": "gkze80q",
            "parent_id": "t3_l69pnh",
            "score": 9,
            "created_utc": 1611772378.0,
            "replies": []
        },
        {
            "body": "I couldn’t agree more.",
            "author": "goingfivehole",
            "id": "gkz4me0",
            "parent_id": "t3_l69pnh",
            "score": 8,
            "created_utc": 1611769168.0,
            "replies": []
        },
        {
            "body": "It’s hard because many young women feel that they can’t say no to someone who is wealthy or in power. For women who come from a middle class life or poorer, rich people can be intimidating. They have everything you want or need.\n\nIn my case I was allured with lots of money and travel. My biggest dreams in life were to travel the world, shop like a princess, have lots of money and just culture myself. With my SD offering so much of this, I consciously blurred my boundaries for him. Now I’m in the process of reinstating some boundaries, and obviously it’s hard. \n\nAs simple as it is to say “No”, the context, possible (negative) implications and the pestering that follows suite sometimes make its VERY hard to uphold that boundary.\n\nSo NO. This can’t be said enough. Thank you for your post.",
            "author": "scarlared",
            "id": "gl0xzxf",
            "parent_id": "t3_l69pnh",
            "score": 5,
            "created_utc": 1611794717.0,
            "replies": []
        },
        {
            "body": "As a SD, I always make sure I meet the ladies first in public and leave separately.  I tell them it’s a chance to check each other out and if they don’t want to continue I’m more than fine with that.  I do not see the girls who want to just come over without meeting first.  Not only for their safety but for mine as well.",
            "author": "wedge1174",
            "id": "gl16jvf",
            "parent_id": "t3_l69pnh",
            "score": 5,
            "created_utc": 1611798141.0,
            "replies": [
                {
                    "body": "Exactly, it's up to the good SDs to reinforce safety even when they're dealing with *us*. Establish good practices in case the next one is not one of the good ones.",
                    "author": "ThrwHey2",
                    "id": "gl1cmqc",
                    "parent_id": "t1_gl16jvf",
                    "score": 1,
                    "created_utc": 1611800850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This can’t be said enough!",
            "author": "BGDDDY1",
            "id": "gkz6tvs",
            "parent_id": "t3_l69pnh",
            "score": 5,
            "created_utc": 1611769884.0,
            "replies": []
        },
        {
            "body": "A common thread I see here is \"He was so nice and a perfect gentleman\" just before being scammed or worse. \n\nLadies, just because a guy seems nice and looks normal doesn't mean that he is. Scammers are good at scamming. Part of that 'skill set\" is being able to induce a mark to let her guard down and trust him. \n\nI like to say \"trust but verify\"- from the Russians which Ronald Reagan copied.",
            "author": "GSSD",
            "id": "gkzdw2y",
            "parent_id": "t3_l69pnh",
            "score": 3,
            "created_utc": 1611772263.0,
            "replies": []
        },
        {
            "body": "I think one of the problems is that they go into a M&G thinking it’s safe without knowing what’s up.\n\nSome guys seem totally safe when in reality they are nutcases.\n\nMaybe video calls? Not sure what’s the remedy.",
            "author": "UnearthlyDinosaur",
            "id": "gkz6htp",
            "parent_id": "t3_l69pnh",
            "score": 7,
            "created_utc": 1611769776.0,
            "replies": [
                {
                    "body": "I think the most dangerous guys are good at coming across as “safe” initially, but then things quickly go bad.",
                    "author": "garret6758",
                    "id": "gkzme2e",
                    "parent_id": "t1_gkz6htp",
                    "score": 10,
                    "created_utc": 1611776004.0,
                    "replies": []
                },
                {
                    "body": "Very true. I’ve had young POT SB’s (first timers) insist on going to my place for the first date. I tell them are you sure you don’t want to video chat first or get to know each other a little better lol. I later scold them like you can’t just go to a random strangers house on the first date!!",
                    "author": "Fun_Focus8159",
                    "id": "gkzksmm",
                    "parent_id": "t1_gkz6htp",
                    "score": 6,
                    "created_utc": 1611775136.0,
                    "replies": []
                },
                {
                    "body": "I agree, the perception of feeling safe is far more dangerous than the actual red flags you can see. I really just posted this cause my hearts been going out to all to all those who had their safety compromised, not necessarily to find a remedy. Safety is something I feel very strongly about and I know better than anyone, it's much easier said than done especially in the heat of the moment. I don't know if there is any resolution that can be addressed. Maybe big picture, to all mothers and fathers out there, raise your kids right?",
                    "author": "perpetually--tired",
                    "id": "gkzdix5",
                    "parent_id": "t1_gkz6htp",
                    "score": 6,
                    "created_utc": 1611772136.0,
                    "replies": []
                },
                {
                    "body": "Another reason to put some space between the M&G and first date.",
                    "author": "ThrwHey2",
                    "id": "gkz93hy",
                    "parent_id": "t1_gkz6htp",
                    "score": 2,
                    "created_utc": 1611770626.0,
                    "replies": []
                },
                {
                    "body": "Video calls do absolutely nothing. \n\nBackground checks, yeah much better!",
                    "author": "Zealousideal_Lion472",
                    "id": "gl1rx7o",
                    "parent_id": "t1_gkz6htp",
                    "score": 2,
                    "created_utc": 1611808272.0,
                    "replies": []
                },
                {
                    "body": "The real solution would be less imbalance in the world that seeps into and manifests between men and women to put females in such a position of inequality. But, baby steps here 😂 \nI always think if someone can’t do straight talk about what they’re offering and looking for, next. Also, all the usual signs, punctuality, responsiveness, personal hygiene. And the crazy eyes, always the eyes",
                    "author": "sugarandaview",
                    "id": "gl2ls47",
                    "parent_id": "t1_gkz6htp",
                    "score": 2,
                    "created_utc": 1611829867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also, a lot of people think saying \"no\" or having a boundary will somehow be selfish, cruel, or make them a \"bad person\". It's the opposite actually. Because having and maintaining boundaries allows you to be more authentic. You're more comfortable in your own skin and with the people you allow in your space. They're there because you want them there, and you allow them to do only what you're comfortable with. This makes the encounter more genuine, and you're not doing things just to get approval. Pretending to be ok with things you're not ok with is actually inauthentic. Also it adds value to having a relationship with you, because you don't allow everything with everyone.",
            "author": null,
            "id": "gl2f90r",
            "parent_id": "t3_l69pnh",
            "score": 3,
            "created_utc": 1611824286.0,
            "replies": []
        },
        {
            "body": "True for SDs, but sorry to witness that lots of pretending SBs have also their own agenda as well, meaning they're not here to build a meaningful and balanced relationship.\nI'm still optimistic but it takes effort and dedication to find good matches",
            "author": "djvinc",
            "id": "gl2d7i9",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611822564.0,
            "replies": []
        },
        {
            "body": "YES!!!! 👏🏻",
            "author": null,
            "id": "gkz9s95",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611770860.0,
            "replies": []
        },
        {
            "body": "Thank you! I’m new to the sugar world but this is great advice , whether sugaring are not. Safety first",
            "author": "PromiseBest777",
            "id": "gkzhtqf",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611773723.0,
            "replies": [
                {
                    "body": "Welcome! It can be beautiful, but we still need to protect what's yours and mine first and foremost❣️",
                    "author": "perpetually--tired",
                    "id": "gl0uy6u",
                    "parent_id": "t1_gkzhtqf",
                    "score": 2,
                    "created_utc": 1611793724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOUDER",
            "author": "ashes2asscheeks",
            "id": "gl06z83",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611784155.0,
            "replies": []
        },
        {
            "body": "Great post!",
            "author": "shugadaddio",
            "id": "gl08sl8",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611784869.0,
            "replies": []
        },
        {
            "body": "I am about the nicest guy you can find in the bowl.  Respectful and friendly.  I respect boundaries.  For the POTs I met, there have been many who left enough info for me to determine identify.  Things did not work out and I let it go.  Assume me to be quite unrepresentative of the potential SD population.  Protect your identity.  Do not compromise your well being or safety.  Find your comfort zone and don't go beyond it.",
            "author": "JeromeAniton",
            "id": "gl1immo",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611803588.0,
            "replies": []
        },
        {
            "body": "100% agree with all of this.",
            "author": "wraithfive",
            "id": "gl3u35y",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611849277.0,
            "replies": []
        },
        {
            "body": "Love this post! Thank you for sharing!",
            "author": "SassySugar4u",
            "id": "gl4xjif",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1611863523.0,
            "replies": []
        },
        {
            "body": "Safety guidance is important, and I can certainly understand REASONABLE precautions at all times and walking out of DANGEROUS, ABUSIVE or MANIPULATIVE situations.\n\nI have certainly met my share of overly trusting SBs, where I’d say, “Wow! She’s lucky that I am not a bad guy.”\n\nFrom the SD side, it’s nice to be trusted and awful to feel suspect for something bad that you have absolutely no intention of. I have met a few SBs that were absolutely paranoid. It did not make me feel good.\n\nBe smart. Be kind. Be fair. Trust your gut.\n\nPeace out!",
            "author": "SDchat",
            "id": "hhqhziu",
            "parent_id": "t3_l69pnh",
            "score": 1,
            "created_utc": 1634992188.0,
            "replies": []
        },
        {
            "body": "It’s so crazy. My SD thinks boundaries are bad things to have in a relationship.\n\nThis resource is totally right! Boundaries are extremely important for both parties and mental health",
            "author": "scarlared",
            "id": "gl0ybu1",
            "parent_id": "t1_gkz5aq8",
            "score": 13,
            "created_utc": 1611794827.0,
            "replies": [
                {
                    "body": "Yesssssssss red flag 🚩",
                    "author": null,
                    "id": "gl5yi26",
                    "parent_id": "t1_gl0ybu1",
                    "score": 2,
                    "created_utc": 1611877598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Boundaries are something I live by. I never used to, struggling with mental health issues when I was younger and not setting proper boundaries caused a lot of problems in my life. \n\nIt’s hard for some to do this but I can’t stress the importance of it. And I firmly believe if I can do it, anyone can. This saves you from a world of shitty emotional trauma, brings a safety guard to your physical being and overall lands you in better relationships. \n\nThanks for making this comment with the link! :)",
            "author": "avanirvana",
            "id": "gkz7ohm",
            "parent_id": "t1_gkz5aq8",
            "score": 7,
            "created_utc": 1611770161.0,
            "replies": []
        },
        {
            "body": "I'll suggest a different , but,  complimentary approach. \n\n1) Rather than wander through SA, Facebook or even this site make a lifelong investment in your safety ,  grab your favorite beverage and listen to someone whose advice is sought by Presidents, moguls and professional law enforcement in the recognition of threats, Gavin deBecker.   \n\nWhen part of my work was with major building management groups deBecker's checklist of evaluating bomb threats was a must have item, if you went to your local PD feeling threatened by a domestic violence issue chances are that they pulled out deBecker's 20 questions to evaluate the threat,  if the President's security detail needed fine tuning chances are that deBecker was consulted.  Grab a beverage of your choice and get what others pay thousands to hear. \n\nhttps://www.youtube.com/watch?v=zNtXjIiJ0PU\n\nAs you listen translate this to your discussion with a man, many years your senior, whom you have never met before. His adult experience is two  to ten times yours.  If he is married all you know is that he is probably good at deception.  If he is successful he has learned how to motivate and charm people.  You need to arm yourself with better situational awareness. \n\ndeBecker is all about situational awareness and recognizing threats.  The great part of this is you are looking for threats by looking at the big picture, not through simplistic rules of engagement stuff. \n\n         Does this clown deBecker really have anything to offer me?  Well, his 20 questions to evaluate the prospect of domestic violence , used by most police departments in the pre digital age  were applied to OJ , sadly after the LAPD and his wife overlooked many messages. \n\nOn a scale of 1-20   OJ scored a perfect 20.  It was a near certainty that OJ would commit a violent act. (( Yes I know that OJ was \"found not guilty\" but have enough direct knowledge of the case to assure you that he is, but, that's not important)  \n\n3.  Rather than worrying about buying the perfect outfit for your first M&G invest the time to listen to deBecker and search out his checklist. \n\n4.  You'll not be on the journey by yourselves.  Young Marines sent into the confused environment of foreign cities are exposed to Left of Bang, a classic study on recognizing danger that builds on many of deBecker's foundational thoughts.   It's also an interesting read. \n\nTX poly aptly describes them as personal boundaries. I think it is important to have very specific limits, but also equally important to have the situational awareness to detect situations where the perp has been careful not to trip the limits but still poses an immediate significant threat to dissolve the limits through intimidation, charm, extortion or physical threats/abuse(plus drugs) .",
            "author": "pinotandsugar",
            "id": "gl2ad83",
            "parent_id": "t1_gkz5aq8",
            "score": 8,
            "created_utc": 1611820255.0,
            "replies": [
                {
                    "body": "I am only 17min in so far.  It is a good video with solid advice and reasoning.  It is a complimentary overlay on to what I was talking about boundaries.   So many people close to use (parents, siblings, spouses, bosses) completely disregard reasonable boundaries so we have to set our own.\n\nIf someone takes that video to heart and sets other boundaries they will be very well prepared to recognize and adapt to life.",
                    "author": "TXPolyDaddy",
                    "id": "gl553i3",
                    "parent_id": "t1_gl2ad83",
                    "score": 3,
                    "created_utc": 1611866214.0,
                    "replies": []
                },
                {
                    "body": "This comment saved my life.",
                    "author": "rouge_27",
                    "id": "hobifqe",
                    "parent_id": "t1_gl2ad83",
                    "score": 2,
                    "created_utc": 1639356714.0,
                    "replies": []
                },
                {
                    "body": "Thank you for sharing this video. It helped me a lot. Very interesting to think about logic vs instinct in that way.",
                    "author": "Adira5",
                    "id": "gl2m16l",
                    "parent_id": "t1_gl2ad83",
                    "score": 1,
                    "created_utc": 1611830077.0,
                    "replies": [
                        {
                            "body": "We are trained to suppress the messages of danger out of social niceties \n\nHere is a link to the equivalent of the tool PD used in the non digital age . https://www.oprah.com/oprahshow/mosaic-gavin-de-beckers-online-threat-assessment-tool\n\n  Online, free with links to others.  \n\nFor first time SB I highly recommend  reading Gift of Fear as the intro. In flying we call it situational awareness or SA (pn essay) .  Gift of Fear includes the 20 question evaluation of the probability of domestic violence that was near standard for police.  \n\nFew SB leaving for a first meet will have the info needed to run the evaluation but they need to know the signals and have the discipline to act. Also the book, a light read , is a great help. I don't know anybody who has read the book and not gotten a lot of insights. For me it probably saved my life.",
                            "author": "pinotandsugar",
                            "id": "gl49kzv",
                            "parent_id": "t1_gl2m16l",
                            "score": 7,
                            "created_utc": 1611854074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And no is a complete sentence.",
            "author": "Cdnsugarr",
            "id": "gkz9whd",
            "parent_id": "t1_gkz3p3m",
            "score": 42,
            "created_utc": 1611770900.0,
            "replies": [
                {
                    "body": "Periodt",
                    "author": "PromiseBest777",
                    "id": "gkzkpq4",
                    "parent_id": "t1_gkz9whd",
                    "score": 8,
                    "created_utc": 1611775095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This cannot be said enough. Maybe for SDs, but for young women, this is the MOST important thing they need to understand for their safety.",
            "author": "scarlared",
            "id": "gl0yj6j",
            "parent_id": "t1_gkz3p3m",
            "score": 6,
            "created_utc": 1611794896.0,
            "replies": []
        },
        {
            "body": "this!! i met up w someone from seeking for car sex (first red flag lmao) when i was newer and completely broke and i’m embarrassed to admit i accepted $50 for literal bareback bc i was desperate. made me feel really disgusting inside tbh and im still kinda mad at myself.",
            "author": "whospillsarethese",
            "id": "gl2b6jv",
            "parent_id": "t1_gl11s4d",
            "score": 13,
            "created_utc": 1611820915.0,
            "replies": []
        },
        {
            "body": "Exactly, it's up to the good SDs to reinforce safety even when they're dealing with *us*. Establish good practices in case the next one is not one of the good ones.",
            "author": "ThrwHey2",
            "id": "gl1cmqc",
            "parent_id": "t1_gl16jvf",
            "score": 1,
            "created_utc": 1611800850.0,
            "replies": []
        },
        {
            "body": "I think the most dangerous guys are good at coming across as “safe” initially, but then things quickly go bad.",
            "author": "garret6758",
            "id": "gkzme2e",
            "parent_id": "t1_gkz6htp",
            "score": 10,
            "created_utc": 1611776004.0,
            "replies": []
        },
        {
            "body": "Very true. I’ve had young POT SB’s (first timers) insist on going to my place for the first date. I tell them are you sure you don’t want to video chat first or get to know each other a little better lol. I later scold them like you can’t just go to a random strangers house on the first date!!",
            "author": "Fun_Focus8159",
            "id": "gkzksmm",
            "parent_id": "t1_gkz6htp",
            "score": 6,
            "created_utc": 1611775136.0,
            "replies": []
        },
        {
            "body": "I agree, the perception of feeling safe is far more dangerous than the actual red flags you can see. I really just posted this cause my hearts been going out to all to all those who had their safety compromised, not necessarily to find a remedy. Safety is something I feel very strongly about and I know better than anyone, it's much easier said than done especially in the heat of the moment. I don't know if there is any resolution that can be addressed. Maybe big picture, to all mothers and fathers out there, raise your kids right?",
            "author": "perpetually--tired",
            "id": "gkzdix5",
            "parent_id": "t1_gkz6htp",
            "score": 6,
            "created_utc": 1611772136.0,
            "replies": []
        },
        {
            "body": "Another reason to put some space between the M&G and first date.",
            "author": "ThrwHey2",
            "id": "gkz93hy",
            "parent_id": "t1_gkz6htp",
            "score": 2,
            "created_utc": 1611770626.0,
            "replies": []
        },
        {
            "body": "Video calls do absolutely nothing. \n\nBackground checks, yeah much better!",
            "author": "Zealousideal_Lion472",
            "id": "gl1rx7o",
            "parent_id": "t1_gkz6htp",
            "score": 2,
            "created_utc": 1611808272.0,
            "replies": []
        },
        {
            "body": "The real solution would be less imbalance in the world that seeps into and manifests between men and women to put females in such a position of inequality. But, baby steps here 😂 \nI always think if someone can’t do straight talk about what they’re offering and looking for, next. Also, all the usual signs, punctuality, responsiveness, personal hygiene. And the crazy eyes, always the eyes",
            "author": "sugarandaview",
            "id": "gl2ls47",
            "parent_id": "t1_gkz6htp",
            "score": 2,
            "created_utc": 1611829867.0,
            "replies": []
        },
        {
            "body": "Welcome! It can be beautiful, but we still need to protect what's yours and mine first and foremost❣️",
            "author": "perpetually--tired",
            "id": "gl0uy6u",
            "parent_id": "t1_gkzhtqf",
            "score": 2,
            "created_utc": 1611793724.0,
            "replies": []
        },
        {
            "body": "Yesssssssss red flag 🚩",
            "author": null,
            "id": "gl5yi26",
            "parent_id": "t1_gl0ybu1",
            "score": 2,
            "created_utc": 1611877598.0,
            "replies": []
        },
        {
            "body": "I am only 17min in so far.  It is a good video with solid advice and reasoning.  It is a complimentary overlay on to what I was talking about boundaries.   So many people close to use (parents, siblings, spouses, bosses) completely disregard reasonable boundaries so we have to set our own.\n\nIf someone takes that video to heart and sets other boundaries they will be very well prepared to recognize and adapt to life.",
            "author": "TXPolyDaddy",
            "id": "gl553i3",
            "parent_id": "t1_gl2ad83",
            "score": 3,
            "created_utc": 1611866214.0,
            "replies": []
        },
        {
            "body": "This comment saved my life.",
            "author": "rouge_27",
            "id": "hobifqe",
            "parent_id": "t1_gl2ad83",
            "score": 2,
            "created_utc": 1639356714.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing this video. It helped me a lot. Very interesting to think about logic vs instinct in that way.",
            "author": "Adira5",
            "id": "gl2m16l",
            "parent_id": "t1_gl2ad83",
            "score": 1,
            "created_utc": 1611830077.0,
            "replies": [
                {
                    "body": "We are trained to suppress the messages of danger out of social niceties \n\nHere is a link to the equivalent of the tool PD used in the non digital age . https://www.oprah.com/oprahshow/mosaic-gavin-de-beckers-online-threat-assessment-tool\n\n  Online, free with links to others.  \n\nFor first time SB I highly recommend  reading Gift of Fear as the intro. In flying we call it situational awareness or SA (pn essay) .  Gift of Fear includes the 20 question evaluation of the probability of domestic violence that was near standard for police.  \n\nFew SB leaving for a first meet will have the info needed to run the evaluation but they need to know the signals and have the discipline to act. Also the book, a light read , is a great help. I don't know anybody who has read the book and not gotten a lot of insights. For me it probably saved my life.",
                    "author": "pinotandsugar",
                    "id": "gl49kzv",
                    "parent_id": "t1_gl2m16l",
                    "score": 7,
                    "created_utc": 1611854074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Periodt",
            "author": "PromiseBest777",
            "id": "gkzkpq4",
            "parent_id": "t1_gkz9whd",
            "score": 8,
            "created_utc": 1611775095.0,
            "replies": []
        },
        {
            "body": "We are trained to suppress the messages of danger out of social niceties \n\nHere is a link to the equivalent of the tool PD used in the non digital age . https://www.oprah.com/oprahshow/mosaic-gavin-de-beckers-online-threat-assessment-tool\n\n  Online, free with links to others.  \n\nFor first time SB I highly recommend  reading Gift of Fear as the intro. In flying we call it situational awareness or SA (pn essay) .  Gift of Fear includes the 20 question evaluation of the probability of domestic violence that was near standard for police.  \n\nFew SB leaving for a first meet will have the info needed to run the evaluation but they need to know the signals and have the discipline to act. Also the book, a light read , is a great help. I don't know anybody who has read the book and not gotten a lot of insights. For me it probably saved my life.",
            "author": "pinotandsugar",
            "id": "gl49kzv",
            "parent_id": "t1_gl2m16l",
            "score": 7,
            "created_utc": 1611854074.0,
            "replies": []
        }
    ]
}