{
    "title": "The Prince",
    "post_id": "i2ibuw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i2ibuw/the_prince/",
    "author": "LaGriffeDuLion",
    "body": "An SB was talking here earlier about an SD flying her out to meet.  Here's my 2 cents on that.\n\nThe  reason the Twilight series is so popular is because it represents an  attainment fantasy that all women have as part of their suite of  hypergamous instincts. You'll note that the heroine in these stories is  otherwise unremarkable and doesn't really have to *do* anything for all of the attention she's getting, she simply has to *be*.  She sits on her pedestal while all the boys chase after her and fight over her, and wouldn't it be *just thrilling* to be her?\n\nI'm not making fun of that.  Mother Nature has spent millions of years figuring  out what works for our species, and I defer to her experience.\n\nBut my point is this: If some Prince from Afar says that he's scoured the land looking high and low and now comes to you, *the fairest maiden of them all*   —  he's triggering that fantasy in you.  So be skeptical about it,  because you're likely going to rationalize away a lot of the red and  yellow flags that would otherwise give you pause.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/i2ibuw/the_prince/",
    "score": 143,
    "upvote_ratio": 0.91,
    "created_utc": 1596397487.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "g04zqba",
            "parent_id": "t3_i2ibuw",
            "score": 81,
            "created_utc": 1596399667.0,
            "replies": [
                {
                    "body": "Nope, I'm pretty sure everyone will agree with you. I can see flying in a SB to some places, but london or new york or vancouver, its just absurd. They're racially diverse cities that are expensive as hell, meaning theres lots and lots of local SBs of every age, shape and background.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g050je6",
                    "parent_id": "t1_g04zqba",
                    "score": 29,
                    "created_utc": 1596400094.0,
                    "replies": []
                },
                {
                    "body": "I live in LA and have met my fair share of rich sociopaths who get off on that power trip. I can see one doing this to fulfill a girl’s ‘fantasy’ while simultaneously stroking his own ego",
                    "author": "throwaway_mmk",
                    "id": "g05s4gc",
                    "parent_id": "t1_g04zqba",
                    "score": 14,
                    "created_utc": 1596415468.0,
                    "replies": []
                },
                {
                    "body": "Unless what he likes is triggering that fantasy. Being whisked off to Manhattan to go shopping means a lot more for a woman who lives in St. Louis than it does for a woman who lives in Brooklyn. Having an SB who is interested in something other than just the cash at the start of the month makes the illusion seem deeper.",
                    "author": "Sugarbeggar",
                    "id": "g058jm6",
                    "parent_id": "t1_g04zqba",
                    "score": 17,
                    "created_utc": 1596404364.0,
                    "replies": []
                },
                {
                    "body": "Hmmm, yeah.  Girls in LA/NYC > than all US cities.  Its a fact !\nMore educated, sophisticated and hotter",
                    "author": "kris_lee8",
                    "id": "g05exrl",
                    "parent_id": "t1_g04zqba",
                    "score": -11,
                    "created_utc": 1596407787.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just had some guy (from California-out of state for me) message me last week on SA, telling me how he is very picky and was really boosting me ego trying to reel me in for an ONLINE ARRANGEMENT.  He did send me an amazon gift card to prove himself, but there were waaayyy too many other flags and to be quite honest, I really have no idea how to do an online arrangement. So I blocked him.",
            "author": "ImaginaryBullfrog5",
            "id": "g0558ua",
            "parent_id": "t3_i2ibuw",
            "score": 19,
            "created_utc": 1596402602.0,
            "replies": [
                {
                    "body": "Bahaha, reminds me of what happened to me a year or so ago with my [gift list micro-study](https://www.reddit.com/r/sugarlifestyleforum/comments/aubswj/my_gift_list_microstudy_funny_story/)... I was blocked, then my gift was accepted 😂.",
                    "author": "xxnightrain",
                    "id": "g058bcf",
                    "parent_id": "t1_g0558ua",
                    "score": 10,
                    "created_utc": 1596404241.0,
                    "replies": [
                        {
                            "body": "Lol. This guy also wanted to send me his name and credit card info to book flights and hotel for me to come meet him. I said, why would ANYONE send their cc info to a complete stranger. He claimed he could just cancel the card if I misused it.",
                            "author": "ImaginaryBullfrog5",
                            "id": "g0598d8",
                            "parent_id": "t1_g058bcf",
                            "score": 9,
                            "created_utc": 1596404717.0,
                            "replies": [
                                {
                                    "body": "Okay, *that* I've never done 😂😂😂",
                                    "author": "xxnightrain",
                                    "id": "g05bnrh",
                                    "parent_id": "t1_g0598d8",
                                    "score": 6,
                                    "created_utc": 1596405992.0,
                                    "replies": []
                                },
                                {
                                    "body": "Did you use the card?",
                                    "author": "Random-Generosity",
                                    "id": "g36hbp4",
                                    "parent_id": "t1_g0598d8",
                                    "score": 1,
                                    "created_utc": 1598651211.0,
                                    "replies": [
                                        {
                                            "body": "Lol, no. We didn’t get that far",
                                            "author": "ImaginaryBullfrog5",
                                            "id": "g36kjfs",
                                            "parent_id": "t1_g36hbp4",
                                            "score": 1,
                                            "created_utc": 1598652871.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> He [sent] me an amazon gift card to prove himself\n\n...\n\n> I blocked him.\n\nMan, I'm feeling some anxiety about this story 😅\n\nIf you're looking for something online only it doesn't really matter where you live. The speed of light down a fiberoptic cable is a great equalizer.",
                    "author": "Sugarbeggar",
                    "id": "g0592u2",
                    "parent_id": "t1_g0558ua",
                    "score": 4,
                    "created_utc": 1596404639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "/puts down 50 shades\n\nI've never heard of a story with that plot. Do go on.",
            "author": "ICanOnlyGetSoElect",
            "id": "g04y6ny",
            "parent_id": "t3_i2ibuw",
            "score": 17,
            "created_utc": 1596398858.0,
            "replies": [
                {
                    "body": "Did you know that 50 Shades started out as a Twilight fanfic? Lol that's why those similarities are there",
                    "author": "Allthatjasmine",
                    "id": "g053jir",
                    "parent_id": "t1_g04y6ny",
                    "score": 15,
                    "created_utc": 1596401691.0,
                    "replies": [
                        {
                            "body": "/takes notes\n\nGo on.\n\nWasnt harry potter a fanfic too?\n\nEdit: My bad, I doesnt seem it was, but I could swear there was another series that was.",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g054mrv",
                            "parent_id": "t1_g053jir",
                            "score": 1,
                            "created_utc": 1596402273.0,
                            "replies": [
                                {
                                    "body": "Mortal instruments was a Harry Potter fan fic. There are a bunch of other books that started out as twilight fan fiction too, copycats off of 50 shades, publishers hoping to cash in.",
                                    "author": "Sugarbeggar",
                                    "id": "g059gai",
                                    "parent_id": "t1_g054mrv",
                                    "score": 7,
                                    "created_utc": 1596404830.0,
                                    "replies": [
                                        {
                                            "body": "I never knew Mortal Instruments was based on HP, guess that explains why I was obsessed with it in high school, huh?",
                                            "author": "Allthatjasmine",
                                            "id": "g06a8c6",
                                            "parent_id": "t1_g059gai",
                                            "score": 6,
                                            "created_utc": 1596426611.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Oooh, cool.\n\nSo if I do a 50 shades fanfic I could end up writing a movie?",
                                            "author": "ICanOnlyGetSoElect",
                                            "id": "g05a3g3",
                                            "parent_id": "t1_g059gai",
                                            "score": 5,
                                            "created_utc": 1596405169.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Literally LOL'ed...Take my upvote you cleverly-named commenter.",
                    "author": "Patrucio71",
                    "id": "g053nfh",
                    "parent_id": "t1_g04y6ny",
                    "score": 0,
                    "created_utc": 1596401749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also women need to be aware not only of scams but the potential of being abducted and trafficked 😬",
            "author": "nuitbelle",
            "id": "g06i8wa",
            "parent_id": "t3_i2ibuw",
            "score": 5,
            "created_utc": 1596432546.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g055suy",
            "parent_id": "t3_i2ibuw",
            "score": 16,
            "created_utc": 1596402898.0,
            "replies": [
                {
                    "body": "Totally agree",
                    "author": "Pollydolly75",
                    "id": "g059jyf",
                    "parent_id": "t1_g055suy",
                    "score": 7,
                    "created_utc": 1596404883.0,
                    "replies": []
                },
                {
                    "body": "This reminds me of a Tinderella I once talked to who was looking for an astronomical amount of money. \n\nI said while that might be possible, there weren’t many men out there at that level. She said that there needed to only be one, and she was going to find him, “even if he’s in Italy.”\n\nI wished her well, and didn’t bother to point out that the guy in Italy is probably enjoying the company of Ukrainian supermodels for a lot less than she was asking for.",
                    "author": "LaGriffeDuLion",
                    "id": "g05ar7p",
                    "parent_id": "t1_g055suy",
                    "score": 8,
                    "created_utc": 1596405510.0,
                    "replies": [
                        {
                            "body": "Well some of us are living that fantasy! Not probably as far as Italy but definitely as good as any supermodels.",
                            "author": null,
                            "id": "g05rq9p",
                            "parent_id": "t1_g05ar7p",
                            "score": 5,
                            "created_utc": 1596415229.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes - methinks certain reddit SDs might even be envious of this fact as some ladies travel more and of higher caliber than they do. (-: It is a male trait 'thing-y' to proclaim 'fantasy fiction' at anything that seems unreal or unrelatable to their limited funds world of reality (along the same lines of typical male traits of deflection, gaslighting calling women 'emotional', ect.ect).\n\nThey probably thought $10k a table bottle service in Manhattan was fantasy fiction, too. And, why buy a yacht, when running costs are up to a million a year - what a waste! It is all relative to the individual and their wealth. Many uber wealthy men are travelling more than they are 'at home', so it makes sense to see women in other places or just have them travel with him or to him (if he can - why not? Who cares if he does it for ego or because he really likes her as long as he is nice man and generous)...these reddit fellas cannot relate because it is outside of their reality or circle of friends. And, that is okay, middle class is the middle for a reason, but to act like it does not exist and compare it to tweener movies...pfft\n\nWhy worry so much about how other men spend their money or reasons behind it? hmmm...\n\nAnd, amen to healthy boundaries, due to distance!",
                    "author": null,
                    "id": "g17z1vr",
                    "parent_id": "t1_g055suy",
                    "score": 3,
                    "created_utc": 1597245441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If I had never had any experience of this I would think it would be unusual and unlikely. However, the first person I ever met from SA flew me to Paris to meet him. There are plenty of beautiful girls in Paris but he still told me he felt lucky to have me there. He also told me he had flew in girls from all over and a lot of them from Spain. \n\nI haven’t had another experience like that since (signed up back in December) but it definitely does happen.",
            "author": "smithsmith89",
            "id": "g06yn9o",
            "parent_id": "t3_i2ibuw",
            "score": 4,
            "created_utc": 1596448479.0,
            "replies": []
        },
        {
            "body": "Sounds Machiavellian to me.",
            "author": "TY2022",
            "id": "g04xsh8",
            "parent_id": "t3_i2ibuw",
            "score": 4,
            "created_utc": 1596398647.0,
            "replies": []
        },
        {
            "body": "On first glance it seems like he's just RPing a fantasy... But this has become a new phenomenon on SA. I've been gotten about 9 messages from men in NYC, LA, Italy, and today Singapore since I rejoined last week. To clarify I also live in a major city that's also a hub for international markets. They claim to travel often to my city and want to start something online until COVID ends. I'd get similar messages before but they weren't from Premium/Diamond members and all pulled the cheque thing really early on. I never recieved a serious message from abroad in December/January.\n\nMy profile pic is a professional picture of me practicing contortion so I guess I stand out, but there's no way I stand out THAT much. Not sure if this is some new scam or covid is just making people lose their minds on SA.",
            "author": "devslashmodelSB",
            "id": "g06cqdu",
            "parent_id": "t3_i2ibuw",
            "score": 2,
            "created_utc": 1596428348.0,
            "replies": []
        },
        {
            "body": "Unless the sugar daddy is in the middle of Nowhere it makes no sense and is not based in reality.   If a SD wants to fly you into rural Iowa or Wisconsin then it might make sense... NY, LA, Miami, etc is a scam 999/1000 times.",
            "author": "LotBuilder",
            "id": "g05ul9c",
            "parent_id": "t3_i2ibuw",
            "score": 3,
            "created_utc": 1596416941.0,
            "replies": []
        },
        {
            "body": "😂😂😂 \nThere are plenty of men out there with money willing to fly women out. Just because YOU are cheap doesn’t mean everyone is. \n\nI don’t know the post this is referring to but this post is sad tbh.",
            "author": "prettylilprostitute",
            "id": "g05bxsa",
            "parent_id": "t3_i2ibuw",
            "score": 6,
            "created_utc": 1596406141.0,
            "replies": [
                {
                    "body": "Yeah you have to take the advice on here with a grain of salt.. especially if you’re not brand new.",
                    "author": "enchantedazul",
                    "id": "g07jzs1",
                    "parent_id": "t1_g05bxsa",
                    "score": 4,
                    "created_utc": 1596464396.0,
                    "replies": []
                },
                {
                    "body": "Literally just flew a girl from Puerto Rico to hang out for the weekend. She doesn’t speak English I no Hablo, so far so good. Sex is mediocre though",
                    "author": "Monkitail",
                    "id": "g061um7",
                    "parent_id": "t1_g05bxsa",
                    "score": 6,
                    "created_utc": 1596421301.0,
                    "replies": []
                },
                {
                    "body": "YESSSSS!!! And they aren’t terrified of being scammed for a measly plane ticket.",
                    "author": "testing1to3",
                    "id": "g05fiq9",
                    "parent_id": "t1_g05bxsa",
                    "score": 5,
                    "created_utc": 1596408110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Similar to 50 Shades",
            "author": "majormajorsnowden",
            "id": "g05z4et",
            "parent_id": "t3_i2ibuw",
            "score": 1,
            "created_utc": 1596419662.0,
            "replies": []
        },
        {
            "body": "In other words, the female of the species instinctively gravitates towards resource alphas even while engaged in intimacy with numerous non resource alphas. Hence, such scenes as the public humiliation of the likes of Jonny Depp. Follow the money.",
            "author": null,
            "id": "g052ck9",
            "parent_id": "t3_i2ibuw",
            "score": -3,
            "created_utc": 1596401059.0,
            "replies": []
        },
        {
            "body": "A SB actually believes some rich guy from another county wants to fly her to him because she’s that special? 😂",
            "author": "Color_Me_Blue",
            "id": "g05dbzz",
            "parent_id": "t3_i2ibuw",
            "score": -5,
            "created_utc": 1596406896.0,
            "replies": []
        },
        {
            "body": "Nope, I'm pretty sure everyone will agree with you. I can see flying in a SB to some places, but london or new york or vancouver, its just absurd. They're racially diverse cities that are expensive as hell, meaning theres lots and lots of local SBs of every age, shape and background.",
            "author": "ICanOnlyGetSoElect",
            "id": "g050je6",
            "parent_id": "t1_g04zqba",
            "score": 29,
            "created_utc": 1596400094.0,
            "replies": []
        },
        {
            "body": "I live in LA and have met my fair share of rich sociopaths who get off on that power trip. I can see one doing this to fulfill a girl’s ‘fantasy’ while simultaneously stroking his own ego",
            "author": "throwaway_mmk",
            "id": "g05s4gc",
            "parent_id": "t1_g04zqba",
            "score": 14,
            "created_utc": 1596415468.0,
            "replies": []
        },
        {
            "body": "Unless what he likes is triggering that fantasy. Being whisked off to Manhattan to go shopping means a lot more for a woman who lives in St. Louis than it does for a woman who lives in Brooklyn. Having an SB who is interested in something other than just the cash at the start of the month makes the illusion seem deeper.",
            "author": "Sugarbeggar",
            "id": "g058jm6",
            "parent_id": "t1_g04zqba",
            "score": 17,
            "created_utc": 1596404364.0,
            "replies": []
        },
        {
            "body": "Hmmm, yeah.  Girls in LA/NYC > than all US cities.  Its a fact !\nMore educated, sophisticated and hotter",
            "author": "kris_lee8",
            "id": "g05exrl",
            "parent_id": "t1_g04zqba",
            "score": -11,
            "created_utc": 1596407787.0,
            "replies": []
        },
        {
            "body": "Bahaha, reminds me of what happened to me a year or so ago with my [gift list micro-study](https://www.reddit.com/r/sugarlifestyleforum/comments/aubswj/my_gift_list_microstudy_funny_story/)... I was blocked, then my gift was accepted 😂.",
            "author": "xxnightrain",
            "id": "g058bcf",
            "parent_id": "t1_g0558ua",
            "score": 10,
            "created_utc": 1596404241.0,
            "replies": [
                {
                    "body": "Lol. This guy also wanted to send me his name and credit card info to book flights and hotel for me to come meet him. I said, why would ANYONE send their cc info to a complete stranger. He claimed he could just cancel the card if I misused it.",
                    "author": "ImaginaryBullfrog5",
                    "id": "g0598d8",
                    "parent_id": "t1_g058bcf",
                    "score": 9,
                    "created_utc": 1596404717.0,
                    "replies": [
                        {
                            "body": "Okay, *that* I've never done 😂😂😂",
                            "author": "xxnightrain",
                            "id": "g05bnrh",
                            "parent_id": "t1_g0598d8",
                            "score": 6,
                            "created_utc": 1596405992.0,
                            "replies": []
                        },
                        {
                            "body": "Did you use the card?",
                            "author": "Random-Generosity",
                            "id": "g36hbp4",
                            "parent_id": "t1_g0598d8",
                            "score": 1,
                            "created_utc": 1598651211.0,
                            "replies": [
                                {
                                    "body": "Lol, no. We didn’t get that far",
                                    "author": "ImaginaryBullfrog5",
                                    "id": "g36kjfs",
                                    "parent_id": "t1_g36hbp4",
                                    "score": 1,
                                    "created_utc": 1598652871.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> He [sent] me an amazon gift card to prove himself\n\n...\n\n> I blocked him.\n\nMan, I'm feeling some anxiety about this story 😅\n\nIf you're looking for something online only it doesn't really matter where you live. The speed of light down a fiberoptic cable is a great equalizer.",
            "author": "Sugarbeggar",
            "id": "g0592u2",
            "parent_id": "t1_g0558ua",
            "score": 4,
            "created_utc": 1596404639.0,
            "replies": []
        },
        {
            "body": "Did you know that 50 Shades started out as a Twilight fanfic? Lol that's why those similarities are there",
            "author": "Allthatjasmine",
            "id": "g053jir",
            "parent_id": "t1_g04y6ny",
            "score": 15,
            "created_utc": 1596401691.0,
            "replies": [
                {
                    "body": "/takes notes\n\nGo on.\n\nWasnt harry potter a fanfic too?\n\nEdit: My bad, I doesnt seem it was, but I could swear there was another series that was.",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g054mrv",
                    "parent_id": "t1_g053jir",
                    "score": 1,
                    "created_utc": 1596402273.0,
                    "replies": [
                        {
                            "body": "Mortal instruments was a Harry Potter fan fic. There are a bunch of other books that started out as twilight fan fiction too, copycats off of 50 shades, publishers hoping to cash in.",
                            "author": "Sugarbeggar",
                            "id": "g059gai",
                            "parent_id": "t1_g054mrv",
                            "score": 7,
                            "created_utc": 1596404830.0,
                            "replies": [
                                {
                                    "body": "I never knew Mortal Instruments was based on HP, guess that explains why I was obsessed with it in high school, huh?",
                                    "author": "Allthatjasmine",
                                    "id": "g06a8c6",
                                    "parent_id": "t1_g059gai",
                                    "score": 6,
                                    "created_utc": 1596426611.0,
                                    "replies": []
                                },
                                {
                                    "body": "Oooh, cool.\n\nSo if I do a 50 shades fanfic I could end up writing a movie?",
                                    "author": "ICanOnlyGetSoElect",
                                    "id": "g05a3g3",
                                    "parent_id": "t1_g059gai",
                                    "score": 5,
                                    "created_utc": 1596405169.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Literally LOL'ed...Take my upvote you cleverly-named commenter.",
            "author": "Patrucio71",
            "id": "g053nfh",
            "parent_id": "t1_g04y6ny",
            "score": 0,
            "created_utc": 1596401749.0,
            "replies": []
        },
        {
            "body": "Totally agree",
            "author": "Pollydolly75",
            "id": "g059jyf",
            "parent_id": "t1_g055suy",
            "score": 7,
            "created_utc": 1596404883.0,
            "replies": []
        },
        {
            "body": "This reminds me of a Tinderella I once talked to who was looking for an astronomical amount of money. \n\nI said while that might be possible, there weren’t many men out there at that level. She said that there needed to only be one, and she was going to find him, “even if he’s in Italy.”\n\nI wished her well, and didn’t bother to point out that the guy in Italy is probably enjoying the company of Ukrainian supermodels for a lot less than she was asking for.",
            "author": "LaGriffeDuLion",
            "id": "g05ar7p",
            "parent_id": "t1_g055suy",
            "score": 8,
            "created_utc": 1596405510.0,
            "replies": [
                {
                    "body": "Well some of us are living that fantasy! Not probably as far as Italy but definitely as good as any supermodels.",
                    "author": null,
                    "id": "g05rq9p",
                    "parent_id": "t1_g05ar7p",
                    "score": 5,
                    "created_utc": 1596415229.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes - methinks certain reddit SDs might even be envious of this fact as some ladies travel more and of higher caliber than they do. (-: It is a male trait 'thing-y' to proclaim 'fantasy fiction' at anything that seems unreal or unrelatable to their limited funds world of reality (along the same lines of typical male traits of deflection, gaslighting calling women 'emotional', ect.ect).\n\nThey probably thought $10k a table bottle service in Manhattan was fantasy fiction, too. And, why buy a yacht, when running costs are up to a million a year - what a waste! It is all relative to the individual and their wealth. Many uber wealthy men are travelling more than they are 'at home', so it makes sense to see women in other places or just have them travel with him or to him (if he can - why not? Who cares if he does it for ego or because he really likes her as long as he is nice man and generous)...these reddit fellas cannot relate because it is outside of their reality or circle of friends. And, that is okay, middle class is the middle for a reason, but to act like it does not exist and compare it to tweener movies...pfft\n\nWhy worry so much about how other men spend their money or reasons behind it? hmmm...\n\nAnd, amen to healthy boundaries, due to distance!",
            "author": null,
            "id": "g17z1vr",
            "parent_id": "t1_g055suy",
            "score": 3,
            "created_utc": 1597245441.0,
            "replies": []
        },
        {
            "body": "Yeah you have to take the advice on here with a grain of salt.. especially if you’re not brand new.",
            "author": "enchantedazul",
            "id": "g07jzs1",
            "parent_id": "t1_g05bxsa",
            "score": 4,
            "created_utc": 1596464396.0,
            "replies": []
        },
        {
            "body": "Literally just flew a girl from Puerto Rico to hang out for the weekend. She doesn’t speak English I no Hablo, so far so good. Sex is mediocre though",
            "author": "Monkitail",
            "id": "g061um7",
            "parent_id": "t1_g05bxsa",
            "score": 6,
            "created_utc": 1596421301.0,
            "replies": []
        },
        {
            "body": "YESSSSS!!! And they aren’t terrified of being scammed for a measly plane ticket.",
            "author": "testing1to3",
            "id": "g05fiq9",
            "parent_id": "t1_g05bxsa",
            "score": 5,
            "created_utc": 1596408110.0,
            "replies": []
        },
        {
            "body": "Lol. This guy also wanted to send me his name and credit card info to book flights and hotel for me to come meet him. I said, why would ANYONE send their cc info to a complete stranger. He claimed he could just cancel the card if I misused it.",
            "author": "ImaginaryBullfrog5",
            "id": "g0598d8",
            "parent_id": "t1_g058bcf",
            "score": 9,
            "created_utc": 1596404717.0,
            "replies": [
                {
                    "body": "Okay, *that* I've never done 😂😂😂",
                    "author": "xxnightrain",
                    "id": "g05bnrh",
                    "parent_id": "t1_g0598d8",
                    "score": 6,
                    "created_utc": 1596405992.0,
                    "replies": []
                },
                {
                    "body": "Did you use the card?",
                    "author": "Random-Generosity",
                    "id": "g36hbp4",
                    "parent_id": "t1_g0598d8",
                    "score": 1,
                    "created_utc": 1598651211.0,
                    "replies": [
                        {
                            "body": "Lol, no. We didn’t get that far",
                            "author": "ImaginaryBullfrog5",
                            "id": "g36kjfs",
                            "parent_id": "t1_g36hbp4",
                            "score": 1,
                            "created_utc": 1598652871.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "/takes notes\n\nGo on.\n\nWasnt harry potter a fanfic too?\n\nEdit: My bad, I doesnt seem it was, but I could swear there was another series that was.",
            "author": "ICanOnlyGetSoElect",
            "id": "g054mrv",
            "parent_id": "t1_g053jir",
            "score": 1,
            "created_utc": 1596402273.0,
            "replies": [
                {
                    "body": "Mortal instruments was a Harry Potter fan fic. There are a bunch of other books that started out as twilight fan fiction too, copycats off of 50 shades, publishers hoping to cash in.",
                    "author": "Sugarbeggar",
                    "id": "g059gai",
                    "parent_id": "t1_g054mrv",
                    "score": 7,
                    "created_utc": 1596404830.0,
                    "replies": [
                        {
                            "body": "I never knew Mortal Instruments was based on HP, guess that explains why I was obsessed with it in high school, huh?",
                            "author": "Allthatjasmine",
                            "id": "g06a8c6",
                            "parent_id": "t1_g059gai",
                            "score": 6,
                            "created_utc": 1596426611.0,
                            "replies": []
                        },
                        {
                            "body": "Oooh, cool.\n\nSo if I do a 50 shades fanfic I could end up writing a movie?",
                            "author": "ICanOnlyGetSoElect",
                            "id": "g05a3g3",
                            "parent_id": "t1_g059gai",
                            "score": 5,
                            "created_utc": 1596405169.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well some of us are living that fantasy! Not probably as far as Italy but definitely as good as any supermodels.",
            "author": null,
            "id": "g05rq9p",
            "parent_id": "t1_g05ar7p",
            "score": 5,
            "created_utc": 1596415229.0,
            "replies": []
        },
        {
            "body": "Okay, *that* I've never done 😂😂😂",
            "author": "xxnightrain",
            "id": "g05bnrh",
            "parent_id": "t1_g0598d8",
            "score": 6,
            "created_utc": 1596405992.0,
            "replies": []
        },
        {
            "body": "Did you use the card?",
            "author": "Random-Generosity",
            "id": "g36hbp4",
            "parent_id": "t1_g0598d8",
            "score": 1,
            "created_utc": 1598651211.0,
            "replies": [
                {
                    "body": "Lol, no. We didn’t get that far",
                    "author": "ImaginaryBullfrog5",
                    "id": "g36kjfs",
                    "parent_id": "t1_g36hbp4",
                    "score": 1,
                    "created_utc": 1598652871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mortal instruments was a Harry Potter fan fic. There are a bunch of other books that started out as twilight fan fiction too, copycats off of 50 shades, publishers hoping to cash in.",
            "author": "Sugarbeggar",
            "id": "g059gai",
            "parent_id": "t1_g054mrv",
            "score": 7,
            "created_utc": 1596404830.0,
            "replies": [
                {
                    "body": "I never knew Mortal Instruments was based on HP, guess that explains why I was obsessed with it in high school, huh?",
                    "author": "Allthatjasmine",
                    "id": "g06a8c6",
                    "parent_id": "t1_g059gai",
                    "score": 6,
                    "created_utc": 1596426611.0,
                    "replies": []
                },
                {
                    "body": "Oooh, cool.\n\nSo if I do a 50 shades fanfic I could end up writing a movie?",
                    "author": "ICanOnlyGetSoElect",
                    "id": "g05a3g3",
                    "parent_id": "t1_g059gai",
                    "score": 5,
                    "created_utc": 1596405169.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol, no. We didn’t get that far",
            "author": "ImaginaryBullfrog5",
            "id": "g36kjfs",
            "parent_id": "t1_g36hbp4",
            "score": 1,
            "created_utc": 1598652871.0,
            "replies": []
        },
        {
            "body": "I never knew Mortal Instruments was based on HP, guess that explains why I was obsessed with it in high school, huh?",
            "author": "Allthatjasmine",
            "id": "g06a8c6",
            "parent_id": "t1_g059gai",
            "score": 6,
            "created_utc": 1596426611.0,
            "replies": []
        },
        {
            "body": "Oooh, cool.\n\nSo if I do a 50 shades fanfic I could end up writing a movie?",
            "author": "ICanOnlyGetSoElect",
            "id": "g05a3g3",
            "parent_id": "t1_g059gai",
            "score": 5,
            "created_utc": 1596405169.0,
            "replies": []
        }
    ]
}