{
    "title": "I Suck at Being a Sugar Daddy",
    "post_id": "o97y07",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/o97y07/i_suck_at_being_a_sugar_daddy/",
    "author": "worst_sugar_daddy",
    "body": "Hi, everyone. Signed up with a throw away because I can't exactly tell this story to most of my friends and family. And apologies if this isn't allowed or even a good post. \n\nBut here's how I was an awful at being a sugar daddy. Sorry it started getting so long...\n\nA few years ago, I was married and miserable, though I didn't realize how miserable I was at the time. My wife and I had stopped being intimate. She told me it was because of issues she had with her body - nothing I did wrong. But this came about a year after I started sleeping in our guest room because of my snoring (she suggested it since she's a light sleeper). After work, we'd both spend some time with our kid, then scurry off to our respective rooms for the night.\n\nI tried wining and dining her, innocently touching the small of her back/showing affection, calling her beautiful, bringing home little presents, etc... Nothing. I tried fixing myself up some (dressing better, working out a bit). Nothing.\n\nI know she wasn't cheating (at the time), but I think we were both extremely depressed but didn't realize. I realize now, we were only together for our daughter's sake.\n\nOne night I was alone in my room, lonely and hard up, and a thought occurred to me; what if this is the rest of my life? What if I just needed to get my pent up physical needs out of the way in order to be truly happy again? I'd read an article about sugar babies, and figured it wouldn't hurt to look. I signed up for SA, messaged with a few locals who were my type (thick/chubby/bbw) and started narrowing my search.\n\nI messaged a cute 23 year old with hipster glasses, and we started talking. Right off the bat, she told me no married guys. Whelp...guess she wasn't down for an arrangement. I told her I understood, but if she needed someone to talk to she could message me back. She sounded like she had a story to tell.\n\nShe told me about her alcoholic husband, how they'd separated but were still living together, and how she just wanted to be finished with the hole thing. I listened, provided advice, and we really hit it off. She was funny and obviously intelligent, and I enjoyed our conversations.\n\nShe messaged me one night, and asked if I wanted to get a drink at a bar down the street from me. I declined as it was family dinner night (we'd take my mom out to dinner every Friday night). She messaged me later that night asking how dinner went and mentioned she was still at the bar.\n\nGuys, I'd already gone to bed. My hair was wild, my beard made me look like I was homeless, but I decided to go out. Since she didn't see married guys, it was no pressure. I went to tell my wife I was going to a bar (so unlike me), but she was already asleep. I got dressed and went to the bar.\n\nI sat at the bar, ordered a beer, and noticed powdered sugar on my shirt from the Monte Cristo I had at dinner. 🤦‍♂️ About that time, I saw my friend at the end of the bar. I went and sat next to her. She was with a friend who shot me a dirty look. I don't know why her friend was creeped out by the homeless looking guy with white powder on his shirt, just sitting on the bar stool next to her friend 😂\n\nMy friend saw me after a bit, turned around, and gave me a big hug. The look on her friend's face was priceless. We hung out, talking until closing time. We left the bar and spent over an hour talking in the parking lot. I had a blast, and she said she was really glad I came out.\n\nA couple of days later, she asked me why I didn't make a move on her. I told her I assumed it was just a friendly meetup with no ulterior motives. She said it just surprised her I didn't go for a \"kiss and more\" when we left. She said that's what most guys she had SR's with would have done. She invited me out again.\n\nI showed up a little late, and she'd already found a table with a few of her friends. She wore an insanely short dress with her boobs falling out. She looked amazing, in a highly inappropriate way. I took a deep breath, and sat at the table. We had a blast, but it was hard to look her in the eyes when she was wearing that dress. I constantly had to remind myself not to stare.\n\nIt was time to leave, and I walked her to her car. We chatted for a few minutes, and then we just threw ourselves at each other. After making out in the parking lot, she asked to go back to my house. \"Can't...wife... I'll get a room.\" No...save your money. I know where to go. Follow me...\n\nAs I followed her car (funnily enough, we both drove the same model car, only mine was the most recent year), I kept asking myself \"WTF are you doing?\"\n\nWe pulled up to a house. I asked if it was her house, but she told me it was her friends house (the one who didn't like my \"homeless\" vibe when we met). Red flags were raised, but I didn't care. We were back on each other the moment she opened the door. She took off her tiny dress, and laid on the bed in her lingerie...so beautiful and out of my league. Easily the best looking woman I'd ever been with...or so I thought... I had some...performance issues (stress, guilt, anxiety, you name it).\n\nShe was a little upset. We talked for a bit, about everything but the last 30 minutes of our night. I hugged her goodbye, and slunk home.\n\nI didn't hear from her for a couple of days, so I broke the ice. I apologized for my failure to launch and assured her it was my hang ups and had nothing to do with her. We started talking again, and she invited me out again. Third time is the charm. We started seeing each other a couple times a week.\n\nShe was everything my wife wasn't. She made me feel validated in the bedroom, she was adventurous and wanted to try new things, and she made me feel handsome and loved. A couple times a week, she'd bring me food since she knew I missed lunch several times a week. I wasn't used to any of that.\n\nIt was supposed to be a short term thing for me, but neither one of us wanted it to be short term. Here I was a 35 year old, overweight nerd with few \"real life experiences\" with a cuter, much younger woman. I started going gray early, so my hair makes me look about 5-10 years older than I really am.\n\nShe tried to reassure me that she didn't care about my hair, she liked older guys (her husband was just a couple years younger than me), and she liked chubby guys (and judging from her past BFs and her ex-husband, I can see that). She talked about how chubby she was, how she never felt beautiful, how I made her feel gorgeous and loved.\n\nShe said she loved my mind, she loved how respectful I was on outing #2. She wore that skimpy dress on purpose to see if I was serious about being friendly with her or just out with her for a piece of ass. When I didn't look, she said it drove her crazy and she wanted me more.\n\nUltimately though, one of my wife's friends saw us at a bar being handsy. My wife confronted me, called my SB to come to our house for a talk, and we had a sit down meeting in our living room. I was given an ultimatum, and out of panic for my daughter I chose my wife. My SB left in tears, and my wife and I began trying to rebuild our marriage from the ground up.\n\nAbout 4 months later, my wife started behaving strangely. Staying out late with friends, turning off her phone, changing the unlock code...you guys see where this is going... She met someone, and funnily enough (though not at the time), she understands now what I was going through with my SB. The thrill, the fun, the adrenaline and fear of being caught...She ended up marrying her affair partner.\n\nI tried calling my SB a couple of weeks later, but she'd blocked my number. So in a \"cute for romantic movie\"/\"real life WTF are you doing stalker\" move, I called her at work. I wasn't trying to reconcile, but when I chose my wife at our living room meeting, I never got to tell my SB goodbye, never got any closure, never got to tell her what she meant to me.\n\nSB. Was. PISSED (and rightfully so)! I was being a selfish ass but didn't realize it at the time.\n\nShe was working overnights at a nursing home (she obtained her CNA license and started working there while we were together). We sat outside on a cold January night (it was 22°) and talked.\n\nI explained why I'd chose my wife. She explained she had a breakdown, quit sugaring, got her mental health back together to start school to get her RN license. She took her husband back, but had another breakdown and quit school. \n\nShe threw herself into work, working 16 hour days, and once a 24 followed the next day by another 16. She had to drop out of school because she couldn't handle being the sole breadwinner, working well over 40 hours a week, going to school, and no support system for her.\n\nShe told me even though we'd been seeing each other for a few months, she'd fallen for me. Hard. And when I chose my wife over her, it shattered her. \n\nShe wouldn't hug me goodbye. She was glad, in a way, to talk about what happened. But she was sad and pissed that it dredged up her depression and despair from the past few months.\n\nA few days after, she texted me to go get coffee. And we talked, and talked, and talked... About a month later, she came to my house to watch some movies, and she informed me she broke it off with her husband. She wound up spending the night.\n\nIn the past few years I bought her a car, a house, and paid for a nursery (we have a 1 year old now).\n\nSometimes I worry I've been played, and she just used me to get out of a bad situation. Other times I feel loved like I've never been loved.\n\nHere it is, a Sunday, and she's working a 12 hour shift so she can buy groceries and set aside the rest for school (she's starting back again this fall). Baby and I just took her a care package (dinner and a Monster), and she spent her \"lunch\" sitting in the car with baby and me, telling us about her day.\n\nAfter work, we sit on our porch, just like we did outside her work that cold January night, and we talk for hours after the kids are in bed. We talk and plan for the future, we talk about our kids, we talk about how we were selfish but can't believe how hard we fell for each other or how things worked out.\n\nShe still works hard. She insists that she at least needs to buy groceries for the house and pay for most of her own school.\n\nOnce she gets her RN and payoff the house, she's letting me retire early. I joked about not knowing what I'd do with myself being a stay at home dad. The other day, she surprised me one day with a new plan. After she finishes school, she's sending me back to school so I can get my master's. She asked about positions at our local community college and researched how professors are hired, so once I obtain my master's I'm ready to get licensed and apply for a part time teaching gig.\n\nIn a fun twist, we went back to SA to find ourselves a unicorn. She had never been with another woman and wanted to try. We only got to play once because of quarantine, but our new friend is moving to town next month, and we've already discussed meeting up again.\n\nGentlemen and women, I've never been as happy. My lady loves me, we have great kids, and we have a roadmap for our future together. Maybe it works, maybe it doesn't...but it does go to show I suck as a sugar daddy :)\n\n**TLDR: got a SB, fell in love, got caught, got divorced, married SB**",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/o97y07/i_suck_at_being_a_sugar_daddy/",
    "score": 226,
    "upvote_ratio": 0.93,
    "created_utc": 1624835612.0,
    "num_comments": 66,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You have found a very rare thing – a woman who tolerates snoring.",
            "author": null,
            "id": "h3a1eaj",
            "parent_id": "t3_o97y07",
            "score": 86,
            "created_utc": 1624847272.0,
            "replies": [
                {
                    "body": "She told me 1) I probably have sleep apnea and need to get treated, but 2) everyone in her family snores. We lost her dad this past year, and she said now my snoring is comforting to her. 🤷‍♂️",
                    "author": "worst_sugar_daddy",
                    "id": "h3a62ue",
                    "parent_id": "t1_h3a1eaj",
                    "score": 42,
                    "created_utc": 1624849975.0,
                    "replies": []
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h3afpbv",
                    "parent_id": "t1_h3a1eaj",
                    "score": 13,
                    "created_utc": 1624856388.0,
                    "replies": [
                        {
                            "body": "*inbox explodes*",
                            "author": "Distinct-Animal-9628",
                            "id": "h3ai9m0",
                            "parent_id": "t1_h3afpbv",
                            "score": 17,
                            "created_utc": 1624858337.0,
                            "replies": []
                        },
                        {
                            "body": "Same!",
                            "author": "Cdnsugarr",
                            "id": "h3ceda7",
                            "parent_id": "t1_h3afpbv",
                            "score": 3,
                            "created_utc": 1624902307.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Unless it’s insanely loud I actually don’t even mind when someone snores! I fall asleep to noise anyway, even if it’s a loud fan, so sometimes it can be comforting. 😂😂",
                    "author": "Cdnsugarr",
                    "id": "h3cebhk",
                    "parent_id": "t1_h3a1eaj",
                    "score": 2,
                    "created_utc": 1624902285.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That was a truly page turning story, without needing to turn any pages. Many long ones are unreadable drivel, and this one kept my interest. Thank you for sharing! Is this real or fantasy? Inquiring minds want to know!",
            "author": "Intrepid_Seeker",
            "id": "h3a385f",
            "parent_id": "t3_o97y07",
            "score": 28,
            "created_utc": 1624848316.0,
            "replies": [
                {
                    "body": "This is real. She's on my desktop, right now, looking for fabric, but won't tell me why. 🤷‍♂️",
                    "author": "worst_sugar_daddy",
                    "id": "h3a5sqn",
                    "parent_id": "t1_h3a385f",
                    "score": 8,
                    "created_utc": 1624849803.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3ah6ag",
            "parent_id": "t3_o97y07",
            "score": 14,
            "created_utc": 1624857492.0,
            "replies": [
                {
                    "body": "I don't know what a heart attack is like, but I do know about hypertensive crisis now. My ex made me go get tested for STI's the morning after our sit down, and my BP was 186/124. The non-emergency clinic immediately put me on BP meds and threatened to admit me if it didn't go down.\n\nThat sit down is the most intense thing any of us had ever done. My ex wanted to meet the woman who would be \"with (her) daughter one weekend a month.\" (we actually have 50/50 custody, but at the time my ex said she was going to bury me)\n\nI explained to my ex what happened, why things went down the way they did. My ex said things would change if I stayed, but if I didn't break things off with my Honey what would happen (she would tell everyone - including our daughter, she would get full custody, I would only get to see our daughter once a month). I love my Honey, but the thought of having my daughter taken from me was too much. I cowered and acquiesced to my ex's demands.\n\nAfter my Honey officially came back into my life, we let our oldest daughter go to a friend's house for a sleepover. My ex, her bf-now-husband, my Honey, and I all had a BBQ one night. My Honey is a fantastic cook, and she made us fajitas. Her and my ex did some talking with each other, and while they're not besties they are cordial to each other. My Honey will text her pictures of our oldest kiddo, or she'll see a sale and text it to my ex.",
                    "author": "worst_sugar_daddy",
                    "id": "h3bgm69",
                    "parent_id": "t1_h3ah6ag",
                    "score": 5,
                    "created_utc": 1624886727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So I’m extremely nosy and want to know when she got pregnant? Because you mention having a one year old together",
            "author": "Shady_ale",
            "id": "h39rieo",
            "parent_id": "t3_o97y07",
            "score": 14,
            "created_utc": 1624841665.0,
            "replies": [
                {
                    "body": "We talked about it, and we both wanted another kid. We just didn't think it would be possible. I went ten years with my ex-wife without another kid, and my Honey thought her \"lady parts were dumb and didn't work right.\" Turns out both of our parts work ok together 😊\n\nEdit: I never answered your question. We've been together three years, and got pregnant a little after a year together.",
                    "author": "worst_sugar_daddy",
                    "id": "h3a5nqk",
                    "parent_id": "t1_h39rieo",
                    "score": 15,
                    "created_utc": 1624849716.0,
                    "replies": []
                },
                {
                    "body": "Well I could be wrong but my guess is probably around 21 months ago. [This](https://www.reddit.com/r/sugarlifestyleforum/comments/o8wr2g/ask_a_stupid_question_sunday/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) might be a more appropriate place to ask that question though.",
                    "author": "curly_spice",
                    "id": "h39rwij",
                    "parent_id": "t1_h39rieo",
                    "score": 11,
                    "created_utc": 1624841886.0,
                    "replies": [
                        {
                            "body": "I was not aware there was going to be math on this thread",
                            "author": "Azurecole",
                            "id": "h3a20s8",
                            "parent_id": "t1_h39rwij",
                            "score": 16,
                            "created_utc": 1624847635.0,
                            "replies": [
                                {
                                    "body": "Stick around + you’ll find that I’m full of surprises. 🙃",
                                    "author": "curly_spice",
                                    "id": "h3a2px4",
                                    "parent_id": "t1_h3a20s8",
                                    "score": 4,
                                    "created_utc": 1624848029.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Where’s the BURN meme",
                            "author": "mraspencer",
                            "id": "h39xx45",
                            "parent_id": "t1_h39rwij",
                            "score": 7,
                            "created_utc": 1624845295.0,
                            "replies": []
                        },
                        {
                            "body": "💀",
                            "author": "Cdnsugarr",
                            "id": "h3cengp",
                            "parent_id": "t1_h39rwij",
                            "score": 4,
                            "created_utc": 1624902433.0,
                            "replies": []
                        },
                        {
                            "body": "🤣🤣🤣",
                            "author": "thesuitelife2010",
                            "id": "h39u7lh",
                            "parent_id": "t1_h39rwij",
                            "score": 2,
                            "created_utc": 1624843188.0,
                            "replies": []
                        },
                        {
                            "body": "Lol. Ouch",
                            "author": "ChapterRelative",
                            "id": "h39uttf",
                            "parent_id": "t1_h39rwij",
                            "score": 4,
                            "created_utc": 1624843539.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reading this made me worry that she’s been played, and you used her to get out of a bad situation 😗",
            "author": null,
            "id": "h3a2hn0",
            "parent_id": "t3_o97y07",
            "score": 31,
            "created_utc": 1624847902.0,
            "replies": [
                {
                    "body": "same thoughts. I mean, is OP taking care of his SB financially? Sounds like that part was just skipped over",
                    "author": "whyiamthewaythatiam",
                    "id": "h3a773z",
                    "parent_id": "t1_h3a2hn0",
                    "score": 21,
                    "created_utc": 1624850669.0,
                    "replies": [
                        {
                            "body": "She's no longer my SB, but my wife. We had a low key, justice of the peace ceremony. We didn't do anything big because of Covid.\n\nI've told her she doesn't have to work, but she wants to, even if it's just part time. She said she wants to contribute to the house, so she buys groceries for our house.",
                            "author": "worst_sugar_daddy",
                            "id": "h3a81y9",
                            "parent_id": "t1_h3a773z",
                            "score": 10,
                            "created_utc": 1624851212.0,
                            "replies": [
                                {
                                    "body": "When she was your SB were you giving her a ppm or allowance?",
                                    "author": null,
                                    "id": "h3fwi9j",
                                    "parent_id": "t1_h3a81y9",
                                    "score": 3,
                                    "created_utc": 1624976195.0,
                                    "replies": [
                                        {
                                            "body": "PPM and quickly switched to an allowance.",
                                            "author": "worst_sugar_daddy",
                                            "id": "h3gug8j",
                                            "parent_id": "t1_h3fwi9j",
                                            "score": 3,
                                            "created_utc": 1624990949.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "sorry, I am just jaded by the sugar bowl. If it works for both of you, then happy for you guys. Treat her well.",
                                    "author": "whyiamthewaythatiam",
                                    "id": "h3a9vig",
                                    "parent_id": "t1_h3a81y9",
                                    "score": 12,
                                    "created_utc": 1624852381.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h3c7eyl",
                                            "parent_id": "t1_h3a9vig",
                                            "score": -1,
                                            "created_utc": 1624899270.0,
                                            "replies": [
                                                {
                                                    "body": "Oh well, fuck you too I guess. I just wish the best for the SB turned wife in this case. My trauma does not make me less deserving to be in any kind of relationship, SR or otherwise. But that’s not relevant here.",
                                                    "author": "whyiamthewaythatiam",
                                                    "id": "h3dh12x",
                                                    "parent_id": "t1_h3c7eyl",
                                                    "score": 12,
                                                    "created_utc": 1624919177.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't believe that's the case. We're extremely happy together, and she just said \"nope, but if you did you're stuck with me now.\"",
                    "author": "worst_sugar_daddy",
                    "id": "h3a6ol5",
                    "parent_id": "t1_h3a2hn0",
                    "score": 4,
                    "created_utc": 1624850346.0,
                    "replies": []
                },
                {
                    "body": "Same.",
                    "author": "BellaJButtons",
                    "id": "h3by4ay",
                    "parent_id": "t1_h3a2hn0",
                    "score": 1,
                    "created_utc": 1624895201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow. You married your first and only SB.",
            "author": "SBstruggle",
            "id": "h39rmay",
            "parent_id": "t3_o97y07",
            "score": 36,
            "created_utc": 1624841727.0,
            "replies": []
        },
        {
            "body": "Wow, that’s a wild ride right there. \n\nSooo, I take it she has to work to contribute financially? Or do you offer to take care of groceries etc? Curious as to the financial dynamic. If she’s saying you can “retire early,” I take it that she either feels the need to bust her ass or enjoys work?\n\nAlso, that’s crazy that you did a “sit down” with them both. *side eye*",
            "author": "scorpiogirl26",
            "id": "h39rxvg",
            "parent_id": "t3_o97y07",
            "score": 19,
            "created_utc": 1624841906.0,
            "replies": [
                {
                    "body": "She wants to work. Her dad was a nurse practitioner, and he started at the bottom and worked his way up. She got a little later start, but by the time she's 40 she wants to say she did the same.\n\nI told her she doesn't have to work while she's in school, but she wants to contribute to the house, even if it's only groceries.\n\nEdit: auto correct from stop to start",
                    "author": "worst_sugar_daddy",
                    "id": "h3a5e3u",
                    "parent_id": "t1_h39rxvg",
                    "score": 7,
                    "created_utc": 1624849554.0,
                    "replies": [
                        {
                            "body": "Aw that’s good! Nice of you to offer. But also great that she gets fulfillment from her career.",
                            "author": "scorpiogirl26",
                            "id": "h3aav22",
                            "parent_id": "t1_h3a5e3u",
                            "score": 5,
                            "created_utc": 1624853027.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "One more story about my wife. She doesn't have to work, but she wants to. She said she wants to contribute to the house, so she buys our groceries.\n\nEarlier this year, there was a leak in the gas line running to our house. The gas company shut it off, on a Friday at 4:45 and said they'd be back Monday at the earliest to turn the gas back on IF the line was replaced and inspected by then.\n\nI called a plumbing company, and they quoted us $XXXX to replace the line. It was high for our area, but they've done good work for me in the past. My wife called them back, and asked if it would be cheaper if we dug up the old gas line ourselves, and they said that would knock it down 65%. She told them we'd dig it up ourselves. I told her that we could easily afford the extra money to have them do it, but she said that wasn't how she was raised. So that weekend, we dug a 2 x 3 foot trench over 80 feet long in frozen clay soil. There was a large sheet of caliche, about 20 feet long, in our path. She finally relented and let me rent a big trencher from Lowe's for a couple hundred to get past the caliche, but she was bound and determined we were excavating the old line by ourselves.\n\nOn Monday I had to work, and she agreed she'd stay and babysit the plumbers. By that afternoon we had heat again! But I didn't receive a mobile banking notification that the plumbers had been paid. I called and asked, and she told me not to worry about it. She paid the plumbers even though I'd specifically told her to use one of my cards. She said since I pay all of the bills, she could pay the plumbers. She told me her whole life she was taught she has to work, to pull her own weight, and she said she feels guilty not contributing as much as I do (which I completely disagree with - I think she contributes more than I do around the house and with the kids). She said paying the plumbers was the least she could do. I disagree, but I always tell her she is a strong, independent woman who is my partner, and if she wants to do something I won't stand in her way.",
            "author": "worst_sugar_daddy",
            "id": "h3cdymi",
            "parent_id": "t3_o97y07",
            "score": 9,
            "created_utc": 1624902128.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "h3cdyn9",
                    "parent_id": "t1_h3cdymi",
                    "score": 0,
                    "created_utc": 1624902129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This... did not go as I thought it would. Congrats!",
            "author": "stupid_smart_ape",
            "id": "h39rl5g",
            "parent_id": "t3_o97y07",
            "score": 29,
            "created_utc": 1624841708.0,
            "replies": []
        },
        {
            "body": "After you retire you’ll be her SB + she’ll be your SM. How cute!",
            "author": "curly_spice",
            "id": "h39sfef",
            "parent_id": "t3_o97y07",
            "score": 31,
            "created_utc": 1624842177.0,
            "replies": []
        },
        {
            "body": "Lol why do I feel bad for her 😩",
            "author": "itsbabysfirstrave",
            "id": "h3a42p2",
            "parent_id": "t3_o97y07",
            "score": 12,
            "created_utc": 1624848797.0,
            "replies": [
                {
                    "body": "When she talks about my snoring, I feel bad for her too",
                    "author": "worst_sugar_daddy",
                    "id": "h3a5ul7",
                    "parent_id": "t1_h3a42p2",
                    "score": 4,
                    "created_utc": 1624849834.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1) thanks for posting something that was actually well-written\n\n2) thanks for posting something that wasn’t a wall of text\n\n3) thanks for posting something that wasn’t an underwhelming story\n\n4) congrats💜",
            "author": "goingfivehole",
            "id": "h3astlg",
            "parent_id": "t3_o97y07",
            "score": 13,
            "created_utc": 1624867586.0,
            "replies": []
        },
        {
            "body": "oh, i m so happy this is a good ending :) what a wonderful story, would you mind if i ask you a little more about your ex wife? what happened? how is your daughter by the way? i hope the best of the best for all parties implied, life throw us at things we are not prepared for some reasons and yet if we have the strength to let go…",
            "author": "19780521reddit",
            "id": "h3aicss",
            "parent_id": "t3_o97y07",
            "score": 6,
            "created_utc": 1624858406.0,
            "replies": [
                {
                    "body": "My ex-wife...there's a fun subject. 😂 I kid.\n\nWe all actually get along very well for the most part. Pre-COVID we would all go out to dinner together once or twice a month and let our oldest daughter pick where we went. There's been a little drama here and there, but nothing too bad. One of our worst fights was over child support. She told me if my Honey ended up pregnant, ex would file for child support (20 percent of my salary). I told her that was insane, because we'd agreed to 50/50 on everything. She has a job, making nearly as much as me, and we'd always agreed to split everything 50/50. To make up the difference in our salaries, I pay for their cell phone plan, their streaming services, and our oldest daughter's insurance (even though she's on her mom's plan - I transfer ex-wife money monthly for it).\n\nThere was also no way we would wind up preggers 😂😂😂 \n\nSo, God has jokes; ex-wife wound up pregnant 4 months before we did. About two weeks after we'd argued about child support if my Honey ended up pregnant, my ex took a pregnancy test and found out she was 7-8 weeks along.\n\nMy oldest daughter...God she is a champ. We all acted trashy as hell. Divorce, 2 new people in her life, 2 new sisters in her life, a new house, having 2 different homes...\n\nEven though we shielded her from any arguments, eased her into the whole \"hey, here's 2 new people in your life\", that's a lot of change for a kid. We put her in counseling, and we also did group couples parenting sessions. For awhile she liked our house better, now she see-saws back and forth. We are a bit more structured and strict with our rules (keep your room clean, wash any dishes you use, feed your dog), but I don't think we're asking too much of an almost-teenager with those 3 things. Her mom's house runs a little different even though we drafted our house rules together.\n\nWe were struggling with her a little when COVID hit, and I don't know what happened, but it's like a light switch was flipped with her. She matured over the course of just a couple of months, took care of her virtual learning without our nagging/intervention, started keeping her room clean without us telling her, and she started warming up to the babies recently. I sit down with her once or twice a week, one on one, and do a check in (how you doin', you need anything, you need to bitch about anything, etc...) She seems to really enjoy our one on one talks. Some of them have hurt, but she told me last week she hasn't been this happy in a while. So we're getting there.",
                    "author": "worst_sugar_daddy",
                    "id": "h3bc3kf",
                    "parent_id": "t1_h3aicss",
                    "score": 9,
                    "created_utc": 1624884095.0,
                    "replies": [
                        {
                            "body": "most important for a child is to see her parents happy and seeing they care a lot about her while taking reasonable and co-decided decisions for her future",
                            "author": "19780521reddit",
                            "id": "h3c1iad",
                            "parent_id": "t1_h3bc3kf",
                            "score": 4,
                            "created_utc": 1624896708.0,
                            "replies": []
                        },
                        {
                            "body": "You’re a good person and a good dad :)",
                            "author": "kimchi_Queen",
                            "id": "h7sajkm",
                            "parent_id": "t1_h3bc3kf",
                            "score": 3,
                            "created_utc": 1628155348.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love it , one of the best sugar stories I’ve read so far. Have a happy life you two x",
            "author": "Pollydolly75",
            "id": "h3drn51",
            "parent_id": "t3_o97y07",
            "score": 3,
            "created_utc": 1624924546.0,
            "replies": []
        },
        {
            "body": "You made the right choice eventually.  You are so lucky she gave you another chance after you fucked it up",
            "author": "wb19081908",
            "id": "h3aqby4",
            "parent_id": "t3_o97y07",
            "score": 7,
            "created_utc": 1624865240.0,
            "replies": [
                {
                    "body": "So incredibly lucky",
                    "author": "worst_sugar_daddy",
                    "id": "h3bc42i",
                    "parent_id": "t1_h3aqby4",
                    "score": 6,
                    "created_utc": 1624884104.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely loved this story, thanks for sharing.",
            "author": "victoriaharlowe",
            "id": "h3epc2d",
            "parent_id": "t3_o97y07",
            "score": 3,
            "created_utc": 1624943230.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3aj3rb",
            "parent_id": "t3_o97y07",
            "score": 5,
            "created_utc": 1624858995.0,
            "replies": [
                {
                    "body": "I try to make it up to her every day, because I know I hurt her. I asked her if she felt like I used her, and she said after I picked my ex-wife she felt used, heart broken, and like a fool. In the ~5 months we were apart, she struggled with her mental health and healing. When I showed up again, it dredged up a lot of the unresolved feelings she had. But she started to forgive me because she said she knew I didn't love ex, but loved my kid and thought it would be best for her.\n\nShe said one of the most attractive things about me is I'm a good Dad (side note: ladies, don't have low expectations for your men. I watch our baby by myself on weekends while my Honey is working, and her and her family treats me like a God damned super hero. It's not hard to watch my baby a couple days a week by myself...)\n\nShe'll call me an idiot from time to time, but then she smiles and kisses me. I know I messed up, she knows it, but she told me she always knew I'd come back to her one day because we had love on our side.",
                    "author": "worst_sugar_daddy",
                    "id": "h3bd7o3",
                    "parent_id": "t1_h3aj3rb",
                    "score": 3,
                    "created_utc": 1624884769.0,
                    "replies": [
                        {
                            "body": "You did the right thing. Any man that would choose a woman over his child is a shitty person, and vice versa. If they treat their kids as disposable they'd do the same to their partners. \n\nYour SB knows that and that's why she's now your wife and baby mama.",
                            "author": "LumbeeLady",
                            "id": "h3c0ufc",
                            "parent_id": "t1_h3bd7o3",
                            "score": 2,
                            "created_utc": 1624896411.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Clearly you've never had kids. Sometimes you stay for them. Not for the other person but so they can have a 2 parent home and love and care with both parents within arms reach.",
                    "author": "No-Pin-9988",
                    "id": "h3ak7yr",
                    "parent_id": "t1_h3aj3rb",
                    "score": 5,
                    "created_utc": 1624859900.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h3akd21",
                            "parent_id": "t1_h3ak7yr",
                            "score": 3,
                            "created_utc": 1624860015.0,
                            "replies": [
                                {
                                    "body": "Yes, you're more concerned because you don't have kids apparently. Had he chosen the SB the daughter would have felt abandoned. Your children should always be a priority over everyone, otherwise you're a shit person. I'd never be with a man that treats his kids like shit cause he'd most likely treat his partner just as bad.",
                                    "author": "LumbeeLady",
                                    "id": "h3c0b4a",
                                    "parent_id": "t1_h3akd21",
                                    "score": 2,
                                    "created_utc": 1624896170.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think it doesn't matter how it works, as long as it works. The only straight edges on a jigsaw puzzle are the frame ones.",
                                    "author": "AnSteall",
                                    "id": "h3awg48",
                                    "parent_id": "t1_h3akd21",
                                    "score": 0,
                                    "created_utc": 1624871194.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sometimes you have to lose someone to find out they are what you really want.",
                    "author": "Ashleycakessssss",
                    "id": "h3b1jap",
                    "parent_id": "t1_h3aj3rb",
                    "score": 0,
                    "created_utc": 1624876107.0,
                    "replies": []
                },
                {
                    "body": "My brothers girlfriend has been very honest that if he ever leaves her she’ll take the kids and disappear. (She’s nuts!) \n\nSometimes you stay in a bad situation - it doesn’t mean he didn’t love his SB, but that’s a scary thought when you have kids.",
                    "author": "Cdnsugarr",
                    "id": "h3cez3a",
                    "parent_id": "t1_h3aj3rb",
                    "score": 1,
                    "created_utc": 1624902576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats, guy.  This might be the sugar story of the year.",
            "author": "ladofillrepute",
            "id": "h4oej11",
            "parent_id": "t3_o97y07",
            "score": 2,
            "created_utc": 1625899249.0,
            "replies": []
        },
        {
            "body": "This made me cry 🥺 good for you, sir.\nYou made it. ❤️❤️",
            "author": "UnderstandingAny4782",
            "id": "hl2179i",
            "parent_id": "t3_o97y07",
            "score": 2,
            "created_utc": 1637194050.0,
            "replies": []
        },
        {
            "body": "This is so cuteeeee 🥺 ideally I would fall in love with my SD and have a little chicken nugget together. I know I only want one 😂 let's see if I can get an old man to budge",
            "author": null,
            "id": "h3b1o7q",
            "parent_id": "t3_o97y07",
            "score": 3,
            "created_utc": 1624876231.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3ar2um",
            "parent_id": "t3_o97y07",
            "score": 0,
            "created_utc": 1624865940.0,
            "replies": [
                {
                    "body": "I don't think my former SB/now wife and I are a typical result, but I am happier now than I was in the 9 years I was married to my ex.\n\nI (and I think my ex) really didn't know how bad things were between us. My ex and I were essentially roommates; no intimacy, no affection, just living under the same room and raising our daughter. We got along well, rarely fought, but we were both depressed. I thought if I just had a SB to temporarily fill that gap in my life, then I would be a better dad, better husband, I could fill that missing part of my life...\n\nIf I were to do things the right way, I would have insisted my wife and I each get therapy and possibly do couples counseling as well. If that failed, then I would have brought up divorce. I know \"men only want one thing...\" but people need physical touch and affection. People need hugs and touches, someone kissing us for no reason.\n\nI asked my ex after everything happened, what went wrong. She said she was unhappy with her weight and didn't feel attractive (she was 5'3\", 306lbs). I told her I didn't care about her weight because I had loved her. She said she knew that, but she felt disgusting and didn't want me touching her because she \"was disgusting\" (her words, not mine). I had been working on myself, but during our failed reconciliation she really went to work on herself. She lost 80lbs in a few months. She had more energy. We started being intimate again daily, once going 24 days straight at least twice daily. We had a big fight on the 25th day. I had a headache, I was tired, I was missing my Honey (though I could never tell anyone I missed her), and I couldn't perform.\n\nIDK what your circumstances are. If you've brought up counseling/therapy, improving your health through fitness and exercise, and have tried everything you can think of, then maybe divorce then take the plunge? If not, just be more cautious than we were. We're in a small city, so of course we'd run into one of my ex's friends eventually.",
                    "author": "worst_sugar_daddy",
                    "id": "h3bkzgu",
                    "parent_id": "t1_h3ar2um",
                    "score": 5,
                    "created_utc": 1624889017.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I made a SA account two weeks ago and I am not having any luck with the SDs I am interested in. They look at my page but dont message me nor message me back. Is there something I’m doing wrong?",
            "author": "Ok_Leadership_4208",
            "id": "h3il2t0",
            "parent_id": "t3_o97y07",
            "score": 1,
            "created_utc": 1625020365.0,
            "replies": [
                {
                    "body": "Wrong thread to ask this. Look at the memo area on the first area of the subreddit... lots of info around there regarding help. You could also put up a profile review, maybe its your profile pics or what you've written thats coming across perhaps not in the way you wish and you're not attracting due to that? Goodluck :)",
                    "author": "WorldwideLoving",
                    "id": "h3wztyg",
                    "parent_id": "t1_h3il2t0",
                    "score": 4,
                    "created_utc": 1625317237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m looking for a sugar daddy",
            "author": null,
            "id": "h4bab33",
            "parent_id": "t3_o97y07",
            "score": 1,
            "created_utc": 1625626669.0,
            "replies": []
        },
        {
            "body": "She told me 1) I probably have sleep apnea and need to get treated, but 2) everyone in her family snores. We lost her dad this past year, and she said now my snoring is comforting to her. 🤷‍♂️",
            "author": "worst_sugar_daddy",
            "id": "h3a62ue",
            "parent_id": "t1_h3a1eaj",
            "score": 42,
            "created_utc": 1624849975.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h3afpbv",
            "parent_id": "t1_h3a1eaj",
            "score": 13,
            "created_utc": 1624856388.0,
            "replies": [
                {
                    "body": "*inbox explodes*",
                    "author": "Distinct-Animal-9628",
                    "id": "h3ai9m0",
                    "parent_id": "t1_h3afpbv",
                    "score": 17,
                    "created_utc": 1624858337.0,
                    "replies": []
                },
                {
                    "body": "Same!",
                    "author": "Cdnsugarr",
                    "id": "h3ceda7",
                    "parent_id": "t1_h3afpbv",
                    "score": 3,
                    "created_utc": 1624902307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless it’s insanely loud I actually don’t even mind when someone snores! I fall asleep to noise anyway, even if it’s a loud fan, so sometimes it can be comforting. 😂😂",
            "author": "Cdnsugarr",
            "id": "h3cebhk",
            "parent_id": "t1_h3a1eaj",
            "score": 2,
            "created_utc": 1624902285.0,
            "replies": []
        },
        {
            "body": "This is real. She's on my desktop, right now, looking for fabric, but won't tell me why. 🤷‍♂️",
            "author": "worst_sugar_daddy",
            "id": "h3a5sqn",
            "parent_id": "t1_h3a385f",
            "score": 8,
            "created_utc": 1624849803.0,
            "replies": []
        },
        {
            "body": "I don't know what a heart attack is like, but I do know about hypertensive crisis now. My ex made me go get tested for STI's the morning after our sit down, and my BP was 186/124. The non-emergency clinic immediately put me on BP meds and threatened to admit me if it didn't go down.\n\nThat sit down is the most intense thing any of us had ever done. My ex wanted to meet the woman who would be \"with (her) daughter one weekend a month.\" (we actually have 50/50 custody, but at the time my ex said she was going to bury me)\n\nI explained to my ex what happened, why things went down the way they did. My ex said things would change if I stayed, but if I didn't break things off with my Honey what would happen (she would tell everyone - including our daughter, she would get full custody, I would only get to see our daughter once a month). I love my Honey, but the thought of having my daughter taken from me was too much. I cowered and acquiesced to my ex's demands.\n\nAfter my Honey officially came back into my life, we let our oldest daughter go to a friend's house for a sleepover. My ex, her bf-now-husband, my Honey, and I all had a BBQ one night. My Honey is a fantastic cook, and she made us fajitas. Her and my ex did some talking with each other, and while they're not besties they are cordial to each other. My Honey will text her pictures of our oldest kiddo, or she'll see a sale and text it to my ex.",
            "author": "worst_sugar_daddy",
            "id": "h3bgm69",
            "parent_id": "t1_h3ah6ag",
            "score": 5,
            "created_utc": 1624886727.0,
            "replies": []
        },
        {
            "body": "We talked about it, and we both wanted another kid. We just didn't think it would be possible. I went ten years with my ex-wife without another kid, and my Honey thought her \"lady parts were dumb and didn't work right.\" Turns out both of our parts work ok together 😊\n\nEdit: I never answered your question. We've been together three years, and got pregnant a little after a year together.",
            "author": "worst_sugar_daddy",
            "id": "h3a5nqk",
            "parent_id": "t1_h39rieo",
            "score": 15,
            "created_utc": 1624849716.0,
            "replies": []
        },
        {
            "body": "Well I could be wrong but my guess is probably around 21 months ago. [This](https://www.reddit.com/r/sugarlifestyleforum/comments/o8wr2g/ask_a_stupid_question_sunday/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) might be a more appropriate place to ask that question though.",
            "author": "curly_spice",
            "id": "h39rwij",
            "parent_id": "t1_h39rieo",
            "score": 11,
            "created_utc": 1624841886.0,
            "replies": [
                {
                    "body": "I was not aware there was going to be math on this thread",
                    "author": "Azurecole",
                    "id": "h3a20s8",
                    "parent_id": "t1_h39rwij",
                    "score": 16,
                    "created_utc": 1624847635.0,
                    "replies": [
                        {
                            "body": "Stick around + you’ll find that I’m full of surprises. 🙃",
                            "author": "curly_spice",
                            "id": "h3a2px4",
                            "parent_id": "t1_h3a20s8",
                            "score": 4,
                            "created_utc": 1624848029.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Where’s the BURN meme",
                    "author": "mraspencer",
                    "id": "h39xx45",
                    "parent_id": "t1_h39rwij",
                    "score": 7,
                    "created_utc": 1624845295.0,
                    "replies": []
                },
                {
                    "body": "💀",
                    "author": "Cdnsugarr",
                    "id": "h3cengp",
                    "parent_id": "t1_h39rwij",
                    "score": 4,
                    "created_utc": 1624902433.0,
                    "replies": []
                },
                {
                    "body": "🤣🤣🤣",
                    "author": "thesuitelife2010",
                    "id": "h39u7lh",
                    "parent_id": "t1_h39rwij",
                    "score": 2,
                    "created_utc": 1624843188.0,
                    "replies": []
                },
                {
                    "body": "Lol. Ouch",
                    "author": "ChapterRelative",
                    "id": "h39uttf",
                    "parent_id": "t1_h39rwij",
                    "score": 4,
                    "created_utc": 1624843539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "same thoughts. I mean, is OP taking care of his SB financially? Sounds like that part was just skipped over",
            "author": "whyiamthewaythatiam",
            "id": "h3a773z",
            "parent_id": "t1_h3a2hn0",
            "score": 21,
            "created_utc": 1624850669.0,
            "replies": [
                {
                    "body": "She's no longer my SB, but my wife. We had a low key, justice of the peace ceremony. We didn't do anything big because of Covid.\n\nI've told her she doesn't have to work, but she wants to, even if it's just part time. She said she wants to contribute to the house, so she buys groceries for our house.",
                    "author": "worst_sugar_daddy",
                    "id": "h3a81y9",
                    "parent_id": "t1_h3a773z",
                    "score": 10,
                    "created_utc": 1624851212.0,
                    "replies": [
                        {
                            "body": "When she was your SB were you giving her a ppm or allowance?",
                            "author": null,
                            "id": "h3fwi9j",
                            "parent_id": "t1_h3a81y9",
                            "score": 3,
                            "created_utc": 1624976195.0,
                            "replies": [
                                {
                                    "body": "PPM and quickly switched to an allowance.",
                                    "author": "worst_sugar_daddy",
                                    "id": "h3gug8j",
                                    "parent_id": "t1_h3fwi9j",
                                    "score": 3,
                                    "created_utc": 1624990949.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "sorry, I am just jaded by the sugar bowl. If it works for both of you, then happy for you guys. Treat her well.",
                            "author": "whyiamthewaythatiam",
                            "id": "h3a9vig",
                            "parent_id": "t1_h3a81y9",
                            "score": 12,
                            "created_utc": 1624852381.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h3c7eyl",
                                    "parent_id": "t1_h3a9vig",
                                    "score": -1,
                                    "created_utc": 1624899270.0,
                                    "replies": [
                                        {
                                            "body": "Oh well, fuck you too I guess. I just wish the best for the SB turned wife in this case. My trauma does not make me less deserving to be in any kind of relationship, SR or otherwise. But that’s not relevant here.",
                                            "author": "whyiamthewaythatiam",
                                            "id": "h3dh12x",
                                            "parent_id": "t1_h3c7eyl",
                                            "score": 12,
                                            "created_utc": 1624919177.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't believe that's the case. We're extremely happy together, and she just said \"nope, but if you did you're stuck with me now.\"",
            "author": "worst_sugar_daddy",
            "id": "h3a6ol5",
            "parent_id": "t1_h3a2hn0",
            "score": 4,
            "created_utc": 1624850346.0,
            "replies": []
        },
        {
            "body": "Same.",
            "author": "BellaJButtons",
            "id": "h3by4ay",
            "parent_id": "t1_h3a2hn0",
            "score": 1,
            "created_utc": 1624895201.0,
            "replies": []
        },
        {
            "body": "She wants to work. Her dad was a nurse practitioner, and he started at the bottom and worked his way up. She got a little later start, but by the time she's 40 she wants to say she did the same.\n\nI told her she doesn't have to work while she's in school, but she wants to contribute to the house, even if it's only groceries.\n\nEdit: auto correct from stop to start",
            "author": "worst_sugar_daddy",
            "id": "h3a5e3u",
            "parent_id": "t1_h39rxvg",
            "score": 7,
            "created_utc": 1624849554.0,
            "replies": [
                {
                    "body": "Aw that’s good! Nice of you to offer. But also great that she gets fulfillment from her career.",
                    "author": "scorpiogirl26",
                    "id": "h3aav22",
                    "parent_id": "t1_h3a5e3u",
                    "score": 5,
                    "created_utc": 1624853027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "h3cdyn9",
            "parent_id": "t1_h3cdymi",
            "score": 0,
            "created_utc": 1624902129.0,
            "replies": []
        },
        {
            "body": "When she talks about my snoring, I feel bad for her too",
            "author": "worst_sugar_daddy",
            "id": "h3a5ul7",
            "parent_id": "t1_h3a42p2",
            "score": 4,
            "created_utc": 1624849834.0,
            "replies": []
        },
        {
            "body": "My ex-wife...there's a fun subject. 😂 I kid.\n\nWe all actually get along very well for the most part. Pre-COVID we would all go out to dinner together once or twice a month and let our oldest daughter pick where we went. There's been a little drama here and there, but nothing too bad. One of our worst fights was over child support. She told me if my Honey ended up pregnant, ex would file for child support (20 percent of my salary). I told her that was insane, because we'd agreed to 50/50 on everything. She has a job, making nearly as much as me, and we'd always agreed to split everything 50/50. To make up the difference in our salaries, I pay for their cell phone plan, their streaming services, and our oldest daughter's insurance (even though she's on her mom's plan - I transfer ex-wife money monthly for it).\n\nThere was also no way we would wind up preggers 😂😂😂 \n\nSo, God has jokes; ex-wife wound up pregnant 4 months before we did. About two weeks after we'd argued about child support if my Honey ended up pregnant, my ex took a pregnancy test and found out she was 7-8 weeks along.\n\nMy oldest daughter...God she is a champ. We all acted trashy as hell. Divorce, 2 new people in her life, 2 new sisters in her life, a new house, having 2 different homes...\n\nEven though we shielded her from any arguments, eased her into the whole \"hey, here's 2 new people in your life\", that's a lot of change for a kid. We put her in counseling, and we also did group couples parenting sessions. For awhile she liked our house better, now she see-saws back and forth. We are a bit more structured and strict with our rules (keep your room clean, wash any dishes you use, feed your dog), but I don't think we're asking too much of an almost-teenager with those 3 things. Her mom's house runs a little different even though we drafted our house rules together.\n\nWe were struggling with her a little when COVID hit, and I don't know what happened, but it's like a light switch was flipped with her. She matured over the course of just a couple of months, took care of her virtual learning without our nagging/intervention, started keeping her room clean without us telling her, and she started warming up to the babies recently. I sit down with her once or twice a week, one on one, and do a check in (how you doin', you need anything, you need to bitch about anything, etc...) She seems to really enjoy our one on one talks. Some of them have hurt, but she told me last week she hasn't been this happy in a while. So we're getting there.",
            "author": "worst_sugar_daddy",
            "id": "h3bc3kf",
            "parent_id": "t1_h3aicss",
            "score": 9,
            "created_utc": 1624884095.0,
            "replies": [
                {
                    "body": "most important for a child is to see her parents happy and seeing they care a lot about her while taking reasonable and co-decided decisions for her future",
                    "author": "19780521reddit",
                    "id": "h3c1iad",
                    "parent_id": "t1_h3bc3kf",
                    "score": 4,
                    "created_utc": 1624896708.0,
                    "replies": []
                },
                {
                    "body": "You’re a good person and a good dad :)",
                    "author": "kimchi_Queen",
                    "id": "h7sajkm",
                    "parent_id": "t1_h3bc3kf",
                    "score": 3,
                    "created_utc": 1628155348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So incredibly lucky",
            "author": "worst_sugar_daddy",
            "id": "h3bc42i",
            "parent_id": "t1_h3aqby4",
            "score": 6,
            "created_utc": 1624884104.0,
            "replies": []
        },
        {
            "body": "I try to make it up to her every day, because I know I hurt her. I asked her if she felt like I used her, and she said after I picked my ex-wife she felt used, heart broken, and like a fool. In the ~5 months we were apart, she struggled with her mental health and healing. When I showed up again, it dredged up a lot of the unresolved feelings she had. But she started to forgive me because she said she knew I didn't love ex, but loved my kid and thought it would be best for her.\n\nShe said one of the most attractive things about me is I'm a good Dad (side note: ladies, don't have low expectations for your men. I watch our baby by myself on weekends while my Honey is working, and her and her family treats me like a God damned super hero. It's not hard to watch my baby a couple days a week by myself...)\n\nShe'll call me an idiot from time to time, but then she smiles and kisses me. I know I messed up, she knows it, but she told me she always knew I'd come back to her one day because we had love on our side.",
            "author": "worst_sugar_daddy",
            "id": "h3bd7o3",
            "parent_id": "t1_h3aj3rb",
            "score": 3,
            "created_utc": 1624884769.0,
            "replies": [
                {
                    "body": "You did the right thing. Any man that would choose a woman over his child is a shitty person, and vice versa. If they treat their kids as disposable they'd do the same to their partners. \n\nYour SB knows that and that's why she's now your wife and baby mama.",
                    "author": "LumbeeLady",
                    "id": "h3c0ufc",
                    "parent_id": "t1_h3bd7o3",
                    "score": 2,
                    "created_utc": 1624896411.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Clearly you've never had kids. Sometimes you stay for them. Not for the other person but so they can have a 2 parent home and love and care with both parents within arms reach.",
            "author": "No-Pin-9988",
            "id": "h3ak7yr",
            "parent_id": "t1_h3aj3rb",
            "score": 5,
            "created_utc": 1624859900.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h3akd21",
                    "parent_id": "t1_h3ak7yr",
                    "score": 3,
                    "created_utc": 1624860015.0,
                    "replies": [
                        {
                            "body": "Yes, you're more concerned because you don't have kids apparently. Had he chosen the SB the daughter would have felt abandoned. Your children should always be a priority over everyone, otherwise you're a shit person. I'd never be with a man that treats his kids like shit cause he'd most likely treat his partner just as bad.",
                            "author": "LumbeeLady",
                            "id": "h3c0b4a",
                            "parent_id": "t1_h3akd21",
                            "score": 2,
                            "created_utc": 1624896170.0,
                            "replies": []
                        },
                        {
                            "body": "I think it doesn't matter how it works, as long as it works. The only straight edges on a jigsaw puzzle are the frame ones.",
                            "author": "AnSteall",
                            "id": "h3awg48",
                            "parent_id": "t1_h3akd21",
                            "score": 0,
                            "created_utc": 1624871194.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sometimes you have to lose someone to find out they are what you really want.",
            "author": "Ashleycakessssss",
            "id": "h3b1jap",
            "parent_id": "t1_h3aj3rb",
            "score": 0,
            "created_utc": 1624876107.0,
            "replies": []
        },
        {
            "body": "My brothers girlfriend has been very honest that if he ever leaves her she’ll take the kids and disappear. (She’s nuts!) \n\nSometimes you stay in a bad situation - it doesn’t mean he didn’t love his SB, but that’s a scary thought when you have kids.",
            "author": "Cdnsugarr",
            "id": "h3cez3a",
            "parent_id": "t1_h3aj3rb",
            "score": 1,
            "created_utc": 1624902576.0,
            "replies": []
        },
        {
            "body": "I don't think my former SB/now wife and I are a typical result, but I am happier now than I was in the 9 years I was married to my ex.\n\nI (and I think my ex) really didn't know how bad things were between us. My ex and I were essentially roommates; no intimacy, no affection, just living under the same room and raising our daughter. We got along well, rarely fought, but we were both depressed. I thought if I just had a SB to temporarily fill that gap in my life, then I would be a better dad, better husband, I could fill that missing part of my life...\n\nIf I were to do things the right way, I would have insisted my wife and I each get therapy and possibly do couples counseling as well. If that failed, then I would have brought up divorce. I know \"men only want one thing...\" but people need physical touch and affection. People need hugs and touches, someone kissing us for no reason.\n\nI asked my ex after everything happened, what went wrong. She said she was unhappy with her weight and didn't feel attractive (she was 5'3\", 306lbs). I told her I didn't care about her weight because I had loved her. She said she knew that, but she felt disgusting and didn't want me touching her because she \"was disgusting\" (her words, not mine). I had been working on myself, but during our failed reconciliation she really went to work on herself. She lost 80lbs in a few months. She had more energy. We started being intimate again daily, once going 24 days straight at least twice daily. We had a big fight on the 25th day. I had a headache, I was tired, I was missing my Honey (though I could never tell anyone I missed her), and I couldn't perform.\n\nIDK what your circumstances are. If you've brought up counseling/therapy, improving your health through fitness and exercise, and have tried everything you can think of, then maybe divorce then take the plunge? If not, just be more cautious than we were. We're in a small city, so of course we'd run into one of my ex's friends eventually.",
            "author": "worst_sugar_daddy",
            "id": "h3bkzgu",
            "parent_id": "t1_h3ar2um",
            "score": 5,
            "created_utc": 1624889017.0,
            "replies": []
        },
        {
            "body": "Wrong thread to ask this. Look at the memo area on the first area of the subreddit... lots of info around there regarding help. You could also put up a profile review, maybe its your profile pics or what you've written thats coming across perhaps not in the way you wish and you're not attracting due to that? Goodluck :)",
            "author": "WorldwideLoving",
            "id": "h3wztyg",
            "parent_id": "t1_h3il2t0",
            "score": 4,
            "created_utc": 1625317237.0,
            "replies": []
        },
        {
            "body": "*inbox explodes*",
            "author": "Distinct-Animal-9628",
            "id": "h3ai9m0",
            "parent_id": "t1_h3afpbv",
            "score": 17,
            "created_utc": 1624858337.0,
            "replies": []
        },
        {
            "body": "Same!",
            "author": "Cdnsugarr",
            "id": "h3ceda7",
            "parent_id": "t1_h3afpbv",
            "score": 3,
            "created_utc": 1624902307.0,
            "replies": []
        },
        {
            "body": "I was not aware there was going to be math on this thread",
            "author": "Azurecole",
            "id": "h3a20s8",
            "parent_id": "t1_h39rwij",
            "score": 16,
            "created_utc": 1624847635.0,
            "replies": [
                {
                    "body": "Stick around + you’ll find that I’m full of surprises. 🙃",
                    "author": "curly_spice",
                    "id": "h3a2px4",
                    "parent_id": "t1_h3a20s8",
                    "score": 4,
                    "created_utc": 1624848029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Where’s the BURN meme",
            "author": "mraspencer",
            "id": "h39xx45",
            "parent_id": "t1_h39rwij",
            "score": 7,
            "created_utc": 1624845295.0,
            "replies": []
        },
        {
            "body": "💀",
            "author": "Cdnsugarr",
            "id": "h3cengp",
            "parent_id": "t1_h39rwij",
            "score": 4,
            "created_utc": 1624902433.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣",
            "author": "thesuitelife2010",
            "id": "h39u7lh",
            "parent_id": "t1_h39rwij",
            "score": 2,
            "created_utc": 1624843188.0,
            "replies": []
        },
        {
            "body": "Lol. Ouch",
            "author": "ChapterRelative",
            "id": "h39uttf",
            "parent_id": "t1_h39rwij",
            "score": 4,
            "created_utc": 1624843539.0,
            "replies": []
        },
        {
            "body": "She's no longer my SB, but my wife. We had a low key, justice of the peace ceremony. We didn't do anything big because of Covid.\n\nI've told her she doesn't have to work, but she wants to, even if it's just part time. She said she wants to contribute to the house, so she buys groceries for our house.",
            "author": "worst_sugar_daddy",
            "id": "h3a81y9",
            "parent_id": "t1_h3a773z",
            "score": 10,
            "created_utc": 1624851212.0,
            "replies": [
                {
                    "body": "When she was your SB were you giving her a ppm or allowance?",
                    "author": null,
                    "id": "h3fwi9j",
                    "parent_id": "t1_h3a81y9",
                    "score": 3,
                    "created_utc": 1624976195.0,
                    "replies": [
                        {
                            "body": "PPM and quickly switched to an allowance.",
                            "author": "worst_sugar_daddy",
                            "id": "h3gug8j",
                            "parent_id": "t1_h3fwi9j",
                            "score": 3,
                            "created_utc": 1624990949.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "sorry, I am just jaded by the sugar bowl. If it works for both of you, then happy for you guys. Treat her well.",
                    "author": "whyiamthewaythatiam",
                    "id": "h3a9vig",
                    "parent_id": "t1_h3a81y9",
                    "score": 12,
                    "created_utc": 1624852381.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h3c7eyl",
                            "parent_id": "t1_h3a9vig",
                            "score": -1,
                            "created_utc": 1624899270.0,
                            "replies": [
                                {
                                    "body": "Oh well, fuck you too I guess. I just wish the best for the SB turned wife in this case. My trauma does not make me less deserving to be in any kind of relationship, SR or otherwise. But that’s not relevant here.",
                                    "author": "whyiamthewaythatiam",
                                    "id": "h3dh12x",
                                    "parent_id": "t1_h3c7eyl",
                                    "score": 12,
                                    "created_utc": 1624919177.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aw that’s good! Nice of you to offer. But also great that she gets fulfillment from her career.",
            "author": "scorpiogirl26",
            "id": "h3aav22",
            "parent_id": "t1_h3a5e3u",
            "score": 5,
            "created_utc": 1624853027.0,
            "replies": []
        },
        {
            "body": "most important for a child is to see her parents happy and seeing they care a lot about her while taking reasonable and co-decided decisions for her future",
            "author": "19780521reddit",
            "id": "h3c1iad",
            "parent_id": "t1_h3bc3kf",
            "score": 4,
            "created_utc": 1624896708.0,
            "replies": []
        },
        {
            "body": "You’re a good person and a good dad :)",
            "author": "kimchi_Queen",
            "id": "h7sajkm",
            "parent_id": "t1_h3bc3kf",
            "score": 3,
            "created_utc": 1628155348.0,
            "replies": []
        },
        {
            "body": "You did the right thing. Any man that would choose a woman over his child is a shitty person, and vice versa. If they treat their kids as disposable they'd do the same to their partners. \n\nYour SB knows that and that's why she's now your wife and baby mama.",
            "author": "LumbeeLady",
            "id": "h3c0ufc",
            "parent_id": "t1_h3bd7o3",
            "score": 2,
            "created_utc": 1624896411.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3akd21",
            "parent_id": "t1_h3ak7yr",
            "score": 3,
            "created_utc": 1624860015.0,
            "replies": [
                {
                    "body": "Yes, you're more concerned because you don't have kids apparently. Had he chosen the SB the daughter would have felt abandoned. Your children should always be a priority over everyone, otherwise you're a shit person. I'd never be with a man that treats his kids like shit cause he'd most likely treat his partner just as bad.",
                    "author": "LumbeeLady",
                    "id": "h3c0b4a",
                    "parent_id": "t1_h3akd21",
                    "score": 2,
                    "created_utc": 1624896170.0,
                    "replies": []
                },
                {
                    "body": "I think it doesn't matter how it works, as long as it works. The only straight edges on a jigsaw puzzle are the frame ones.",
                    "author": "AnSteall",
                    "id": "h3awg48",
                    "parent_id": "t1_h3akd21",
                    "score": 0,
                    "created_utc": 1624871194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Stick around + you’ll find that I’m full of surprises. 🙃",
            "author": "curly_spice",
            "id": "h3a2px4",
            "parent_id": "t1_h3a20s8",
            "score": 4,
            "created_utc": 1624848029.0,
            "replies": []
        },
        {
            "body": "When she was your SB were you giving her a ppm or allowance?",
            "author": null,
            "id": "h3fwi9j",
            "parent_id": "t1_h3a81y9",
            "score": 3,
            "created_utc": 1624976195.0,
            "replies": [
                {
                    "body": "PPM and quickly switched to an allowance.",
                    "author": "worst_sugar_daddy",
                    "id": "h3gug8j",
                    "parent_id": "t1_h3fwi9j",
                    "score": 3,
                    "created_utc": 1624990949.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sorry, I am just jaded by the sugar bowl. If it works for both of you, then happy for you guys. Treat her well.",
            "author": "whyiamthewaythatiam",
            "id": "h3a9vig",
            "parent_id": "t1_h3a81y9",
            "score": 12,
            "created_utc": 1624852381.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h3c7eyl",
                    "parent_id": "t1_h3a9vig",
                    "score": -1,
                    "created_utc": 1624899270.0,
                    "replies": [
                        {
                            "body": "Oh well, fuck you too I guess. I just wish the best for the SB turned wife in this case. My trauma does not make me less deserving to be in any kind of relationship, SR or otherwise. But that’s not relevant here.",
                            "author": "whyiamthewaythatiam",
                            "id": "h3dh12x",
                            "parent_id": "t1_h3c7eyl",
                            "score": 12,
                            "created_utc": 1624919177.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, you're more concerned because you don't have kids apparently. Had he chosen the SB the daughter would have felt abandoned. Your children should always be a priority over everyone, otherwise you're a shit person. I'd never be with a man that treats his kids like shit cause he'd most likely treat his partner just as bad.",
            "author": "LumbeeLady",
            "id": "h3c0b4a",
            "parent_id": "t1_h3akd21",
            "score": 2,
            "created_utc": 1624896170.0,
            "replies": []
        },
        {
            "body": "I think it doesn't matter how it works, as long as it works. The only straight edges on a jigsaw puzzle are the frame ones.",
            "author": "AnSteall",
            "id": "h3awg48",
            "parent_id": "t1_h3akd21",
            "score": 0,
            "created_utc": 1624871194.0,
            "replies": []
        },
        {
            "body": "PPM and quickly switched to an allowance.",
            "author": "worst_sugar_daddy",
            "id": "h3gug8j",
            "parent_id": "t1_h3fwi9j",
            "score": 3,
            "created_utc": 1624990949.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3c7eyl",
            "parent_id": "t1_h3a9vig",
            "score": -1,
            "created_utc": 1624899270.0,
            "replies": [
                {
                    "body": "Oh well, fuck you too I guess. I just wish the best for the SB turned wife in this case. My trauma does not make me less deserving to be in any kind of relationship, SR or otherwise. But that’s not relevant here.",
                    "author": "whyiamthewaythatiam",
                    "id": "h3dh12x",
                    "parent_id": "t1_h3c7eyl",
                    "score": 12,
                    "created_utc": 1624919177.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh well, fuck you too I guess. I just wish the best for the SB turned wife in this case. My trauma does not make me less deserving to be in any kind of relationship, SR or otherwise. But that’s not relevant here.",
            "author": "whyiamthewaythatiam",
            "id": "h3dh12x",
            "parent_id": "t1_h3c7eyl",
            "score": 12,
            "created_utc": 1624919177.0,
            "replies": []
        }
    ]
}