{
    "title": "Three weeks in the bowl and I'm done",
    "post_id": "nbppap",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nbppap/three_weeks_in_the_bowl_and_im_done/",
    "author": "functional_lake",
    "body": "I went on a lunch date today with a very nice POT I had been talking to for a few days. He genuinely seemed nice and caring over text and we spent hours talking, absolutely hit it off. \n\nAfter the date ended and we went our separate ways, I went shopping for work clothes that I desperately need. I pick some out and head to the changerooms to try them on and when I'm halfway undressed he opens the curtain and comes into the changeroom with me. He pushed himself onto me and kissed me, felt me, the whole nine. I was completely taken aback cause he would have had to be following me for 20 or so minutes. At that point I had only ever kissed one guy and just felt so disgusted and unsafe. Tonight I deleted my SA account and am not looking back. I know there are nice guys but I can't deal with the bad ones in order to get to them.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nbppap/three_weeks_in_the_bowl_and_im_done/",
    "score": 152,
    "upvote_ratio": 0.95,
    "created_utc": 1620935544.0,
    "num_comments": 87,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I would have yelled and had the store call the cops on him. Straight up assault.",
            "author": "Cledaddy23",
            "id": "gy0nwmb",
            "parent_id": "t3_nbppap",
            "score": 106,
            "created_utc": 1620936002.0,
            "replies": [
                {
                    "body": "I guess I didn't really know I could do that...",
                    "author": "functional_lake",
                    "id": "gy0oir9",
                    "parent_id": "t1_gy0nwmb",
                    "score": 35,
                    "created_utc": 1620936251.0,
                    "replies": [
                        {
                            "body": "You still can and should.\n\nHe is a predator. He has done this before to other women and he will do it again as soon as he has the opportunity. And next time it may be worse.\n\nThis fucker needs to have the shit scared out of him when the cops knock on his door.",
                            "author": "ExpertPerformance",
                            "id": "gy0rr82",
                            "parent_id": "t1_gy0oir9",
                            "score": 85,
                            "created_utc": 1620937577.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gy0p6bk",
                            "parent_id": "t1_gy0oir9",
                            "score": 44,
                            "created_utc": 1620936514.0,
                            "replies": [
                                {
                                    "body": "And the legal system is NOT geared to protect sexual assault survivors at all so even if you do report don't expect safety and comfort (which is why it needs to be upended!)",
                                    "author": "mischiefmolly",
                                    "id": "gy2awgx",
                                    "parent_id": "t1_gy0p6bk",
                                    "score": 18,
                                    "created_utc": 1620966261.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "don’t blame yourself. in high stress moments, we can react with throwing logic and reasoning out the window. I’ve been in many scary interactions with men where I later thought “damn, I should have done this or that.” but don’t even stress. you can’t go back in time, just remember it for the future. it is not embarrassing for you in the slightest to attract attention, it’s embarrassing for the perpetrator, who will most likely run and book it like hell. \n\ni’m so sorry you had this experience. keep your head up, you’re worthy of so much more.",
                            "author": "xjulesx21",
                            "id": "gy2bhl5",
                            "parent_id": "t1_gy0oir9",
                            "score": 10,
                            "created_utc": 1620966644.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This scum needs to be taught a lesson... OP please report the incident!",
                    "author": null,
                    "id": "gy7tu2o",
                    "parent_id": "t1_gy0nwmb",
                    "score": 1,
                    "created_utc": 1621088516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He stalked you and then assaulted you. That’s not cool. It’s not your fault. You didn’t deserve it. I’m sorry it happened.",
            "author": "whatwouldjunedo",
            "id": "gy0t8q5",
            "parent_id": "t3_nbppap",
            "score": 66,
            "created_utc": 1620938204.0,
            "replies": []
        },
        {
            "body": "I'm so sorry this happened to you, and while NOBODY should ever expect sexual assault, I have to disagree that this is an anomaly. In the eyes of the law, sugar babies are just a breath away from sex workers and that makes us vulnerable as any sex worker is, and some men prey on us knowing we can't easily go to cops about this. There used to be (and prolly still are somewhere) whole forums of men figuring out how to scam sugar babies out of free sex and at worst, there were even men sharing stories of straight up raping sugar babies. Sex workers are vulnerable to sexual assault and if you can get ahead in life another way, it really seems like that might be best for you.  \n\n\nIt's a huge problem that social media seems to advertise the glamour of sex workers and sugaring while hiding all the very real dangers we face. The truth is many women in this lifestyle have faced sexual assault and many won't talk about it in order to not drive away potential clientele who are made uncomfortable by facing that type of situation. I know for sure I NEVER speak about sexual assault I've faced with any men because it is a way to lose myself money, and because they can't do anything about what I've faced anyway. SW who are online are ALWAYS marketing, you have to remember that, so they will never ever mention the negatives of any of it and many don't realize that this lifestyle and everything adjacent to it is highly dangerous. I hope you're ok, and I absolutely do not blame you for what happened, but I really think you deserve to know the reality that lies behind this lifestyle and really evaluate if it's for you.",
            "author": "ColdHeaux",
            "id": "gy2396e",
            "parent_id": "t3_nbppap",
            "score": 38,
            "created_utc": 1620961620.0,
            "replies": [
                {
                    "body": "100% yes. Not an anomaly. Sadly, a reality. Sugaring is not at all what it seems. Well written comment!",
                    "author": "princesspoppy77",
                    "id": "gy24s45",
                    "parent_id": "t1_gy2396e",
                    "score": 10,
                    "created_utc": 1620962510.0,
                    "replies": []
                },
                {
                    "body": "\\^\\^\\^\\^\\^ truth",
                    "author": "mischiefmolly",
                    "id": "gy2ayno",
                    "parent_id": "t1_gy2396e",
                    "score": 4,
                    "created_utc": 1620966300.0,
                    "replies": []
                },
                {
                    "body": "But in this case they had parted ways and the date was over, and he followed her without her knowledge. It’s not like she got attacked on the date. Why does it matter how she met him in that context? He could have easily been a complete stranger since they didn’t go there together",
                    "author": null,
                    "id": "gy24tum",
                    "parent_id": "t1_gy2396e",
                    "score": -3,
                    "created_utc": 1620962537.0,
                    "replies": [
                        {
                            "body": "Because he chose his victim from SA for a reason. That reason is explained by coldheaux above. \n\nSA is sex work or sex work adjacent so many SBs face barriers to going to the police. Many SBs are young and some are naive. Predatory men will prey on this and choose their victim with this in mind. \n\n&#x200B;\n\nAlso this is less relevant but your comment is rubbing me the wrong way. 20 minutes post-date isn't \"random\" - it's targeted as fuck. I'd recommend you practice a bit more empathy because you sound like you're denying coldheaux and the OPs experience.",
                            "author": "Sanbitch",
                            "id": "gy29yne",
                            "parent_id": "t1_gy24tum",
                            "score": 11,
                            "created_utc": 1620965660.0,
                            "replies": [
                                {
                                    "body": "What? I think you’re misunderstanding what I wrote or something. I don’t even know how you got what you said from what I wrote. I was trying to say that in this case the stigma that can be faced from police doesn’t need to apply because the police doesn’t have to know she met him before the attack in the fitting room. It’s not relevant to the police case. I’m not invalidating anything I was trying to be helpful, because I 100% agree you can’t report an attack while on a sugar date. I was trying to say I think this case may be a different type of situation where the police doesn’t even have to know there was a sugar component to the attack since it didn’t happen on the date. I hope that cleared up what I meant.",
                                    "author": null,
                                    "id": "gy2d7f0",
                                    "parent_id": "t1_gy29yne",
                                    "score": -2,
                                    "created_utc": 1620967791.0,
                                    "replies": [
                                        {
                                            "body": "Oh sorry I misinterpreted your comment and because of some comments in this thread my guard was up about defending the OP. \n\n&#x200B;\n\nSadly, during the investigation the police would almost certainly find out how they met - not that it should make a difference though. OP did NOTHING wrong or illegal. She literally met up with a guy from a dating site for a drink, regardless of the plan to get money from him down the road nothing was exchanged. If OP wants to report this she shouldn't be afraid to.  (Source: i've been the complainant in a police investigation).",
                                            "author": "Sanbitch",
                                            "id": "gy2f7ka",
                                            "parent_id": "t1_gy2d7f0",
                                            "score": 7,
                                            "created_utc": 1620969231.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> \n\nGod I hope you are wrong.\n\nI can’t imagine there is Implied Consent 100% of the time simply by virtue of there having been a sugar date. That would mean that SD’s literally have carte blanche to rape any SB on a date.",
                                            "author": "ExpertPerformance",
                                            "id": "gy3bzoo",
                                            "parent_id": "t1_gy2d7f0",
                                            "score": 2,
                                            "created_utc": 1620995509.0,
                                            "replies": [
                                                {
                                                    "body": "It’s not that there’s implied consent. It’s that a lot of people, including police, would consider sugaring a type of sex work. So that complicates being able to report a crime if something does happen or having it taken seriously if you do report it. And some men do use that to take advantage of women.",
                                                    "author": "fakemoose",
                                                    "id": "gy45q4a",
                                                    "parent_id": "t1_gy3bzoo",
                                                    "score": 3,
                                                    "created_utc": 1621009071.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Like fakemoose said- its not implied consent its vulnerability. I'm from Canada, so I'm not sure about the USA but here there is no such thing as implied consent. There is nonverbal consent though. \n\n&#x200B;\n\nReporting any crime can be traumatizing. Reporting sexual assault is even worse. Throw in sex work (or at least sex work adjacent) being what led the perp to you and the complainant will basically be the one on trial. Not as in she will be put in jail - that is a thing of the past in most places. Rather the victim will have their entire sexual history exposed, Crown and police will be skeptical to even start prosecuting/investigating the guy, going through court will mean exposing so much personal information and shame, and sometimes nothing comes of it. It is an incredibly dangerous world, especially for women.",
                                                    "author": "Sanbitch",
                                                    "id": "gy4dliw",
                                                    "parent_id": "t1_gy3bzoo",
                                                    "score": 2,
                                                    "created_utc": 1621012423.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I'm saying that's why he targeted her, not that there is implied consent. Dangerous men go after vulnerable women, so some of them choose to go after sugar babies, esp newbies.",
                                                    "author": "ColdHeaux",
                                                    "id": "gy5esap",
                                                    "parent_id": "t1_gy3bzoo",
                                                    "score": 2,
                                                    "created_utc": 1621029050.0,
                                                    "replies": [
                                                        {
                                                            "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
                                                            "author": "ExpertPerformance",
                                                            "id": "gy5fiqz",
                                                            "parent_id": "t1_gy5esap",
                                                            "score": 1,
                                                            "created_utc": 1621029395.0,
                                                            "replies": [
                                                                {
                                                                    "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gy5his3",
                                                                    "parent_id": "t1_gy5fiqz",
                                                                    "score": 2,
                                                                    "created_utc": 1621030351.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                                                                            "author": "ExpertPerformance",
                                                                            "id": "gy5ivy4",
                                                                            "parent_id": "t1_gy5his3",
                                                                            "score": 2,
                                                                            "created_utc": 1621031024.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                                                                    "author": "Sanbitch",
                                                                                    "id": "gy5m04p",
                                                                                    "parent_id": "t1_gy5ivy4",
                                                                                    "score": 1,
                                                                                    "created_utc": 1621032604.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                                                                            "author": "ColdHeaux",
                                                                                            "id": "gy5s3lh",
                                                                                            "parent_id": "t1_gy5m04p",
                                                                                            "score": 2,
                                                                                            "created_utc": 1621035796.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "Copy that",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gy5s0ae",
                                                                                    "parent_id": "t1_gy5ivy4",
                                                                                    "score": 1,
                                                                                    "created_utc": 1621035747.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gy5s5mr",
                                                                                    "parent_id": "t1_gy5ivy4",
                                                                                    "score": 1,
                                                                                    "created_utc": 1621035827.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I'm saying that's why he targeted her- SWers are vulnerable and that doesn't end just because the date ended. Also the info I gave was still important to be said to someone who is first starting off.",
                                            "author": "ColdHeaux",
                                            "id": "gy5eoqd",
                                            "parent_id": "t1_gy2d7f0",
                                            "score": 2,
                                            "created_utc": 1621029003.0,
                                            "replies": [
                                                {
                                                    "body": "> Also the info I gave was still important to be said to someone who is first starting off.\n\nAMEN!",
                                                    "author": "Sanbitch",
                                                    "id": "gy5m1sx",
                                                    "parent_id": "t1_gy5eoqd",
                                                    "score": 2,
                                                    "created_utc": 1621032628.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Because it’s going to matter. It shouldn’t but it will. The second either of them mention how/why they met in the first place, she’s going to be seen as a sex worker and the whole thing could end up either ignored or a legal mess. And it’s not like she could lie and say they didn’t know each other at all, to try and frame it as “random”. It’s going to come out that it was a target attack and that they *had* met shortly before. If she claims otherwise and he has proof they had met up, it’s going to look even worse for OP.\nThat’s why so many men use SA to prey on young women.",
                            "author": "fakemoose",
                            "id": "gy45269",
                            "parent_id": "t1_gy24tum",
                            "score": 3,
                            "created_utc": 1621008786.0,
                            "replies": []
                        },
                        {
                            "body": "Even if she could potentially go after legal recourse in this case (maybe) that doesn't change that being a sugar baby is WHY he targeted her.",
                            "author": "ColdHeaux",
                            "id": "gy5evso",
                            "parent_id": "t1_gy24tum",
                            "score": 1,
                            "created_utc": 1621029095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s absolutely terrifying and I’m so sorry that happened to you. I feel like SD’s (or clear predators) forget that women fear for their safety CONSTANTLY let alone entering into the bowl where it’s even more dangerous. Everything you’re feeling is completely valid. He’s disgusting. He stalked you and sexually assaulted you. That is fucked.",
            "author": "shadowphoenix121",
            "id": "gy0opnp",
            "parent_id": "t3_nbppap",
            "score": 21,
            "created_utc": 1620936326.0,
            "replies": []
        },
        {
            "body": "Sometimes I fantasize about keeping a grenade on me at all times so I can take out terrorists or people like you just described.",
            "author": "TY2022",
            "id": "gy0pvgk",
            "parent_id": "t3_nbppap",
            "score": 16,
            "created_utc": 1620936807.0,
            "replies": [
                {
                    "body": "Wouldn't you take yourself out too??",
                    "author": "UseRound7488",
                    "id": "gy0ug3k",
                    "parent_id": "t1_gy0pvgk",
                    "score": 2,
                    "created_utc": 1620938719.0,
                    "replies": [
                        {
                            "body": "two birds one grenade",
                            "author": "Illustrious-Worry890",
                            "id": "gy0vpbe",
                            "parent_id": "t1_gy0ug3k",
                            "score": 10,
                            "created_utc": 1620939267.0,
                            "replies": []
                        },
                        {
                            "body": "not if you shove it up his ass, and quickly walk away in the ~5 secs you have after you release the spoon. 😂",
                            "author": "joc13",
                            "id": "gy13kjv",
                            "parent_id": "t1_gy0ug3k",
                            "score": 7,
                            "created_utc": 1620943008.0,
                            "replies": []
                        },
                        {
                            "body": "Of course, but for me it would be worth it.",
                            "author": "TY2022",
                            "id": "gy11bht",
                            "parent_id": "t1_gy0ug3k",
                            "score": 4,
                            "created_utc": 1620941918.0,
                            "replies": [
                                {
                                    "body": "sending love",
                                    "author": "mischiefmolly",
                                    "id": "gy2b10f",
                                    "parent_id": "t1_gy11bht",
                                    "score": 3,
                                    "created_utc": 1620966343.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s so sick. At that moment I would’ve knocked the soul right out of him because he has no right to do that.",
            "author": null,
            "id": "gy13hxu",
            "parent_id": "t3_nbppap",
            "score": 8,
            "created_utc": 1620942972.0,
            "replies": []
        },
        {
            "body": "Just writing to say - GIRL I HEAR YOU! I loved meeting up with guys in the bowl (and am still seeing two I met) but had to just realize that the number of creeps/perverts/mysogynistic jerks  WAY outweighed the good guys and just wasn't great for my mental health (I'm in this for pleasure!!!!). I feel lucky to have met the guys I have and also yearn for the nice guys I know are still out there but, for me, it's not worth wading through the abuse to meet them. Sad, but so so true.",
            "author": "mischiefmolly",
            "id": "gy2aqa7",
            "parent_id": "t3_nbppap",
            "score": 6,
            "created_utc": 1620966150.0,
            "replies": []
        },
        {
            "body": "I am so sorry you had to go through that. He is a predator and completely violated you, social norms, and the law. \n\nIf you're in school (or can afford a private one) you should talk to a counsellor because those kinds of incidents really take a toll on a person. Journal, find a support group, tell someone you know IRL or an online friend - do something to help process this experience. \n\nIf you're willing to go to the cops that is an option. However, you don't need to. Rehashing that experience (and the surrounding SA stuff) can be mentally exhausting and you don't owe it to anyone to pursue that avenue... but it is there for you if you want it. \n\nYou're not alone and your feelings of disgust and fear for your safety are totally justified. This guy is a pig.",
            "author": "Sanbitch",
            "id": "gy29732",
            "parent_id": "t3_nbppap",
            "score": 3,
            "created_utc": 1620965179.0,
            "replies": []
        },
        {
            "body": "This is a pure anomaly and I’m sorry to hear this happened to you. What a weirdo and this doesn’t describe most of us SD’s.",
            "author": "SDinChi",
            "id": "gy0n1jk",
            "parent_id": "t3_nbppap",
            "score": 12,
            "created_utc": 1620935646.0,
            "replies": [
                {
                    "body": "I'm sure it's a one off thing but I drove home feeling absolutely terrified for my safety and disgusted with myself for letting it happen",
                    "author": "functional_lake",
                    "id": "gy0nkte",
                    "parent_id": "t1_gy0n1jk",
                    "score": 4,
                    "created_utc": 1620935866.0,
                    "replies": [
                        {
                            "body": "You didn't let it happen. He did it to you because he is a sick expletive. How were you supposed to know you were being followed? He was sly and hid from you on purpose, it wasn't you inviting him to follow and assault you. I bet it isn't the first time he has done this either. NOT YOUR FAULT.",
                            "author": "This-Organization-11",
                            "id": "gy0pa8s",
                            "parent_id": "t1_gy0nkte",
                            "score": 12,
                            "created_utc": 1620936559.0,
                            "replies": []
                        },
                        {
                            "body": "This isn’t your fault. He could have been a stranger you’ve never met off the street you didn’t invite him there",
                            "author": null,
                            "id": "gy249l5",
                            "parent_id": "t1_gy0nkte",
                            "score": 4,
                            "created_utc": 1620962214.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy0xp33",
            "parent_id": "t3_nbppap",
            "score": 7,
            "created_utc": 1620940147.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gy16295",
                    "parent_id": "t1_gy0xp33",
                    "score": 3,
                    "created_utc": 1620944254.0,
                    "replies": []
                },
                {
                    "body": "It was not possible to find one with good chemistry ? \n\nHow many people did you actually meet ? \n\nWe read about a big number of success stories here",
                    "author": "shamloo77",
                    "id": "gy0zvrh",
                    "parent_id": "t1_gy0xp33",
                    "score": -1,
                    "created_utc": 1620941207.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gy12ghi",
                            "parent_id": "t1_gy0zvrh",
                            "score": 9,
                            "created_utc": 1620942470.0,
                            "replies": [
                                {
                                    "body": ">A lot of the men were looking for a cheap prostitute,\n\nwould it have made a difference if they were looking for an expensive prostitute?",
                                    "author": "joc13",
                                    "id": "gy13vrd",
                                    "parent_id": "t1_gy12ghi",
                                    "score": -5,
                                    "created_utc": 1620943162.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Criminal behavior on his part and you did nothing wrong. I'm so sorry this happened.",
            "author": null,
            "id": "gy32lya",
            "parent_id": "t3_nbppap",
            "score": 3,
            "created_utc": 1620989432.0,
            "replies": []
        },
        {
            "body": "In my 20 years, I've never had anything like that happen, so its a shame one creep ruined your whole experience!  I would have complained to the store that they even let another person in there and that he had assaulted you.",
            "author": "sinvortex",
            "id": "gy0nntd",
            "parent_id": "t3_nbppap",
            "score": 7,
            "created_utc": 1620935901.0,
            "replies": [
                {
                    "body": "I had no idea what to do, I was just scared and grossed out I didn't even think about complaining. There was no one manning the changerooms so i guess he thought it was fine?",
                    "author": "functional_lake",
                    "id": "gy0o5it",
                    "parent_id": "t1_gy0nntd",
                    "score": 3,
                    "created_utc": 1620936101.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gy1bols",
                            "parent_id": "t1_gy0o5it",
                            "score": 10,
                            "created_utc": 1620947051.0,
                            "replies": [
                                {
                                    "body": "People need to tell her in case it happens again.",
                                    "author": null,
                                    "id": "gy24cya",
                                    "parent_id": "t1_gy1bols",
                                    "score": 2,
                                    "created_utc": 1620962269.0,
                                    "replies": [
                                        {
                                            "body": "Nope.\n\nHindsight is 20/20. This post is OP telling us her story and not OP asking us for advice. She is probably VERY competent and will ruminate over these moments. I'm not a professional and I doubt you are. When someone tells you their story don't critique unless you're asked.",
                                            "author": "Sanbitch",
                                            "id": "gy2bu0o",
                                            "parent_id": "t1_gy24cya",
                                            "score": 3,
                                            "created_utc": 1620966873.0,
                                            "replies": [
                                                {
                                                    "body": "I didn’t give her advice but I agreed with the advice other people gave her. She responded to some saying “I didn’t know I could do that” so to me, that sounds like she learned something and will be better equipped to handle this if it ever happens again (hopefully it won’t ever happen again, but this world is full of evil people) if she’s not upset by it not sure why you would be",
                                                    "author": null,
                                                    "id": "gy2curx",
                                                    "parent_id": "t1_gy2bu0o",
                                                    "score": 1,
                                                    "created_utc": 1620967550.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Awful. Awful. Awful.\n\nAnd I hate that I need to make this recommendation because it shouldn’t be incumbent upon you but rather should be the responsibility of the male population to behave properly. But this is not the current reality in our society.\n\n**Please use this as motivation to take a self defense class.** I had my daughters enrolled in these classes as soon as they were early teens. You’ll not only learn techniques for physically engaging an attacker but will also learn how to use your voice to escape these types of situations. It’s empowering and will help you regain a sense of control over your personal space.",
                            "author": "ExpertPerformance",
                            "id": "gy0qx7p",
                            "parent_id": "t1_gy0o5it",
                            "score": 6,
                            "created_utc": 1620937238.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Complain to store ?? Its an instant 911 call",
                    "author": null,
                    "id": "gy1wz72",
                    "parent_id": "t1_gy0nntd",
                    "score": 2,
                    "created_utc": 1620958183.0,
                    "replies": [
                        {
                            "body": "Well the store may have on site security, so I'd go to the first employee I saw - be quicker anyways.",
                            "author": "sinvortex",
                            "id": "gy1yp27",
                            "parent_id": "t1_gy1wz72",
                            "score": 3,
                            "created_utc": 1620959095.0,
                            "replies": [
                                {
                                    "body": "911 instant...it will come down to them anyways.",
                                    "author": null,
                                    "id": "gy1yzcs",
                                    "parent_id": "t1_gy1yp27",
                                    "score": 1,
                                    "created_utc": 1620959251.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You were molested / aka assaulted sexually. That's beyond unacceptable, almost certainly a crime, and *thankfully very rare.*\n\nI am so sorry this happened to you. And sorry that it has driven you from the bowl.\n\nThat vast majority of us *are not like that.*\n\n**All the best to you!**",
            "author": "marker3000",
            "id": "gy0p587",
            "parent_id": "t3_nbppap",
            "score": 4,
            "created_utc": 1620936502.0,
            "replies": []
        },
        {
            "body": "Prosecute that asshole, he’s a criminal.",
            "author": "garret6758",
            "id": "gy1u7z9",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620956724.0,
            "replies": []
        },
        {
            "body": "Um....wow. he masked himself as the nice guy so he can have his way...its a sexual assault. Im speechless",
            "author": null,
            "id": "gy1wnxi",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620958018.0,
            "replies": []
        },
        {
            "body": "I’m so sorry. You don’t deserve this kind of disrespect. These men cannot control themselves and it’s not your fault and it’s so disgusting!!!!! I was flat out r*ped on my first meet n greet. I hate these men who have never heard “no” \n\nREPORT HIM TO SA EVEN IF THEY WONT DO ANYTHING. THEY CARE MORE ABOUT MONEY THAN OUR SAFETY ! \n\nPlease file a police report or at least email SA that you will. I’m so sorry and I hope you have some time to find peace and heal from this horrible experience. What the fk are these men?!?!!!",
            "author": "BeyonceGhibli",
            "id": "gy2rsz0",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620979676.0,
            "replies": []
        },
        {
            "body": "Wtf! I am so sorry you had to go through that.",
            "author": null,
            "id": "gy2ys0p",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620986235.0,
            "replies": []
        },
        {
            "body": "First, you did nothing wrong and it’s not your fault. Second I noticed in your post that you said you’ve only ever kissed one guy. Do you mean ever or just within the context of sugaring?\nIf ever, then you need to rely on places like this to get experience without the crap that can go along with it.  What’s your vanilla dating experience?",
            "author": "puella_venandi",
            "id": "gy0rklc",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620937501.0,
            "replies": []
        },
        {
            "body": "The bowl is definitely not meant for everyone but what happened to you is not okay, you couldn't have done anything different to avoid what he did, and it's okay you feel that your safety was compromised, because it was. \n\nI personally feel that those inexperienced with dating in general should NEVER jump into sugar dating because people can be vile, and you need to know yourself well enough (including your comfort levels and how to say no) to handle things when they don't go your way.",
            "author": "perpetually--tired",
            "id": "gy0txyw",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620938500.0,
            "replies": []
        },
        {
            "body": "What the heck?!!!!!!  ((((((Hugs))))) dude, not cool at all.",
            "author": "dark_starling9",
            "id": "gy1ie3v",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620950508.0,
            "replies": []
        },
        {
            "body": "this is why SA has gone to shit over the past ~2 years or so. all these creepers are scaring away the girl next door types. 2014-2016 was LIT, now its trash",
            "author": "vtec__",
            "id": "gy22hb4",
            "parent_id": "t3_nbppap",
            "score": 2,
            "created_utc": 1620961182.0,
            "replies": []
        },
        {
            "body": "Just because he is known to you as a SD doesn't mean he represents all SD's same as in vanilla world. He sexually assaulted you after following you. That is vile behaviour whatever mantel he chooses to present under. I am really sorry this happened to you and I hope you will speak to someone - other than on here - and if you feel you need to, as being followed and then sexually assaulted is a terrifying experience. It isn't important that you met him in this arena.",
            "author": "This-Organization-11",
            "id": "gy0oxhw",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1620936413.0,
            "replies": []
        },
        {
            "body": "Hmm. How did he know you were going to go shopping at store X? How he get to the store exactly at the time you were there and knew exactly where you were? Those are mystifying given you say you went separate ways.",
            "author": null,
            "id": "gy1j95x",
            "parent_id": "t3_nbppap",
            "score": -1,
            "created_utc": 1620950957.0,
            "replies": [
                {
                    "body": ">Those are mystifying given you say you went separate ways.\n\nThere is one explanation that makes sense: the OP thought she and the \"POT SD\" were going separate ways. Actually they did not go separate ways, because HE FOLLOWED AND STALKED HER, UNKNOWN TO HER, until he followed her into the store and walked into the changing room. He was able to follow her all the way to the changing room in the store, without her knowing it was happening,  BECAUSE HE'S GOOD AT IT BECAUSE HE'S HAD A LOT OF PRACTICE.",
                    "author": "highfructoseSD",
                    "id": "gy1usrn",
                    "parent_id": "t1_gy1j95x",
                    "score": 17,
                    "created_utc": 1620957030.0,
                    "replies": []
                },
                {
                    "body": "Obviously he doubled back and followed her and she never noticed",
                    "author": null,
                    "id": "gy24krf",
                    "parent_id": "t1_gy1j95x",
                    "score": 11,
                    "created_utc": 1620962394.0,
                    "replies": [
                        {
                            "body": "Yes she never noticed ! I just feel too many things have to go right for this to happen.",
                            "author": null,
                            "id": "gy279nk",
                            "parent_id": "t1_gy24krf",
                            "score": -6,
                            "created_utc": 1620963990.0,
                            "replies": [
                                {
                                    "body": "Do you never watch the news? Or even movies? People following other people is very common. That’s the definition of a stalker. Lots of serial killers do this too and their targets never know. Police also do this for investigation. Most people don’t pay attention to their surroundings anyway and if there’s a ton of people in the street why would you think to look behind you or expect he would be in the crowd after you said goodbye already?",
                                    "author": null,
                                    "id": "gy27k4m",
                                    "parent_id": "t1_gy279nk",
                                    "score": 10,
                                    "created_utc": 1620964169.0,
                                    "replies": []
                                },
                                {
                                    "body": "Lapphon-  gaslighting isn'ta  cute look",
                                    "author": "mischiefmolly",
                                    "id": "gy2b5gg",
                                    "parent_id": "t1_gy279nk",
                                    "score": 6,
                                    "created_utc": 1620966425.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don't know how he knew or why he was there, I never mentioned going shopping",
                    "author": "functional_lake",
                    "id": "gy1orzp",
                    "parent_id": "t1_gy1j95x",
                    "score": 3,
                    "created_utc": 1620953845.0,
                    "replies": [
                        {
                            "body": "Have ladies ever met a pot with a friend watching over..if that makes sense..security. u didn't expect this. .most gals dont..so he obv followed you. What state was this in.",
                            "author": null,
                            "id": "gy1wwb3",
                            "parent_id": "t1_gy1orzp",
                            "score": 2,
                            "created_utc": 1620958142.0,
                            "replies": []
                        },
                        {
                            "body": "Did he give you a gift card for a specific store at the M&G? Maybe that’s what led him to know where you’d be going next.",
                            "author": null,
                            "id": "gy27rg6",
                            "parent_id": "t1_gy1orzp",
                            "score": 0,
                            "created_utc": 1620964290.0,
                            "replies": [
                                {
                                    "body": "No, there was no mention of anything money related either",
                                    "author": "functional_lake",
                                    "id": "gy28632",
                                    "parent_id": "t1_gy27rg6",
                                    "score": 3,
                                    "created_utc": 1620964541.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy0v68a",
            "parent_id": "t3_nbppap",
            "score": -2,
            "created_utc": 1620939035.0,
            "replies": [
                {
                    "body": "We hugged when we said goodbye but that was it, didn't hold hands or anything at lunch. I didn't think I was hinting at anything, intentional or otherwise.",
                    "author": "functional_lake",
                    "id": "gy14aw5",
                    "parent_id": "t1_gy0v68a",
                    "score": 3,
                    "created_utc": 1620943371.0,
                    "replies": [
                        {
                            "body": "Yeah that's insane and not at all your fault. You should report him he's a predator.  I'm so blown away from this.",
                            "author": "UseRound7488",
                            "id": "gy17yez",
                            "parent_id": "t1_gy14aw5",
                            "score": 2,
                            "created_utc": 1620945184.0,
                            "replies": []
                        },
                        {
                            "body": "People disguise themselves as one thing when they are another...doesn't mean all do that",
                            "author": null,
                            "id": "gy1x4jb",
                            "parent_id": "t1_gy14aw5",
                            "score": 2,
                            "created_utc": 1620958263.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Whaaaat!!! That is so messed up, definitely one of my fears. I’m really sorry that happened to you, stay safe❤️",
            "author": "LovingAlwaysbaby",
            "id": "gy1y7rl",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1620958842.0,
            "replies": []
        },
        {
            "body": "Wow, what the fuck. That's insane behavior.",
            "author": "indyguy46202",
            "id": "gy2pp3l",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1620977768.0,
            "replies": []
        },
        {
            "body": "I’m so sorry, some people are horrible. I’m sorry that this happened to you and I hope you heal.",
            "author": "MemoryIndividual",
            "id": "gy2qy9i",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1620978902.0,
            "replies": []
        },
        {
            "body": "That is vile and very unusual for a SD.\n\nJust let me know it was totally unacceptable and you will not be seeing him again",
            "author": "Zealousideal_Map8100",
            "id": "gy35xpx",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1620991819.0,
            "replies": [
                {
                    "body": ">That is vile and very unusual for a SD.\n\nSounds more like some sex offender than an SD.",
                    "author": "non_giant_panda",
                    "id": "gy4kznz",
                    "parent_id": "t1_gy35xpx",
                    "score": 1,
                    "created_utc": 1621015619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wow thats so sad to hear. hope you are ok, some people are just so messed up.  Yeah best to do what you need to stay safe and healthy",
            "author": "hharrys",
            "id": "gy3cyys",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1620996052.0,
            "replies": []
        },
        {
            "body": "Yikes",
            "author": "Finzi",
            "id": "gy3qr9c",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1621002675.0,
            "replies": []
        },
        {
            "body": "I'm sorry that happened to you. That is definitely not OK and not typical behavior. You should have kneed him in the nuts and called the authorities.",
            "author": "non_giant_panda",
            "id": "gy4l3yl",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1621015672.0,
            "replies": []
        },
        {
            "body": "Drop and block him. Report if you decide to, but don't quit over this bad actor. Also be more self aware of your surroundings, stalkers, etc. There is the chance he randomly spotted you, maybe you mentioned you'd be shopping after.... Another reason to uber away from a visit. I hate that precautions need to be taken, but yeah, a few creeps ruin it for everyone.",
            "author": "OldEnoughToKnowButtr",
            "id": "gyblawc",
            "parent_id": "t3_nbppap",
            "score": 1,
            "created_utc": 1621171196.0,
            "replies": []
        },
        {
            "body": "I guess I didn't really know I could do that...",
            "author": "functional_lake",
            "id": "gy0oir9",
            "parent_id": "t1_gy0nwmb",
            "score": 35,
            "created_utc": 1620936251.0,
            "replies": [
                {
                    "body": "You still can and should.\n\nHe is a predator. He has done this before to other women and he will do it again as soon as he has the opportunity. And next time it may be worse.\n\nThis fucker needs to have the shit scared out of him when the cops knock on his door.",
                    "author": "ExpertPerformance",
                    "id": "gy0rr82",
                    "parent_id": "t1_gy0oir9",
                    "score": 85,
                    "created_utc": 1620937577.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gy0p6bk",
                    "parent_id": "t1_gy0oir9",
                    "score": 44,
                    "created_utc": 1620936514.0,
                    "replies": [
                        {
                            "body": "And the legal system is NOT geared to protect sexual assault survivors at all so even if you do report don't expect safety and comfort (which is why it needs to be upended!)",
                            "author": "mischiefmolly",
                            "id": "gy2awgx",
                            "parent_id": "t1_gy0p6bk",
                            "score": 18,
                            "created_utc": 1620966261.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "don’t blame yourself. in high stress moments, we can react with throwing logic and reasoning out the window. I’ve been in many scary interactions with men where I later thought “damn, I should have done this or that.” but don’t even stress. you can’t go back in time, just remember it for the future. it is not embarrassing for you in the slightest to attract attention, it’s embarrassing for the perpetrator, who will most likely run and book it like hell. \n\ni’m so sorry you had this experience. keep your head up, you’re worthy of so much more.",
                    "author": "xjulesx21",
                    "id": "gy2bhl5",
                    "parent_id": "t1_gy0oir9",
                    "score": 10,
                    "created_utc": 1620966644.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This scum needs to be taught a lesson... OP please report the incident!",
            "author": null,
            "id": "gy7tu2o",
            "parent_id": "t1_gy0nwmb",
            "score": 1,
            "created_utc": 1621088516.0,
            "replies": []
        },
        {
            "body": "100% yes. Not an anomaly. Sadly, a reality. Sugaring is not at all what it seems. Well written comment!",
            "author": "princesspoppy77",
            "id": "gy24s45",
            "parent_id": "t1_gy2396e",
            "score": 10,
            "created_utc": 1620962510.0,
            "replies": []
        },
        {
            "body": "\\^\\^\\^\\^\\^ truth",
            "author": "mischiefmolly",
            "id": "gy2ayno",
            "parent_id": "t1_gy2396e",
            "score": 4,
            "created_utc": 1620966300.0,
            "replies": []
        },
        {
            "body": "But in this case they had parted ways and the date was over, and he followed her without her knowledge. It’s not like she got attacked on the date. Why does it matter how she met him in that context? He could have easily been a complete stranger since they didn’t go there together",
            "author": null,
            "id": "gy24tum",
            "parent_id": "t1_gy2396e",
            "score": -3,
            "created_utc": 1620962537.0,
            "replies": [
                {
                    "body": "Because he chose his victim from SA for a reason. That reason is explained by coldheaux above. \n\nSA is sex work or sex work adjacent so many SBs face barriers to going to the police. Many SBs are young and some are naive. Predatory men will prey on this and choose their victim with this in mind. \n\n&#x200B;\n\nAlso this is less relevant but your comment is rubbing me the wrong way. 20 minutes post-date isn't \"random\" - it's targeted as fuck. I'd recommend you practice a bit more empathy because you sound like you're denying coldheaux and the OPs experience.",
                    "author": "Sanbitch",
                    "id": "gy29yne",
                    "parent_id": "t1_gy24tum",
                    "score": 11,
                    "created_utc": 1620965660.0,
                    "replies": [
                        {
                            "body": "What? I think you’re misunderstanding what I wrote or something. I don’t even know how you got what you said from what I wrote. I was trying to say that in this case the stigma that can be faced from police doesn’t need to apply because the police doesn’t have to know she met him before the attack in the fitting room. It’s not relevant to the police case. I’m not invalidating anything I was trying to be helpful, because I 100% agree you can’t report an attack while on a sugar date. I was trying to say I think this case may be a different type of situation where the police doesn’t even have to know there was a sugar component to the attack since it didn’t happen on the date. I hope that cleared up what I meant.",
                            "author": null,
                            "id": "gy2d7f0",
                            "parent_id": "t1_gy29yne",
                            "score": -2,
                            "created_utc": 1620967791.0,
                            "replies": [
                                {
                                    "body": "Oh sorry I misinterpreted your comment and because of some comments in this thread my guard was up about defending the OP. \n\n&#x200B;\n\nSadly, during the investigation the police would almost certainly find out how they met - not that it should make a difference though. OP did NOTHING wrong or illegal. She literally met up with a guy from a dating site for a drink, regardless of the plan to get money from him down the road nothing was exchanged. If OP wants to report this she shouldn't be afraid to.  (Source: i've been the complainant in a police investigation).",
                                    "author": "Sanbitch",
                                    "id": "gy2f7ka",
                                    "parent_id": "t1_gy2d7f0",
                                    "score": 7,
                                    "created_utc": 1620969231.0,
                                    "replies": []
                                },
                                {
                                    "body": "> \n\nGod I hope you are wrong.\n\nI can’t imagine there is Implied Consent 100% of the time simply by virtue of there having been a sugar date. That would mean that SD’s literally have carte blanche to rape any SB on a date.",
                                    "author": "ExpertPerformance",
                                    "id": "gy3bzoo",
                                    "parent_id": "t1_gy2d7f0",
                                    "score": 2,
                                    "created_utc": 1620995509.0,
                                    "replies": [
                                        {
                                            "body": "It’s not that there’s implied consent. It’s that a lot of people, including police, would consider sugaring a type of sex work. So that complicates being able to report a crime if something does happen or having it taken seriously if you do report it. And some men do use that to take advantage of women.",
                                            "author": "fakemoose",
                                            "id": "gy45q4a",
                                            "parent_id": "t1_gy3bzoo",
                                            "score": 3,
                                            "created_utc": 1621009071.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Like fakemoose said- its not implied consent its vulnerability. I'm from Canada, so I'm not sure about the USA but here there is no such thing as implied consent. There is nonverbal consent though. \n\n&#x200B;\n\nReporting any crime can be traumatizing. Reporting sexual assault is even worse. Throw in sex work (or at least sex work adjacent) being what led the perp to you and the complainant will basically be the one on trial. Not as in she will be put in jail - that is a thing of the past in most places. Rather the victim will have their entire sexual history exposed, Crown and police will be skeptical to even start prosecuting/investigating the guy, going through court will mean exposing so much personal information and shame, and sometimes nothing comes of it. It is an incredibly dangerous world, especially for women.",
                                            "author": "Sanbitch",
                                            "id": "gy4dliw",
                                            "parent_id": "t1_gy3bzoo",
                                            "score": 2,
                                            "created_utc": 1621012423.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I'm saying that's why he targeted her, not that there is implied consent. Dangerous men go after vulnerable women, so some of them choose to go after sugar babies, esp newbies.",
                                            "author": "ColdHeaux",
                                            "id": "gy5esap",
                                            "parent_id": "t1_gy3bzoo",
                                            "score": 2,
                                            "created_utc": 1621029050.0,
                                            "replies": [
                                                {
                                                    "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
                                                    "author": "ExpertPerformance",
                                                    "id": "gy5fiqz",
                                                    "parent_id": "t1_gy5esap",
                                                    "score": 1,
                                                    "created_utc": 1621029395.0,
                                                    "replies": [
                                                        {
                                                            "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                                                            "author": "ColdHeaux",
                                                            "id": "gy5his3",
                                                            "parent_id": "t1_gy5fiqz",
                                                            "score": 2,
                                                            "created_utc": 1621030351.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                                                                    "author": "ExpertPerformance",
                                                                    "id": "gy5ivy4",
                                                                    "parent_id": "t1_gy5his3",
                                                                    "score": 2,
                                                                    "created_utc": 1621031024.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                                                            "author": "Sanbitch",
                                                                            "id": "gy5m04p",
                                                                            "parent_id": "t1_gy5ivy4",
                                                                            "score": 1,
                                                                            "created_utc": 1621032604.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                                                                    "author": "ColdHeaux",
                                                                                    "id": "gy5s3lh",
                                                                                    "parent_id": "t1_gy5m04p",
                                                                                    "score": 2,
                                                                                    "created_utc": 1621035796.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Copy that",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gy5s0ae",
                                                                            "parent_id": "t1_gy5ivy4",
                                                                            "score": 1,
                                                                            "created_utc": 1621035747.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gy5s5mr",
                                                                            "parent_id": "t1_gy5ivy4",
                                                                            "score": 1,
                                                                            "created_utc": 1621035827.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm saying that's why he targeted her- SWers are vulnerable and that doesn't end just because the date ended. Also the info I gave was still important to be said to someone who is first starting off.",
                                    "author": "ColdHeaux",
                                    "id": "gy5eoqd",
                                    "parent_id": "t1_gy2d7f0",
                                    "score": 2,
                                    "created_utc": 1621029003.0,
                                    "replies": [
                                        {
                                            "body": "> Also the info I gave was still important to be said to someone who is first starting off.\n\nAMEN!",
                                            "author": "Sanbitch",
                                            "id": "gy5m1sx",
                                            "parent_id": "t1_gy5eoqd",
                                            "score": 2,
                                            "created_utc": 1621032628.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Because it’s going to matter. It shouldn’t but it will. The second either of them mention how/why they met in the first place, she’s going to be seen as a sex worker and the whole thing could end up either ignored or a legal mess. And it’s not like she could lie and say they didn’t know each other at all, to try and frame it as “random”. It’s going to come out that it was a target attack and that they *had* met shortly before. If she claims otherwise and he has proof they had met up, it’s going to look even worse for OP.\nThat’s why so many men use SA to prey on young women.",
                    "author": "fakemoose",
                    "id": "gy45269",
                    "parent_id": "t1_gy24tum",
                    "score": 3,
                    "created_utc": 1621008786.0,
                    "replies": []
                },
                {
                    "body": "Even if she could potentially go after legal recourse in this case (maybe) that doesn't change that being a sugar baby is WHY he targeted her.",
                    "author": "ColdHeaux",
                    "id": "gy5evso",
                    "parent_id": "t1_gy24tum",
                    "score": 1,
                    "created_utc": 1621029095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wouldn't you take yourself out too??",
            "author": "UseRound7488",
            "id": "gy0ug3k",
            "parent_id": "t1_gy0pvgk",
            "score": 2,
            "created_utc": 1620938719.0,
            "replies": [
                {
                    "body": "two birds one grenade",
                    "author": "Illustrious-Worry890",
                    "id": "gy0vpbe",
                    "parent_id": "t1_gy0ug3k",
                    "score": 10,
                    "created_utc": 1620939267.0,
                    "replies": []
                },
                {
                    "body": "not if you shove it up his ass, and quickly walk away in the ~5 secs you have after you release the spoon. 😂",
                    "author": "joc13",
                    "id": "gy13kjv",
                    "parent_id": "t1_gy0ug3k",
                    "score": 7,
                    "created_utc": 1620943008.0,
                    "replies": []
                },
                {
                    "body": "Of course, but for me it would be worth it.",
                    "author": "TY2022",
                    "id": "gy11bht",
                    "parent_id": "t1_gy0ug3k",
                    "score": 4,
                    "created_utc": 1620941918.0,
                    "replies": [
                        {
                            "body": "sending love",
                            "author": "mischiefmolly",
                            "id": "gy2b10f",
                            "parent_id": "t1_gy11bht",
                            "score": 3,
                            "created_utc": 1620966343.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm sure it's a one off thing but I drove home feeling absolutely terrified for my safety and disgusted with myself for letting it happen",
            "author": "functional_lake",
            "id": "gy0nkte",
            "parent_id": "t1_gy0n1jk",
            "score": 4,
            "created_utc": 1620935866.0,
            "replies": [
                {
                    "body": "You didn't let it happen. He did it to you because he is a sick expletive. How were you supposed to know you were being followed? He was sly and hid from you on purpose, it wasn't you inviting him to follow and assault you. I bet it isn't the first time he has done this either. NOT YOUR FAULT.",
                    "author": "This-Organization-11",
                    "id": "gy0pa8s",
                    "parent_id": "t1_gy0nkte",
                    "score": 12,
                    "created_utc": 1620936559.0,
                    "replies": []
                },
                {
                    "body": "This isn’t your fault. He could have been a stranger you’ve never met off the street you didn’t invite him there",
                    "author": null,
                    "id": "gy249l5",
                    "parent_id": "t1_gy0nkte",
                    "score": 4,
                    "created_utc": 1620962214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy16295",
            "parent_id": "t1_gy0xp33",
            "score": 3,
            "created_utc": 1620944254.0,
            "replies": []
        },
        {
            "body": "It was not possible to find one with good chemistry ? \n\nHow many people did you actually meet ? \n\nWe read about a big number of success stories here",
            "author": "shamloo77",
            "id": "gy0zvrh",
            "parent_id": "t1_gy0xp33",
            "score": -1,
            "created_utc": 1620941207.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gy12ghi",
                    "parent_id": "t1_gy0zvrh",
                    "score": 9,
                    "created_utc": 1620942470.0,
                    "replies": [
                        {
                            "body": ">A lot of the men were looking for a cheap prostitute,\n\nwould it have made a difference if they were looking for an expensive prostitute?",
                            "author": "joc13",
                            "id": "gy13vrd",
                            "parent_id": "t1_gy12ghi",
                            "score": -5,
                            "created_utc": 1620943162.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had no idea what to do, I was just scared and grossed out I didn't even think about complaining. There was no one manning the changerooms so i guess he thought it was fine?",
            "author": "functional_lake",
            "id": "gy0o5it",
            "parent_id": "t1_gy0nntd",
            "score": 3,
            "created_utc": 1620936101.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gy1bols",
                    "parent_id": "t1_gy0o5it",
                    "score": 10,
                    "created_utc": 1620947051.0,
                    "replies": [
                        {
                            "body": "People need to tell her in case it happens again.",
                            "author": null,
                            "id": "gy24cya",
                            "parent_id": "t1_gy1bols",
                            "score": 2,
                            "created_utc": 1620962269.0,
                            "replies": [
                                {
                                    "body": "Nope.\n\nHindsight is 20/20. This post is OP telling us her story and not OP asking us for advice. She is probably VERY competent and will ruminate over these moments. I'm not a professional and I doubt you are. When someone tells you their story don't critique unless you're asked.",
                                    "author": "Sanbitch",
                                    "id": "gy2bu0o",
                                    "parent_id": "t1_gy24cya",
                                    "score": 3,
                                    "created_utc": 1620966873.0,
                                    "replies": [
                                        {
                                            "body": "I didn’t give her advice but I agreed with the advice other people gave her. She responded to some saying “I didn’t know I could do that” so to me, that sounds like she learned something and will be better equipped to handle this if it ever happens again (hopefully it won’t ever happen again, but this world is full of evil people) if she’s not upset by it not sure why you would be",
                                            "author": null,
                                            "id": "gy2curx",
                                            "parent_id": "t1_gy2bu0o",
                                            "score": 1,
                                            "created_utc": 1620967550.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Awful. Awful. Awful.\n\nAnd I hate that I need to make this recommendation because it shouldn’t be incumbent upon you but rather should be the responsibility of the male population to behave properly. But this is not the current reality in our society.\n\n**Please use this as motivation to take a self defense class.** I had my daughters enrolled in these classes as soon as they were early teens. You’ll not only learn techniques for physically engaging an attacker but will also learn how to use your voice to escape these types of situations. It’s empowering and will help you regain a sense of control over your personal space.",
                    "author": "ExpertPerformance",
                    "id": "gy0qx7p",
                    "parent_id": "t1_gy0o5it",
                    "score": 6,
                    "created_utc": 1620937238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Complain to store ?? Its an instant 911 call",
            "author": null,
            "id": "gy1wz72",
            "parent_id": "t1_gy0nntd",
            "score": 2,
            "created_utc": 1620958183.0,
            "replies": [
                {
                    "body": "Well the store may have on site security, so I'd go to the first employee I saw - be quicker anyways.",
                    "author": "sinvortex",
                    "id": "gy1yp27",
                    "parent_id": "t1_gy1wz72",
                    "score": 3,
                    "created_utc": 1620959095.0,
                    "replies": [
                        {
                            "body": "911 instant...it will come down to them anyways.",
                            "author": null,
                            "id": "gy1yzcs",
                            "parent_id": "t1_gy1yp27",
                            "score": 1,
                            "created_utc": 1620959251.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Those are mystifying given you say you went separate ways.\n\nThere is one explanation that makes sense: the OP thought she and the \"POT SD\" were going separate ways. Actually they did not go separate ways, because HE FOLLOWED AND STALKED HER, UNKNOWN TO HER, until he followed her into the store and walked into the changing room. He was able to follow her all the way to the changing room in the store, without her knowing it was happening,  BECAUSE HE'S GOOD AT IT BECAUSE HE'S HAD A LOT OF PRACTICE.",
            "author": "highfructoseSD",
            "id": "gy1usrn",
            "parent_id": "t1_gy1j95x",
            "score": 17,
            "created_utc": 1620957030.0,
            "replies": []
        },
        {
            "body": "Obviously he doubled back and followed her and she never noticed",
            "author": null,
            "id": "gy24krf",
            "parent_id": "t1_gy1j95x",
            "score": 11,
            "created_utc": 1620962394.0,
            "replies": [
                {
                    "body": "Yes she never noticed ! I just feel too many things have to go right for this to happen.",
                    "author": null,
                    "id": "gy279nk",
                    "parent_id": "t1_gy24krf",
                    "score": -6,
                    "created_utc": 1620963990.0,
                    "replies": [
                        {
                            "body": "Do you never watch the news? Or even movies? People following other people is very common. That’s the definition of a stalker. Lots of serial killers do this too and their targets never know. Police also do this for investigation. Most people don’t pay attention to their surroundings anyway and if there’s a ton of people in the street why would you think to look behind you or expect he would be in the crowd after you said goodbye already?",
                            "author": null,
                            "id": "gy27k4m",
                            "parent_id": "t1_gy279nk",
                            "score": 10,
                            "created_utc": 1620964169.0,
                            "replies": []
                        },
                        {
                            "body": "Lapphon-  gaslighting isn'ta  cute look",
                            "author": "mischiefmolly",
                            "id": "gy2b5gg",
                            "parent_id": "t1_gy279nk",
                            "score": 6,
                            "created_utc": 1620966425.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know how he knew or why he was there, I never mentioned going shopping",
            "author": "functional_lake",
            "id": "gy1orzp",
            "parent_id": "t1_gy1j95x",
            "score": 3,
            "created_utc": 1620953845.0,
            "replies": [
                {
                    "body": "Have ladies ever met a pot with a friend watching over..if that makes sense..security. u didn't expect this. .most gals dont..so he obv followed you. What state was this in.",
                    "author": null,
                    "id": "gy1wwb3",
                    "parent_id": "t1_gy1orzp",
                    "score": 2,
                    "created_utc": 1620958142.0,
                    "replies": []
                },
                {
                    "body": "Did he give you a gift card for a specific store at the M&G? Maybe that’s what led him to know where you’d be going next.",
                    "author": null,
                    "id": "gy27rg6",
                    "parent_id": "t1_gy1orzp",
                    "score": 0,
                    "created_utc": 1620964290.0,
                    "replies": [
                        {
                            "body": "No, there was no mention of anything money related either",
                            "author": "functional_lake",
                            "id": "gy28632",
                            "parent_id": "t1_gy27rg6",
                            "score": 3,
                            "created_utc": 1620964541.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We hugged when we said goodbye but that was it, didn't hold hands or anything at lunch. I didn't think I was hinting at anything, intentional or otherwise.",
            "author": "functional_lake",
            "id": "gy14aw5",
            "parent_id": "t1_gy0v68a",
            "score": 3,
            "created_utc": 1620943371.0,
            "replies": [
                {
                    "body": "Yeah that's insane and not at all your fault. You should report him he's a predator.  I'm so blown away from this.",
                    "author": "UseRound7488",
                    "id": "gy17yez",
                    "parent_id": "t1_gy14aw5",
                    "score": 2,
                    "created_utc": 1620945184.0,
                    "replies": []
                },
                {
                    "body": "People disguise themselves as one thing when they are another...doesn't mean all do that",
                    "author": null,
                    "id": "gy1x4jb",
                    "parent_id": "t1_gy14aw5",
                    "score": 2,
                    "created_utc": 1620958263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">That is vile and very unusual for a SD.\n\nSounds more like some sex offender than an SD.",
            "author": "non_giant_panda",
            "id": "gy4kznz",
            "parent_id": "t1_gy35xpx",
            "score": 1,
            "created_utc": 1621015619.0,
            "replies": []
        },
        {
            "body": "You still can and should.\n\nHe is a predator. He has done this before to other women and he will do it again as soon as he has the opportunity. And next time it may be worse.\n\nThis fucker needs to have the shit scared out of him when the cops knock on his door.",
            "author": "ExpertPerformance",
            "id": "gy0rr82",
            "parent_id": "t1_gy0oir9",
            "score": 85,
            "created_utc": 1620937577.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy0p6bk",
            "parent_id": "t1_gy0oir9",
            "score": 44,
            "created_utc": 1620936514.0,
            "replies": [
                {
                    "body": "And the legal system is NOT geared to protect sexual assault survivors at all so even if you do report don't expect safety and comfort (which is why it needs to be upended!)",
                    "author": "mischiefmolly",
                    "id": "gy2awgx",
                    "parent_id": "t1_gy0p6bk",
                    "score": 18,
                    "created_utc": 1620966261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "don’t blame yourself. in high stress moments, we can react with throwing logic and reasoning out the window. I’ve been in many scary interactions with men where I later thought “damn, I should have done this or that.” but don’t even stress. you can’t go back in time, just remember it for the future. it is not embarrassing for you in the slightest to attract attention, it’s embarrassing for the perpetrator, who will most likely run and book it like hell. \n\ni’m so sorry you had this experience. keep your head up, you’re worthy of so much more.",
            "author": "xjulesx21",
            "id": "gy2bhl5",
            "parent_id": "t1_gy0oir9",
            "score": 10,
            "created_utc": 1620966644.0,
            "replies": []
        },
        {
            "body": "Because he chose his victim from SA for a reason. That reason is explained by coldheaux above. \n\nSA is sex work or sex work adjacent so many SBs face barriers to going to the police. Many SBs are young and some are naive. Predatory men will prey on this and choose their victim with this in mind. \n\n&#x200B;\n\nAlso this is less relevant but your comment is rubbing me the wrong way. 20 minutes post-date isn't \"random\" - it's targeted as fuck. I'd recommend you practice a bit more empathy because you sound like you're denying coldheaux and the OPs experience.",
            "author": "Sanbitch",
            "id": "gy29yne",
            "parent_id": "t1_gy24tum",
            "score": 11,
            "created_utc": 1620965660.0,
            "replies": [
                {
                    "body": "What? I think you’re misunderstanding what I wrote or something. I don’t even know how you got what you said from what I wrote. I was trying to say that in this case the stigma that can be faced from police doesn’t need to apply because the police doesn’t have to know she met him before the attack in the fitting room. It’s not relevant to the police case. I’m not invalidating anything I was trying to be helpful, because I 100% agree you can’t report an attack while on a sugar date. I was trying to say I think this case may be a different type of situation where the police doesn’t even have to know there was a sugar component to the attack since it didn’t happen on the date. I hope that cleared up what I meant.",
                    "author": null,
                    "id": "gy2d7f0",
                    "parent_id": "t1_gy29yne",
                    "score": -2,
                    "created_utc": 1620967791.0,
                    "replies": [
                        {
                            "body": "Oh sorry I misinterpreted your comment and because of some comments in this thread my guard was up about defending the OP. \n\n&#x200B;\n\nSadly, during the investigation the police would almost certainly find out how they met - not that it should make a difference though. OP did NOTHING wrong or illegal. She literally met up with a guy from a dating site for a drink, regardless of the plan to get money from him down the road nothing was exchanged. If OP wants to report this she shouldn't be afraid to.  (Source: i've been the complainant in a police investigation).",
                            "author": "Sanbitch",
                            "id": "gy2f7ka",
                            "parent_id": "t1_gy2d7f0",
                            "score": 7,
                            "created_utc": 1620969231.0,
                            "replies": []
                        },
                        {
                            "body": "> \n\nGod I hope you are wrong.\n\nI can’t imagine there is Implied Consent 100% of the time simply by virtue of there having been a sugar date. That would mean that SD’s literally have carte blanche to rape any SB on a date.",
                            "author": "ExpertPerformance",
                            "id": "gy3bzoo",
                            "parent_id": "t1_gy2d7f0",
                            "score": 2,
                            "created_utc": 1620995509.0,
                            "replies": [
                                {
                                    "body": "It’s not that there’s implied consent. It’s that a lot of people, including police, would consider sugaring a type of sex work. So that complicates being able to report a crime if something does happen or having it taken seriously if you do report it. And some men do use that to take advantage of women.",
                                    "author": "fakemoose",
                                    "id": "gy45q4a",
                                    "parent_id": "t1_gy3bzoo",
                                    "score": 3,
                                    "created_utc": 1621009071.0,
                                    "replies": []
                                },
                                {
                                    "body": "Like fakemoose said- its not implied consent its vulnerability. I'm from Canada, so I'm not sure about the USA but here there is no such thing as implied consent. There is nonverbal consent though. \n\n&#x200B;\n\nReporting any crime can be traumatizing. Reporting sexual assault is even worse. Throw in sex work (or at least sex work adjacent) being what led the perp to you and the complainant will basically be the one on trial. Not as in she will be put in jail - that is a thing of the past in most places. Rather the victim will have their entire sexual history exposed, Crown and police will be skeptical to even start prosecuting/investigating the guy, going through court will mean exposing so much personal information and shame, and sometimes nothing comes of it. It is an incredibly dangerous world, especially for women.",
                                    "author": "Sanbitch",
                                    "id": "gy4dliw",
                                    "parent_id": "t1_gy3bzoo",
                                    "score": 2,
                                    "created_utc": 1621012423.0,
                                    "replies": []
                                },
                                {
                                    "body": "I'm saying that's why he targeted her, not that there is implied consent. Dangerous men go after vulnerable women, so some of them choose to go after sugar babies, esp newbies.",
                                    "author": "ColdHeaux",
                                    "id": "gy5esap",
                                    "parent_id": "t1_gy3bzoo",
                                    "score": 2,
                                    "created_utc": 1621029050.0,
                                    "replies": [
                                        {
                                            "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
                                            "author": "ExpertPerformance",
                                            "id": "gy5fiqz",
                                            "parent_id": "t1_gy5esap",
                                            "score": 1,
                                            "created_utc": 1621029395.0,
                                            "replies": [
                                                {
                                                    "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                                                    "author": "ColdHeaux",
                                                    "id": "gy5his3",
                                                    "parent_id": "t1_gy5fiqz",
                                                    "score": 2,
                                                    "created_utc": 1621030351.0,
                                                    "replies": [
                                                        {
                                                            "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                                                            "author": "ExpertPerformance",
                                                            "id": "gy5ivy4",
                                                            "parent_id": "t1_gy5his3",
                                                            "score": 2,
                                                            "created_utc": 1621031024.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                                                    "author": "Sanbitch",
                                                                    "id": "gy5m04p",
                                                                    "parent_id": "t1_gy5ivy4",
                                                                    "score": 1,
                                                                    "created_utc": 1621032604.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                                                            "author": "ColdHeaux",
                                                                            "id": "gy5s3lh",
                                                                            "parent_id": "t1_gy5m04p",
                                                                            "score": 2,
                                                                            "created_utc": 1621035796.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Copy that",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gy5s0ae",
                                                                    "parent_id": "t1_gy5ivy4",
                                                                    "score": 1,
                                                                    "created_utc": 1621035747.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gy5s5mr",
                                                                    "parent_id": "t1_gy5ivy4",
                                                                    "score": 1,
                                                                    "created_utc": 1621035827.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm saying that's why he targeted her- SWers are vulnerable and that doesn't end just because the date ended. Also the info I gave was still important to be said to someone who is first starting off.",
                            "author": "ColdHeaux",
                            "id": "gy5eoqd",
                            "parent_id": "t1_gy2d7f0",
                            "score": 2,
                            "created_utc": 1621029003.0,
                            "replies": [
                                {
                                    "body": "> Also the info I gave was still important to be said to someone who is first starting off.\n\nAMEN!",
                                    "author": "Sanbitch",
                                    "id": "gy5m1sx",
                                    "parent_id": "t1_gy5eoqd",
                                    "score": 2,
                                    "created_utc": 1621032628.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because it’s going to matter. It shouldn’t but it will. The second either of them mention how/why they met in the first place, she’s going to be seen as a sex worker and the whole thing could end up either ignored or a legal mess. And it’s not like she could lie and say they didn’t know each other at all, to try and frame it as “random”. It’s going to come out that it was a target attack and that they *had* met shortly before. If she claims otherwise and he has proof they had met up, it’s going to look even worse for OP.\nThat’s why so many men use SA to prey on young women.",
            "author": "fakemoose",
            "id": "gy45269",
            "parent_id": "t1_gy24tum",
            "score": 3,
            "created_utc": 1621008786.0,
            "replies": []
        },
        {
            "body": "Even if she could potentially go after legal recourse in this case (maybe) that doesn't change that being a sugar baby is WHY he targeted her.",
            "author": "ColdHeaux",
            "id": "gy5evso",
            "parent_id": "t1_gy24tum",
            "score": 1,
            "created_utc": 1621029095.0,
            "replies": []
        },
        {
            "body": "two birds one grenade",
            "author": "Illustrious-Worry890",
            "id": "gy0vpbe",
            "parent_id": "t1_gy0ug3k",
            "score": 10,
            "created_utc": 1620939267.0,
            "replies": []
        },
        {
            "body": "not if you shove it up his ass, and quickly walk away in the ~5 secs you have after you release the spoon. 😂",
            "author": "joc13",
            "id": "gy13kjv",
            "parent_id": "t1_gy0ug3k",
            "score": 7,
            "created_utc": 1620943008.0,
            "replies": []
        },
        {
            "body": "Of course, but for me it would be worth it.",
            "author": "TY2022",
            "id": "gy11bht",
            "parent_id": "t1_gy0ug3k",
            "score": 4,
            "created_utc": 1620941918.0,
            "replies": [
                {
                    "body": "sending love",
                    "author": "mischiefmolly",
                    "id": "gy2b10f",
                    "parent_id": "t1_gy11bht",
                    "score": 3,
                    "created_utc": 1620966343.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You didn't let it happen. He did it to you because he is a sick expletive. How were you supposed to know you were being followed? He was sly and hid from you on purpose, it wasn't you inviting him to follow and assault you. I bet it isn't the first time he has done this either. NOT YOUR FAULT.",
            "author": "This-Organization-11",
            "id": "gy0pa8s",
            "parent_id": "t1_gy0nkte",
            "score": 12,
            "created_utc": 1620936559.0,
            "replies": []
        },
        {
            "body": "This isn’t your fault. He could have been a stranger you’ve never met off the street you didn’t invite him there",
            "author": null,
            "id": "gy249l5",
            "parent_id": "t1_gy0nkte",
            "score": 4,
            "created_utc": 1620962214.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy12ghi",
            "parent_id": "t1_gy0zvrh",
            "score": 9,
            "created_utc": 1620942470.0,
            "replies": [
                {
                    "body": ">A lot of the men were looking for a cheap prostitute,\n\nwould it have made a difference if they were looking for an expensive prostitute?",
                    "author": "joc13",
                    "id": "gy13vrd",
                    "parent_id": "t1_gy12ghi",
                    "score": -5,
                    "created_utc": 1620943162.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy1bols",
            "parent_id": "t1_gy0o5it",
            "score": 10,
            "created_utc": 1620947051.0,
            "replies": [
                {
                    "body": "People need to tell her in case it happens again.",
                    "author": null,
                    "id": "gy24cya",
                    "parent_id": "t1_gy1bols",
                    "score": 2,
                    "created_utc": 1620962269.0,
                    "replies": [
                        {
                            "body": "Nope.\n\nHindsight is 20/20. This post is OP telling us her story and not OP asking us for advice. She is probably VERY competent and will ruminate over these moments. I'm not a professional and I doubt you are. When someone tells you their story don't critique unless you're asked.",
                            "author": "Sanbitch",
                            "id": "gy2bu0o",
                            "parent_id": "t1_gy24cya",
                            "score": 3,
                            "created_utc": 1620966873.0,
                            "replies": [
                                {
                                    "body": "I didn’t give her advice but I agreed with the advice other people gave her. She responded to some saying “I didn’t know I could do that” so to me, that sounds like she learned something and will be better equipped to handle this if it ever happens again (hopefully it won’t ever happen again, but this world is full of evil people) if she’s not upset by it not sure why you would be",
                                    "author": null,
                                    "id": "gy2curx",
                                    "parent_id": "t1_gy2bu0o",
                                    "score": 1,
                                    "created_utc": 1620967550.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awful. Awful. Awful.\n\nAnd I hate that I need to make this recommendation because it shouldn’t be incumbent upon you but rather should be the responsibility of the male population to behave properly. But this is not the current reality in our society.\n\n**Please use this as motivation to take a self defense class.** I had my daughters enrolled in these classes as soon as they were early teens. You’ll not only learn techniques for physically engaging an attacker but will also learn how to use your voice to escape these types of situations. It’s empowering and will help you regain a sense of control over your personal space.",
            "author": "ExpertPerformance",
            "id": "gy0qx7p",
            "parent_id": "t1_gy0o5it",
            "score": 6,
            "created_utc": 1620937238.0,
            "replies": []
        },
        {
            "body": "Well the store may have on site security, so I'd go to the first employee I saw - be quicker anyways.",
            "author": "sinvortex",
            "id": "gy1yp27",
            "parent_id": "t1_gy1wz72",
            "score": 3,
            "created_utc": 1620959095.0,
            "replies": [
                {
                    "body": "911 instant...it will come down to them anyways.",
                    "author": null,
                    "id": "gy1yzcs",
                    "parent_id": "t1_gy1yp27",
                    "score": 1,
                    "created_utc": 1620959251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes she never noticed ! I just feel too many things have to go right for this to happen.",
            "author": null,
            "id": "gy279nk",
            "parent_id": "t1_gy24krf",
            "score": -6,
            "created_utc": 1620963990.0,
            "replies": [
                {
                    "body": "Do you never watch the news? Or even movies? People following other people is very common. That’s the definition of a stalker. Lots of serial killers do this too and their targets never know. Police also do this for investigation. Most people don’t pay attention to their surroundings anyway and if there’s a ton of people in the street why would you think to look behind you or expect he would be in the crowd after you said goodbye already?",
                    "author": null,
                    "id": "gy27k4m",
                    "parent_id": "t1_gy279nk",
                    "score": 10,
                    "created_utc": 1620964169.0,
                    "replies": []
                },
                {
                    "body": "Lapphon-  gaslighting isn'ta  cute look",
                    "author": "mischiefmolly",
                    "id": "gy2b5gg",
                    "parent_id": "t1_gy279nk",
                    "score": 6,
                    "created_utc": 1620966425.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Have ladies ever met a pot with a friend watching over..if that makes sense..security. u didn't expect this. .most gals dont..so he obv followed you. What state was this in.",
            "author": null,
            "id": "gy1wwb3",
            "parent_id": "t1_gy1orzp",
            "score": 2,
            "created_utc": 1620958142.0,
            "replies": []
        },
        {
            "body": "Did he give you a gift card for a specific store at the M&G? Maybe that’s what led him to know where you’d be going next.",
            "author": null,
            "id": "gy27rg6",
            "parent_id": "t1_gy1orzp",
            "score": 0,
            "created_utc": 1620964290.0,
            "replies": [
                {
                    "body": "No, there was no mention of anything money related either",
                    "author": "functional_lake",
                    "id": "gy28632",
                    "parent_id": "t1_gy27rg6",
                    "score": 3,
                    "created_utc": 1620964541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that's insane and not at all your fault. You should report him he's a predator.  I'm so blown away from this.",
            "author": "UseRound7488",
            "id": "gy17yez",
            "parent_id": "t1_gy14aw5",
            "score": 2,
            "created_utc": 1620945184.0,
            "replies": []
        },
        {
            "body": "People disguise themselves as one thing when they are another...doesn't mean all do that",
            "author": null,
            "id": "gy1x4jb",
            "parent_id": "t1_gy14aw5",
            "score": 2,
            "created_utc": 1620958263.0,
            "replies": []
        },
        {
            "body": "And the legal system is NOT geared to protect sexual assault survivors at all so even if you do report don't expect safety and comfort (which is why it needs to be upended!)",
            "author": "mischiefmolly",
            "id": "gy2awgx",
            "parent_id": "t1_gy0p6bk",
            "score": 18,
            "created_utc": 1620966261.0,
            "replies": []
        },
        {
            "body": "What? I think you’re misunderstanding what I wrote or something. I don’t even know how you got what you said from what I wrote. I was trying to say that in this case the stigma that can be faced from police doesn’t need to apply because the police doesn’t have to know she met him before the attack in the fitting room. It’s not relevant to the police case. I’m not invalidating anything I was trying to be helpful, because I 100% agree you can’t report an attack while on a sugar date. I was trying to say I think this case may be a different type of situation where the police doesn’t even have to know there was a sugar component to the attack since it didn’t happen on the date. I hope that cleared up what I meant.",
            "author": null,
            "id": "gy2d7f0",
            "parent_id": "t1_gy29yne",
            "score": -2,
            "created_utc": 1620967791.0,
            "replies": [
                {
                    "body": "Oh sorry I misinterpreted your comment and because of some comments in this thread my guard was up about defending the OP. \n\n&#x200B;\n\nSadly, during the investigation the police would almost certainly find out how they met - not that it should make a difference though. OP did NOTHING wrong or illegal. She literally met up with a guy from a dating site for a drink, regardless of the plan to get money from him down the road nothing was exchanged. If OP wants to report this she shouldn't be afraid to.  (Source: i've been the complainant in a police investigation).",
                    "author": "Sanbitch",
                    "id": "gy2f7ka",
                    "parent_id": "t1_gy2d7f0",
                    "score": 7,
                    "created_utc": 1620969231.0,
                    "replies": []
                },
                {
                    "body": "> \n\nGod I hope you are wrong.\n\nI can’t imagine there is Implied Consent 100% of the time simply by virtue of there having been a sugar date. That would mean that SD’s literally have carte blanche to rape any SB on a date.",
                    "author": "ExpertPerformance",
                    "id": "gy3bzoo",
                    "parent_id": "t1_gy2d7f0",
                    "score": 2,
                    "created_utc": 1620995509.0,
                    "replies": [
                        {
                            "body": "It’s not that there’s implied consent. It’s that a lot of people, including police, would consider sugaring a type of sex work. So that complicates being able to report a crime if something does happen or having it taken seriously if you do report it. And some men do use that to take advantage of women.",
                            "author": "fakemoose",
                            "id": "gy45q4a",
                            "parent_id": "t1_gy3bzoo",
                            "score": 3,
                            "created_utc": 1621009071.0,
                            "replies": []
                        },
                        {
                            "body": "Like fakemoose said- its not implied consent its vulnerability. I'm from Canada, so I'm not sure about the USA but here there is no such thing as implied consent. There is nonverbal consent though. \n\n&#x200B;\n\nReporting any crime can be traumatizing. Reporting sexual assault is even worse. Throw in sex work (or at least sex work adjacent) being what led the perp to you and the complainant will basically be the one on trial. Not as in she will be put in jail - that is a thing of the past in most places. Rather the victim will have their entire sexual history exposed, Crown and police will be skeptical to even start prosecuting/investigating the guy, going through court will mean exposing so much personal information and shame, and sometimes nothing comes of it. It is an incredibly dangerous world, especially for women.",
                            "author": "Sanbitch",
                            "id": "gy4dliw",
                            "parent_id": "t1_gy3bzoo",
                            "score": 2,
                            "created_utc": 1621012423.0,
                            "replies": []
                        },
                        {
                            "body": "I'm saying that's why he targeted her, not that there is implied consent. Dangerous men go after vulnerable women, so some of them choose to go after sugar babies, esp newbies.",
                            "author": "ColdHeaux",
                            "id": "gy5esap",
                            "parent_id": "t1_gy3bzoo",
                            "score": 2,
                            "created_utc": 1621029050.0,
                            "replies": [
                                {
                                    "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
                                    "author": "ExpertPerformance",
                                    "id": "gy5fiqz",
                                    "parent_id": "t1_gy5esap",
                                    "score": 1,
                                    "created_utc": 1621029395.0,
                                    "replies": [
                                        {
                                            "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                                            "author": "ColdHeaux",
                                            "id": "gy5his3",
                                            "parent_id": "t1_gy5fiqz",
                                            "score": 2,
                                            "created_utc": 1621030351.0,
                                            "replies": [
                                                {
                                                    "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                                                    "author": "ExpertPerformance",
                                                    "id": "gy5ivy4",
                                                    "parent_id": "t1_gy5his3",
                                                    "score": 2,
                                                    "created_utc": 1621031024.0,
                                                    "replies": [
                                                        {
                                                            "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                                            "author": "Sanbitch",
                                                            "id": "gy5m04p",
                                                            "parent_id": "t1_gy5ivy4",
                                                            "score": 1,
                                                            "created_utc": 1621032604.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                                                    "author": "ColdHeaux",
                                                                    "id": "gy5s3lh",
                                                                    "parent_id": "t1_gy5m04p",
                                                                    "score": 2,
                                                                    "created_utc": 1621035796.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Copy that",
                                                            "author": "ColdHeaux",
                                                            "id": "gy5s0ae",
                                                            "parent_id": "t1_gy5ivy4",
                                                            "score": 1,
                                                            "created_utc": 1621035747.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                                            "author": "ColdHeaux",
                                                            "id": "gy5s5mr",
                                                            "parent_id": "t1_gy5ivy4",
                                                            "score": 1,
                                                            "created_utc": 1621035827.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm saying that's why he targeted her- SWers are vulnerable and that doesn't end just because the date ended. Also the info I gave was still important to be said to someone who is first starting off.",
                    "author": "ColdHeaux",
                    "id": "gy5eoqd",
                    "parent_id": "t1_gy2d7f0",
                    "score": 2,
                    "created_utc": 1621029003.0,
                    "replies": [
                        {
                            "body": "> Also the info I gave was still important to be said to someone who is first starting off.\n\nAMEN!",
                            "author": "Sanbitch",
                            "id": "gy5m1sx",
                            "parent_id": "t1_gy5eoqd",
                            "score": 2,
                            "created_utc": 1621032628.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "sending love",
            "author": "mischiefmolly",
            "id": "gy2b10f",
            "parent_id": "t1_gy11bht",
            "score": 3,
            "created_utc": 1620966343.0,
            "replies": []
        },
        {
            "body": ">A lot of the men were looking for a cheap prostitute,\n\nwould it have made a difference if they were looking for an expensive prostitute?",
            "author": "joc13",
            "id": "gy13vrd",
            "parent_id": "t1_gy12ghi",
            "score": -5,
            "created_utc": 1620943162.0,
            "replies": []
        },
        {
            "body": "People need to tell her in case it happens again.",
            "author": null,
            "id": "gy24cya",
            "parent_id": "t1_gy1bols",
            "score": 2,
            "created_utc": 1620962269.0,
            "replies": [
                {
                    "body": "Nope.\n\nHindsight is 20/20. This post is OP telling us her story and not OP asking us for advice. She is probably VERY competent and will ruminate over these moments. I'm not a professional and I doubt you are. When someone tells you their story don't critique unless you're asked.",
                    "author": "Sanbitch",
                    "id": "gy2bu0o",
                    "parent_id": "t1_gy24cya",
                    "score": 3,
                    "created_utc": 1620966873.0,
                    "replies": [
                        {
                            "body": "I didn’t give her advice but I agreed with the advice other people gave her. She responded to some saying “I didn’t know I could do that” so to me, that sounds like she learned something and will be better equipped to handle this if it ever happens again (hopefully it won’t ever happen again, but this world is full of evil people) if she’s not upset by it not sure why you would be",
                            "author": null,
                            "id": "gy2curx",
                            "parent_id": "t1_gy2bu0o",
                            "score": 1,
                            "created_utc": 1620967550.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "911 instant...it will come down to them anyways.",
            "author": null,
            "id": "gy1yzcs",
            "parent_id": "t1_gy1yp27",
            "score": 1,
            "created_utc": 1620959251.0,
            "replies": []
        },
        {
            "body": "Do you never watch the news? Or even movies? People following other people is very common. That’s the definition of a stalker. Lots of serial killers do this too and their targets never know. Police also do this for investigation. Most people don’t pay attention to their surroundings anyway and if there’s a ton of people in the street why would you think to look behind you or expect he would be in the crowd after you said goodbye already?",
            "author": null,
            "id": "gy27k4m",
            "parent_id": "t1_gy279nk",
            "score": 10,
            "created_utc": 1620964169.0,
            "replies": []
        },
        {
            "body": "Lapphon-  gaslighting isn'ta  cute look",
            "author": "mischiefmolly",
            "id": "gy2b5gg",
            "parent_id": "t1_gy279nk",
            "score": 6,
            "created_utc": 1620966425.0,
            "replies": []
        },
        {
            "body": "No, there was no mention of anything money related either",
            "author": "functional_lake",
            "id": "gy28632",
            "parent_id": "t1_gy27rg6",
            "score": 3,
            "created_utc": 1620964541.0,
            "replies": []
        },
        {
            "body": "Oh sorry I misinterpreted your comment and because of some comments in this thread my guard was up about defending the OP. \n\n&#x200B;\n\nSadly, during the investigation the police would almost certainly find out how they met - not that it should make a difference though. OP did NOTHING wrong or illegal. She literally met up with a guy from a dating site for a drink, regardless of the plan to get money from him down the road nothing was exchanged. If OP wants to report this she shouldn't be afraid to.  (Source: i've been the complainant in a police investigation).",
            "author": "Sanbitch",
            "id": "gy2f7ka",
            "parent_id": "t1_gy2d7f0",
            "score": 7,
            "created_utc": 1620969231.0,
            "replies": []
        },
        {
            "body": "> \n\nGod I hope you are wrong.\n\nI can’t imagine there is Implied Consent 100% of the time simply by virtue of there having been a sugar date. That would mean that SD’s literally have carte blanche to rape any SB on a date.",
            "author": "ExpertPerformance",
            "id": "gy3bzoo",
            "parent_id": "t1_gy2d7f0",
            "score": 2,
            "created_utc": 1620995509.0,
            "replies": [
                {
                    "body": "It’s not that there’s implied consent. It’s that a lot of people, including police, would consider sugaring a type of sex work. So that complicates being able to report a crime if something does happen or having it taken seriously if you do report it. And some men do use that to take advantage of women.",
                    "author": "fakemoose",
                    "id": "gy45q4a",
                    "parent_id": "t1_gy3bzoo",
                    "score": 3,
                    "created_utc": 1621009071.0,
                    "replies": []
                },
                {
                    "body": "Like fakemoose said- its not implied consent its vulnerability. I'm from Canada, so I'm not sure about the USA but here there is no such thing as implied consent. There is nonverbal consent though. \n\n&#x200B;\n\nReporting any crime can be traumatizing. Reporting sexual assault is even worse. Throw in sex work (or at least sex work adjacent) being what led the perp to you and the complainant will basically be the one on trial. Not as in she will be put in jail - that is a thing of the past in most places. Rather the victim will have their entire sexual history exposed, Crown and police will be skeptical to even start prosecuting/investigating the guy, going through court will mean exposing so much personal information and shame, and sometimes nothing comes of it. It is an incredibly dangerous world, especially for women.",
                    "author": "Sanbitch",
                    "id": "gy4dliw",
                    "parent_id": "t1_gy3bzoo",
                    "score": 2,
                    "created_utc": 1621012423.0,
                    "replies": []
                },
                {
                    "body": "I'm saying that's why he targeted her, not that there is implied consent. Dangerous men go after vulnerable women, so some of them choose to go after sugar babies, esp newbies.",
                    "author": "ColdHeaux",
                    "id": "gy5esap",
                    "parent_id": "t1_gy3bzoo",
                    "score": 2,
                    "created_utc": 1621029050.0,
                    "replies": [
                        {
                            "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
                            "author": "ExpertPerformance",
                            "id": "gy5fiqz",
                            "parent_id": "t1_gy5esap",
                            "score": 1,
                            "created_utc": 1621029395.0,
                            "replies": [
                                {
                                    "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                                    "author": "ColdHeaux",
                                    "id": "gy5his3",
                                    "parent_id": "t1_gy5fiqz",
                                    "score": 2,
                                    "created_utc": 1621030351.0,
                                    "replies": [
                                        {
                                            "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                                            "author": "ExpertPerformance",
                                            "id": "gy5ivy4",
                                            "parent_id": "t1_gy5his3",
                                            "score": 2,
                                            "created_utc": 1621031024.0,
                                            "replies": [
                                                {
                                                    "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                                    "author": "Sanbitch",
                                                    "id": "gy5m04p",
                                                    "parent_id": "t1_gy5ivy4",
                                                    "score": 1,
                                                    "created_utc": 1621032604.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                                            "author": "ColdHeaux",
                                                            "id": "gy5s3lh",
                                                            "parent_id": "t1_gy5m04p",
                                                            "score": 2,
                                                            "created_utc": 1621035796.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Copy that",
                                                    "author": "ColdHeaux",
                                                    "id": "gy5s0ae",
                                                    "parent_id": "t1_gy5ivy4",
                                                    "score": 1,
                                                    "created_utc": 1621035747.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                                    "author": "ColdHeaux",
                                                    "id": "gy5s5mr",
                                                    "parent_id": "t1_gy5ivy4",
                                                    "score": 1,
                                                    "created_utc": 1621035827.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm saying that's why he targeted her- SWers are vulnerable and that doesn't end just because the date ended. Also the info I gave was still important to be said to someone who is first starting off.",
            "author": "ColdHeaux",
            "id": "gy5eoqd",
            "parent_id": "t1_gy2d7f0",
            "score": 2,
            "created_utc": 1621029003.0,
            "replies": [
                {
                    "body": "> Also the info I gave was still important to be said to someone who is first starting off.\n\nAMEN!",
                    "author": "Sanbitch",
                    "id": "gy5m1sx",
                    "parent_id": "t1_gy5eoqd",
                    "score": 2,
                    "created_utc": 1621032628.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nope.\n\nHindsight is 20/20. This post is OP telling us her story and not OP asking us for advice. She is probably VERY competent and will ruminate over these moments. I'm not a professional and I doubt you are. When someone tells you their story don't critique unless you're asked.",
            "author": "Sanbitch",
            "id": "gy2bu0o",
            "parent_id": "t1_gy24cya",
            "score": 3,
            "created_utc": 1620966873.0,
            "replies": [
                {
                    "body": "I didn’t give her advice but I agreed with the advice other people gave her. She responded to some saying “I didn’t know I could do that” so to me, that sounds like she learned something and will be better equipped to handle this if it ever happens again (hopefully it won’t ever happen again, but this world is full of evil people) if she’s not upset by it not sure why you would be",
                    "author": null,
                    "id": "gy2curx",
                    "parent_id": "t1_gy2bu0o",
                    "score": 1,
                    "created_utc": 1620967550.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not that there’s implied consent. It’s that a lot of people, including police, would consider sugaring a type of sex work. So that complicates being able to report a crime if something does happen or having it taken seriously if you do report it. And some men do use that to take advantage of women.",
            "author": "fakemoose",
            "id": "gy45q4a",
            "parent_id": "t1_gy3bzoo",
            "score": 3,
            "created_utc": 1621009071.0,
            "replies": []
        },
        {
            "body": "Like fakemoose said- its not implied consent its vulnerability. I'm from Canada, so I'm not sure about the USA but here there is no such thing as implied consent. There is nonverbal consent though. \n\n&#x200B;\n\nReporting any crime can be traumatizing. Reporting sexual assault is even worse. Throw in sex work (or at least sex work adjacent) being what led the perp to you and the complainant will basically be the one on trial. Not as in she will be put in jail - that is a thing of the past in most places. Rather the victim will have their entire sexual history exposed, Crown and police will be skeptical to even start prosecuting/investigating the guy, going through court will mean exposing so much personal information and shame, and sometimes nothing comes of it. It is an incredibly dangerous world, especially for women.",
            "author": "Sanbitch",
            "id": "gy4dliw",
            "parent_id": "t1_gy3bzoo",
            "score": 2,
            "created_utc": 1621012423.0,
            "replies": []
        },
        {
            "body": "I'm saying that's why he targeted her, not that there is implied consent. Dangerous men go after vulnerable women, so some of them choose to go after sugar babies, esp newbies.",
            "author": "ColdHeaux",
            "id": "gy5esap",
            "parent_id": "t1_gy3bzoo",
            "score": 2,
            "created_utc": 1621029050.0,
            "replies": [
                {
                    "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
                    "author": "ExpertPerformance",
                    "id": "gy5fiqz",
                    "parent_id": "t1_gy5esap",
                    "score": 1,
                    "created_utc": 1621029395.0,
                    "replies": [
                        {
                            "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                            "author": "ColdHeaux",
                            "id": "gy5his3",
                            "parent_id": "t1_gy5fiqz",
                            "score": 2,
                            "created_utc": 1621030351.0,
                            "replies": [
                                {
                                    "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                                    "author": "ExpertPerformance",
                                    "id": "gy5ivy4",
                                    "parent_id": "t1_gy5his3",
                                    "score": 2,
                                    "created_utc": 1621031024.0,
                                    "replies": [
                                        {
                                            "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                            "author": "Sanbitch",
                                            "id": "gy5m04p",
                                            "parent_id": "t1_gy5ivy4",
                                            "score": 1,
                                            "created_utc": 1621032604.0,
                                            "replies": [
                                                {
                                                    "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                                    "author": "ColdHeaux",
                                                    "id": "gy5s3lh",
                                                    "parent_id": "t1_gy5m04p",
                                                    "score": 2,
                                                    "created_utc": 1621035796.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Copy that",
                                            "author": "ColdHeaux",
                                            "id": "gy5s0ae",
                                            "parent_id": "t1_gy5ivy4",
                                            "score": 1,
                                            "created_utc": 1621035747.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                            "author": "ColdHeaux",
                                            "id": "gy5s5mr",
                                            "parent_id": "t1_gy5ivy4",
                                            "score": 1,
                                            "created_utc": 1621035827.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Also the info I gave was still important to be said to someone who is first starting off.\n\nAMEN!",
            "author": "Sanbitch",
            "id": "gy5m1sx",
            "parent_id": "t1_gy5eoqd",
            "score": 2,
            "created_utc": 1621032628.0,
            "replies": []
        },
        {
            "body": "I didn’t give her advice but I agreed with the advice other people gave her. She responded to some saying “I didn’t know I could do that” so to me, that sounds like she learned something and will be better equipped to handle this if it ever happens again (hopefully it won’t ever happen again, but this world is full of evil people) if she’s not upset by it not sure why you would be",
            "author": null,
            "id": "gy2curx",
            "parent_id": "t1_gy2bu0o",
            "score": 1,
            "created_utc": 1620967550.0,
            "replies": []
        },
        {
            "body": "Totally agree with you. The perp fully targeted the OP.\n\nI was specifically challenging the “you can’t report an attack while on a sugar date” BS.",
            "author": "ExpertPerformance",
            "id": "gy5fiqz",
            "parent_id": "t1_gy5esap",
            "score": 1,
            "created_utc": 1621029395.0,
            "replies": [
                {
                    "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
                    "author": "ColdHeaux",
                    "id": "gy5his3",
                    "parent_id": "t1_gy5fiqz",
                    "score": 2,
                    "created_utc": 1621030351.0,
                    "replies": [
                        {
                            "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                            "author": "ExpertPerformance",
                            "id": "gy5ivy4",
                            "parent_id": "t1_gy5his3",
                            "score": 2,
                            "created_utc": 1621031024.0,
                            "replies": [
                                {
                                    "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                                    "author": "Sanbitch",
                                    "id": "gy5m04p",
                                    "parent_id": "t1_gy5ivy4",
                                    "score": 1,
                                    "created_utc": 1621032604.0,
                                    "replies": [
                                        {
                                            "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                            "author": "ColdHeaux",
                                            "id": "gy5s3lh",
                                            "parent_id": "t1_gy5m04p",
                                            "score": 2,
                                            "created_utc": 1621035796.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Copy that",
                                    "author": "ColdHeaux",
                                    "id": "gy5s0ae",
                                    "parent_id": "t1_gy5ivy4",
                                    "score": 1,
                                    "created_utc": 1621035747.0,
                                    "replies": []
                                },
                                {
                                    "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                                    "author": "ColdHeaux",
                                    "id": "gy5s5mr",
                                    "parent_id": "t1_gy5ivy4",
                                    "score": 1,
                                    "created_utc": 1621035827.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In some cases though, yeah, she wouldn't be able to report it- that depends on the situation. If you're a SW who wants to avoid any contact with the law, some will pass up reporting to keep themselves from having to answer too many questions from police. There is a chance that their previous text or email interactions contained info that could be damning for her or get her arrested. There are many situations that might cause a sugar baby not to report an assault at all. I'm not convinced that one has a black or white \"yes you can\" or \"no you can't\" answer.",
            "author": "ColdHeaux",
            "id": "gy5his3",
            "parent_id": "t1_gy5fiqz",
            "score": 2,
            "created_utc": 1621030351.0,
            "replies": [
                {
                    "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
                    "author": "ExpertPerformance",
                    "id": "gy5ivy4",
                    "parent_id": "t1_gy5his3",
                    "score": 2,
                    "created_utc": 1621031024.0,
                    "replies": [
                        {
                            "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                            "author": "Sanbitch",
                            "id": "gy5m04p",
                            "parent_id": "t1_gy5ivy4",
                            "score": 1,
                            "created_utc": 1621032604.0,
                            "replies": [
                                {
                                    "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                                    "author": "ColdHeaux",
                                    "id": "gy5s3lh",
                                    "parent_id": "t1_gy5m04p",
                                    "score": 2,
                                    "created_utc": 1621035796.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Copy that",
                            "author": "ColdHeaux",
                            "id": "gy5s0ae",
                            "parent_id": "t1_gy5ivy4",
                            "score": 1,
                            "created_utc": 1621035747.0,
                            "replies": []
                        },
                        {
                            "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                            "author": "ColdHeaux",
                            "id": "gy5s5mr",
                            "parent_id": "t1_gy5ivy4",
                            "score": 1,
                            "created_utc": 1621035827.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hear ya.\n\nBut I’m *specifically* addressing the “you **can’t** report an attack while on a sugar date” statement.\n\nWhile there are definitely hurdles or considerations to make, I think it is entirely irresponsible and even downright dangerous to spread the concept that SB’s **can’t** make these reports.",
            "author": "ExpertPerformance",
            "id": "gy5ivy4",
            "parent_id": "t1_gy5his3",
            "score": 2,
            "created_utc": 1621031024.0,
            "replies": [
                {
                    "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
                    "author": "Sanbitch",
                    "id": "gy5m04p",
                    "parent_id": "t1_gy5ivy4",
                    "score": 1,
                    "created_utc": 1621032604.0,
                    "replies": [
                        {
                            "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                            "author": "ColdHeaux",
                            "id": "gy5s3lh",
                            "parent_id": "t1_gy5m04p",
                            "score": 2,
                            "created_utc": 1621035796.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Copy that",
                    "author": "ColdHeaux",
                    "id": "gy5s0ae",
                    "parent_id": "t1_gy5ivy4",
                    "score": 1,
                    "created_utc": 1621035747.0,
                    "replies": []
                },
                {
                    "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
                    "author": "ColdHeaux",
                    "id": "gy5s5mr",
                    "parent_id": "t1_gy5ivy4",
                    "score": 1,
                    "created_utc": 1621035827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">But I’m specifically addressing the “you can’t report an attack while on a sugar date” statement.\n\nYou can report whatever you want always, BUT whether it is worth reporting is another story.",
            "author": "Sanbitch",
            "id": "gy5m04p",
            "parent_id": "t1_gy5ivy4",
            "score": 1,
            "created_utc": 1621032604.0,
            "replies": [
                {
                    "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
                    "author": "ColdHeaux",
                    "id": "gy5s3lh",
                    "parent_id": "t1_gy5m04p",
                    "score": 2,
                    "created_utc": 1621035796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Copy that",
            "author": "ColdHeaux",
            "id": "gy5s0ae",
            "parent_id": "t1_gy5ivy4",
            "score": 1,
            "created_utc": 1621035747.0,
            "replies": []
        },
        {
            "body": "Idk why I wrote 'copy that' lol, I must still be in work mode 😂",
            "author": "ColdHeaux",
            "id": "gy5s5mr",
            "parent_id": "t1_gy5ivy4",
            "score": 1,
            "created_utc": 1621035827.0,
            "replies": []
        },
        {
            "body": "I don't feel comfortable telling someone else whether it is or is not worth reporting personally.",
            "author": "ColdHeaux",
            "id": "gy5s3lh",
            "parent_id": "t1_gy5m04p",
            "score": 2,
            "created_utc": 1621035796.0,
            "replies": []
        }
    ]
}