{
    "title": "In the Corner Of : Uncompensated M&G",
    "post_id": "8oqf7l",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/8oqf7l/in_the_corner_of_uncompensated_mg/",
    "author": null,
    "body": "I’ve never asked for compensation to meet. I always see some SBs here saying they’ll at least ask for associated travel costs, Uber, etc.\nI was once offered cash at a M&G which I declined because I knew I wouldn’t see him again (and told him so). \n\nLast week I met with a very wealthy man. I was able to google him from some info he gave me so I was able to verify this. I drove over an hour to meet him. Prior to the meet I remembered some of the advice on here from SBs recommending trying to negotiate travel costs. I debated bringing it up but didn’t because it’s just not my style. \n\nWe met and had a lovely uncompensated meal. After it was over, and on my drive home, I doubted myself due to what I’ve heard here because he didn’t offer to reimburse travel after the meet was over. He said he wanted to move forward, but that was it. I told him we could discuss an arrangement after a good nights sleep. \n\nNow: I’m positive some SBs here are rolling their eyes. But here’s why this ended up working for me - and I’m happy I ended up taking the opinions of some here with a grain of salt - and went with MY style. \n\nWe talked at length on the phone the next day. I already had a number in my mind on my ask based on travel. When we discussed logistics he said he thought he’d travel to my city 50%, 25% to his city and the other 25% weekends away at his shore house. At this point, I’m willing to accept less than my ask, because it would require less travel to him. \n\nThen he says he’s thankful I didn’t try to bleed him for the meet - he said he refuses to meet anyone who asks or demands for compensation up front. His thought: he’d never pay to see goods he was planning on leasing, especially if he’s already committing to the meal, etc. (paraphrasing, he wasn’t as crass.) He said too many women have seen what he’s worth and immediately asked for X to meet, or an Uber, a gift, or immediately start with the Amazon Wish list. \n\nSo we finally get around to talk of financials and I ask him what he’s comfortable with. (I always do this, but am prepared to throw a number out if they refuse.) And his number is exactly my ask I had in mind for traveling to him 100% of the time. Now, my first thought is - SBs would want to negotiate higher or suggest doing so. Instead I tell him the number is perfectly acceptable. We both end the call pleased and we agree to meet (last night). (Collective eye roll for leaving money on the table.)\n\nSo - last night we go out for dinner and a show. At the beginning of the date he tells me he’d like to hold off intimacy until it feels organic. As such he’d like if we would just spend time together that night. I am happy to do so, since he seemed very genuine. We see a show I’ve been dying to see, and at that point I’d be willing to have the date unpaid. Instead, he hands me an envelope at the end of the date and kisses me goodbye. \n\nI look in the envelope when I get home and there’s 25% more in there than we agreed on. I text him to say so - and his response is : I wanted to reimburse your travel and costs for the other day. (25% more covers way more than my travel expenses.)\n\nWe’ve made plans to see each other again next week.\n\nSo, here’s what I’ve learned. Take what you see here on SLF into consideration. But don’t let it change what you do if it’s not who you are. If I’d gone with my thought to change up my style, I never would’ve met this man for our first meet. \n\nTL:DR - Be yourself. Do what feels natural. Don’t get greedy. ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/8oqf7l/in_the_corner_of_uncompensated_mg/",
    "score": 104,
    "upvote_ratio": 0.87,
    "created_utc": 1528201961.0,
    "num_comments": 32,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "e05b377",
            "parent_id": "t3_8oqf7l",
            "score": 37,
            "created_utc": 1528203913.0,
            "replies": [
                {
                    "body": ">A  lot  of  what  you  wrote  is  reflective  of  the  advice  on  here.  No  need  for  the  extra  eye  roll  comments.  I  don‘t  think  anything  you‘ve  stated  would  be  frowned  upon.\n\nExactly. In fact, the converse is generally frowned upon. It's like saying 'Unpopular Opinion: I brush my teeth every day' in a dentristry sub\n\nWe've had a million don't ask for M&G 'fees' threads. SD's/SB's alike will also say that a gentleman will reimburse your travel costs but it doesn't necessarily need to be mentioned unless you'll be out of a lot of money.\n\nAlso, it wasn't anything special that you did OP, you were just lucky. For every girl who doesn't mention travel costs but gets them reimburses a few days later, I'm sure there are many more that get ghosted leaving them out of gas money *and* a SD. \n\nCongrats, but the preachy tone of your post is kinda weird and misplaced.",
                    "author": "blonde-throwaway",
                    "id": "e05e4cw",
                    "parent_id": "t1_e05b377",
                    "score": 35,
                    "created_utc": 1528207169.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e05hwdb",
                            "parent_id": "t1_e05e4cw",
                            "score": 16,
                            "created_utc": 1528210751.0,
                            "replies": [
                                {
                                    "body": ">  we talked for almost a WEEK before meeting and I never once mentioned anything about payment for meeting for coffee. \n\nIt has been known for that to happen and then immediately before the M&G she suddenly drops the payment for meeting bomb",
                                    "author": null,
                                    "id": "e05usv4",
                                    "parent_id": "t1_e05hwdb",
                                    "score": -2,
                                    "created_utc": 1528222025.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> For every girl who doesn't mention travel costs but gets them reimburses a few days later, I'm sure there are many more that get ghosted leaving them out of gas money and a SD.\n\n\nIn my experience most guys wouldn't really think to offer if you don't bring it up so I've always brought it up because it wasn't uncommon for me to drive an hour each way to see them. Even then there's never guarantee they're gonna show up or that they'll stick to their word. \n\n\nThe whole \"don't ask for travel cost or anything else for the m&g\" shouldn't be prescriptive on this sub imo. You don't know how far an SB has to travel to see a pot and you don't really know if the dent in gas or time and effort from travel could hurt her budget for the month or not. Maybe she's giving up a 3-4 hour babysitting gig or she has to drive 50-80 miles each way. It's why I think it's *more* important focus on getting the background from these girls before giving any kind of advice rather than focusing on what they should or shouldn't do to get an SD interested.\n\n\nThen you'd get an SB coming in who's afraid of asking for any kind of compensation for traveling 2 hours to meet a pot. It's not even a hyperbole these have been legit questions in the past.  \n\n\nAs an SB with a stable career I can afford to do whatever I want and risk losing $50-100 and a chunk of my day. Someone who is struggling with keeping a job or who lives off of a stipend can't afford to indulge. ",
                            "author": "adequatelay",
                            "id": "e06swri",
                            "parent_id": "t1_e05e4cw",
                            "score": 12,
                            "created_utc": 1528254687.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm glad this approach worked out for you but it's also important to maintain a balance because for every generous SD there are ten more who will take advantage of girls with this attitude. When I first entered the bowl I tried really hard to not come off as greedy and ended up getting screwed over a lot. Now I learned to ask for exactly what I want instead of taking \"don't worry babe I'll take good care of you\" as an answer or settling for less hoping to get a raise in allowance later (common scam is start off with low PPM with promises to move to a high monthly allowance). I've found that the guys who make big promises and make it seem like you don't need to worry about discussing the business side of things end up being the most stingy and they take advantage of young girls' apprehension with talking money or seeming greedy. \n\nI've found that genuine SDs are okay with dealing with the discomfort of talking money up front and dropping that illusion of \"she wants me for me not just my money\" while the salt daddies are the only ones who get truly offended by it. I never ask for paid M&G (besides travel) or anything I'm not entitled to but now I don't budge on requesting the allowance that would keep me happy (rather than just \"ok\" with it). Financially a couple hundred bucks difference isn't the end of the world, but psychologically selling yourself \"short\" can be damaging. ",
            "author": "sbfriendship",
            "id": "e05c3ew",
            "parent_id": "t3_8oqf7l",
            "score": 48,
            "created_utc": 1528205066.0,
            "replies": [
                {
                    "body": "This. \nExactly\n",
                    "author": "sugbabythrowaway11",
                    "id": "e05dd14",
                    "parent_id": "t1_e05c3ew",
                    "score": 12,
                    "created_utc": 1528206405.0,
                    "replies": []
                },
                {
                    "body": "I would argue that as an ethical SD I should not be subject to a Dirtbag Tax on  M&G.  \n\nA little thought might generate the basis for some selectivity on the  Appearance Charge....   SD disclosed verifiable ID (a name you can find) .    \n\nClearly if the SB is doing most of the travel to the M&G she deserves something  and in all cases parking paid . \n\nHow many stores charge $40 to try on a pair of shoes  and yet the SD is just asking to look at the shoes close up...... \n",
                    "author": "pinotandsugar",
                    "id": "e064uh6",
                    "parent_id": "t1_e05c3ew",
                    "score": 4,
                    "created_utc": 1528230719.0,
                    "replies": [
                        {
                            "body": "> ethical SD\n\n\nThat should be a flair option lmao",
                            "author": "adequatelay",
                            "id": "e06tw30",
                            "parent_id": "t1_e064uh6",
                            "score": 8,
                            "created_utc": 1528255799.0,
                            "replies": [
                                {
                                    "body": "The problem ( as in real life outside the bowl) is that who claim to be ethical seldom are",
                                    "author": "pinotandsugar",
                                    "id": "e06zw4v",
                                    "parent_id": "t1_e06tw30",
                                    "score": 4,
                                    "created_utc": 1528263480.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e089zjp",
                            "parent_id": "t1_e064uh6",
                            "score": 3,
                            "created_utc": 1528317611.0,
                            "replies": [
                                {
                                    "body": "Personally I don't enjoy M&G as a hobby.  They are a necessary time suck of some pretty valuable time. \n\nThe \"thrill of someone out of his league?\"   no  the opportunity of two people to meet and discuss matters of common interest, appeal and benefit. \n\nOne could argue that the M&G is really a sales call where the customer pays . Actually I much prefer to pay for meals and such with prospective suppliers.  I don't want freebie meals and drinks but rather fresh ideas which address my client's projects. ",
                                    "author": "pinotandsugar",
                                    "id": "e08bku8",
                                    "parent_id": "t1_e089zjp",
                                    "score": 0,
                                    "created_utc": 1528318991.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well that’s actually completely different when you can verify his identity because he wouldn’t expect you to ask for money just to prove he has it and would know you’d know he has others he could easily draw in other than you. Though, I still think it wasn’t very gentlemanly to invite anyone and not compensate them for travel once they have met",
            "author": null,
            "id": "e067csi",
            "parent_id": "t3_8oqf7l",
            "score": 13,
            "created_utc": 1528232897.0,
            "replies": [
                {
                    "body": "I’ve met very well off sds who lowball me after 1-2 uncompensated m&gs. I met up with one 6 times then had to drop him like a sack of hot shit when he said $300/month. How do you only have $300/month budget when your family owns a castle in the Caribbean and you’re a lawyer (not public defender)??? I no longer do background checks to verify income- sds have such vast differences in budget despite what their income may imply.\n\nNow it’s $200 for coffee. I have enough social media crap flying around for sds to find out if they’re willing to give me good compensation. I work at a strip club- I make $400-2k/night. Why would I do a meet for $0 when the point of sds is to provide for sbs?\n\nFound 2 ltr with wealthy sds from my compensated m&gs. \n\nI’m also a different breed of sb, I’m way more stubborn and have more pride, but people pay for what they want.",
                    "author": "saintkatelyn",
                    "id": "e07ziam",
                    "parent_id": "t1_e067csi",
                    "score": 7,
                    "created_utc": 1528308564.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "e08a4u6",
                            "parent_id": "t1_e07ziam",
                            "score": 5,
                            "created_utc": 1528317738.0,
                            "replies": [
                                {
                                    "body": "I remember one joker seemed smart but oddly frugal. He told me he was in real estate but was very busy,  would it be ok if I helped him move some boxes for an older lady, promised it would be easy, said he could give me $60 for totally platonic legit light moving. We had a mutual friend so I assumed he was safe...\n\nStory was correct, nice elderly lady moving out needs a little help. I said I could help but they already had a team there so I didn’t do anything.\n\nHowever he was absolutely a terrible person (personality, smelled bad, etc) tried to invite me to his house (he lives with his parents which CAN be legit but seriously??) I asked him about the $60 and he got into a huff, said he didn’t even have cash with him!! He gave it to me through google pay eventually but BOY was that a joke! (His entire real estate businesses seem like slumlord type scenarios, too. The little old lady was bankrupt and was being forced to sell...)\n\nSome guys have money but I honestly don’t care unless they’re handing it to me! I’m VERY certain this guy had money but he obviously had some mental issues with being miserly, to the point where he doesn’t give a shit about the people HE gets money from. Barf.",
                                    "author": "saintkatelyn",
                                    "id": "e08d9uv",
                                    "parent_id": "t1_e08a4u6",
                                    "score": 6,
                                    "created_utc": 1528320540.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I believe what you said you did lines up with what many of us here on SLF suggest.\n\nDon’t ask for anything upfront; if it’s offered, accept gratefully. If you’re offered an allowance you’re happy with, accept it; negotiations lead to resentment.\n\nI feel like that’s the majority opinion. At any rate, happy it worked out for you.",
            "author": "FilmSD",
            "id": "e05a24n",
            "parent_id": "t3_8oqf7l",
            "score": 17,
            "created_utc": 1528202656.0,
            "replies": [
                {
                    "body": "> Don’t ask for anything upfront; if it’s offered, accept gratefully. If you’re offered an allowance you’re happy with, accept it; negotiations lead to resentment. \n\nThat's what I thought the majority opinions was here too.  I was looking at that whole story as a glorious vindication of our hive mind :\\)  Glad it worked out, Ab",
                    "author": "Azurecole",
                    "id": "e05d6zn",
                    "parent_id": "t1_e05a24n",
                    "score": 1,
                    "created_utc": 1528206231.0,
                    "replies": []
                },
                {
                    "body": "I don't see negotiations necessarily leading  to resentment although it happens. If there is resentment on either side it really best to just not proceed.  For the unscrupulous SD there's the temptation to agree and then one and done",
                    "author": "pinotandsugar",
                    "id": "e08m5lm",
                    "parent_id": "t1_e05a24n",
                    "score": 1,
                    "created_utc": 1528329379.0,
                    "replies": []
                },
                {
                    "body": "Might be the majority, but the minority are loud.",
                    "author": null,
                    "id": "e05a50z",
                    "parent_id": "t1_e05a24n",
                    "score": -2,
                    "created_utc": 1528202758.0,
                    "replies": [
                        {
                            "body": "Do we read the same forum...? 🤔",
                            "author": "depprat",
                            "id": "e05ea0v",
                            "parent_id": "t1_e05a50z",
                            "score": 4,
                            "created_utc": 1528207329.0,
                            "replies": [
                                {
                                    "body": "I've been downvoted for saying I will cancel a m&g if she asks for compensation even though I added in the same comment that i will reimburse her for travel costs after she arrives.",
                                    "author": "sexviewer",
                                    "id": "e05f8lf",
                                    "parent_id": "t1_e05ea0v",
                                    "score": 2,
                                    "created_utc": 1528208273.0,
                                    "replies": [
                                        {
                                            "body": "Do you tell her that you would reimburse her? That'd be the only way I would disagree with you really. ",
                                            "author": "adequatelay",
                                            "id": "e06s0pe",
                                            "parent_id": "t1_e05f8lf",
                                            "score": 9,
                                            "created_utc": 1528253694.0,
                                            "replies": [
                                                {
                                                    "body": "If she asks to he compensated for her time I cancel no exceptions. If she asks to be reimbursed the $20 for an uber or gas if she has to drive a bit, or any other travel expenses I tell her I will do so when she arrives. I've never had anyone ask to be reimbursed for travel expenses though (I will offer/insist during the m&g though), and have had a number of girls ask to be reimbursed for her time.",
                                                    "author": "sexviewer",
                                                    "id": "e07pomk",
                                                    "parent_id": "t1_e06s0pe",
                                                    "score": -1,
                                                    "created_utc": 1528300250.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "That sentiment will be voted to the top of the thread by different people though. That's a very standard POV on SLF.\n\nMaybe it was your delivery idk?",
                                            "author": "depprat",
                                            "id": "e05fqnc",
                                            "parent_id": "t1_e05f8lf",
                                            "score": 10,
                                            "created_utc": 1528208760.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe. Could have been delivery, could have been the thread. I do know I was surprised.",
                                                    "author": "sexviewer",
                                                    "id": "e05g5ho",
                                                    "parent_id": "t1_e05fqnc",
                                                    "score": 1,
                                                    "created_utc": 1528209149.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Ah, I don’t listen to loud people. The louder they are; the less they have to say that’s worth my attention.\n\n\nSee also: Trump.",
                            "author": "FilmSD",
                            "id": "e05dci2",
                            "parent_id": "t1_e05a50z",
                            "score": 5,
                            "created_utc": 1528206388.0,
                            "replies": []
                        },
                        {
                            "body": "Wise words. I'd quip about him rubbing off on you already or you rubbing him off already, but it appears that neither is the case. The wisdom you've demonstrated thus far is your own. Own it. It'll take you far. Best wishes!",
                            "author": "sdthrowaway006",
                            "id": "e05agm8",
                            "parent_id": "t1_e05a50z",
                            "score": 1,
                            "created_utc": 1528203155.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some SDs are in for the sex some are in it for the relationships.\n\nSome SBs are in it for the cash some see the bigger picture .\n\nYou do you , congrats :)\n",
            "author": "JimSD1234",
            "id": "e059wf9",
            "parent_id": "t3_8oqf7l",
            "score": 2,
            "created_utc": 1528202460.0,
            "replies": []
        },
        {
            "body": "You looked at the big picture and it paid of handsomely for you. I applaud you on your discipline and can honestly say there are some ladies out there that would have received equal treatment had they not been so eager to go for the the quick buck.",
            "author": "KeyToGramercy",
            "id": "e05fhvh",
            "parent_id": "t3_8oqf7l",
            "score": 0,
            "created_utc": 1528208527.0,
            "replies": []
        },
        {
            "body": "I had an M&G close to POTs home after hearing she had a minor car problem. I had first suggested my town 45 miles away.  (so doubt it was an attempt to get fix funded since wasn't mentioned until then). I also offered to cover UBER to a place located closer to her (3 or 5 miles). She arrived and claimed UBER couldn't arrive in time so she drove, just slow. Didn't want to ghost me. After lunch I walked her to car. She said sheepishly my tanks on \"E'. I felt embarrassed that I forgot to give her some token travel money and quickly gave her what I had  figured was 200% of what Uber costs and would easily fill her tank. A day later I get msg .. \"no chemistry\" which was a disappointment but OK. I just wonder if there had been chemistry, would the empty gas tank have been mentioned. \n\nAt the other end is a POT #2. Needs to fly in (1.25 hrs). I'm making all arrangements (see SNAFU next time rant/rave ha ha) for M&G to maybe move into arrangement. When asked about sugar for travel time, long distance M&G and possible starting an arrangement before next days flight back, response is \"I'll just go with the flow\". I plan to spoil her to death, one time platonic visit, STR, LTR or not. ",
            "author": "TooOldForSD",
            "id": "e05ll8d",
            "parent_id": "t3_8oqf7l",
            "score": 0,
            "created_utc": 1528214071.0,
            "replies": []
        },
        {
            "body": "That is my same approach as a SD.\n\nIf she demands it , she’s a gold digger in my book and is focused far more on how much she can extract from me than she is about the relationship \n\n\nIf she doesn’t ask I’m usually more than happy to give extra , pay for travel / gas , etc ",
            "author": "andrew_david",
            "id": "e05d7hg",
            "parent_id": "t3_8oqf7l",
            "score": 1,
            "created_utc": 1528206245.0,
            "replies": []
        },
        {
            "body": "I mean basically similar here with SGF I when we met. I like reading these good stories! I hope you have a great and long SR!",
            "author": "BigBearSD",
            "id": "e05g31w",
            "parent_id": "t3_8oqf7l",
            "score": 1,
            "created_utc": 1528209083.0,
            "replies": []
        },
        {
            "body": "I hope you don't get any eye rolls or flack here because you did things the right way, and it looks like that positive energy and karma may be retuning your way. Good luck!",
            "author": "Cledaddy23",
            "id": "e08iaqt",
            "parent_id": "t3_8oqf7l",
            "score": 0,
            "created_utc": 1528325359.0,
            "replies": []
        },
        {
            "body": "Nice job.\n\nI always pay for the meal, drinks etc.\n\nif the SB had to spend money to travel, i help out. At times i will offer upfront help. At times, i will help when they do not ask for it. I love to help such SB's. i have filled the car gas tank before they leave.\n\nFor some who are out of a job, i gave them what ever cash i had on me at that time.\n\nFor the ones that ask for an upfront money to meet, i never entertain. No matter how good they look.",
            "author": "golferkris101",
            "id": "e0676ts",
            "parent_id": "t3_8oqf7l",
            "score": -3,
            "created_utc": 1528232748.0,
            "replies": []
        },
        {
            "body": "To the OP...GOOD FOR YOU! I wish more SB's would approach not only sugaring, but life, with your outlook and attitude. ",
            "author": "mraspencer",
            "id": "e06du7a",
            "parent_id": "t3_8oqf7l",
            "score": -2,
            "created_utc": 1528239006.0,
            "replies": []
        },
        {
            "body": ">A  lot  of  what  you  wrote  is  reflective  of  the  advice  on  here.  No  need  for  the  extra  eye  roll  comments.  I  don‘t  think  anything  you‘ve  stated  would  be  frowned  upon.\n\nExactly. In fact, the converse is generally frowned upon. It's like saying 'Unpopular Opinion: I brush my teeth every day' in a dentristry sub\n\nWe've had a million don't ask for M&G 'fees' threads. SD's/SB's alike will also say that a gentleman will reimburse your travel costs but it doesn't necessarily need to be mentioned unless you'll be out of a lot of money.\n\nAlso, it wasn't anything special that you did OP, you were just lucky. For every girl who doesn't mention travel costs but gets them reimburses a few days later, I'm sure there are many more that get ghosted leaving them out of gas money *and* a SD. \n\nCongrats, but the preachy tone of your post is kinda weird and misplaced.",
            "author": "blonde-throwaway",
            "id": "e05e4cw",
            "parent_id": "t1_e05b377",
            "score": 35,
            "created_utc": 1528207169.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e05hwdb",
                    "parent_id": "t1_e05e4cw",
                    "score": 16,
                    "created_utc": 1528210751.0,
                    "replies": [
                        {
                            "body": ">  we talked for almost a WEEK before meeting and I never once mentioned anything about payment for meeting for coffee. \n\nIt has been known for that to happen and then immediately before the M&G she suddenly drops the payment for meeting bomb",
                            "author": null,
                            "id": "e05usv4",
                            "parent_id": "t1_e05hwdb",
                            "score": -2,
                            "created_utc": 1528222025.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> For every girl who doesn't mention travel costs but gets them reimburses a few days later, I'm sure there are many more that get ghosted leaving them out of gas money and a SD.\n\n\nIn my experience most guys wouldn't really think to offer if you don't bring it up so I've always brought it up because it wasn't uncommon for me to drive an hour each way to see them. Even then there's never guarantee they're gonna show up or that they'll stick to their word. \n\n\nThe whole \"don't ask for travel cost or anything else for the m&g\" shouldn't be prescriptive on this sub imo. You don't know how far an SB has to travel to see a pot and you don't really know if the dent in gas or time and effort from travel could hurt her budget for the month or not. Maybe she's giving up a 3-4 hour babysitting gig or she has to drive 50-80 miles each way. It's why I think it's *more* important focus on getting the background from these girls before giving any kind of advice rather than focusing on what they should or shouldn't do to get an SD interested.\n\n\nThen you'd get an SB coming in who's afraid of asking for any kind of compensation for traveling 2 hours to meet a pot. It's not even a hyperbole these have been legit questions in the past.  \n\n\nAs an SB with a stable career I can afford to do whatever I want and risk losing $50-100 and a chunk of my day. Someone who is struggling with keeping a job or who lives off of a stipend can't afford to indulge. ",
                    "author": "adequatelay",
                    "id": "e06swri",
                    "parent_id": "t1_e05e4cw",
                    "score": 12,
                    "created_utc": 1528254687.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This. \nExactly\n",
            "author": "sugbabythrowaway11",
            "id": "e05dd14",
            "parent_id": "t1_e05c3ew",
            "score": 12,
            "created_utc": 1528206405.0,
            "replies": []
        },
        {
            "body": "I would argue that as an ethical SD I should not be subject to a Dirtbag Tax on  M&G.  \n\nA little thought might generate the basis for some selectivity on the  Appearance Charge....   SD disclosed verifiable ID (a name you can find) .    \n\nClearly if the SB is doing most of the travel to the M&G she deserves something  and in all cases parking paid . \n\nHow many stores charge $40 to try on a pair of shoes  and yet the SD is just asking to look at the shoes close up...... \n",
            "author": "pinotandsugar",
            "id": "e064uh6",
            "parent_id": "t1_e05c3ew",
            "score": 4,
            "created_utc": 1528230719.0,
            "replies": [
                {
                    "body": "> ethical SD\n\n\nThat should be a flair option lmao",
                    "author": "adequatelay",
                    "id": "e06tw30",
                    "parent_id": "t1_e064uh6",
                    "score": 8,
                    "created_utc": 1528255799.0,
                    "replies": [
                        {
                            "body": "The problem ( as in real life outside the bowl) is that who claim to be ethical seldom are",
                            "author": "pinotandsugar",
                            "id": "e06zw4v",
                            "parent_id": "t1_e06tw30",
                            "score": 4,
                            "created_utc": 1528263480.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e089zjp",
                    "parent_id": "t1_e064uh6",
                    "score": 3,
                    "created_utc": 1528317611.0,
                    "replies": [
                        {
                            "body": "Personally I don't enjoy M&G as a hobby.  They are a necessary time suck of some pretty valuable time. \n\nThe \"thrill of someone out of his league?\"   no  the opportunity of two people to meet and discuss matters of common interest, appeal and benefit. \n\nOne could argue that the M&G is really a sales call where the customer pays . Actually I much prefer to pay for meals and such with prospective suppliers.  I don't want freebie meals and drinks but rather fresh ideas which address my client's projects. ",
                            "author": "pinotandsugar",
                            "id": "e08bku8",
                            "parent_id": "t1_e089zjp",
                            "score": 0,
                            "created_utc": 1528318991.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve met very well off sds who lowball me after 1-2 uncompensated m&gs. I met up with one 6 times then had to drop him like a sack of hot shit when he said $300/month. How do you only have $300/month budget when your family owns a castle in the Caribbean and you’re a lawyer (not public defender)??? I no longer do background checks to verify income- sds have such vast differences in budget despite what their income may imply.\n\nNow it’s $200 for coffee. I have enough social media crap flying around for sds to find out if they’re willing to give me good compensation. I work at a strip club- I make $400-2k/night. Why would I do a meet for $0 when the point of sds is to provide for sbs?\n\nFound 2 ltr with wealthy sds from my compensated m&gs. \n\nI’m also a different breed of sb, I’m way more stubborn and have more pride, but people pay for what they want.",
            "author": "saintkatelyn",
            "id": "e07ziam",
            "parent_id": "t1_e067csi",
            "score": 7,
            "created_utc": 1528308564.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "e08a4u6",
                    "parent_id": "t1_e07ziam",
                    "score": 5,
                    "created_utc": 1528317738.0,
                    "replies": [
                        {
                            "body": "I remember one joker seemed smart but oddly frugal. He told me he was in real estate but was very busy,  would it be ok if I helped him move some boxes for an older lady, promised it would be easy, said he could give me $60 for totally platonic legit light moving. We had a mutual friend so I assumed he was safe...\n\nStory was correct, nice elderly lady moving out needs a little help. I said I could help but they already had a team there so I didn’t do anything.\n\nHowever he was absolutely a terrible person (personality, smelled bad, etc) tried to invite me to his house (he lives with his parents which CAN be legit but seriously??) I asked him about the $60 and he got into a huff, said he didn’t even have cash with him!! He gave it to me through google pay eventually but BOY was that a joke! (His entire real estate businesses seem like slumlord type scenarios, too. The little old lady was bankrupt and was being forced to sell...)\n\nSome guys have money but I honestly don’t care unless they’re handing it to me! I’m VERY certain this guy had money but he obviously had some mental issues with being miserly, to the point where he doesn’t give a shit about the people HE gets money from. Barf.",
                            "author": "saintkatelyn",
                            "id": "e08d9uv",
                            "parent_id": "t1_e08a4u6",
                            "score": 6,
                            "created_utc": 1528320540.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Don’t ask for anything upfront; if it’s offered, accept gratefully. If you’re offered an allowance you’re happy with, accept it; negotiations lead to resentment. \n\nThat's what I thought the majority opinions was here too.  I was looking at that whole story as a glorious vindication of our hive mind :\\)  Glad it worked out, Ab",
            "author": "Azurecole",
            "id": "e05d6zn",
            "parent_id": "t1_e05a24n",
            "score": 1,
            "created_utc": 1528206231.0,
            "replies": []
        },
        {
            "body": "I don't see negotiations necessarily leading  to resentment although it happens. If there is resentment on either side it really best to just not proceed.  For the unscrupulous SD there's the temptation to agree and then one and done",
            "author": "pinotandsugar",
            "id": "e08m5lm",
            "parent_id": "t1_e05a24n",
            "score": 1,
            "created_utc": 1528329379.0,
            "replies": []
        },
        {
            "body": "Might be the majority, but the minority are loud.",
            "author": null,
            "id": "e05a50z",
            "parent_id": "t1_e05a24n",
            "score": -2,
            "created_utc": 1528202758.0,
            "replies": [
                {
                    "body": "Do we read the same forum...? 🤔",
                    "author": "depprat",
                    "id": "e05ea0v",
                    "parent_id": "t1_e05a50z",
                    "score": 4,
                    "created_utc": 1528207329.0,
                    "replies": [
                        {
                            "body": "I've been downvoted for saying I will cancel a m&g if she asks for compensation even though I added in the same comment that i will reimburse her for travel costs after she arrives.",
                            "author": "sexviewer",
                            "id": "e05f8lf",
                            "parent_id": "t1_e05ea0v",
                            "score": 2,
                            "created_utc": 1528208273.0,
                            "replies": [
                                {
                                    "body": "Do you tell her that you would reimburse her? That'd be the only way I would disagree with you really. ",
                                    "author": "adequatelay",
                                    "id": "e06s0pe",
                                    "parent_id": "t1_e05f8lf",
                                    "score": 9,
                                    "created_utc": 1528253694.0,
                                    "replies": [
                                        {
                                            "body": "If she asks to he compensated for her time I cancel no exceptions. If she asks to be reimbursed the $20 for an uber or gas if she has to drive a bit, or any other travel expenses I tell her I will do so when she arrives. I've never had anyone ask to be reimbursed for travel expenses though (I will offer/insist during the m&g though), and have had a number of girls ask to be reimbursed for her time.",
                                            "author": "sexviewer",
                                            "id": "e07pomk",
                                            "parent_id": "t1_e06s0pe",
                                            "score": -1,
                                            "created_utc": 1528300250.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That sentiment will be voted to the top of the thread by different people though. That's a very standard POV on SLF.\n\nMaybe it was your delivery idk?",
                                    "author": "depprat",
                                    "id": "e05fqnc",
                                    "parent_id": "t1_e05f8lf",
                                    "score": 10,
                                    "created_utc": 1528208760.0,
                                    "replies": [
                                        {
                                            "body": "Maybe. Could have been delivery, could have been the thread. I do know I was surprised.",
                                            "author": "sexviewer",
                                            "id": "e05g5ho",
                                            "parent_id": "t1_e05fqnc",
                                            "score": 1,
                                            "created_utc": 1528209149.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ah, I don’t listen to loud people. The louder they are; the less they have to say that’s worth my attention.\n\n\nSee also: Trump.",
                    "author": "FilmSD",
                    "id": "e05dci2",
                    "parent_id": "t1_e05a50z",
                    "score": 5,
                    "created_utc": 1528206388.0,
                    "replies": []
                },
                {
                    "body": "Wise words. I'd quip about him rubbing off on you already or you rubbing him off already, but it appears that neither is the case. The wisdom you've demonstrated thus far is your own. Own it. It'll take you far. Best wishes!",
                    "author": "sdthrowaway006",
                    "id": "e05agm8",
                    "parent_id": "t1_e05a50z",
                    "score": 1,
                    "created_utc": 1528203155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e05hwdb",
            "parent_id": "t1_e05e4cw",
            "score": 16,
            "created_utc": 1528210751.0,
            "replies": [
                {
                    "body": ">  we talked for almost a WEEK before meeting and I never once mentioned anything about payment for meeting for coffee. \n\nIt has been known for that to happen and then immediately before the M&G she suddenly drops the payment for meeting bomb",
                    "author": null,
                    "id": "e05usv4",
                    "parent_id": "t1_e05hwdb",
                    "score": -2,
                    "created_utc": 1528222025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> For every girl who doesn't mention travel costs but gets them reimburses a few days later, I'm sure there are many more that get ghosted leaving them out of gas money and a SD.\n\n\nIn my experience most guys wouldn't really think to offer if you don't bring it up so I've always brought it up because it wasn't uncommon for me to drive an hour each way to see them. Even then there's never guarantee they're gonna show up or that they'll stick to their word. \n\n\nThe whole \"don't ask for travel cost or anything else for the m&g\" shouldn't be prescriptive on this sub imo. You don't know how far an SB has to travel to see a pot and you don't really know if the dent in gas or time and effort from travel could hurt her budget for the month or not. Maybe she's giving up a 3-4 hour babysitting gig or she has to drive 50-80 miles each way. It's why I think it's *more* important focus on getting the background from these girls before giving any kind of advice rather than focusing on what they should or shouldn't do to get an SD interested.\n\n\nThen you'd get an SB coming in who's afraid of asking for any kind of compensation for traveling 2 hours to meet a pot. It's not even a hyperbole these have been legit questions in the past.  \n\n\nAs an SB with a stable career I can afford to do whatever I want and risk losing $50-100 and a chunk of my day. Someone who is struggling with keeping a job or who lives off of a stipend can't afford to indulge. ",
            "author": "adequatelay",
            "id": "e06swri",
            "parent_id": "t1_e05e4cw",
            "score": 12,
            "created_utc": 1528254687.0,
            "replies": []
        },
        {
            "body": "> ethical SD\n\n\nThat should be a flair option lmao",
            "author": "adequatelay",
            "id": "e06tw30",
            "parent_id": "t1_e064uh6",
            "score": 8,
            "created_utc": 1528255799.0,
            "replies": [
                {
                    "body": "The problem ( as in real life outside the bowl) is that who claim to be ethical seldom are",
                    "author": "pinotandsugar",
                    "id": "e06zw4v",
                    "parent_id": "t1_e06tw30",
                    "score": 4,
                    "created_utc": 1528263480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e089zjp",
            "parent_id": "t1_e064uh6",
            "score": 3,
            "created_utc": 1528317611.0,
            "replies": [
                {
                    "body": "Personally I don't enjoy M&G as a hobby.  They are a necessary time suck of some pretty valuable time. \n\nThe \"thrill of someone out of his league?\"   no  the opportunity of two people to meet and discuss matters of common interest, appeal and benefit. \n\nOne could argue that the M&G is really a sales call where the customer pays . Actually I much prefer to pay for meals and such with prospective suppliers.  I don't want freebie meals and drinks but rather fresh ideas which address my client's projects. ",
                    "author": "pinotandsugar",
                    "id": "e08bku8",
                    "parent_id": "t1_e089zjp",
                    "score": 0,
                    "created_utc": 1528318991.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "e08a4u6",
            "parent_id": "t1_e07ziam",
            "score": 5,
            "created_utc": 1528317738.0,
            "replies": [
                {
                    "body": "I remember one joker seemed smart but oddly frugal. He told me he was in real estate but was very busy,  would it be ok if I helped him move some boxes for an older lady, promised it would be easy, said he could give me $60 for totally platonic legit light moving. We had a mutual friend so I assumed he was safe...\n\nStory was correct, nice elderly lady moving out needs a little help. I said I could help but they already had a team there so I didn’t do anything.\n\nHowever he was absolutely a terrible person (personality, smelled bad, etc) tried to invite me to his house (he lives with his parents which CAN be legit but seriously??) I asked him about the $60 and he got into a huff, said he didn’t even have cash with him!! He gave it to me through google pay eventually but BOY was that a joke! (His entire real estate businesses seem like slumlord type scenarios, too. The little old lady was bankrupt and was being forced to sell...)\n\nSome guys have money but I honestly don’t care unless they’re handing it to me! I’m VERY certain this guy had money but he obviously had some mental issues with being miserly, to the point where he doesn’t give a shit about the people HE gets money from. Barf.",
                    "author": "saintkatelyn",
                    "id": "e08d9uv",
                    "parent_id": "t1_e08a4u6",
                    "score": 6,
                    "created_utc": 1528320540.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do we read the same forum...? 🤔",
            "author": "depprat",
            "id": "e05ea0v",
            "parent_id": "t1_e05a50z",
            "score": 4,
            "created_utc": 1528207329.0,
            "replies": [
                {
                    "body": "I've been downvoted for saying I will cancel a m&g if she asks for compensation even though I added in the same comment that i will reimburse her for travel costs after she arrives.",
                    "author": "sexviewer",
                    "id": "e05f8lf",
                    "parent_id": "t1_e05ea0v",
                    "score": 2,
                    "created_utc": 1528208273.0,
                    "replies": [
                        {
                            "body": "Do you tell her that you would reimburse her? That'd be the only way I would disagree with you really. ",
                            "author": "adequatelay",
                            "id": "e06s0pe",
                            "parent_id": "t1_e05f8lf",
                            "score": 9,
                            "created_utc": 1528253694.0,
                            "replies": [
                                {
                                    "body": "If she asks to he compensated for her time I cancel no exceptions. If she asks to be reimbursed the $20 for an uber or gas if she has to drive a bit, or any other travel expenses I tell her I will do so when she arrives. I've never had anyone ask to be reimbursed for travel expenses though (I will offer/insist during the m&g though), and have had a number of girls ask to be reimbursed for her time.",
                                    "author": "sexviewer",
                                    "id": "e07pomk",
                                    "parent_id": "t1_e06s0pe",
                                    "score": -1,
                                    "created_utc": 1528300250.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That sentiment will be voted to the top of the thread by different people though. That's a very standard POV on SLF.\n\nMaybe it was your delivery idk?",
                            "author": "depprat",
                            "id": "e05fqnc",
                            "parent_id": "t1_e05f8lf",
                            "score": 10,
                            "created_utc": 1528208760.0,
                            "replies": [
                                {
                                    "body": "Maybe. Could have been delivery, could have been the thread. I do know I was surprised.",
                                    "author": "sexviewer",
                                    "id": "e05g5ho",
                                    "parent_id": "t1_e05fqnc",
                                    "score": 1,
                                    "created_utc": 1528209149.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah, I don’t listen to loud people. The louder they are; the less they have to say that’s worth my attention.\n\n\nSee also: Trump.",
            "author": "FilmSD",
            "id": "e05dci2",
            "parent_id": "t1_e05a50z",
            "score": 5,
            "created_utc": 1528206388.0,
            "replies": []
        },
        {
            "body": "Wise words. I'd quip about him rubbing off on you already or you rubbing him off already, but it appears that neither is the case. The wisdom you've demonstrated thus far is your own. Own it. It'll take you far. Best wishes!",
            "author": "sdthrowaway006",
            "id": "e05agm8",
            "parent_id": "t1_e05a50z",
            "score": 1,
            "created_utc": 1528203155.0,
            "replies": []
        },
        {
            "body": ">  we talked for almost a WEEK before meeting and I never once mentioned anything about payment for meeting for coffee. \n\nIt has been known for that to happen and then immediately before the M&G she suddenly drops the payment for meeting bomb",
            "author": null,
            "id": "e05usv4",
            "parent_id": "t1_e05hwdb",
            "score": -2,
            "created_utc": 1528222025.0,
            "replies": []
        },
        {
            "body": "The problem ( as in real life outside the bowl) is that who claim to be ethical seldom are",
            "author": "pinotandsugar",
            "id": "e06zw4v",
            "parent_id": "t1_e06tw30",
            "score": 4,
            "created_utc": 1528263480.0,
            "replies": []
        },
        {
            "body": "Personally I don't enjoy M&G as a hobby.  They are a necessary time suck of some pretty valuable time. \n\nThe \"thrill of someone out of his league?\"   no  the opportunity of two people to meet and discuss matters of common interest, appeal and benefit. \n\nOne could argue that the M&G is really a sales call where the customer pays . Actually I much prefer to pay for meals and such with prospective suppliers.  I don't want freebie meals and drinks but rather fresh ideas which address my client's projects. ",
            "author": "pinotandsugar",
            "id": "e08bku8",
            "parent_id": "t1_e089zjp",
            "score": 0,
            "created_utc": 1528318991.0,
            "replies": []
        },
        {
            "body": "I remember one joker seemed smart but oddly frugal. He told me he was in real estate but was very busy,  would it be ok if I helped him move some boxes for an older lady, promised it would be easy, said he could give me $60 for totally platonic legit light moving. We had a mutual friend so I assumed he was safe...\n\nStory was correct, nice elderly lady moving out needs a little help. I said I could help but they already had a team there so I didn’t do anything.\n\nHowever he was absolutely a terrible person (personality, smelled bad, etc) tried to invite me to his house (he lives with his parents which CAN be legit but seriously??) I asked him about the $60 and he got into a huff, said he didn’t even have cash with him!! He gave it to me through google pay eventually but BOY was that a joke! (His entire real estate businesses seem like slumlord type scenarios, too. The little old lady was bankrupt and was being forced to sell...)\n\nSome guys have money but I honestly don’t care unless they’re handing it to me! I’m VERY certain this guy had money but he obviously had some mental issues with being miserly, to the point where he doesn’t give a shit about the people HE gets money from. Barf.",
            "author": "saintkatelyn",
            "id": "e08d9uv",
            "parent_id": "t1_e08a4u6",
            "score": 6,
            "created_utc": 1528320540.0,
            "replies": []
        },
        {
            "body": "I've been downvoted for saying I will cancel a m&g if she asks for compensation even though I added in the same comment that i will reimburse her for travel costs after she arrives.",
            "author": "sexviewer",
            "id": "e05f8lf",
            "parent_id": "t1_e05ea0v",
            "score": 2,
            "created_utc": 1528208273.0,
            "replies": [
                {
                    "body": "Do you tell her that you would reimburse her? That'd be the only way I would disagree with you really. ",
                    "author": "adequatelay",
                    "id": "e06s0pe",
                    "parent_id": "t1_e05f8lf",
                    "score": 9,
                    "created_utc": 1528253694.0,
                    "replies": [
                        {
                            "body": "If she asks to he compensated for her time I cancel no exceptions. If she asks to be reimbursed the $20 for an uber or gas if she has to drive a bit, or any other travel expenses I tell her I will do so when she arrives. I've never had anyone ask to be reimbursed for travel expenses though (I will offer/insist during the m&g though), and have had a number of girls ask to be reimbursed for her time.",
                            "author": "sexviewer",
                            "id": "e07pomk",
                            "parent_id": "t1_e06s0pe",
                            "score": -1,
                            "created_utc": 1528300250.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That sentiment will be voted to the top of the thread by different people though. That's a very standard POV on SLF.\n\nMaybe it was your delivery idk?",
                    "author": "depprat",
                    "id": "e05fqnc",
                    "parent_id": "t1_e05f8lf",
                    "score": 10,
                    "created_utc": 1528208760.0,
                    "replies": [
                        {
                            "body": "Maybe. Could have been delivery, could have been the thread. I do know I was surprised.",
                            "author": "sexviewer",
                            "id": "e05g5ho",
                            "parent_id": "t1_e05fqnc",
                            "score": 1,
                            "created_utc": 1528209149.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you tell her that you would reimburse her? That'd be the only way I would disagree with you really. ",
            "author": "adequatelay",
            "id": "e06s0pe",
            "parent_id": "t1_e05f8lf",
            "score": 9,
            "created_utc": 1528253694.0,
            "replies": [
                {
                    "body": "If she asks to he compensated for her time I cancel no exceptions. If she asks to be reimbursed the $20 for an uber or gas if she has to drive a bit, or any other travel expenses I tell her I will do so when she arrives. I've never had anyone ask to be reimbursed for travel expenses though (I will offer/insist during the m&g though), and have had a number of girls ask to be reimbursed for her time.",
                    "author": "sexviewer",
                    "id": "e07pomk",
                    "parent_id": "t1_e06s0pe",
                    "score": -1,
                    "created_utc": 1528300250.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That sentiment will be voted to the top of the thread by different people though. That's a very standard POV on SLF.\n\nMaybe it was your delivery idk?",
            "author": "depprat",
            "id": "e05fqnc",
            "parent_id": "t1_e05f8lf",
            "score": 10,
            "created_utc": 1528208760.0,
            "replies": [
                {
                    "body": "Maybe. Could have been delivery, could have been the thread. I do know I was surprised.",
                    "author": "sexviewer",
                    "id": "e05g5ho",
                    "parent_id": "t1_e05fqnc",
                    "score": 1,
                    "created_utc": 1528209149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If she asks to he compensated for her time I cancel no exceptions. If she asks to be reimbursed the $20 for an uber or gas if she has to drive a bit, or any other travel expenses I tell her I will do so when she arrives. I've never had anyone ask to be reimbursed for travel expenses though (I will offer/insist during the m&g though), and have had a number of girls ask to be reimbursed for her time.",
            "author": "sexviewer",
            "id": "e07pomk",
            "parent_id": "t1_e06s0pe",
            "score": -1,
            "created_utc": 1528300250.0,
            "replies": []
        },
        {
            "body": "Maybe. Could have been delivery, could have been the thread. I do know I was surprised.",
            "author": "sexviewer",
            "id": "e05g5ho",
            "parent_id": "t1_e05fqnc",
            "score": 1,
            "created_utc": 1528209149.0,
            "replies": []
        }
    ]
}