{
    "title": "Every time I remember how I look in profile I get depressed. Seeking advice, info in comments.",
    "post_id": "jgb5ar",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/jgb5ar/every_time_i_remember_how_i_look_in_profile_i_get/",
    "author": "Decadancer",
    "body": "",
    "url": "https://www.reddit.com/gallery/jgb5ar",
    "score": 295,
    "upvote_ratio": 0.95,
    "created_utc": 1603408982.0,
    "num_comments": 83,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "No advice, but your jawline is fucking insane dude!",
            "author": "whyismypenisinverted",
            "id": "g9pdyb8",
            "parent_id": "t3_jgb5ar",
            "score": 169,
            "created_utc": 1603410520.0,
            "replies": [
                {
                    "body": "Yes.",
                    "author": "Decadancer",
                    "id": "g9r8p0m",
                    "parent_id": "t1_g9pdyb8",
                    "score": 5,
                    "created_utc": 1603459680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a defined jaw and your face is an elongated oval. Most haircuts will look good on you. I'd avoid anything super short on the sides, it will make your head/ face look longer. Cutting it shorter could help you achieve some volume. The weight of your hair at this length might be flattening it. If it's shorter it will be more manageable to style and add volume.",
            "author": "fckthislifeandthenxt",
            "id": "g9pf2ia",
            "parent_id": "t3_jgb5ar",
            "score": 73,
            "created_utc": 1603411169.0,
            "replies": [
                {
                    "body": "I am definitely doing at least this. Thanks for your analysis!",
                    "author": "Decadancer",
                    "id": "g9r5p2t",
                    "parent_id": "t1_g9pf2ia",
                    "score": 6,
                    "created_utc": 1603457859.0,
                    "replies": [
                        {
                            "body": "Glad I could help!",
                            "author": "fckthislifeandthenxt",
                            "id": "g9r5r65",
                            "parent_id": "t1_g9r5p2t",
                            "score": 5,
                            "created_utc": 1603457897.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I personally think you rock the bun pretty well, and I don’t think there is anything wrong with your posture. If you wanted a change, I could see a messy fringe style work for you, as that would be pretty low maintenance. However, I don’t think you’d go wrong just rocking your current look.",
            "author": "sfc84",
            "id": "g9peq2g",
            "parent_id": "t3_jgb5ar",
            "score": 171,
            "created_utc": 1603410973.0,
            "replies": [
                {
                    "body": "I am so greatful for your kind words. Can messy fringe style be long on the back and sides?",
                    "author": "Decadancer",
                    "id": "g9r5mm3",
                    "parent_id": "t1_g9peq2g",
                    "score": 6,
                    "created_utc": 1603457815.0,
                    "replies": [
                        {
                            "body": "Yeah, you could definitely keep the sides and back a little longer. It would have to be a lot shorter then it is now, but you wouldn’t have to cut it as short as a fade or taper.",
                            "author": "sfc84",
                            "id": "g9rs3cf",
                            "parent_id": "t1_g9r5mm3",
                            "score": 1,
                            "created_utc": 1603469908.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "**Edit**\nI am very humbled and greatful for your kindness and all of the answers from you. Didn't expect such a positive and reassuring reaction from so many people for something that really bothered me for some time. I will try to change the outlook and be more confident in the way I think about myself. That is not to say that I won't try new things (will cut them a bit shorter for sure), change the maintenance and look for working out and general posture excercises. \n\nOnce again, thank you **SO MUCH**\n\nHi!\n\nI have been rocking hair about this long for 3-4 years. They don't really grow longer than shoulders plus I cut the ends maybe every 6-12 months. I wash and comb them regularly, more often than necessary even. Hair stay in a manbun most of the time even during the sleep, but I don't really like how it looks, especially from the sides. My fucked up neck posture doesn't help, too. Hair don't seem to have any volume at all in a manbun, and ponytail doesn't work, too.\n\nI love wearing the hair free but it is not very comfortable or handy, so it happens really rarely, mostly during concerts, on weekends or vacations. Last two pics are me on vacay for reference.\n\nWould love to change it a bit and be more confident in my haircut and general look, but really not sure if I would look good with a short cut, I have been growing it since 7 years ago, I think, and looked quite different back then. Ideally I would love a low-maintenance not flashy but stylish cut with medium-length hair, however, I am eager to hear your opinion and am interested in any suggestions, from dreadlocks to buzzcut.\n\naddinfo:I'm tall, lanky built, mostly wear casual office clothing, live in colder climate (will start wearing a hat in a month), can't grow a beard or a moustache.\n\nThanks in advance for your input.",
            "author": "Decadancer",
            "id": "g9pcwjz",
            "parent_id": "t3_jgb5ar",
            "score": 36,
            "created_utc": 1603409914.0,
            "replies": [
                {
                    "body": "You have a very unique & masculine face, so longer hair suits you really well. If you don't like the messiness from your buns, have you considered brushing your hair up into a bun instead of using your fingers? I have layered hair that gets weird on the sides when I pull it back, so I use a brush to get it all sleek and a toothbrush with a veeeery small amount of oil on it, if I need to. I also sleep with a little oil on right after showering to get shinier hair. That might relieve the problem! You can still rake it with your fingers to keep it looking messy ish, you should just brush it first. \n\nIf its because it makes your hair look thinner, I'd suggest gentler/softer hair ties. Those squiggly ones, I'm thinking they're called bobbles, scrunchies, lighter duty hair ties like yours. Tie your buns looser in general as well. If you want a bigger bun, tugging at the sides of it to fan it out is often a good solution, or not having such a long tail. I think it would look more balanced that way. \n\nIf you still want a different hairstyle, I still suggest something longer. You have a model face- look at their hair cuts for inspiration! Longer, messy hair seems to be a constant, but you can still have it shorter than yours. Think Chalamet. Also you don't look super fine haired to me- def not thick, but its got a shape and body. You might pull of a cut similar to his for straight hair. \n\nBut tbh, you look great status quo!",
                    "author": "takenoquestions",
                    "id": "g9pska4",
                    "parent_id": "t1_g9pcwjz",
                    "score": 18,
                    "created_utc": 1603418339.0,
                    "replies": [
                        {
                            "body": "PS. That \"bad posture\" is probably just masculine features competing with each other. Prominent jaw makes it look like your head is further front than it is, and the Adams apple is doing its own thing. I wouldn't call it bad posture, and its not a bad feature to have.",
                            "author": "takenoquestions",
                            "id": "g9pwx0z",
                            "parent_id": "t1_g9pska4",
                            "score": 6,
                            "created_utc": 1603420363.0,
                            "replies": [
                                {
                                    "body": "Thanks for your super detailed message and very interesting input.\n\nI do the bun differently from time to time - sometimes brushed, sometimes messy, with different ties, different height and volume. However, the main problem is that if I don't if I don't tie it quite strongly, it just tends to fall out quite fast. I think it happens because, like you said, they are not on the thicker side and compress easily under the pressure of the band. I'm just not sure it's possible to change that.\n\nHow much longer do you think? Not sure if they can go lower than shoulders. I kinda want to try the Chalamet one :D",
                                    "author": "Decadancer",
                                    "id": "g9r72bb",
                                    "parent_id": "t1_g9pwx0z",
                                    "score": 1,
                                    "created_utc": 1603458704.0,
                                    "replies": [
                                        {
                                            "body": "Of course! I'm big on facial aesthetics. Anyway, you're looking at either slippery hair or bad hair ties. Trying some texture products or a grippier tie might so you some favors- look online for hair that won't keep a style, lots of information on the subject. \n\nWhen I say \"longer\" I just mean that most models have longer hair than average, but you can definitely go shorter. Chamalet is usually a good choice for anyone with textured hair, but since yours is straight and thick, you could go with something on that vein. Hopefully that's helpful!",
                                            "author": "takenoquestions",
                                            "id": "g9smes6",
                                            "parent_id": "t1_g9r72bb",
                                            "score": 1,
                                            "created_utc": 1603484920.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "My thought is that you have fairly sharp facial characteristics that fit either long or short hair. \n\nPersonally I think most northern European's with long hair look best when the long hair is paired with a beard and would say go with the standard footballer cut everyone was going for a few years ago but that could be personal taste. [(E.g. Reus 2014 world cup)](https://www.google.com/search?q=reus+2014+world+cup&rlz=1C1CHBF_enUS761US761&oq=reus&aqs=chrome.0.69i59j69i57j0i20i263i433i457j0i433j0i20i263i433j0i433l3.938j0j4&sourceid=chrome&ie=UTF-8)\n\nBest advice is to be confident overall and take that confidence from your other aspects. You're good looking enough, your posture isn't as bad as you think, etc., the most important part is just to be comfortable and the easiest way to be comfortable is to show off your humor, listening skills, etc.",
                    "author": "Unitedterror",
                    "id": "g9piv0y",
                    "parent_id": "t1_g9pcwjz",
                    "score": 2,
                    "created_utc": 1603413323.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uh you’re a good looking dude.",
            "author": "alpha358",
            "id": "g9po8c0",
            "parent_id": "t3_jgb5ar",
            "score": 48,
            "created_utc": 1603416244.0,
            "replies": []
        },
        {
            "body": "Looks good to me 🤷‍♂️",
            "author": "DecentMate",
            "id": "g9pmuue",
            "parent_id": "t3_jgb5ar",
            "score": 10,
            "created_utc": 1603415533.0,
            "replies": []
        },
        {
            "body": "i think you look great man, i’m jealous of the hair! keep it up!",
            "author": "ungobingbing",
            "id": "g9prgwc",
            "parent_id": "t3_jgb5ar",
            "score": 7,
            "created_utc": 1603417822.0,
            "replies": []
        },
        {
            "body": "bro I’d sacrifice my left nut for your side profile",
            "author": null,
            "id": "g9q2176",
            "parent_id": "t3_jgb5ar",
            "score": 7,
            "created_utc": 1603423030.0,
            "replies": []
        },
        {
            "body": "Pony tail suits you 100%. \n\nLong hair you look like a guy that do drugs",
            "author": null,
            "id": "g9prk3c",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603417866.0,
            "replies": []
        },
        {
            "body": "You should keep it!  Looks great tbh!  Also, that jawline is insane!",
            "author": "parodg15",
            "id": "g9pzleq",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603421718.0,
            "replies": []
        },
        {
            "body": "Bro I think you look great! Sorry you can get depressed about it but I think you have a really good look.",
            "author": "supergreekman123",
            "id": "g9q0qp4",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603422328.0,
            "replies": []
        },
        {
            "body": "Personally I think the manbun looks cool on you and there isn’t really anything wrong with your side profile. Keep doing you, man",
            "author": "lemonade_brezhnev",
            "id": "g9q1ixi",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603422751.0,
            "replies": []
        },
        {
            "body": "Ummm...I don’t see the issue. Hair is killer and your jawline could cut stone.",
            "author": "Mrminecrafthimself",
            "id": "g9r7ijy",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603458975.0,
            "replies": []
        },
        {
            "body": "I'm trying to achieve this exact hairstyle. How long did it take you and did you get it cut at all?",
            "author": "Parzival_48",
            "id": "g9r81s7",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603459294.0,
            "replies": [
                {
                    "body": "I think it took me 2 years to get to a point where I could do a small bun. That is from quite a short cut. It was 5-6 years ago. From then on I cut them from time to time, but not often, maybe once a year. Nothing fancy, too, just the ends, 5-10 cms, to make it at least a bit more accurate. Longest was about on clavicle, shortest - a bit longer than ears, but always so that I could do a bun just for the practical side of it",
                    "author": "Decadancer",
                    "id": "g9r951o",
                    "parent_id": "t1_g9r81s7",
                    "score": 3,
                    "created_utc": 1603459938.0,
                    "replies": [
                        {
                            "body": "Thanks for the tips! Ive actually been trimming it up and my barber just took a lot off because the top of my head isnt growing as fast the sides so its leading to an awkward bit of flow. Was that a good idea? My hair is now pretty short on the sides and back but i can still put my hair in a little top bun. The plan is for the bun to move further back as everything grows back out. Did you avoid any and all haircuts and just deal with the awkward phase?",
                            "author": "Parzival_48",
                            "id": "g9r9ewb",
                            "parent_id": "t1_g9r951o",
                            "score": 1,
                            "created_utc": 1603460103.0,
                            "replies": [
                                {
                                    "body": "I think most of the folks do it this way, and it tends to work one way or another. Keep up with the plan\n\nMe though? I just straight up didn't cut my hair for 2 years. I knew I looked like a complete dork, but persisted. At that point of my life I didn't really care what others thought of me, what I wore until it was clean and how I looked in general. Fun times eh\n\n(Actually now that I think of it, there was a bet not to cut hair until graduation, and I just kept going on after)",
                                    "author": "Decadancer",
                                    "id": "g9r9tsk",
                                    "parent_id": "t1_g9r9ewb",
                                    "score": 2,
                                    "created_utc": 1603460344.0,
                                    "replies": [
                                        {
                                            "body": "Maybe the haircut was a mistake then🙃\n\nEither way ill just keep growing the top until it gets there and then decide from there. Thanks for the advice man",
                                            "author": "Parzival_48",
                                            "id": "g9ra02h",
                                            "parent_id": "t1_g9r9tsk",
                                            "score": 1,
                                            "created_utc": 1603460443.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think you look good champ",
            "author": "whereisfrank",
            "id": "g9rc0a1",
            "parent_id": "t3_jgb5ar",
            "score": 3,
            "created_utc": 1603461566.0,
            "replies": []
        },
        {
            "body": "Is your hair really fine? Mine goes super flat super fast. What I found to help was to actually shampoo more often than I was. I condition only the bottom and don’t let it get on my scalp. would also recommend having it dry after a shower with a towel wrap, where you flip your hair forward then wrap it in the towel and get that fancy flip back so you can wear it for a little bit. This will help get more lift at the root. You can also try some products, like mousse, and fluff a little bit into the root working from the back to front. \nYou have wonderful hair! And a nice face!  \nI do think you’d look great with shorter hair with longer bangs and a messy top.",
            "author": null,
            "id": "g9pjb7p",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603413581.0,
            "replies": [
                {
                    "body": "Hey, I actually think my hair become flat because I, on the opposite, shampoo too often, maybe 5 times a week, sometimes with conditioning, sometimes with hair mask. Recently started using some special oil after toweling, it helps somewhat. I will definitely try your tips, thanks for your kindness!",
                    "author": "Decadancer",
                    "id": "g9r2nsh",
                    "parent_id": "t1_g9pjb7p",
                    "score": 2,
                    "created_utc": 1603455823.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I had long hair I’d do a lower bun which you can have the hair at the front tuck behind the ears or something, let’s it have a bit more movement",
            "author": "rhyst13",
            "id": "g9pwsx9",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603420310.0,
            "replies": []
        },
        {
            "body": "I dont know man, but that in that 7th picture you look cool af.",
            "author": "sporvath",
            "id": "g9q7g80",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603426289.0,
            "replies": [
                {
                    "body": "Thanks! Man, it just works differently on vacation, so less stress and so much more natural confidence in everything",
                    "author": "Decadancer",
                    "id": "g9rae30",
                    "parent_id": "t1_g9q7g80",
                    "score": 2,
                    "created_utc": 1603460661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hair looks good. If you’re upset with how you look from profile I recommend working out your upper back. It will pull your shoulders and neck back and upright a little tighter. It’s not an extreme example but it’s similar to what you see when the upper body is underdeveloped or the pecs are imbalanced with the back.",
            "author": "Hmm_would_bang",
            "id": "g9q8wew",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603427284.0,
            "replies": [
                {
                    "body": "This is a very intersting input, I really need to strengthen my whole back. Thanks!",
                    "author": "Decadancer",
                    "id": "g9r3c3l",
                    "parent_id": "t1_g9q8wew",
                    "score": 1,
                    "created_utc": 1603456295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "bruh you are fine, the manbun looks good. Just build some self confidence and keep doing what you are doing cause you look bomb.com",
            "author": "HearthstoneConTester",
            "id": "g9q9ajt",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603427562.0,
            "replies": [
                {
                    "body": "**I found links in your comment that were not hyperlinked:**\n\n* [bomb.com](https://bomb.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20g9q9ajt&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3",
                    "author": "LinkifyBot",
                    "id": "g9q9b3e",
                    "parent_id": "t1_g9q9ajt",
                    "score": 1,
                    "created_utc": 1603427573.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why dude, you're fine lmao",
            "author": "FluffMcBuff",
            "id": "g9q9cdf",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603427599.0,
            "replies": []
        },
        {
            "body": "Depressed why??? You're handsome",
            "author": null,
            "id": "g9q9udb",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603427965.0,
            "replies": []
        },
        {
            "body": "Don't mean to sound dismissive to your feelings but I'm not really sure what the problem is. You're a good looking dude and I think your hair looks fantastic. I actually thought this was posted in r/FierceFlow at first, then got confused when I noticed the subreddit.",
            "author": "raf-owens",
            "id": "g9qiyq4",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603435833.0,
            "replies": []
        },
        {
            "body": "You look alright to me pal",
            "author": "mkypzyo",
            "id": "g9qkejp",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603437288.0,
            "replies": []
        },
        {
            "body": "You look fine bruh, just nurture the waves.",
            "author": "ThreeOverFour",
            "id": "g9qlbq5",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603438261.0,
            "replies": []
        },
        {
            "body": "I think the long hair fits you well personally.",
            "author": "bayboykriss",
            "id": "g9qm3qm",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603439102.0,
            "replies": []
        },
        {
            "body": "I think you’re cute and I love the long hair.",
            "author": "earthdweller11",
            "id": "g9qmmk3",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603439681.0,
            "replies": []
        },
        {
            "body": "Honestly u look badass dude",
            "author": "TR3G1",
            "id": "g9qn2vt",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603440191.0,
            "replies": []
        },
        {
            "body": "I wanna look like u bro holy shit",
            "author": null,
            "id": "g9qn4a1",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603440236.0,
            "replies": []
        },
        {
            "body": "Your profile is gorgeous.",
            "author": "Vegandigimongender",
            "id": "g9qolwg",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603441959.0,
            "replies": []
        },
        {
            "body": "it's in your head dude. You look like a model and there is literally nothing wrong with you or your profile",
            "author": "kankouillotte",
            "id": "g9qp0eb",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603442441.0,
            "replies": []
        },
        {
            "body": "Mate, be kinder to yourself. You look fantastic, profile and all.  And I'll tell you this right now from an older tall lanky dude - you might see the lanky but chicks just see the tall.",
            "author": "dddavyyy",
            "id": "g9qpj5z",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603443064.0,
            "replies": []
        },
        {
            "body": "Why dude? Excellent hair, great skull shape, great face, plus the smoulder. You're handsome bro and be proud of your uniqueness",
            "author": "merkust",
            "id": "g9qsrql",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603446895.0,
            "replies": []
        },
        {
            "body": "Word of advice. Convidence comes from within, from what you are doing and what you achieve. Be active think about what you are doing, why you are doing it and where it will get you. You also look great.. But it doesnt matter, even some of the best looking struggle with convidence and depression. Meanwhile some people who arent exactly 10/10 are super convident and overachieve in life. It's your own choice  keep looking at your profile and pictures of other people or start living in the real world.",
            "author": "BetaCarotine20mg",
            "id": "g9qtg09",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603447586.0,
            "replies": []
        },
        {
            "body": "The Lost brother of Willy tybur",
            "author": "paxauror",
            "id": "g9qtpy9",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603447870.0,
            "replies": []
        },
        {
            "body": "Smile.",
            "author": "klit1234",
            "id": "g9qwcz3",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603450578.0,
            "replies": []
        },
        {
            "body": "You legit look like me, at least in your profile shot, not so much from the front, you even have the scar I have on my cheek in the same place :O\n\nHow old are you currently? I'm 24 and I've got your hairline. It sucks but I've come to live with it. Been receding since about 14.",
            "author": "Komsur",
            "id": "g9qwpug",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603450924.0,
            "replies": [
                {
                    "body": "hahaha 23, hi, brother from another mother\n\nI'm not even sure if it receeded or always used to be this way, one day I just noticed it's kinda high but even-dispersed.\n\nDo you think unnecessary tight bun can be the reason of the recession?",
                    "author": "Decadancer",
                    "id": "g9r16y1",
                    "parent_id": "t1_g9qwpug",
                    "score": 1,
                    "created_utc": 1603454749.0,
                    "replies": [
                        {
                            "body": "It certainly won't help, it puts stress on your hair by pulling it back, same goes for all sorts of putting your hair up. I don't wear my hair in a manbun, or at least I didn't before I cut it short in July, but I know from having to look smart on occasion that I could feel the strain.\n\nHonestly though, I think you're golden at the moment, what you have it very thick and it doesn't lay flat on your head like mine does. Also, that 7th picture is serious fire. Go for that style and you'll be able to rock it for a few years at least. \n\nWe both have high hairlines, so short styles will make them look higher (trust me, I made that mistake when I cut it as I just said, growing back now haha).\n\nTLDR; you're doing great, your hair looks fantastic at the moment personally, much better than mine did. Keep it like that and check back in a few years and see where your hairline is at.",
                            "author": "Komsur",
                            "id": "g9r49h9",
                            "parent_id": "t1_g9r16y1",
                            "score": 2,
                            "created_utc": 1603456927.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude, you look like you could be Jason Mewes' kid. Just slap on a black beanie and BAM, Jay and Silent Bob time; you just need a friend that looks like Kevin Smith. Rad.",
            "author": "SFAwesomeSauce",
            "id": "g9r23zv",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603455429.0,
            "replies": [
                {
                    "body": "Rollin fatties, smokin blunts. Whos smokes blunts? We smoke blunts. Rollin blunts and smokin...",
                    "author": "Decadancer",
                    "id": "g9r80f6",
                    "parent_id": "t1_g9r23zv",
                    "score": 2,
                    "created_utc": 1603459273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re a handsome dude. Don’t beat yourself up. \n\nI personally think you’d look great with a short haircut long on top with some flow. \n\nBut if you wanna keep the length just keep rockin it. You look good dude don’t worry",
            "author": "AstronautGuy42",
            "id": "g9r3743",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603456200.0,
            "replies": []
        },
        {
            "body": "I dig the bun",
            "author": "pony1108",
            "id": "g9rap8u",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603460834.0,
            "replies": []
        },
        {
            "body": "No hair advice from me, but you look good. The posture is definitely noticeable and it’s the one deciding factor when it comes to how you look from the side, if you do regular neck and posture stretching and exercise you can easily work up to an 8/10 without changing anything else. I know it’s hard, I also have terrible posture but eventually it gets to a point when your posture is bad even when you try to stand as straight as possible because your back and neck muscles just aren’t used to it. Stretching the ligaments of your neck also helps, don’t want to shill but AthleanX has a good video on how to slowly fix this issue over time. Honestly, if you manage to fix this, you’ll easily be a chad among men, and you get to keep your hairstyle because it’s only going to complement your straight back and neck",
            "author": "Deezebee",
            "id": "g9rhqk4",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603464677.0,
            "replies": []
        },
        {
            "body": "Lol you’re looking good. Are those green eyes I see? Treasure them my man. Lucky mofo.",
            "author": "SeaBreezyRL",
            "id": "g9svow5",
            "parent_id": "t3_jgb5ar",
            "score": 2,
            "created_utc": 1603488428.0,
            "replies": []
        },
        {
            "body": "The high hairline/high natural recession is an issue for men because men don't really have the option to do stylish bangs with long hair. Honestly, short hair is going to make your natural recession seem less noticeable.",
            "author": "CherokeeSurprise",
            "id": "g9pjsf4",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603413848.0,
            "replies": []
        },
        {
            "body": "I think you'd look really good with some [texture](https://www.google.com/search?q=mens+long+textured+haircut+for+thin+hair&tbm=isch&ved=2ahUKEwjg5pOuzMnsAhVHS60KHaMsBGEQ2-cCegQIABAB&oq=mens+long+textured+haircut+for+thin+hair&gs_lcp=ChJtb2JpbGUtZ3dzLXdpei1pbWcQAzIFCAAQzQIyBQgAEM0CMgUIABDNAjoCCAA6BAghEApQ0RtYoStgijVoAHAAeACAAY4HiAG6DpIBCTAuNC4xLjYtMZgBAKABAcABAQ&sclient=mobile-gws-wiz-img&ei=WDaSX-DaMseWtQWj2ZCIBg&bih=520&biw=360&client=ms-android-virgin-us&prmd=ivsn), which you can still rock even if your hair is on the thinner side.",
            "author": "drunky_crowette",
            "id": "g9prf0v",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603417800.0,
            "replies": []
        },
        {
            "body": "no point in worrying about it m8, live your life. you look fine",
            "author": "Stevanous",
            "id": "g9pxcev",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603420568.0,
            "replies": []
        },
        {
            "body": "Your profiles pretty good bro. Maybe a chin implant or sliding genio if you wanted to but not a necessary",
            "author": "Spikempv",
            "id": "g9q9jjj",
            "parent_id": "t3_jgb5ar",
            "score": -1,
            "created_utc": 1603427745.0,
            "replies": []
        },
        {
            "body": "Dude you kinda remind me of Robby from Cobra Kai",
            "author": "Gearsofwar3mastr45_2",
            "id": "g9pu7yc",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603419115.0,
            "replies": []
        },
        {
            "body": "I'd kill for your jawline btw",
            "author": "Today_Either",
            "id": "g9pv3z3",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603419541.0,
            "replies": []
        },
        {
            "body": "Man bun looks better than open hair. However, you can go get some layers cut into them if you like to keep them open. Your’e being too critical of yourself. That manly jawline is something we don’t see so often.",
            "author": "kali883",
            "id": "g9px9q8",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603420533.0,
            "replies": []
        },
        {
            "body": "Didn’t notice anything with the hairline until I saw which sub this was on",
            "author": "Calxb",
            "id": "g9q1c4a",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603422650.0,
            "replies": []
        },
        {
            "body": "You have nothing to worry about, you look amazing. Great hair complimenting strong facial features.",
            "author": "Glogbag1",
            "id": "g9q1esq",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603422690.0,
            "replies": []
        },
        {
            "body": "WTF men, You look very Nice.",
            "author": "Reywhereareyou",
            "id": "g9q24gm",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603423081.0,
            "replies": []
        },
        {
            "body": "lol we have the exact same hair, you have a great facial structure tho so learn to love it",
            "author": "s433p",
            "id": "g9q48kx",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603424254.0,
            "replies": []
        },
        {
            "body": "Nah man you look dope as hell",
            "author": null,
            "id": "g9q6j0r",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603425670.0,
            "replies": []
        },
        {
            "body": "Uhh your side profile is incredible",
            "author": null,
            "id": "g9q840z",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603426732.0,
            "replies": []
        },
        {
            "body": "Learn you way around styling + styling products\n\nhttps://youtu.be/PNE42YCh4Ls\n\nplenty of good sources out there to learn from.",
            "author": "thecatalyst11",
            "id": "g9qzjfb",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603453436.0,
            "replies": []
        },
        {
            "body": "Your profile is fine I wouldn't worry about it. My advice is, smile.",
            "author": null,
            "id": "g9rcm2g",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603461908.0,
            "replies": []
        },
        {
            "body": "First thing get in the habit of holding your head over your shoulders. You’ll look good and feel more confident. Protruding you’re neck out like that is a hard habit to break but is so worth it! Recently had to do the same.",
            "author": "Mau4_20",
            "id": "ga8jkw5",
            "parent_id": "t3_jgb5ar",
            "score": 1,
            "created_utc": 1603767727.0,
            "replies": [
                {
                    "body": "Any tips on tgat? When I try to move it back, it's only the head that moves, and not the neck",
                    "author": "Decadancer",
                    "id": "gaeox0c",
                    "parent_id": "t1_ga8jkw5",
                    "score": 1,
                    "created_utc": 1603910257.0,
                    "replies": [
                        {
                            "body": "> Any tips on tgat? When I try to move it back, it's only the head that moves, and not the neck\nSorry for the late reply. Its just a habit you have to form. When you're walking or standing just try and keep your hips, shoulders, and ears linear with one another. Eventually it will just become natural and will feel off if they're not aligned.",
                            "author": "Mau4_20",
                            "id": "gcqhwgk",
                            "parent_id": "t1_gaeox0c",
                            "score": 1,
                            "created_utc": 1605719420.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes.",
            "author": "Decadancer",
            "id": "g9r8p0m",
            "parent_id": "t1_g9pdyb8",
            "score": 5,
            "created_utc": 1603459680.0,
            "replies": []
        },
        {
            "body": "I am definitely doing at least this. Thanks for your analysis!",
            "author": "Decadancer",
            "id": "g9r5p2t",
            "parent_id": "t1_g9pf2ia",
            "score": 6,
            "created_utc": 1603457859.0,
            "replies": [
                {
                    "body": "Glad I could help!",
                    "author": "fckthislifeandthenxt",
                    "id": "g9r5r65",
                    "parent_id": "t1_g9r5p2t",
                    "score": 5,
                    "created_utc": 1603457897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so greatful for your kind words. Can messy fringe style be long on the back and sides?",
            "author": "Decadancer",
            "id": "g9r5mm3",
            "parent_id": "t1_g9peq2g",
            "score": 6,
            "created_utc": 1603457815.0,
            "replies": [
                {
                    "body": "Yeah, you could definitely keep the sides and back a little longer. It would have to be a lot shorter then it is now, but you wouldn’t have to cut it as short as a fade or taper.",
                    "author": "sfc84",
                    "id": "g9rs3cf",
                    "parent_id": "t1_g9r5mm3",
                    "score": 1,
                    "created_utc": 1603469908.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a very unique & masculine face, so longer hair suits you really well. If you don't like the messiness from your buns, have you considered brushing your hair up into a bun instead of using your fingers? I have layered hair that gets weird on the sides when I pull it back, so I use a brush to get it all sleek and a toothbrush with a veeeery small amount of oil on it, if I need to. I also sleep with a little oil on right after showering to get shinier hair. That might relieve the problem! You can still rake it with your fingers to keep it looking messy ish, you should just brush it first. \n\nIf its because it makes your hair look thinner, I'd suggest gentler/softer hair ties. Those squiggly ones, I'm thinking they're called bobbles, scrunchies, lighter duty hair ties like yours. Tie your buns looser in general as well. If you want a bigger bun, tugging at the sides of it to fan it out is often a good solution, or not having such a long tail. I think it would look more balanced that way. \n\nIf you still want a different hairstyle, I still suggest something longer. You have a model face- look at their hair cuts for inspiration! Longer, messy hair seems to be a constant, but you can still have it shorter than yours. Think Chalamet. Also you don't look super fine haired to me- def not thick, but its got a shape and body. You might pull of a cut similar to his for straight hair. \n\nBut tbh, you look great status quo!",
            "author": "takenoquestions",
            "id": "g9pska4",
            "parent_id": "t1_g9pcwjz",
            "score": 18,
            "created_utc": 1603418339.0,
            "replies": [
                {
                    "body": "PS. That \"bad posture\" is probably just masculine features competing with each other. Prominent jaw makes it look like your head is further front than it is, and the Adams apple is doing its own thing. I wouldn't call it bad posture, and its not a bad feature to have.",
                    "author": "takenoquestions",
                    "id": "g9pwx0z",
                    "parent_id": "t1_g9pska4",
                    "score": 6,
                    "created_utc": 1603420363.0,
                    "replies": [
                        {
                            "body": "Thanks for your super detailed message and very interesting input.\n\nI do the bun differently from time to time - sometimes brushed, sometimes messy, with different ties, different height and volume. However, the main problem is that if I don't if I don't tie it quite strongly, it just tends to fall out quite fast. I think it happens because, like you said, they are not on the thicker side and compress easily under the pressure of the band. I'm just not sure it's possible to change that.\n\nHow much longer do you think? Not sure if they can go lower than shoulders. I kinda want to try the Chalamet one :D",
                            "author": "Decadancer",
                            "id": "g9r72bb",
                            "parent_id": "t1_g9pwx0z",
                            "score": 1,
                            "created_utc": 1603458704.0,
                            "replies": [
                                {
                                    "body": "Of course! I'm big on facial aesthetics. Anyway, you're looking at either slippery hair or bad hair ties. Trying some texture products or a grippier tie might so you some favors- look online for hair that won't keep a style, lots of information on the subject. \n\nWhen I say \"longer\" I just mean that most models have longer hair than average, but you can definitely go shorter. Chamalet is usually a good choice for anyone with textured hair, but since yours is straight and thick, you could go with something on that vein. Hopefully that's helpful!",
                                    "author": "takenoquestions",
                                    "id": "g9smes6",
                                    "parent_id": "t1_g9r72bb",
                                    "score": 1,
                                    "created_utc": 1603484920.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thought is that you have fairly sharp facial characteristics that fit either long or short hair. \n\nPersonally I think most northern European's with long hair look best when the long hair is paired with a beard and would say go with the standard footballer cut everyone was going for a few years ago but that could be personal taste. [(E.g. Reus 2014 world cup)](https://www.google.com/search?q=reus+2014+world+cup&rlz=1C1CHBF_enUS761US761&oq=reus&aqs=chrome.0.69i59j69i57j0i20i263i433i457j0i433j0i20i263i433j0i433l3.938j0j4&sourceid=chrome&ie=UTF-8)\n\nBest advice is to be confident overall and take that confidence from your other aspects. You're good looking enough, your posture isn't as bad as you think, etc., the most important part is just to be comfortable and the easiest way to be comfortable is to show off your humor, listening skills, etc.",
            "author": "Unitedterror",
            "id": "g9piv0y",
            "parent_id": "t1_g9pcwjz",
            "score": 2,
            "created_utc": 1603413323.0,
            "replies": []
        },
        {
            "body": "I think it took me 2 years to get to a point where I could do a small bun. That is from quite a short cut. It was 5-6 years ago. From then on I cut them from time to time, but not often, maybe once a year. Nothing fancy, too, just the ends, 5-10 cms, to make it at least a bit more accurate. Longest was about on clavicle, shortest - a bit longer than ears, but always so that I could do a bun just for the practical side of it",
            "author": "Decadancer",
            "id": "g9r951o",
            "parent_id": "t1_g9r81s7",
            "score": 3,
            "created_utc": 1603459938.0,
            "replies": [
                {
                    "body": "Thanks for the tips! Ive actually been trimming it up and my barber just took a lot off because the top of my head isnt growing as fast the sides so its leading to an awkward bit of flow. Was that a good idea? My hair is now pretty short on the sides and back but i can still put my hair in a little top bun. The plan is for the bun to move further back as everything grows back out. Did you avoid any and all haircuts and just deal with the awkward phase?",
                    "author": "Parzival_48",
                    "id": "g9r9ewb",
                    "parent_id": "t1_g9r951o",
                    "score": 1,
                    "created_utc": 1603460103.0,
                    "replies": [
                        {
                            "body": "I think most of the folks do it this way, and it tends to work one way or another. Keep up with the plan\n\nMe though? I just straight up didn't cut my hair for 2 years. I knew I looked like a complete dork, but persisted. At that point of my life I didn't really care what others thought of me, what I wore until it was clean and how I looked in general. Fun times eh\n\n(Actually now that I think of it, there was a bet not to cut hair until graduation, and I just kept going on after)",
                            "author": "Decadancer",
                            "id": "g9r9tsk",
                            "parent_id": "t1_g9r9ewb",
                            "score": 2,
                            "created_utc": 1603460344.0,
                            "replies": [
                                {
                                    "body": "Maybe the haircut was a mistake then🙃\n\nEither way ill just keep growing the top until it gets there and then decide from there. Thanks for the advice man",
                                    "author": "Parzival_48",
                                    "id": "g9ra02h",
                                    "parent_id": "t1_g9r9tsk",
                                    "score": 1,
                                    "created_utc": 1603460443.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hey, I actually think my hair become flat because I, on the opposite, shampoo too often, maybe 5 times a week, sometimes with conditioning, sometimes with hair mask. Recently started using some special oil after toweling, it helps somewhat. I will definitely try your tips, thanks for your kindness!",
            "author": "Decadancer",
            "id": "g9r2nsh",
            "parent_id": "t1_g9pjb7p",
            "score": 2,
            "created_utc": 1603455823.0,
            "replies": []
        },
        {
            "body": "Thanks! Man, it just works differently on vacation, so less stress and so much more natural confidence in everything",
            "author": "Decadancer",
            "id": "g9rae30",
            "parent_id": "t1_g9q7g80",
            "score": 2,
            "created_utc": 1603460661.0,
            "replies": []
        },
        {
            "body": "This is a very intersting input, I really need to strengthen my whole back. Thanks!",
            "author": "Decadancer",
            "id": "g9r3c3l",
            "parent_id": "t1_g9q8wew",
            "score": 1,
            "created_utc": 1603456295.0,
            "replies": []
        },
        {
            "body": "**I found links in your comment that were not hyperlinked:**\n\n* [bomb.com](https://bomb.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20g9q9ajt&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3",
            "author": "LinkifyBot",
            "id": "g9q9b3e",
            "parent_id": "t1_g9q9ajt",
            "score": 1,
            "created_utc": 1603427573.0,
            "replies": []
        },
        {
            "body": "hahaha 23, hi, brother from another mother\n\nI'm not even sure if it receeded or always used to be this way, one day I just noticed it's kinda high but even-dispersed.\n\nDo you think unnecessary tight bun can be the reason of the recession?",
            "author": "Decadancer",
            "id": "g9r16y1",
            "parent_id": "t1_g9qwpug",
            "score": 1,
            "created_utc": 1603454749.0,
            "replies": [
                {
                    "body": "It certainly won't help, it puts stress on your hair by pulling it back, same goes for all sorts of putting your hair up. I don't wear my hair in a manbun, or at least I didn't before I cut it short in July, but I know from having to look smart on occasion that I could feel the strain.\n\nHonestly though, I think you're golden at the moment, what you have it very thick and it doesn't lay flat on your head like mine does. Also, that 7th picture is serious fire. Go for that style and you'll be able to rock it for a few years at least. \n\nWe both have high hairlines, so short styles will make them look higher (trust me, I made that mistake when I cut it as I just said, growing back now haha).\n\nTLDR; you're doing great, your hair looks fantastic at the moment personally, much better than mine did. Keep it like that and check back in a few years and see where your hairline is at.",
                    "author": "Komsur",
                    "id": "g9r49h9",
                    "parent_id": "t1_g9r16y1",
                    "score": 2,
                    "created_utc": 1603456927.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rollin fatties, smokin blunts. Whos smokes blunts? We smoke blunts. Rollin blunts and smokin...",
            "author": "Decadancer",
            "id": "g9r80f6",
            "parent_id": "t1_g9r23zv",
            "score": 2,
            "created_utc": 1603459273.0,
            "replies": []
        },
        {
            "body": "Any tips on tgat? When I try to move it back, it's only the head that moves, and not the neck",
            "author": "Decadancer",
            "id": "gaeox0c",
            "parent_id": "t1_ga8jkw5",
            "score": 1,
            "created_utc": 1603910257.0,
            "replies": [
                {
                    "body": "> Any tips on tgat? When I try to move it back, it's only the head that moves, and not the neck\nSorry for the late reply. Its just a habit you have to form. When you're walking or standing just try and keep your hips, shoulders, and ears linear with one another. Eventually it will just become natural and will feel off if they're not aligned.",
                    "author": "Mau4_20",
                    "id": "gcqhwgk",
                    "parent_id": "t1_gaeox0c",
                    "score": 1,
                    "created_utc": 1605719420.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Glad I could help!",
            "author": "fckthislifeandthenxt",
            "id": "g9r5r65",
            "parent_id": "t1_g9r5p2t",
            "score": 5,
            "created_utc": 1603457897.0,
            "replies": []
        },
        {
            "body": "Yeah, you could definitely keep the sides and back a little longer. It would have to be a lot shorter then it is now, but you wouldn’t have to cut it as short as a fade or taper.",
            "author": "sfc84",
            "id": "g9rs3cf",
            "parent_id": "t1_g9r5mm3",
            "score": 1,
            "created_utc": 1603469908.0,
            "replies": []
        },
        {
            "body": "PS. That \"bad posture\" is probably just masculine features competing with each other. Prominent jaw makes it look like your head is further front than it is, and the Adams apple is doing its own thing. I wouldn't call it bad posture, and its not a bad feature to have.",
            "author": "takenoquestions",
            "id": "g9pwx0z",
            "parent_id": "t1_g9pska4",
            "score": 6,
            "created_utc": 1603420363.0,
            "replies": [
                {
                    "body": "Thanks for your super detailed message and very interesting input.\n\nI do the bun differently from time to time - sometimes brushed, sometimes messy, with different ties, different height and volume. However, the main problem is that if I don't if I don't tie it quite strongly, it just tends to fall out quite fast. I think it happens because, like you said, they are not on the thicker side and compress easily under the pressure of the band. I'm just not sure it's possible to change that.\n\nHow much longer do you think? Not sure if they can go lower than shoulders. I kinda want to try the Chalamet one :D",
                    "author": "Decadancer",
                    "id": "g9r72bb",
                    "parent_id": "t1_g9pwx0z",
                    "score": 1,
                    "created_utc": 1603458704.0,
                    "replies": [
                        {
                            "body": "Of course! I'm big on facial aesthetics. Anyway, you're looking at either slippery hair or bad hair ties. Trying some texture products or a grippier tie might so you some favors- look online for hair that won't keep a style, lots of information on the subject. \n\nWhen I say \"longer\" I just mean that most models have longer hair than average, but you can definitely go shorter. Chamalet is usually a good choice for anyone with textured hair, but since yours is straight and thick, you could go with something on that vein. Hopefully that's helpful!",
                            "author": "takenoquestions",
                            "id": "g9smes6",
                            "parent_id": "t1_g9r72bb",
                            "score": 1,
                            "created_utc": 1603484920.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the tips! Ive actually been trimming it up and my barber just took a lot off because the top of my head isnt growing as fast the sides so its leading to an awkward bit of flow. Was that a good idea? My hair is now pretty short on the sides and back but i can still put my hair in a little top bun. The plan is for the bun to move further back as everything grows back out. Did you avoid any and all haircuts and just deal with the awkward phase?",
            "author": "Parzival_48",
            "id": "g9r9ewb",
            "parent_id": "t1_g9r951o",
            "score": 1,
            "created_utc": 1603460103.0,
            "replies": [
                {
                    "body": "I think most of the folks do it this way, and it tends to work one way or another. Keep up with the plan\n\nMe though? I just straight up didn't cut my hair for 2 years. I knew I looked like a complete dork, but persisted. At that point of my life I didn't really care what others thought of me, what I wore until it was clean and how I looked in general. Fun times eh\n\n(Actually now that I think of it, there was a bet not to cut hair until graduation, and I just kept going on after)",
                    "author": "Decadancer",
                    "id": "g9r9tsk",
                    "parent_id": "t1_g9r9ewb",
                    "score": 2,
                    "created_utc": 1603460344.0,
                    "replies": [
                        {
                            "body": "Maybe the haircut was a mistake then🙃\n\nEither way ill just keep growing the top until it gets there and then decide from there. Thanks for the advice man",
                            "author": "Parzival_48",
                            "id": "g9ra02h",
                            "parent_id": "t1_g9r9tsk",
                            "score": 1,
                            "created_utc": 1603460443.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It certainly won't help, it puts stress on your hair by pulling it back, same goes for all sorts of putting your hair up. I don't wear my hair in a manbun, or at least I didn't before I cut it short in July, but I know from having to look smart on occasion that I could feel the strain.\n\nHonestly though, I think you're golden at the moment, what you have it very thick and it doesn't lay flat on your head like mine does. Also, that 7th picture is serious fire. Go for that style and you'll be able to rock it for a few years at least. \n\nWe both have high hairlines, so short styles will make them look higher (trust me, I made that mistake when I cut it as I just said, growing back now haha).\n\nTLDR; you're doing great, your hair looks fantastic at the moment personally, much better than mine did. Keep it like that and check back in a few years and see where your hairline is at.",
            "author": "Komsur",
            "id": "g9r49h9",
            "parent_id": "t1_g9r16y1",
            "score": 2,
            "created_utc": 1603456927.0,
            "replies": []
        },
        {
            "body": "> Any tips on tgat? When I try to move it back, it's only the head that moves, and not the neck\nSorry for the late reply. Its just a habit you have to form. When you're walking or standing just try and keep your hips, shoulders, and ears linear with one another. Eventually it will just become natural and will feel off if they're not aligned.",
            "author": "Mau4_20",
            "id": "gcqhwgk",
            "parent_id": "t1_gaeox0c",
            "score": 1,
            "created_utc": 1605719420.0,
            "replies": []
        },
        {
            "body": "Thanks for your super detailed message and very interesting input.\n\nI do the bun differently from time to time - sometimes brushed, sometimes messy, with different ties, different height and volume. However, the main problem is that if I don't if I don't tie it quite strongly, it just tends to fall out quite fast. I think it happens because, like you said, they are not on the thicker side and compress easily under the pressure of the band. I'm just not sure it's possible to change that.\n\nHow much longer do you think? Not sure if they can go lower than shoulders. I kinda want to try the Chalamet one :D",
            "author": "Decadancer",
            "id": "g9r72bb",
            "parent_id": "t1_g9pwx0z",
            "score": 1,
            "created_utc": 1603458704.0,
            "replies": [
                {
                    "body": "Of course! I'm big on facial aesthetics. Anyway, you're looking at either slippery hair or bad hair ties. Trying some texture products or a grippier tie might so you some favors- look online for hair that won't keep a style, lots of information on the subject. \n\nWhen I say \"longer\" I just mean that most models have longer hair than average, but you can definitely go shorter. Chamalet is usually a good choice for anyone with textured hair, but since yours is straight and thick, you could go with something on that vein. Hopefully that's helpful!",
                    "author": "takenoquestions",
                    "id": "g9smes6",
                    "parent_id": "t1_g9r72bb",
                    "score": 1,
                    "created_utc": 1603484920.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think most of the folks do it this way, and it tends to work one way or another. Keep up with the plan\n\nMe though? I just straight up didn't cut my hair for 2 years. I knew I looked like a complete dork, but persisted. At that point of my life I didn't really care what others thought of me, what I wore until it was clean and how I looked in general. Fun times eh\n\n(Actually now that I think of it, there was a bet not to cut hair until graduation, and I just kept going on after)",
            "author": "Decadancer",
            "id": "g9r9tsk",
            "parent_id": "t1_g9r9ewb",
            "score": 2,
            "created_utc": 1603460344.0,
            "replies": [
                {
                    "body": "Maybe the haircut was a mistake then🙃\n\nEither way ill just keep growing the top until it gets there and then decide from there. Thanks for the advice man",
                    "author": "Parzival_48",
                    "id": "g9ra02h",
                    "parent_id": "t1_g9r9tsk",
                    "score": 1,
                    "created_utc": 1603460443.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Of course! I'm big on facial aesthetics. Anyway, you're looking at either slippery hair or bad hair ties. Trying some texture products or a grippier tie might so you some favors- look online for hair that won't keep a style, lots of information on the subject. \n\nWhen I say \"longer\" I just mean that most models have longer hair than average, but you can definitely go shorter. Chamalet is usually a good choice for anyone with textured hair, but since yours is straight and thick, you could go with something on that vein. Hopefully that's helpful!",
            "author": "takenoquestions",
            "id": "g9smes6",
            "parent_id": "t1_g9r72bb",
            "score": 1,
            "created_utc": 1603484920.0,
            "replies": []
        },
        {
            "body": "Maybe the haircut was a mistake then🙃\n\nEither way ill just keep growing the top until it gets there and then decide from there. Thanks for the advice man",
            "author": "Parzival_48",
            "id": "g9ra02h",
            "parent_id": "t1_g9r9tsk",
            "score": 1,
            "created_utc": 1603460443.0,
            "replies": []
        }
    ]
}