{
    "title": "SB was in a serious accident. What to do about allowance.",
    "post_id": "ojppds",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ojppds/sb_was_in_a_serious_accident_what_to_do_about/",
    "author": "tommypillows",
    "body": "SB has broken both her legs and her jaw in a car accident.  I’m not sure how to handle the allowance.  She’s great.  Lives near my work and host.  Allowance is reasonable.  It would be difficult to find another that offers everything she does.  Not sure how long it will be before things are back to normal for us.  Any thoughts on how to handle the allowance.  I’ve broached the subject.  She asked if I wanted to adjust it.  I would like to help.  Not knowing how long she will be in recovery makes it a difficult decision.\n\nI’ve known her 6 weeks.\n\nEdit:  Thanks so much for all the thoughtful responses that helped me gain perspective.  It’s clear the right thing to do is pay her allowance.  In the end I won’t miss the money and I will have done the right thing to help someone out regardless of the outcome.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ojppds/sb_was_in_a_serious_accident_what_to_do_about/",
    "score": 122,
    "upvote_ratio": 0.91,
    "created_utc": 1626212489.0,
    "num_comments": 141,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "That's awful. \n\nI'm not sure what you're looking for here. If it were me and I cared about the person, I'd probably continue supporting her during this difficult time. \n\nI'm sure it would mean a lot to her and the relationship.",
            "author": "Samtaton",
            "id": "h5331s7",
            "parent_id": "t3_ojppds",
            "score": 139,
            "created_utc": 1626212799.0,
            "replies": [
                {
                    "body": "It really is terrible for her.  Thanks for recognizing that.  I just want others opinion on what they might do",
                    "author": "tommypillows",
                    "id": "h5338zb",
                    "parent_id": "t1_h5331s7",
                    "score": 51,
                    "created_utc": 1626212895.0,
                    "replies": [
                        {
                            "body": "It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.",
                            "author": null,
                            "id": "h53aii9",
                            "parent_id": "t1_h5338zb",
                            "score": 27,
                            "created_utc": 1626216447.0,
                            "replies": [
                                {
                                    "body": "He literally said that it would be difficult to find someone like her and he's willing to help. I think he should help as long as he wants but has no obligation to keep helping forever.",
                                    "author": "vitor-a",
                                    "id": "h53m3nk",
                                    "parent_id": "t1_h53aii9",
                                    "score": 50,
                                    "created_utc": 1626222504.0,
                                    "replies": []
                                },
                                {
                                    "body": "And that’s the very reason why I personally wouldn’t continue supporting her. Maybe give her a month’s allowance as a gift, but then go about my way.",
                                    "author": null,
                                    "id": "h53iihe",
                                    "parent_id": "t1_h53aii9",
                                    "score": -11,
                                    "created_utc": 1626220610.0,
                                    "replies": [
                                        {
                                            "body": ">It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.\n\nThis is a valid point that the OP needs to carefully consider.",
                                            "author": "2020Traveller",
                                            "id": "h53lnxi",
                                            "parent_id": "t1_h53iihe",
                                            "score": 0,
                                            "created_utc": 1626222276.0,
                                            "replies": [
                                                {
                                                    "body": "I think it’s a little different situation for her.  She couldn’t weather the storm quite as well as I can",
                                                    "author": "tommypillows",
                                                    "id": "h540ksf",
                                                    "parent_id": "t1_h53lnxi",
                                                    "score": 25,
                                                    "created_utc": 1626230198.0,
                                                    "replies": [
                                                        {
                                                            "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
                                                            "author": "Yourstruly0",
                                                            "id": "h546cs2",
                                                            "parent_id": "t1_h540ksf",
                                                            "score": 36,
                                                            "created_utc": 1626233527.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Bingo !!! Agree 300 percent.",
                                    "author": null,
                                    "id": "h54zcur",
                                    "parent_id": "t1_h53aii9",
                                    "score": -2,
                                    "created_utc": 1626256880.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's not a relationship only 6 weeks and people cate about themselves.",
                    "author": null,
                    "id": "h54zb70",
                    "parent_id": "t1_h5331s7",
                    "score": 0,
                    "created_utc": 1626256840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"\"In the end I won’t miss the money and I will have done the right thing to help someone out regardless of the outcome.\"\"\"\n\nLife seldom offers an opportunity with a more assured positive outcome regardless of the relationship outcome.",
            "author": "pinotandsugar",
            "id": "h53inop",
            "parent_id": "t3_ojppds",
            "score": 131,
            "created_utc": 1626220688.0,
            "replies": [
                {
                    "body": "Over the course of the last 18 months I am sure many of us have helped hundreds of people who ended up being impacted by one adversity or another due to the pandemic. Along those lines I agree one must help a fellow human in need. But to frame that help as an ongoing allowance is an overkill especially for a six week sugar relationship IMHO.",
                    "author": null,
                    "id": "h55bsrk",
                    "parent_id": "t1_h53inop",
                    "score": 5,
                    "created_utc": 1626266172.0,
                    "replies": [
                        {
                            "body": "\"In the end I won't miss the money\"   puts it into perspective",
                            "author": "pinotandsugar",
                            "id": "h55h2ah",
                            "parent_id": "t1_h55bsrk",
                            "score": 12,
                            "created_utc": 1626269154.0,
                            "replies": [
                                {
                                    "body": "Money is never the issue! It goes but often comes back. The principle, the time and opportunity cost is where it’s all at.",
                                    "author": null,
                                    "id": "h56s21y",
                                    "parent_id": "t1_h55h2ah",
                                    "score": 0,
                                    "created_utc": 1626290305.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Think of it as she's being sent to the farm (repair)  club for spring training ......",
                            "author": "pinotandsugar",
                            "id": "h578jzi",
                            "parent_id": "t1_h55bsrk",
                            "score": 1,
                            "created_utc": 1626297656.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What a money comment",
                    "author": "401kisfun",
                    "id": "h56dofi",
                    "parent_id": "t1_h53inop",
                    "score": 2,
                    "created_utc": 1626283907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d likely keep the full allowance going while she’s in recovery. This is especially true if I’ve known her for more than a few months. \n\nHelp her out if you can.",
            "author": "Juicer9200",
            "id": "h5333jy",
            "parent_id": "t3_ojppds",
            "score": 56,
            "created_utc": 1626212823.0,
            "replies": [
                {
                    "body": "Thanks for the advice.  I’ve only known her for a about 6 weeks but I do care for her and want to help out.",
                    "author": "tommypillows",
                    "id": "h533ggx",
                    "parent_id": "t1_h5333jy",
                    "score": 21,
                    "created_utc": 1626212992.0,
                    "replies": [
                        {
                            "body": "I see your edit at the top, but just to add perspective - I knew my former SD about 4-6 weeks before NYC shut down for the pandemic. He continued to pay my allowance through Sept and if he ever appeared in my life again, I would drop everything to help him if he needed it. He single-handedly kept me afloat with a reasonable allowance and I just... I'd go to bat for him in every non sexual way possible, that's how thankful I am.\n\nI tried to convey the scope of my gratitude but am not sure if he realizes the difference he made. Anyway. Support in hard times means the world. Thank you, on her behalf, for being an exceptional person.",
                            "author": "secretactorian",
                            "id": "h53stkc",
                            "parent_id": "t1_h533ggx",
                            "score": 64,
                            "created_utc": 1626226010.0,
                            "replies": [
                                {
                                    "body": "I'm confused. So the two of you didn't see each other at all in person all through the pandemic? Why?\n\nWould you go to bat for him in sexual ways?",
                                    "author": "CreampieCoupleLA",
                                    "id": "h54buv6",
                                    "parent_id": "t1_h53stkc",
                                    "score": 2,
                                    "created_utc": 1626237009.0,
                                    "replies": [
                                        {
                                            "body": "Not sure what there is to be confused about.\n\n1. He has 2 young kids, lives in PA. He didn’t want to risk it. Not everyone was comfortable with it, you know. \n\n2. Ok jeez, you got me, that was just poor phrasing. I'm no longer in the bowl so i wouldn't resume seeing him is what I meant.",
                                            "author": "secretactorian",
                                            "id": "h54w2jb",
                                            "parent_id": "t1_h54buv6",
                                            "score": 10,
                                            "created_utc": 1626253836.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Six weeks is kind of short.  It depends on how you feel things were going, and if you were planning on making it long term.  If yes, then continuing allowance (full or reduced is up to you) while she recuperates would be kind and generous.  Ultimately it’s up to you.",
                            "author": "throwawayrdu71",
                            "id": "h538scb",
                            "parent_id": "t1_h533ggx",
                            "score": 7,
                            "created_utc": 1626215584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like she's been good to you. Karma is knocking at your door - answer the call!",
            "author": "Cledaddy23",
            "id": "h53o100",
            "parent_id": "t3_ojppds",
            "score": 35,
            "created_utc": 1626223504.0,
            "replies": [
                {
                    "body": "Good to him in 6 weeks ??",
                    "author": null,
                    "id": "h54zewj",
                    "parent_id": "t1_h53o100",
                    "score": -9,
                    "created_utc": 1626256931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h533dyq",
            "parent_id": "t3_ojppds",
            "score": 68,
            "created_utc": 1626212960.0,
            "replies": [
                {
                    "body": "Thanks for your opinion.  I’m not at all suggesting I want to completely stop the allowance.  My main concern is how long the recovery will be",
                    "author": "tommypillows",
                    "id": "h533ppu",
                    "parent_id": "t1_h533dyq",
                    "score": 11,
                    "created_utc": 1626213112.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h5344ld",
                            "parent_id": "t1_h533ppu",
                            "score": 21,
                            "created_utc": 1626213308.0,
                            "replies": [
                                {
                                    "body": "By \"intimacy\" you mean sex, right?\n\nThey may still be able to have some form of sexual activity as she is recovering.",
                                    "author": "CreampieCoupleLA",
                                    "id": "h54bzcn",
                                    "parent_id": "t1_h5344ld",
                                    "score": 4,
                                    "created_utc": 1626237091.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I know you don't expect a payment every meet right? You do actually like spending time and being intimate with me outside of money right? Are you saying the ONLY reason you are hanging out with me and being intimate is to get paid? I'm really hurt. I thought you actually liked me.  See how ridiculous this sounds.",
                    "author": "dade_murphy1",
                    "id": "h551q3f",
                    "parent_id": "t1_h533dyq",
                    "score": 3,
                    "created_utc": 1626258926.0,
                    "replies": []
                },
                {
                    "body": "Let’s turn the tables and see…So if your SD lost his job and couldn’t provide an allowance while he looked for another, knowing full well for his profession that it would probably be 2-4 months at least before he found another position (a good rough estimate on how long 2 broken legs will take…but likely even longer) and you had only known him for 6 weeks…would you still go see him and be intimate with him? Because if not, well that would suggest your only in it for the money - and that would make him feel like absolute shit.\n\nDo you understand the SD perspective now?",
                    "author": "Overwatch61",
                    "id": "h54dvfg",
                    "parent_id": "t1_h533dyq",
                    "score": 2,
                    "created_utc": 1626238385.0,
                    "replies": [
                        {
                            "body": "We all know the answer to this question, and it's definitely a different one than she is advocating to the OP.",
                            "author": "storm170",
                            "id": "h54hzip",
                            "parent_id": "t1_h54dvfg",
                            "score": 11,
                            "created_utc": 1626241417.0,
                            "replies": [
                                {
                                    "body": "Of course we do, I’m just tired of the shitty double standard if I’m being honest.",
                                    "author": "Overwatch61",
                                    "id": "h54oetv",
                                    "parent_id": "t1_h54hzip",
                                    "score": 3,
                                    "created_utc": 1626246796.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "this was an awesome response!!! SBs will drop you in a second if they find a better allowance, and they won't give a damn. But suddenly all the SB's out there are mother theresas!!! 😂",
                            "author": "MiLocavida",
                            "id": "h555x3l",
                            "parent_id": "t1_h54dvfg",
                            "score": 1,
                            "created_utc": 1626262260.0,
                            "replies": [
                                {
                                    "body": "> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nWill they?\n\nI've been sugaring for over 5 years now.  I've never had an SR end / SB leave, because they got a higher allowance somewhere else.\n\nTo be clear - I'm not claiming I provide a high amount.  It would likely be more on the average/splenda side, depending on how you look at it.\n\nBut I do provide a consistent amount.  Which is seems like many of the PPM guys here do not.",
                                    "author": "SDstartingOut",
                                    "id": "h55gnh1",
                                    "parent_id": "t1_h555x3l",
                                    "score": 4,
                                    "created_utc": 1626268932.0,
                                    "replies": [
                                        {
                                            "body": ">To be clear - I'm not claiming I provide a high amount.   It would likely be more on the average/splenda side,\n\nthat's your answer...plenty of SB's who can get higher allowances, and the rules of supply and demand apply in the bowl. Some SBs are desired by many SDs.",
                                            "author": "MiLocavida",
                                            "id": "h5603f0",
                                            "parent_id": "t1_h55gnh1",
                                            "score": 1,
                                            "created_utc": 1626278012.0,
                                            "replies": [
                                                {
                                                    "body": "> that's your answer..\n\nBut that's my whole point.\n\nI've never had an SB \"leave\" me for another SD.  With the exception of 2 situations (SB flaked/ghosted after 1 intimate date) - I have ended every single one of my SRs.",
                                                    "author": "SDstartingOut",
                                                    "id": "h567u0m",
                                                    "parent_id": "t1_h5603f0",
                                                    "score": 1,
                                                    "created_utc": 1626281360.0,
                                                    "replies": [
                                                        {
                                                            "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
                                                            "author": "MiLocavida",
                                                            "id": "h56aizi",
                                                            "parent_id": "t1_h567u0m",
                                                            "score": 1,
                                                            "created_utc": 1626282520.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
                                                            "author": "CreampieCoupleLA",
                                                            "id": "h59f52d",
                                                            "parent_id": "t1_h567u0m",
                                                            "score": 1,
                                                            "created_utc": 1626346614.0,
                                                            "replies": [
                                                                {
                                                                    "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                                                                    "author": "SDstartingOut",
                                                                    "id": "h59kkjt",
                                                                    "parent_id": "t1_h59f52d",
                                                                    "score": 1,
                                                                    "created_utc": 1626350435.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Incorrect analogy. We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job",
                                            "author": "401kisfun",
                                            "id": "h57bjuj",
                                            "parent_id": "t1_h55gnh1",
                                            "score": 1,
                                            "created_utc": 1626299039.0,
                                            "replies": [
                                                {
                                                    "body": "There is nothing incorrect about it.  I was replying to a specific comment that stated \" SBs will drop you in a second if they find a better allowance\".  And I stand behind my statement.  \n\n> We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job\n\nI have to say, this commentary is typically baffling to me.  Specifically that - 2 months would be the end of the world.  Just like an SD that supposedly can't provide a given allowance/ppm due \"cash flow issues\".  I wouldn't be sugaring - if I didn't have a year's worth of living expenses sitting on the sidelines.  .",
                                                    "author": "SDstartingOut",
                                                    "id": "h59le59",
                                                    "parent_id": "t1_h57bjuj",
                                                    "score": 1,
                                                    "created_utc": 1626350961.0,
                                                    "replies": [
                                                        {
                                                            "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
                                                            "author": "401kisfun",
                                                            "id": "h5a0s8x",
                                                            "parent_id": "t1_h59le59",
                                                            "score": 1,
                                                            "created_utc": 1626358892.0,
                                                            "replies": [
                                                                {
                                                                    "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                                                                    "author": "SDstartingOut",
                                                                    "id": "h5a3tpw",
                                                                    "parent_id": "t1_h5a0s8x",
                                                                    "score": 1,
                                                                    "created_utc": 1626360253.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The question is directed at an SB",
                                                                            "author": "401kisfun",
                                                                            "id": "h5a3wv1",
                                                                            "parent_id": "t1_h5a3tpw",
                                                                            "score": 1,
                                                                            "created_utc": 1626360291.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "The only thing that beats the response is all the downvotes from the salty SBs hahahaha. Gotta love women pushing for double standards amidst the biggest female equality movement of our generation lol. Oh the irony 😂",
                                    "author": "Overwatch61",
                                    "id": "h557wgu",
                                    "parent_id": "t1_h555x3l",
                                    "score": -1,
                                    "created_utc": 1626263661.0,
                                    "replies": [
                                        {
                                            "body": ">amidst the biggest female equality movement of our generation\n\nbetter keep it on the down low or you might get canceled! 😂",
                                            "author": "MiLocavida",
                                            "id": "h55bp1c",
                                            "parent_id": "t1_h557wgu",
                                            "score": -1,
                                            "created_utc": 1626266111.0,
                                            "replies": [
                                                {
                                                    "body": "Oh god, the younger generations lingo genuinely makes me cringe haha. I can only assume my parents felt the same way about the things I said growing up though.",
                                                    "author": "Overwatch61",
                                                    "id": "h56iuds",
                                                    "parent_id": "t1_h55bp1c",
                                                    "score": 0,
                                                    "created_utc": 1626286170.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Assuming the allowance is a drop in the bucket compared to your income, I would simply continue it for the sake of being a decent person and recognizing something happened out of her control.\n\nAt the same time, be mentally prepared to WRITE OFF the money because things like this often result in people re-evaluating their lives and its possible she might not want to do this anymore after she recovers.",
            "author": "vince539839",
            "id": "h537gq8",
            "parent_id": "t3_ojppds",
            "score": 17,
            "created_utc": 1626214930.0,
            "replies": []
        },
        {
            "body": "I moved to college and stopped seeing my SD, that I had previously seen weekly for ppm. When I went to college far away, some bad things had happened to me and we couldn't see one another. This is when he started giving me a weekly allowance. It went on for maybe 2 years til I graduated. I value him so, so, so much for being there for me during that time. Its more than just financial looking back, I value him so much. He is a really *really* good person that saved me. He didnt get anything in return besides watching me do okay. Just an experience of mine, that reminded me of yours. He did this because he cared about me.",
            "author": "suriservshumnty",
            "id": "h537c01",
            "parent_id": "t3_ojppds",
            "score": 22,
            "created_utc": 1626214865.0,
            "replies": [
                {
                    "body": "Did you end up staying with this guy? I would never ever do this for someone i am not in contact with anymore no matter what good times we had. This is not something i’d consider sweet or anything to admire at all.",
                    "author": "401kisfun",
                    "id": "h58ax2k",
                    "parent_id": "t1_h537c01",
                    "score": 1,
                    "created_utc": 1626317095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It speaks well of you that you say in your edit that you’ve come to the conclusion to keep supporting her. Regardless of the outcome, you’re doing a good thing.",
            "author": null,
            "id": "h53b7e9",
            "parent_id": "t3_ojppds",
            "score": 21,
            "created_utc": 1626216800.0,
            "replies": [
                {
                    "body": "Thank you for saying that.  I think I just needed to hear the advice.  Sometimes the bowl can make us callous.",
                    "author": "tommypillows",
                    "id": "h53cfaq",
                    "parent_id": "t1_h53b7e9",
                    "score": 13,
                    "created_utc": 1626217419.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h53vi3l",
                            "parent_id": "t1_h53cfaq",
                            "score": 10,
                            "created_utc": 1626227434.0,
                            "replies": [
                                {
                                    "body": "People seem to be forgetting this girl is an actual person. If I had the means to without suffering I would help her out simply because I know that support could very literally change the trajectory of her life at this point. This is an event that will likely mark a before/after point in her personal history. Someone having her back during this could change whether this accident spells tragedy for her.",
                                    "author": "Yourstruly0",
                                    "id": "h5474gy",
                                    "parent_id": "t1_h53vi3l",
                                    "score": 8,
                                    "created_utc": 1626233994.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Not sure how long it will be before things are back to normal for us.\n\nBased on your other replies, this seems to be your biggest unknown, and the reason you're posting here.  And it's a reasonable question.  Given this, one possible response is: \"right now I just want you to get healthy, let's keep the allowance next month, we can worry about it in September if it comes to that\".  If you want to  buy yourself some wiggle room due to the uncertainty, this is the way to do it.  Without question, I would not even hear of lowering allowance at this point, even at her suggestion.  If we were on PPM, I'd find ways to support her.\n\nI agree with everyone saying \"don't just drop allowance on an SB whose presence in your life you value\".  I would also note that, pretty much 100% of the time, if an SB comes on here and says, \"my SD says he's going through a hard time and would like to lower the allowance for a little while\", the responses are nothing but outrage and \"block that loser\".   It's worth being aware that your generosity may not be met by similar generosity if the situation reverses.  That doesn't change my answer one bit, but it's good to realize the expectations are asymmetric.",
            "author": "Azurecole",
            "id": "h536bcl",
            "parent_id": "t3_ojppds",
            "score": 20,
            "created_utc": 1626214369.0,
            "replies": [
                {
                    "body": "Once again, you took the words out of my mouth.\n\nYes it is a double standard world.\n\nHowever, I rather be an SD than a SB.\n\nI rather be out of pocket for some money that I don't really miss, than have to be at the other end.\n\nThis is a tough call for op. \n\nI had been with my current SB for only a few months. But if the same thing happens to her (touch wood), chances are I will keep the PPM going.",
                    "author": "eurosd",
                    "id": "h537eci",
                    "parent_id": "t1_h536bcl",
                    "score": 16,
                    "created_utc": 1626214897.0,
                    "replies": [
                        {
                            "body": "Agree.  Like I said, knowing this doesn't change my answer one bit.  \n\nI do, however, take the remarks of those who claim \"if you don't do X you're **not a real SD**\" with more than a grain of salt -- do it because it's the right thing to do in the context of your SR and how you value your SB in your life, not because someone is playing the \"real SD\" card, especially since so many of these *someones* are so fast on the trigger with \"dump that loser\" when things are reversed.",
                            "author": "Azurecole",
                            "id": "h53874q",
                            "parent_id": "t1_h537eci",
                            "score": 10,
                            "created_utc": 1626215291.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h5375yp",
                    "parent_id": "t1_h536bcl",
                    "score": -1,
                    "created_utc": 1626214785.0,
                    "replies": [
                        {
                            "body": "Well in general sd’s have more resources \nThan say a sb majority of them are broke af and some of them are snobbish and have rich dads back home.",
                            "author": null,
                            "id": "h53os7o",
                            "parent_id": "t1_h5375yp",
                            "score": 5,
                            "created_utc": 1626223898.0,
                            "replies": [
                                {
                                    "body": "Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it. \n\nThat’s like telling a SB, sleeping with a SD while he’s financially hurting isn’t going to cost her anything because she has an unlimited amount of pussy she can give out to her partners & it isn’t going to hurt her because she has more pussy then he does and she can still sleep with other people",
                                    "author": null,
                                    "id": "h55ch8o",
                                    "parent_id": "t1_h53os7o",
                                    "score": -1,
                                    "created_utc": 1626266581.0,
                                    "replies": [
                                        {
                                            "body": "It is an actual statistic that men are more likely to leave their female partner was she to be hit with some major health issues. With cancer this ratio is 1:6. This is without the bowl.\n\nI understand 'in the bow' you're in a quasi relationship. If you do not wish to keep the emphasis on 'transactional' but on emotional, would you answer still be the same?\n\nI notice that the SR has similarities to 19050s (and prior) power dynamics within a marriage where the man was the provider and the female essentially a servant who had to be grateful for being provided for. That view is still not outdated in many parts of the world.\n\n&#x200B;\n\n>Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it.\n\nThis is pretty much that outdated world view. If in a (sugar) relationship you can't have the empathy to continue supporting your SB, do you even qualify as a SD or are you just using a glorified escort service?\n\nSure, I also read plenty of women advising others to dump a SD who doesn't pay but there were also enough stories where SD was late or P&D or were willing to compromise.  \n\n\nI mean, if you found someone who gave you affection that you are paying for, would you even need a SB?",
                                            "author": "AnSteall",
                                            "id": "h57o4wa",
                                            "parent_id": "t1_h55ch8o",
                                            "score": 2,
                                            "created_utc": 1626305246.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I wonder , if these same SB’s stayed in their SR or took less allowance during the financial crash of 2008?",
                            "author": "lostsoul9999999",
                            "id": "h53meki",
                            "parent_id": "t1_h5375yp",
                            "score": 0,
                            "created_utc": 1626222664.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h53t6ui",
                                    "parent_id": "t1_h53meki",
                                    "score": 10,
                                    "created_utc": 1626226207.0,
                                    "replies": [
                                        {
                                            "body": "Well I’ll enlighten you about my experience. \n\nThe SB that I had , showed her true colors during this rough patch. \n\nBetween 2005-2007 , we had the greatest relationship in the world. She received an allowance, car , apartment, health insurance and traveled with me on business.\n\nI was a lover , friend , and mentor.\n\n2008 comes and my liquidity dries up.\n\nWe had a long talk , and I told her. Things will have to change for a bit. You can keep the car and apartment until the lease is up. But the health insurance and allowance has to stop. \n\nI didn’t expect intimacy from her at this point. But all I was asking for was emotional support during these tough times in my life.\n\nWell it didn’t go well. \n\nEvery time we spoke she always had a problem, and now that I wasn’t Financially able to solve them. She had to go because she is depressed.\n\nNever mind what I was going through.\n\nSo if the Op decides to continue supporting her during these tough times. I would suggest thinking of her as a long term commitment, because you are now sharing a life experience..\n\nBut remember after she has recovered, she owes you nothing.",
                                            "author": "lostsoul9999999",
                                            "id": "h53vcup",
                                            "parent_id": "t1_h53t6ui",
                                            "score": 4,
                                            "created_utc": 1626227357.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "h53ww1d",
                                                    "parent_id": "t1_h53vcup",
                                                    "score": 6,
                                                    "created_utc": 1626228179.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thank you for the kind words.",
                                                            "author": "lostsoul9999999",
                                                            "id": "h542rk6",
                                                            "parent_id": "t1_h53ww1d",
                                                            "score": 0,
                                                            "created_utc": 1626231432.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's kind of like what happened during COVID. Some of us kept paying even though we couldn't see them. It turned out not to be that appreciated by my then SB, who I had only seen 3 times before March of last year. When I was able to get back in NYC, she became very flakey and unreliable. I felt good about it anyway and I believe got good Karma as a result.",
            "author": "Teejaynj",
            "id": "h53oiuq",
            "parent_id": "t3_ojppds",
            "score": 10,
            "created_utc": 1626223764.0,
            "replies": [
                {
                    "body": "It says something how so many SBs are on this thread saying “keep paying her! be the good in the world!” while there are growing anecdotes of SDs paying SBs for months while not seeing them, and then the SB breaking off the arrangement upon first in person meetup/becoming flakey and unreliable.\n\nAnd yet again I must reiterate, if the tables were turned and he couldn’t make the allowance for a period of time they would be telling the SB to drop the SD.\n\nOP - it’s very easy for strangers on the internet to tell another stranger to be generous with their money.",
                    "author": null,
                    "id": "h55fk6g",
                    "parent_id": "t1_h53oiuq",
                    "score": 3,
                    "created_utc": 1626268338.0,
                    "replies": [
                        {
                            "body": "I don't disagree and I am not trying to be the white knight here. The young lady I was seeing was a Cali transplant. She knew nobody in NYC. She was in  real estate sales, so.no income. We were on PPM,  so I sent her some money periodically to help. It wasn't going to change my life financially, and I believe it helped her tremendously, so....",
                            "author": "Teejaynj",
                            "id": "h56yhgs",
                            "parent_id": "t1_h55fk6g",
                            "score": 3,
                            "created_utc": 1626293154.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don't understand why anyone would stop seeing their SB/SD just because of the pandemic.",
                    "author": "CreampieCoupleLA",
                    "id": "h54c6bz",
                    "parent_id": "t1_h53oiuq",
                    "score": -8,
                    "created_utc": 1626237222.0,
                    "replies": [
                        {
                            "body": "I would be interested to know which part of it you have a problem understanding.",
                            "author": "AnSteall",
                            "id": "h54tsts",
                            "parent_id": "t1_h54c6bz",
                            "score": 8,
                            "created_utc": 1626251669.0,
                            "replies": [
                                {
                                    "body": "Why anyone would stop seeing someone they're dating?",
                                    "author": "CreampieCoupleLA",
                                    "id": "h59fug5",
                                    "parent_id": "t1_h54tsts",
                                    "score": 1,
                                    "created_utc": 1626347153.0,
                                    "replies": [
                                        {
                                            "body": "Something about passing on the virus? Here in the UK we had 'bubbles' which were named households you were allowed to meet with - under 6 people though.\n\nI assume that if a SD is married, the mistress is not going to be one of those households. Spreading infection is not just about those who meet but about those who might catch from those they met. Vulnerable people in the household, overstretched health services are just a couple of things people considered when minimising non-essential contact during the plague.",
                                            "author": "AnSteall",
                                            "id": "h59ls3e",
                                            "parent_id": "t1_h59fug5",
                                            "score": 1,
                                            "created_utc": 1626351207.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Hmm idk maybe because of the PANDEMIC. 🙄\n\nYou’re not going to believe this—- Some of us actually isolated and didn’t see our own families for the entire year+",
                            "author": "GeminiGirlyGirl",
                            "id": "h550a86",
                            "parent_id": "t1_h54c6bz",
                            "score": 7,
                            "created_utc": 1626257703.0,
                            "replies": []
                        },
                        {
                            "body": "Well, like most people, I waited to gather as much information as I could to assess my risk and assess the risk my actions could be to others. When I determined that I could take precautions to minimize risk, I proceeded to live a modified life. Sugar dating was not part of that early on. When cases went down during the summer, I decided it was OK to see my SB. When I was able to get vaccinated,  I did. So did my new SB. We are leading a relatively normal life now. I do understand that some people don't feel comfortable and I am not judging. Everyone needs to determine the risk they are willing to take. If you are vaccinated,  you shouldn't worry about anyone else. If that doesn't work for you, stay home. The world and life need to go on.",
                            "author": "Teejaynj",
                            "id": "h55f80r",
                            "parent_id": "t1_h54c6bz",
                            "score": 3,
                            "created_utc": 1626268153.0,
                            "replies": [
                                {
                                    "body": "Man, I was meeting up with POTs by June of 2020. The people using COVID as an excuse not to meet up are the people who would have made another excuse if it wasn’t COVID.",
                                    "author": null,
                                    "id": "h55ghyu",
                                    "parent_id": "t1_h55f80r",
                                    "score": -4,
                                    "created_utc": 1626268851.0,
                                    "replies": [
                                        {
                                            "body": "People have parents and grandparents at home.",
                                            "author": null,
                                            "id": "h55px1b",
                                            "parent_id": "t1_h55ghyu",
                                            "score": 4,
                                            "created_utc": 1626273499.0,
                                            "replies": [
                                                {
                                                    "body": "And suddenly in the transplant heavy town of NYC, 30% of POTs lived with their grandparents. Roughly the same % of people who, before COVID and perpetually during my time on SA, couldn’t meet up but would “love to start something virtual.”",
                                                    "author": null,
                                                    "id": "h55r77g",
                                                    "parent_id": "t1_h55px1b",
                                                    "score": -1,
                                                    "created_utc": 1626274089.0,
                                                    "replies": [
                                                        {
                                                            "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
                                                            "author": "ScreenPeepinE",
                                                            "id": "h55vb7a",
                                                            "parent_id": "t1_h55r77g",
                                                            "score": 0,
                                                            "created_utc": 1626275942.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I think end of June is when I resumed as well",
                                            "author": "Teejaynj",
                                            "id": "h56xtv6",
                                            "parent_id": "t1_h55ghyu",
                                            "score": 1,
                                            "created_utc": 1626292869.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, that's terrible :/ She's in my thoughts. Please continue to financially support her.",
            "author": "Youllneverguess777",
            "id": "h533eb3",
            "parent_id": "t3_ojppds",
            "score": 9,
            "created_utc": 1626212964.0,
            "replies": []
        },
        {
            "body": "If you're wealthy... as you should be... the right answer is obvious.",
            "author": "TY2022",
            "id": "h533x3j",
            "parent_id": "t3_ojppds",
            "score": 25,
            "created_utc": 1626213209.0,
            "replies": [
                {
                    "body": "Yoi dont have to be wealthy to be a sugar daddy dafuq? Just rich enough where you can spil but not worry about ypurself at all.",
                    "author": "panda_person666",
                    "id": "h53guie",
                    "parent_id": "t1_h533x3j",
                    "score": -12,
                    "created_utc": 1626219734.0,
                    "replies": [
                        {
                            "body": "If you want a reply from me you do lol",
                            "author": "itsmevajrayogini",
                            "id": "h53ozj4",
                            "parent_id": "t1_h53guie",
                            "score": 8,
                            "created_utc": 1626224004.0,
                            "replies": [
                                {
                                    "body": "Brother doesn’t have money OR the ability to spell. The only responses hes getting are from Nigerian Princesses.",
                                    "author": "Yourstruly0",
                                    "id": "h546rib",
                                    "parent_id": "t1_h53ozj4",
                                    "score": 5,
                                    "created_utc": 1626233776.0,
                                    "replies": [
                                        {
                                            "body": "There is a market for that?! :D",
                                            "author": "AnSteall",
                                            "id": "h54tumr",
                                            "parent_id": "t1_h546rib",
                                            "score": 1,
                                            "created_utc": 1626251715.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah like other people said, the worst thing that can happen is your relationship ends you loose money. At least, with the alternative, your relationship ends and you keep some money but you will always regret not helping her in her needs.",
            "author": "Majesticpork",
            "id": "h54lcft",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626244142.0,
            "replies": []
        },
        {
            "body": "She’s one lucky sb to have you during this time",
            "author": "peytiekay",
            "id": "h557opo",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626263513.0,
            "replies": []
        },
        {
            "body": "Time to learn to love.",
            "author": "tondeaf",
            "id": "h55ld07",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626271348.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h53b4y6",
            "parent_id": "t3_ojppds",
            "score": 7,
            "created_utc": 1626216765.0,
            "replies": [
                {
                    "body": "Thanks for your perspective.  Now I’m looking at this as an opportunity to help someone in need",
                    "author": "tommypillows",
                    "id": "h53cvmu",
                    "parent_id": "t1_h53b4y6",
                    "score": 8,
                    "created_utc": 1626217655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oof. That's rough. I hope she makes a full recovery.\n\nAs for what to do, I feel a lot depends on circumstances. You mentioned you've known her for 6 weeks. How have things been so far? How emotionally invested are each of you? Clearly there's a difference between \"She's crazy, I was planning on ending our arrangement\" and \"I'm happy and hope this lasts for a long term period.\" \n\nSecond circumstances would be around the car accident. Trust but verify, was she actually in an accident? Is she actually in the hospital? How did the accident happen? Was anyone else injured? There's clearly a big difference between \"It wasn't my fault/I was hit by another car\" and \"I was drunk driving, doing 150 mph in a school zone and killed a dozen people\".\n\nLastly would be circumstances around recovery. How serious are her fractures? How long will it take her to recover? Is she expecting you to care for her while she recovers? Will any of her meds affect being intimate? [According to the NHS a minor leg fracture would take 1-2 months, while a major one could take 3-6 months.](https://www.nhs.uk/conditions/broken-leg/). Clearly there's a difference between \"It's only minor injuries, I'll be back to normal in a month or two\" and \"I'm seriously injured, it'll take 8-12 months to physically recover, and I'm mentally traumatized and can never be intimate again because I was hit by the Oscar Mayer Weinermobile.\"\n\nClearly if you were hoping things would last long term, providing full support while she recovers would be incredibly appreciated by her. Most likely you'll have to find out more information, and then depending on your relationship figure out how to move forward from there. However, I do think it's reasonable to say that there are limits to generosity and supporting someone solely out of the goodness of your heart. Depending on the circumstances and length of her recovery.",
            "author": "BlueLantern",
            "id": "h53wuz3",
            "parent_id": "t3_ojppds",
            "score": 4,
            "created_utc": 1626228163.0,
            "replies": [
                {
                    "body": "150 mph is 241.4 km/h",
                    "author": "converter-bot",
                    "id": "h53ww0p",
                    "parent_id": "t1_h53wuz3",
                    "score": 1,
                    "created_utc": 1626228179.0,
                    "replies": []
                },
                {
                    "body": "I suggest you read [this](https://www.reddit.com/r/sugarlifestyleforum/comments/ojppds/sb_was_in_a_serious_accident_what_to_do_about/h537c01?utm_medium=android_app&utm_source=share&context=3)",
                    "author": "jimvasco",
                    "id": "h5495ge",
                    "parent_id": "t1_h53wuz3",
                    "score": 1,
                    "created_utc": 1626235248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean how long have you been together? Close to her any feelings kinda maybe? Then yes morally you should help just a bit out and be there for her.",
            "author": null,
            "id": "h53objf",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626223659.0,
            "replies": []
        },
        {
            "body": "As someone said, SR aside, you helping someone get through a difficult time is the right thing to do, if you have the means to. I’m sure it will mean a lot to her. If you care about her and want to see her again, continue with the allowance agreed upon. You can make more money but a person cannot be replicated",
            "author": "whatifitdoescometrue",
            "id": "h5531da",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626260038.0,
            "replies": []
        },
        {
            "body": "If you asked, you care. Follow your heart.",
            "author": "objectdye",
            "id": "h55vipp",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626276032.0,
            "replies": []
        },
        {
            "body": "I would pay and if I cared for her, I would wait for her.",
            "author": "rodv66",
            "id": "h56zwt3",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626293781.0,
            "replies": []
        },
        {
            "body": "So many replies .. hopefully OP gives us an update on this",
            "author": "vince539839",
            "id": "h58qv69",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626326374.0,
            "replies": []
        },
        {
            "body": "The direction you take is the direction the relationship will take. Granted, it's a tough decision after only 6 weeks. But, if you care about her at this point, and think she cares about you, support her.\n\nMaybe, if the money isn't so important, do it anyway just for the karma.",
            "author": "ChapterRelative",
            "id": "h537ltk",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626214999.0,
            "replies": []
        },
        {
            "body": ">In the end I won’t miss the money and I will have done the right thing to help someone out regardless of the outcome.\n\nBravo.  You've been given the chance to be a hero; take it!",
            "author": "TY2022",
            "id": "h54vhio",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626253275.0,
            "replies": [
                {
                    "body": "oh bollocks",
                    "author": "sexytimeinseattle",
                    "id": "h56cadl",
                    "parent_id": "t1_h54vhio",
                    "score": -1,
                    "created_utc": 1626283297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is how it always plays out on this forum, when the tables are turned and the SD cannot pay for any period of time, its always advocated to not see the sd until he can pay, but when the sb can't fullfill her side of the arrangement, it's always said to still pay her. Breaking legs and jaw is at least a 3 to 8 month recovery, if we are talking femur fractures that's the better part of a year. And honestly, 6 weeks isn't a very long time to know somebody. Personally, I'd continue the SR when she gets better but still help her out with certain things / bills when she needs it. If you have that much disposable income then why not can't hurt anything.",
            "author": "dade_murphy1",
            "id": "h550yuw",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626258289.0,
            "replies": [
                {
                    "body": "This is a good approach.",
                    "author": null,
                    "id": "h55ceoq",
                    "parent_id": "t1_h550yuw",
                    "score": 1,
                    "created_utc": 1626266538.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey op.\n\nRegardless of how she treats you after or what you do the fact you saw a human in pain and decided to help just because you could is amazing.\n\nYou are the kindness we need in this world.please please don't let peope.turn you bitter or selfish, we have too many people that have broken already.",
            "author": "transferingtoearth",
            "id": "h5538ir",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626260198.0,
            "replies": []
        },
        {
            "body": "This is a tough choice. There was a guy on here who posted a story about him continuing to pay  his SB’s allowance while she was sick in the hospital for a few months and they weren’t able to see each other. After she recovered they saw each other, she collected her monthly allowance, then broke things off with him. And they had been together for a long time if I remember the story correctly. \n\nThe point is that it’s a dog eat dog world in the bowl. Things Can and do end/change at moments notice. People take advantage of each other’s generosity. If it were me, I’d probably still help the Sb out here and there during her recovery, but wouldn’t pay her full allowance. \n\nThe analogy of the sd losing his job temporarily and not being able to pay allowance is a good one. I doubt many SB’s would stay with a sd in that situation.",
            "author": null,
            "id": "h53sibq",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626225841.0,
            "replies": []
        },
        {
            "body": "Help her for a month and time to move on. You know her 6 weeks only...flip the coin would she sugar for you if you had a financial setback..um no. This is nsa\n.typically short-term. I'd do 1 month and move on.",
            "author": null,
            "id": "h54z79d",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626256741.0,
            "replies": []
        },
        {
            "body": "Thinking logically, if the same thing happened to you and you couldn't work and therefore couldn't pay your SB, what would they do?",
            "author": "SDNH79",
            "id": "h5605ez",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626278036.0,
            "replies": []
        },
        {
            "body": "This is nuts. You've known her six weeks. That's it. The right thing to do is not to keep paying her. She's not a charity - it's supposed to be a mutual thing. \n\nIf you want to donate money, donate to an actual worthy cause, not some entitled girl you think is cute who is just going to ditch you once she gets better.",
            "author": "CreampieCoupleLA",
            "id": "h59ft2x",
            "parent_id": "t3_ojppds",
            "score": 2,
            "created_utc": 1626347124.0,
            "replies": []
        },
        {
            "body": "Continue the allowance as normal for a month, then reduce to 75% for remainder of her rehabilitation or one year. This is how sick days and income insurance works in my country. \n\nIf the arrangement is more relationship: just keep providing her allowance regardless. Think of how amazed with her you would be if she continued to come visit you without allowance while you recovered from a bad financial problem.",
            "author": "Neither-Ad-2833",
            "id": "h533gy2",
            "parent_id": "t3_ojppds",
            "score": 3,
            "created_utc": 1626212998.0,
            "replies": []
        },
        {
            "body": "6 weeks is still pretty new. Any decision will be valid to some extent. \n\nMe? If there were a connection forming I'd have little trouble giving the next allowance in full and then re-evalute at that time. I might reduce it then, I might give full, or it might be time to part ways. There's no way to tell yet.",
            "author": "mraspencer",
            "id": "h53dw0b",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626218177.0,
            "replies": []
        },
        {
            "body": "Have you visited her in person and verified her claims are legitimate?",
            "author": "ThisIsTheSugarDaddy",
            "id": "h5539ja",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626260221.0,
            "replies": []
        },
        {
            "body": "Has there been an emotional commitment?  If yes then I would honor that commitment.",
            "author": "hal99514",
            "id": "h535d9t",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626213902.0,
            "replies": []
        },
        {
            "body": "The recovery will be longer than your current relationship has been. I’d consider halving at best, ideally shopping for a new SB assuming long recovery. Half the point of the SD/SB relationship is the inherent transactionality.",
            "author": "subaruguy14",
            "id": "h554go6",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626261177.0,
            "replies": []
        },
        {
            "body": "This is what, separates who is a real sugar daddy.  It's just about being a controlling cheapskate that only pays when he is being pampered.  It's about taking care of your sugar baby when they really need you.  I've bailed out my sugar babies in the past and what transpired is much greater trust and value when your SB goes through difficulty and you give them support and they will return the favor.",
            "author": "MKTekke",
            "id": "h55hrqq",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626269527.0,
            "replies": [
                {
                    "body": "I wholeheartedly disagree. He’d still be a real SD if he chose to walk away. Many SBs walk away when the allowance isn’t met, so what would be the difference if he chose to walk away when his physical needs aren’t being met? He really doesn’t owe her anything and vice versa",
                    "author": "LuluvioletSB",
                    "id": "h55rnb8",
                    "parent_id": "t1_h55hrqq",
                    "score": 0,
                    "created_utc": 1626274289.0,
                    "replies": []
                },
                {
                    "body": "Would you say the same if he lost his job and/or was in an accident that stopped his cashflow for 2  months? Would the SB still meeting with him?",
                    "author": "401kisfun",
                    "id": "h58dmoq",
                    "parent_id": "t1_h55hrqq",
                    "score": 0,
                    "created_utc": 1626318529.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ITT:  lots of SBs who are \"isn't what you have not about the sex and she's worth the money anyway?\"\n\nAlso ITT:  lots of SBs who ghost the first time an allowance is missed, if they don't mock the SD for being a broke ass bum cheapskate first.\n\nIf you don't want a transactional relationship, sugaring by definition maybe isn't for you.",
            "author": "sexytimeinseattle",
            "id": "h56bza0",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626283161.0,
            "replies": []
        },
        {
            "body": "You aren't a real sugar daddy if you dont continue to support her. This is supposed to be a relationship you claim to care about her but since she cant offer you anything you dont want to keep supporting her? That is messed up and I hope she sees this. She broke BOTH her fucking legs for God's sake and you dont know if you should keep giving her an allowance? It isn't like she can start working for a while and if it wasn't do to work her job most likely won't pay her or atleast not much and for only a certain ammount if time. You are should be supportive of her and make her feel safe. Keep taking to her and im sure yall can work out sexual arrangements as well but she might not have her legs working right again for a while if ever. If she is so amazing and you dont think you can find another woman like her then what are you even contemplating for??? You have hands dont you??? Sorry if im being harsh but you really sound like you are about to up and leave you because she cant fuck for a while cus in maybe a month or two she will easily be able to got out in a wheel chair so yall can meet so that doesnt around like an issue. \n\nHow long have you been together? Are yall not that serious or something? Most people wouldn't describe someone they just met as amazing and meeting all their needs and wants that most others can't.",
            "author": "panda_person666",
            "id": "h533n5t",
            "parent_id": "t3_ojppds",
            "score": -4,
            "created_utc": 1626213078.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h533xvf",
                    "parent_id": "t1_h533n5t",
                    "score": 5,
                    "created_utc": 1626213220.0,
                    "replies": [
                        {
                            "body": "He doesnt seem to think its sex work does he? You dont talk about your hooker like this do you? No.\n\nIm not a sex worker ass hole. If you dont like me stay clear. Every sd ive had treats me like a sex worker so yeah in my opinion augarong is glorafied sex but he doesnt seem to act like that. Why dont you actually talk about the post and dont bring previous shit into it?? Damn. Ignore me or soemthing.",
                            "author": "panda_person666",
                            "id": "h535e5n",
                            "parent_id": "t1_h533xvf",
                            "score": -5,
                            "created_utc": 1626213913.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Like readjusting if that was her idea makes sense but just not doing it all together and going to give it to someone else instead is real fucked up. There are some answers left in the dark though that would make the situation more understandable. Do you support her life mostly like be helping pay most of her bills because she cant on her own, how long have you been together and what kind of relatio ship (ppm or its like an actual dating setting where ypu are considered bf and gf where you financhially support her)",
                    "author": "panda_person666",
                    "id": "h533zf8",
                    "parent_id": "t1_h533n5t",
                    "score": 2,
                    "created_utc": 1626213240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d think the doctor would have given her an estimated recovery time.\n\nI probably have a different viewpoint from other SBs and I wouldn’t expect you to keep supporting after only knowing each other for 6 weeks.  Maybe after 6 months.",
            "author": "BBSFSA",
            "id": "h535tex",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626214122.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h5379v8",
                    "parent_id": "t1_h535tex",
                    "score": -1,
                    "created_utc": 1626214838.0,
                    "replies": [
                        {
                            "body": "I like this approach.",
                            "author": null,
                            "id": "h54cj06",
                            "parent_id": "t1_h5379v8",
                            "score": 0,
                            "created_utc": 1626237458.0,
                            "replies": [
                                {
                                    "body": "Thanks! Apparently some people don’t 🙄",
                                    "author": null,
                                    "id": "h55c41s",
                                    "parent_id": "t1_h54cj06",
                                    "score": 0,
                                    "created_utc": 1626266363.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This is reasonable.",
                            "author": "mraspencer",
                            "id": "h53dpti",
                            "parent_id": "t1_h5379v8",
                            "score": -2,
                            "created_utc": 1626218085.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h53g9zu",
                                    "parent_id": "t1_h53dpti",
                                    "score": -1,
                                    "created_utc": 1626219433.0,
                                    "replies": [
                                        {
                                            "body": "for sure, connection is key",
                                            "author": "mraspencer",
                                            "id": "h54crrw",
                                            "parent_id": "t1_h53g9zu",
                                            "score": 0,
                                            "created_utc": 1626237626.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yes, a parting gift of one month would be nice.",
                            "author": "BBSFSA",
                            "id": "h53t72k",
                            "parent_id": "t1_h5379v8",
                            "score": -1,
                            "created_utc": 1626226210.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, in this instance it’s okay for them to agree to “take a break.” Sugar is companionship + sex. He might be able to get the former while she recovers, but definitely not the latter, and I assume OP never said that he was looking for a platonic relationship. On the other hand, OP, if you really want to make her feel special and never forget you, by all means keep supporting her.",
                    "author": "vdgift",
                    "id": "h540ojp",
                    "parent_id": "t1_h535tex",
                    "score": -3,
                    "created_utc": 1626230257.0,
                    "replies": [
                        {
                            "body": "Not necessarily, some form of sexual activity may be possible as she recovers.",
                            "author": "CreampieCoupleLA",
                            "id": "h54cdkq",
                            "parent_id": "t1_h540ojp",
                            "score": -2,
                            "created_utc": 1626237358.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some of The answers here make me sad. Are ppl looking to develop a caring supporting relationship w a woman that’s a real person they want to support? Or just paying for sex which so many say they’re not doing? Like.. she’ll still be talking to you and connecting with you right? Do you value her as a human? Because a lot of ppl here seem to be saying I’m not paying for sex but also no sex means no allowance. Strange paradox. I would understand if she wouldn’t be talking to you or spending any time with you…. But a lot of guys here seem to be saying it’s just money for sex but also I’m not giving money for sex. Kind of hard to keep up, ppl could st least be transparent instead of repeatedly insisting they aren’t doing exactly what they say they are doing… (“you” is not directed to you OP, or the other good guys in this thread that actually have some humanity. Your edit clearly shows you to be a kind and high value man) it’s just kind of weird the number of “SD’s” that keep saying I’m not paying for sex but I’m not giving you an allowance if we can’t have sex. The lack of self awareness is astonishing. If you value emotional intimacy like you claim this kind of situation has the potential to grow emotional intimacy by leaps and bounds. Depends on what you’re actually looking for, I suppose.",
            "author": "WestCoastCompanion",
            "id": "h555l9c",
            "parent_id": "t3_ojppds",
            "score": 1,
            "created_utc": 1626262022.0,
            "replies": [
                {
                    "body": "It’s not about paying for sex. But it’s likely the SB in the OP’s story won’t be able to see him period for a few months while she’s in the hospital recovering. Should the OP still pay an allowance if he can’t see his SB at all? That’s the main argument. \n\nAnother poster shared a story recently that he still supported (paid monthly allowance) his long term SB while she was in the hospital and he couldn’t see her for a few months. When she recovered she saw him again, collected her monthly allowance, then broke it off a few days later. The OP runs the risk of something similar happening to him.",
                    "author": null,
                    "id": "h55c89x",
                    "parent_id": "t1_h555l9c",
                    "score": 4,
                    "created_utc": 1626266432.0,
                    "replies": [
                        {
                            "body": "Why wouldn’t he be able to visit her ?",
                            "author": "WestCoastCompanion",
                            "id": "h56y6xl",
                            "parent_id": "t1_h55c89x",
                            "score": 2,
                            "created_utc": 1626293028.0,
                            "replies": [
                                {
                                    "body": "I assume she will have her family and friends around Im the hospital the entire time. I don’t think the SB will want her SD visiting her while everyone else is there.",
                                    "author": null,
                                    "id": "h56yvhb",
                                    "parent_id": "t1_h56y6xl",
                                    "score": 0,
                                    "created_utc": 1626293326.0,
                                    "replies": [
                                        {
                                            "body": "…why? Say they are friends, say it’s someone you’re dating, tell your family you’re having a visitor and would like some privacy. She’s not 12 years old. If she doesn’t want to see you or talk to you that’s a different matter, but many of these comments are either implying it outright stating that a woman who’s been in an accident should be tossed aside because she’s sexually useless, albeit temporarily…",
                                            "author": "WestCoastCompanion",
                                            "id": "h5816qe",
                                            "parent_id": "t1_h56yvhb",
                                            "score": 2,
                                            "created_utc": 1626312057.0,
                                            "replies": [
                                                {
                                                    "body": "Why are you trying to nitpick? Chances are she won’t want him coming around in the hospital. We don’t know their age gap or their history. Shes 22 so I doubt she will want a much older man coming to visit her in the hospital. \n\nRead the poster who wrote about a similar situation that happened to him recently. He said he didn’t see his sb for a few months while she was in the hospital. I doubt it was his choice not to see her.",
                                                    "author": null,
                                                    "id": "h58525u",
                                                    "parent_id": "t1_h5816qe",
                                                    "score": 1,
                                                    "created_utc": 1626314036.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You obviously like her and this is a truly horrible thing to have happened to her so it would be lovely for you to support her with an allowance during this. \n\nThat said, given that you've only known her six weeks I also don't think it would be unreasonable to reduce it either, whether from the start, or full allowance for two months then reduce or something like that, if you/she felt more comfortable with things that way for now. \n\nWishing her well and you both happy!",
            "author": "assinoroyale",
            "id": "h533z6o",
            "parent_id": "t3_ojppds",
            "score": 0,
            "created_utc": 1626213237.0,
            "replies": []
        },
        {
            "body": "At the end of the day, you didn't sign an agreement with the SB, so you owe her nothing. There are plenty of SBs who will drop their SD's the moment there is no sugar. This is no different.\n\nIf you want to be a charitable person, plenty of people out there who need financial help. Just step into any pediatric cancer unit into any hospital.  I know all the SBs here would never do that and they are all mother theresas (/s), but I don't think you got into the bowl to do charity.",
            "author": "MiLocavida",
            "id": "h55c3zq",
            "parent_id": "t3_ojppds",
            "score": 0,
            "created_utc": 1626266362.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h53owiw",
            "parent_id": "t3_ojppds",
            "score": -1,
            "created_utc": 1626223960.0,
            "replies": [
                {
                    "body": "It’s possible.  I’m planning on visiting her in the hospital so we will find out",
                    "author": "tommypillows",
                    "id": "h53rtx5",
                    "parent_id": "t1_h53owiw",
                    "score": 3,
                    "created_utc": 1626225483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These are my thoughts.\n\nFrom a purely objective standpoint - you should not continue paying her, as I’m pretty darn certain (but correct me if I’m wrong) that she’s no longer able to fulfill her end of the bargain, and at the end of the day these are called “arrangements” for a reason.\n\nNow with that being said…if it were me….well I’m a dumbass and I would still pay her knowing full well there’s a really good chance I would never see a return on that investment outside of the feeling of doing something good for someone I probably care about far more than they care about me.",
            "author": "Overwatch61",
            "id": "h54e3wu",
            "parent_id": "t3_ojppds",
            "score": -1,
            "created_utc": 1626238552.0,
            "replies": []
        },
        {
            "body": "When you are the forst comment and dont get a response",
            "author": "panda_person666",
            "id": "h53h53b",
            "parent_id": "t3_ojppds",
            "score": -6,
            "created_utc": 1626219885.0,
            "replies": []
        },
        {
            "body": "I think the allowance should stop but you can be human and help her as you can. This has nothing to do with you being her SD. But more from a human standpoint.  Tell her to get back in touch when she has recovered. Stay in touch via text if she wants to.",
            "author": null,
            "id": "h533f0c",
            "parent_id": "t3_ojppds",
            "score": -11,
            "created_utc": 1626212973.0,
            "replies": [
                {
                    "body": "Your advice is baffling to say the least — you just advised him to be humane, while also suggesting that he completely cut off all financial assistance and tell her to text him when she is able to take dick again. Wow, the way some people’s brains work are ludicrous at times.",
                    "author": "SenoraVixen",
                    "id": "h54mmlq",
                    "parent_id": "t1_h533f0c",
                    "score": 3,
                    "created_utc": 1626245225.0,
                    "replies": [
                        {
                            "body": "You have a very myopic view of life clearly. I am telling him to extract himself from being an SD and help her as a human. To be ultra blunt the lady won’t hang for an extra week if the guy is unable to support her financially. She may stay in touch via text and someday when Pedro has his job back she may consider him again. Does this all have to be so one sided?",
                            "author": null,
                            "id": "h55c85o",
                            "parent_id": "t1_h54mmlq",
                            "score": 1,
                            "created_utc": 1626266430.0,
                            "replies": []
                        },
                        {
                            "body": "You completely misread what he said lol. Wtf.",
                            "author": null,
                            "id": "h55ci7n",
                            "parent_id": "t1_h54mmlq",
                            "score": 0,
                            "created_utc": 1626266597.0,
                            "replies": []
                        },
                        {
                            "body": "If an SD couldn't pay for a while, would you tell the SB to be humane and keep seeing him anyway?",
                            "author": "CreampieCoupleLA",
                            "id": "h59fogs",
                            "parent_id": "t1_h54mmlq",
                            "score": 0,
                            "created_utc": 1626347030.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It really is terrible for her.  Thanks for recognizing that.  I just want others opinion on what they might do",
            "author": "tommypillows",
            "id": "h5338zb",
            "parent_id": "t1_h5331s7",
            "score": 51,
            "created_utc": 1626212895.0,
            "replies": [
                {
                    "body": "It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.",
                    "author": null,
                    "id": "h53aii9",
                    "parent_id": "t1_h5338zb",
                    "score": 27,
                    "created_utc": 1626216447.0,
                    "replies": [
                        {
                            "body": "He literally said that it would be difficult to find someone like her and he's willing to help. I think he should help as long as he wants but has no obligation to keep helping forever.",
                            "author": "vitor-a",
                            "id": "h53m3nk",
                            "parent_id": "t1_h53aii9",
                            "score": 50,
                            "created_utc": 1626222504.0,
                            "replies": []
                        },
                        {
                            "body": "And that’s the very reason why I personally wouldn’t continue supporting her. Maybe give her a month’s allowance as a gift, but then go about my way.",
                            "author": null,
                            "id": "h53iihe",
                            "parent_id": "t1_h53aii9",
                            "score": -11,
                            "created_utc": 1626220610.0,
                            "replies": [
                                {
                                    "body": ">It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.\n\nThis is a valid point that the OP needs to carefully consider.",
                                    "author": "2020Traveller",
                                    "id": "h53lnxi",
                                    "parent_id": "t1_h53iihe",
                                    "score": 0,
                                    "created_utc": 1626222276.0,
                                    "replies": [
                                        {
                                            "body": "I think it’s a little different situation for her.  She couldn’t weather the storm quite as well as I can",
                                            "author": "tommypillows",
                                            "id": "h540ksf",
                                            "parent_id": "t1_h53lnxi",
                                            "score": 25,
                                            "created_utc": 1626230198.0,
                                            "replies": [
                                                {
                                                    "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
                                                    "author": "Yourstruly0",
                                                    "id": "h546cs2",
                                                    "parent_id": "t1_h540ksf",
                                                    "score": 36,
                                                    "created_utc": 1626233527.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Bingo !!! Agree 300 percent.",
                            "author": null,
                            "id": "h54zcur",
                            "parent_id": "t1_h53aii9",
                            "score": -2,
                            "created_utc": 1626256880.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's not a relationship only 6 weeks and people cate about themselves.",
            "author": null,
            "id": "h54zb70",
            "parent_id": "t1_h5331s7",
            "score": 0,
            "created_utc": 1626256840.0,
            "replies": []
        },
        {
            "body": "Over the course of the last 18 months I am sure many of us have helped hundreds of people who ended up being impacted by one adversity or another due to the pandemic. Along those lines I agree one must help a fellow human in need. But to frame that help as an ongoing allowance is an overkill especially for a six week sugar relationship IMHO.",
            "author": null,
            "id": "h55bsrk",
            "parent_id": "t1_h53inop",
            "score": 5,
            "created_utc": 1626266172.0,
            "replies": [
                {
                    "body": "\"In the end I won't miss the money\"   puts it into perspective",
                    "author": "pinotandsugar",
                    "id": "h55h2ah",
                    "parent_id": "t1_h55bsrk",
                    "score": 12,
                    "created_utc": 1626269154.0,
                    "replies": [
                        {
                            "body": "Money is never the issue! It goes but often comes back. The principle, the time and opportunity cost is where it’s all at.",
                            "author": null,
                            "id": "h56s21y",
                            "parent_id": "t1_h55h2ah",
                            "score": 0,
                            "created_utc": 1626290305.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Think of it as she's being sent to the farm (repair)  club for spring training ......",
                    "author": "pinotandsugar",
                    "id": "h578jzi",
                    "parent_id": "t1_h55bsrk",
                    "score": 1,
                    "created_utc": 1626297656.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What a money comment",
            "author": "401kisfun",
            "id": "h56dofi",
            "parent_id": "t1_h53inop",
            "score": 2,
            "created_utc": 1626283907.0,
            "replies": []
        },
        {
            "body": "Thanks for the advice.  I’ve only known her for a about 6 weeks but I do care for her and want to help out.",
            "author": "tommypillows",
            "id": "h533ggx",
            "parent_id": "t1_h5333jy",
            "score": 21,
            "created_utc": 1626212992.0,
            "replies": [
                {
                    "body": "I see your edit at the top, but just to add perspective - I knew my former SD about 4-6 weeks before NYC shut down for the pandemic. He continued to pay my allowance through Sept and if he ever appeared in my life again, I would drop everything to help him if he needed it. He single-handedly kept me afloat with a reasonable allowance and I just... I'd go to bat for him in every non sexual way possible, that's how thankful I am.\n\nI tried to convey the scope of my gratitude but am not sure if he realizes the difference he made. Anyway. Support in hard times means the world. Thank you, on her behalf, for being an exceptional person.",
                    "author": "secretactorian",
                    "id": "h53stkc",
                    "parent_id": "t1_h533ggx",
                    "score": 64,
                    "created_utc": 1626226010.0,
                    "replies": [
                        {
                            "body": "I'm confused. So the two of you didn't see each other at all in person all through the pandemic? Why?\n\nWould you go to bat for him in sexual ways?",
                            "author": "CreampieCoupleLA",
                            "id": "h54buv6",
                            "parent_id": "t1_h53stkc",
                            "score": 2,
                            "created_utc": 1626237009.0,
                            "replies": [
                                {
                                    "body": "Not sure what there is to be confused about.\n\n1. He has 2 young kids, lives in PA. He didn’t want to risk it. Not everyone was comfortable with it, you know. \n\n2. Ok jeez, you got me, that was just poor phrasing. I'm no longer in the bowl so i wouldn't resume seeing him is what I meant.",
                                    "author": "secretactorian",
                                    "id": "h54w2jb",
                                    "parent_id": "t1_h54buv6",
                                    "score": 10,
                                    "created_utc": 1626253836.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Six weeks is kind of short.  It depends on how you feel things were going, and if you were planning on making it long term.  If yes, then continuing allowance (full or reduced is up to you) while she recuperates would be kind and generous.  Ultimately it’s up to you.",
                    "author": "throwawayrdu71",
                    "id": "h538scb",
                    "parent_id": "t1_h533ggx",
                    "score": 7,
                    "created_utc": 1626215584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good to him in 6 weeks ??",
            "author": null,
            "id": "h54zewj",
            "parent_id": "t1_h53o100",
            "score": -9,
            "created_utc": 1626256931.0,
            "replies": []
        },
        {
            "body": "Thanks for your opinion.  I’m not at all suggesting I want to completely stop the allowance.  My main concern is how long the recovery will be",
            "author": "tommypillows",
            "id": "h533ppu",
            "parent_id": "t1_h533dyq",
            "score": 11,
            "created_utc": 1626213112.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h5344ld",
                    "parent_id": "t1_h533ppu",
                    "score": 21,
                    "created_utc": 1626213308.0,
                    "replies": [
                        {
                            "body": "By \"intimacy\" you mean sex, right?\n\nThey may still be able to have some form of sexual activity as she is recovering.",
                            "author": "CreampieCoupleLA",
                            "id": "h54bzcn",
                            "parent_id": "t1_h5344ld",
                            "score": 4,
                            "created_utc": 1626237091.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know you don't expect a payment every meet right? You do actually like spending time and being intimate with me outside of money right? Are you saying the ONLY reason you are hanging out with me and being intimate is to get paid? I'm really hurt. I thought you actually liked me.  See how ridiculous this sounds.",
            "author": "dade_murphy1",
            "id": "h551q3f",
            "parent_id": "t1_h533dyq",
            "score": 3,
            "created_utc": 1626258926.0,
            "replies": []
        },
        {
            "body": "Let’s turn the tables and see…So if your SD lost his job and couldn’t provide an allowance while he looked for another, knowing full well for his profession that it would probably be 2-4 months at least before he found another position (a good rough estimate on how long 2 broken legs will take…but likely even longer) and you had only known him for 6 weeks…would you still go see him and be intimate with him? Because if not, well that would suggest your only in it for the money - and that would make him feel like absolute shit.\n\nDo you understand the SD perspective now?",
            "author": "Overwatch61",
            "id": "h54dvfg",
            "parent_id": "t1_h533dyq",
            "score": 2,
            "created_utc": 1626238385.0,
            "replies": [
                {
                    "body": "We all know the answer to this question, and it's definitely a different one than she is advocating to the OP.",
                    "author": "storm170",
                    "id": "h54hzip",
                    "parent_id": "t1_h54dvfg",
                    "score": 11,
                    "created_utc": 1626241417.0,
                    "replies": [
                        {
                            "body": "Of course we do, I’m just tired of the shitty double standard if I’m being honest.",
                            "author": "Overwatch61",
                            "id": "h54oetv",
                            "parent_id": "t1_h54hzip",
                            "score": 3,
                            "created_utc": 1626246796.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "this was an awesome response!!! SBs will drop you in a second if they find a better allowance, and they won't give a damn. But suddenly all the SB's out there are mother theresas!!! 😂",
                    "author": "MiLocavida",
                    "id": "h555x3l",
                    "parent_id": "t1_h54dvfg",
                    "score": 1,
                    "created_utc": 1626262260.0,
                    "replies": [
                        {
                            "body": "> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nWill they?\n\nI've been sugaring for over 5 years now.  I've never had an SR end / SB leave, because they got a higher allowance somewhere else.\n\nTo be clear - I'm not claiming I provide a high amount.  It would likely be more on the average/splenda side, depending on how you look at it.\n\nBut I do provide a consistent amount.  Which is seems like many of the PPM guys here do not.",
                            "author": "SDstartingOut",
                            "id": "h55gnh1",
                            "parent_id": "t1_h555x3l",
                            "score": 4,
                            "created_utc": 1626268932.0,
                            "replies": [
                                {
                                    "body": ">To be clear - I'm not claiming I provide a high amount.   It would likely be more on the average/splenda side,\n\nthat's your answer...plenty of SB's who can get higher allowances, and the rules of supply and demand apply in the bowl. Some SBs are desired by many SDs.",
                                    "author": "MiLocavida",
                                    "id": "h5603f0",
                                    "parent_id": "t1_h55gnh1",
                                    "score": 1,
                                    "created_utc": 1626278012.0,
                                    "replies": [
                                        {
                                            "body": "> that's your answer..\n\nBut that's my whole point.\n\nI've never had an SB \"leave\" me for another SD.  With the exception of 2 situations (SB flaked/ghosted after 1 intimate date) - I have ended every single one of my SRs.",
                                            "author": "SDstartingOut",
                                            "id": "h567u0m",
                                            "parent_id": "t1_h5603f0",
                                            "score": 1,
                                            "created_utc": 1626281360.0,
                                            "replies": [
                                                {
                                                    "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
                                                    "author": "MiLocavida",
                                                    "id": "h56aizi",
                                                    "parent_id": "t1_h567u0m",
                                                    "score": 1,
                                                    "created_utc": 1626282520.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
                                                    "author": "CreampieCoupleLA",
                                                    "id": "h59f52d",
                                                    "parent_id": "t1_h567u0m",
                                                    "score": 1,
                                                    "created_utc": 1626346614.0,
                                                    "replies": [
                                                        {
                                                            "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                                                            "author": "SDstartingOut",
                                                            "id": "h59kkjt",
                                                            "parent_id": "t1_h59f52d",
                                                            "score": 1,
                                                            "created_utc": 1626350435.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Incorrect analogy. We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job",
                                    "author": "401kisfun",
                                    "id": "h57bjuj",
                                    "parent_id": "t1_h55gnh1",
                                    "score": 1,
                                    "created_utc": 1626299039.0,
                                    "replies": [
                                        {
                                            "body": "There is nothing incorrect about it.  I was replying to a specific comment that stated \" SBs will drop you in a second if they find a better allowance\".  And I stand behind my statement.  \n\n> We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job\n\nI have to say, this commentary is typically baffling to me.  Specifically that - 2 months would be the end of the world.  Just like an SD that supposedly can't provide a given allowance/ppm due \"cash flow issues\".  I wouldn't be sugaring - if I didn't have a year's worth of living expenses sitting on the sidelines.  .",
                                            "author": "SDstartingOut",
                                            "id": "h59le59",
                                            "parent_id": "t1_h57bjuj",
                                            "score": 1,
                                            "created_utc": 1626350961.0,
                                            "replies": [
                                                {
                                                    "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
                                                    "author": "401kisfun",
                                                    "id": "h5a0s8x",
                                                    "parent_id": "t1_h59le59",
                                                    "score": 1,
                                                    "created_utc": 1626358892.0,
                                                    "replies": [
                                                        {
                                                            "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                                                            "author": "SDstartingOut",
                                                            "id": "h5a3tpw",
                                                            "parent_id": "t1_h5a0s8x",
                                                            "score": 1,
                                                            "created_utc": 1626360253.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The question is directed at an SB",
                                                                    "author": "401kisfun",
                                                                    "id": "h5a3wv1",
                                                                    "parent_id": "t1_h5a3tpw",
                                                                    "score": 1,
                                                                    "created_utc": 1626360291.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "The only thing that beats the response is all the downvotes from the salty SBs hahahaha. Gotta love women pushing for double standards amidst the biggest female equality movement of our generation lol. Oh the irony 😂",
                            "author": "Overwatch61",
                            "id": "h557wgu",
                            "parent_id": "t1_h555x3l",
                            "score": -1,
                            "created_utc": 1626263661.0,
                            "replies": [
                                {
                                    "body": ">amidst the biggest female equality movement of our generation\n\nbetter keep it on the down low or you might get canceled! 😂",
                                    "author": "MiLocavida",
                                    "id": "h55bp1c",
                                    "parent_id": "t1_h557wgu",
                                    "score": -1,
                                    "created_utc": 1626266111.0,
                                    "replies": [
                                        {
                                            "body": "Oh god, the younger generations lingo genuinely makes me cringe haha. I can only assume my parents felt the same way about the things I said growing up though.",
                                            "author": "Overwatch61",
                                            "id": "h56iuds",
                                            "parent_id": "t1_h55bp1c",
                                            "score": 0,
                                            "created_utc": 1626286170.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you end up staying with this guy? I would never ever do this for someone i am not in contact with anymore no matter what good times we had. This is not something i’d consider sweet or anything to admire at all.",
            "author": "401kisfun",
            "id": "h58ax2k",
            "parent_id": "t1_h537c01",
            "score": 1,
            "created_utc": 1626317095.0,
            "replies": []
        },
        {
            "body": "Thank you for saying that.  I think I just needed to hear the advice.  Sometimes the bowl can make us callous.",
            "author": "tommypillows",
            "id": "h53cfaq",
            "parent_id": "t1_h53b7e9",
            "score": 13,
            "created_utc": 1626217419.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h53vi3l",
                    "parent_id": "t1_h53cfaq",
                    "score": 10,
                    "created_utc": 1626227434.0,
                    "replies": [
                        {
                            "body": "People seem to be forgetting this girl is an actual person. If I had the means to without suffering I would help her out simply because I know that support could very literally change the trajectory of her life at this point. This is an event that will likely mark a before/after point in her personal history. Someone having her back during this could change whether this accident spells tragedy for her.",
                            "author": "Yourstruly0",
                            "id": "h5474gy",
                            "parent_id": "t1_h53vi3l",
                            "score": 8,
                            "created_utc": 1626233994.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Once again, you took the words out of my mouth.\n\nYes it is a double standard world.\n\nHowever, I rather be an SD than a SB.\n\nI rather be out of pocket for some money that I don't really miss, than have to be at the other end.\n\nThis is a tough call for op. \n\nI had been with my current SB for only a few months. But if the same thing happens to her (touch wood), chances are I will keep the PPM going.",
            "author": "eurosd",
            "id": "h537eci",
            "parent_id": "t1_h536bcl",
            "score": 16,
            "created_utc": 1626214897.0,
            "replies": [
                {
                    "body": "Agree.  Like I said, knowing this doesn't change my answer one bit.  \n\nI do, however, take the remarks of those who claim \"if you don't do X you're **not a real SD**\" with more than a grain of salt -- do it because it's the right thing to do in the context of your SR and how you value your SB in your life, not because someone is playing the \"real SD\" card, especially since so many of these *someones* are so fast on the trigger with \"dump that loser\" when things are reversed.",
                    "author": "Azurecole",
                    "id": "h53874q",
                    "parent_id": "t1_h537eci",
                    "score": 10,
                    "created_utc": 1626215291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h5375yp",
            "parent_id": "t1_h536bcl",
            "score": -1,
            "created_utc": 1626214785.0,
            "replies": [
                {
                    "body": "Well in general sd’s have more resources \nThan say a sb majority of them are broke af and some of them are snobbish and have rich dads back home.",
                    "author": null,
                    "id": "h53os7o",
                    "parent_id": "t1_h5375yp",
                    "score": 5,
                    "created_utc": 1626223898.0,
                    "replies": [
                        {
                            "body": "Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it. \n\nThat’s like telling a SB, sleeping with a SD while he’s financially hurting isn’t going to cost her anything because she has an unlimited amount of pussy she can give out to her partners & it isn’t going to hurt her because she has more pussy then he does and she can still sleep with other people",
                            "author": null,
                            "id": "h55ch8o",
                            "parent_id": "t1_h53os7o",
                            "score": -1,
                            "created_utc": 1626266581.0,
                            "replies": [
                                {
                                    "body": "It is an actual statistic that men are more likely to leave their female partner was she to be hit with some major health issues. With cancer this ratio is 1:6. This is without the bowl.\n\nI understand 'in the bow' you're in a quasi relationship. If you do not wish to keep the emphasis on 'transactional' but on emotional, would you answer still be the same?\n\nI notice that the SR has similarities to 19050s (and prior) power dynamics within a marriage where the man was the provider and the female essentially a servant who had to be grateful for being provided for. That view is still not outdated in many parts of the world.\n\n&#x200B;\n\n>Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it.\n\nThis is pretty much that outdated world view. If in a (sugar) relationship you can't have the empathy to continue supporting your SB, do you even qualify as a SD or are you just using a glorified escort service?\n\nSure, I also read plenty of women advising others to dump a SD who doesn't pay but there were also enough stories where SD was late or P&D or were willing to compromise.  \n\n\nI mean, if you found someone who gave you affection that you are paying for, would you even need a SB?",
                                    "author": "AnSteall",
                                    "id": "h57o4wa",
                                    "parent_id": "t1_h55ch8o",
                                    "score": 2,
                                    "created_utc": 1626305246.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wonder , if these same SB’s stayed in their SR or took less allowance during the financial crash of 2008?",
                    "author": "lostsoul9999999",
                    "id": "h53meki",
                    "parent_id": "t1_h5375yp",
                    "score": 0,
                    "created_utc": 1626222664.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h53t6ui",
                            "parent_id": "t1_h53meki",
                            "score": 10,
                            "created_utc": 1626226207.0,
                            "replies": [
                                {
                                    "body": "Well I’ll enlighten you about my experience. \n\nThe SB that I had , showed her true colors during this rough patch. \n\nBetween 2005-2007 , we had the greatest relationship in the world. She received an allowance, car , apartment, health insurance and traveled with me on business.\n\nI was a lover , friend , and mentor.\n\n2008 comes and my liquidity dries up.\n\nWe had a long talk , and I told her. Things will have to change for a bit. You can keep the car and apartment until the lease is up. But the health insurance and allowance has to stop. \n\nI didn’t expect intimacy from her at this point. But all I was asking for was emotional support during these tough times in my life.\n\nWell it didn’t go well. \n\nEvery time we spoke she always had a problem, and now that I wasn’t Financially able to solve them. She had to go because she is depressed.\n\nNever mind what I was going through.\n\nSo if the Op decides to continue supporting her during these tough times. I would suggest thinking of her as a long term commitment, because you are now sharing a life experience..\n\nBut remember after she has recovered, she owes you nothing.",
                                    "author": "lostsoul9999999",
                                    "id": "h53vcup",
                                    "parent_id": "t1_h53t6ui",
                                    "score": 4,
                                    "created_utc": 1626227357.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h53ww1d",
                                            "parent_id": "t1_h53vcup",
                                            "score": 6,
                                            "created_utc": 1626228179.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you for the kind words.",
                                                    "author": "lostsoul9999999",
                                                    "id": "h542rk6",
                                                    "parent_id": "t1_h53ww1d",
                                                    "score": 0,
                                                    "created_utc": 1626231432.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It says something how so many SBs are on this thread saying “keep paying her! be the good in the world!” while there are growing anecdotes of SDs paying SBs for months while not seeing them, and then the SB breaking off the arrangement upon first in person meetup/becoming flakey and unreliable.\n\nAnd yet again I must reiterate, if the tables were turned and he couldn’t make the allowance for a period of time they would be telling the SB to drop the SD.\n\nOP - it’s very easy for strangers on the internet to tell another stranger to be generous with their money.",
            "author": null,
            "id": "h55fk6g",
            "parent_id": "t1_h53oiuq",
            "score": 3,
            "created_utc": 1626268338.0,
            "replies": [
                {
                    "body": "I don't disagree and I am not trying to be the white knight here. The young lady I was seeing was a Cali transplant. She knew nobody in NYC. She was in  real estate sales, so.no income. We were on PPM,  so I sent her some money periodically to help. It wasn't going to change my life financially, and I believe it helped her tremendously, so....",
                    "author": "Teejaynj",
                    "id": "h56yhgs",
                    "parent_id": "t1_h55fk6g",
                    "score": 3,
                    "created_utc": 1626293154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't understand why anyone would stop seeing their SB/SD just because of the pandemic.",
            "author": "CreampieCoupleLA",
            "id": "h54c6bz",
            "parent_id": "t1_h53oiuq",
            "score": -8,
            "created_utc": 1626237222.0,
            "replies": [
                {
                    "body": "I would be interested to know which part of it you have a problem understanding.",
                    "author": "AnSteall",
                    "id": "h54tsts",
                    "parent_id": "t1_h54c6bz",
                    "score": 8,
                    "created_utc": 1626251669.0,
                    "replies": [
                        {
                            "body": "Why anyone would stop seeing someone they're dating?",
                            "author": "CreampieCoupleLA",
                            "id": "h59fug5",
                            "parent_id": "t1_h54tsts",
                            "score": 1,
                            "created_utc": 1626347153.0,
                            "replies": [
                                {
                                    "body": "Something about passing on the virus? Here in the UK we had 'bubbles' which were named households you were allowed to meet with - under 6 people though.\n\nI assume that if a SD is married, the mistress is not going to be one of those households. Spreading infection is not just about those who meet but about those who might catch from those they met. Vulnerable people in the household, overstretched health services are just a couple of things people considered when minimising non-essential contact during the plague.",
                                    "author": "AnSteall",
                                    "id": "h59ls3e",
                                    "parent_id": "t1_h59fug5",
                                    "score": 1,
                                    "created_utc": 1626351207.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Hmm idk maybe because of the PANDEMIC. 🙄\n\nYou’re not going to believe this—- Some of us actually isolated and didn’t see our own families for the entire year+",
                    "author": "GeminiGirlyGirl",
                    "id": "h550a86",
                    "parent_id": "t1_h54c6bz",
                    "score": 7,
                    "created_utc": 1626257703.0,
                    "replies": []
                },
                {
                    "body": "Well, like most people, I waited to gather as much information as I could to assess my risk and assess the risk my actions could be to others. When I determined that I could take precautions to minimize risk, I proceeded to live a modified life. Sugar dating was not part of that early on. When cases went down during the summer, I decided it was OK to see my SB. When I was able to get vaccinated,  I did. So did my new SB. We are leading a relatively normal life now. I do understand that some people don't feel comfortable and I am not judging. Everyone needs to determine the risk they are willing to take. If you are vaccinated,  you shouldn't worry about anyone else. If that doesn't work for you, stay home. The world and life need to go on.",
                    "author": "Teejaynj",
                    "id": "h55f80r",
                    "parent_id": "t1_h54c6bz",
                    "score": 3,
                    "created_utc": 1626268153.0,
                    "replies": [
                        {
                            "body": "Man, I was meeting up with POTs by June of 2020. The people using COVID as an excuse not to meet up are the people who would have made another excuse if it wasn’t COVID.",
                            "author": null,
                            "id": "h55ghyu",
                            "parent_id": "t1_h55f80r",
                            "score": -4,
                            "created_utc": 1626268851.0,
                            "replies": [
                                {
                                    "body": "People have parents and grandparents at home.",
                                    "author": null,
                                    "id": "h55px1b",
                                    "parent_id": "t1_h55ghyu",
                                    "score": 4,
                                    "created_utc": 1626273499.0,
                                    "replies": [
                                        {
                                            "body": "And suddenly in the transplant heavy town of NYC, 30% of POTs lived with their grandparents. Roughly the same % of people who, before COVID and perpetually during my time on SA, couldn’t meet up but would “love to start something virtual.”",
                                            "author": null,
                                            "id": "h55r77g",
                                            "parent_id": "t1_h55px1b",
                                            "score": -1,
                                            "created_utc": 1626274089.0,
                                            "replies": [
                                                {
                                                    "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
                                                    "author": "ScreenPeepinE",
                                                    "id": "h55vb7a",
                                                    "parent_id": "t1_h55r77g",
                                                    "score": 0,
                                                    "created_utc": 1626275942.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I think end of June is when I resumed as well",
                                    "author": "Teejaynj",
                                    "id": "h56xtv6",
                                    "parent_id": "t1_h55ghyu",
                                    "score": 1,
                                    "created_utc": 1626292869.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yoi dont have to be wealthy to be a sugar daddy dafuq? Just rich enough where you can spil but not worry about ypurself at all.",
            "author": "panda_person666",
            "id": "h53guie",
            "parent_id": "t1_h533x3j",
            "score": -12,
            "created_utc": 1626219734.0,
            "replies": [
                {
                    "body": "If you want a reply from me you do lol",
                    "author": "itsmevajrayogini",
                    "id": "h53ozj4",
                    "parent_id": "t1_h53guie",
                    "score": 8,
                    "created_utc": 1626224004.0,
                    "replies": [
                        {
                            "body": "Brother doesn’t have money OR the ability to spell. The only responses hes getting are from Nigerian Princesses.",
                            "author": "Yourstruly0",
                            "id": "h546rib",
                            "parent_id": "t1_h53ozj4",
                            "score": 5,
                            "created_utc": 1626233776.0,
                            "replies": [
                                {
                                    "body": "There is a market for that?! :D",
                                    "author": "AnSteall",
                                    "id": "h54tumr",
                                    "parent_id": "t1_h546rib",
                                    "score": 1,
                                    "created_utc": 1626251715.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for your perspective.  Now I’m looking at this as an opportunity to help someone in need",
            "author": "tommypillows",
            "id": "h53cvmu",
            "parent_id": "t1_h53b4y6",
            "score": 8,
            "created_utc": 1626217655.0,
            "replies": []
        },
        {
            "body": "150 mph is 241.4 km/h",
            "author": "converter-bot",
            "id": "h53ww0p",
            "parent_id": "t1_h53wuz3",
            "score": 1,
            "created_utc": 1626228179.0,
            "replies": []
        },
        {
            "body": "I suggest you read [this](https://www.reddit.com/r/sugarlifestyleforum/comments/ojppds/sb_was_in_a_serious_accident_what_to_do_about/h537c01?utm_medium=android_app&utm_source=share&context=3)",
            "author": "jimvasco",
            "id": "h5495ge",
            "parent_id": "t1_h53wuz3",
            "score": 1,
            "created_utc": 1626235248.0,
            "replies": []
        },
        {
            "body": "oh bollocks",
            "author": "sexytimeinseattle",
            "id": "h56cadl",
            "parent_id": "t1_h54vhio",
            "score": -1,
            "created_utc": 1626283297.0,
            "replies": []
        },
        {
            "body": "This is a good approach.",
            "author": null,
            "id": "h55ceoq",
            "parent_id": "t1_h550yuw",
            "score": 1,
            "created_utc": 1626266538.0,
            "replies": []
        },
        {
            "body": "I wholeheartedly disagree. He’d still be a real SD if he chose to walk away. Many SBs walk away when the allowance isn’t met, so what would be the difference if he chose to walk away when his physical needs aren’t being met? He really doesn’t owe her anything and vice versa",
            "author": "LuluvioletSB",
            "id": "h55rnb8",
            "parent_id": "t1_h55hrqq",
            "score": 0,
            "created_utc": 1626274289.0,
            "replies": []
        },
        {
            "body": "Would you say the same if he lost his job and/or was in an accident that stopped his cashflow for 2  months? Would the SB still meeting with him?",
            "author": "401kisfun",
            "id": "h58dmoq",
            "parent_id": "t1_h55hrqq",
            "score": 0,
            "created_utc": 1626318529.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h533xvf",
            "parent_id": "t1_h533n5t",
            "score": 5,
            "created_utc": 1626213220.0,
            "replies": [
                {
                    "body": "He doesnt seem to think its sex work does he? You dont talk about your hooker like this do you? No.\n\nIm not a sex worker ass hole. If you dont like me stay clear. Every sd ive had treats me like a sex worker so yeah in my opinion augarong is glorafied sex but he doesnt seem to act like that. Why dont you actually talk about the post and dont bring previous shit into it?? Damn. Ignore me or soemthing.",
                    "author": "panda_person666",
                    "id": "h535e5n",
                    "parent_id": "t1_h533xvf",
                    "score": -5,
                    "created_utc": 1626213913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like readjusting if that was her idea makes sense but just not doing it all together and going to give it to someone else instead is real fucked up. There are some answers left in the dark though that would make the situation more understandable. Do you support her life mostly like be helping pay most of her bills because she cant on her own, how long have you been together and what kind of relatio ship (ppm or its like an actual dating setting where ypu are considered bf and gf where you financhially support her)",
            "author": "panda_person666",
            "id": "h533zf8",
            "parent_id": "t1_h533n5t",
            "score": 2,
            "created_utc": 1626213240.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h5379v8",
            "parent_id": "t1_h535tex",
            "score": -1,
            "created_utc": 1626214838.0,
            "replies": [
                {
                    "body": "I like this approach.",
                    "author": null,
                    "id": "h54cj06",
                    "parent_id": "t1_h5379v8",
                    "score": 0,
                    "created_utc": 1626237458.0,
                    "replies": [
                        {
                            "body": "Thanks! Apparently some people don’t 🙄",
                            "author": null,
                            "id": "h55c41s",
                            "parent_id": "t1_h54cj06",
                            "score": 0,
                            "created_utc": 1626266363.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is reasonable.",
                    "author": "mraspencer",
                    "id": "h53dpti",
                    "parent_id": "t1_h5379v8",
                    "score": -2,
                    "created_utc": 1626218085.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h53g9zu",
                            "parent_id": "t1_h53dpti",
                            "score": -1,
                            "created_utc": 1626219433.0,
                            "replies": [
                                {
                                    "body": "for sure, connection is key",
                                    "author": "mraspencer",
                                    "id": "h54crrw",
                                    "parent_id": "t1_h53g9zu",
                                    "score": 0,
                                    "created_utc": 1626237626.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, a parting gift of one month would be nice.",
                    "author": "BBSFSA",
                    "id": "h53t72k",
                    "parent_id": "t1_h5379v8",
                    "score": -1,
                    "created_utc": 1626226210.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, in this instance it’s okay for them to agree to “take a break.” Sugar is companionship + sex. He might be able to get the former while she recovers, but definitely not the latter, and I assume OP never said that he was looking for a platonic relationship. On the other hand, OP, if you really want to make her feel special and never forget you, by all means keep supporting her.",
            "author": "vdgift",
            "id": "h540ojp",
            "parent_id": "t1_h535tex",
            "score": -3,
            "created_utc": 1626230257.0,
            "replies": [
                {
                    "body": "Not necessarily, some form of sexual activity may be possible as she recovers.",
                    "author": "CreampieCoupleLA",
                    "id": "h54cdkq",
                    "parent_id": "t1_h540ojp",
                    "score": -2,
                    "created_utc": 1626237358.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not about paying for sex. But it’s likely the SB in the OP’s story won’t be able to see him period for a few months while she’s in the hospital recovering. Should the OP still pay an allowance if he can’t see his SB at all? That’s the main argument. \n\nAnother poster shared a story recently that he still supported (paid monthly allowance) his long term SB while she was in the hospital and he couldn’t see her for a few months. When she recovered she saw him again, collected her monthly allowance, then broke it off a few days later. The OP runs the risk of something similar happening to him.",
            "author": null,
            "id": "h55c89x",
            "parent_id": "t1_h555l9c",
            "score": 4,
            "created_utc": 1626266432.0,
            "replies": [
                {
                    "body": "Why wouldn’t he be able to visit her ?",
                    "author": "WestCoastCompanion",
                    "id": "h56y6xl",
                    "parent_id": "t1_h55c89x",
                    "score": 2,
                    "created_utc": 1626293028.0,
                    "replies": [
                        {
                            "body": "I assume she will have her family and friends around Im the hospital the entire time. I don’t think the SB will want her SD visiting her while everyone else is there.",
                            "author": null,
                            "id": "h56yvhb",
                            "parent_id": "t1_h56y6xl",
                            "score": 0,
                            "created_utc": 1626293326.0,
                            "replies": [
                                {
                                    "body": "…why? Say they are friends, say it’s someone you’re dating, tell your family you’re having a visitor and would like some privacy. She’s not 12 years old. If she doesn’t want to see you or talk to you that’s a different matter, but many of these comments are either implying it outright stating that a woman who’s been in an accident should be tossed aside because she’s sexually useless, albeit temporarily…",
                                    "author": "WestCoastCompanion",
                                    "id": "h5816qe",
                                    "parent_id": "t1_h56yvhb",
                                    "score": 2,
                                    "created_utc": 1626312057.0,
                                    "replies": [
                                        {
                                            "body": "Why are you trying to nitpick? Chances are she won’t want him coming around in the hospital. We don’t know their age gap or their history. Shes 22 so I doubt she will want a much older man coming to visit her in the hospital. \n\nRead the poster who wrote about a similar situation that happened to him recently. He said he didn’t see his sb for a few months while she was in the hospital. I doubt it was his choice not to see her.",
                                            "author": null,
                                            "id": "h58525u",
                                            "parent_id": "t1_h5816qe",
                                            "score": 1,
                                            "created_utc": 1626314036.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s possible.  I’m planning on visiting her in the hospital so we will find out",
            "author": "tommypillows",
            "id": "h53rtx5",
            "parent_id": "t1_h53owiw",
            "score": 3,
            "created_utc": 1626225483.0,
            "replies": []
        },
        {
            "body": "Your advice is baffling to say the least — you just advised him to be humane, while also suggesting that he completely cut off all financial assistance and tell her to text him when she is able to take dick again. Wow, the way some people’s brains work are ludicrous at times.",
            "author": "SenoraVixen",
            "id": "h54mmlq",
            "parent_id": "t1_h533f0c",
            "score": 3,
            "created_utc": 1626245225.0,
            "replies": [
                {
                    "body": "You have a very myopic view of life clearly. I am telling him to extract himself from being an SD and help her as a human. To be ultra blunt the lady won’t hang for an extra week if the guy is unable to support her financially. She may stay in touch via text and someday when Pedro has his job back she may consider him again. Does this all have to be so one sided?",
                    "author": null,
                    "id": "h55c85o",
                    "parent_id": "t1_h54mmlq",
                    "score": 1,
                    "created_utc": 1626266430.0,
                    "replies": []
                },
                {
                    "body": "You completely misread what he said lol. Wtf.",
                    "author": null,
                    "id": "h55ci7n",
                    "parent_id": "t1_h54mmlq",
                    "score": 0,
                    "created_utc": 1626266597.0,
                    "replies": []
                },
                {
                    "body": "If an SD couldn't pay for a while, would you tell the SB to be humane and keep seeing him anyway?",
                    "author": "CreampieCoupleLA",
                    "id": "h59fogs",
                    "parent_id": "t1_h54mmlq",
                    "score": 0,
                    "created_utc": 1626347030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.",
            "author": null,
            "id": "h53aii9",
            "parent_id": "t1_h5338zb",
            "score": 27,
            "created_utc": 1626216447.0,
            "replies": [
                {
                    "body": "He literally said that it would be difficult to find someone like her and he's willing to help. I think he should help as long as he wants but has no obligation to keep helping forever.",
                    "author": "vitor-a",
                    "id": "h53m3nk",
                    "parent_id": "t1_h53aii9",
                    "score": 50,
                    "created_utc": 1626222504.0,
                    "replies": []
                },
                {
                    "body": "And that’s the very reason why I personally wouldn’t continue supporting her. Maybe give her a month’s allowance as a gift, but then go about my way.",
                    "author": null,
                    "id": "h53iihe",
                    "parent_id": "t1_h53aii9",
                    "score": -11,
                    "created_utc": 1626220610.0,
                    "replies": [
                        {
                            "body": ">It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.\n\nThis is a valid point that the OP needs to carefully consider.",
                            "author": "2020Traveller",
                            "id": "h53lnxi",
                            "parent_id": "t1_h53iihe",
                            "score": 0,
                            "created_utc": 1626222276.0,
                            "replies": [
                                {
                                    "body": "I think it’s a little different situation for her.  She couldn’t weather the storm quite as well as I can",
                                    "author": "tommypillows",
                                    "id": "h540ksf",
                                    "parent_id": "t1_h53lnxi",
                                    "score": 25,
                                    "created_utc": 1626230198.0,
                                    "replies": [
                                        {
                                            "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
                                            "author": "Yourstruly0",
                                            "id": "h546cs2",
                                            "parent_id": "t1_h540ksf",
                                            "score": 36,
                                            "created_utc": 1626233527.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bingo !!! Agree 300 percent.",
                    "author": null,
                    "id": "h54zcur",
                    "parent_id": "t1_h53aii9",
                    "score": -2,
                    "created_utc": 1626256880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"In the end I won't miss the money\"   puts it into perspective",
            "author": "pinotandsugar",
            "id": "h55h2ah",
            "parent_id": "t1_h55bsrk",
            "score": 12,
            "created_utc": 1626269154.0,
            "replies": [
                {
                    "body": "Money is never the issue! It goes but often comes back. The principle, the time and opportunity cost is where it’s all at.",
                    "author": null,
                    "id": "h56s21y",
                    "parent_id": "t1_h55h2ah",
                    "score": 0,
                    "created_utc": 1626290305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Think of it as she's being sent to the farm (repair)  club for spring training ......",
            "author": "pinotandsugar",
            "id": "h578jzi",
            "parent_id": "t1_h55bsrk",
            "score": 1,
            "created_utc": 1626297656.0,
            "replies": []
        },
        {
            "body": "I see your edit at the top, but just to add perspective - I knew my former SD about 4-6 weeks before NYC shut down for the pandemic. He continued to pay my allowance through Sept and if he ever appeared in my life again, I would drop everything to help him if he needed it. He single-handedly kept me afloat with a reasonable allowance and I just... I'd go to bat for him in every non sexual way possible, that's how thankful I am.\n\nI tried to convey the scope of my gratitude but am not sure if he realizes the difference he made. Anyway. Support in hard times means the world. Thank you, on her behalf, for being an exceptional person.",
            "author": "secretactorian",
            "id": "h53stkc",
            "parent_id": "t1_h533ggx",
            "score": 64,
            "created_utc": 1626226010.0,
            "replies": [
                {
                    "body": "I'm confused. So the two of you didn't see each other at all in person all through the pandemic? Why?\n\nWould you go to bat for him in sexual ways?",
                    "author": "CreampieCoupleLA",
                    "id": "h54buv6",
                    "parent_id": "t1_h53stkc",
                    "score": 2,
                    "created_utc": 1626237009.0,
                    "replies": [
                        {
                            "body": "Not sure what there is to be confused about.\n\n1. He has 2 young kids, lives in PA. He didn’t want to risk it. Not everyone was comfortable with it, you know. \n\n2. Ok jeez, you got me, that was just poor phrasing. I'm no longer in the bowl so i wouldn't resume seeing him is what I meant.",
                            "author": "secretactorian",
                            "id": "h54w2jb",
                            "parent_id": "t1_h54buv6",
                            "score": 10,
                            "created_utc": 1626253836.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Six weeks is kind of short.  It depends on how you feel things were going, and if you were planning on making it long term.  If yes, then continuing allowance (full or reduced is up to you) while she recuperates would be kind and generous.  Ultimately it’s up to you.",
            "author": "throwawayrdu71",
            "id": "h538scb",
            "parent_id": "t1_h533ggx",
            "score": 7,
            "created_utc": 1626215584.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h5344ld",
            "parent_id": "t1_h533ppu",
            "score": 21,
            "created_utc": 1626213308.0,
            "replies": [
                {
                    "body": "By \"intimacy\" you mean sex, right?\n\nThey may still be able to have some form of sexual activity as she is recovering.",
                    "author": "CreampieCoupleLA",
                    "id": "h54bzcn",
                    "parent_id": "t1_h5344ld",
                    "score": 4,
                    "created_utc": 1626237091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We all know the answer to this question, and it's definitely a different one than she is advocating to the OP.",
            "author": "storm170",
            "id": "h54hzip",
            "parent_id": "t1_h54dvfg",
            "score": 11,
            "created_utc": 1626241417.0,
            "replies": [
                {
                    "body": "Of course we do, I’m just tired of the shitty double standard if I’m being honest.",
                    "author": "Overwatch61",
                    "id": "h54oetv",
                    "parent_id": "t1_h54hzip",
                    "score": 3,
                    "created_utc": 1626246796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this was an awesome response!!! SBs will drop you in a second if they find a better allowance, and they won't give a damn. But suddenly all the SB's out there are mother theresas!!! 😂",
            "author": "MiLocavida",
            "id": "h555x3l",
            "parent_id": "t1_h54dvfg",
            "score": 1,
            "created_utc": 1626262260.0,
            "replies": [
                {
                    "body": "> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nWill they?\n\nI've been sugaring for over 5 years now.  I've never had an SR end / SB leave, because they got a higher allowance somewhere else.\n\nTo be clear - I'm not claiming I provide a high amount.  It would likely be more on the average/splenda side, depending on how you look at it.\n\nBut I do provide a consistent amount.  Which is seems like many of the PPM guys here do not.",
                    "author": "SDstartingOut",
                    "id": "h55gnh1",
                    "parent_id": "t1_h555x3l",
                    "score": 4,
                    "created_utc": 1626268932.0,
                    "replies": [
                        {
                            "body": ">To be clear - I'm not claiming I provide a high amount.   It would likely be more on the average/splenda side,\n\nthat's your answer...plenty of SB's who can get higher allowances, and the rules of supply and demand apply in the bowl. Some SBs are desired by many SDs.",
                            "author": "MiLocavida",
                            "id": "h5603f0",
                            "parent_id": "t1_h55gnh1",
                            "score": 1,
                            "created_utc": 1626278012.0,
                            "replies": [
                                {
                                    "body": "> that's your answer..\n\nBut that's my whole point.\n\nI've never had an SB \"leave\" me for another SD.  With the exception of 2 situations (SB flaked/ghosted after 1 intimate date) - I have ended every single one of my SRs.",
                                    "author": "SDstartingOut",
                                    "id": "h567u0m",
                                    "parent_id": "t1_h5603f0",
                                    "score": 1,
                                    "created_utc": 1626281360.0,
                                    "replies": [
                                        {
                                            "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
                                            "author": "MiLocavida",
                                            "id": "h56aizi",
                                            "parent_id": "t1_h567u0m",
                                            "score": 1,
                                            "created_utc": 1626282520.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
                                            "author": "CreampieCoupleLA",
                                            "id": "h59f52d",
                                            "parent_id": "t1_h567u0m",
                                            "score": 1,
                                            "created_utc": 1626346614.0,
                                            "replies": [
                                                {
                                                    "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                                                    "author": "SDstartingOut",
                                                    "id": "h59kkjt",
                                                    "parent_id": "t1_h59f52d",
                                                    "score": 1,
                                                    "created_utc": 1626350435.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Incorrect analogy. We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job",
                            "author": "401kisfun",
                            "id": "h57bjuj",
                            "parent_id": "t1_h55gnh1",
                            "score": 1,
                            "created_utc": 1626299039.0,
                            "replies": [
                                {
                                    "body": "There is nothing incorrect about it.  I was replying to a specific comment that stated \" SBs will drop you in a second if they find a better allowance\".  And I stand behind my statement.  \n\n> We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job\n\nI have to say, this commentary is typically baffling to me.  Specifically that - 2 months would be the end of the world.  Just like an SD that supposedly can't provide a given allowance/ppm due \"cash flow issues\".  I wouldn't be sugaring - if I didn't have a year's worth of living expenses sitting on the sidelines.  .",
                                    "author": "SDstartingOut",
                                    "id": "h59le59",
                                    "parent_id": "t1_h57bjuj",
                                    "score": 1,
                                    "created_utc": 1626350961.0,
                                    "replies": [
                                        {
                                            "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
                                            "author": "401kisfun",
                                            "id": "h5a0s8x",
                                            "parent_id": "t1_h59le59",
                                            "score": 1,
                                            "created_utc": 1626358892.0,
                                            "replies": [
                                                {
                                                    "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                                                    "author": "SDstartingOut",
                                                    "id": "h5a3tpw",
                                                    "parent_id": "t1_h5a0s8x",
                                                    "score": 1,
                                                    "created_utc": 1626360253.0,
                                                    "replies": [
                                                        {
                                                            "body": "The question is directed at an SB",
                                                            "author": "401kisfun",
                                                            "id": "h5a3wv1",
                                                            "parent_id": "t1_h5a3tpw",
                                                            "score": 1,
                                                            "created_utc": 1626360291.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The only thing that beats the response is all the downvotes from the salty SBs hahahaha. Gotta love women pushing for double standards amidst the biggest female equality movement of our generation lol. Oh the irony 😂",
                    "author": "Overwatch61",
                    "id": "h557wgu",
                    "parent_id": "t1_h555x3l",
                    "score": -1,
                    "created_utc": 1626263661.0,
                    "replies": [
                        {
                            "body": ">amidst the biggest female equality movement of our generation\n\nbetter keep it on the down low or you might get canceled! 😂",
                            "author": "MiLocavida",
                            "id": "h55bp1c",
                            "parent_id": "t1_h557wgu",
                            "score": -1,
                            "created_utc": 1626266111.0,
                            "replies": [
                                {
                                    "body": "Oh god, the younger generations lingo genuinely makes me cringe haha. I can only assume my parents felt the same way about the things I said growing up though.",
                                    "author": "Overwatch61",
                                    "id": "h56iuds",
                                    "parent_id": "t1_h55bp1c",
                                    "score": 0,
                                    "created_utc": 1626286170.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h53vi3l",
            "parent_id": "t1_h53cfaq",
            "score": 10,
            "created_utc": 1626227434.0,
            "replies": [
                {
                    "body": "People seem to be forgetting this girl is an actual person. If I had the means to without suffering I would help her out simply because I know that support could very literally change the trajectory of her life at this point. This is an event that will likely mark a before/after point in her personal history. Someone having her back during this could change whether this accident spells tragedy for her.",
                    "author": "Yourstruly0",
                    "id": "h5474gy",
                    "parent_id": "t1_h53vi3l",
                    "score": 8,
                    "created_utc": 1626233994.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree.  Like I said, knowing this doesn't change my answer one bit.  \n\nI do, however, take the remarks of those who claim \"if you don't do X you're **not a real SD**\" with more than a grain of salt -- do it because it's the right thing to do in the context of your SR and how you value your SB in your life, not because someone is playing the \"real SD\" card, especially since so many of these *someones* are so fast on the trigger with \"dump that loser\" when things are reversed.",
            "author": "Azurecole",
            "id": "h53874q",
            "parent_id": "t1_h537eci",
            "score": 10,
            "created_utc": 1626215291.0,
            "replies": []
        },
        {
            "body": "Well in general sd’s have more resources \nThan say a sb majority of them are broke af and some of them are snobbish and have rich dads back home.",
            "author": null,
            "id": "h53os7o",
            "parent_id": "t1_h5375yp",
            "score": 5,
            "created_utc": 1626223898.0,
            "replies": [
                {
                    "body": "Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it. \n\nThat’s like telling a SB, sleeping with a SD while he’s financially hurting isn’t going to cost her anything because she has an unlimited amount of pussy she can give out to her partners & it isn’t going to hurt her because she has more pussy then he does and she can still sleep with other people",
                    "author": null,
                    "id": "h55ch8o",
                    "parent_id": "t1_h53os7o",
                    "score": -1,
                    "created_utc": 1626266581.0,
                    "replies": [
                        {
                            "body": "It is an actual statistic that men are more likely to leave their female partner was she to be hit with some major health issues. With cancer this ratio is 1:6. This is without the bowl.\n\nI understand 'in the bow' you're in a quasi relationship. If you do not wish to keep the emphasis on 'transactional' but on emotional, would you answer still be the same?\n\nI notice that the SR has similarities to 19050s (and prior) power dynamics within a marriage where the man was the provider and the female essentially a servant who had to be grateful for being provided for. That view is still not outdated in many parts of the world.\n\n&#x200B;\n\n>Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it.\n\nThis is pretty much that outdated world view. If in a (sugar) relationship you can't have the empathy to continue supporting your SB, do you even qualify as a SD or are you just using a glorified escort service?\n\nSure, I also read plenty of women advising others to dump a SD who doesn't pay but there were also enough stories where SD was late or P&D or were willing to compromise.  \n\n\nI mean, if you found someone who gave you affection that you are paying for, would you even need a SB?",
                            "author": "AnSteall",
                            "id": "h57o4wa",
                            "parent_id": "t1_h55ch8o",
                            "score": 2,
                            "created_utc": 1626305246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wonder , if these same SB’s stayed in their SR or took less allowance during the financial crash of 2008?",
            "author": "lostsoul9999999",
            "id": "h53meki",
            "parent_id": "t1_h5375yp",
            "score": 0,
            "created_utc": 1626222664.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h53t6ui",
                    "parent_id": "t1_h53meki",
                    "score": 10,
                    "created_utc": 1626226207.0,
                    "replies": [
                        {
                            "body": "Well I’ll enlighten you about my experience. \n\nThe SB that I had , showed her true colors during this rough patch. \n\nBetween 2005-2007 , we had the greatest relationship in the world. She received an allowance, car , apartment, health insurance and traveled with me on business.\n\nI was a lover , friend , and mentor.\n\n2008 comes and my liquidity dries up.\n\nWe had a long talk , and I told her. Things will have to change for a bit. You can keep the car and apartment until the lease is up. But the health insurance and allowance has to stop. \n\nI didn’t expect intimacy from her at this point. But all I was asking for was emotional support during these tough times in my life.\n\nWell it didn’t go well. \n\nEvery time we spoke she always had a problem, and now that I wasn’t Financially able to solve them. She had to go because she is depressed.\n\nNever mind what I was going through.\n\nSo if the Op decides to continue supporting her during these tough times. I would suggest thinking of her as a long term commitment, because you are now sharing a life experience..\n\nBut remember after she has recovered, she owes you nothing.",
                            "author": "lostsoul9999999",
                            "id": "h53vcup",
                            "parent_id": "t1_h53t6ui",
                            "score": 4,
                            "created_utc": 1626227357.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h53ww1d",
                                    "parent_id": "t1_h53vcup",
                                    "score": 6,
                                    "created_utc": 1626228179.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for the kind words.",
                                            "author": "lostsoul9999999",
                                            "id": "h542rk6",
                                            "parent_id": "t1_h53ww1d",
                                            "score": 0,
                                            "created_utc": 1626231432.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't disagree and I am not trying to be the white knight here. The young lady I was seeing was a Cali transplant. She knew nobody in NYC. She was in  real estate sales, so.no income. We were on PPM,  so I sent her some money periodically to help. It wasn't going to change my life financially, and I believe it helped her tremendously, so....",
            "author": "Teejaynj",
            "id": "h56yhgs",
            "parent_id": "t1_h55fk6g",
            "score": 3,
            "created_utc": 1626293154.0,
            "replies": []
        },
        {
            "body": "I would be interested to know which part of it you have a problem understanding.",
            "author": "AnSteall",
            "id": "h54tsts",
            "parent_id": "t1_h54c6bz",
            "score": 8,
            "created_utc": 1626251669.0,
            "replies": [
                {
                    "body": "Why anyone would stop seeing someone they're dating?",
                    "author": "CreampieCoupleLA",
                    "id": "h59fug5",
                    "parent_id": "t1_h54tsts",
                    "score": 1,
                    "created_utc": 1626347153.0,
                    "replies": [
                        {
                            "body": "Something about passing on the virus? Here in the UK we had 'bubbles' which were named households you were allowed to meet with - under 6 people though.\n\nI assume that if a SD is married, the mistress is not going to be one of those households. Spreading infection is not just about those who meet but about those who might catch from those they met. Vulnerable people in the household, overstretched health services are just a couple of things people considered when minimising non-essential contact during the plague.",
                            "author": "AnSteall",
                            "id": "h59ls3e",
                            "parent_id": "t1_h59fug5",
                            "score": 1,
                            "created_utc": 1626351207.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmm idk maybe because of the PANDEMIC. 🙄\n\nYou’re not going to believe this—- Some of us actually isolated and didn’t see our own families for the entire year+",
            "author": "GeminiGirlyGirl",
            "id": "h550a86",
            "parent_id": "t1_h54c6bz",
            "score": 7,
            "created_utc": 1626257703.0,
            "replies": []
        },
        {
            "body": "Well, like most people, I waited to gather as much information as I could to assess my risk and assess the risk my actions could be to others. When I determined that I could take precautions to minimize risk, I proceeded to live a modified life. Sugar dating was not part of that early on. When cases went down during the summer, I decided it was OK to see my SB. When I was able to get vaccinated,  I did. So did my new SB. We are leading a relatively normal life now. I do understand that some people don't feel comfortable and I am not judging. Everyone needs to determine the risk they are willing to take. If you are vaccinated,  you shouldn't worry about anyone else. If that doesn't work for you, stay home. The world and life need to go on.",
            "author": "Teejaynj",
            "id": "h55f80r",
            "parent_id": "t1_h54c6bz",
            "score": 3,
            "created_utc": 1626268153.0,
            "replies": [
                {
                    "body": "Man, I was meeting up with POTs by June of 2020. The people using COVID as an excuse not to meet up are the people who would have made another excuse if it wasn’t COVID.",
                    "author": null,
                    "id": "h55ghyu",
                    "parent_id": "t1_h55f80r",
                    "score": -4,
                    "created_utc": 1626268851.0,
                    "replies": [
                        {
                            "body": "People have parents and grandparents at home.",
                            "author": null,
                            "id": "h55px1b",
                            "parent_id": "t1_h55ghyu",
                            "score": 4,
                            "created_utc": 1626273499.0,
                            "replies": [
                                {
                                    "body": "And suddenly in the transplant heavy town of NYC, 30% of POTs lived with their grandparents. Roughly the same % of people who, before COVID and perpetually during my time on SA, couldn’t meet up but would “love to start something virtual.”",
                                    "author": null,
                                    "id": "h55r77g",
                                    "parent_id": "t1_h55px1b",
                                    "score": -1,
                                    "created_utc": 1626274089.0,
                                    "replies": [
                                        {
                                            "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
                                            "author": "ScreenPeepinE",
                                            "id": "h55vb7a",
                                            "parent_id": "t1_h55r77g",
                                            "score": 0,
                                            "created_utc": 1626275942.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think end of June is when I resumed as well",
                            "author": "Teejaynj",
                            "id": "h56xtv6",
                            "parent_id": "t1_h55ghyu",
                            "score": 1,
                            "created_utc": 1626292869.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you want a reply from me you do lol",
            "author": "itsmevajrayogini",
            "id": "h53ozj4",
            "parent_id": "t1_h53guie",
            "score": 8,
            "created_utc": 1626224004.0,
            "replies": [
                {
                    "body": "Brother doesn’t have money OR the ability to spell. The only responses hes getting are from Nigerian Princesses.",
                    "author": "Yourstruly0",
                    "id": "h546rib",
                    "parent_id": "t1_h53ozj4",
                    "score": 5,
                    "created_utc": 1626233776.0,
                    "replies": [
                        {
                            "body": "There is a market for that?! :D",
                            "author": "AnSteall",
                            "id": "h54tumr",
                            "parent_id": "t1_h546rib",
                            "score": 1,
                            "created_utc": 1626251715.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He doesnt seem to think its sex work does he? You dont talk about your hooker like this do you? No.\n\nIm not a sex worker ass hole. If you dont like me stay clear. Every sd ive had treats me like a sex worker so yeah in my opinion augarong is glorafied sex but he doesnt seem to act like that. Why dont you actually talk about the post and dont bring previous shit into it?? Damn. Ignore me or soemthing.",
            "author": "panda_person666",
            "id": "h535e5n",
            "parent_id": "t1_h533xvf",
            "score": -5,
            "created_utc": 1626213913.0,
            "replies": []
        },
        {
            "body": "I like this approach.",
            "author": null,
            "id": "h54cj06",
            "parent_id": "t1_h5379v8",
            "score": 0,
            "created_utc": 1626237458.0,
            "replies": [
                {
                    "body": "Thanks! Apparently some people don’t 🙄",
                    "author": null,
                    "id": "h55c41s",
                    "parent_id": "t1_h54cj06",
                    "score": 0,
                    "created_utc": 1626266363.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is reasonable.",
            "author": "mraspencer",
            "id": "h53dpti",
            "parent_id": "t1_h5379v8",
            "score": -2,
            "created_utc": 1626218085.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h53g9zu",
                    "parent_id": "t1_h53dpti",
                    "score": -1,
                    "created_utc": 1626219433.0,
                    "replies": [
                        {
                            "body": "for sure, connection is key",
                            "author": "mraspencer",
                            "id": "h54crrw",
                            "parent_id": "t1_h53g9zu",
                            "score": 0,
                            "created_utc": 1626237626.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, a parting gift of one month would be nice.",
            "author": "BBSFSA",
            "id": "h53t72k",
            "parent_id": "t1_h5379v8",
            "score": -1,
            "created_utc": 1626226210.0,
            "replies": []
        },
        {
            "body": "Not necessarily, some form of sexual activity may be possible as she recovers.",
            "author": "CreampieCoupleLA",
            "id": "h54cdkq",
            "parent_id": "t1_h540ojp",
            "score": -2,
            "created_utc": 1626237358.0,
            "replies": []
        },
        {
            "body": "Why wouldn’t he be able to visit her ?",
            "author": "WestCoastCompanion",
            "id": "h56y6xl",
            "parent_id": "t1_h55c89x",
            "score": 2,
            "created_utc": 1626293028.0,
            "replies": [
                {
                    "body": "I assume she will have her family and friends around Im the hospital the entire time. I don’t think the SB will want her SD visiting her while everyone else is there.",
                    "author": null,
                    "id": "h56yvhb",
                    "parent_id": "t1_h56y6xl",
                    "score": 0,
                    "created_utc": 1626293326.0,
                    "replies": [
                        {
                            "body": "…why? Say they are friends, say it’s someone you’re dating, tell your family you’re having a visitor and would like some privacy. She’s not 12 years old. If she doesn’t want to see you or talk to you that’s a different matter, but many of these comments are either implying it outright stating that a woman who’s been in an accident should be tossed aside because she’s sexually useless, albeit temporarily…",
                            "author": "WestCoastCompanion",
                            "id": "h5816qe",
                            "parent_id": "t1_h56yvhb",
                            "score": 2,
                            "created_utc": 1626312057.0,
                            "replies": [
                                {
                                    "body": "Why are you trying to nitpick? Chances are she won’t want him coming around in the hospital. We don’t know their age gap or their history. Shes 22 so I doubt she will want a much older man coming to visit her in the hospital. \n\nRead the poster who wrote about a similar situation that happened to him recently. He said he didn’t see his sb for a few months while she was in the hospital. I doubt it was his choice not to see her.",
                                    "author": null,
                                    "id": "h58525u",
                                    "parent_id": "t1_h5816qe",
                                    "score": 1,
                                    "created_utc": 1626314036.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have a very myopic view of life clearly. I am telling him to extract himself from being an SD and help her as a human. To be ultra blunt the lady won’t hang for an extra week if the guy is unable to support her financially. She may stay in touch via text and someday when Pedro has his job back she may consider him again. Does this all have to be so one sided?",
            "author": null,
            "id": "h55c85o",
            "parent_id": "t1_h54mmlq",
            "score": 1,
            "created_utc": 1626266430.0,
            "replies": []
        },
        {
            "body": "You completely misread what he said lol. Wtf.",
            "author": null,
            "id": "h55ci7n",
            "parent_id": "t1_h54mmlq",
            "score": 0,
            "created_utc": 1626266597.0,
            "replies": []
        },
        {
            "body": "If an SD couldn't pay for a while, would you tell the SB to be humane and keep seeing him anyway?",
            "author": "CreampieCoupleLA",
            "id": "h59fogs",
            "parent_id": "t1_h54mmlq",
            "score": 0,
            "created_utc": 1626347030.0,
            "replies": []
        },
        {
            "body": "He literally said that it would be difficult to find someone like her and he's willing to help. I think he should help as long as he wants but has no obligation to keep helping forever.",
            "author": "vitor-a",
            "id": "h53m3nk",
            "parent_id": "t1_h53aii9",
            "score": 50,
            "created_utc": 1626222504.0,
            "replies": []
        },
        {
            "body": "And that’s the very reason why I personally wouldn’t continue supporting her. Maybe give her a month’s allowance as a gift, but then go about my way.",
            "author": null,
            "id": "h53iihe",
            "parent_id": "t1_h53aii9",
            "score": -11,
            "created_utc": 1626220610.0,
            "replies": [
                {
                    "body": ">It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.\n\nThis is a valid point that the OP needs to carefully consider.",
                    "author": "2020Traveller",
                    "id": "h53lnxi",
                    "parent_id": "t1_h53iihe",
                    "score": 0,
                    "created_utc": 1626222276.0,
                    "replies": [
                        {
                            "body": "I think it’s a little different situation for her.  She couldn’t weather the storm quite as well as I can",
                            "author": "tommypillows",
                            "id": "h540ksf",
                            "parent_id": "t1_h53lnxi",
                            "score": 25,
                            "created_utc": 1626230198.0,
                            "replies": [
                                {
                                    "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
                                    "author": "Yourstruly0",
                                    "id": "h546cs2",
                                    "parent_id": "t1_h540ksf",
                                    "score": 36,
                                    "created_utc": 1626233527.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bingo !!! Agree 300 percent.",
            "author": null,
            "id": "h54zcur",
            "parent_id": "t1_h53aii9",
            "score": -2,
            "created_utc": 1626256880.0,
            "replies": []
        },
        {
            "body": "Money is never the issue! It goes but often comes back. The principle, the time and opportunity cost is where it’s all at.",
            "author": null,
            "id": "h56s21y",
            "parent_id": "t1_h55h2ah",
            "score": 0,
            "created_utc": 1626290305.0,
            "replies": []
        },
        {
            "body": "I'm confused. So the two of you didn't see each other at all in person all through the pandemic? Why?\n\nWould you go to bat for him in sexual ways?",
            "author": "CreampieCoupleLA",
            "id": "h54buv6",
            "parent_id": "t1_h53stkc",
            "score": 2,
            "created_utc": 1626237009.0,
            "replies": [
                {
                    "body": "Not sure what there is to be confused about.\n\n1. He has 2 young kids, lives in PA. He didn’t want to risk it. Not everyone was comfortable with it, you know. \n\n2. Ok jeez, you got me, that was just poor phrasing. I'm no longer in the bowl so i wouldn't resume seeing him is what I meant.",
                    "author": "secretactorian",
                    "id": "h54w2jb",
                    "parent_id": "t1_h54buv6",
                    "score": 10,
                    "created_utc": 1626253836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "By \"intimacy\" you mean sex, right?\n\nThey may still be able to have some form of sexual activity as she is recovering.",
            "author": "CreampieCoupleLA",
            "id": "h54bzcn",
            "parent_id": "t1_h5344ld",
            "score": 4,
            "created_utc": 1626237091.0,
            "replies": []
        },
        {
            "body": "Of course we do, I’m just tired of the shitty double standard if I’m being honest.",
            "author": "Overwatch61",
            "id": "h54oetv",
            "parent_id": "t1_h54hzip",
            "score": 3,
            "created_utc": 1626246796.0,
            "replies": []
        },
        {
            "body": "> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nWill they?\n\nI've been sugaring for over 5 years now.  I've never had an SR end / SB leave, because they got a higher allowance somewhere else.\n\nTo be clear - I'm not claiming I provide a high amount.  It would likely be more on the average/splenda side, depending on how you look at it.\n\nBut I do provide a consistent amount.  Which is seems like many of the PPM guys here do not.",
            "author": "SDstartingOut",
            "id": "h55gnh1",
            "parent_id": "t1_h555x3l",
            "score": 4,
            "created_utc": 1626268932.0,
            "replies": [
                {
                    "body": ">To be clear - I'm not claiming I provide a high amount.   It would likely be more on the average/splenda side,\n\nthat's your answer...plenty of SB's who can get higher allowances, and the rules of supply and demand apply in the bowl. Some SBs are desired by many SDs.",
                    "author": "MiLocavida",
                    "id": "h5603f0",
                    "parent_id": "t1_h55gnh1",
                    "score": 1,
                    "created_utc": 1626278012.0,
                    "replies": [
                        {
                            "body": "> that's your answer..\n\nBut that's my whole point.\n\nI've never had an SB \"leave\" me for another SD.  With the exception of 2 situations (SB flaked/ghosted after 1 intimate date) - I have ended every single one of my SRs.",
                            "author": "SDstartingOut",
                            "id": "h567u0m",
                            "parent_id": "t1_h5603f0",
                            "score": 1,
                            "created_utc": 1626281360.0,
                            "replies": [
                                {
                                    "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
                                    "author": "MiLocavida",
                                    "id": "h56aizi",
                                    "parent_id": "t1_h567u0m",
                                    "score": 1,
                                    "created_utc": 1626282520.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
                                    "author": "CreampieCoupleLA",
                                    "id": "h59f52d",
                                    "parent_id": "t1_h567u0m",
                                    "score": 1,
                                    "created_utc": 1626346614.0,
                                    "replies": [
                                        {
                                            "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                                            "author": "SDstartingOut",
                                            "id": "h59kkjt",
                                            "parent_id": "t1_h59f52d",
                                            "score": 1,
                                            "created_utc": 1626350435.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Incorrect analogy. We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job",
                    "author": "401kisfun",
                    "id": "h57bjuj",
                    "parent_id": "t1_h55gnh1",
                    "score": 1,
                    "created_utc": 1626299039.0,
                    "replies": [
                        {
                            "body": "There is nothing incorrect about it.  I was replying to a specific comment that stated \" SBs will drop you in a second if they find a better allowance\".  And I stand behind my statement.  \n\n> We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job\n\nI have to say, this commentary is typically baffling to me.  Specifically that - 2 months would be the end of the world.  Just like an SD that supposedly can't provide a given allowance/ppm due \"cash flow issues\".  I wouldn't be sugaring - if I didn't have a year's worth of living expenses sitting on the sidelines.  .",
                            "author": "SDstartingOut",
                            "id": "h59le59",
                            "parent_id": "t1_h57bjuj",
                            "score": 1,
                            "created_utc": 1626350961.0,
                            "replies": [
                                {
                                    "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
                                    "author": "401kisfun",
                                    "id": "h5a0s8x",
                                    "parent_id": "t1_h59le59",
                                    "score": 1,
                                    "created_utc": 1626358892.0,
                                    "replies": [
                                        {
                                            "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                                            "author": "SDstartingOut",
                                            "id": "h5a3tpw",
                                            "parent_id": "t1_h5a0s8x",
                                            "score": 1,
                                            "created_utc": 1626360253.0,
                                            "replies": [
                                                {
                                                    "body": "The question is directed at an SB",
                                                    "author": "401kisfun",
                                                    "id": "h5a3wv1",
                                                    "parent_id": "t1_h5a3tpw",
                                                    "score": 1,
                                                    "created_utc": 1626360291.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The only thing that beats the response is all the downvotes from the salty SBs hahahaha. Gotta love women pushing for double standards amidst the biggest female equality movement of our generation lol. Oh the irony 😂",
            "author": "Overwatch61",
            "id": "h557wgu",
            "parent_id": "t1_h555x3l",
            "score": -1,
            "created_utc": 1626263661.0,
            "replies": [
                {
                    "body": ">amidst the biggest female equality movement of our generation\n\nbetter keep it on the down low or you might get canceled! 😂",
                    "author": "MiLocavida",
                    "id": "h55bp1c",
                    "parent_id": "t1_h557wgu",
                    "score": -1,
                    "created_utc": 1626266111.0,
                    "replies": [
                        {
                            "body": "Oh god, the younger generations lingo genuinely makes me cringe haha. I can only assume my parents felt the same way about the things I said growing up though.",
                            "author": "Overwatch61",
                            "id": "h56iuds",
                            "parent_id": "t1_h55bp1c",
                            "score": 0,
                            "created_utc": 1626286170.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People seem to be forgetting this girl is an actual person. If I had the means to without suffering I would help her out simply because I know that support could very literally change the trajectory of her life at this point. This is an event that will likely mark a before/after point in her personal history. Someone having her back during this could change whether this accident spells tragedy for her.",
            "author": "Yourstruly0",
            "id": "h5474gy",
            "parent_id": "t1_h53vi3l",
            "score": 8,
            "created_utc": 1626233994.0,
            "replies": []
        },
        {
            "body": "Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it. \n\nThat’s like telling a SB, sleeping with a SD while he’s financially hurting isn’t going to cost her anything because she has an unlimited amount of pussy she can give out to her partners & it isn’t going to hurt her because she has more pussy then he does and she can still sleep with other people",
            "author": null,
            "id": "h55ch8o",
            "parent_id": "t1_h53os7o",
            "score": -1,
            "created_utc": 1626266581.0,
            "replies": [
                {
                    "body": "It is an actual statistic that men are more likely to leave their female partner was she to be hit with some major health issues. With cancer this ratio is 1:6. This is without the bowl.\n\nI understand 'in the bow' you're in a quasi relationship. If you do not wish to keep the emphasis on 'transactional' but on emotional, would you answer still be the same?\n\nI notice that the SR has similarities to 19050s (and prior) power dynamics within a marriage where the man was the provider and the female essentially a servant who had to be grateful for being provided for. That view is still not outdated in many parts of the world.\n\n&#x200B;\n\n>Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it.\n\nThis is pretty much that outdated world view. If in a (sugar) relationship you can't have the empathy to continue supporting your SB, do you even qualify as a SD or are you just using a glorified escort service?\n\nSure, I also read plenty of women advising others to dump a SD who doesn't pay but there were also enough stories where SD was late or P&D or were willing to compromise.  \n\n\nI mean, if you found someone who gave you affection that you are paying for, would you even need a SB?",
                    "author": "AnSteall",
                    "id": "h57o4wa",
                    "parent_id": "t1_h55ch8o",
                    "score": 2,
                    "created_utc": 1626305246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h53t6ui",
            "parent_id": "t1_h53meki",
            "score": 10,
            "created_utc": 1626226207.0,
            "replies": [
                {
                    "body": "Well I’ll enlighten you about my experience. \n\nThe SB that I had , showed her true colors during this rough patch. \n\nBetween 2005-2007 , we had the greatest relationship in the world. She received an allowance, car , apartment, health insurance and traveled with me on business.\n\nI was a lover , friend , and mentor.\n\n2008 comes and my liquidity dries up.\n\nWe had a long talk , and I told her. Things will have to change for a bit. You can keep the car and apartment until the lease is up. But the health insurance and allowance has to stop. \n\nI didn’t expect intimacy from her at this point. But all I was asking for was emotional support during these tough times in my life.\n\nWell it didn’t go well. \n\nEvery time we spoke she always had a problem, and now that I wasn’t Financially able to solve them. She had to go because she is depressed.\n\nNever mind what I was going through.\n\nSo if the Op decides to continue supporting her during these tough times. I would suggest thinking of her as a long term commitment, because you are now sharing a life experience..\n\nBut remember after she has recovered, she owes you nothing.",
                    "author": "lostsoul9999999",
                    "id": "h53vcup",
                    "parent_id": "t1_h53t6ui",
                    "score": 4,
                    "created_utc": 1626227357.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h53ww1d",
                            "parent_id": "t1_h53vcup",
                            "score": 6,
                            "created_utc": 1626228179.0,
                            "replies": [
                                {
                                    "body": "Thank you for the kind words.",
                                    "author": "lostsoul9999999",
                                    "id": "h542rk6",
                                    "parent_id": "t1_h53ww1d",
                                    "score": 0,
                                    "created_utc": 1626231432.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why anyone would stop seeing someone they're dating?",
            "author": "CreampieCoupleLA",
            "id": "h59fug5",
            "parent_id": "t1_h54tsts",
            "score": 1,
            "created_utc": 1626347153.0,
            "replies": [
                {
                    "body": "Something about passing on the virus? Here in the UK we had 'bubbles' which were named households you were allowed to meet with - under 6 people though.\n\nI assume that if a SD is married, the mistress is not going to be one of those households. Spreading infection is not just about those who meet but about those who might catch from those they met. Vulnerable people in the household, overstretched health services are just a couple of things people considered when minimising non-essential contact during the plague.",
                    "author": "AnSteall",
                    "id": "h59ls3e",
                    "parent_id": "t1_h59fug5",
                    "score": 1,
                    "created_utc": 1626351207.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man, I was meeting up with POTs by June of 2020. The people using COVID as an excuse not to meet up are the people who would have made another excuse if it wasn’t COVID.",
            "author": null,
            "id": "h55ghyu",
            "parent_id": "t1_h55f80r",
            "score": -4,
            "created_utc": 1626268851.0,
            "replies": [
                {
                    "body": "People have parents and grandparents at home.",
                    "author": null,
                    "id": "h55px1b",
                    "parent_id": "t1_h55ghyu",
                    "score": 4,
                    "created_utc": 1626273499.0,
                    "replies": [
                        {
                            "body": "And suddenly in the transplant heavy town of NYC, 30% of POTs lived with their grandparents. Roughly the same % of people who, before COVID and perpetually during my time on SA, couldn’t meet up but would “love to start something virtual.”",
                            "author": null,
                            "id": "h55r77g",
                            "parent_id": "t1_h55px1b",
                            "score": -1,
                            "created_utc": 1626274089.0,
                            "replies": [
                                {
                                    "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
                                    "author": "ScreenPeepinE",
                                    "id": "h55vb7a",
                                    "parent_id": "t1_h55r77g",
                                    "score": 0,
                                    "created_utc": 1626275942.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think end of June is when I resumed as well",
                    "author": "Teejaynj",
                    "id": "h56xtv6",
                    "parent_id": "t1_h55ghyu",
                    "score": 1,
                    "created_utc": 1626292869.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Brother doesn’t have money OR the ability to spell. The only responses hes getting are from Nigerian Princesses.",
            "author": "Yourstruly0",
            "id": "h546rib",
            "parent_id": "t1_h53ozj4",
            "score": 5,
            "created_utc": 1626233776.0,
            "replies": [
                {
                    "body": "There is a market for that?! :D",
                    "author": "AnSteall",
                    "id": "h54tumr",
                    "parent_id": "t1_h546rib",
                    "score": 1,
                    "created_utc": 1626251715.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks! Apparently some people don’t 🙄",
            "author": null,
            "id": "h55c41s",
            "parent_id": "t1_h54cj06",
            "score": 0,
            "created_utc": 1626266363.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h53g9zu",
            "parent_id": "t1_h53dpti",
            "score": -1,
            "created_utc": 1626219433.0,
            "replies": [
                {
                    "body": "for sure, connection is key",
                    "author": "mraspencer",
                    "id": "h54crrw",
                    "parent_id": "t1_h53g9zu",
                    "score": 0,
                    "created_utc": 1626237626.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I assume she will have her family and friends around Im the hospital the entire time. I don’t think the SB will want her SD visiting her while everyone else is there.",
            "author": null,
            "id": "h56yvhb",
            "parent_id": "t1_h56y6xl",
            "score": 0,
            "created_utc": 1626293326.0,
            "replies": [
                {
                    "body": "…why? Say they are friends, say it’s someone you’re dating, tell your family you’re having a visitor and would like some privacy. She’s not 12 years old. If she doesn’t want to see you or talk to you that’s a different matter, but many of these comments are either implying it outright stating that a woman who’s been in an accident should be tossed aside because she’s sexually useless, albeit temporarily…",
                    "author": "WestCoastCompanion",
                    "id": "h5816qe",
                    "parent_id": "t1_h56yvhb",
                    "score": 2,
                    "created_utc": 1626312057.0,
                    "replies": [
                        {
                            "body": "Why are you trying to nitpick? Chances are she won’t want him coming around in the hospital. We don’t know their age gap or their history. Shes 22 so I doubt she will want a much older man coming to visit her in the hospital. \n\nRead the poster who wrote about a similar situation that happened to him recently. He said he didn’t see his sb for a few months while she was in the hospital. I doubt it was his choice not to see her.",
                            "author": null,
                            "id": "h58525u",
                            "parent_id": "t1_h5816qe",
                            "score": 1,
                            "created_utc": 1626314036.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It is not an easy situation but what if you had lost your job and was unable to support her financially? Would she still be around. That is the asymmetric nature of SRs.\n\nThis is a valid point that the OP needs to carefully consider.",
            "author": "2020Traveller",
            "id": "h53lnxi",
            "parent_id": "t1_h53iihe",
            "score": 0,
            "created_utc": 1626222276.0,
            "replies": [
                {
                    "body": "I think it’s a little different situation for her.  She couldn’t weather the storm quite as well as I can",
                    "author": "tommypillows",
                    "id": "h540ksf",
                    "parent_id": "t1_h53lnxi",
                    "score": 25,
                    "created_utc": 1626230198.0,
                    "replies": [
                        {
                            "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
                            "author": "Yourstruly0",
                            "id": "h546cs2",
                            "parent_id": "t1_h540ksf",
                            "score": 36,
                            "created_utc": 1626233527.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not sure what there is to be confused about.\n\n1. He has 2 young kids, lives in PA. He didn’t want to risk it. Not everyone was comfortable with it, you know. \n\n2. Ok jeez, you got me, that was just poor phrasing. I'm no longer in the bowl so i wouldn't resume seeing him is what I meant.",
            "author": "secretactorian",
            "id": "h54w2jb",
            "parent_id": "t1_h54buv6",
            "score": 10,
            "created_utc": 1626253836.0,
            "replies": []
        },
        {
            "body": ">To be clear - I'm not claiming I provide a high amount.   It would likely be more on the average/splenda side,\n\nthat's your answer...plenty of SB's who can get higher allowances, and the rules of supply and demand apply in the bowl. Some SBs are desired by many SDs.",
            "author": "MiLocavida",
            "id": "h5603f0",
            "parent_id": "t1_h55gnh1",
            "score": 1,
            "created_utc": 1626278012.0,
            "replies": [
                {
                    "body": "> that's your answer..\n\nBut that's my whole point.\n\nI've never had an SB \"leave\" me for another SD.  With the exception of 2 situations (SB flaked/ghosted after 1 intimate date) - I have ended every single one of my SRs.",
                    "author": "SDstartingOut",
                    "id": "h567u0m",
                    "parent_id": "t1_h5603f0",
                    "score": 1,
                    "created_utc": 1626281360.0,
                    "replies": [
                        {
                            "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
                            "author": "MiLocavida",
                            "id": "h56aizi",
                            "parent_id": "t1_h567u0m",
                            "score": 1,
                            "created_utc": 1626282520.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
                            "author": "CreampieCoupleLA",
                            "id": "h59f52d",
                            "parent_id": "t1_h567u0m",
                            "score": 1,
                            "created_utc": 1626346614.0,
                            "replies": [
                                {
                                    "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                                    "author": "SDstartingOut",
                                    "id": "h59kkjt",
                                    "parent_id": "t1_h59f52d",
                                    "score": 1,
                                    "created_utc": 1626350435.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Incorrect analogy. We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job",
            "author": "401kisfun",
            "id": "h57bjuj",
            "parent_id": "t1_h55gnh1",
            "score": 1,
            "created_utc": 1626299039.0,
            "replies": [
                {
                    "body": "There is nothing incorrect about it.  I was replying to a specific comment that stated \" SBs will drop you in a second if they find a better allowance\".  And I stand behind my statement.  \n\n> We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job\n\nI have to say, this commentary is typically baffling to me.  Specifically that - 2 months would be the end of the world.  Just like an SD that supposedly can't provide a given allowance/ppm due \"cash flow issues\".  I wouldn't be sugaring - if I didn't have a year's worth of living expenses sitting on the sidelines.  .",
                    "author": "SDstartingOut",
                    "id": "h59le59",
                    "parent_id": "t1_h57bjuj",
                    "score": 1,
                    "created_utc": 1626350961.0,
                    "replies": [
                        {
                            "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
                            "author": "401kisfun",
                            "id": "h5a0s8x",
                            "parent_id": "t1_h59le59",
                            "score": 1,
                            "created_utc": 1626358892.0,
                            "replies": [
                                {
                                    "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                                    "author": "SDstartingOut",
                                    "id": "h5a3tpw",
                                    "parent_id": "t1_h5a0s8x",
                                    "score": 1,
                                    "created_utc": 1626360253.0,
                                    "replies": [
                                        {
                                            "body": "The question is directed at an SB",
                                            "author": "401kisfun",
                                            "id": "h5a3wv1",
                                            "parent_id": "t1_h5a3tpw",
                                            "score": 1,
                                            "created_utc": 1626360291.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">amidst the biggest female equality movement of our generation\n\nbetter keep it on the down low or you might get canceled! 😂",
            "author": "MiLocavida",
            "id": "h55bp1c",
            "parent_id": "t1_h557wgu",
            "score": -1,
            "created_utc": 1626266111.0,
            "replies": [
                {
                    "body": "Oh god, the younger generations lingo genuinely makes me cringe haha. I can only assume my parents felt the same way about the things I said growing up though.",
                    "author": "Overwatch61",
                    "id": "h56iuds",
                    "parent_id": "t1_h55bp1c",
                    "score": 0,
                    "created_utc": 1626286170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is an actual statistic that men are more likely to leave their female partner was she to be hit with some major health issues. With cancer this ratio is 1:6. This is without the bowl.\n\nI understand 'in the bow' you're in a quasi relationship. If you do not wish to keep the emphasis on 'transactional' but on emotional, would you answer still be the same?\n\nI notice that the SR has similarities to 19050s (and prior) power dynamics within a marriage where the man was the provider and the female essentially a servant who had to be grateful for being provided for. That view is still not outdated in many parts of the world.\n\n&#x200B;\n\n>Sure they have less money, but that doesn’t mean a SD owes money to someone just because he has more of it.\n\nThis is pretty much that outdated world view. If in a (sugar) relationship you can't have the empathy to continue supporting your SB, do you even qualify as a SD or are you just using a glorified escort service?\n\nSure, I also read plenty of women advising others to dump a SD who doesn't pay but there were also enough stories where SD was late or P&D or were willing to compromise.  \n\n\nI mean, if you found someone who gave you affection that you are paying for, would you even need a SB?",
            "author": "AnSteall",
            "id": "h57o4wa",
            "parent_id": "t1_h55ch8o",
            "score": 2,
            "created_utc": 1626305246.0,
            "replies": []
        },
        {
            "body": "Well I’ll enlighten you about my experience. \n\nThe SB that I had , showed her true colors during this rough patch. \n\nBetween 2005-2007 , we had the greatest relationship in the world. She received an allowance, car , apartment, health insurance and traveled with me on business.\n\nI was a lover , friend , and mentor.\n\n2008 comes and my liquidity dries up.\n\nWe had a long talk , and I told her. Things will have to change for a bit. You can keep the car and apartment until the lease is up. But the health insurance and allowance has to stop. \n\nI didn’t expect intimacy from her at this point. But all I was asking for was emotional support during these tough times in my life.\n\nWell it didn’t go well. \n\nEvery time we spoke she always had a problem, and now that I wasn’t Financially able to solve them. She had to go because she is depressed.\n\nNever mind what I was going through.\n\nSo if the Op decides to continue supporting her during these tough times. I would suggest thinking of her as a long term commitment, because you are now sharing a life experience..\n\nBut remember after she has recovered, she owes you nothing.",
            "author": "lostsoul9999999",
            "id": "h53vcup",
            "parent_id": "t1_h53t6ui",
            "score": 4,
            "created_utc": 1626227357.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h53ww1d",
                    "parent_id": "t1_h53vcup",
                    "score": 6,
                    "created_utc": 1626228179.0,
                    "replies": [
                        {
                            "body": "Thank you for the kind words.",
                            "author": "lostsoul9999999",
                            "id": "h542rk6",
                            "parent_id": "t1_h53ww1d",
                            "score": 0,
                            "created_utc": 1626231432.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Something about passing on the virus? Here in the UK we had 'bubbles' which were named households you were allowed to meet with - under 6 people though.\n\nI assume that if a SD is married, the mistress is not going to be one of those households. Spreading infection is not just about those who meet but about those who might catch from those they met. Vulnerable people in the household, overstretched health services are just a couple of things people considered when minimising non-essential contact during the plague.",
            "author": "AnSteall",
            "id": "h59ls3e",
            "parent_id": "t1_h59fug5",
            "score": 1,
            "created_utc": 1626351207.0,
            "replies": []
        },
        {
            "body": "People have parents and grandparents at home.",
            "author": null,
            "id": "h55px1b",
            "parent_id": "t1_h55ghyu",
            "score": 4,
            "created_utc": 1626273499.0,
            "replies": [
                {
                    "body": "And suddenly in the transplant heavy town of NYC, 30% of POTs lived with their grandparents. Roughly the same % of people who, before COVID and perpetually during my time on SA, couldn’t meet up but would “love to start something virtual.”",
                    "author": null,
                    "id": "h55r77g",
                    "parent_id": "t1_h55px1b",
                    "score": -1,
                    "created_utc": 1626274089.0,
                    "replies": [
                        {
                            "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
                            "author": "ScreenPeepinE",
                            "id": "h55vb7a",
                            "parent_id": "t1_h55r77g",
                            "score": 0,
                            "created_utc": 1626275942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think end of June is when I resumed as well",
            "author": "Teejaynj",
            "id": "h56xtv6",
            "parent_id": "t1_h55ghyu",
            "score": 1,
            "created_utc": 1626292869.0,
            "replies": []
        },
        {
            "body": "There is a market for that?! :D",
            "author": "AnSteall",
            "id": "h54tumr",
            "parent_id": "t1_h546rib",
            "score": 1,
            "created_utc": 1626251715.0,
            "replies": []
        },
        {
            "body": "for sure, connection is key",
            "author": "mraspencer",
            "id": "h54crrw",
            "parent_id": "t1_h53g9zu",
            "score": 0,
            "created_utc": 1626237626.0,
            "replies": []
        },
        {
            "body": "…why? Say they are friends, say it’s someone you’re dating, tell your family you’re having a visitor and would like some privacy. She’s not 12 years old. If she doesn’t want to see you or talk to you that’s a different matter, but many of these comments are either implying it outright stating that a woman who’s been in an accident should be tossed aside because she’s sexually useless, albeit temporarily…",
            "author": "WestCoastCompanion",
            "id": "h5816qe",
            "parent_id": "t1_h56yvhb",
            "score": 2,
            "created_utc": 1626312057.0,
            "replies": [
                {
                    "body": "Why are you trying to nitpick? Chances are she won’t want him coming around in the hospital. We don’t know their age gap or their history. Shes 22 so I doubt she will want a much older man coming to visit her in the hospital. \n\nRead the poster who wrote about a similar situation that happened to him recently. He said he didn’t see his sb for a few months while she was in the hospital. I doubt it was his choice not to see her.",
                    "author": null,
                    "id": "h58525u",
                    "parent_id": "t1_h5816qe",
                    "score": 1,
                    "created_utc": 1626314036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it’s a little different situation for her.  She couldn’t weather the storm quite as well as I can",
            "author": "tommypillows",
            "id": "h540ksf",
            "parent_id": "t1_h53lnxi",
            "score": 25,
            "created_utc": 1626230198.0,
            "replies": [
                {
                    "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
                    "author": "Yourstruly0",
                    "id": "h546cs2",
                    "parent_id": "t1_h540ksf",
                    "score": 36,
                    "created_utc": 1626233527.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> that's your answer..\n\nBut that's my whole point.\n\nI've never had an SB \"leave\" me for another SD.  With the exception of 2 situations (SB flaked/ghosted after 1 intimate date) - I have ended every single one of my SRs.",
            "author": "SDstartingOut",
            "id": "h567u0m",
            "parent_id": "t1_h5603f0",
            "score": 1,
            "created_utc": 1626281360.0,
            "replies": [
                {
                    "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
                    "author": "MiLocavida",
                    "id": "h56aizi",
                    "parent_id": "t1_h567u0m",
                    "score": 1,
                    "created_utc": 1626282520.0,
                    "replies": []
                },
                {
                    "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
                    "author": "CreampieCoupleLA",
                    "id": "h59f52d",
                    "parent_id": "t1_h567u0m",
                    "score": 1,
                    "created_utc": 1626346614.0,
                    "replies": [
                        {
                            "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                            "author": "SDstartingOut",
                            "id": "h59kkjt",
                            "parent_id": "t1_h59f52d",
                            "score": 1,
                            "created_utc": 1626350435.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is nothing incorrect about it.  I was replying to a specific comment that stated \" SBs will drop you in a second if they find a better allowance\".  And I stand behind my statement.  \n\n> We are talking about where the SD loses his income entirely for 2 months and that is the only SD the SB has at that moment. Will the SB forego allowance and still spend time with him? Also note i would feel too shitty to be intimate if i lost my job\n\nI have to say, this commentary is typically baffling to me.  Specifically that - 2 months would be the end of the world.  Just like an SD that supposedly can't provide a given allowance/ppm due \"cash flow issues\".  I wouldn't be sugaring - if I didn't have a year's worth of living expenses sitting on the sidelines.  .",
            "author": "SDstartingOut",
            "id": "h59le59",
            "parent_id": "t1_h57bjuj",
            "score": 1,
            "created_utc": 1626350961.0,
            "replies": [
                {
                    "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
                    "author": "401kisfun",
                    "id": "h5a0s8x",
                    "parent_id": "t1_h59le59",
                    "score": 1,
                    "created_utc": 1626358892.0,
                    "replies": [
                        {
                            "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                            "author": "SDstartingOut",
                            "id": "h5a3tpw",
                            "parent_id": "t1_h5a0s8x",
                            "score": 1,
                            "created_utc": 1626360253.0,
                            "replies": [
                                {
                                    "body": "The question is directed at an SB",
                                    "author": "401kisfun",
                                    "id": "h5a3wv1",
                                    "parent_id": "t1_h5a3tpw",
                                    "score": 1,
                                    "created_utc": 1626360291.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh god, the younger generations lingo genuinely makes me cringe haha. I can only assume my parents felt the same way about the things I said growing up though.",
            "author": "Overwatch61",
            "id": "h56iuds",
            "parent_id": "t1_h55bp1c",
            "score": 0,
            "created_utc": 1626286170.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h53ww1d",
            "parent_id": "t1_h53vcup",
            "score": 6,
            "created_utc": 1626228179.0,
            "replies": [
                {
                    "body": "Thank you for the kind words.",
                    "author": "lostsoul9999999",
                    "id": "h542rk6",
                    "parent_id": "t1_h53ww1d",
                    "score": 0,
                    "created_utc": 1626231432.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And suddenly in the transplant heavy town of NYC, 30% of POTs lived with their grandparents. Roughly the same % of people who, before COVID and perpetually during my time on SA, couldn’t meet up but would “love to start something virtual.”",
            "author": null,
            "id": "h55r77g",
            "parent_id": "t1_h55px1b",
            "score": -1,
            "created_utc": 1626274089.0,
            "replies": [
                {
                    "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
                    "author": "ScreenPeepinE",
                    "id": "h55vb7a",
                    "parent_id": "t1_h55r77g",
                    "score": 0,
                    "created_utc": 1626275942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why are you trying to nitpick? Chances are she won’t want him coming around in the hospital. We don’t know their age gap or their history. Shes 22 so I doubt she will want a much older man coming to visit her in the hospital. \n\nRead the poster who wrote about a similar situation that happened to him recently. He said he didn’t see his sb for a few months while she was in the hospital. I doubt it was his choice not to see her.",
            "author": null,
            "id": "h58525u",
            "parent_id": "t1_h5816qe",
            "score": 1,
            "created_utc": 1626314036.0,
            "replies": []
        },
        {
            "body": "Many SBs rely on their SDs contributions to survive. Most SDs don’t rely on sex to survive. That’s the true ”asymmetrical nature” of sugar relationships.   \nIt sounds like you’ve made your decision(it’s what I would do too as long as the money wasn’t a huge loss to me). Regardless of the SR, completely disregarding how you met, you’re doing a good thing to make someone’s life a lot less shitty. If more people would consider “what am I losing? Can I afford to lose it and be okay?” instead of “what can I gain?” when dealing with situations like this this.. well, the world would be a lot different.\n\nSide note: if you haven’t already addressed it I would discuss you seeing other people while she’s out of action. If you already have an agreement then NBD but if you were planning to be monogamous I don’t think she’d blame you for seeing other people in the meantime.",
            "author": "Yourstruly0",
            "id": "h546cs2",
            "parent_id": "t1_h540ksf",
            "score": 36,
            "created_utc": 1626233527.0,
            "replies": []
        },
        {
            "body": "i get it, i'm just saying that plenty of SBs are in demand, and these SBs won't settle for splenda.",
            "author": "MiLocavida",
            "id": "h56aizi",
            "parent_id": "t1_h567u0m",
            "score": 1,
            "created_utc": 1626282520.0,
            "replies": []
        },
        {
            "body": "Yeah, but you never stopped paying. The point is that SBs would leave if you stopped paying.",
            "author": "CreampieCoupleLA",
            "id": "h59f52d",
            "parent_id": "t1_h567u0m",
            "score": 1,
            "created_utc": 1626346614.0,
            "replies": [
                {
                    "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
                    "author": "SDstartingOut",
                    "id": "h59kkjt",
                    "parent_id": "t1_h59f52d",
                    "score": 1,
                    "created_utc": 1626350435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So  you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?",
            "author": "401kisfun",
            "id": "h5a0s8x",
            "parent_id": "t1_h59le59",
            "score": 1,
            "created_utc": 1626358892.0,
            "replies": [
                {
                    "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
                    "author": "SDstartingOut",
                    "id": "h5a3tpw",
                    "parent_id": "t1_h5a0s8x",
                    "score": 1,
                    "created_utc": 1626360253.0,
                    "replies": [
                        {
                            "body": "The question is directed at an SB",
                            "author": "401kisfun",
                            "id": "h5a3wv1",
                            "parent_id": "t1_h5a3tpw",
                            "score": 1,
                            "created_utc": 1626360291.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for the kind words.",
            "author": "lostsoul9999999",
            "id": "h542rk6",
            "parent_id": "t1_h53ww1d",
            "score": 0,
            "created_utc": 1626231432.0,
            "replies": []
        },
        {
            "body": "Covid created new cam girls and virtual SB’s. OnlyFans took off like a rocket.\n\nThat’s not to say everyone who didn’t feel comfortable risking exposure was the same.",
            "author": "ScreenPeepinE",
            "id": "h55vb7a",
            "parent_id": "t1_h55r77g",
            "score": 0,
            "created_utc": 1626275942.0,
            "replies": []
        },
        {
            "body": "But that's not the point.  I was replying to a very specific comment.\n\n> SBs will drop you in a second if they find a better allowance, and they won't give a damn.\n\nThis has not been my experience.  And I find men that parade around stating it on this sub - typically have \"OTHER\" reasons why their SRs are ending.  And it's not (or not solely) because of the allowance.",
            "author": "SDstartingOut",
            "id": "h59kkjt",
            "parent_id": "t1_h59f52d",
            "score": 1,
            "created_utc": 1626350435.0,
            "replies": []
        },
        {
            "body": "> So you wouldn’t leave an SD who lost his job and cash flow stopped for 2 months? You would still meet up and be intimate during those 2 months?\n\nI'm an SD.  I wouldn't be sugaring if the lose of 2 months of income would have a major impact on my life.",
            "author": "SDstartingOut",
            "id": "h5a3tpw",
            "parent_id": "t1_h5a0s8x",
            "score": 1,
            "created_utc": 1626360253.0,
            "replies": [
                {
                    "body": "The question is directed at an SB",
                    "author": "401kisfun",
                    "id": "h5a3wv1",
                    "parent_id": "t1_h5a3tpw",
                    "score": 1,
                    "created_utc": 1626360291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The question is directed at an SB",
            "author": "401kisfun",
            "id": "h5a3wv1",
            "parent_id": "t1_h5a3tpw",
            "score": 1,
            "created_utc": 1626360291.0,
            "replies": []
        }
    ]
}