{
    "title": "I find it funny on here when women complain about SD’s being obese, ugly, etc",
    "post_id": "z2mvs0",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/z2mvs0/i_find_it_funny_on_here_when_women_complain_about/",
    "author": "throwawayrtyggv",
    "body": "Don’t they realize that’s why I’m on here? I understand that without money involved I can’t ever pull a woman like the ones I can on SA. If I could get the woman I desired for free, I wouldn’t be on SA. Perhaps if you want brad Pitt you should be the one paying. \n\nOn the flip side, women should probably stop getting so upset when we have higher standards. We, after all, are the ones paying, so of course I’m going to have higher standards as to what I want than if I was at a bar.\n\nIn genera the financial aspect is there to make up for the traditional attractiveness aspect. It’s why the bowl exists and it just baffles me when I see women say things like “I’d only sugar with guys I would vanilla” then complain they can’t find anyone .",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/z2mvs0/i_find_it_funny_on_here_when_women_complain_about/",
    "score": 120,
    "upvote_ratio": 0.74,
    "created_utc": 1669203482.0,
    "num_comments": 155,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Being “ugly and fat” is one thing. Being disgusting is another. You can be fat and have good hygiene",
            "author": "FeelingsTherapist",
            "id": "ixibtj2",
            "parent_id": "t3_z2mvs0",
            "score": 64,
            "created_utc": 1669224958.0,
            "replies": []
        },
        {
            "body": "I understand what you're saying, but I still want my SB to be attracted to me.  That's what makes Sugar Dating different than other types of Sex Work to me.  If all I wanted was sex with an attractive woman, I would use Escorts. Escorts are cheaper, easier to find and less time consuming.\n\nI still want Sugar Dating to feel like normal dating, except with boundaries and financial support.  I do want them to be attracted to me. Maybe not because I'm a 20-something hunk, but maybe because they are attracted to the older \"Silver Fox\" types or maybe because they are attracted to intelligence, maturity, confidence, manners, generosity, etc more commonly found in an older successful man.",
            "author": "MaxFromVenice",
            "id": "ixhbp2g",
            "parent_id": "t3_z2mvs0",
            "score": 52,
            "created_utc": 1669209711.0,
            "replies": [
                {
                    "body": "Nailed it",
                    "author": "yanonotreally",
                    "id": "ixhjwj4",
                    "parent_id": "t1_ixhbp2g",
                    "score": 12,
                    "created_utc": 1669213715.0,
                    "replies": []
                },
                {
                    "body": "ofc you want them to be attracted to you the $$ helps wash that down.\n\nspin everything else to soothe the male ego I get it (ive done it) but in the end it is the $$ with a nice, fun, charming guy. Who in 99% of cases they would not openly date without sugar.",
                    "author": "bookworm010101",
                    "id": "ixm1ge0",
                    "parent_id": "t1_ixhbp2g",
                    "score": 5,
                    "created_utc": 1669297576.0,
                    "replies": [
                        {
                            "body": "I can't tell from your post history if you are a man or a woman, but if you've never been in a Sugar Relationship with someone that you are attracted to and is attracted to you, then you haven't been in a Sugar Relationship in my mind.  There are a lot of women that are attracted to more than just youthful looks and there a lot of men who want more than just sex with an attractive woman.  I don't understand why that seems to offend people. \n\nI'm comfortable with my life choices, so I'm not bothered by other people's opinions about my life choices.  It's called maturity.",
                            "author": "MaxFromVenice",
                            "id": "ixm3439",
                            "parent_id": "t1_ixm1ge0",
                            "score": 3,
                            "created_utc": 1669298461.0,
                            "replies": [
                                {
                                    "body": "Great if you found that :) normally that is not the case there is a bit of acting involved in most SRs especially from the SB side.",
                                    "author": "bookworm010101",
                                    "id": "ixm3joo",
                                    "parent_id": "t1_ixm3439",
                                    "score": 3,
                                    "created_utc": 1669298696.0,
                                    "replies": [
                                        {
                                            "body": "I think the issue is when people expect to find romantic love within a Sugar Relationship, but I do look to build a strong friendship. I've remained friends with several SBs long after our arrangements ended.  It's possible to become good friends without expecting romantic love leading to marriage and/or children.",
                                            "author": "MaxFromVenice",
                                            "id": "ixm49oh",
                                            "parent_id": "t1_ixm3joo",
                                            "score": 2,
                                            "created_utc": 1669299076.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "izvzvvu",
                                                    "parent_id": "t1_ixm49oh",
                                                    "score": 1,
                                                    "created_utc": 1670826926.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol",
                                                            "author": "MaxFromVenice",
                                                            "id": "izw9u7a",
                                                            "parent_id": "t1_izvzvvu",
                                                            "score": 1,
                                                            "created_utc": 1670834747.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "j05f460",
                                                                    "parent_id": "t1_izw9u7a",
                                                                    "score": 1,
                                                                    "created_utc": 1670993381.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "What if I'm not married? lol",
                                                                            "author": "MaxFromVenice",
                                                                            "id": "j05w0l7",
                                                                            "parent_id": "t1_j05f460",
                                                                            "score": 1,
                                                                            "created_utc": 1671004658.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "j07xah1",
                                                                                    "parent_id": "t1_j05w0l7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1671043362.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                                                                            "author": "MaxFromVenice",
                                                                                            "id": "j07ysca",
                                                                                            "parent_id": "t1_j07xah1",
                                                                                            "score": 1,
                                                                                            "created_utc": 1671043929.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "j07z4w3",
                                                                                                    "parent_id": "t1_j07ysca",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1671044060.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "In this day & age with sexual freedom, if a woman is attracted to you, she will sleep with you as she enjoys it. I dare you to test your SBs and stop paying. If she doesn’t still wanna see you, she’s not genuinely into you.",
                    "author": null,
                    "id": "ixljgz3",
                    "parent_id": "t1_ixhbp2g",
                    "score": 1,
                    "created_utc": 1669284341.0,
                    "replies": [
                        {
                            "body": "For the women I date, financial support is one aspect of what I offer. If I was significantly older, overweight, rude, etc, I'm sure that would impact who I was able to date as well. I understand my charm, looks, success, confidence, financial support, etc are all important aspects of my appeal.",
                            "author": "MaxFromVenice",
                            "id": "ixlkmk9",
                            "parent_id": "t1_ixljgz3",
                            "score": 5,
                            "created_utc": 1669285392.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">In genera the financial aspect is there to make up for the traditional attractiveness aspect. It’s why the bowl exists...\n\nOr maybe your understanding of the bowl is a tad simplistic. Yes, money can be used to compensate for other things, and certainly attractiveness is one of them. But so are inability to commit (because e.g. SD is married), lack of time (because SD is very busy), inconvenience (because SB has to hide from his wife), different ideas about future (SBs spends years with someone she knows she hasn't a future with), ... It would be helpful if everybody understood that just because they financially support their SB \"to make up for the traditional attractiveness aspect\", that doesn't have to be the case for every SR. And in some cases, money isn't there to make up for anything. It's just genuine support.\n\nI would also advise SDs to try to understand that they have to be attractive *in some way* in the mind of their SB. It is fascinates me how some men here feel entitled to very attractive SBs (\"because, you know, my dick just doesn't work with regular women...\"), but assume that women are able to have sex with anybody as long as they get money out of it.\n\nAll that being said, I find calling people \"ugly\" and shaming of obese people appaling and it is certainly not better when SBs on this forum are the ones doing it.",
            "author": "Inner_Examination_38",
            "id": "ixh73zg",
            "parent_id": "t3_z2mvs0",
            "score": 140,
            "created_utc": 1669207065.0,
            "replies": [
                {
                    "body": "> I would also advise SDs to try to understand that they have to be attractive in some way in the mind of their SB\n\nTo me - this is half of what separates sugaring from escorting.",
                    "author": "SDstartingOut",
                    "id": "ixh876h",
                    "parent_id": "t1_ixh73zg",
                    "score": 51,
                    "created_utc": 1669207727.0,
                    "replies": []
                },
                {
                    "body": "100%\n\nmoney to lay back and think of england is not sugar",
                    "author": null,
                    "id": "ixhhwgi",
                    "parent_id": "t1_ixh73zg",
                    "score": 38,
                    "created_utc": 1669212803.0,
                    "replies": [
                        {
                            "body": "> money to lay back and think of england is not sugar\n\nIndeed, thinking of Charles III. doesn't help.",
                            "author": "Inner_Examination_38",
                            "id": "ixhsob8",
                            "parent_id": "t1_ixhhwgi",
                            "score": 20,
                            "created_utc": 1669217382.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣",
                                    "author": "FLRAdvocate",
                                    "id": "ixjolwy",
                                    "parent_id": "t1_ixhsob8",
                                    "score": 3,
                                    "created_utc": 1669244770.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah if you’re extremely ugly or obese I don’t care how deep your wallets are. You can definitely find women who can act but I’m not a good actress.",
                    "author": "salkaurs",
                    "id": "ixhh48j",
                    "parent_id": "t1_ixh73zg",
                    "score": 24,
                    "created_utc": 1669212439.0,
                    "replies": [
                        {
                            "body": "> You can definitely find women who can act\n\nI have to say, this is one double standard I've never understood.\n\nWhy is it possible that some SDs not only like, but prefer larger women, but there aren't some women that are attracted to larger guys?  \n\nBy all means - I'm *not* suggesting you should be.  But it's rather impolite to assume that no women will find a larger guy attractive, even if it wouldn't be their first choice to vanilla date.",
                            "author": "SDstartingOut",
                            "id": "ixi5o4t",
                            "parent_id": "t1_ixhh48j",
                            "score": 6,
                            "created_utc": 1669222545.0,
                            "replies": [
                                {
                                    "body": "There are PLENTY of women who don't mind someone soft to cuddle with.",
                                    "author": "SilkySweet2022",
                                    "id": "ixihoqr",
                                    "parent_id": "t1_ixi5o4t",
                                    "score": 17,
                                    "created_utc": 1669227229.0,
                                    "replies": []
                                },
                                {
                                    "body": "But there are women who like overweight men. I like overweight men. Would I date someone who was in the obese category? No. Unless he was very tall and carried it well and had a great personality. I hate men with six packs too and would never talk to one either.",
                                    "author": "salkaurs",
                                    "id": "ixice9r",
                                    "parent_id": "t1_ixi5o4t",
                                    "score": 14,
                                    "created_utc": 1669225179.0,
                                    "replies": [
                                        {
                                            "body": "I think my point went over your head though.\n\nI'm not suggesting YOU should date someone you aren't attracted to;  nor should you be attracted to obese men.  \n\nI'm merely stating that - just because you are not attracted to them, does not mean other women would have to fake/act it.  Which is what your post seemed to imply.\n\n> Unless he was very tall \n\nFWIW for me personally, I do feel this is a lot of why I've been able to find women who were (at least to some degree) physically attracted to me.",
                                            "author": "SDstartingOut",
                                            "id": "ixiid84",
                                            "parent_id": "t1_ixice9r",
                                            "score": 3,
                                            "created_utc": 1669227492.0,
                                            "replies": [
                                                {
                                                    "body": "A beautiful younger woman being genuinely sexually attracted to an obese older man is rare. Not sure what to tell you other than that I agree that they do exist but are rare",
                                                    "author": "salkaurs",
                                                    "id": "ixij7we",
                                                    "parent_id": "t1_ixiid84",
                                                    "score": 7,
                                                    "created_utc": 1669227820.0,
                                                    "replies": [
                                                        {
                                                            "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
                                                            "author": "Ripeness2282",
                                                            "id": "ixj5uxk",
                                                            "parent_id": "t1_ixij7we",
                                                            "score": 3,
                                                            "created_utc": 1669236790.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
                                                            "author": "Soph4art",
                                                            "id": "ixiqdwg",
                                                            "parent_id": "t1_ixij7we",
                                                            "score": 1,
                                                            "created_utc": 1669230649.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I've lived most of my life in rural areas, husky men are the delicacy here. Haha. I personally am attracted to lean muscles and even a bit of pudge. I also have a friend who is genuinely attracted to moobs. Everybody's got a preference. I think weight itself doesn't matter, it's the way you carry yourself.",
                                    "author": "MissRoyalBrush",
                                    "id": "ixipg42",
                                    "parent_id": "t1_ixi5o4t",
                                    "score": 6,
                                    "created_utc": 1669230275.0,
                                    "replies": []
                                },
                                {
                                    "body": "I mean there’s literally a trend on tik tok about women who prefer larger men. It’s certainly not uncommon and not looked down upon as much in society when you look at the likes of Rick Ross, dj khaled etc who many don’t question when they are with thin women but pierce brosnan gets a lot of flack for staying with his gorgeous wife because she’s gained weight.\n\nI know this is an extremely late comment lol but yeah",
                                    "author": "Sugarintheorange",
                                    "id": "j1pibdj",
                                    "parent_id": "t1_ixi5o4t",
                                    "score": 1,
                                    "created_utc": 1672048672.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It feels bad even with wealth you can’t buy love.",
                            "author": "silverbullet20",
                            "id": "ixhokp2",
                            "parent_id": "t1_ixhh48j",
                            "score": 0,
                            "created_utc": 1669215711.0,
                            "replies": []
                        },
                        {
                            "body": "LOL",
                            "author": "MystressJessy",
                            "id": "ixj8b3h",
                            "parent_id": "t1_ixhh48j",
                            "score": 0,
                            "created_utc": 1669237783.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Amazing response.",
                    "author": "Cdnsugarr",
                    "id": "ixiz5fo",
                    "parent_id": "t1_ixh73zg",
                    "score": 3,
                    "created_utc": 1669234119.0,
                    "replies": []
                },
                {
                    "body": "Married guy? How is that morally ok?  Why not divorce",
                    "author": "silverbullet20",
                    "id": "ixhoab7",
                    "parent_id": "t1_ixh73zg",
                    "score": -5,
                    "created_utc": 1669215596.0,
                    "replies": [
                        {
                            "body": "To be clear, my (sugar) boyfriend is not married, but suggest refraining from making moral judgments about other people's relationship choices.",
                            "author": "Inner_Examination_38",
                            "id": "ixhqkt0",
                            "parent_id": "t1_ixhoab7",
                            "score": 8,
                            "created_utc": 1669216535.0,
                            "replies": []
                        },
                        {
                            "body": "Divorce gets thrown around like it's an easy thing to do.\n\nIt isn't.\n\nThere are many, many reasons men will avoid it if possible: financial, personal, children, wife's mental/physical state, friendship, love, etc.",
                            "author": "SilkySweet2022",
                            "id": "ixhz7ie",
                            "parent_id": "t1_ixhoab7",
                            "score": 7,
                            "created_utc": 1669219990.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So just skip those posts/comments.  \n\nNot every SB is a match for every SD.  That's life.  \n\nI would never want an SB to drop her standards for me.  If I'm not a match - I'm not a match.  I have no problem with that.\n\nThere are plenty of women who weren't interested in me - because I'm obese.  I have no problem with that - and in fact - it's why I intentionally have VERY obvious pictures showing my size.  \n\nWhen it comes to casual dating/sex - women have a lot of options.  I've always looked at sugaring as - the thing that moves me to the front of the line.  I'm not trying to date an SB that finds me repulsive.  I'm trying to find an SB that finds something about me attractive/interesting - but (without sugar) would ever be likely to notice me from the crowd of other perspective partners.\n\n> On the flip side, women should probably stop getting so upset when we have higher standards.\n\nWomen are normally not upset because any individual SD is not attracted to them.  The \"upset\" part normally comes from people being dicks about it, and generalizing for all SDs.  There is no need to be rude/be an asshole.",
            "author": "SDstartingOut",
            "id": "ixh4g5e",
            "parent_id": "t3_z2mvs0",
            "score": 71,
            "created_utc": 1669205346.0,
            "replies": [
                {
                    "body": "Super true thing about me: I love that when I meet a potential SB, she can *reject me*. If she chooses not to -- and isn't desperate for money -- I know she's making a choice to be with me. \n\nSometimes it becomes clear that she isn't really making that choice on a ongoing basis. At that point, it's time to end the arrangement. I really don't want to be in the company of a woman whose sole reason for remaining in the relationship is the financial part. \n\nCurrent SB has a real car, low expenses, plenty of cash in bank. I'm quite sure she appreciates the money. And also that she can live without it",
                    "author": "marker3000",
                    "id": "ixim3lh",
                    "parent_id": "t1_ixh4g5e",
                    "score": 6,
                    "created_utc": 1669228954.0,
                    "replies": [
                        {
                            "body": "“A real car” that gave me a chuckle.",
                            "author": "PoosanItRhymesWSusan",
                            "id": "ixj2rxr",
                            "parent_id": "t1_ixim3lh",
                            "score": 3,
                            "created_utc": 1669235559.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "By definition of being in the bowl her standards have dropped. Otherwise she would be dating you in vanilla. But she's not, she's requiring you to pay. Because she wouldn't date you otherwise.",
                    "author": "malcolm_reyn0lds",
                    "id": "ixi7zre",
                    "parent_id": "t1_ixh4g5e",
                    "score": 6,
                    "created_utc": 1669223458.0,
                    "replies": [
                        {
                            "body": ">Reply\n\nJust remember...\"The most expensive sex is free sex\"...Woody Allen",
                            "author": "surfrat54",
                            "id": "ixj5bv2",
                            "parent_id": "t1_ixi7zre",
                            "score": 3,
                            "created_utc": 1669236583.0,
                            "replies": [
                                {
                                    "body": "Correction. The most expensive sex is married sex. The cheapest sex is the one with minimal time invested and minimal govt and lawyers involved.",
                                    "author": "malcolm_reyn0lds",
                                    "id": "ixjyyq1",
                                    "parent_id": "t1_ixj5bv2",
                                    "score": 1,
                                    "created_utc": 1669249560.0,
                                    "replies": [
                                        {
                                            "body": "That's the point of the joke...meaning married men are constantly in positions where they have to satisfy their wives or girlfriends with gifts, etc..in order to get sex.There was an old joke years back that a guy wouldn't get a blow job on Valentine's Day unless he bought his wife or GF expensive Valentine's Day gift....Thus the sex appears \"free\" but couples bargain in subtle ways all the time to get their needs met...the 2nd part of the point is it would cheaper for a guy to just go out and pay an escort for the bj...rather than buying his wife expensive jewelry or whatever to get sex...",
                                            "author": "surfrat54",
                                            "id": "ixk3q0q",
                                            "parent_id": "t1_ixjyyq1",
                                            "score": 2,
                                            "created_utc": 1669251848.0,
                                            "replies": [
                                                {
                                                    "body": "I have to correct myself. Married sex is the most expensive once the divorce comes. It isn't always expensive until you loose your house and retirement.",
                                                    "author": "malcolm_reyn0lds",
                                                    "id": "ixmhjmh",
                                                    "parent_id": "t1_ixk3q0q",
                                                    "score": 1,
                                                    "created_utc": 1669305307.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Just because her standard drops doesn’t mean there is no attraction it’s just that he is not as attracted as other options. Girls drop standards in vanilla, maybe because the super hot guys are not emotional available or don’t want a long term relationships, so they settle for a less hott guy and date them in vanilla.",
                            "author": "Secret_Diet7053",
                            "id": "ixixosg",
                            "parent_id": "t1_ixi7zre",
                            "score": 2,
                            "created_utc": 1669233535.0,
                            "replies": [
                                {
                                    "body": "I never said she wasn't attracted to him, or that there wasn't chemistry or they don't get along. Most sbs get along with their sds to some extent and have some attraction. ( I'd hope) . But let's not get ahead of ourselves here, most sbs wouldt see their sds without being paid. They would leave. Which by definition is a lowering of standards.",
                                    "author": "malcolm_reyn0lds",
                                    "id": "ixjzn6q",
                                    "parent_id": "t1_ixixosg",
                                    "score": 3,
                                    "created_utc": 1669249885.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Not necessarily…there are plenty of SDs who want or need, for whatever reason, to keep the framework of sugaring in place over dating that same woman vanilla.\n\nCould be that they’re already married and want to have a long term thing without any escalation.  They could be emotionally scarred by an awful childhood.  Whatever.\n\nSo a SR is the only way they’re available.\n\nAnd the same goes for some SBs.  They don’t want/can’t handle the aspects of a vanilla relationship that sugaring eliminates, so they keep it to sugar.",
                            "author": "Akavinceblack",
                            "id": "ixiqgnd",
                            "parent_id": "t1_ixi7zre",
                            "score": 2,
                            "created_utc": 1669230679.0,
                            "replies": [
                                {
                                    "body": "The SD part of your response has no relevance to my statement. Yes all that could be true but she's still requiring payment for whatever reason on her end. 99.9% of affairs are done by adults that aren't in sugar relationships so that's really a non relevant point.\n\nWhatever her reasons for wanting an SR, the reality is that if the money stops, she's out. So whatever bonus reasons she has doesn't matter in the end because the payment is the only reason she's staying. The truth sucks.",
                                    "author": "malcolm_reyn0lds",
                                    "id": "ixjzeh4",
                                    "parent_id": "t1_ixiqgnd",
                                    "score": 2,
                                    "created_utc": 1669249771.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If you are going through the gamut, why not bars? That why may you eliminate any possibility a woman wants your money",
                    "author": "silverbullet20",
                    "id": "ixhp090",
                    "parent_id": "t1_ixh4g5e",
                    "score": 2,
                    "created_utc": 1669215889.0,
                    "replies": []
                },
                {
                    "body": "👏👏👏👏👏",
                    "author": "Big_Contribution_460",
                    "id": "ixhh71k",
                    "parent_id": "t1_ixh4g5e",
                    "score": 1,
                    "created_utc": 1669212474.0,
                    "replies": []
                },
                {
                    "body": "Well said.",
                    "author": null,
                    "id": "ixhpjn4",
                    "parent_id": "t1_ixh4g5e",
                    "score": 1,
                    "created_utc": 1669216110.0,
                    "replies": []
                },
                {
                    "body": "Well said",
                    "author": "HoneyHorchata",
                    "id": "ixhy6v4",
                    "parent_id": "t1_ixh4g5e",
                    "score": 1,
                    "created_utc": 1669219588.0,
                    "replies": []
                },
                {
                    "body": "Always love when the women posing as SDs make posts like these",
                    "author": "throwawayrtyggv",
                    "id": "ixh4xdp",
                    "parent_id": "t1_ixh4g5e",
                    "score": -42,
                    "created_utc": 1669205670.0,
                    "replies": [
                        {
                            "body": "A mere guess, but maybe comments like this are more along the lines of why you might not be getting matches.\n\nPhysical appearance isn't the only thing women consider under the 'attraction' umbrella.",
                            "author": "SilkySweet2022",
                            "id": "ixhhe4h",
                            "parent_id": "t1_ixh4xdp",
                            "score": 43,
                            "created_utc": 1669212565.0,
                            "replies": [
                                {
                                    "body": "💯",
                                    "author": "myusername_77",
                                    "id": "ixhx8pu",
                                    "parent_id": "t1_ixhhe4h",
                                    "score": 2,
                                    "created_utc": 1669219211.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Lol.  I've been active on this sub for 6 years.  I think that's the first time I've ever been called a women.\n\nFirst for everything.",
                            "author": "SDstartingOut",
                            "id": "ixh54cx",
                            "parent_id": "t1_ixh4xdp",
                            "score": 40,
                            "created_utc": 1669205797.0,
                            "replies": [
                                {
                                    "body": "Better update the flair to Spoiling Girlfriend",
                                    "author": "toesockbandit",
                                    "id": "ixhtn5g",
                                    "parent_id": "t1_ixh54cx",
                                    "score": 11,
                                    "created_utc": 1669217773.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hey, since we are in the age of gender confusion, how does it feel being a woman? ;)",
                                    "author": "A-touchofreality",
                                    "id": "ixhbito",
                                    "parent_id": "t1_ixh54cx",
                                    "score": 8,
                                    "created_utc": 1669209619.0,
                                    "replies": [
                                        {
                                            "body": "The elusive Sugar Mama",
                                            "author": "chemistryromance",
                                            "id": "ixi3rlg",
                                            "parent_id": "t1_ixhbito",
                                            "score": 10,
                                            "created_utc": 1669221802.0,
                                            "replies": [
                                                {
                                                    "body": "🤣🤣🤣",
                                                    "author": "SilkySweet2022",
                                                    "id": "ixihsor",
                                                    "parent_id": "t1_ixi3rlg",
                                                    "score": 3,
                                                    "created_utc": 1669227270.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Wahaha, you must be brand new here or you are still sleepy because it is early at your part of the world!\n\n/u/SDstartingOut is a respected member of this community since YEARS already!\n\nYou *DO* realize how this silly comment makes you look, do you? LOL·",
                            "author": "A-touchofreality",
                            "id": "ixhb7p9",
                            "parent_id": "t1_ixh4xdp",
                            "score": 21,
                            "created_utc": 1669209450.0,
                            "replies": []
                        },
                        {
                            "body": "I'm a man and I think your attitude is pretty entitled and cringe. Put some effort into yourself instead of thinking that you pay your way into getting women's attraction and respect. Sugaring should be about facilitating relationships not buying them.",
                            "author": "Pastakingfifth",
                            "id": "ixhwsyl",
                            "parent_id": "t1_ixh4xdp",
                            "score": 14,
                            "created_utc": 1669219042.0,
                            "replies": []
                        },
                        {
                            "body": "That is a really weird post to make when the guy wasn't even disagreeing with you.",
                            "author": "sdbythebeach",
                            "id": "ixh8wuo",
                            "parent_id": "t1_ixh4xdp",
                            "score": 16,
                            "created_utc": 1669208143.0,
                            "replies": []
                        },
                        {
                            "body": "Red pill 💊",
                            "author": "daddoms",
                            "id": "ixh7xor",
                            "parent_id": "t1_ixh4xdp",
                            "score": 6,
                            "created_utc": 1669207569.0,
                            "replies": [
                                {
                                    "body": "Hm... I'd say it's the opposite of red pill lol. OP is saying that his money compensates for his lack of attractiveness.",
                                    "author": "SDinAsia",
                                    "id": "ixhae9o",
                                    "parent_id": "t1_ixh7xor",
                                    "score": 2,
                                    "created_utc": 1669208993.0,
                                    "replies": [
                                        {
                                            "body": "OP called the responder a “woman” which is childish misogyny",
                                            "author": "daddoms",
                                            "id": "ixhctyv",
                                            "parent_id": "t1_ixhae9o",
                                            "score": 13,
                                            "created_utc": 1669210320.0,
                                            "replies": [
                                                {
                                                    "body": "👏👏👏",
                                                    "author": "Big_Contribution_460",
                                                    "id": "ixhhcbr",
                                                    "parent_id": "t1_ixhctyv",
                                                    "score": 4,
                                                    "created_utc": 1669212542.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You sound incredibly level-headed and respectful of both yourself and of women. Thank you voicing your thoughts.",
                    "author": "KetoSeaweed",
                    "id": "j7ktn92",
                    "parent_id": "t1_ixh4g5e",
                    "score": 1,
                    "created_utc": 1675782278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some people (M&F) like to oversee the fact that both parties *always* have a REASON to sugar.",
            "author": "A-touchofreality",
            "id": "ixh2zim",
            "parent_id": "t3_z2mvs0",
            "score": 16,
            "created_utc": 1669204345.0,
            "replies": []
        },
        {
            "body": "Though I find posts that put men down because they aren't conventionally attractive icky, I would like to stress that money does not entitle you to anything. \n\nWe all have standards and those shouldn't be compromised for anything. All that does is lead to unfulling relationships.\n\nJust like attractiveness gets an SB through the door but who she is as a person invites her to stay, so too does support get an SD through the door but who he is as a person make us want to stay. \n\nIf you're leading with 'but I'm paying you', SBs looking for a relationship will exit stage left faster than you can reach for your wallet.\n\nMany want to be supported, not paid. Most want to be attracted to you in some way. That need not be physically to start. It can totally be through the heart of who you are. Attraction builds from there.",
            "author": "SilkySweet2022",
            "id": "ixhkfvi",
            "parent_id": "t3_z2mvs0",
            "score": 42,
            "created_utc": 1669213955.0,
            "replies": [
                {
                    "body": "This is totally true. I was chatting with an out of State SD who was coming to my area for work in a couple weeks when I first started. I explained that I was looking for someone long term that I could build a relationship with. But he was welcome to continue chatting with and updating me on his success at finding a SB willing to meet with him. We ended up talking every day text and vid calls. He definitely had gained a belly since his profile pics and was not my “type” but his big beautiful heart ❤️ shined and when he talked about his kids and going above and beyond because their mom had abandoned them… it made my panties spontaneously combust. And I made a point to have two uncompensated dates with him for the week he was here. A M&G and a hook up. He tried to pay me and I refused it. I did let him pay for my outrageously overpriced valet parking ☺️ We both agreed if we lived closer we were a match. Not every woman is sexually attracted to substance and intelligence but some are.",
                    "author": "P0sitiveViibes777",
                    "id": "ixifzev",
                    "parent_id": "t1_ixhkfvi",
                    "score": 8,
                    "created_utc": 1669226561.0,
                    "replies": [
                        {
                            "body": "how often did you guys talk before you met?",
                            "author": "barry1988",
                            "id": "ixioafn",
                            "parent_id": "t1_ixifzev",
                            "score": 1,
                            "created_utc": 1669229812.0,
                            "replies": [
                                {
                                    "body": "Every day of just over two weeks, that’s not usual but we were fast tracking the “getting to know you” it was a gamble for him because I made no promises of intimacy, but it paid off in his favor. I rocked his world, how I know this…. He has since been trying to get me to come to his state. All expense paid and allowance. He has been a sugar daddy for years, to young women, but he says it’s been a long time since he felt wanted for more than his wallet. I am extremely affectionate and joyful.",
                                    "author": "P0sitiveViibes777",
                                    "id": "ixiud94",
                                    "parent_id": "t1_ixioafn",
                                    "score": 2,
                                    "created_utc": 1669232237.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Very well said",
                    "author": "HoneyHorchata",
                    "id": "ixhy1rq",
                    "parent_id": "t1_ixhkfvi",
                    "score": 4,
                    "created_utc": 1669219530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s only so much money can compensate for. Just cuz a woman sugars doesn’t mean she’s desperate or without standards.",
            "author": "yanonotreally",
            "id": "ixhjfvb",
            "parent_id": "t3_z2mvs0",
            "score": 20,
            "created_utc": 1669213507.0,
            "replies": []
        },
        {
            "body": "Buddy, let me tell you something…\n\nTHE VAST MAJORITY of 20-something’s would never vanilla date a guy 35+, even if he looked like Brad Pitt. Sure, he’s got movie-star good looks, but he’s still old! Young women romanticize him, but that doesn’t make it realistic. \n\nAnd guys like Leonard DiCaprio date hot young women because: fame + money. I promise you if he was average Joe, he wouldn’t be able to do that. \n\nI’ve had vanilla hookups with young women before (21, 21) and short vanilla things (23, 24), but those are RARE. And the vanilla ones I found on Seeking. The hookups were Tinder. But they just don’t turn into relationships for all kinds of reasons. \n\nOlder guys don’t often pull younger women because MOST younger women want to date within 5-10 years of their own age.\n\nAnyway, you being on Seeking has little to do with your looks, and has more to do with you being attracted to much younger, prettier women (which is very normal for a man, countless studies have shown this). With that being said, stop being so self-defeating and LOSE weight. It WILL help you with all types of dating.",
            "author": null,
            "id": "ixi971m",
            "parent_id": "t3_z2mvs0",
            "score": 22,
            "created_utc": 1669223933.0,
            "replies": [
                {
                    "body": "the vast majority within which demographic though?",
                    "author": "night-gloss",
                    "id": "ixiztkd",
                    "parent_id": "t1_ixi971m",
                    "score": 2,
                    "created_utc": 1669234381.0,
                    "replies": [
                        {
                            "body": "I’m just saying as a generalization. 20’s don’t match with 40+ often on dating apps, regardless of how good looking you are. It happens, just not the majority of the time. I’m referring to the USA by the way… may be different in other countries/cultures.",
                            "author": null,
                            "id": "ixj124l",
                            "parent_id": "t1_ixiztkd",
                            "score": 1,
                            "created_utc": 1669234875.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I know a guy early 40s who pull girls in their 20s on a weekly basis. Most 35+ men dont pull young girls because they dont know how. To be fair, most guys on seeking dont know how to meet and attract women, hence why they on seeking.",
                    "author": "AspiringFIRE1993",
                    "id": "ixj15tn",
                    "parent_id": "t1_ixi971m",
                    "score": 0,
                    "created_utc": 1669234915.0,
                    "replies": [
                        {
                            "body": "One a week is still not the majority of women. If he was 29 he’d probably have 100’s of matches per week of girls in their 20’s. I’d say your friend is probably the best case scenario. Especially if the women he sees are super attractive. \n\nThat’s kinda my point. You have to be exceptional… It’s not the general rule.",
                            "author": null,
                            "id": "ixj1qx1",
                            "parent_id": "t1_ixj15tn",
                            "score": 1,
                            "created_utc": 1669235151.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This couldn't be further from the truth. Women prefer older men. Get real.",
                    "author": "Most-Poetry-3540",
                    "id": "iximnly",
                    "parent_id": "t1_ixi971m",
                    "score": -5,
                    "created_utc": 1669229174.0,
                    "replies": []
                },
                {
                    "body": "THE VAST MAJORITY OF 20-something’s would never vanilla date me when I was in my 20s.\n\nSo nothing changed.",
                    "author": "PotGoblin",
                    "id": "j0g4cuh",
                    "parent_id": "t1_ixi971m",
                    "score": 1,
                    "created_utc": 1671191272.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We're not looking for Brad Pitt, but I think it's fair to say that most of us want to be attracted to our SD's. Are there women that don't care at all about looks? Sure, but they're in the minority. And if you're chasing the most popular SB's, you can bet that they have a ton of options. Why wouldn't they go for the more attractive SD's? \n\n>On the flip side, women should probably stop getting so upset when we have higher standards.\n\nThat goes both ways. Don't get upset when women are pickier cause they have more options.",
            "author": "Matcha_Alpaca",
            "id": "ixh8q5i",
            "parent_id": "t3_z2mvs0",
            "score": 22,
            "created_utc": 1669208036.0,
            "replies": [
                {
                    "body": "Speak for yourself. I’m **always** looking for Brad Pitt.",
                    "author": "curly_spice",
                    "id": "ixh99bn",
                    "parent_id": "t1_ixh8q5i",
                    "score": 13,
                    "created_utc": 1669208345.0,
                    "replies": [
                        {
                            "body": "I'm more of a George Clooney girl 😉",
                            "author": "Matcha_Alpaca",
                            "id": "ixh9f1v",
                            "parent_id": "t1_ixh99bn",
                            "score": 8,
                            "created_utc": 1669208436.0,
                            "replies": [
                                {
                                    "body": "Jeff Goldblum all the way !",
                                    "author": "princessnellybelle",
                                    "id": "ixhgm1d",
                                    "parent_id": "t1_ixh9f1v",
                                    "score": 7,
                                    "created_utc": 1669212201.0,
                                    "replies": [
                                        {
                                            "body": "Heh.  I actually get told I look like him sometimes!  How u doin?",
                                            "author": "unique_leek_critique",
                                            "id": "ixi9j09",
                                            "parent_id": "t1_ixhgm1d",
                                            "score": 2,
                                            "created_utc": 1669224065.0,
                                            "replies": [
                                                {
                                                    "body": "Jeff Goldblum looks and Joey pick up lines . I love it !",
                                                    "author": "princessnellybelle",
                                                    "id": "ixi9wf2",
                                                    "parent_id": "t1_ixi9j09",
                                                    "score": 3,
                                                    "created_utc": 1669224209.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Why not both? Watching Ocean’s Eleven (for the first time Saturday, i know) doubled down on my eternal desire for both. 🤤",
                                    "author": "curly_spice",
                                    "id": "ixhbnhz",
                                    "parent_id": "t1_ixh9f1v",
                                    "score": 5,
                                    "created_utc": 1669209688.0,
                                    "replies": [
                                        {
                                            "body": "Matt Damon definitely is in that crowd for me...:D",
                                            "author": "SilkySweet2022",
                                            "id": "ixhzio6",
                                            "parent_id": "t1_ixhbnhz",
                                            "score": 3,
                                            "created_utc": 1669220113.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ixhxswr",
            "parent_id": "t3_z2mvs0",
            "score": 14,
            "created_utc": 1669219431.0,
            "replies": [
                {
                    "body": "Don't worry, you're far from alone in this.",
                    "author": "JustAsk4Alice",
                    "id": "ixjd3ro",
                    "parent_id": "t1_ixhxswr",
                    "score": 1,
                    "created_utc": 1669239746.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am neither ugly nor overweight but I AM married and that is a significant disadvantage if you want to enjoy the company of beautiful women.",
            "author": "chemistryromance",
            "id": "ixhwyxz",
            "parent_id": "t3_z2mvs0",
            "score": 10,
            "created_utc": 1669219109.0,
            "replies": []
        },
        {
            "body": "It's always helpful in a Sugar Relationship when there's a connection.  Physical and mental attraction can enhance the SR significantly.  No SB needs to date someone they don't like, money or not.  It seems shallow to think that money trumps all.",
            "author": "Beginning_Pear_2231",
            "id": "ixh32v8",
            "parent_id": "t3_z2mvs0",
            "score": 13,
            "created_utc": 1669204409.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ixhaufs",
            "parent_id": "t3_z2mvs0",
            "score": 12,
            "created_utc": 1669209246.0,
            "replies": [
                {
                    "body": "Amen...😬",
                    "author": "SilkySweet2022",
                    "id": "ixii0dc",
                    "parent_id": "t1_ixhaufs",
                    "score": 2,
                    "created_utc": 1669227353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t know why anyone would complain about someone’s looks when they simply don’t have to interact with them anyways.\n\nPersonally, I care about my SD’s appearance. No amount of money can make me a good enough actress to an ugly rich man. Thankfully a great personality on a man can go a long way….",
            "author": "salkaurs",
            "id": "ixhgu00",
            "parent_id": "t3_z2mvs0",
            "score": 7,
            "created_utc": 1669212307.0,
            "replies": []
        },
        {
            "body": "I use sugar dating to date women out of my league, and for the sheer convenience of it, simple as that\n\nI look younger than my age and am in good shape - but still given my age (40s) the types of women available to me in vanilla land are not the ones that excite me day in day out\n\nAnd guys my age trying to date younger regular women in their mid 20s (not the professional sbs) can come across as somewhat of a creep in the wrong setting - American society is still somewhat backwards in this regard for the most part \n\nSugardating filters for the women already predisposed to this lifestyle and makes it very convenient in terms of lifestyle expectations",
            "author": "OCbird22",
            "id": "ixiacbt",
            "parent_id": "t3_z2mvs0",
            "score": 9,
            "created_utc": 1669224382.0,
            "replies": []
        },
        {
            "body": "Overweight = overpaid in my book😍. I wouldn’t give a crap what my SD looked like. As long as he’s legit a nice person and or knows how to handle this type of relationship and doesn’t harm me physically. That’s all I ask.",
            "author": "Wowkittyminaj",
            "id": "ixiaa85",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669224359.0,
            "replies": []
        },
        {
            "body": "Anyone with economics background knows the whole thing is a curve.\n\nFor example, you have PPM on y-axis and overall looks of the SD on the x-axis. A SB requirement would be a curve. \n\nOne end pointing to really high PPM (sometimes infinity) if x is close to the minimum looks she would accept. The other end pointing to really high looks (probably infinity) with y on a certain minimum PPM she would accept regardless if looks.\n\nThen there is the SD box. Which is simply 2 lines one is his looks (which he can't change) and the other is the the highest PPM he would accept.\n\nAny SB requirement line crossing inside the box is well within the SD target.\n\nIf a SB has her requirement curve so high that the box can't even touch then she won't be in the SD reach and will have to wait until a much larger box or just simply longer box that comes along.",
            "author": "Majesticpork",
            "id": "ixik79k",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669228202.0,
            "replies": []
        },
        {
            "body": "If you feel entitled to a woman because you have the money, then you're ugly both inside and out and no one would wanna be with you.",
            "author": "paypahcut",
            "id": "ixhbem2",
            "parent_id": "t3_z2mvs0",
            "score": 15,
            "created_utc": 1669209556.0,
            "replies": [
                {
                    "body": "OP's post history paints a pretty clear picture of how entitled he is.",
                    "author": "Matcha_Alpaca",
                    "id": "ixhc1ah",
                    "parent_id": "t1_ixhbem2",
                    "score": 9,
                    "created_utc": 1669209893.0,
                    "replies": [
                        {
                            "body": "Also how much of a victim complex he has.  Reminds me of a certain politician.\n\nActually, seems like OP views women in a similar light as that politician also.",
                            "author": "SDstartingOut",
                            "id": "ixi7jgo",
                            "parent_id": "t1_ixhc1ah",
                            "score": 6,
                            "created_utc": 1669223281.0,
                            "replies": [
                                {
                                    "body": "Bingo!",
                                    "author": "Matcha_Alpaca",
                                    "id": "ixi9fo6",
                                    "parent_id": "t1_ixi7jgo",
                                    "score": 1,
                                    "created_utc": 1669224029.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The only entitled people on here who are all the sbs who think they deserve money simply for existing",
                            "author": "throwawayrtyggv",
                            "id": "ixhe1gb",
                            "parent_id": "t1_ixhc1ah",
                            "score": -16,
                            "created_utc": 1669210941.0,
                            "replies": [
                                {
                                    "body": "And yet here you are commenting on your own post about SB's not accepting your money. Your post and comment history suggests you're not having a great time in the bowl. Maybe you need to change your approach.",
                                    "author": "Matcha_Alpaca",
                                    "id": "ixhewnp",
                                    "parent_id": "t1_ixhe1gb",
                                    "score": 16,
                                    "created_utc": 1669211379.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have the 'looks'. However, I really like it when they are physically attracted to me and it shows. I use my looks to get my foot in the door. Am I 'Brad Pit'? More like 'Jason Statham'",
            "author": "CenTexFunGuy",
            "id": "ixh62jg",
            "parent_id": "t3_z2mvs0",
            "score": 4,
            "created_utc": 1669206409.0,
            "replies": [
                {
                    "body": "Jason Statham you mean? If yes then I would consider you attractive. I mean Jason himself landed Rosie.",
                    "author": "paypahcut",
                    "id": "ixhawsy",
                    "parent_id": "t1_ixh62jg",
                    "score": 3,
                    "created_utc": 1669209283.0,
                    "replies": [
                        {
                            "body": ">Jason Statham you mean?\n\nYes, I corrected the spelling. ( I just use metal clippers. I do not use a razor) Not clean shaven bald. I have also been told I look like 'Steve Austin' the former Wrestler.\n\nI am very fit and lean.",
                            "author": "CenTexFunGuy",
                            "id": "ixhcsej",
                            "parent_id": "t1_ixhawsy",
                            "score": 2,
                            "created_utc": 1669210298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People with peanut allergies can still enjoy a trip to a chocolate store as not every chocolate bar will contain nuts. This is no different - SDs (and SBs) come in many forms. It might take longer to find one you want, but if you shop around long enough you should be able to leave with a chocolate bar that suits your taste. 😊\n\n…I write, while looking at a painting of a chocolate bar in the lobby of my dentist’s office.",
            "author": "curly_spice",
            "id": "ixh93vw",
            "parent_id": "t3_z2mvs0",
            "score": 8,
            "created_utc": 1669208257.0,
            "replies": []
        },
        {
            "body": "I have no problem in seeing those comments. I understand those girls because I myself wouldn't bother to get in touch more than 20% of the profile reviews I see on here.\n\nI'm just old enough to know that not everything requires my opinion, so I don't proactively vent it out.\n\nps/I'll make an exception: in fact, it's even less than 20%. Of the first 8 Profile Reviews I could open from the first page of the subreddit, I'd only be really interested in SweetieWanders.",
            "author": "Lov3rm4n",
            "id": "ixhjmw5",
            "parent_id": "t3_z2mvs0",
            "score": 6,
            "created_utc": 1669213594.0,
            "replies": [
                {
                    "body": "Like for real, the lassies are sooooo out of their depth going into the bowl. I would only get in touch with 1 out of the 20 profile reviews. It is no surprise they aren't getting any SD hits and only scammers",
                    "author": "buddyboard",
                    "id": "ixif1zk",
                    "parent_id": "t1_ixhjmw5",
                    "score": 1,
                    "created_utc": 1669226204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wouldn’t spend a second with someone I didn’t find attractive, I don’t care how much they are offering. If their personality is terrible as well, even more the reason to next them",
            "author": "Sugarcookie54321_",
            "id": "ixhlnpn",
            "parent_id": "t3_z2mvs0",
            "score": 6,
            "created_utc": 1669214482.0,
            "replies": []
        },
        {
            "body": "I personally wouldn’t want a SD that is as pretty as me, Because they are full of themselves, self centered, with an ego you can see a mile away. I want his attention on me instead of him looking at his self in the mirror every 5 minutes. Looks to me are important but I also am attracted to the way I am treated and how we are together and of course the chemistry. But I agree about the recent posts of the very rude SB’s talking trash about older less attractive SD’s because even if they are a 10, Having an attitude like that makes them ugly asf.",
            "author": "39sherry",
            "id": "ixhphp0",
            "parent_id": "t3_z2mvs0",
            "score": 5,
            "created_utc": 1669216088.0,
            "replies": [
                {
                    "body": "I second this, when a man treats me right and makes me feel beautiful (and can make me laugh) they definitely become more attractive",
                    "author": "PoosanItRhymesWSusan",
                    "id": "ixj6uyj",
                    "parent_id": "t1_ixhphp0",
                    "score": 3,
                    "created_utc": 1669237194.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "After reading your post history, your appearance isn’t the issue.",
            "author": "hoopsta98",
            "id": "ixiezto",
            "parent_id": "t3_z2mvs0",
            "score": 6,
            "created_utc": 1669226181.0,
            "replies": []
        },
        {
            "body": "I find that happens so rarely that the men complaining about the women complaining are hard to take seriously.",
            "author": "LucyHoneychurch-",
            "id": "ixhdgtb",
            "parent_id": "t3_z2mvs0",
            "score": 5,
            "created_utc": 1669210647.0,
            "replies": []
        },
        {
            "body": "I've read too many times before in various \"human interest\" articles like Psol. Today or Vogue..For a woman the best male sex organ for her is the brain.. IDK how accurate that really is, but have wondered about it.",
            "author": "surfrat54",
            "id": "ixj60ao",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669236851.0,
            "replies": []
        },
        {
            "body": "I'm not exactly sure what you are venting about. In the SLF sub the sbs don't generally bring up ugly sds too much. Those types of posts are usually found in the other sb sub.",
            "author": "malcolm_reyn0lds",
            "id": "ixk05ty",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669250131.0,
            "replies": []
        },
        {
            "body": "\"Anybody who tells you money can't buy happiness, never had any.\"  - Samuel Jackson",
            "author": "flacy01",
            "id": "ixknxcn",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669261993.0,
            "replies": []
        },
        {
            "body": "SD here & With utmost respect, not all guys are here paying. “F&F” tax. \n\nThat stands for “Fat & Fugly” tax.  If you are one of those tax payers then my ultimate sympathies to you. \n\nMany are here because of the amazing conveniences / limited to zero liability nature of sugar. \n\nSugar helps them maintain the arms length with the woman while being able to enjoy the benefits and also get flexibility to date multiple women. \n\nMost of them are married and others just do not want to date vanilla or women their age. So not everyone is here paying the “F&F” tax. \n\nPlus bluntly the SR will not be one bit interesting if there was no mutual attraction. So I don’t support or agree to what you are saying. I’d simply cut down on the cookies and cakes and hit the gym for starters.",
            "author": null,
            "id": "ixhg4xb",
            "parent_id": "t3_z2mvs0",
            "score": 6,
            "created_utc": 1669211973.0,
            "replies": [
                {
                    "body": ">SD here & With utmost respect, not all guys are here paying. “F&F” tax.\n\nExactly this..! Some of us are here because ultimately we want a carefree relationship with someone young, beautiful and fun loving, without having to worry about where this relationship is going, and settling down, having kids or starting family. Personally most of the SB ive dated, are just as attractive or better, then many that I dated in my 20's and 30's, only difference is that it took more work to get them back then, and now its a bit easier, because money opens the doors to meeting them, but maturity, good manners, confidence and success help close the deal, as well as still taking care of yourself and looking good for your age.",
                    "author": "NickPfromYuma",
                    "id": "ixhqmho",
                    "parent_id": "t1_ixhg4xb",
                    "score": 2,
                    "created_utc": 1669216554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are not obese - you are a 'curvy' and attractive man.   Plus you are not ugly when your photos are touched up.  You know your worth!",
            "author": "HappyBear1952",
            "id": "ixib6hg",
            "parent_id": "t3_z2mvs0",
            "score": 4,
            "created_utc": 1669224710.0,
            "replies": [
                {
                    "body": "LMAO 🤣🤣🤣",
                    "author": "TroubleAdorable9226",
                    "id": "ixkfwwu",
                    "parent_id": "t1_ixib6hg",
                    "score": 1,
                    "created_utc": 1669257775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like my men out of shape.",
            "author": "Acucar_amorpho",
            "id": "ixhdt13",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669210821.0,
            "replies": [
                {
                    "body": "Heh. Why is that?",
                    "author": null,
                    "id": "ixhfxt3",
                    "parent_id": "t1_ixhdt13",
                    "score": 3,
                    "created_utc": 1669211878.0,
                    "replies": [
                        {
                            "body": "Round = soft\n\nGood for hugging",
                            "author": "peregrine_nation",
                            "id": "ixhk8k4",
                            "parent_id": "t1_ixhfxt3",
                            "score": 7,
                            "created_utc": 1669213865.0,
                            "replies": [
                                {
                                    "body": "Thank you! \n\nIn my younger days (20s) some women would note that my being so thin would sometimes cause some pain during a particularly active sex session. (Boney hips)\n\nThat has not been a concern lately. 😂",
                                    "author": "Chill_SD1974",
                                    "id": "ixhttbk",
                                    "parent_id": "t1_ixhk8k4",
                                    "score": 2,
                                    "created_utc": 1669217841.0,
                                    "replies": []
                                },
                                {
                                    "body": "The cuddlier they are the better.",
                                    "author": "Acucar_amorpho",
                                    "id": "ixho6cj",
                                    "parent_id": "t1_ixhk8k4",
                                    "score": 1,
                                    "created_utc": 1669215547.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If she don’t like it there are others that will",
            "author": "Few-Mix8183",
            "id": "ixhkpvy",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669214079.0,
            "replies": []
        },
        {
            "body": "It's a volutiontary exchange between two adults. Each offering something and receiving something that they want\n\nIf either party don't think it's a fair deal, they will leave.\n\nWhether the perception of the fair deal is correct or not is irrelevant. People have expectations. If those are wrong they will either learn and change those expectations or go on until reality hits. Nothing we say or complain about will change this dynamic. \n\nIf you feel that being physically unattractive as a man is limiting your options even with money then you know what you need to do. You can spare 40 minutes everyday to exercise. It won't give you 6 packs but it will move your attractive level one notch higher and improve your overall chances. Change your outlook on life be a pleasant and interesting person and you can actually build up the attractions. Plenty of ugly dudes got beautiful women.",
            "author": "ReturnDisastrous",
            "id": "ixhs0n5",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669217117.0,
            "replies": []
        },
        {
            "body": "You’re not handsome enough.\n\nYou’re not pretty enough. \n\nYou’re not generous enough. \n\nYou’re too greedy. \n\nWhat a great basis for a passionate relationship.",
            "author": "MildlyIntriguingGuy",
            "id": "ixhtxb1",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669217886.0,
            "replies": []
        },
        {
            "body": "If you don't care about the woman being attracted to you then get an escort. I'm not trying to be jerk about it.  \n\nOtherwise I really want my SB to be attracted to me.  For it to be a good experience. Not like I have to punched hard in the face by Tyson (in his prime or now) before my good time can begin. T\n\nOtherwise sex will seem like a chore for them. Hell some wives make SDs feel that way. I hear it a lot from colleagues. Wife's just going through the motion laying in bed while the hubs pumps away and she probably thinking \"hmm do I have onions or do I need to go get some? Oh wait I think I do have some but I may need more. Ok I'll just get some anyhow\" And it will become obvious she just isn't into you. These are wives that presumably married us in our prime and not for sugar.\n\nEscorts they don't care or learn to suppress that part of repulsion because they really are hot for Ben and his 9 plus clones at minimum if you want a hot babe and good experience and not someone who deals in volume. Benny gets them wet and going.  Now there are escorts that sugar as well so it's not a perfect example. Hell last time I went on SA I really thought these 2 girls were going to be awesome and I asked them questions and eventually it became obvious that they were escorts throwing terms from that field. I have nothing against that but not what I was looking for but now there are SO many on there. Usually they don't ask for a pic at anytime which is the red flag.  \n\nI'm not a young Brad PITT or future Brad PITT at 100 yr old.  So it's not like \"well that's easy for you to say\" my pics are unfiltered cuz I want them to see what i look like and may not be the best pic cuz if they like me then based on pics then they will maybe like me more when in person. \n\nI don't know if this is the case with you but don't bring a chip into the negotiations if they don't like what you offering.  What I mean is don't be an ass and mean about it if the conversation is going the way you like it? Also you may need to increase what your offering . \n\nPut yourself in a SBs shoes and be honest with yourself and say would I want to be with me if I offered only this D(Roman numeral )? What amount would make me less reluctant and be willing to give me a chance to at least meet and give me a chance to go beyond the physical? Perhaps M worth of US currency for a date.  \nMany of these SBs have offers blowing their mailboxes. \n\nYou may be obese but you also may be knowledgeable witty romantic generous gentleman and an unselfish lover who is well endowed or least above average. My ex told me about a guy she really wasn't into but she gave him a chance and he ate that like it was going behind a vault for 20 years ..so she would still see him cuz of that but she found him unattractive and annoying. Just saying got get their attention ..Then the other factor will weigh less against you.  \n\nGood luck though in your search. A good SR can be a very good experience indeed.",
            "author": "Federal_Garage_4307",
            "id": "ixich5q",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669225210.0,
            "replies": []
        },
        {
            "body": "So you want to maintain your higher standards but insist that SBs should have no standards because you’re paying them? Ew. Don’t you realize SBs will still have some set of standards even in sugaring, and it’s not necessarily a bad thing? Or did you think money would completely eliminate any need for attraction? I assure you that it may just not be your physical appearance here that’s the deterrent.",
            "author": "GoodyGoobert",
            "id": "ixipnr7",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669230361.0,
            "replies": []
        },
        {
            "body": "Ok.",
            "author": null,
            "id": "ixhpfla",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669216064.0,
            "replies": []
        },
        {
            "body": "I’m on the fence with this one…\n\nI may start out as SB/SD but I’m more then willing to progress to SGF/SBF so there does have to be something more to the SR then looks & money. Besides, ur not spending all of ur time together in the bedroom. This is where that being attracted to and having actual chemistry with a person becomes important.",
            "author": "MystressJessy",
            "id": "ixj83ty",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669237701.0,
            "replies": []
        },
        {
            "body": "If you’re a 5, don’t go for a 10. Maybe go for an 8 if you’re incredibly average looking but a millionaire or more. I wouldn’t go for a 10 unless you’re at least an 8 yourself. We can still model and do non sexual things for that kind of money! Don’t think being rich will get you a supermodel if you don’t do anything to make yourself more attractive to the type of women you’re attracted to. Money won’t get us wet. We’re used to getting money for nothing!",
            "author": "Juicy_Peach420",
            "id": "ixjtxuy",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669247215.0,
            "replies": []
        },
        {
            "body": "Recent polls suggest that 50+% of SBs don't care about looks ,don't particularly care about their SD, and are only after the support.   But the converse is also true, that 50% actually want a SD who is attractive to them and who they care about. The former are obviously mercenary, the latter not so much.   \n\nTo your point, thank goodness for the age, looks,marriage, and attraction tax.",
            "author": "GSSD",
            "id": "ixhdmly",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669210729.0,
            "replies": []
        },
        {
            "body": "The way to win is to hit the gym my friend, and it's good for your health :)",
            "author": "sugardad123",
            "id": "ixhetjo",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669211335.0,
            "replies": []
        },
        {
            "body": "Why do people complain? If you can’t change it, then leave. Plenty of women also have higher standards. If you look like Steve Buscemi or Marty Feldman, you’re not likely getting a Megan Fox or Angelina Jolie unless she has an IQ of 85. If you’re not the full package then you aren’t going to get the full package. Maybe grow a beard and go to the gym? If that’s what you want, go for it! Beautiful and intelligent women have so many options these days. No one’s perfect, but the closer someone is, the less likely they are going to be lowering their standards.",
            "author": "Juicy_Peach420",
            "id": "ixj4xph",
            "parent_id": "t3_z2mvs0",
            "score": 2,
            "created_utc": 1669236425.0,
            "replies": [
                {
                    "body": "What are you going for? I can easily get the amount of a normal PPM to pose in lingerie or do Domme things that don’t involve sex or oral on men. I’m not the prettiest girl in the world in my opinion, but apparently I look like a supermodel, and men are willing to pay gorgeous women more for far less work, commitment, acting, etc, than what you’re asking for as a SD.",
                    "author": "Juicy_Peach420",
                    "id": "ixjs6xf",
                    "parent_id": "t1_ixj4xph",
                    "score": 1,
                    "created_utc": 1669246408.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so glad I’ve never come across an obese SD before lol. That must be rare.",
            "author": "fairyfitness",
            "id": "ixh2rni",
            "parent_id": "t3_z2mvs0",
            "score": 3,
            "created_utc": 1669204193.0,
            "replies": [
                {
                    "body": "I have. Didn’t know he was obese from his account (used old pics). I don’t judge based on that and it’s not a preference issue so I went on with the date. When it was time to give me an allowance he gave himself a little discount and short me a hundred bucks lol what an asshole. Blocked him after that",
                    "author": null,
                    "id": "ixh8me0",
                    "parent_id": "t1_ixh2rni",
                    "score": 2,
                    "created_utc": 1669207974.0,
                    "replies": [
                        {
                            "body": "I'm missing something. You went on a date and he gave you less than what you both agreed upon  before the date? \nIf so, why didn't you confront him right there and then?\n\n Come to think about it, what are possible defenses/countermeasures?",
                            "author": "dallas-explorer",
                            "id": "ixpb4bd",
                            "parent_id": "t1_ixh8me0",
                            "score": 1,
                            "created_utc": 1669355800.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I rarely see this on here and there is way too much derogatory remarks and straight up hate speech against women here. We are not obligated to date you just because you like us and have money. And you having money does not excuse these derogatory hateful remarks. It's not hard to take care of yourself a bit and be respectful. Women tend to complain when it's the last straw. 'Men' throw absolute tantrums when they don't get their way.",
            "author": "MissRoyalBrush",
            "id": "ixinzcf",
            "parent_id": "t3_z2mvs0",
            "score": 0,
            "created_utc": 1669229691.0,
            "replies": []
        },
        {
            "body": "The allowance compensates for not being at birthdays, or Holidays, or he is overly busy… having to work around his schedule.",
            "author": "HowSheWalks",
            "id": "ixi3txo",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669221828.0,
            "replies": []
        },
        {
            "body": "Everyone likes what they like. There are plenty of people out there. If one isn't interested, another is sure to be.",
            "author": "TigerSharkSLDF",
            "id": "ixhsi2v",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669217311.0,
            "replies": []
        },
        {
            "body": "This right here is totally accurate",
            "author": "Heree2Comment",
            "id": "ixihzyg",
            "parent_id": "t3_z2mvs0",
            "score": 0,
            "created_utc": 1669227349.0,
            "replies": []
        },
        {
            "body": "i chuckle when i read girls saying they want tall SDs. those tall good looking guys dont need to pay for it, generally speaking. delusional",
            "author": "vtec_tt",
            "id": "ixj7ofe",
            "parent_id": "t3_z2mvs0",
            "score": 0,
            "created_utc": 1669237526.0,
            "replies": []
        },
        {
            "body": "Everyone will have their own standards and that’s fine.  Not everyone will be a match to everyone else.  \n\nThere are things in SB profiles or certain physical things that’s are complete no-goes for me, and I can fully accept that SBs have similar standards.  \n\nIdeally any SR should be just that, a relationship, which means there has to be some level of mutual interest and attraction.   I don’t want to sugar date someone who feels like she has to “lie back and think of England” every time we’re intimate.",
            "author": "SugarlifeAlt",
            "id": "ixhcy0p",
            "parent_id": "t3_z2mvs0",
            "score": 0,
            "created_utc": 1669210377.0,
            "replies": []
        },
        {
            "body": "Hoomans like to create problems for themselves. I leave it at that. It is they who suffer, not me .. so I mostly don't bring it up anymore when I see them stuck because of unrealistic demands. \n\nThe good thing about all of this is it's like a big, flashing sign on their foreheads of which types to avoid.. because believe me when I say, these delusional types usually have very ugly personalities to go with all of these demands. They are best to be avoided and the more down-to-earth, kind women to be tended to and spoiled as they are the much more desirable and deserving ones.",
            "author": "TroubleAdorable9226",
            "id": "ixkfa8r",
            "parent_id": "t3_z2mvs0",
            "score": 0,
            "created_utc": 1669257463.0,
            "replies": []
        },
        {
            "body": "In the words of Jackie Gleason...\"Everybody's got a price\"....",
            "author": "surfrat54",
            "id": "ixj4bs5",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669236181.0,
            "replies": []
        },
        {
            "body": "It goes both ways. The women that come to the bowl don't get what they want from vanilla. Thats why it ends up working out for both of us. We get what we aren't getting outside of this experience. Its not for everybody and its not as easy as they make it seem. Thats why so many can 't find the SRs.",
            "author": "YACSB",
            "id": "ixjdrxx",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669240026.0,
            "replies": []
        },
        {
            "body": "I'm not going to judge anyone who wants to date someone a little more attractive.  From what i've read on posts here and seeking, some people have good paying careers or going to school for professional jobs.  Arrangements between two people that have goals to complement each other is good for both parties.\n\nWhen it comes down to \"how much money to offset my shortcomings\" will depend on your shortcomings and how much need someone is experiencing.  \n\nI know if I get into an arrangement, i'd prefer someone who is actually attracted to me and would even encourage them to hold me to a standard.  Not for them but for me.  I know I wasn't happy with myself after the pandemic and had to spend 6 months training to get back in shape.  I would have loved someone to holding me to a standard during that time.",
            "author": "Much-Independence717",
            "id": "ixlmgfm",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669287009.0,
            "replies": []
        },
        {
            "body": "I make it clear on my profile: my wallet has grown with my belly! I definitely know some people that went the other way and are broke beach bums.\n\nJust pick your poison and if it doesn't work for you, that's fine, move on!",
            "author": "Payingfor",
            "id": "ixnjlhv",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669321821.0,
            "replies": []
        },
        {
            "body": "I think you’re overestimating the fact money only goes so far. Idc how much allowance or ppm you’re offering, if I’m not attracted to you or find you repulsive, then I will 100% not respond to your message or politely reject you. I don’t see myself LT with a man I find gross. No amount of money is worth faking it and you’d probably sense that sooner or later, and we’d have to end the arrangement. Women are allowed to have standards.. that doesn’t mean we expect a Brad Pitt.",
            "author": null,
            "id": "ixot261",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1669345047.0,
            "replies": []
        },
        {
            "body": "I actually think this is valid complain. Except if it is about features that can't be ever changed.\n\nIf you are rich enough to pay SBs, you definitely can afford taking care of your health and looks. It is for your own benefit if SB is more attracted visually to you.",
            "author": "Account-setup",
            "id": "izigk68",
            "parent_id": "t3_z2mvs0",
            "score": 1,
            "created_utc": 1670580359.0,
            "replies": []
        },
        {
            "body": "Nailed it",
            "author": "yanonotreally",
            "id": "ixhjwj4",
            "parent_id": "t1_ixhbp2g",
            "score": 12,
            "created_utc": 1669213715.0,
            "replies": []
        },
        {
            "body": "ofc you want them to be attracted to you the $$ helps wash that down.\n\nspin everything else to soothe the male ego I get it (ive done it) but in the end it is the $$ with a nice, fun, charming guy. Who in 99% of cases they would not openly date without sugar.",
            "author": "bookworm010101",
            "id": "ixm1ge0",
            "parent_id": "t1_ixhbp2g",
            "score": 5,
            "created_utc": 1669297576.0,
            "replies": [
                {
                    "body": "I can't tell from your post history if you are a man or a woman, but if you've never been in a Sugar Relationship with someone that you are attracted to and is attracted to you, then you haven't been in a Sugar Relationship in my mind.  There are a lot of women that are attracted to more than just youthful looks and there a lot of men who want more than just sex with an attractive woman.  I don't understand why that seems to offend people. \n\nI'm comfortable with my life choices, so I'm not bothered by other people's opinions about my life choices.  It's called maturity.",
                    "author": "MaxFromVenice",
                    "id": "ixm3439",
                    "parent_id": "t1_ixm1ge0",
                    "score": 3,
                    "created_utc": 1669298461.0,
                    "replies": [
                        {
                            "body": "Great if you found that :) normally that is not the case there is a bit of acting involved in most SRs especially from the SB side.",
                            "author": "bookworm010101",
                            "id": "ixm3joo",
                            "parent_id": "t1_ixm3439",
                            "score": 3,
                            "created_utc": 1669298696.0,
                            "replies": [
                                {
                                    "body": "I think the issue is when people expect to find romantic love within a Sugar Relationship, but I do look to build a strong friendship. I've remained friends with several SBs long after our arrangements ended.  It's possible to become good friends without expecting romantic love leading to marriage and/or children.",
                                    "author": "MaxFromVenice",
                                    "id": "ixm49oh",
                                    "parent_id": "t1_ixm3joo",
                                    "score": 2,
                                    "created_utc": 1669299076.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "izvzvvu",
                                            "parent_id": "t1_ixm49oh",
                                            "score": 1,
                                            "created_utc": 1670826926.0,
                                            "replies": [
                                                {
                                                    "body": "Lol",
                                                    "author": "MaxFromVenice",
                                                    "id": "izw9u7a",
                                                    "parent_id": "t1_izvzvvu",
                                                    "score": 1,
                                                    "created_utc": 1670834747.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "j05f460",
                                                            "parent_id": "t1_izw9u7a",
                                                            "score": 1,
                                                            "created_utc": 1670993381.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What if I'm not married? lol",
                                                                    "author": "MaxFromVenice",
                                                                    "id": "j05w0l7",
                                                                    "parent_id": "t1_j05f460",
                                                                    "score": 1,
                                                                    "created_utc": 1671004658.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "j07xah1",
                                                                            "parent_id": "t1_j05w0l7",
                                                                            "score": 1,
                                                                            "created_utc": 1671043362.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                                                                    "author": "MaxFromVenice",
                                                                                    "id": "j07ysca",
                                                                                    "parent_id": "t1_j07xah1",
                                                                                    "score": 1,
                                                                                    "created_utc": 1671043929.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "j07z4w3",
                                                                                            "parent_id": "t1_j07ysca",
                                                                                            "score": 1,
                                                                                            "created_utc": 1671044060.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In this day & age with sexual freedom, if a woman is attracted to you, she will sleep with you as she enjoys it. I dare you to test your SBs and stop paying. If she doesn’t still wanna see you, she’s not genuinely into you.",
            "author": null,
            "id": "ixljgz3",
            "parent_id": "t1_ixhbp2g",
            "score": 1,
            "created_utc": 1669284341.0,
            "replies": [
                {
                    "body": "For the women I date, financial support is one aspect of what I offer. If I was significantly older, overweight, rude, etc, I'm sure that would impact who I was able to date as well. I understand my charm, looks, success, confidence, financial support, etc are all important aspects of my appeal.",
                    "author": "MaxFromVenice",
                    "id": "ixlkmk9",
                    "parent_id": "t1_ixljgz3",
                    "score": 5,
                    "created_utc": 1669285392.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> I would also advise SDs to try to understand that they have to be attractive in some way in the mind of their SB\n\nTo me - this is half of what separates sugaring from escorting.",
            "author": "SDstartingOut",
            "id": "ixh876h",
            "parent_id": "t1_ixh73zg",
            "score": 51,
            "created_utc": 1669207727.0,
            "replies": []
        },
        {
            "body": "100%\n\nmoney to lay back and think of england is not sugar",
            "author": null,
            "id": "ixhhwgi",
            "parent_id": "t1_ixh73zg",
            "score": 38,
            "created_utc": 1669212803.0,
            "replies": [
                {
                    "body": "> money to lay back and think of england is not sugar\n\nIndeed, thinking of Charles III. doesn't help.",
                    "author": "Inner_Examination_38",
                    "id": "ixhsob8",
                    "parent_id": "t1_ixhhwgi",
                    "score": 20,
                    "created_utc": 1669217382.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣",
                            "author": "FLRAdvocate",
                            "id": "ixjolwy",
                            "parent_id": "t1_ixhsob8",
                            "score": 3,
                            "created_utc": 1669244770.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah if you’re extremely ugly or obese I don’t care how deep your wallets are. You can definitely find women who can act but I’m not a good actress.",
            "author": "salkaurs",
            "id": "ixhh48j",
            "parent_id": "t1_ixh73zg",
            "score": 24,
            "created_utc": 1669212439.0,
            "replies": [
                {
                    "body": "> You can definitely find women who can act\n\nI have to say, this is one double standard I've never understood.\n\nWhy is it possible that some SDs not only like, but prefer larger women, but there aren't some women that are attracted to larger guys?  \n\nBy all means - I'm *not* suggesting you should be.  But it's rather impolite to assume that no women will find a larger guy attractive, even if it wouldn't be their first choice to vanilla date.",
                    "author": "SDstartingOut",
                    "id": "ixi5o4t",
                    "parent_id": "t1_ixhh48j",
                    "score": 6,
                    "created_utc": 1669222545.0,
                    "replies": [
                        {
                            "body": "There are PLENTY of women who don't mind someone soft to cuddle with.",
                            "author": "SilkySweet2022",
                            "id": "ixihoqr",
                            "parent_id": "t1_ixi5o4t",
                            "score": 17,
                            "created_utc": 1669227229.0,
                            "replies": []
                        },
                        {
                            "body": "But there are women who like overweight men. I like overweight men. Would I date someone who was in the obese category? No. Unless he was very tall and carried it well and had a great personality. I hate men with six packs too and would never talk to one either.",
                            "author": "salkaurs",
                            "id": "ixice9r",
                            "parent_id": "t1_ixi5o4t",
                            "score": 14,
                            "created_utc": 1669225179.0,
                            "replies": [
                                {
                                    "body": "I think my point went over your head though.\n\nI'm not suggesting YOU should date someone you aren't attracted to;  nor should you be attracted to obese men.  \n\nI'm merely stating that - just because you are not attracted to them, does not mean other women would have to fake/act it.  Which is what your post seemed to imply.\n\n> Unless he was very tall \n\nFWIW for me personally, I do feel this is a lot of why I've been able to find women who were (at least to some degree) physically attracted to me.",
                                    "author": "SDstartingOut",
                                    "id": "ixiid84",
                                    "parent_id": "t1_ixice9r",
                                    "score": 3,
                                    "created_utc": 1669227492.0,
                                    "replies": [
                                        {
                                            "body": "A beautiful younger woman being genuinely sexually attracted to an obese older man is rare. Not sure what to tell you other than that I agree that they do exist but are rare",
                                            "author": "salkaurs",
                                            "id": "ixij7we",
                                            "parent_id": "t1_ixiid84",
                                            "score": 7,
                                            "created_utc": 1669227820.0,
                                            "replies": [
                                                {
                                                    "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
                                                    "author": "Ripeness2282",
                                                    "id": "ixj5uxk",
                                                    "parent_id": "t1_ixij7we",
                                                    "score": 3,
                                                    "created_utc": 1669236790.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
                                                    "author": "Soph4art",
                                                    "id": "ixiqdwg",
                                                    "parent_id": "t1_ixij7we",
                                                    "score": 1,
                                                    "created_utc": 1669230649.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I've lived most of my life in rural areas, husky men are the delicacy here. Haha. I personally am attracted to lean muscles and even a bit of pudge. I also have a friend who is genuinely attracted to moobs. Everybody's got a preference. I think weight itself doesn't matter, it's the way you carry yourself.",
                            "author": "MissRoyalBrush",
                            "id": "ixipg42",
                            "parent_id": "t1_ixi5o4t",
                            "score": 6,
                            "created_utc": 1669230275.0,
                            "replies": []
                        },
                        {
                            "body": "I mean there’s literally a trend on tik tok about women who prefer larger men. It’s certainly not uncommon and not looked down upon as much in society when you look at the likes of Rick Ross, dj khaled etc who many don’t question when they are with thin women but pierce brosnan gets a lot of flack for staying with his gorgeous wife because she’s gained weight.\n\nI know this is an extremely late comment lol but yeah",
                            "author": "Sugarintheorange",
                            "id": "j1pibdj",
                            "parent_id": "t1_ixi5o4t",
                            "score": 1,
                            "created_utc": 1672048672.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It feels bad even with wealth you can’t buy love.",
                    "author": "silverbullet20",
                    "id": "ixhokp2",
                    "parent_id": "t1_ixhh48j",
                    "score": 0,
                    "created_utc": 1669215711.0,
                    "replies": []
                },
                {
                    "body": "LOL",
                    "author": "MystressJessy",
                    "id": "ixj8b3h",
                    "parent_id": "t1_ixhh48j",
                    "score": 0,
                    "created_utc": 1669237783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Amazing response.",
            "author": "Cdnsugarr",
            "id": "ixiz5fo",
            "parent_id": "t1_ixh73zg",
            "score": 3,
            "created_utc": 1669234119.0,
            "replies": []
        },
        {
            "body": "Married guy? How is that morally ok?  Why not divorce",
            "author": "silverbullet20",
            "id": "ixhoab7",
            "parent_id": "t1_ixh73zg",
            "score": -5,
            "created_utc": 1669215596.0,
            "replies": [
                {
                    "body": "To be clear, my (sugar) boyfriend is not married, but suggest refraining from making moral judgments about other people's relationship choices.",
                    "author": "Inner_Examination_38",
                    "id": "ixhqkt0",
                    "parent_id": "t1_ixhoab7",
                    "score": 8,
                    "created_utc": 1669216535.0,
                    "replies": []
                },
                {
                    "body": "Divorce gets thrown around like it's an easy thing to do.\n\nIt isn't.\n\nThere are many, many reasons men will avoid it if possible: financial, personal, children, wife's mental/physical state, friendship, love, etc.",
                    "author": "SilkySweet2022",
                    "id": "ixhz7ie",
                    "parent_id": "t1_ixhoab7",
                    "score": 7,
                    "created_utc": 1669219990.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Super true thing about me: I love that when I meet a potential SB, she can *reject me*. If she chooses not to -- and isn't desperate for money -- I know she's making a choice to be with me. \n\nSometimes it becomes clear that she isn't really making that choice on a ongoing basis. At that point, it's time to end the arrangement. I really don't want to be in the company of a woman whose sole reason for remaining in the relationship is the financial part. \n\nCurrent SB has a real car, low expenses, plenty of cash in bank. I'm quite sure she appreciates the money. And also that she can live without it",
            "author": "marker3000",
            "id": "ixim3lh",
            "parent_id": "t1_ixh4g5e",
            "score": 6,
            "created_utc": 1669228954.0,
            "replies": [
                {
                    "body": "“A real car” that gave me a chuckle.",
                    "author": "PoosanItRhymesWSusan",
                    "id": "ixj2rxr",
                    "parent_id": "t1_ixim3lh",
                    "score": 3,
                    "created_utc": 1669235559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "By definition of being in the bowl her standards have dropped. Otherwise she would be dating you in vanilla. But she's not, she's requiring you to pay. Because she wouldn't date you otherwise.",
            "author": "malcolm_reyn0lds",
            "id": "ixi7zre",
            "parent_id": "t1_ixh4g5e",
            "score": 6,
            "created_utc": 1669223458.0,
            "replies": [
                {
                    "body": ">Reply\n\nJust remember...\"The most expensive sex is free sex\"...Woody Allen",
                    "author": "surfrat54",
                    "id": "ixj5bv2",
                    "parent_id": "t1_ixi7zre",
                    "score": 3,
                    "created_utc": 1669236583.0,
                    "replies": [
                        {
                            "body": "Correction. The most expensive sex is married sex. The cheapest sex is the one with minimal time invested and minimal govt and lawyers involved.",
                            "author": "malcolm_reyn0lds",
                            "id": "ixjyyq1",
                            "parent_id": "t1_ixj5bv2",
                            "score": 1,
                            "created_utc": 1669249560.0,
                            "replies": [
                                {
                                    "body": "That's the point of the joke...meaning married men are constantly in positions where they have to satisfy their wives or girlfriends with gifts, etc..in order to get sex.There was an old joke years back that a guy wouldn't get a blow job on Valentine's Day unless he bought his wife or GF expensive Valentine's Day gift....Thus the sex appears \"free\" but couples bargain in subtle ways all the time to get their needs met...the 2nd part of the point is it would cheaper for a guy to just go out and pay an escort for the bj...rather than buying his wife expensive jewelry or whatever to get sex...",
                                    "author": "surfrat54",
                                    "id": "ixk3q0q",
                                    "parent_id": "t1_ixjyyq1",
                                    "score": 2,
                                    "created_utc": 1669251848.0,
                                    "replies": [
                                        {
                                            "body": "I have to correct myself. Married sex is the most expensive once the divorce comes. It isn't always expensive until you loose your house and retirement.",
                                            "author": "malcolm_reyn0lds",
                                            "id": "ixmhjmh",
                                            "parent_id": "t1_ixk3q0q",
                                            "score": 1,
                                            "created_utc": 1669305307.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Just because her standard drops doesn’t mean there is no attraction it’s just that he is not as attracted as other options. Girls drop standards in vanilla, maybe because the super hot guys are not emotional available or don’t want a long term relationships, so they settle for a less hott guy and date them in vanilla.",
                    "author": "Secret_Diet7053",
                    "id": "ixixosg",
                    "parent_id": "t1_ixi7zre",
                    "score": 2,
                    "created_utc": 1669233535.0,
                    "replies": [
                        {
                            "body": "I never said she wasn't attracted to him, or that there wasn't chemistry or they don't get along. Most sbs get along with their sds to some extent and have some attraction. ( I'd hope) . But let's not get ahead of ourselves here, most sbs wouldt see their sds without being paid. They would leave. Which by definition is a lowering of standards.",
                            "author": "malcolm_reyn0lds",
                            "id": "ixjzn6q",
                            "parent_id": "t1_ixixosg",
                            "score": 3,
                            "created_utc": 1669249885.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Not necessarily…there are plenty of SDs who want or need, for whatever reason, to keep the framework of sugaring in place over dating that same woman vanilla.\n\nCould be that they’re already married and want to have a long term thing without any escalation.  They could be emotionally scarred by an awful childhood.  Whatever.\n\nSo a SR is the only way they’re available.\n\nAnd the same goes for some SBs.  They don’t want/can’t handle the aspects of a vanilla relationship that sugaring eliminates, so they keep it to sugar.",
                    "author": "Akavinceblack",
                    "id": "ixiqgnd",
                    "parent_id": "t1_ixi7zre",
                    "score": 2,
                    "created_utc": 1669230679.0,
                    "replies": [
                        {
                            "body": "The SD part of your response has no relevance to my statement. Yes all that could be true but she's still requiring payment for whatever reason on her end. 99.9% of affairs are done by adults that aren't in sugar relationships so that's really a non relevant point.\n\nWhatever her reasons for wanting an SR, the reality is that if the money stops, she's out. So whatever bonus reasons she has doesn't matter in the end because the payment is the only reason she's staying. The truth sucks.",
                            "author": "malcolm_reyn0lds",
                            "id": "ixjzeh4",
                            "parent_id": "t1_ixiqgnd",
                            "score": 2,
                            "created_utc": 1669249771.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you are going through the gamut, why not bars? That why may you eliminate any possibility a woman wants your money",
            "author": "silverbullet20",
            "id": "ixhp090",
            "parent_id": "t1_ixh4g5e",
            "score": 2,
            "created_utc": 1669215889.0,
            "replies": []
        },
        {
            "body": "👏👏👏👏👏",
            "author": "Big_Contribution_460",
            "id": "ixhh71k",
            "parent_id": "t1_ixh4g5e",
            "score": 1,
            "created_utc": 1669212474.0,
            "replies": []
        },
        {
            "body": "Well said.",
            "author": null,
            "id": "ixhpjn4",
            "parent_id": "t1_ixh4g5e",
            "score": 1,
            "created_utc": 1669216110.0,
            "replies": []
        },
        {
            "body": "Well said",
            "author": "HoneyHorchata",
            "id": "ixhy6v4",
            "parent_id": "t1_ixh4g5e",
            "score": 1,
            "created_utc": 1669219588.0,
            "replies": []
        },
        {
            "body": "Always love when the women posing as SDs make posts like these",
            "author": "throwawayrtyggv",
            "id": "ixh4xdp",
            "parent_id": "t1_ixh4g5e",
            "score": -42,
            "created_utc": 1669205670.0,
            "replies": [
                {
                    "body": "A mere guess, but maybe comments like this are more along the lines of why you might not be getting matches.\n\nPhysical appearance isn't the only thing women consider under the 'attraction' umbrella.",
                    "author": "SilkySweet2022",
                    "id": "ixhhe4h",
                    "parent_id": "t1_ixh4xdp",
                    "score": 43,
                    "created_utc": 1669212565.0,
                    "replies": [
                        {
                            "body": "💯",
                            "author": "myusername_77",
                            "id": "ixhx8pu",
                            "parent_id": "t1_ixhhe4h",
                            "score": 2,
                            "created_utc": 1669219211.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lol.  I've been active on this sub for 6 years.  I think that's the first time I've ever been called a women.\n\nFirst for everything.",
                    "author": "SDstartingOut",
                    "id": "ixh54cx",
                    "parent_id": "t1_ixh4xdp",
                    "score": 40,
                    "created_utc": 1669205797.0,
                    "replies": [
                        {
                            "body": "Better update the flair to Spoiling Girlfriend",
                            "author": "toesockbandit",
                            "id": "ixhtn5g",
                            "parent_id": "t1_ixh54cx",
                            "score": 11,
                            "created_utc": 1669217773.0,
                            "replies": []
                        },
                        {
                            "body": "Hey, since we are in the age of gender confusion, how does it feel being a woman? ;)",
                            "author": "A-touchofreality",
                            "id": "ixhbito",
                            "parent_id": "t1_ixh54cx",
                            "score": 8,
                            "created_utc": 1669209619.0,
                            "replies": [
                                {
                                    "body": "The elusive Sugar Mama",
                                    "author": "chemistryromance",
                                    "id": "ixi3rlg",
                                    "parent_id": "t1_ixhbito",
                                    "score": 10,
                                    "created_utc": 1669221802.0,
                                    "replies": [
                                        {
                                            "body": "🤣🤣🤣",
                                            "author": "SilkySweet2022",
                                            "id": "ixihsor",
                                            "parent_id": "t1_ixi3rlg",
                                            "score": 3,
                                            "created_utc": 1669227270.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Wahaha, you must be brand new here or you are still sleepy because it is early at your part of the world!\n\n/u/SDstartingOut is a respected member of this community since YEARS already!\n\nYou *DO* realize how this silly comment makes you look, do you? LOL·",
                    "author": "A-touchofreality",
                    "id": "ixhb7p9",
                    "parent_id": "t1_ixh4xdp",
                    "score": 21,
                    "created_utc": 1669209450.0,
                    "replies": []
                },
                {
                    "body": "I'm a man and I think your attitude is pretty entitled and cringe. Put some effort into yourself instead of thinking that you pay your way into getting women's attraction and respect. Sugaring should be about facilitating relationships not buying them.",
                    "author": "Pastakingfifth",
                    "id": "ixhwsyl",
                    "parent_id": "t1_ixh4xdp",
                    "score": 14,
                    "created_utc": 1669219042.0,
                    "replies": []
                },
                {
                    "body": "That is a really weird post to make when the guy wasn't even disagreeing with you.",
                    "author": "sdbythebeach",
                    "id": "ixh8wuo",
                    "parent_id": "t1_ixh4xdp",
                    "score": 16,
                    "created_utc": 1669208143.0,
                    "replies": []
                },
                {
                    "body": "Red pill 💊",
                    "author": "daddoms",
                    "id": "ixh7xor",
                    "parent_id": "t1_ixh4xdp",
                    "score": 6,
                    "created_utc": 1669207569.0,
                    "replies": [
                        {
                            "body": "Hm... I'd say it's the opposite of red pill lol. OP is saying that his money compensates for his lack of attractiveness.",
                            "author": "SDinAsia",
                            "id": "ixhae9o",
                            "parent_id": "t1_ixh7xor",
                            "score": 2,
                            "created_utc": 1669208993.0,
                            "replies": [
                                {
                                    "body": "OP called the responder a “woman” which is childish misogyny",
                                    "author": "daddoms",
                                    "id": "ixhctyv",
                                    "parent_id": "t1_ixhae9o",
                                    "score": 13,
                                    "created_utc": 1669210320.0,
                                    "replies": [
                                        {
                                            "body": "👏👏👏",
                                            "author": "Big_Contribution_460",
                                            "id": "ixhhcbr",
                                            "parent_id": "t1_ixhctyv",
                                            "score": 4,
                                            "created_utc": 1669212542.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You sound incredibly level-headed and respectful of both yourself and of women. Thank you voicing your thoughts.",
            "author": "KetoSeaweed",
            "id": "j7ktn92",
            "parent_id": "t1_ixh4g5e",
            "score": 1,
            "created_utc": 1675782278.0,
            "replies": []
        },
        {
            "body": "This is totally true. I was chatting with an out of State SD who was coming to my area for work in a couple weeks when I first started. I explained that I was looking for someone long term that I could build a relationship with. But he was welcome to continue chatting with and updating me on his success at finding a SB willing to meet with him. We ended up talking every day text and vid calls. He definitely had gained a belly since his profile pics and was not my “type” but his big beautiful heart ❤️ shined and when he talked about his kids and going above and beyond because their mom had abandoned them… it made my panties spontaneously combust. And I made a point to have two uncompensated dates with him for the week he was here. A M&G and a hook up. He tried to pay me and I refused it. I did let him pay for my outrageously overpriced valet parking ☺️ We both agreed if we lived closer we were a match. Not every woman is sexually attracted to substance and intelligence but some are.",
            "author": "P0sitiveViibes777",
            "id": "ixifzev",
            "parent_id": "t1_ixhkfvi",
            "score": 8,
            "created_utc": 1669226561.0,
            "replies": [
                {
                    "body": "how often did you guys talk before you met?",
                    "author": "barry1988",
                    "id": "ixioafn",
                    "parent_id": "t1_ixifzev",
                    "score": 1,
                    "created_utc": 1669229812.0,
                    "replies": [
                        {
                            "body": "Every day of just over two weeks, that’s not usual but we were fast tracking the “getting to know you” it was a gamble for him because I made no promises of intimacy, but it paid off in his favor. I rocked his world, how I know this…. He has since been trying to get me to come to his state. All expense paid and allowance. He has been a sugar daddy for years, to young women, but he says it’s been a long time since he felt wanted for more than his wallet. I am extremely affectionate and joyful.",
                            "author": "P0sitiveViibes777",
                            "id": "ixiud94",
                            "parent_id": "t1_ixioafn",
                            "score": 2,
                            "created_utc": 1669232237.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very well said",
            "author": "HoneyHorchata",
            "id": "ixhy1rq",
            "parent_id": "t1_ixhkfvi",
            "score": 4,
            "created_utc": 1669219530.0,
            "replies": []
        },
        {
            "body": "the vast majority within which demographic though?",
            "author": "night-gloss",
            "id": "ixiztkd",
            "parent_id": "t1_ixi971m",
            "score": 2,
            "created_utc": 1669234381.0,
            "replies": [
                {
                    "body": "I’m just saying as a generalization. 20’s don’t match with 40+ often on dating apps, regardless of how good looking you are. It happens, just not the majority of the time. I’m referring to the USA by the way… may be different in other countries/cultures.",
                    "author": null,
                    "id": "ixj124l",
                    "parent_id": "t1_ixiztkd",
                    "score": 1,
                    "created_utc": 1669234875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know a guy early 40s who pull girls in their 20s on a weekly basis. Most 35+ men dont pull young girls because they dont know how. To be fair, most guys on seeking dont know how to meet and attract women, hence why they on seeking.",
            "author": "AspiringFIRE1993",
            "id": "ixj15tn",
            "parent_id": "t1_ixi971m",
            "score": 0,
            "created_utc": 1669234915.0,
            "replies": [
                {
                    "body": "One a week is still not the majority of women. If he was 29 he’d probably have 100’s of matches per week of girls in their 20’s. I’d say your friend is probably the best case scenario. Especially if the women he sees are super attractive. \n\nThat’s kinda my point. You have to be exceptional… It’s not the general rule.",
                    "author": null,
                    "id": "ixj1qx1",
                    "parent_id": "t1_ixj15tn",
                    "score": 1,
                    "created_utc": 1669235151.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This couldn't be further from the truth. Women prefer older men. Get real.",
            "author": "Most-Poetry-3540",
            "id": "iximnly",
            "parent_id": "t1_ixi971m",
            "score": -5,
            "created_utc": 1669229174.0,
            "replies": []
        },
        {
            "body": "THE VAST MAJORITY OF 20-something’s would never vanilla date me when I was in my 20s.\n\nSo nothing changed.",
            "author": "PotGoblin",
            "id": "j0g4cuh",
            "parent_id": "t1_ixi971m",
            "score": 1,
            "created_utc": 1671191272.0,
            "replies": []
        },
        {
            "body": "Speak for yourself. I’m **always** looking for Brad Pitt.",
            "author": "curly_spice",
            "id": "ixh99bn",
            "parent_id": "t1_ixh8q5i",
            "score": 13,
            "created_utc": 1669208345.0,
            "replies": [
                {
                    "body": "I'm more of a George Clooney girl 😉",
                    "author": "Matcha_Alpaca",
                    "id": "ixh9f1v",
                    "parent_id": "t1_ixh99bn",
                    "score": 8,
                    "created_utc": 1669208436.0,
                    "replies": [
                        {
                            "body": "Jeff Goldblum all the way !",
                            "author": "princessnellybelle",
                            "id": "ixhgm1d",
                            "parent_id": "t1_ixh9f1v",
                            "score": 7,
                            "created_utc": 1669212201.0,
                            "replies": [
                                {
                                    "body": "Heh.  I actually get told I look like him sometimes!  How u doin?",
                                    "author": "unique_leek_critique",
                                    "id": "ixi9j09",
                                    "parent_id": "t1_ixhgm1d",
                                    "score": 2,
                                    "created_utc": 1669224065.0,
                                    "replies": [
                                        {
                                            "body": "Jeff Goldblum looks and Joey pick up lines . I love it !",
                                            "author": "princessnellybelle",
                                            "id": "ixi9wf2",
                                            "parent_id": "t1_ixi9j09",
                                            "score": 3,
                                            "created_utc": 1669224209.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Why not both? Watching Ocean’s Eleven (for the first time Saturday, i know) doubled down on my eternal desire for both. 🤤",
                            "author": "curly_spice",
                            "id": "ixhbnhz",
                            "parent_id": "t1_ixh9f1v",
                            "score": 5,
                            "created_utc": 1669209688.0,
                            "replies": [
                                {
                                    "body": "Matt Damon definitely is in that crowd for me...:D",
                                    "author": "SilkySweet2022",
                                    "id": "ixhzio6",
                                    "parent_id": "t1_ixhbnhz",
                                    "score": 3,
                                    "created_utc": 1669220113.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don't worry, you're far from alone in this.",
            "author": "JustAsk4Alice",
            "id": "ixjd3ro",
            "parent_id": "t1_ixhxswr",
            "score": 1,
            "created_utc": 1669239746.0,
            "replies": []
        },
        {
            "body": "Amen...😬",
            "author": "SilkySweet2022",
            "id": "ixii0dc",
            "parent_id": "t1_ixhaufs",
            "score": 2,
            "created_utc": 1669227353.0,
            "replies": []
        },
        {
            "body": "OP's post history paints a pretty clear picture of how entitled he is.",
            "author": "Matcha_Alpaca",
            "id": "ixhc1ah",
            "parent_id": "t1_ixhbem2",
            "score": 9,
            "created_utc": 1669209893.0,
            "replies": [
                {
                    "body": "Also how much of a victim complex he has.  Reminds me of a certain politician.\n\nActually, seems like OP views women in a similar light as that politician also.",
                    "author": "SDstartingOut",
                    "id": "ixi7jgo",
                    "parent_id": "t1_ixhc1ah",
                    "score": 6,
                    "created_utc": 1669223281.0,
                    "replies": [
                        {
                            "body": "Bingo!",
                            "author": "Matcha_Alpaca",
                            "id": "ixi9fo6",
                            "parent_id": "t1_ixi7jgo",
                            "score": 1,
                            "created_utc": 1669224029.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The only entitled people on here who are all the sbs who think they deserve money simply for existing",
                    "author": "throwawayrtyggv",
                    "id": "ixhe1gb",
                    "parent_id": "t1_ixhc1ah",
                    "score": -16,
                    "created_utc": 1669210941.0,
                    "replies": [
                        {
                            "body": "And yet here you are commenting on your own post about SB's not accepting your money. Your post and comment history suggests you're not having a great time in the bowl. Maybe you need to change your approach.",
                            "author": "Matcha_Alpaca",
                            "id": "ixhewnp",
                            "parent_id": "t1_ixhe1gb",
                            "score": 16,
                            "created_utc": 1669211379.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Jason Statham you mean? If yes then I would consider you attractive. I mean Jason himself landed Rosie.",
            "author": "paypahcut",
            "id": "ixhawsy",
            "parent_id": "t1_ixh62jg",
            "score": 3,
            "created_utc": 1669209283.0,
            "replies": [
                {
                    "body": ">Jason Statham you mean?\n\nYes, I corrected the spelling. ( I just use metal clippers. I do not use a razor) Not clean shaven bald. I have also been told I look like 'Steve Austin' the former Wrestler.\n\nI am very fit and lean.",
                    "author": "CenTexFunGuy",
                    "id": "ixhcsej",
                    "parent_id": "t1_ixhawsy",
                    "score": 2,
                    "created_utc": 1669210298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like for real, the lassies are sooooo out of their depth going into the bowl. I would only get in touch with 1 out of the 20 profile reviews. It is no surprise they aren't getting any SD hits and only scammers",
            "author": "buddyboard",
            "id": "ixif1zk",
            "parent_id": "t1_ixhjmw5",
            "score": 1,
            "created_utc": 1669226204.0,
            "replies": []
        },
        {
            "body": "I second this, when a man treats me right and makes me feel beautiful (and can make me laugh) they definitely become more attractive",
            "author": "PoosanItRhymesWSusan",
            "id": "ixj6uyj",
            "parent_id": "t1_ixhphp0",
            "score": 3,
            "created_utc": 1669237194.0,
            "replies": []
        },
        {
            "body": ">SD here & With utmost respect, not all guys are here paying. “F&F” tax.\n\nExactly this..! Some of us are here because ultimately we want a carefree relationship with someone young, beautiful and fun loving, without having to worry about where this relationship is going, and settling down, having kids or starting family. Personally most of the SB ive dated, are just as attractive or better, then many that I dated in my 20's and 30's, only difference is that it took more work to get them back then, and now its a bit easier, because money opens the doors to meeting them, but maturity, good manners, confidence and success help close the deal, as well as still taking care of yourself and looking good for your age.",
            "author": "NickPfromYuma",
            "id": "ixhqmho",
            "parent_id": "t1_ixhg4xb",
            "score": 2,
            "created_utc": 1669216554.0,
            "replies": []
        },
        {
            "body": "LMAO 🤣🤣🤣",
            "author": "TroubleAdorable9226",
            "id": "ixkfwwu",
            "parent_id": "t1_ixib6hg",
            "score": 1,
            "created_utc": 1669257775.0,
            "replies": []
        },
        {
            "body": "Heh. Why is that?",
            "author": null,
            "id": "ixhfxt3",
            "parent_id": "t1_ixhdt13",
            "score": 3,
            "created_utc": 1669211878.0,
            "replies": [
                {
                    "body": "Round = soft\n\nGood for hugging",
                    "author": "peregrine_nation",
                    "id": "ixhk8k4",
                    "parent_id": "t1_ixhfxt3",
                    "score": 7,
                    "created_utc": 1669213865.0,
                    "replies": [
                        {
                            "body": "Thank you! \n\nIn my younger days (20s) some women would note that my being so thin would sometimes cause some pain during a particularly active sex session. (Boney hips)\n\nThat has not been a concern lately. 😂",
                            "author": "Chill_SD1974",
                            "id": "ixhttbk",
                            "parent_id": "t1_ixhk8k4",
                            "score": 2,
                            "created_utc": 1669217841.0,
                            "replies": []
                        },
                        {
                            "body": "The cuddlier they are the better.",
                            "author": "Acucar_amorpho",
                            "id": "ixho6cj",
                            "parent_id": "t1_ixhk8k4",
                            "score": 1,
                            "created_utc": 1669215547.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What are you going for? I can easily get the amount of a normal PPM to pose in lingerie or do Domme things that don’t involve sex or oral on men. I’m not the prettiest girl in the world in my opinion, but apparently I look like a supermodel, and men are willing to pay gorgeous women more for far less work, commitment, acting, etc, than what you’re asking for as a SD.",
            "author": "Juicy_Peach420",
            "id": "ixjs6xf",
            "parent_id": "t1_ixj4xph",
            "score": 1,
            "created_utc": 1669246408.0,
            "replies": []
        },
        {
            "body": "I have. Didn’t know he was obese from his account (used old pics). I don’t judge based on that and it’s not a preference issue so I went on with the date. When it was time to give me an allowance he gave himself a little discount and short me a hundred bucks lol what an asshole. Blocked him after that",
            "author": null,
            "id": "ixh8me0",
            "parent_id": "t1_ixh2rni",
            "score": 2,
            "created_utc": 1669207974.0,
            "replies": [
                {
                    "body": "I'm missing something. You went on a date and he gave you less than what you both agreed upon  before the date? \nIf so, why didn't you confront him right there and then?\n\n Come to think about it, what are possible defenses/countermeasures?",
                    "author": "dallas-explorer",
                    "id": "ixpb4bd",
                    "parent_id": "t1_ixh8me0",
                    "score": 1,
                    "created_utc": 1669355800.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can't tell from your post history if you are a man or a woman, but if you've never been in a Sugar Relationship with someone that you are attracted to and is attracted to you, then you haven't been in a Sugar Relationship in my mind.  There are a lot of women that are attracted to more than just youthful looks and there a lot of men who want more than just sex with an attractive woman.  I don't understand why that seems to offend people. \n\nI'm comfortable with my life choices, so I'm not bothered by other people's opinions about my life choices.  It's called maturity.",
            "author": "MaxFromVenice",
            "id": "ixm3439",
            "parent_id": "t1_ixm1ge0",
            "score": 3,
            "created_utc": 1669298461.0,
            "replies": [
                {
                    "body": "Great if you found that :) normally that is not the case there is a bit of acting involved in most SRs especially from the SB side.",
                    "author": "bookworm010101",
                    "id": "ixm3joo",
                    "parent_id": "t1_ixm3439",
                    "score": 3,
                    "created_utc": 1669298696.0,
                    "replies": [
                        {
                            "body": "I think the issue is when people expect to find romantic love within a Sugar Relationship, but I do look to build a strong friendship. I've remained friends with several SBs long after our arrangements ended.  It's possible to become good friends without expecting romantic love leading to marriage and/or children.",
                            "author": "MaxFromVenice",
                            "id": "ixm49oh",
                            "parent_id": "t1_ixm3joo",
                            "score": 2,
                            "created_utc": 1669299076.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "izvzvvu",
                                    "parent_id": "t1_ixm49oh",
                                    "score": 1,
                                    "created_utc": 1670826926.0,
                                    "replies": [
                                        {
                                            "body": "Lol",
                                            "author": "MaxFromVenice",
                                            "id": "izw9u7a",
                                            "parent_id": "t1_izvzvvu",
                                            "score": 1,
                                            "created_utc": 1670834747.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "j05f460",
                                                    "parent_id": "t1_izw9u7a",
                                                    "score": 1,
                                                    "created_utc": 1670993381.0,
                                                    "replies": [
                                                        {
                                                            "body": "What if I'm not married? lol",
                                                            "author": "MaxFromVenice",
                                                            "id": "j05w0l7",
                                                            "parent_id": "t1_j05f460",
                                                            "score": 1,
                                                            "created_utc": 1671004658.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "j07xah1",
                                                                    "parent_id": "t1_j05w0l7",
                                                                    "score": 1,
                                                                    "created_utc": 1671043362.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                                                            "author": "MaxFromVenice",
                                                                            "id": "j07ysca",
                                                                            "parent_id": "t1_j07xah1",
                                                                            "score": 1,
                                                                            "created_utc": 1671043929.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "j07z4w3",
                                                                                    "parent_id": "t1_j07ysca",
                                                                                    "score": 1,
                                                                                    "created_utc": 1671044060.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For the women I date, financial support is one aspect of what I offer. If I was significantly older, overweight, rude, etc, I'm sure that would impact who I was able to date as well. I understand my charm, looks, success, confidence, financial support, etc are all important aspects of my appeal.",
            "author": "MaxFromVenice",
            "id": "ixlkmk9",
            "parent_id": "t1_ixljgz3",
            "score": 5,
            "created_utc": 1669285392.0,
            "replies": []
        },
        {
            "body": "> money to lay back and think of england is not sugar\n\nIndeed, thinking of Charles III. doesn't help.",
            "author": "Inner_Examination_38",
            "id": "ixhsob8",
            "parent_id": "t1_ixhhwgi",
            "score": 20,
            "created_utc": 1669217382.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "FLRAdvocate",
                    "id": "ixjolwy",
                    "parent_id": "t1_ixhsob8",
                    "score": 3,
                    "created_utc": 1669244770.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> You can definitely find women who can act\n\nI have to say, this is one double standard I've never understood.\n\nWhy is it possible that some SDs not only like, but prefer larger women, but there aren't some women that are attracted to larger guys?  \n\nBy all means - I'm *not* suggesting you should be.  But it's rather impolite to assume that no women will find a larger guy attractive, even if it wouldn't be their first choice to vanilla date.",
            "author": "SDstartingOut",
            "id": "ixi5o4t",
            "parent_id": "t1_ixhh48j",
            "score": 6,
            "created_utc": 1669222545.0,
            "replies": [
                {
                    "body": "There are PLENTY of women who don't mind someone soft to cuddle with.",
                    "author": "SilkySweet2022",
                    "id": "ixihoqr",
                    "parent_id": "t1_ixi5o4t",
                    "score": 17,
                    "created_utc": 1669227229.0,
                    "replies": []
                },
                {
                    "body": "But there are women who like overweight men. I like overweight men. Would I date someone who was in the obese category? No. Unless he was very tall and carried it well and had a great personality. I hate men with six packs too and would never talk to one either.",
                    "author": "salkaurs",
                    "id": "ixice9r",
                    "parent_id": "t1_ixi5o4t",
                    "score": 14,
                    "created_utc": 1669225179.0,
                    "replies": [
                        {
                            "body": "I think my point went over your head though.\n\nI'm not suggesting YOU should date someone you aren't attracted to;  nor should you be attracted to obese men.  \n\nI'm merely stating that - just because you are not attracted to them, does not mean other women would have to fake/act it.  Which is what your post seemed to imply.\n\n> Unless he was very tall \n\nFWIW for me personally, I do feel this is a lot of why I've been able to find women who were (at least to some degree) physically attracted to me.",
                            "author": "SDstartingOut",
                            "id": "ixiid84",
                            "parent_id": "t1_ixice9r",
                            "score": 3,
                            "created_utc": 1669227492.0,
                            "replies": [
                                {
                                    "body": "A beautiful younger woman being genuinely sexually attracted to an obese older man is rare. Not sure what to tell you other than that I agree that they do exist but are rare",
                                    "author": "salkaurs",
                                    "id": "ixij7we",
                                    "parent_id": "t1_ixiid84",
                                    "score": 7,
                                    "created_utc": 1669227820.0,
                                    "replies": [
                                        {
                                            "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
                                            "author": "Ripeness2282",
                                            "id": "ixj5uxk",
                                            "parent_id": "t1_ixij7we",
                                            "score": 3,
                                            "created_utc": 1669236790.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
                                            "author": "Soph4art",
                                            "id": "ixiqdwg",
                                            "parent_id": "t1_ixij7we",
                                            "score": 1,
                                            "created_utc": 1669230649.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've lived most of my life in rural areas, husky men are the delicacy here. Haha. I personally am attracted to lean muscles and even a bit of pudge. I also have a friend who is genuinely attracted to moobs. Everybody's got a preference. I think weight itself doesn't matter, it's the way you carry yourself.",
                    "author": "MissRoyalBrush",
                    "id": "ixipg42",
                    "parent_id": "t1_ixi5o4t",
                    "score": 6,
                    "created_utc": 1669230275.0,
                    "replies": []
                },
                {
                    "body": "I mean there’s literally a trend on tik tok about women who prefer larger men. It’s certainly not uncommon and not looked down upon as much in society when you look at the likes of Rick Ross, dj khaled etc who many don’t question when they are with thin women but pierce brosnan gets a lot of flack for staying with his gorgeous wife because she’s gained weight.\n\nI know this is an extremely late comment lol but yeah",
                    "author": "Sugarintheorange",
                    "id": "j1pibdj",
                    "parent_id": "t1_ixi5o4t",
                    "score": 1,
                    "created_utc": 1672048672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It feels bad even with wealth you can’t buy love.",
            "author": "silverbullet20",
            "id": "ixhokp2",
            "parent_id": "t1_ixhh48j",
            "score": 0,
            "created_utc": 1669215711.0,
            "replies": []
        },
        {
            "body": "LOL",
            "author": "MystressJessy",
            "id": "ixj8b3h",
            "parent_id": "t1_ixhh48j",
            "score": 0,
            "created_utc": 1669237783.0,
            "replies": []
        },
        {
            "body": "To be clear, my (sugar) boyfriend is not married, but suggest refraining from making moral judgments about other people's relationship choices.",
            "author": "Inner_Examination_38",
            "id": "ixhqkt0",
            "parent_id": "t1_ixhoab7",
            "score": 8,
            "created_utc": 1669216535.0,
            "replies": []
        },
        {
            "body": "Divorce gets thrown around like it's an easy thing to do.\n\nIt isn't.\n\nThere are many, many reasons men will avoid it if possible: financial, personal, children, wife's mental/physical state, friendship, love, etc.",
            "author": "SilkySweet2022",
            "id": "ixhz7ie",
            "parent_id": "t1_ixhoab7",
            "score": 7,
            "created_utc": 1669219990.0,
            "replies": []
        },
        {
            "body": "“A real car” that gave me a chuckle.",
            "author": "PoosanItRhymesWSusan",
            "id": "ixj2rxr",
            "parent_id": "t1_ixim3lh",
            "score": 3,
            "created_utc": 1669235559.0,
            "replies": []
        },
        {
            "body": ">Reply\n\nJust remember...\"The most expensive sex is free sex\"...Woody Allen",
            "author": "surfrat54",
            "id": "ixj5bv2",
            "parent_id": "t1_ixi7zre",
            "score": 3,
            "created_utc": 1669236583.0,
            "replies": [
                {
                    "body": "Correction. The most expensive sex is married sex. The cheapest sex is the one with minimal time invested and minimal govt and lawyers involved.",
                    "author": "malcolm_reyn0lds",
                    "id": "ixjyyq1",
                    "parent_id": "t1_ixj5bv2",
                    "score": 1,
                    "created_utc": 1669249560.0,
                    "replies": [
                        {
                            "body": "That's the point of the joke...meaning married men are constantly in positions where they have to satisfy their wives or girlfriends with gifts, etc..in order to get sex.There was an old joke years back that a guy wouldn't get a blow job on Valentine's Day unless he bought his wife or GF expensive Valentine's Day gift....Thus the sex appears \"free\" but couples bargain in subtle ways all the time to get their needs met...the 2nd part of the point is it would cheaper for a guy to just go out and pay an escort for the bj...rather than buying his wife expensive jewelry or whatever to get sex...",
                            "author": "surfrat54",
                            "id": "ixk3q0q",
                            "parent_id": "t1_ixjyyq1",
                            "score": 2,
                            "created_utc": 1669251848.0,
                            "replies": [
                                {
                                    "body": "I have to correct myself. Married sex is the most expensive once the divorce comes. It isn't always expensive until you loose your house and retirement.",
                                    "author": "malcolm_reyn0lds",
                                    "id": "ixmhjmh",
                                    "parent_id": "t1_ixk3q0q",
                                    "score": 1,
                                    "created_utc": 1669305307.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just because her standard drops doesn’t mean there is no attraction it’s just that he is not as attracted as other options. Girls drop standards in vanilla, maybe because the super hot guys are not emotional available or don’t want a long term relationships, so they settle for a less hott guy and date them in vanilla.",
            "author": "Secret_Diet7053",
            "id": "ixixosg",
            "parent_id": "t1_ixi7zre",
            "score": 2,
            "created_utc": 1669233535.0,
            "replies": [
                {
                    "body": "I never said she wasn't attracted to him, or that there wasn't chemistry or they don't get along. Most sbs get along with their sds to some extent and have some attraction. ( I'd hope) . But let's not get ahead of ourselves here, most sbs wouldt see their sds without being paid. They would leave. Which by definition is a lowering of standards.",
                    "author": "malcolm_reyn0lds",
                    "id": "ixjzn6q",
                    "parent_id": "t1_ixixosg",
                    "score": 3,
                    "created_utc": 1669249885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not necessarily…there are plenty of SDs who want or need, for whatever reason, to keep the framework of sugaring in place over dating that same woman vanilla.\n\nCould be that they’re already married and want to have a long term thing without any escalation.  They could be emotionally scarred by an awful childhood.  Whatever.\n\nSo a SR is the only way they’re available.\n\nAnd the same goes for some SBs.  They don’t want/can’t handle the aspects of a vanilla relationship that sugaring eliminates, so they keep it to sugar.",
            "author": "Akavinceblack",
            "id": "ixiqgnd",
            "parent_id": "t1_ixi7zre",
            "score": 2,
            "created_utc": 1669230679.0,
            "replies": [
                {
                    "body": "The SD part of your response has no relevance to my statement. Yes all that could be true but she's still requiring payment for whatever reason on her end. 99.9% of affairs are done by adults that aren't in sugar relationships so that's really a non relevant point.\n\nWhatever her reasons for wanting an SR, the reality is that if the money stops, she's out. So whatever bonus reasons she has doesn't matter in the end because the payment is the only reason she's staying. The truth sucks.",
                    "author": "malcolm_reyn0lds",
                    "id": "ixjzeh4",
                    "parent_id": "t1_ixiqgnd",
                    "score": 2,
                    "created_utc": 1669249771.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A mere guess, but maybe comments like this are more along the lines of why you might not be getting matches.\n\nPhysical appearance isn't the only thing women consider under the 'attraction' umbrella.",
            "author": "SilkySweet2022",
            "id": "ixhhe4h",
            "parent_id": "t1_ixh4xdp",
            "score": 43,
            "created_utc": 1669212565.0,
            "replies": [
                {
                    "body": "💯",
                    "author": "myusername_77",
                    "id": "ixhx8pu",
                    "parent_id": "t1_ixhhe4h",
                    "score": 2,
                    "created_utc": 1669219211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol.  I've been active on this sub for 6 years.  I think that's the first time I've ever been called a women.\n\nFirst for everything.",
            "author": "SDstartingOut",
            "id": "ixh54cx",
            "parent_id": "t1_ixh4xdp",
            "score": 40,
            "created_utc": 1669205797.0,
            "replies": [
                {
                    "body": "Better update the flair to Spoiling Girlfriend",
                    "author": "toesockbandit",
                    "id": "ixhtn5g",
                    "parent_id": "t1_ixh54cx",
                    "score": 11,
                    "created_utc": 1669217773.0,
                    "replies": []
                },
                {
                    "body": "Hey, since we are in the age of gender confusion, how does it feel being a woman? ;)",
                    "author": "A-touchofreality",
                    "id": "ixhbito",
                    "parent_id": "t1_ixh54cx",
                    "score": 8,
                    "created_utc": 1669209619.0,
                    "replies": [
                        {
                            "body": "The elusive Sugar Mama",
                            "author": "chemistryromance",
                            "id": "ixi3rlg",
                            "parent_id": "t1_ixhbito",
                            "score": 10,
                            "created_utc": 1669221802.0,
                            "replies": [
                                {
                                    "body": "🤣🤣🤣",
                                    "author": "SilkySweet2022",
                                    "id": "ixihsor",
                                    "parent_id": "t1_ixi3rlg",
                                    "score": 3,
                                    "created_utc": 1669227270.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wahaha, you must be brand new here or you are still sleepy because it is early at your part of the world!\n\n/u/SDstartingOut is a respected member of this community since YEARS already!\n\nYou *DO* realize how this silly comment makes you look, do you? LOL·",
            "author": "A-touchofreality",
            "id": "ixhb7p9",
            "parent_id": "t1_ixh4xdp",
            "score": 21,
            "created_utc": 1669209450.0,
            "replies": []
        },
        {
            "body": "I'm a man and I think your attitude is pretty entitled and cringe. Put some effort into yourself instead of thinking that you pay your way into getting women's attraction and respect. Sugaring should be about facilitating relationships not buying them.",
            "author": "Pastakingfifth",
            "id": "ixhwsyl",
            "parent_id": "t1_ixh4xdp",
            "score": 14,
            "created_utc": 1669219042.0,
            "replies": []
        },
        {
            "body": "That is a really weird post to make when the guy wasn't even disagreeing with you.",
            "author": "sdbythebeach",
            "id": "ixh8wuo",
            "parent_id": "t1_ixh4xdp",
            "score": 16,
            "created_utc": 1669208143.0,
            "replies": []
        },
        {
            "body": "Red pill 💊",
            "author": "daddoms",
            "id": "ixh7xor",
            "parent_id": "t1_ixh4xdp",
            "score": 6,
            "created_utc": 1669207569.0,
            "replies": [
                {
                    "body": "Hm... I'd say it's the opposite of red pill lol. OP is saying that his money compensates for his lack of attractiveness.",
                    "author": "SDinAsia",
                    "id": "ixhae9o",
                    "parent_id": "t1_ixh7xor",
                    "score": 2,
                    "created_utc": 1669208993.0,
                    "replies": [
                        {
                            "body": "OP called the responder a “woman” which is childish misogyny",
                            "author": "daddoms",
                            "id": "ixhctyv",
                            "parent_id": "t1_ixhae9o",
                            "score": 13,
                            "created_utc": 1669210320.0,
                            "replies": [
                                {
                                    "body": "👏👏👏",
                                    "author": "Big_Contribution_460",
                                    "id": "ixhhcbr",
                                    "parent_id": "t1_ixhctyv",
                                    "score": 4,
                                    "created_utc": 1669212542.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "how often did you guys talk before you met?",
            "author": "barry1988",
            "id": "ixioafn",
            "parent_id": "t1_ixifzev",
            "score": 1,
            "created_utc": 1669229812.0,
            "replies": [
                {
                    "body": "Every day of just over two weeks, that’s not usual but we were fast tracking the “getting to know you” it was a gamble for him because I made no promises of intimacy, but it paid off in his favor. I rocked his world, how I know this…. He has since been trying to get me to come to his state. All expense paid and allowance. He has been a sugar daddy for years, to young women, but he says it’s been a long time since he felt wanted for more than his wallet. I am extremely affectionate and joyful.",
                    "author": "P0sitiveViibes777",
                    "id": "ixiud94",
                    "parent_id": "t1_ixioafn",
                    "score": 2,
                    "created_utc": 1669232237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m just saying as a generalization. 20’s don’t match with 40+ often on dating apps, regardless of how good looking you are. It happens, just not the majority of the time. I’m referring to the USA by the way… may be different in other countries/cultures.",
            "author": null,
            "id": "ixj124l",
            "parent_id": "t1_ixiztkd",
            "score": 1,
            "created_utc": 1669234875.0,
            "replies": []
        },
        {
            "body": "One a week is still not the majority of women. If he was 29 he’d probably have 100’s of matches per week of girls in their 20’s. I’d say your friend is probably the best case scenario. Especially if the women he sees are super attractive. \n\nThat’s kinda my point. You have to be exceptional… It’s not the general rule.",
            "author": null,
            "id": "ixj1qx1",
            "parent_id": "t1_ixj15tn",
            "score": 1,
            "created_utc": 1669235151.0,
            "replies": []
        },
        {
            "body": "I'm more of a George Clooney girl 😉",
            "author": "Matcha_Alpaca",
            "id": "ixh9f1v",
            "parent_id": "t1_ixh99bn",
            "score": 8,
            "created_utc": 1669208436.0,
            "replies": [
                {
                    "body": "Jeff Goldblum all the way !",
                    "author": "princessnellybelle",
                    "id": "ixhgm1d",
                    "parent_id": "t1_ixh9f1v",
                    "score": 7,
                    "created_utc": 1669212201.0,
                    "replies": [
                        {
                            "body": "Heh.  I actually get told I look like him sometimes!  How u doin?",
                            "author": "unique_leek_critique",
                            "id": "ixi9j09",
                            "parent_id": "t1_ixhgm1d",
                            "score": 2,
                            "created_utc": 1669224065.0,
                            "replies": [
                                {
                                    "body": "Jeff Goldblum looks and Joey pick up lines . I love it !",
                                    "author": "princessnellybelle",
                                    "id": "ixi9wf2",
                                    "parent_id": "t1_ixi9j09",
                                    "score": 3,
                                    "created_utc": 1669224209.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Why not both? Watching Ocean’s Eleven (for the first time Saturday, i know) doubled down on my eternal desire for both. 🤤",
                    "author": "curly_spice",
                    "id": "ixhbnhz",
                    "parent_id": "t1_ixh9f1v",
                    "score": 5,
                    "created_utc": 1669209688.0,
                    "replies": [
                        {
                            "body": "Matt Damon definitely is in that crowd for me...:D",
                            "author": "SilkySweet2022",
                            "id": "ixhzio6",
                            "parent_id": "t1_ixhbnhz",
                            "score": 3,
                            "created_utc": 1669220113.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Also how much of a victim complex he has.  Reminds me of a certain politician.\n\nActually, seems like OP views women in a similar light as that politician also.",
            "author": "SDstartingOut",
            "id": "ixi7jgo",
            "parent_id": "t1_ixhc1ah",
            "score": 6,
            "created_utc": 1669223281.0,
            "replies": [
                {
                    "body": "Bingo!",
                    "author": "Matcha_Alpaca",
                    "id": "ixi9fo6",
                    "parent_id": "t1_ixi7jgo",
                    "score": 1,
                    "created_utc": 1669224029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The only entitled people on here who are all the sbs who think they deserve money simply for existing",
            "author": "throwawayrtyggv",
            "id": "ixhe1gb",
            "parent_id": "t1_ixhc1ah",
            "score": -16,
            "created_utc": 1669210941.0,
            "replies": [
                {
                    "body": "And yet here you are commenting on your own post about SB's not accepting your money. Your post and comment history suggests you're not having a great time in the bowl. Maybe you need to change your approach.",
                    "author": "Matcha_Alpaca",
                    "id": "ixhewnp",
                    "parent_id": "t1_ixhe1gb",
                    "score": 16,
                    "created_utc": 1669211379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Jason Statham you mean?\n\nYes, I corrected the spelling. ( I just use metal clippers. I do not use a razor) Not clean shaven bald. I have also been told I look like 'Steve Austin' the former Wrestler.\n\nI am very fit and lean.",
            "author": "CenTexFunGuy",
            "id": "ixhcsej",
            "parent_id": "t1_ixhawsy",
            "score": 2,
            "created_utc": 1669210298.0,
            "replies": []
        },
        {
            "body": "Round = soft\n\nGood for hugging",
            "author": "peregrine_nation",
            "id": "ixhk8k4",
            "parent_id": "t1_ixhfxt3",
            "score": 7,
            "created_utc": 1669213865.0,
            "replies": [
                {
                    "body": "Thank you! \n\nIn my younger days (20s) some women would note that my being so thin would sometimes cause some pain during a particularly active sex session. (Boney hips)\n\nThat has not been a concern lately. 😂",
                    "author": "Chill_SD1974",
                    "id": "ixhttbk",
                    "parent_id": "t1_ixhk8k4",
                    "score": 2,
                    "created_utc": 1669217841.0,
                    "replies": []
                },
                {
                    "body": "The cuddlier they are the better.",
                    "author": "Acucar_amorpho",
                    "id": "ixho6cj",
                    "parent_id": "t1_ixhk8k4",
                    "score": 1,
                    "created_utc": 1669215547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm missing something. You went on a date and he gave you less than what you both agreed upon  before the date? \nIf so, why didn't you confront him right there and then?\n\n Come to think about it, what are possible defenses/countermeasures?",
            "author": "dallas-explorer",
            "id": "ixpb4bd",
            "parent_id": "t1_ixh8me0",
            "score": 1,
            "created_utc": 1669355800.0,
            "replies": []
        },
        {
            "body": "Great if you found that :) normally that is not the case there is a bit of acting involved in most SRs especially from the SB side.",
            "author": "bookworm010101",
            "id": "ixm3joo",
            "parent_id": "t1_ixm3439",
            "score": 3,
            "created_utc": 1669298696.0,
            "replies": [
                {
                    "body": "I think the issue is when people expect to find romantic love within a Sugar Relationship, but I do look to build a strong friendship. I've remained friends with several SBs long after our arrangements ended.  It's possible to become good friends without expecting romantic love leading to marriage and/or children.",
                    "author": "MaxFromVenice",
                    "id": "ixm49oh",
                    "parent_id": "t1_ixm3joo",
                    "score": 2,
                    "created_utc": 1669299076.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "izvzvvu",
                            "parent_id": "t1_ixm49oh",
                            "score": 1,
                            "created_utc": 1670826926.0,
                            "replies": [
                                {
                                    "body": "Lol",
                                    "author": "MaxFromVenice",
                                    "id": "izw9u7a",
                                    "parent_id": "t1_izvzvvu",
                                    "score": 1,
                                    "created_utc": 1670834747.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j05f460",
                                            "parent_id": "t1_izw9u7a",
                                            "score": 1,
                                            "created_utc": 1670993381.0,
                                            "replies": [
                                                {
                                                    "body": "What if I'm not married? lol",
                                                    "author": "MaxFromVenice",
                                                    "id": "j05w0l7",
                                                    "parent_id": "t1_j05f460",
                                                    "score": 1,
                                                    "created_utc": 1671004658.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "j07xah1",
                                                            "parent_id": "t1_j05w0l7",
                                                            "score": 1,
                                                            "created_utc": 1671043362.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                                                    "author": "MaxFromVenice",
                                                                    "id": "j07ysca",
                                                                    "parent_id": "t1_j07xah1",
                                                                    "score": 1,
                                                                    "created_utc": 1671043929.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "j07z4w3",
                                                                            "parent_id": "t1_j07ysca",
                                                                            "score": 1,
                                                                            "created_utc": 1671044060.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣🤣🤣",
            "author": "FLRAdvocate",
            "id": "ixjolwy",
            "parent_id": "t1_ixhsob8",
            "score": 3,
            "created_utc": 1669244770.0,
            "replies": []
        },
        {
            "body": "There are PLENTY of women who don't mind someone soft to cuddle with.",
            "author": "SilkySweet2022",
            "id": "ixihoqr",
            "parent_id": "t1_ixi5o4t",
            "score": 17,
            "created_utc": 1669227229.0,
            "replies": []
        },
        {
            "body": "But there are women who like overweight men. I like overweight men. Would I date someone who was in the obese category? No. Unless he was very tall and carried it well and had a great personality. I hate men with six packs too and would never talk to one either.",
            "author": "salkaurs",
            "id": "ixice9r",
            "parent_id": "t1_ixi5o4t",
            "score": 14,
            "created_utc": 1669225179.0,
            "replies": [
                {
                    "body": "I think my point went over your head though.\n\nI'm not suggesting YOU should date someone you aren't attracted to;  nor should you be attracted to obese men.  \n\nI'm merely stating that - just because you are not attracted to them, does not mean other women would have to fake/act it.  Which is what your post seemed to imply.\n\n> Unless he was very tall \n\nFWIW for me personally, I do feel this is a lot of why I've been able to find women who were (at least to some degree) physically attracted to me.",
                    "author": "SDstartingOut",
                    "id": "ixiid84",
                    "parent_id": "t1_ixice9r",
                    "score": 3,
                    "created_utc": 1669227492.0,
                    "replies": [
                        {
                            "body": "A beautiful younger woman being genuinely sexually attracted to an obese older man is rare. Not sure what to tell you other than that I agree that they do exist but are rare",
                            "author": "salkaurs",
                            "id": "ixij7we",
                            "parent_id": "t1_ixiid84",
                            "score": 7,
                            "created_utc": 1669227820.0,
                            "replies": [
                                {
                                    "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
                                    "author": "Ripeness2282",
                                    "id": "ixj5uxk",
                                    "parent_id": "t1_ixij7we",
                                    "score": 3,
                                    "created_utc": 1669236790.0,
                                    "replies": []
                                },
                                {
                                    "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
                                    "author": "Soph4art",
                                    "id": "ixiqdwg",
                                    "parent_id": "t1_ixij7we",
                                    "score": 1,
                                    "created_utc": 1669230649.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've lived most of my life in rural areas, husky men are the delicacy here. Haha. I personally am attracted to lean muscles and even a bit of pudge. I also have a friend who is genuinely attracted to moobs. Everybody's got a preference. I think weight itself doesn't matter, it's the way you carry yourself.",
            "author": "MissRoyalBrush",
            "id": "ixipg42",
            "parent_id": "t1_ixi5o4t",
            "score": 6,
            "created_utc": 1669230275.0,
            "replies": []
        },
        {
            "body": "I mean there’s literally a trend on tik tok about women who prefer larger men. It’s certainly not uncommon and not looked down upon as much in society when you look at the likes of Rick Ross, dj khaled etc who many don’t question when they are with thin women but pierce brosnan gets a lot of flack for staying with his gorgeous wife because she’s gained weight.\n\nI know this is an extremely late comment lol but yeah",
            "author": "Sugarintheorange",
            "id": "j1pibdj",
            "parent_id": "t1_ixi5o4t",
            "score": 1,
            "created_utc": 1672048672.0,
            "replies": []
        },
        {
            "body": "Correction. The most expensive sex is married sex. The cheapest sex is the one with minimal time invested and minimal govt and lawyers involved.",
            "author": "malcolm_reyn0lds",
            "id": "ixjyyq1",
            "parent_id": "t1_ixj5bv2",
            "score": 1,
            "created_utc": 1669249560.0,
            "replies": [
                {
                    "body": "That's the point of the joke...meaning married men are constantly in positions where they have to satisfy their wives or girlfriends with gifts, etc..in order to get sex.There was an old joke years back that a guy wouldn't get a blow job on Valentine's Day unless he bought his wife or GF expensive Valentine's Day gift....Thus the sex appears \"free\" but couples bargain in subtle ways all the time to get their needs met...the 2nd part of the point is it would cheaper for a guy to just go out and pay an escort for the bj...rather than buying his wife expensive jewelry or whatever to get sex...",
                    "author": "surfrat54",
                    "id": "ixk3q0q",
                    "parent_id": "t1_ixjyyq1",
                    "score": 2,
                    "created_utc": 1669251848.0,
                    "replies": [
                        {
                            "body": "I have to correct myself. Married sex is the most expensive once the divorce comes. It isn't always expensive until you loose your house and retirement.",
                            "author": "malcolm_reyn0lds",
                            "id": "ixmhjmh",
                            "parent_id": "t1_ixk3q0q",
                            "score": 1,
                            "created_utc": 1669305307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never said she wasn't attracted to him, or that there wasn't chemistry or they don't get along. Most sbs get along with their sds to some extent and have some attraction. ( I'd hope) . But let's not get ahead of ourselves here, most sbs wouldt see their sds without being paid. They would leave. Which by definition is a lowering of standards.",
            "author": "malcolm_reyn0lds",
            "id": "ixjzn6q",
            "parent_id": "t1_ixixosg",
            "score": 3,
            "created_utc": 1669249885.0,
            "replies": []
        },
        {
            "body": "The SD part of your response has no relevance to my statement. Yes all that could be true but she's still requiring payment for whatever reason on her end. 99.9% of affairs are done by adults that aren't in sugar relationships so that's really a non relevant point.\n\nWhatever her reasons for wanting an SR, the reality is that if the money stops, she's out. So whatever bonus reasons she has doesn't matter in the end because the payment is the only reason she's staying. The truth sucks.",
            "author": "malcolm_reyn0lds",
            "id": "ixjzeh4",
            "parent_id": "t1_ixiqgnd",
            "score": 2,
            "created_utc": 1669249771.0,
            "replies": []
        },
        {
            "body": "💯",
            "author": "myusername_77",
            "id": "ixhx8pu",
            "parent_id": "t1_ixhhe4h",
            "score": 2,
            "created_utc": 1669219211.0,
            "replies": []
        },
        {
            "body": "Better update the flair to Spoiling Girlfriend",
            "author": "toesockbandit",
            "id": "ixhtn5g",
            "parent_id": "t1_ixh54cx",
            "score": 11,
            "created_utc": 1669217773.0,
            "replies": []
        },
        {
            "body": "Hey, since we are in the age of gender confusion, how does it feel being a woman? ;)",
            "author": "A-touchofreality",
            "id": "ixhbito",
            "parent_id": "t1_ixh54cx",
            "score": 8,
            "created_utc": 1669209619.0,
            "replies": [
                {
                    "body": "The elusive Sugar Mama",
                    "author": "chemistryromance",
                    "id": "ixi3rlg",
                    "parent_id": "t1_ixhbito",
                    "score": 10,
                    "created_utc": 1669221802.0,
                    "replies": [
                        {
                            "body": "🤣🤣🤣",
                            "author": "SilkySweet2022",
                            "id": "ixihsor",
                            "parent_id": "t1_ixi3rlg",
                            "score": 3,
                            "created_utc": 1669227270.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hm... I'd say it's the opposite of red pill lol. OP is saying that his money compensates for his lack of attractiveness.",
            "author": "SDinAsia",
            "id": "ixhae9o",
            "parent_id": "t1_ixh7xor",
            "score": 2,
            "created_utc": 1669208993.0,
            "replies": [
                {
                    "body": "OP called the responder a “woman” which is childish misogyny",
                    "author": "daddoms",
                    "id": "ixhctyv",
                    "parent_id": "t1_ixhae9o",
                    "score": 13,
                    "created_utc": 1669210320.0,
                    "replies": [
                        {
                            "body": "👏👏👏",
                            "author": "Big_Contribution_460",
                            "id": "ixhhcbr",
                            "parent_id": "t1_ixhctyv",
                            "score": 4,
                            "created_utc": 1669212542.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Every day of just over two weeks, that’s not usual but we were fast tracking the “getting to know you” it was a gamble for him because I made no promises of intimacy, but it paid off in his favor. I rocked his world, how I know this…. He has since been trying to get me to come to his state. All expense paid and allowance. He has been a sugar daddy for years, to young women, but he says it’s been a long time since he felt wanted for more than his wallet. I am extremely affectionate and joyful.",
            "author": "P0sitiveViibes777",
            "id": "ixiud94",
            "parent_id": "t1_ixioafn",
            "score": 2,
            "created_utc": 1669232237.0,
            "replies": []
        },
        {
            "body": "Jeff Goldblum all the way !",
            "author": "princessnellybelle",
            "id": "ixhgm1d",
            "parent_id": "t1_ixh9f1v",
            "score": 7,
            "created_utc": 1669212201.0,
            "replies": [
                {
                    "body": "Heh.  I actually get told I look like him sometimes!  How u doin?",
                    "author": "unique_leek_critique",
                    "id": "ixi9j09",
                    "parent_id": "t1_ixhgm1d",
                    "score": 2,
                    "created_utc": 1669224065.0,
                    "replies": [
                        {
                            "body": "Jeff Goldblum looks and Joey pick up lines . I love it !",
                            "author": "princessnellybelle",
                            "id": "ixi9wf2",
                            "parent_id": "t1_ixi9j09",
                            "score": 3,
                            "created_utc": 1669224209.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why not both? Watching Ocean’s Eleven (for the first time Saturday, i know) doubled down on my eternal desire for both. 🤤",
            "author": "curly_spice",
            "id": "ixhbnhz",
            "parent_id": "t1_ixh9f1v",
            "score": 5,
            "created_utc": 1669209688.0,
            "replies": [
                {
                    "body": "Matt Damon definitely is in that crowd for me...:D",
                    "author": "SilkySweet2022",
                    "id": "ixhzio6",
                    "parent_id": "t1_ixhbnhz",
                    "score": 3,
                    "created_utc": 1669220113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bingo!",
            "author": "Matcha_Alpaca",
            "id": "ixi9fo6",
            "parent_id": "t1_ixi7jgo",
            "score": 1,
            "created_utc": 1669224029.0,
            "replies": []
        },
        {
            "body": "And yet here you are commenting on your own post about SB's not accepting your money. Your post and comment history suggests you're not having a great time in the bowl. Maybe you need to change your approach.",
            "author": "Matcha_Alpaca",
            "id": "ixhewnp",
            "parent_id": "t1_ixhe1gb",
            "score": 16,
            "created_utc": 1669211379.0,
            "replies": []
        },
        {
            "body": "Thank you! \n\nIn my younger days (20s) some women would note that my being so thin would sometimes cause some pain during a particularly active sex session. (Boney hips)\n\nThat has not been a concern lately. 😂",
            "author": "Chill_SD1974",
            "id": "ixhttbk",
            "parent_id": "t1_ixhk8k4",
            "score": 2,
            "created_utc": 1669217841.0,
            "replies": []
        },
        {
            "body": "The cuddlier they are the better.",
            "author": "Acucar_amorpho",
            "id": "ixho6cj",
            "parent_id": "t1_ixhk8k4",
            "score": 1,
            "created_utc": 1669215547.0,
            "replies": []
        },
        {
            "body": "I think the issue is when people expect to find romantic love within a Sugar Relationship, but I do look to build a strong friendship. I've remained friends with several SBs long after our arrangements ended.  It's possible to become good friends without expecting romantic love leading to marriage and/or children.",
            "author": "MaxFromVenice",
            "id": "ixm49oh",
            "parent_id": "t1_ixm3joo",
            "score": 2,
            "created_utc": 1669299076.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "izvzvvu",
                    "parent_id": "t1_ixm49oh",
                    "score": 1,
                    "created_utc": 1670826926.0,
                    "replies": [
                        {
                            "body": "Lol",
                            "author": "MaxFromVenice",
                            "id": "izw9u7a",
                            "parent_id": "t1_izvzvvu",
                            "score": 1,
                            "created_utc": 1670834747.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j05f460",
                                    "parent_id": "t1_izw9u7a",
                                    "score": 1,
                                    "created_utc": 1670993381.0,
                                    "replies": [
                                        {
                                            "body": "What if I'm not married? lol",
                                            "author": "MaxFromVenice",
                                            "id": "j05w0l7",
                                            "parent_id": "t1_j05f460",
                                            "score": 1,
                                            "created_utc": 1671004658.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "j07xah1",
                                                    "parent_id": "t1_j05w0l7",
                                                    "score": 1,
                                                    "created_utc": 1671043362.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                                            "author": "MaxFromVenice",
                                                            "id": "j07ysca",
                                                            "parent_id": "t1_j07xah1",
                                                            "score": 1,
                                                            "created_utc": 1671043929.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "j07z4w3",
                                                                    "parent_id": "t1_j07ysca",
                                                                    "score": 1,
                                                                    "created_utc": 1671044060.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think my point went over your head though.\n\nI'm not suggesting YOU should date someone you aren't attracted to;  nor should you be attracted to obese men.  \n\nI'm merely stating that - just because you are not attracted to them, does not mean other women would have to fake/act it.  Which is what your post seemed to imply.\n\n> Unless he was very tall \n\nFWIW for me personally, I do feel this is a lot of why I've been able to find women who were (at least to some degree) physically attracted to me.",
            "author": "SDstartingOut",
            "id": "ixiid84",
            "parent_id": "t1_ixice9r",
            "score": 3,
            "created_utc": 1669227492.0,
            "replies": [
                {
                    "body": "A beautiful younger woman being genuinely sexually attracted to an obese older man is rare. Not sure what to tell you other than that I agree that they do exist but are rare",
                    "author": "salkaurs",
                    "id": "ixij7we",
                    "parent_id": "t1_ixiid84",
                    "score": 7,
                    "created_utc": 1669227820.0,
                    "replies": [
                        {
                            "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
                            "author": "Ripeness2282",
                            "id": "ixj5uxk",
                            "parent_id": "t1_ixij7we",
                            "score": 3,
                            "created_utc": 1669236790.0,
                            "replies": []
                        },
                        {
                            "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
                            "author": "Soph4art",
                            "id": "ixiqdwg",
                            "parent_id": "t1_ixij7we",
                            "score": 1,
                            "created_utc": 1669230649.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's the point of the joke...meaning married men are constantly in positions where they have to satisfy their wives or girlfriends with gifts, etc..in order to get sex.There was an old joke years back that a guy wouldn't get a blow job on Valentine's Day unless he bought his wife or GF expensive Valentine's Day gift....Thus the sex appears \"free\" but couples bargain in subtle ways all the time to get their needs met...the 2nd part of the point is it would cheaper for a guy to just go out and pay an escort for the bj...rather than buying his wife expensive jewelry or whatever to get sex...",
            "author": "surfrat54",
            "id": "ixk3q0q",
            "parent_id": "t1_ixjyyq1",
            "score": 2,
            "created_utc": 1669251848.0,
            "replies": [
                {
                    "body": "I have to correct myself. Married sex is the most expensive once the divorce comes. It isn't always expensive until you loose your house and retirement.",
                    "author": "malcolm_reyn0lds",
                    "id": "ixmhjmh",
                    "parent_id": "t1_ixk3q0q",
                    "score": 1,
                    "created_utc": 1669305307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The elusive Sugar Mama",
            "author": "chemistryromance",
            "id": "ixi3rlg",
            "parent_id": "t1_ixhbito",
            "score": 10,
            "created_utc": 1669221802.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "SilkySweet2022",
                    "id": "ixihsor",
                    "parent_id": "t1_ixi3rlg",
                    "score": 3,
                    "created_utc": 1669227270.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP called the responder a “woman” which is childish misogyny",
            "author": "daddoms",
            "id": "ixhctyv",
            "parent_id": "t1_ixhae9o",
            "score": 13,
            "created_utc": 1669210320.0,
            "replies": [
                {
                    "body": "👏👏👏",
                    "author": "Big_Contribution_460",
                    "id": "ixhhcbr",
                    "parent_id": "t1_ixhctyv",
                    "score": 4,
                    "created_utc": 1669212542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Heh.  I actually get told I look like him sometimes!  How u doin?",
            "author": "unique_leek_critique",
            "id": "ixi9j09",
            "parent_id": "t1_ixhgm1d",
            "score": 2,
            "created_utc": 1669224065.0,
            "replies": [
                {
                    "body": "Jeff Goldblum looks and Joey pick up lines . I love it !",
                    "author": "princessnellybelle",
                    "id": "ixi9wf2",
                    "parent_id": "t1_ixi9j09",
                    "score": 3,
                    "created_utc": 1669224209.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Matt Damon definitely is in that crowd for me...:D",
            "author": "SilkySweet2022",
            "id": "ixhzio6",
            "parent_id": "t1_ixhbnhz",
            "score": 3,
            "created_utc": 1669220113.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "izvzvvu",
            "parent_id": "t1_ixm49oh",
            "score": 1,
            "created_utc": 1670826926.0,
            "replies": [
                {
                    "body": "Lol",
                    "author": "MaxFromVenice",
                    "id": "izw9u7a",
                    "parent_id": "t1_izvzvvu",
                    "score": 1,
                    "created_utc": 1670834747.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j05f460",
                            "parent_id": "t1_izw9u7a",
                            "score": 1,
                            "created_utc": 1670993381.0,
                            "replies": [
                                {
                                    "body": "What if I'm not married? lol",
                                    "author": "MaxFromVenice",
                                    "id": "j05w0l7",
                                    "parent_id": "t1_j05f460",
                                    "score": 1,
                                    "created_utc": 1671004658.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j07xah1",
                                            "parent_id": "t1_j05w0l7",
                                            "score": 1,
                                            "created_utc": 1671043362.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                                    "author": "MaxFromVenice",
                                                    "id": "j07ysca",
                                                    "parent_id": "t1_j07xah1",
                                                    "score": 1,
                                                    "created_utc": 1671043929.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "j07z4w3",
                                                            "parent_id": "t1_j07ysca",
                                                            "score": 1,
                                                            "created_utc": 1671044060.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A beautiful younger woman being genuinely sexually attracted to an obese older man is rare. Not sure what to tell you other than that I agree that they do exist but are rare",
            "author": "salkaurs",
            "id": "ixij7we",
            "parent_id": "t1_ixiid84",
            "score": 7,
            "created_utc": 1669227820.0,
            "replies": [
                {
                    "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
                    "author": "Ripeness2282",
                    "id": "ixj5uxk",
                    "parent_id": "t1_ixij7we",
                    "score": 3,
                    "created_utc": 1669236790.0,
                    "replies": []
                },
                {
                    "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
                    "author": "Soph4art",
                    "id": "ixiqdwg",
                    "parent_id": "t1_ixij7we",
                    "score": 1,
                    "created_utc": 1669230649.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have to correct myself. Married sex is the most expensive once the divorce comes. It isn't always expensive until you loose your house and retirement.",
            "author": "malcolm_reyn0lds",
            "id": "ixmhjmh",
            "parent_id": "t1_ixk3q0q",
            "score": 1,
            "created_utc": 1669305307.0,
            "replies": []
        },
        {
            "body": "🤣🤣🤣",
            "author": "SilkySweet2022",
            "id": "ixihsor",
            "parent_id": "t1_ixi3rlg",
            "score": 3,
            "created_utc": 1669227270.0,
            "replies": []
        },
        {
            "body": "👏👏👏",
            "author": "Big_Contribution_460",
            "id": "ixhhcbr",
            "parent_id": "t1_ixhctyv",
            "score": 4,
            "created_utc": 1669212542.0,
            "replies": []
        },
        {
            "body": "Jeff Goldblum looks and Joey pick up lines . I love it !",
            "author": "princessnellybelle",
            "id": "ixi9wf2",
            "parent_id": "t1_ixi9j09",
            "score": 3,
            "created_utc": 1669224209.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": "MaxFromVenice",
            "id": "izw9u7a",
            "parent_id": "t1_izvzvvu",
            "score": 1,
            "created_utc": 1670834747.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j05f460",
                    "parent_id": "t1_izw9u7a",
                    "score": 1,
                    "created_utc": 1670993381.0,
                    "replies": [
                        {
                            "body": "What if I'm not married? lol",
                            "author": "MaxFromVenice",
                            "id": "j05w0l7",
                            "parent_id": "t1_j05f460",
                            "score": 1,
                            "created_utc": 1671004658.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j07xah1",
                                    "parent_id": "t1_j05w0l7",
                                    "score": 1,
                                    "created_utc": 1671043362.0,
                                    "replies": [
                                        {
                                            "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                            "author": "MaxFromVenice",
                                            "id": "j07ysca",
                                            "parent_id": "t1_j07xah1",
                                            "score": 1,
                                            "created_utc": 1671043929.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "j07z4w3",
                                                    "parent_id": "t1_j07ysca",
                                                    "score": 1,
                                                    "created_utc": 1671044060.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a plus sized SB my basic understanding is that the more there is of me- the bigger the boobs and butt become- and this is generally a good thing. Men do not have this positive side effect, quite the opposite in fact. \n\nJoking aside, I think it comes down to shared hobbies/activities, hygiene, and personality more than looks (at least from my experience). I do think a 20 yr old SB is gonna wanna go out and do stuff so the question becomes can we do the things I want to do together, and do we look terribly out of place with each other?",
            "author": "Ripeness2282",
            "id": "ixj5uxk",
            "parent_id": "t1_ixij7we",
            "score": 3,
            "created_utc": 1669236790.0,
            "replies": []
        },
        {
            "body": "Unless she’s obese herself. Plus size models for example may like the bigger guy",
            "author": "Soph4art",
            "id": "ixiqdwg",
            "parent_id": "t1_ixij7we",
            "score": 1,
            "created_utc": 1669230649.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j05f460",
            "parent_id": "t1_izw9u7a",
            "score": 1,
            "created_utc": 1670993381.0,
            "replies": [
                {
                    "body": "What if I'm not married? lol",
                    "author": "MaxFromVenice",
                    "id": "j05w0l7",
                    "parent_id": "t1_j05f460",
                    "score": 1,
                    "created_utc": 1671004658.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j07xah1",
                            "parent_id": "t1_j05w0l7",
                            "score": 1,
                            "created_utc": 1671043362.0,
                            "replies": [
                                {
                                    "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                                    "author": "MaxFromVenice",
                                    "id": "j07ysca",
                                    "parent_id": "t1_j07xah1",
                                    "score": 1,
                                    "created_utc": 1671043929.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "j07z4w3",
                                            "parent_id": "t1_j07ysca",
                                            "score": 1,
                                            "created_utc": 1671044060.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What if I'm not married? lol",
            "author": "MaxFromVenice",
            "id": "j05w0l7",
            "parent_id": "t1_j05f460",
            "score": 1,
            "created_utc": 1671004658.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j07xah1",
                    "parent_id": "t1_j05w0l7",
                    "score": 1,
                    "created_utc": 1671043362.0,
                    "replies": [
                        {
                            "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                            "author": "MaxFromVenice",
                            "id": "j07ysca",
                            "parent_id": "t1_j07xah1",
                            "score": 1,
                            "created_utc": 1671043929.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "j07z4w3",
                                    "parent_id": "t1_j07ysca",
                                    "score": 1,
                                    "created_utc": 1671044060.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j07xah1",
            "parent_id": "t1_j05w0l7",
            "score": 1,
            "created_utc": 1671043362.0,
            "replies": [
                {
                    "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
                    "author": "MaxFromVenice",
                    "id": "j07ysca",
                    "parent_id": "t1_j07xah1",
                    "score": 1,
                    "created_utc": 1671043929.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "j07z4w3",
                            "parent_id": "t1_j07ysca",
                            "score": 1,
                            "created_utc": 1671044060.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks Santa. I assume this means I'm getting coal this year! Lol",
            "author": "MaxFromVenice",
            "id": "j07ysca",
            "parent_id": "t1_j07xah1",
            "score": 1,
            "created_utc": 1671043929.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "j07z4w3",
                    "parent_id": "t1_j07ysca",
                    "score": 1,
                    "created_utc": 1671044060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "j07z4w3",
            "parent_id": "t1_j07ysca",
            "score": 1,
            "created_utc": 1671044060.0,
            "replies": []
        }
    ]
}