{
    "title": "Doxxing update",
    "post_id": "b2mnkv",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/b2mnkv/doxxing_update/",
    "author": "YahooDoctor",
    "body": "Recap: a few weeks ago I received a text message on my private unpublished cell phone which referenced this sub and my sugar lifestyle and made a veiled threat to ‘out’ me. Not wanting to take chances, I nuked my Reddit profile and handed everything over to a private investigator. \n\nUpdate: It was my newest SB’s brother. \n\nShe had confided in him about what she was doing. He didn’t approve and says he wanted to frighten me off, but in actuality he wanted a payoff. He snooped her phone and got my info. \n\nMy PI strung him along, feigning fear and wanting to do whatever we can to ‘keep this quiet’. Eventually got enough information to identify him and then confronted him with two off duty cops (who conveniently had not yet changed out of uniform). He was persuaded to stop, no second chances. \n\nI revealed it to her, she seemed legit shocked and angry, and they both insist she was not involved. She also beat the ever loving shit out of him. But I’m still a bit leary. If she wasn’t so amazing I’d drop her in a second, just to be safe, but she engages me in thoughtful conversation unlike anyone I’ve ever met.\n\nThank you all for the replies and PMs of support, and ideas on how to proceed. It’s great to be a part of a community that takes care of one another.\n\n\n",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/b2mnkv/doxxing_update/",
    "score": 118,
    "upvote_ratio": 0.96,
    "created_utc": 1552935944.0,
    "num_comments": 38,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Wow, this is the first happy ending I've heard come out of one of these situations. Congrats! \n\nNot sure why you did not cut ties though. Seems like high risk having her brother around. ",
            "author": "denardos",
            "id": "eitnh1d",
            "parent_id": "t3_b2mnkv",
            "score": 48,
            "created_utc": 1552937010.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eitop6b",
                    "parent_id": "t1_eitnh1d",
                    "score": 38,
                    "created_utc": 1552937855.0,
                    "replies": [
                        {
                            "body": "right, exactly.",
                            "author": "Quinn_amore7",
                            "id": "eiu5q46",
                            "parent_id": "t1_eitop6b",
                            "score": 5,
                            "created_utc": 1552950221.0,
                            "replies": [
                                {
                                    "body": "Sounds like the brother doesn't want to wake up with two broken legs.",
                                    "author": "OlderSD",
                                    "id": "eivhmmn",
                                    "parent_id": "t1_eiu5q46",
                                    "score": 3,
                                    "created_utc": 1553000306.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Glad you had such a great outcome. As for the SB, it seems suspicious to me. At a minimum, she showed very poor judgement sharing her lifestyle with someone she absolutely could not trust. I would cut things off completely with her. ",
            "author": null,
            "id": "eitns2q",
            "parent_id": "t3_b2mnkv",
            "score": 24,
            "created_utc": 1552937220.0,
            "replies": [
                {
                    "body": "Right. Even if she was totally innocent, she still poses a threat as a vector for information being shared...innocently or accidentally that a known threat can use to hurt OP or his property. Nothing like knowing exactly where someone lives, what they have in their home, what their security measures are like, and when they're going to be on vacation or spending a late evening out. ",
                    "author": "901Loser",
                    "id": "eitq9rh",
                    "parent_id": "t1_eitns2q",
                    "score": 9,
                    "created_utc": 1552939072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1.  Use of the PI was brilliant.\n\n2.  I don't believe your SB.  Who the hell tells her BROTHER she's sleeping with an older guy for money?  She's very likely in on it or has very poor judgment.  Since she engages you and appears intelligent, I vote she's in on it.  For this and so many other reasons, I would move on and end things with the SB.\n\n[Edit - Isn't the psycho brother and his possibly grifter sister reading these comments if they knew you were on SLF???]",
            "author": "ThrowawaySD1000",
            "id": "eittwgw",
            "parent_id": "t3_b2mnkv",
            "score": 32,
            "created_utc": 1552941692.0,
            "replies": [
                {
                    "body": "I tell my brother! ",
                    "author": null,
                    "id": "eiuzrnc",
                    "parent_id": "t1_eittwgw",
                    "score": 6,
                    "created_utc": 1552977122.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eitvl8o",
                    "parent_id": "t1_eittwgw",
                    "score": 6,
                    "created_utc": 1552942863.0,
                    "replies": [
                        {
                            "body": "Maybe, \"Hey, I met this older guy online. He's loaded. I'm sure he would hate for it to come out that he is seeing me on the side\". \n\nI have no opinion on whether the SB was in on it or not. We really can't know. But not cutting contact is very risky. ",
                            "author": "denardos",
                            "id": "eitx7kw",
                            "parent_id": "t1_eitvl8o",
                            "score": 11,
                            "created_utc": 1552944029.0,
                            "replies": []
                        },
                        {
                            "body": "That is completely backwards for me; the most honest relationship I have is with my brother even though I have 2 other sisters. I'm more honest with him because he gives the least judgement. However, my dating life is off topic because he would react negatively to me being into older men. My best friend on the other hand is very up to date on his lil sister's love life & can unlock her iPhone via face recognition (they look that much alike).\nI see no point in her informing an ex-bf about a SR.",
                            "author": "bsbdfw",
                            "id": "eiu27au",
                            "parent_id": "t1_eitvl8o",
                            "score": 10,
                            "created_utc": 1552947609.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">she also beat the everloving shit out of him\n\nSomehow this doesn’t redeem her at all to me...",
            "author": "Hifromsanfrancisc0",
            "id": "eitoo2z",
            "parent_id": "t3_b2mnkv",
            "score": 42,
            "created_utc": 1552937835.0,
            "replies": [
                {
                    "body": "You mean you don't like someone that responds with violence to situations like this? Every guy and girl should be clamoring to find someone like that /s.",
                    "author": "sexviewer",
                    "id": "eitqv9b",
                    "parent_id": "t1_eitoo2z",
                    "score": 16,
                    "created_utc": 1552939539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not exactly how I would have handled it .But glad it worked out for you. \n\nSleazy dudes being connected to attractive girls and seeing them as a potential payday isn't rare. It literally being her brother is moreso. \n\nI would be extra vigilant about property crime against you for a while. If he is particularly young and inexperienced your show may have dissuaded him and 'scared him straight'\nBut there is a deeper level to this in terms of his perception of his sister's honor that extends beyond the pragmatic and the damage to his ego may fester more and more resulting in more poor decision making. ",
            "author": "901Loser",
            "id": "eitpz04",
            "parent_id": "t3_b2mnkv",
            "score": 10,
            "created_utc": 1552938795.0,
            "replies": [
                {
                    "body": "I agree.  The brother may back off for now but I'd bet he is butthurt about getting caught and is dreaming of ways to strike again.\n\nWould OP really want an SR where he has to keep a lookout for the brother?",
                    "author": "Volturi6271",
                    "id": "eiu6jfl",
                    "parent_id": "t1_eitpz04",
                    "score": 5,
                    "created_utc": 1552950845.0,
                    "replies": []
                },
                {
                    "body": "Sage words. ",
                    "author": "VitaMixSD",
                    "id": "eivrqmb",
                    "parent_id": "t1_eitpz04",
                    "score": 2,
                    "created_utc": 1553007561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Blackmail is a crime.  Outing you for no reason isn't.  What's to stop this guy from doing it just to do it?  I'd get away from him and his sister.   ",
            "author": "Volturi6271",
            "id": "eiu6tyi",
            "parent_id": "t3_b2mnkv",
            "score": 9,
            "created_utc": 1552951068.0,
            "replies": []
        },
        {
            "body": "Still iffy he was able to connect your Reddit account with your identity.",
            "author": null,
            "id": "eiu0mk7",
            "parent_id": "t3_b2mnkv",
            "score": 7,
            "created_utc": 1552946450.0,
            "replies": [
                {
                    "body": "If he browsed her reddit from her phone, it wouldn’t be hard for him to find her posts or what she subscribes to. ",
                    "author": "steel_marigold",
                    "id": "eiu1yvu",
                    "parent_id": "t1_eiu0mk7",
                    "score": 2,
                    "created_utc": 1552947431.0,
                    "replies": [
                        {
                            "body": "OP is the SD and we don't know if she(the SB) browses Reddit, or if those dots are actually there to connect ",
                            "author": "Rabb1tH3ad",
                            "id": "eiv3nwh",
                            "parent_id": "t1_eiu1yvu",
                            "score": 2,
                            "created_utc": 1552982854.0,
                            "replies": [
                                {
                                    "body": "Ah gotcha.",
                                    "author": "steel_marigold",
                                    "id": "eiv64f4",
                                    "parent_id": "t1_eiv3nwh",
                                    "score": 1,
                                    "created_utc": 1552986923.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would be seriously reconsidering the arrangement with your SB if I were you. High risk. There is probably a very good chance she was in on it too. If her brother was after a payout, she probably was in on it too. Seems weird he was so easily able to snoop through her phone and grab all your info without her noticing. I highly doubt she was innocent. Tread carefully mate. ",
            "author": "snake_pod",
            "id": "eityx7n",
            "parent_id": "t3_b2mnkv",
            "score": 7,
            "created_utc": 1552945232.0,
            "replies": []
        },
        {
            "body": "To be on the safe side, I would have the PI look more into her situation. It doesn't seem right to me. Sounds like some lifetime movies shit to me lol sorry ",
            "author": "Quinn_amore7",
            "id": "eiu7fd6",
            "parent_id": "t3_b2mnkv",
            "score": 5,
            "created_utc": 1552951526.0,
            "replies": []
        },
        {
            "body": "Super happy to read this and glad it worked out well for you but like others, I would suggest ending it with this one SB and moving on. Who knows what could happen next and I'd already be scared enough with what HAS happened. \n\nGood luck to you! ",
            "author": "TexasSD",
            "id": "eituw9v",
            "parent_id": "t3_b2mnkv",
            "score": 5,
            "created_utc": 1552942384.0,
            "replies": []
        },
        {
            "body": "Glad it worked out but trust is a like a ship, takes years to build and one hole to sink it.\n\nI would be weary of her even if you want to spend time with her further. She has to earn it from scratch.",
            "author": "captainIsBack4u",
            "id": "eits48v",
            "parent_id": "t3_b2mnkv",
            "score": 10,
            "created_utc": 1552940438.0,
            "replies": []
        },
        {
            "body": "Congratulations for running this down. Most SD victims just melt away and hope for the best. \n\nI hope your cops were liberal in their dispensing justice to this shit bag.  ",
            "author": "GSSD",
            "id": "eitxatx",
            "parent_id": "t3_b2mnkv",
            "score": 4,
            "created_utc": 1552944094.0,
            "replies": []
        },
        {
            "body": "1. the story about her brother is very suspicious\n2. can we watch her beat the shit out of him?\n3. spelling is \"leery\" ",
            "author": "doctorcoolpop",
            "id": "eitzfan",
            "parent_id": "t3_b2mnkv",
            "score": 5,
            "created_utc": 1552945593.0,
            "replies": []
        },
        {
            "body": "I still wouldn’t do it, run OP.",
            "author": "whoami1999",
            "id": "eityi4y",
            "parent_id": "t3_b2mnkv",
            "score": 3,
            "created_utc": 1552944939.0,
            "replies": []
        },
        {
            "body": "This was an inside job!They tried to rob and extort him. Make sure your security system is functioning, and cameras in place both outside and inside the home. Run criminal background checks on both. Search arrest records as well. \n\n\n",
            "author": "agjrpsl",
            "id": "eiuh747",
            "parent_id": "t3_b2mnkv",
            "score": 3,
            "created_utc": 1552959022.0,
            "replies": []
        },
        {
            "body": "I seem to always be the voice of reasoning. This sounds like she set this up or she doesn’t know how to keep her mouth shut. If she told her brother who else did she tell or who did he tell. It’s not illegal for her brother to get mad at her and inform the police his sister is a sex worker and now he knows your info to relate to them. \n\nI would be extra careful around her, it really sounds like she was attempting to make fast money by having her brother doxx you. ",
            "author": "tannedsb05",
            "id": "eiuj79m",
            "parent_id": "t3_b2mnkv",
            "score": 3,
            "created_utc": 1552960579.0,
            "replies": []
        },
        {
            "body": "If you're smart - she's done brother...\n\nYou should have had your investigator show up with a couple of bad-ass Chechens, they would have figured it out...\n\nThis is attempted extortion and robbery - It is NOT simply an overprotective brother snooping through his sisters phone!!",
            "author": "tankbinding",
            "id": "eiu2g4h",
            "parent_id": "t3_b2mnkv",
            "score": 4,
            "created_utc": 1552947791.0,
            "replies": []
        },
        {
            "body": "Amazing result. Thanks for sharing!",
            "author": "HwdSD",
            "id": "eitt1f6",
            "parent_id": "t3_b2mnkv",
            "score": 2,
            "created_utc": 1552941089.0,
            "replies": []
        },
        {
            "body": "Glad you’re back!",
            "author": null,
            "id": "eiul6tu",
            "parent_id": "t3_b2mnkv",
            "score": 2,
            "created_utc": 1552962124.0,
            "replies": []
        },
        {
            "body": "If the brother is as violent as the situation claims, I'm sure this wont be his last try. Be safe abt continuing the SR though. Glad for your happy ending",
            "author": "gabbyisepic00",
            "id": "eiute3w",
            "parent_id": "t3_b2mnkv",
            "score": 2,
            "created_utc": 1552969328.0,
            "replies": []
        },
        {
            "body": "Whoa!  Brilliant use of the PI.  A phone number worth keeping.\n\nViewing this from the limited provided I think you are nucking futz not to suspect the SB but who knows. ",
            "author": "VitaMixSD",
            "id": "eivrh01",
            "parent_id": "t3_b2mnkv",
            "score": 2,
            "created_utc": 1553007396.0,
            "replies": []
        },
        {
            "body": "Great ! Thanks for the update. I’m glad there was a happy ending!",
            "author": "supportiveceo",
            "id": "eitngcw",
            "parent_id": "t3_b2mnkv",
            "score": 3,
            "created_utc": 1552936998.0,
            "replies": []
        },
        {
            "body": "@BusdyPeanuts you know most fists are the same size right?",
            "author": "bossybabedomme",
            "id": "eiw1x2w",
            "parent_id": "t3_b2mnkv",
            "score": 1,
            "created_utc": 1553013922.0,
            "replies": []
        },
        {
            "body": "She beat the shit out of him? Wow. She must be a large woman.",
            "author": null,
            "id": "eiub6ak",
            "parent_id": "t3_b2mnkv",
            "score": 1,
            "created_utc": 1552954401.0,
            "replies": [
                {
                    "body": "Are you surprised a woman could fight 🤷🏽‍♀️",
                    "author": "tannedsb05",
                    "id": "eiuj9pw",
                    "parent_id": "t1_eiub6ak",
                    "score": 1,
                    "created_utc": 1552960634.0,
                    "replies": []
                },
                {
                    "body": "Lol",
                    "author": null,
                    "id": "eiuhb04",
                    "parent_id": "t1_eiub6ak",
                    "score": 1,
                    "created_utc": 1552959106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eitop6b",
            "parent_id": "t1_eitnh1d",
            "score": 38,
            "created_utc": 1552937855.0,
            "replies": [
                {
                    "body": "right, exactly.",
                    "author": "Quinn_amore7",
                    "id": "eiu5q46",
                    "parent_id": "t1_eitop6b",
                    "score": 5,
                    "created_utc": 1552950221.0,
                    "replies": [
                        {
                            "body": "Sounds like the brother doesn't want to wake up with two broken legs.",
                            "author": "OlderSD",
                            "id": "eivhmmn",
                            "parent_id": "t1_eiu5q46",
                            "score": 3,
                            "created_utc": 1553000306.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right. Even if she was totally innocent, she still poses a threat as a vector for information being shared...innocently or accidentally that a known threat can use to hurt OP or his property. Nothing like knowing exactly where someone lives, what they have in their home, what their security measures are like, and when they're going to be on vacation or spending a late evening out. ",
            "author": "901Loser",
            "id": "eitq9rh",
            "parent_id": "t1_eitns2q",
            "score": 9,
            "created_utc": 1552939072.0,
            "replies": []
        },
        {
            "body": "I tell my brother! ",
            "author": null,
            "id": "eiuzrnc",
            "parent_id": "t1_eittwgw",
            "score": 6,
            "created_utc": 1552977122.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eitvl8o",
            "parent_id": "t1_eittwgw",
            "score": 6,
            "created_utc": 1552942863.0,
            "replies": [
                {
                    "body": "Maybe, \"Hey, I met this older guy online. He's loaded. I'm sure he would hate for it to come out that he is seeing me on the side\". \n\nI have no opinion on whether the SB was in on it or not. We really can't know. But not cutting contact is very risky. ",
                    "author": "denardos",
                    "id": "eitx7kw",
                    "parent_id": "t1_eitvl8o",
                    "score": 11,
                    "created_utc": 1552944029.0,
                    "replies": []
                },
                {
                    "body": "That is completely backwards for me; the most honest relationship I have is with my brother even though I have 2 other sisters. I'm more honest with him because he gives the least judgement. However, my dating life is off topic because he would react negatively to me being into older men. My best friend on the other hand is very up to date on his lil sister's love life & can unlock her iPhone via face recognition (they look that much alike).\nI see no point in her informing an ex-bf about a SR.",
                    "author": "bsbdfw",
                    "id": "eiu27au",
                    "parent_id": "t1_eitvl8o",
                    "score": 10,
                    "created_utc": 1552947609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You mean you don't like someone that responds with violence to situations like this? Every guy and girl should be clamoring to find someone like that /s.",
            "author": "sexviewer",
            "id": "eitqv9b",
            "parent_id": "t1_eitoo2z",
            "score": 16,
            "created_utc": 1552939539.0,
            "replies": []
        },
        {
            "body": "I agree.  The brother may back off for now but I'd bet he is butthurt about getting caught and is dreaming of ways to strike again.\n\nWould OP really want an SR where he has to keep a lookout for the brother?",
            "author": "Volturi6271",
            "id": "eiu6jfl",
            "parent_id": "t1_eitpz04",
            "score": 5,
            "created_utc": 1552950845.0,
            "replies": []
        },
        {
            "body": "Sage words. ",
            "author": "VitaMixSD",
            "id": "eivrqmb",
            "parent_id": "t1_eitpz04",
            "score": 2,
            "created_utc": 1553007561.0,
            "replies": []
        },
        {
            "body": "If he browsed her reddit from her phone, it wouldn’t be hard for him to find her posts or what she subscribes to. ",
            "author": "steel_marigold",
            "id": "eiu1yvu",
            "parent_id": "t1_eiu0mk7",
            "score": 2,
            "created_utc": 1552947431.0,
            "replies": [
                {
                    "body": "OP is the SD and we don't know if she(the SB) browses Reddit, or if those dots are actually there to connect ",
                    "author": "Rabb1tH3ad",
                    "id": "eiv3nwh",
                    "parent_id": "t1_eiu1yvu",
                    "score": 2,
                    "created_utc": 1552982854.0,
                    "replies": [
                        {
                            "body": "Ah gotcha.",
                            "author": "steel_marigold",
                            "id": "eiv64f4",
                            "parent_id": "t1_eiv3nwh",
                            "score": 1,
                            "created_utc": 1552986923.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you surprised a woman could fight 🤷🏽‍♀️",
            "author": "tannedsb05",
            "id": "eiuj9pw",
            "parent_id": "t1_eiub6ak",
            "score": 1,
            "created_utc": 1552960634.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": null,
            "id": "eiuhb04",
            "parent_id": "t1_eiub6ak",
            "score": 1,
            "created_utc": 1552959106.0,
            "replies": []
        },
        {
            "body": "right, exactly.",
            "author": "Quinn_amore7",
            "id": "eiu5q46",
            "parent_id": "t1_eitop6b",
            "score": 5,
            "created_utc": 1552950221.0,
            "replies": [
                {
                    "body": "Sounds like the brother doesn't want to wake up with two broken legs.",
                    "author": "OlderSD",
                    "id": "eivhmmn",
                    "parent_id": "t1_eiu5q46",
                    "score": 3,
                    "created_utc": 1553000306.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe, \"Hey, I met this older guy online. He's loaded. I'm sure he would hate for it to come out that he is seeing me on the side\". \n\nI have no opinion on whether the SB was in on it or not. We really can't know. But not cutting contact is very risky. ",
            "author": "denardos",
            "id": "eitx7kw",
            "parent_id": "t1_eitvl8o",
            "score": 11,
            "created_utc": 1552944029.0,
            "replies": []
        },
        {
            "body": "That is completely backwards for me; the most honest relationship I have is with my brother even though I have 2 other sisters. I'm more honest with him because he gives the least judgement. However, my dating life is off topic because he would react negatively to me being into older men. My best friend on the other hand is very up to date on his lil sister's love life & can unlock her iPhone via face recognition (they look that much alike).\nI see no point in her informing an ex-bf about a SR.",
            "author": "bsbdfw",
            "id": "eiu27au",
            "parent_id": "t1_eitvl8o",
            "score": 10,
            "created_utc": 1552947609.0,
            "replies": []
        },
        {
            "body": "OP is the SD and we don't know if she(the SB) browses Reddit, or if those dots are actually there to connect ",
            "author": "Rabb1tH3ad",
            "id": "eiv3nwh",
            "parent_id": "t1_eiu1yvu",
            "score": 2,
            "created_utc": 1552982854.0,
            "replies": [
                {
                    "body": "Ah gotcha.",
                    "author": "steel_marigold",
                    "id": "eiv64f4",
                    "parent_id": "t1_eiv3nwh",
                    "score": 1,
                    "created_utc": 1552986923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like the brother doesn't want to wake up with two broken legs.",
            "author": "OlderSD",
            "id": "eivhmmn",
            "parent_id": "t1_eiu5q46",
            "score": 3,
            "created_utc": 1553000306.0,
            "replies": []
        },
        {
            "body": "Ah gotcha.",
            "author": "steel_marigold",
            "id": "eiv64f4",
            "parent_id": "t1_eiv3nwh",
            "score": 1,
            "created_utc": 1552986923.0,
            "replies": []
        }
    ]
}